[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Trilogy Metals to hand over  stock to the U.S. Government. These are capitalist companies who are  doing business that they claim this government supports. Trump is also  considering forcing Lockheed Martin to do the same.\n\nWhy are my colleagues, who are so quick to tout their capitalist  leans, silent when Trump follows China's communist tactics? The…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…and will continue to discourage  Americans from serving our Nation.\n\nFifth, this NDAA authorizes expanded military cooperation between the  United States and Israel that, considering the Israeli military  campaign in Gaza that has killed approximately 70,000 Palestinians, I  do not support. To be clear, I have always supported and continue to  support…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…Now, the  Trump family crypto mining scheme is going public as their payouts grow  larger.\n\nThis is more than a conflict of interest. It is blatant corruption.  He is now considering accepting a $400 million jet from Qatar dubbed a  ``palace in the sky.'' How is this even ethical? Even some of my  Republican colleagues agree that not only is this wrong,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691208/ending-pay-for-play-political-gifts"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…veterans have access to care and  treatment for diseases they may have been exposed to as a part of their  service. However, I must note that the context in which we are  considering this legislation is vastly different than the last time the  bill was considered by the House just under 7 months ago.\n\nIn fact, under Secretary Kennedy's leadership in…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689624/vietnam-veterans-liver-fluke-cancer-study-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "Mr. Speaker, today, we are considering S. 222, the Whole Milk for  Healthy Kids Act of 2025.\n\nSchool meals play a critical role in reducing child hunger and  providing children with the healthy food they need…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698183/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…the nomination.\n\nMr. Speaker, imagine everyone's surprise when Donald Trump decided to  then make him the United States pardon attorney overseeing a large  office of people considering pardon applications from across the  country.\n\nIs that someone that I think can be trusted to deal fairly in terms  of minority groups, such as Jewish Americans, African…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. Speaker, I appreciate that we are considering S. 2392, the  Veterans' Compensation Cost-of-Living Adjustment Act of 2025 today. I  rise in strong support of the measure, and I thank Senator Moran for  introducing the…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696762/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "Mrs. McBATH. Mr. Speaker, I thank the ranking member of the Committee  on Education and Workforce for yielding time.\n\nMr. Speaker, I have to say, today, we are here considering a bill  that is named the PROTECT Our Kids Act. I am going to speak and shift  this conversation a little bit in the direction I think we really need  to go.\n\nThis bill,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697534/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…somebody that is a  criminal, then maybe you need to talk to their associates. That is  exactly why maybe she was getting text messages. I am not saying she  was or wasn't, but considering the fact that they were talking to  another associate of the President's, and maybe she needed intel, you  would have to go talk to somebody who maybe knows what he is up…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696889/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Republican after Republican tell us how much the  majority doesn't trust the Trump administration. It is as if Trump  doesn't control the CFPB.\n\nMr. Speaker, the regulation we are considering now is just a  regulation that says that this is an area we are going to look at.  Republicans are afraid the Trump administration will look at it. It  doesn't do anything…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689952/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "Mr. GARCIA of California. Mr. Speaker, we are considering today the  first of four bills which represent a serious violation of the rights  of Washington, D.C., and the democratic process.\n\nMr. Speaker, we know that D.C. has more…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695557/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…urge my colleagues to support the bill. I reserve the balance of my  time.\n\nMr. PALLONE.  Mr. Speaker, as you can see, a lot of these consumer protection  bills that we are considering today are actually very important, as is  this. I urge bipartisan support and yield back the balance of my time.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690218/youth-poisoning-protection-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…the efforts of every single elected Member of Congress  would now be at risk to one person's view and one person's decision.\n\nLater today, I am pleased to say the House is considering whether to  override the President's veto. They are putting it on the floor of the  House.\n\nI congratulate the work of Congresswoman Boebert and Congressman Hurd  and the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698766/9999"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…decided to bypass Congress and take both the taxing power  and the trade power into his own hands without a debate, without  committee hearings, without deliberation, without considering what the  people thought about the plan, and that one man and his decisions have  taken a chain saw to the American economy.\n\nWe must turn this around, and the good news…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…literacy tests at the ballot box.\n\nHe states:\n\nIndividuals who aren't informed about issues and platforms       . . . have no business voting.\n\nThe fact that we are even considering his nomination under the  circumstances is shocking.\n\nLiteracy tests have been tried in America. They are a racist relic  from the Jim Crow era that we used to prevent immigrants…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693940/judicial-nominations"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…have to bail out the car companies? Are we going to  bail out everybody that is going to be hurt by these tariffs?\n\nIt is not a good idea.\n\nThe administration is currently considering a bailout for farmers.  The idea that the American taxpayer will have to bail out an industry  to dull the pain of tariffs is not a novel one. We have seen this one.  We…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…the process  now, thanks, in large part, to her efforts and certainly the efforts of  the ranking members and chairs of the two committees whose legislative  work we are considering today.\n\nIt is important to recognize that these bills together reduce  funding. They actually reduce funding. A CR would actually cost us  more. They also update, refine,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…makes significant strides in ensuring clarity       in the regulatory process. For these reasons, NAHB       respectfully urges passage on the House floor.\n\nThank you for considering our views.            Sincerely,                                                   Lake A. Coulson.\n\nMr. BEAN of Florida. Mr. Chair, this has been a model. This program…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…sticking to the facts instead of  Democratic talking points.\n\nMr. Speaker, I was just thinking about what we are talking about. The  notion that my colleagues are really considering voting against the  SUPPORT for Patients and Communities Reauthorization Act is baffling to  me. Really, I think it all shows that they hate President Trump so much  that…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…that is durable and  shows that we are committed, day in and day out, to choking off any  financial support to Iran's malign activities.\n\nThat is why, today, the House is considering the Solidify Iran  Sanctions Act, which would eliminate the upcoming 2026 sunset from the  Iran Sanctions Act.\n\nWe need to send Iran a clear and simple message. They cannot…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690688/solidify-iran-sanctions-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…to regular order, and this majority is  continuing to push forward with the America First agenda, the American  people's agenda.\n\nAll of these pieces of legislation we are considering today are in  alignment with the American people's demand and President Trump's  executive orders that we maintain a robust posture of American energy  dominance.\n\nYou know,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696900/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…work in keeping this  program online and on track to be here today. I thank all the members  of the subcommittee because we would not be here without them.\n\nThe bill we are considering today has a total base discretionary  funding level of $26.3 billion. However, when compared to FY 2025  enacted levels for non-Defense discretionary spending, this bill…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699055/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…rules  running the socialized healthcare system in Canada.\n\nYet getting an appointment with a specialist isn't possible because  no one is accepting new patients. Now she is considering ``medical  assistance in dying'' because Canada's healthcare system doesn't have a  surgeon or a specialist that she needs to get that lifesaving care.\n\nAmerican conservative…", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698485/healthcare"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…it, and  how many licenses go unused. The bill will also provide Congress with  better insights into how our Federal agencies purchase and use  software.\n\nThe text we are considering today is identical to the text we passed  out of the House by voice vote last Congress. This bill improves  government software purchasing without unduly limiting the procurement…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698153/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…important for a few different reasons. No. 1, it will  allow us to use the savings that DOGE is identifying in order to offset  the costs of the tax bill that we are currently considering, allowing  us to send even more money back to the American people. Any money we  can save from wasteful spending, obviously, can be sent back or kept by  the people who…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "John Thune", "party": "Republican", "sentence": "…National Defense  Authorization Act of fiscal year 2026, and the Appropriations Committee  under Chair Collins has reported out four bipartisan bills, which we  will begin considering this week.\n\nI said last year that I was committed to bringing appropriations  bills to the floor through regular order, and we are in the process of  doing exactly that.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693870/trump-administration"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Secretary of Health and Human Services shall--\n\n(A) publish draft guidance;\n\n(B) provide a period of at least 60 days for comment on the       draft guidance; and\n\n(C) after considering any comments received and not later       than one year after the close of the comment period on the       draft guidance, publish final guidance.\n\n(c) Applicability.--Section…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…L.A. Times dutifully publishes a headline referring  to the complaint by the former FEC chair related to Prop 36. Then, they  went and showed that article to anyone who was considering supporting  the initiative in order to try to deter them from doing it.\n\nMr. Speaker, the FEC rejected Ms. Ravel's complaints since it was  completely made up. This was…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…administered  through the mail, where abusers and traffickers can exploit others.\n\nUntil these safety protections are restored, I want to speak directly  to any woman who is considering taking the abortion bill: Please  reconsider.\n\nI thank my colleagues--30 pro-life Senators--who are joining me in  reintroducing the SAVE Moms and Babies Act. It is so important.…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699389/rounds-mr-wicker-mr-lankford-mr-mcconnell-ms-lummis"}, {"senator": "John Thune", "party": "Republican", "sentence": "…bills through regular order and  passed three Senate appropriations bills before the August work period,  something that hadn't been done going back to 2018.\n\nWe should be considering bills through regular order, a process that  allows all Senators an opportunity to make their voice and the voices  of their constituents heard. It is not just a better…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698828/appropriations"}]