[{"senator": "George Latimer", "party": "Democrat", "sentence": "…that the project's contracting policies violate  administration policies on diversity, equity, and inclusion.\n\nLast week, the Gateway Development Commission announced that  construction will have to cease if President Trump does not swiftly  restore the project's funding. If construction is delayed, thousands of  union construction workers will lose their…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699542/unfreeze-funds-for-gateway-tunnel"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Folks in the Northeast are worried about their rising electric bills  because the President in December arbitrarily terminated five offshore  wind projects that were under construction. That energy onto the grid  would have helped keep the pressure on lower electric bills.\n\nThe President canceled final approval for what would have been the  Nation's largest…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698568/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…that we must vigorously fight against.\n\nThe termination of TPS also threatens Boston's economy as       they are our essential workers in healthcare, food service,       construction, childcare, transportation, and home health       care. As a result, we have begun to hear that employers       across the city are already experiencing related workforce…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…climate secrets.\n\nThis legislation would let tech moguls bulldoze right through these  waters with industrial-scale operations--massive drill rigs, heavy  machinery, and construction fleets--all without the environmental  review that everyone else would have to undergo.\n\nThe sponsors insist that these undersea cables are just little  needles in a haystack,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Greg Casar", "party": "Democrat", "sentence": "…paychecks for CEOs and  their political friends.\n\nThey thought that working people could do nothing about this. They  thought their workers were too divided to push back. On construction  sites, guys who spoke different languages and who came from different  places were pissed off, and they were willing to put their differences  aside to come together and…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689085/economic-populism"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Nation.\n\nMr. Whittington was a U.S. Navy veteran and served as a member of the  Seabees during the Vietnam war. He made honorable contributions to the  fight as a member of a construction unit, and he never forgot the dark  moments of the Vietnam war.\n\nIn fact, when he returned home from Vietnam, he was one of those  individuals who was harassed by the anti-Vietnam…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693460/congratulating-kendall-pierson"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…on the District of Columbia considered, and rejected, the       very argument that critics of the D.C. Admission Act are       raising today, reasoning that the ``true construction of [the       District Clause] would seem to be solely that Congress retain       and exercise exclusive jurisdiction'' over territory       comprising the ``seat of government.''…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…home of the most-watched local  news broadcast in Philadelphia, Action News, a title which the station  and program have held for nearly 50 years. In 2009, he oversaw the  construction of a state-of-the-art, 110,000 square foot digital  broadcasting facility next to the station's previous home. His  unwavering commitment to his work has ensured that throughout…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698974/recognizing-bernie-prazenicas-retirement-as-president-and-general-manager-of-wpvi-tv"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…are going to build back better. We  are going to make sure that the Palisades does not burn again. We have  a very strict fire building code that is applicable to all new  construction in the Palisades and other fire-prone areas.\n\nMr. SHERMAN. Mr. Speaker, my party has put confidence in me and made  me the chief Democrat dealing with the Subcommittee on…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…were a year ago.\n\nThe average new car price just crossed $50,000 for the first time in  our Nation's history. Investment bank UBS reports that tariffs have  increased home construction costs by $9,000, and we have an affordable  housing crisis in the United States in every State.\n\nAnd Ashley Furniture, the largest U.S. and, indeed, global furniture  manufacturer,…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696448/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…am pretty sure nobody has  extra money for a new car.\n\nHousing costs--one of the biggest drivers on inflation, but President  Trump's tariffs would drive up the cost of construction material,  making it even more expensive to address our housing shortage, slow our  new home construction, and one analysis found that tariffs could push  home construction…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…after the tariffs  were announced that it would raise the average cost of a new home by  $11,000 because of the fact that so many parts and pieces that go into  new home construction are imported. That is just a reality in our  economy.\n\nWhen we talk about the cost of living and affordability, if anything  is close to maybe groceries, it is the cost…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696749/congress-must-take-action-on-tariffs"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…trying to do in the shadows.\n\nMr. Speaker, you will hear about the specific rules that this  administration has rolled back, rules that put home care aides,  farmhands, construction workers, workers with disabilities, minors, and  so many more at risk. As you hear about these rules, ones that don't  always get a lot of attention but that matter so much…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Ms. DeLAURO. Mr. Chair, I thank the ranking member for yielding. I  thank all of the Military Construction and Veterans Affairs  Subcommittee staff on both sides of the aisle for their work, and in  particular Farouk Ophaso and Tyler Coe.\n\nI am opposed to this bill, which will…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692957/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…largest economy in the world. And we  have a plan to decarbonize nearly every sector of our economy, from  transportation to electricity, to manufacturing, to agriculture,  construction, and buildings.\n\nIt is that long-term vision that has diversified our energy sources  so that after seasons of extreme weather, we can still take advantage-- more importantly,…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…American people.                             Supporting Veterans\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, the House will vote on our  2026 appropriations bill for the military construction and veterans  affairs programs.\n\nOur Active-Duty servicemembers and our veterans have given so much to  our Nation to ensure that we remain safe and free. It is now our…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692792/operation-midnight-hammer-success"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…consume.                                General Leave\n\nMr. WESTERMAN.  131.\n\nMr. WESTERMAN. Mr. Speaker, H.R. 131, the Finish the Arkansas Valley  Conduit Act, facilitates the construction of the Arkansas Valley  Conduit, or AVC, by easing the repayment requirements for project  beneficiaries.\n\nThe AVC is designed to provide potable water from Pueblo Reservoir…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698703/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…rejected that.\n\nNow, on the proxy voting, every one of our friends in the back  listening had to show up here. Every one of them had to physically come  here. I am in the construction business. Do you think the electrician  could vote by proxy to get the house wired? Do you think the dentist  could vote by proxy to get the teeth fixed and fillings filled?…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689410/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "Mr. CALVERT. Mr. Chair, I thank the gentleman from Texas for yielding  me time.\n\nMr. Chair, I rise in support of the fiscal year 2026 Military  Construction, Veterans Affairs, and Related Agencies Appropriations  Act. It is fitting that the appropriations bill to come to the House  floor this year is one that fulfills our highest…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692941/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Expansion Act  of 2025, was included in the Housing for the 21st Century Act. My bill  removes an outdated Federal chassis requirement that has stifled  manufactured housing construction for decades.\n\nWhen we hear the term ``manufactured home,'' many people still think  ``mobile home.'' That is because Federal law has forced us to adhere to  a permanent…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699802/housing-for-the-21st-century-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…the President is urging.                 Continue Building World's Strongest Military\n\nMr. MEUSER. Mr. Speaker, I rise today as we are voting on the fiscal  2026 Military Construction, Veterans Affairs, and Related Agencies  Appropriations Act, an essential bill that demonstrates our unwavering  commitment to our veterans, military families, and national…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692937/american-economy-gaining-momentum"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…projects that an activist judge has placed on hold in our communities  that they desperately need, like stormwater, schools, and even sewer  treatment plants not under construction, protecting our most precious  environments. But we can't unless the permits can be issued.\n\nThis is about predictability, federalism, and letting the States  manage their…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698027/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…has happened? Government decided to solve what socialists viewed  as problems.\n\nTo solve suburban sprawl, the socialists began imposing severe limits  and costly fees on construction permits. Builders could no longer  profit from building vast numbers of affordable homes, so they focused  their limited permits on the pricier models.\n\nTo solve climate…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697036/government-is-still-the-problem"}, {"senator": "John Carter", "party": "Republican", "sentence": "…It is a timely reminder of the commitment  our Armed Forces personnel have made and the responsibility we have to  take care of those who serve our Nation.\n\nThe military construction and veterans affairs component of the  legislation meets that goal. The legislation includes $133.3 billion  for the Department of Veterans Affairs, including $113.8 billion…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696733/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…amendments included in this package today ensure our Nation keeps  its sacred promise to those who have served our great country.\n\nFrom providing additional funding for the construction of new State  extended care facilities to increasing funds for medical and prosthetic  research, and from reducing the backlog at the Board of Veterans'  Appeals to providing…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692951/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…the conduit,       notwithstanding the reclamation laws or any other provision       of this Act. The contract payments shall consist of--\n\n``(A) funding provided during construction from any entity       other than the Secretary; and\n\n``(B) based on a demonstration of financial hardship, as       determined by the Secretary, repayment of the balance…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693879/finish-the-arkansas-valley-conduit-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…program providing free veterinary care for  Native Americans and their animals on Navajo and Zuni reservations. In  partnership with various Zuni organizations, ANA began construction of  a fully self-sustainable veterinary clinic--a vital step toward  achieving their goal of equipping these communities with the resources  needed for self-sufficiency.…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694745/recognizing-bucks-county-americans-for-native-americans"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…successful, comprehensive  campaign in history, increasing the endowment by 67 percent, and under  his leadership, the college completed major capital improvements,  including the construction of the Lillis Athletic & Wellness Center,  renovation of Rock Bowl Stadium and Keane Hall, and the construction of  the Tucker Tennis Complex. Collins also expanded graduate…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694164/congratulating-loras-college-president-james-collins-on-his-retirement"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…title VI of the Research and Development,       Competition, and Innovation Act (enacted as division B of       Public Law 117-167 (42 U.S.C. 19231 et seq.)).\n\n``(k) Rule of Construction.--Nothing in this section may be       construed to amend, alter, or affect the authorities of the       Secretary to define, establish, or enforce new environmental…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…140  organizations in support of H.J. Res. 140. These groups include the  Minnesota Chamber of Commerce, Minnesota Power, MiningMinnesota,  Minnesota State Building and Construction Trades Council, Ely Public  School District, Jobs for Minnesotans, Laborers' International Union of  North America, and more.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}]