[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…hire more employees.\n\nNow, when those markets are shut off to them and those countries  respond to these unnecessary tariff wars provoked by President Trump,  they don't stop consuming. Whether it is fruit, vegetables,  electronics, or otherwise, they just find somewhere else to get it.  When those other countries, those other markets, find a replacement…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "Ms. DEAN of Pennsylvania. Mr. Speaker, hunger is an all-consuming  pain. Many of us are lucky never to have known that pain. Yet, in my  district alone, nearly 25,000 households rely on food assistance to  stave off hunger. SNAP feeds seniors…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690833/hunger-is-all-consuming-pain"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…first person to ever have been impeached was a judge, and it  wasn't because there was a constitutional crisis. It was because of his  behavior on the bench and because he was consuming alcohol at a time  when he should have been taking his lofty position and adjudicating  appropriately.\n\nThere was no constitutional crisis. Not only do you not need a  constitutional…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…child. She has rebounded wonderfully, and she will be happy  to know that going forward she will have an alternative. She doesn't  have to contend with her belly aching after consuming something her  body simply couldn't digest. Because the school offered no alternative,  it was this or nothing. As you know, in many cases, our young people  will get nothing…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698179/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…electricity as is used by more than 100 million American homes. Do you  want to hear that again? This is all going to happen in the blink of an  eye. They are going to be consuming as much electricity as 100 million  homes in our country.\n\nOn the supply side, well, Trump is cutting off our cheapest and  quickest-to-deploy sources of energy that can…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696132/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…know why the administration and  Republicans want to make it more difficult to receive Social Security  rather than strengthen Social Security.\n\nInstead of a wasteful, time-consuming, silly bill like this, why  don't we work together and bring to the floor a bill that will  strengthen Social Security? That would be a help to our neighbors back  home.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689260/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…the  Federal Government, they invest considerable time and resources into  making their submission the best it can be. They are also forced to  navigate a complex and time-consuming contracting process while  balancing their other important responsibilities.\n\nLast year, the Small Business Committee heard testimony from a small  business owner who said…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691761/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…think that we ought to spend whatever time is necessary  on this bill. But I understand that leadership is concerned about time.  And so my proposal strips away all the time-consuming procedural  stuff--I have another word for it--but it allows us to go forward  expeditiously. One vote scheduled entirely at Majority Leader Thune's  discretion, before the…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…country where investment and  innovation unlock cures and treatments--some of them we even refer to  as miracle cures. But the escalating prices of prescription drugs are a  consuming concern for millions of Americans, including in my State of  Iowa, where they bring up this very subject regularly at my county  meetings.\n\nThere are many reasons for the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694205/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Building (January       26, 2021) and DOI 512 DM 4 (2015), and DOI 512 DM 5.\n\nThe Proposed Rule Exceeds BLM Authority: This proposal       creates a new, burdensome, and time-consuming administrative       process for reviewing oil and gas related development       activities that are contrary to the needs and purposes of the       NPR-A. The proposed rule…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…we ever give them credit for. Hell,  I think they are much smarter than we are. Maybe we can tell them the  truth. We have got a problem. Interest and healthcare costs are  consuming this society, consuming this government. You start to take a  look at the debt outlays, and you start to see, well, Social Security  taxes, oh, they are up 8.3 percent over…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…spells out errors on  tax forms and helps taxpayers not only understand the mistake but also  allows a challenge if they see fit.\n\nFiling taxes is already burdensome and time consuming. We can improve  customer service by promoting open and transparent communication  between the IRS and the taxpayer when a tax error is identified.\n\nMr. Speaker, I will continue…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689360/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…perspective. Israel's       monumental accomplishments and gained substantial power--      though still vulnerable--since its fragile 1948 establishment       in the Holocaust's consuming shadow are promising. However,       its internal conflicting core issues demand resolution and       reconciliation to guarantee a robust democracy in a       pluralistic…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690665/israel-at-77"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…these snacks is nearly identical  to Oreos, Doritos, or Skittles. Little do kids know that these products  are laced with intoxicating synthetic chemicals. Young children are  consuming these snacks thinking they are candy, not poison.\n\nOn top of that, these products are easily accessible and can be  purchased at convenience stores. Some of them are even…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694557/9999"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…their life. They are going from job to job and  working all the time. You would rarely see Thunberg syndrome in, say,  somebody with four kids, because four kids is very time-consuming. You  have to earn money to take care of the kids, spend time with the kids.  That is a purpose in life.\n\nI think, as we have more and more young, single people not having…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…with here. The Iranian regime is  the world's foremost sponsor of terror. They have funded monsters,  sponsored violence, and sewn chaos far beyond their borders. Their all- consuming obsession is the obliteration of America's principal ally in  the Middle East, and they have avowed death to America itself.\n\nIt is, therefore, deeply disturbing to see the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692744/iranian-regime-is-worlds-foremost-sponsor-of-terror"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…start to telegraph to the bond markets we are going to do something  serious, at what moment does the bond market say: Screw these people.  They are just not serious. They are consuming the world's capital.  Let's charge them more.\n\nMr. Speaker, do you really think the United States with our  exorbitant privilege of having the world's reserve currency and…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Lessons, students learn the farm-to- table concept by preparing the soil, planting seeds, nurturing the  seedlings into mature plants, harvesting and finally preparing and  consuming fresh produce. They learn the life cycle of plants and the  value of working for your food. In addition to leading students, Bob  recruits and manages his Garden Crew; a…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691924/recognizing-robert-obrien"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…outrageously  expensive add-ons like solar panels and hermetically sealed windows.\n\nTo solve their environmental angst, they required pointless studies  that were endlessly time-consuming and outrageously costly along with  backbreaking, outrageous environmental fees, adding many tens of  thousands of dollars to the costs that were all passed on to helpless…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697036/government-is-still-the-problem"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…small arms primer without any kind of propellant. Classifying       a less-than-lethal projectile device as a ``firearm'' makes       it more difficult, costly, and time-consuming to manufacture       innovative new technologies for law enforcement.       Additionally, law enforcement officers can be unfairly       subjected to higher levels of liability…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…reduced  cardiovascular risk, lowered blood pressure, reduced hunger cravings,  reduced type 2 diabetes risk, and increased sleep quality.\n\nAdditionally, children are not consuming the amount of dairy  recommended by the Dietary Guidelines for Americans and are not getting  these important benefits and nutrients. The Dietary Guidelines Advisory  Committee…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698178/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…supply.\n\nHowever, in order to access and maintain this critical water  infrastructure, the City must perpetually reapply for special use  permits from the Forest Service, a time-consuming and expensive  process.\n\nIn addition to wasting time and personnel resources, the renewal  process is estimated to cost the City at least $150,000.\n\nBetween 2010 and 2020,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697754/dalles-watershed-development-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Republican bill helps American energy workers compete  globally.\n\nRepublicans also rolled back punishing Biden regulations. Those  regulations were burdensome, expensive, and time-consuming. By reining  in Biden's heavy-handed bureaucrats, we have saved the American public  $180 billion. That pencils out to over $2,000 in savings for each and  every working…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698252/nominations"}]