[{"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "President, today I rise to join my constituents in  New Hampshire, including those at the St.", "title": "Welcoming Ecumenical Patriarch Bartholomew", "date": null}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "On behalf of my constituents in New Hampshire's First Congressional  District, I recognize Dinah Whipple for her selflessness to New  Hampshire's community and history.", "title": "Recognizing Dinah Whipple", "date": "2025-02-27"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "Now, as I visit with constituents from across New Mexico--and last  night, Senator Merkley, I had a townhall, a telephone townhall.", "title": "Trump Administration", "date": "2025-10-21"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "On behalf of my constituents in New Hampshire's First Congressional  District, I wish Chief McLin well in his retirement, thank him for his  commitment to the people of Somersworth, and congratulate him on a job  very well done.", "title": "RecognizingMc the Achievements and Retirement of Somersworth Police Chief Timothy J. Lin", "date": "2025-02-26"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "Speaker, I rise today to recognize and thank Andrew  Heineman for nearly seven years of outstanding service to the  constituents of New York's 12th Congressional District and to the  United States House of Representatives.", "title": "Recognizing Andrew Heineman and His Service to the United States House of Representatives", "date": "2026-01-08"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "Well, let me tell you this: When you strip healthcare away from  290,000 New Mexicans, many of which are in my district, including  132,000 children and 26,000 seniors, can anybody on the other side of  the aisle tell me how is that making life better for my constituents  and for New Mexicans?", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-02-25"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "President, in response to the request from the majority  leader--the Republican leader--on behalf of constituents from South  Dakota, constituents from New Mexico that don't--do not, so that I am  clear; sometimes people confuse my New Mexico accent--that do not want  to see their health premiums double and triple and bankrupt them--and  some people that can't afford to get insurance won't be as lucky as me,  where I survived a stroke 3 years ago.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the United States Fish and Wildlife Service Relating to ``Record of Decision for the Barred Owl", "date": "2025-10-29"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "Back in October, one of my constituents from New Boston, NH, Darla,  contacted me with serious concerns about whether she and her husband  would be able to afford healthcare coverage without the enhanced  premium tax credits.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "On behalf of my constituents in New Hampshire's 1st Congressional  District, I thank Tess Kuenning for her selflessness and dedication to  the patients she serves.", "title": "Recognizing Tess Kuenning", "date": null}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "On behalf of my constituents in New Hampshire's First Congressional  District, I want to congratulate Northeast Delta Dental for their  remarkable achievement.", "title": "Recognizing the Achievements of Northeast Delta Dental", "date": "2025-02-26"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "To the American people and my constituents in New Mexico, I urge you  to engage in the public commenting process and make sure that your  voices are heard.", "title": "Cloture Motion", "date": null}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "On behalf of my constituents in New Hampshire's First Congressional  District, I want to congratulate the Gibson Center for Senior Services  for achieving this incredible milestone.", "title": "Recognizing the Gibson Center for Senior Services Serving Two Million Meals", "date": "2025-05-29"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "On behalf of my constituents in New Hampshire's 1st Congressional  District, I thank Bill Cass for his commitment and dedication to  helping improve New Hampshire's transportation for the past 35 years  and his 40 years of public service dedicated to New Hampshire.", "title": "Recognizing William ``bill'' Cass, Commissioner of New Hampshire Department of Transportation", "date": "2026-01-21"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "Speaker, I rise today to thank Alison Cohen for two  and a half years of outstanding service to the constituents of New  York's 12th Congressional District.", "title": "Recognizing Alison Cohen and Her Service to the U.S. House of Representatives", "date": null}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "Speaker, I rise today on behalf of the  constituents of New York's 23rd Congressional District to recognize a  true cornerstone of our community.", "title": "Recognizing the Jewish Community Center of Greater Buffalo on its 80th Anniversary of Service and Community Leadership", "date": "2025-07-16"}]