[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Colorado Mountain       Club; Colorado Wild Public Lands; Conservation Colorado;       Conservation Lands Foundation; Conservation Minnesota;       Conservation Northwest; Conservatives for Responsible       Stewardship; Crow River Trail Guards.\n\nCURE; Earthjustice Action; Earthworks; EcoFtight; Elders       Climate Action; Endangered Species Coalition;…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…before casting our votes.\n\nI was assured that nothing had changed. There were no agreements  made.\n\nThen the very next Republican speaker, who is one of those hard-line  conservatives, gave the game away and said he was flipping his vote  because of the agreements that were made. Backroom deals deny the  American people the transparency that they deserve.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691513/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…further by the rapid cuts and chaos of       Trump's first two months in office. Many current and former       officials fear the push is part of a long-sought effort by       conservatives to privatize all or part of the agency.\n\n``They're creating a fire to require them to come and put       it out,'' said one high-ranking official who took early       retirement…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…rampant fraud within  Social Security; they just want to cut people's benefits. Never mind  that it is popular--overwhelmingly popular--with Democrats,  Republicans, liberals, conservatives, rural people, suburban people,  urban people.\n\nWhy are they doing this, then? Why are they going after something  that has been as sacred as Social Security since Franklin…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689776/social-security"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…politics, but the issue that we are talking about here today is how to  bring Democrats and Republicans together, because as Democrats and  Republicans and liberals and conservatives we do have a mutual interest  in survival. If nuclear weapons are ever used in this current day, then  nobody wins.\n\nWhat we are talking about is the salvation or the destruction…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…medical decisionmaking in  America. I thought a belief that families should be able to make their  own decisions for their own children was something that united Liberals  and Conservatives.\n\nThese are hard and often agonizing decisions that loving American  families in our country face. Our colleagues now want to invite the  Federal Government to come barging…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698345/protect-childrens-innocence-act"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…enrich himself and his  billionaire allies while everyday, hardworking Americans pay the bill.\n\nI just have to ask, Madam Speaker: Where are the so-called  constitutional conservatives? Will even one of my colleagues on the  other side of the aisle find the courage to stand up? Have they not  learned that cowering before this man only works until he decides…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694808/northeast-ohioans-are-getting-squeezed"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…this body, on both sides  of the aisle, embrace the very somber responsibility of encouraging and  supporting the laws of our land.\n\nYet, we find ourselves in a position as conservatives where our  warnings of the past echo upon a nearly empty Chamber as we discuss the  horrors of the day and the crimes that have been committed upon the  citizens we are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…having a decent revenue stream  is most important.\n\nHowever, he did lay out what is going to be a future conflict within  the Republican Party, and it is important that our conservatives are  aware of it.\n\nPresident Trump is conscious of the fact that as revenue comes in  from the tariffs, there are people who are going to want to spend it  and people who…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700208/president-trumps-great-speech"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…Government Surveillance, and supported by Members of  both parties who understand that freedom collapses when the law becomes  unknowable.\n\nThis bill is co-led by staunch conservatives like Representative Roy  and myself and our colleagues, who occasionally think differently than  us, Mrs. McBath and Mr. Cohen. We disagree on a lot in this Chamber,  but…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697204/count-the-crimes-to-cut-act"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…historically illiterate podcasters and so-called  influencers use the term ``neocon'' as an all-purpose slur for anything  they don't like. But the neocons were just that, new conservatives, a  collection of anticommunist liberals between World War II and the  Vietnam war who were, as the saying goes, mugged by reality--in this  case, the reality of the New…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698421/unanimous-consent-requests-the-calendar"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…investigations now going on. Justice Department now  is diving into these folks, so there is more going on here.\n\nI will argue, Mr. Roy--and some of our friends who are fiscal  conservatives but also want to modernize the delivery of services, help  me. We have spent almost a year diving into the data. What would happen  if fixing these misalignments, the waste…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…electoral system and say: There is  nothing to see here, no issue, no problem. But that is what they said  about wide-open borders. That is what they said about censoring  conservatives online. That is what they said about the botched  Afghanistan withdrawal. That is what they said about President Biden's  cognitive decline. They were wrong on all those…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…even care enough to try.\n\nThe 77 million ``deplorables'' who cast their lot with Donald Trump  last November were the forgotten Americans--the blue-collar patriots,  the conservatives of the heart, miners, mechanics, tradesmen, and  farmers; men and women who worked with their hands, grew our food,  built our homes, and drilled our fuel, whose labor…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…any respect.\n\nMr. Speaker, every single one of them needs to be deported.  Thankfully, we have a President who is actually doing that.\n\nFor so long, Democrats have called conservatives conspiracy  theorists. They have slandered us for saying that the Democratic  playbook, which they themselves have articulated, is to open up our  borders to ultimately…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692317/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…that President Trump adopting Elizabeth  Warren's idea on capping credit card interest rates--it is literally  what the President said over the past week. They are not the  conservatives that I thought they were. Anybody that thinks this is a  good idea will not speak truth to this President to say: You can't do  that. If you want to unbank or underbank…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…it.\n\nHere is the problem. This chart shows you what we are dealing with. A  whole lot of people are saying: Well, Chip, you and all of these fiscal  hawks, these fiscal conservatives, you guys want to do all of these  massive cuts, and we can't do it. It is crazy what you want to do.\n\nLet me be clear what we are talking about. We are currently running…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…$1.5 trillion in waste,  fraud, and abuse from our Federal budget.\n\nThis is something that should receive bipartisan support. Our  commitment to fiscal discipline is clear. Conservatives on the Budget  Committee added a provision that incentivizes a total of $2 trillion in  reductions.\n\nMr. Speaker, the American people are begging for Washington to unlock…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688049/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the math?\n\nMr. Speaker, we have been collecting every article we can that talks  about--and some of these are Republicans. Some of these are Democrats.  Some of these are Conservatives. Some of these are just academic  economists.\n\nHere is one that talks about the growth of males of prime age in  Medicaid. What is fascinating about this particular study…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…enforcement, so much  that you can bite off a finger of an ICE agent and nothing will happen  to you? I believe what it is, is a psychological problem. It is  something that a few conservatives in the areas of psychology and  psychiatry have to identify. I will refer to it as ``Thunberg  syndrome.'' You may remember the little girl who, about 10 years ago,  became…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…colleague is right. Our ideas are old in the sense that  individual liberty and fiscal responsibility are ideas that have  withstood the test of time. That is something that conservatives  recognize.\n\nThe city of Washington, D.C., does not adhere to those ideas. If they  would like to pursue a more responsible budget, I think that we would  all be thrilled.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…that illegal  immigrants could no longer vote to keep Democrats in office.\n\nThey oppose this bill because it chips away at their voting base,  plain and simple. For years, conservatives warned that this was the  radical left's goal, and we were mocked for it.\n\nThat is exactly what Democrats are doing right now, fighting to allow  illegal aliens to vote.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700004/veterans-accessibility-advisory-committee-act-of-2025"}]