[{"senator": "Al Green", "party": "Democrat", "sentence": "…think that  we should stand by, we, meaning the people who agree with me. People  who don't agree, they will do what they do. That is okay with me.\n\nI am going to vote my conscience. I ask others to vote theirs. Just  vote your conscience, that is all I ask. If we vote our conscience, I  hope that in the end, maybe not today, but someday--Stevie Wonder…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "Mr. KHANNA. Mr. Speaker,   Thomas Massie and my Epstein Files  Transparency Act led to millions of files being released that have  shocked the conscience of the Nation.\n\nToday, I call for Congress to hold in front of the Oversight  Committee every single person who emailed about going to Epstein's  island. They need to answer…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699688/there-cannot-be-two-tiers-of-justice-in-america"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…vicious cruelty. John Lewis didn't do that when he advocated against  the most horrific racists. He didn't take on words of hate. We have got  to appeal to colleagues of good conscience, not to let--as this person  says, no Medicaid cuts; no Medicaid cuts.\n\nI know President Trump has said that Medicaid cuts are off the table.  He said that over and over…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…vote to have the  articles move forward will vote against tabling the Articles of  Impeachment. Then we will let the record stand, and I suggest to  everyone to vote your conscience. I will be voting to avoid tabling  these Articles of Impeachment.\n\nI am going beyond these Articles of Impeachment. I am going to file  additional Articles of Impeachment…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692296/and-still-i-rise-denouncing-the-presidents-authoritar-ianism-and-recognizing-the-impeachment-warriors"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…vote, whether it is fighting unjust wars, whether it is  working to eradicate poverty, whether it is standing up for the  constitutional rights of every American, as the conscience of the  Congress, we will continue that legacy.\n\nMr. Speaker, it is now my pleasure to yield to our chairwoman, the  Congresswoman from New York (Ms. Clarke).\n\nMs. CLARKE…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…Departments of Labor, Health and Human  Services, Education, Transportation, and Housing and Urban Development,  especially those pertaining to healthcare, I cannot in good conscience  endorse a spending bill that continues to explode our Defense budget.  President Trump has already shown that he is willing to use the  military against American citizens.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699333/consolidated-appropriations-act-2026"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Haiti have improved, a conclusion       that goes against Trump's own Department of State that has       advised zero travel of any kind to Haiti. How can we in good       conscience force this part of our community to return to a       place we have deemed unsafe?\n\nThe termination of TPS eliminates essential safeguards such       as protection from deportation,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…committed to further marginalizing our Nation's  heroes.\n\nIt is important that we never forget the unique history and  contributions of our Nation's Black veterans.\n\nAs the conscience of the Congress, the Congressional Black Caucus  refuses to allow the sacrifices of these patriotic Americans, Black  Americans, to go unnoticed or to be erased.\n\nWe will…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…kind of leaders take away healthcare and food from working  people so that the wealthy can get even more money? What kind of  leaders? Not strong leaders, not leaders of conscience.\n\nIt is shameful.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691416/gop-tax-scam-hurts-everyone"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…brothers and sisters, as neighbors and friends, even when we disagree.  Yet, let this not become a moment to silence debate or silence dissent  or silence the truth or those of conscience who work to hold our  leaders accountable and right the wrongs of an unjust world. That is  how history will remember us: those who stood, those who spoke, and  those who…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695522/violence-nor-silence-is-the-answer"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…fight for access to the ballot box, fair  representation, diversity initiatives, and our fundamental freedoms,  which are, sadly, under threat each and every day.\n\nAs the conscience of the Congress, we will not sit back and be silent  as these attacks on our communities continue. Our history, Black  history, is American history, and we are not going…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…tired of fighting the same fights as my  parents, my grandparents, and my great-grandparents, but I fight those  fights as a member of the Congressional Black Caucus, the conscience of  the Congress, from a position of more power and strength than they ever  dreamed. I fight those fights so that our children and grandchildren  don't have to.\n\nI implore…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689341/fighting-voter-suppression"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Mexico.\n\nYou, my sweet boy, are precious and deserving of love and safety. No  child should endure what you are going through. Journalists,  pediatricians, and people of good conscience have rallied around your  family to keep you safe.\n\nMadam Speaker, I rise today for 2-year-old Daphne from Massachusetts.  Daphne, your dad, Fidel, loves you more than anything.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700186/state-of-our-union-is-traumatizing-our-children"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…Department's 2023 Human Rights Report highlights troubling  allegations regarding the Government of the People's Republic of China  forcibly harvesting organs from prisoners of conscience, including  religious and spiritual adherents.\n\nMr. Speaker, I worry deeply about the administration's proposed State  Department reorganization plans that will gut the funding…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690629/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "Mr. GREEN of Texas. Mr. Speaker, and still I rise, unbought,  unbossed, and unafraid.\n\nMr. Speaker, I rise, driven by conscience, to embrace the moral  imperative to speak truth not only to power but to also speak truth  about power.\n\nI rise today to acknowledge, driven by conscience, what the world…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691156/speaking-truth-about-power"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…millions of not only Falun Gong  practitioners but also Uyghurs, Tibetans, Christians, and others it  deems a threat.\n\nThe CCP's utter disregard for human life shocks the conscience. This  barbaric practice must end, and it must end now.\n\nH.R. 1540 is a historic step forward, the first binding commitment by  Congress to take decisive legal action against…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690647/falun-gong-protection-act"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…people that are forced to work  that are keeping our skies safe, that are keeping our Nation safe. Two  weeks later, we haven't done it.\n\nThis isn't partisan.\n\nSearch your conscience. Ask yourself, honest to God, if a plane,  another plane--a plane has fallen out of the sky. I am not saying it is  because of air traffic control, but you heard of 500 safety…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…the principles which have been delineated, the public records and  other evidences of my conduct must witness to you and to the world. To  myself, the assurance of my own conscience is that I have at least  believed myself to be guided by them.''", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700270/president-washingtons-farewell-address"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…of hemp  policy in America, prohibitionists slipped this provision into a must- pass government funding bill, forcing Members of Congress to choose  between voting their conscience on hemp and paying our military  servicemembers. This is wrong.\n\nI opposed this language when prohibitionists tried to insert it into  the Agriculture-FDA Appropriations…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696735/continuing-appropriations-and-extensions-act-2026"}, {"senator": "John Carter", "party": "Republican", "sentence": "…toward privatization of VA medical care to the  underfunding of infrastructure and climate resiliency projects and the  harmful poison pill riders, I just cannot in good conscience support  this bill.\n\nIt breaks my heart because we do have such a good working  relationship across the aisle with Chairman Carter and myself. I look  forward to working…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692945/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…atrocities of our time. It is amazing that  we have to speak about this. It is the State-sponsored, forced  harvesting of human organs.\n\nInnocent people, often prisoners of conscience, are being killed so  that their vital organs can be removed and sold. This is a billion- dollar black market built on murder. It is a direct assault on every  principle…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…subsection (a) shall include--\n\n(1) a summary of de jure and de facto policies toward organ       transplantation in the PRC, including with respect to       prisoners of conscience (including Falun Gong) and other       prisoners;\n\n(2)(A) the number of organ transplants that are known to       occur or are estimated to occur on an annual basis in the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…delay.\n\nI say to this Chamber: Let's get it done. The American people deserve  stability, and they expect results. These bills deliver both.\n\nFor anyone consulting their conscience, these measures have already  passed the House with strong bipartisan support. The work has been  carried out, and the responsibility now is to get it across the finish…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…indiscriminately  targeting our ally Israel. Yet, they tell us to turn a blind eye and  let the Lebanese military abuse the generosity of the American  taxpayer.\n\nWe cannot, in good conscience, continue sending U.S. taxpayer dollars  to Lebanon when they are complicit in empowering a terrorist  organization whose primary mission is to destroy America and Israel.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…an individual is  automatically reenrolled each year, this can go on for years. Thus,  over time, it builds up to that 20 percent of shadow enrollees.\n\nWe cannot, in good conscience, in defense of the American taxpayers'  money, just cleanly extend these temporary COVID-enhanced premium tax  credits without addressing the realities behind the waste,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Republican Party and a  bipartisan supermajority is going to pass a bill to increase  transparency regarding the egregious abuses by Jeffrey Epstein, a goal  that anyone of conscience desires. That is in totality an important  statement to check the rich and powerful.\n\nRemember how we got here. After decades, it was President Trump's  Department of Justice…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696812/epstein-files-transparency-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…south Texas, Puget Sound, and many, many more. Every single veteran  committed suicide with a firearm. Every single one.\n\nWith all of these serious concerns, I cannot in good conscience  support this bill. I urge my colleagues to oppose it, and I reserve the  balance of my time.\n\nMr. ALFORD. Mr. Chair, I yield myself such time as I may consume.\n\nToday is…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692959/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}]