[{"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…switch since 1990, the  number of banks in the United States has declined from more than 18,000  to fewer than 5,000.\n\nThe biggest banks have been the beneficiaries of this consolidation  because they have grown even bigger. In the mid-1990s, the 20 biggest  banks in this country held a total of 15 percent of all bank assets-- the 20 biggest had 15 percent…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690769/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…have to break up the largest corporations so they can't  keep screwing regular people. We have got to stand up and fight back  against corruption, against greed, against consolidation, and for the  American people to have that American Dream.\n\nThat is economic patriotism. That is what we are going to fight for,  and I am so grateful to my colleague from…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689086/economic-populism"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…home.\n\nDonald Trump thinks if he can do this in the Caribbean, he can do it  on the streets of Chicago. He could use the military for his own  political retribution and consolidation of power in and outside our  borders.\n\nAfter all, he said in his own words:\n\nWe're under invasion from within, no different than a       foreign enemy but more difficult…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696566/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…needed to cover their added costs, and they  have continued to increase their profits.\n\nWhat is the Republicans' response to this cost-of-living crisis  driven by corporate consolidation and power?\n\nWhy, it is to give out even more corporate tax cuts, of course, $4.5  trillion worth of them to be precise, paid for by slashing Medicaid  which serves nearly…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689082/economic-populism"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…know if we may have some other people coming in,  so I will wait.\n\nMr. Speaker, if we defeat the previous question, I will offer an  amendment to the rule to provide the consolidation of H.R. 6074, which  would extend the Affordable Care Act enhanced premium--\n\nMr. Speaker, I am going to hold on. I am going to reserve the balance  of my time.\n\nMr. Speaker,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…is on track to spend over  $1 trillion on defense. Every year, we spend more and more on defense.  It is not clear that taxpayers are getting a good deal.\n\nAfter years of consolidation and lax antitrust enforcement, the  defense industry has ossified around five major prime contractors, each  with a degree of specialization. That means only two or three…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…didn't stop the outsourcing of jobs during his  first term. They got worse. Jobs were outsourced.\n\nWe had family farm after family farm collapse across this country  through consolidation. He didn't do anything.\n\nYou need a partnership between the legislative branch and the  executive branch working with our companies. This is complicated. It  doesn't just…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…against large corporations that have  dominated the market, forced small producers out of business, and price  gouged consumers.\n\nWe are in an era of unprecedented corporate consolidation. Mr.  Speaker, four countries control over 80 percent of the beef market,  four companies control 70 percent of the pork industry, and four  companies control more than…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…sponsorship for dependents of members of Coast Guard                assigned to Unalaska, Alaska. Sec. 245. Authorization for maternity uniform allowance for officers. Sec. 246. Consolidation of authorities for college student                precommissioning initiative. Sec. 247. Additional available guidance and considerations for reserve                selection…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…the USS Gerald Ford  strike group surging toward the region, the stage for folly is set. We  are told that only drug dealers are the target of U.S. operations, but  the consolidation of the largest U.S. force in the Caribbean in 35  years suggests that regime change may very well be the intended goal.\n\nThe use of lethal force and our massive military…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…did even 25 years ago.\n\nMr. Speaker, when you are doing an analysis of the propriety of a  bank merger, you can't just look at whether or not this leads to some  level of consolidation in the banking sector. You have to look at it in  terms of competition across the financial services landscape.\n\nIn order to achieve the scale, to provide the same level…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…enough. It is the COVID-era  subsidies that are in question here, and premium increases are actually  driven by multiple factors, including medical inflation, provider  consolidation, and rising  drug costs. However to actually reduce premiums, that is what we must  address. We must have comprehensive discussions about that, not just  political theater…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…highest standards of safety and environmental       sensitivity. New advances in technology have greatly reduced       the footprint of development, allowing for greater       consolidation of facilities and the preservation of more       acreage within development zones for wildlife habitat. For       example, as much as 60-plus square miles can now be developed…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…worked because I think people with sincere  hearts were the ones who voted for it and put it in place. If we did  have choice and we had more people provided--we didn't have  consolidation, and we had cheaper health insurance. That is what we  wanted.\n\nI will tell you that the Energy and Commerce Committee and the Ways  and Means Committee are going to be…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698566/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…couldn't help himself.\n\nThis is a clear example of government knows best, and we know what  this is really about. Fewer community banks and credit unions will lead  to more consolidation and less options. I believe most Members here  share a common goal to ensure financial inclusion, as well as financial  literacy and  awareness. Frankly, this rule isn't…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689844/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Evaluation of       the FAA to ensure employee complaints and whistleblower       protections are considered;\n\n(3) consider opportunities to improve management and       consolidation of aviation safety information system databases       to enhance       civil and military aviation incident reporting; and\n\n(4) carry out the safety review required by…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…current law only lasts 5 years, has caused national marine sanctuaries  to effectively become no-go zones for undersea cables. This means  reduced routes of diversity, consolidation of cable landing zones, and  an increased threat to our national security.\n\nNotably, this dynamic does not just cause stress on the physical  infrastructure of these projects.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…years and  out--have actually been operating very efficiently.\n\nDoes it bother anyone that France just took down their government  because they were trying to do some fiscal consolidation? They won't  let them deal with their debt, but they can sell a bond for about 50  basis points cheaper than we can.\n\nGreece is actually about 70 basis points cheaper.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…by the people of Georgia in forging       an innovative and productive society since the country's       independence from the Soviet Union should be applauded;\n\n(2) the consolidation of democracy in Georgia is critical       for regional stability and United States national interests;\n\n(3) Georgia has seen significant democratic backsliding in…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…biggest economy in the world, the country with the reserve currency?  Does anyone pay attention to this? People say, ``Oh, David, that is not  fair. Greece engaged in fiscal consolidation.'' They are actually  lowering their debts, where we are now over 100 percent of debt-to-GDP.  There are no plans to tell the truth about it. If you tell the truth,  you…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}]