[{"senator": "Salud Carbajal", "party": "Democrat", "sentence": "As the elected Representative of the Central Coast, I have a duty to  respond to my constituents and demand accountability for ICE's actions  that day.", "title": "Fighting Dhs Immigration Raids", "date": "2025-12-03"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "Will there be just four Republicans who will stand with us and their  constituents to protect the Constitution, the rule of law, and law and  order in this country?", "title": "Trump Immigration Policies", "date": "2025-04-30"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "Speaker, I welcome my friends, family, and  constituents back home in west Michigan to my Special Order hour  honoring notable Black west Michiganders and the impact they have made  on our wonderful community.", "title": "Highlighting Notable Black Leaders From Michigan's Third Congressional District", "date": "2025-02-26"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Such drastic changes could result in a significant reduction in  services, forcing local partners to cease operations and reexpose  hundreds of my constituents to homelessness.", "title": "-9999", "date": "2025-11-18"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "In these roles, she has not only proved  invaluable to me and my staff but has also served as a direct voice for  my constituents in Illinois' 13th district.", "title": "Thanking Aleksi Knepp for Her Service to Illinois' 13th Congressional District", "date": null}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "I told my constituents today how I worked  as a civil servant.", "title": "Government Funding", "date": null}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "Kamlager-Dove's voice in  Congress, from the way she fights for her constituents in Los Angeles,  to her work on the Judiciary Committee.", "title": "Trump's First 100 Days", "date": "2025-05-05"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "That is approximately more than 70,000  people, constituents, in my district alone.", "title": "Medical Bills Are Too High", "date": "2025-12-01"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "These  tariffs affect the cost of everything: the food at the grocery store,  electronics, the goods that are in most demand by our constituents.", "title": "Providing for Consideration of Senate Amendment to H. Con. Res. Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "Many of us in Congress have heard from our constituents about the  FAA's difficult aeromedical process.", "title": "Mental Health in Aviation Act of 2025", "date": null}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Madam Speaker, for decades, Fannie Mae has played a  critical role in supporting home buyers and renters and has employed  many of my constituents.", "title": "Recognizing Bishop Michelle C. Thomas", "date": "2025-12-01"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "This year, I have traveled the State of New Jersey, hearing from the  constituents of my three GOP colleagues.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "That is not what my constituents think is the most  important thing Congress should tackle this week or this year, and I  bet it is not what your constituents think either.", "title": "Providing for Consideration of H.R. Gulf of America Act; and Providing for Consideration of H.R. Dhs Restrictions on Confucius Institutes and Chinese Entities of Concern Act", "date": "2025-05-06"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "I hope they finally decide to side with their  constituents.", "title": "Providing for Consideration of H.R. Promoting Efficient Review for Modern Infrastructure Today Act; Providing for Consideration of H.R. Increasing Investor Opportunities Act; Providing for Consideration of H.R. Electric Supply Chain Act; Providing for Consideration of H.R. State Planning for Reliability and Affordability Act; Providing for Consideration of H.R. Improving Interagency Coordination for Pipeline Reviews Act; Providing for Consideration of S. Disinterment of Remains of Fernando V. Cota From Fort Sam Houston National Cemetery; and for Other Purposes", "date": "2025-12-10"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "I am not going to be a prop in  some social media video that is posted later to placate constituents  about ending gun violence.", "title": "Pulse Shooting Anniversary", "date": "2025-06-12"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "His constituents, the dear people of  Colorado, and many other constituents in blue States, like New York and  California, probably are paying record prices for electricity and other  energy products.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``North Dakota Field Office Record of Decision and Approved Resource Management Plan''", "date": null}, {"senator": "Andy Barr", "party": "Republican", "sentence": "In fact, what it does do is it invalidates a  regulation that will take this critical lifeline away from many of my  constituents.", "title": "Disapproving the Rule Submitted By the Bureau of Consumer Financial Protection Relating to ``Overdraft Lending: Very Large Financial Institutions''", "date": "2025-04-09"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "Speaker, I want to make it very clear to my  constituents in Kentucky what my objectives are over the next 22 months  of the 119th Congress.", "title": "Draining the Swamp in Order to Put America First", "date": "2025-03-03"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "To my constituents, he will be  remembered as a champion for the city of Memphis.", "title": "Remarkable Life and Legacy of Frederick W. Smith", "date": "2025-06-24"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "Above all else, in this role, our job as Representatives is to listen  to our constituents.", "title": "Return the United States to A Balanced Budget", "date": "2025-02-27"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "Protecting citizens of this country has been my top  priority since the day I was ever sworn into office, particularly my  constituents whom I represent.", "title": "Federal Contractor Cybersecurity Vulnerability Reduction Act of 2025", "date": "2025-03-03"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "What I am opposed to is unelected bureaucrats in Washington or  Sacramento mandating my constituents purchase and drive an electric car  or truck.", "title": "Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine Pollution Control Standards; Heavy-Duty Vehicle and Engine Emission Warranty and Maintenance Provisions; Advanced Clean Trucks; Zero Emission Airport Shuttle; Zero-Emission Power Train Certification; Waiver of Preemption; Notice of Decision''", "date": "2025-04-30"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "On behalf of the United States Congress,  and the constituents of the 23rd Congressional District, I am proud to  recognize our brave service members' courage, sacrifice, and valor as  we come together this Memorial Day.", "title": "Recognizing the Service of Those Who Gave the Ultimate Sacrifice: Memorial Day 2025", "date": "2025-05-21"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "As I have mentioned many times before, issues involving Burma are  near and dear to my heart, as well as to those of many of my Burmese  constituents and members at the Battle Creek Burma Center in southwest  Michigan.", "title": "Bringing Real Accountability Via Enforcement in Burma Act", "date": "2026-02-09"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "He was  deeply passionate about issues that affected his constituents in  northern California.", "title": "-9999", "date": "2026-01-08"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "From the very first day I set foot in this Chamber, I have  always promised my constituents that I would do everything within my  power to reinstate fiscal sanity to our great Nation.", "title": "Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Consumer Gas-Fired Instantaneous Water Heaters''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Waste Emissions Charge for Petroleum and Natural Gas Systems: Procedures for Facilitating Compliance, Including Netting and Exemptions''; and Providing for Consideration of H. Con. Res. Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-02-25"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "Over the years, Kathy proved to be an  invaluable asset to my office, where her attention to detail was  crucial in my ability to represent and serve my constituents.", "title": "Recognizing and Expressing Gratitude to Former Director of Operations Kathy Zhu", "date": "2025-12-04"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "Four years ago, I established the 16th District Congressional Veteran  Commendation to recognize the heroic wartime sacrifices and admirable  peacetime community involvement of my constituents.", "title": "Recognizing the Recipients of Florida's 16th Congressional District Veteran Commendation", "date": "2025-12-03"}, {"senator": "William Timmons", "party": "Republican", "sentence": "When I  don't feel safe at night, when my constituents come here and I tell  them to be careful, when my commanding officer stays at a hotel three  blocks from here and I tell him not to walk to the baseball game, to  take an Uber, what world are you living in?", "title": "District of Columbia Federal Immigration Compliance Act of 2025", "date": "2025-06-11"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "We don't want to tell the truth because our constituents get  pissed off at us when we walk them through the math.", "title": "Congress is A Math-Free Zone", "date": "2026-01-08"}]