[{"senator": "Val Hoyle", "party": "Democrat", "sentence": "The Wetlands Conservation and Access Improvement Act of 2025 would  extend critical wetlands conservation funding through 2033.\n\nMany of my constituents live and breathe wetlands conservation.  Whether…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693494/wetlands-conservation-and-access-improvement-act-of-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…continues the NEP's successful legacy. The ESTUARIES Act  reauthorizes competitive grants from 2031 so every estuary of national  significance can implement science-driven conservation, respond to  emerging threats, and support long-term economic resilience.\n\nThis bill upholds a simple principle: When we give local experts the  tools they need, they protect…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698176/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…important habitat for the State  endangered great grey owl and little willow flycatcher, as well as a  suite of additional at-risk wildlife species. In 2016, a coalition of  conservation groups donated Ackerson Meadow to Yosemite National Park;  however, it is almost completely surrounded by Stanislaus National  Forest and only partially contiguous to the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695778/by-mr-padilla"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…you go shopping. Energy efficiency is very important to Americans. It  has been, as a matter of fact, for about 50 years. When the Congress  passed the Energy Policy and Conservation Act, we said to the  Department of Energy: Work with manufacturers and advocates and do  everything you can to help with innovation to help consumers save more  money.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688544/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…Speaker, I thank my colleagues for their kind words of  support. I, too, am rising today in support of this bill, H.R. 972,  that I brought before you. It is the Sloan Canyon Conservation and  Lateral Pipeline Act.\n\nAs we barrel toward record low water projections at Lake Mead and the  increasing risk of prolonged drought due to climate change, there is no…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698163/sloan-canyon-conservation-and-lateral-pipeline-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…leadership and a passion for justice in every  space she serves.\n\nLaw and Government Champion Award--Gray Montrose: Gray Montrose is a  leader in land use, environmental law, and conservation, with over a  decade of experience advancing cultural heritage and resource  protection. As Deputy Director of Land Conservation at the Capital  Region Land Conservancy…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690568/virginias-fourth-district-women-in-excellence-awards"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…largest undeveloped  ecosystem in northern Middlesex County. This oversight will be  instrumental in the continued restoration of the Woodbrook Superfund  Site, and associated conservation efforts throughout the area. Dorothy  played a pivotal role in securing grants from Sustainable Jersey and  the National Park Service, including twenty-five thousand dollars…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698050/recognizing-dorothy-giamboi-for-nearly-fifteen-years-of-public-service"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "Mr. Speaker, H.R. 1676 will improve the State-led conservation of  priority fish and wildlife resources by improving the efficiency of the  State Wildlife Action Plan review process.\n\nState wildlife managers in every U.S. State are…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697623/make-state-wildlife-action-plans-efficient-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Advisory Committee to discuss how we in Congress can work with  them to preserve Long Island Sound. This roundtable built on an event  in Rye in June where a new 10-year conservation and management plan was  signed.\n\nI have signed onto two bills. The first is the ESTUARIES Act that  will preserve Long Island Sound and 27 other estuaries of national…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693947/protecting-and-preserving-long-island-sound"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "Ms. HOYLE of Oregon. Mr. Speaker, H.R. 531, the South Pacific Tuna  Treaty Act of 2025, will help sustain American tuna fisheries and the  conservation of marine resources in the South Pacific.\n\nThis legislation would implement the South Pacific Tuna Treaty, a  multilateral treaty between the United States Government and…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691005/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…These non-Federal dollars come through in kind, local, State, and  private sources, which are utilized by the local program leaders in  accordance with their Comprehensive Conservation and Management Plans.  The NEP allows the locals to lead and address the water quality issues  because they know best.\n\nProjects carried out using NEP funds cover a wide…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698177/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…is more important than ever that we recognize the role that  native plants play in sustaining the health of our ecosystems. We must  act now to raise awareness, promote conservation efforts and educate  future generations about the importance of preserving these plants for  the benefit of our Nation's biodiversity and cultural heritage.\n\nI encourage…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688920/supporting-the-designation-of-april-2025-as-national-native-plant-month"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…(D-CA), Josh  Harder (D-CA), Kevin Mullin (D-CA), and Suzanne Bonamici (D-OR) for  cosponsoring my bill.\n\nAs the former Deputy Secretary of the Interior, I know our national  conservation goals cannot be achieved through public land ownership  alone. The federal and state governments can and must work with private  landowners who want to do their part to…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689872/reintroduction-of-the-forest-legacy-management-flexibility-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. Speaker, I rise in strong opposition to H.J. Res. 24, the fourth  Republican resolution this Congress to dismantle energy conservation  standards for appliances. This harmful resolution guts a Department of  Energy efficiency rule for walk-in coolers and freezers, which will  increase energy costs for businesses…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689263/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…protection,  dating back to 1909 through treaties with Canada and to 1964 with the  Wilderness Act, which passed with overwhelming bipartisan support back  when we had great conservation champions in both parties.\n\nAmericans from across the country who have experienced the serenity  of this wilderness know exactly what is at stake. Passing this  resolution…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…under chapter 8 of title 5, United States Code, of the rule  submitted by the Office of Energy Efficiency and Renewable Energy,  Department of Energy relating to ``Energy Conservation Program: Energy  Conservation Standards for Commercial Refrigerators, Freezers, and  Refrigerator-Freezers'', and ask for its immediate consideration in the  House.\n\nThe…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…of the Secure Rural Schools Reauthorization Act of 2025.\n\nSince the National Forest System was created, nearly 200 million  acres of rural America have been put aside for conservation,  recreation, and responsible natural resource development, like mining  and timber harvesting.\n\nWhen these acres were put aside, rural communities lost their access  to…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697654/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Offshore oil and gas from the Outer Continental Shelf accounts for 15  percent of U.S. production, supporting jobs, powering homes, fueling  transportation, paying for conservation, and lowering costs for goods  we all need. Yet, this rule, part of a broader pattern of Biden-era  restrictions, threatens that stability with added costs of more than…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688630/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…rise today in strong support of my  Congressional Review Act joint resolution of disapproval which seeks to  overturn the Department of Energy's final rule on the Energy  Conservation Program for Appliance Standards: Certification  Requirements, Labeling Provisions, and Enforcement Provisions.\n\nOver the past 4 years, the Biden-Harris administration has…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688545/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…habitats across Bradenton, North Port, and Ft. Myers to  support endangered bat populations. She led educational workshops for  Girl Scouts and community members on bat conservation and successfully  petitioned the City of North Port to establish a Bat Awareness Day.  Additionally, she collaborated with the council to develop a Girl Scout  badge curriculum,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690422/recognizing-krysta-fowler-gold-award"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "Mr. STAUBER. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 1098) to reauthorize the Junior Duck Stamp Conservation and  Design Program Act of 1994, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                      H.R. 1098…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698168/reauthorization-of-junior-duck-stamp-conservation-and-design-program-act-of-1994"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…H. Res. 977\n\nResolved, That upon adoption of this resolution it shall be       in order to consider in the House the bill (H.R. 4593) to       amend the Energy Policy and Conservation Act to revise the       definition of showerhead. All points of order against       consideration of the bill are waived. The bill shall be       considered as read. All…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Senator  Cornyn introduced identical legislation that would codify the  President's executive order.\n\nThe National Wildlife Refuge System plays an important role in  coastal conservation, public recreation, and environmental education,  all of which honor Jocelyn by allowing current and future generations  of Americans to enjoy the natural landscape and…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693446/jocelyn-nungaray-national-wildlife-refuge-act"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…Administration Policy   H.J. Res. 24--Joint Resolution, Providing for Congressional Disapproval  of the Rule Submitted by the Department of Energy Relating to ``Energy  Conservation Program: Energy Conservation Standards for Walk-In Coolers\n\nand Walk-in Freezers''--Rep. Bice, R-OK, and 10 cosponsors\n\nThe Administration strongly supports passage of H.J.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689262/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…Carolina, he recently was named the South Carolina Farmer  of the Year for 2025 by the Sunbelt Ag Expo. This distinct honor is for  his decades of dedicated service to farming, conservation, and  community.\n\nFor over 40 years, Jeff Wilson has exemplified the very best of what  it means to be a South Carolina farmer. He is hardworking, he is  innovative, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695599/recognizing-jeff-wilson"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Kane,  Pennsylvania, that makes a great product using sunflowers for that  beverage.\n\nI commend them today for honoring a vital piece of the Commonwealth's  logging and conservation heritage, the Colossal Cherry. The Colossal  Cherry is now an artifact, but at one time it was the largest black  cherry tree in the world. The Wilds Sonshine Factory hosted…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694894/the-colossal-cherry"}, {"senator": "John Thune", "party": "Republican", "sentence": "…upon. It raises reference prices for every  covered commodity; it expands crop insurance coverage and  affordability; and it supports risk management, disaster assistance,  conservation programs, and critical research and disease prevention  programs that are essential to a robust agriculture sector.\n\nWith this bill, Republicans are also making America…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693279/one-big-beautiful-bill-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Entitlement Finalization Act.  And the second is H.R. 972, sponsored by Representative Dina Titus of  Nevada. It is the identical companion to Senator Cortez Masto's Sloan  Canyon Conservation and Lateral Pipeline Act.\n\nThese are important bills to those in Southeastern Alaska and in  Nevada. It probably won't make headlines out of those two areas, but  they are…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700283/cape-fox-land-entitlement-finalization-act-of-2025"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…of the most unique ecosystems on the  planet.\n\nFor generations, the Miccosukee Tribe has served as a responsible  steward of the fragile environment. Their leadership in conservation,  water management, and environmental protection has helped preserve the  natural beauty, the biodiversity, and the cultural heritage of south  Florida.\n\nThis bill is about…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693410/miccosukee-reserved-area-amendments-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Wetlands Conservation and       Access Improvement Act of 2025''.       SEC. 2. AVAILABILITY OF INTEREST ON OBLIGATIONS HELD IN                     FEDERAL AID TO WILDLIFE RESTORATION FUND.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693493/wetlands-conservation-and-access-improvement-act-of-2025"}]