[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…duplication and waste. This may, indeed, be a  time to reassess our participation in some of these organizations,  something we should do every 5 to 10 years. The world is constantly  changing, and our priorities and funding decisions need to adapt. But  for an administration to take such a drastic, unilateral step is  unprecedented, short-sighted, and…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699129/us-withdrawal-from-united-nations-organizations-and-programs"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…insecurity.\n\nThat is what we should be doing in the United States Congress, not  attacking the social safety net, Mr. Speaker. Many of my colleagues on  the other side of the aisle constantly call things like Social Security  and Medicare entitlement programs. They label Social Security and  Medicare entitlement programs.\n\nBy the way, as a result of this one big,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…by just covering people  and not having this tragedy of uncompensated care. Literally, I have  had hospitals tell me that one person can cost millions of dollars by  just constantly coming to the hospital. If they would have just had  healthcare, had insurance, their costs would have been covered, instead  of the constant uncompensated care costs.\n\nSo…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697783/healthcare"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…covering of the  nerves, called myelin. It can start at any age and in both genders.  Weakness occurs over two or more months. Unlike GBS, CIDP is chronic,  with symptoms constantly waxing and waning. Left untreated, 30 percent  of CIDP patients will progress to wheelchair dependence. Early  recognition and treatment can avoid a significant amount of…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691695/recognizing-may-2025-as-gbscidp-awareness-month"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…which  is something we don't want them to do, which is why we want a  bipartisan immigration bill to actually fasten down the border and move  forward on this so we are not constantly dealing with this.\n\nThe bottom-line problem with my friend's legislation, which is  offered in all good faith, is that it is just continuing to pile  criminal penalties on…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…more  Federal taxes than 26 States. D.C.'s government is accountable to the  people who live here. Local leadership should be empowered to solve  problems without Congress constantly interfering.\n\nI have said many times if Donald Trump wants to run D.C., he should  resign and run for Mayor. If Republicans want to get tough on crime,  they should stop…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696980/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…peace, and when Trump says  that he wants peace, where is the peace?\n\nHe said that he was going to bring peace to Ukraine on day one.  Instead,  what he has done is he is constantly giving comfort to the Russian  leader. He has lambasted Zelenskyy in the Oval Office and can't say  enough nice things about Vladimir Putin.\n\nThat is not my idea of peace.…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…These are ideals that  Americans fairly demand from their government, and we should all be  working toward that challenge.\n\nWhen I helped lead NASA for President Obama, we constantly iterated  and improved our existing systems because we knew how important it was  to stretch the taxpayer dollar as far as it can go.\n\nTaking a sledgehammer and a chain saw…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691391/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…the underdog. It is undeniable that student athletes  are not receiving equitable compensation for their labor, especially  those in high-revenue sports. A student athlete constantly endangers  themselves and risks great harm to their bodies for the entertainment  of the masses, all while juggling classes, practice, and potentially a  part-time job just…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697301/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Mr. RASKIN. Mr. Speaker, why did the Framers vest the power to  declare war in Congress alone? It was because the kings were constantly  plunging their entire nations into wars of vanity, of conceit, of  caprice, of mere whimsy.\n\nThey didn't trust one man to be able to take the entire country to  war. They…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698444/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…are, in fact, a lifeline.\n\nIn what world is this going to improve America? In what world is  taking a lifeline away from seniors improving our economy, and in what  world is constantly raising and lowering the hopes of some of our most  vulnerable neighbors making America great again?\n\nI have already heard from constituents who have been contacted by the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690424/social-security-administration-is-there-to-help-not-hurt-americans"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…some  detail, but first let me just say generally that what we are talking  about is so important. We have so many of our friends on the other side  of the aisle who are constantly talking about how the government spends  too much money and how deficits are getting so much bigger.\n\nHere, under their tax bill that they are proposing right now, they…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690627/republican-tax-cuts"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…water, in which we get ahead of  this tipping point on climate change, in which fire seasons go back to  being a few months a year and not year-round, in which we are not  constantly seeing our wildlife at risk, and in which we have to wonder  what the future will look like for our kids and our grandkids.\n\nIt may seem like a small step tonight to get…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…Coalition, and before that Vice Chair  for Communications, I have worked hand-in-hand with Emma to find new  ways to address the challenges facing our country, adapting to a  constantly evolving media environment to connect with the American  people and earn their trust. Emma's hard work has ensured every New Dem  Member and their staff has the tools, knowledge,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695553/recognizing-emma-weir"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…team to talk through ideas for the       trip and has put together a scrapbook of her journey with       Type 1 diabetes, she said. She's had to manage her disease       constantly for nearly a decade. ``For me, since I've had it       for so long, it's pretty much my life, so I'm a lot more used       to it. I have two devices, which are really helpful,''…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693470/recognizing-ms-abby-lachman-for-her-dedicated-medical-research-advocacy"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…Act has inspired young people to  engage with their communities and improve the lives of their neighbors  and themselves. On the Education and Workforce Committee, we are  constantly working to promote more pathways for success for students  and young adults so that they can thrive. The Congressional Award  program is yet another step to encourage young…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698222/congressional-award-program-reauthorization-act"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…porn or fentanyl marketed on a billboard? The answer is you  have not seen it because of a well-crafted system that punishes  wrongdoing. Why do we see this content online constantly? The answer is  Section 230.\n\nLet us stop pretending like the internet is new, novel, and worthy of  special treatment when 96 percent Americans access it. When the law…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…the  Senate floor for a vote.\n\nI stand before you today because the threat our foreign adversaries  pose is not a distant concern. It is real; it is relentless; and it is  constantly evolving. We cannot afford to wait and deal with the  consequences. The cost of inaction is too great.\n\nCongress must anticipate the threats, and we must work together to…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690666/fact-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…DOGE asked government employees to write down five things they  did at work the previous week.''\n\nHe adds, ``Here's a news flash: Anyone working in the real world has  to constantly justify what they are doing. From the baseball slugger  mired in a hitting slump to the journalist not writing enough stories  to traffic cops not writing enough tickets,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688492/demanding-transparency-efficiency-and-accountability-from-our-government-is-not-extreme"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…of that is debt that was sold a few years ago, when interest  rates were very, very low. So it is getting refinanced at today's  rates.\n\nThe other thing that I talk about constantly, because it is my  intense frustration around here, is the Democrats and--I am sorry--many  of my Republican colleagues have turned healthcare into financial  engineering…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…years ago.\n\nOn average, we are picking up one point of interest, 1.5 points, some  2. There is your problem. The chart here--I am just trying to show  you--is we have to constantly refinance. We are refinancing at higher  interest rates because we are making the markets cranky. We are not  telling the bond markets that we are serious about taking on…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…Producing Advanced Technologies for Homeland Security Act, which I am  proud to have introduced along with Congressman Shri Thanedar.\n\nThe Department of Homeland Security has a constantly evolving  mission. To meet those threats, the Department was previously granted  the authority to enter into other transactional agreements, commonly  known as OTAs.\n\nThese…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688704/producing-advanced-technologies-for-homeland-security-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…impact, Mr. Speaker, stretched far beyond the badge. He  played football for the Fernandina Beach Pirates and went on to play  for Newberry College. When he returned home, he constantly coached for  Babe Ruth baseball and Pop Warner football, and he poured his heart  into Pirate Athletics. He was the voice of the Pirates. At every  football game, Mr. Speaker,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691576/recognizing-alhambra-theater-dining"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…Export Control Transparency Act, a key piece  of legislation to ensure our country stays ahead of our adversaries.\n\nBusinesses and universities in the United States work constantly to  innovate, improve, and invent the best technologies and systems in this  world. This is what keeps America on the leading edge. Our Nation's  determination and commitment…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690695/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…compliance, among other national security  and foreign affairs applications.\n\nThis technology provides us with critical information for a number of  fields. As the industry is constantly evolving and growing, we must  make sure that Congress is receiving timely and comprehensive reports  to accurately evaluate how regulations are affecting the state of the…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688972/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…there are many people making money here. Certainly the banks are  making money. Above all, the developers are making money. The lawyers  are making money, as they have to constantly draft documents between  the banks and the syndicate and the developer. And, like I said, the  syndicate itself, which is made up of a variety of wealthy individuals  or…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…to interact?\n\nWe maximize economic growth, and that growth becomes tax collection  stability and gets us to the top of the total dollar amount, but we  will probably still constantly fall back into that mean of the  percentage of the economy. So have a bigger economy. It is not that  complicated.\n\nUpper-income taxpayers overwhelmingly finance the Federal…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…are the ones who       suffer the consequences.\n\nAn 18-year-old student said:\n\nPeople are just suffering all the time . . . It's still       very hard to see our country constantly being destroyed.\n\nPresident Trump noted in a statement on Truth Social:\n\nThere was no reason for Putin to be shooting missiles into       civilian areas, cities and towns,…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…sector that  makes our system the best in the world.\n\nThat is why we want healthy mergers. We want de novo charters to  backfill, but we want healthy mergers so that we have a constantly  dynamic and healthy banking system.\n\nNow, the gentlewoman cites this one particular case of fraud in one  large bank, and she is right. It was a bad case, and it was properly…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…finance, trade, energy, and national security. Commercial remote  sensing also provides us with vital information for many important  applications. The technology behind it is constantly evolving, and the  industry is seeing tremendous growth.\n\nTo effectively support and manage remote sensing activities, it is  imperative that Congress receives timely and…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688971/commercial-remote-sensing-amendment-act-of-2025"}]