[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…covering up the  Epstein files. I think it is about theft because the oil being taken  from the people of Venezuela is being sold off and used to finance a  slush fund in Qatar controlled by, you guessed it, Donald Trump.\n\nI don't think I have ever seen such a brazen example of corruption in  my life. The President of the United States put American troops…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699359/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…and  young women abused, trafficked, and used by Epstein and the elite and  the powerful who believed they could get away with it.\n\nEpstein told the young victims that he controlled the banks and the  government.\n\nThose women refused to be silenced. Today, they have pierced the dark  with their light.\n\nAnytime any girl is trafficked, molested, or abused,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696807/epstein-files-transparency-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…colleague, who I know wasn't in Congress  at the time, all of the statements made by Republican leaders at that  time begging Donald Trump to send in the National Guard, which he  controlled because it is the District of Columbia National Guard, and  he didn't do it. He sat and watched it, eating hamburgers or whatever,  in the White House on TV, ignoring all…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…of the United States. They would like nothing more for our  Nation to falter, but they are also self-interested.\n\nBoth the United States and Russia benefit from a stable, controlled  nuclear regime. That mutual self-interest lies at the heart of why New  START was signed in the first place. To throw it all away would be a  mistake of immense proportions.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699031/expiration-of-new-start"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…American people know that the House of  Representatives has a majority of Republicans; that the Speaker of the  House is a Republican; that the majority in the U.S. Senate is  controlled by Republicans; that the majority leader is a Republican;  and that the President of the United States is a Republican.\n\nNow, as I visit with constituents from across New…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…of this work has been done on a bipartisan basis. One noteworthy  example is the legislation Congress passed to force the divestment of  TikTok from ownership by companies controlled by the Chinese Communist  Party, which passed overwhelmingly with hundreds of Democratic and  Republican votes.\n\nThat is why I was frustrated to learn last week that President…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692700/assessment-of-trans-atlantic-submarine-fiber-optic-cable"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…violation of international law and despite Denmark's  longstanding alliance and friendly relations with the United States;\n\nFour, annexation of the Panama Canal, owned and controlled by Panama.  During a joint session speech to Congress, Donald John Trump stated  that his administration will be reclaiming the Panama Canal. He has  refused to rule out…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Administration and the Department of Health and Human Services, is set  to expire in December of 2025. This legislation will make permanent VA  prescribers' authority to prescribe controlled substances via  telehealth, if and when DEA and HHS end the temporary authority.\n\nTelemedicine has helped VA to greatly increase veterans' access to a  variety of types of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695455/protecting-veteran-access-to-telemedicine-services-act-of-2025"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…year 2026  appropriations bills and instead attempt to pass a full-year continuing  resolution. This would be a failure on the part of the House and the  Senate majority, controlled by Republicans. And, really, it would be a  failure on the part of President Donald Trump. It would be a failure  that undermines one of Congress's core democratic functions:…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696335/trump-administration"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…hiding. She       then obtained forged identity papers and, with the help of a       smuggler, set out to cross the border from Nazi-occupied       northern France into French-controlled southern France--so-      called Vichy France--but still equally dangerous for Jews.       Instead of helping her cross the border, the smuggler       betrayed her, and she…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690804/rose-helene-spreiregen"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…patient of hers in a local healthcare  center had immigrated to our country legally to work as a common  laborer. She had fled a troubled Latin American country where thugs  controlled the streets.\n\nLeaving all behind, the worker had journeyed here from a place where  there was no hope for a better future. Then, last week here in America,  very sadly, she…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…what a  Democrat said.\n\nWe have to stand for the Constitution, not for censorship, to stand  for freedom and not intimidation, to stand for a free press, not a  government-controlled press.\n\nChairman Carr has shown himself unwilling and unable to uphold the  responsibilities of his office, but the Senate can still uphold our  responsibilities to the First…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695700/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…to  protect our interests.\n\nAs technology evolves, so must our technology security policies. Our  export control regulations were written at a time when remote access of  controlled technologies was not an acute threat.\n\nToday, as Russian and PRC entities find more and more creative ways  to evade our sanctions and export controls, we must update our…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698860/remote-access-security-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…released, the two of you who are in this Chamber right  now could literally walk down there and sign that petition right now.  But you don't want the files released. You want it controlled by the  Oversight and Government Reform Committee because, if you did, you  would sign that petition right there that would release those  unredacted files.\n\nMr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694881/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…have to own? Well, here is a  clue as to whether that was a trick or an oversight: On the other side  of this building, over at the House of Representatives, the Republican- controlled House is sending over a continuing resolution to fund the  government. They could have put this correction in that bill. They  could have added a simple line saying that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695699/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…percent of its battery life in a short period of  time?\n\nWe cannot forget that the critical minerals that are used to make  these EVs are sourced from Chinese Communist Party-controlled mines in  places like Congo, where 15 of the 19 industrial mines are owned by the  Chinese Communist Party. These mines have zero environmental standards,  zero labor standards,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690472/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…economically infeasible. Much of  the Alternative D2 highest hydrocarbon potential area would essentially  be off limits, as it would be subject to No Surface Occupancy or  Controlled Surface Use stipulations. DOI offered only 995 acres of  Surface Disturbance Area, less than half of the maximum 2,000 Surface  Acres of Federal Land for Production and Support…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…authorities to operate in the  United States, often without the public's knowledge. That is absolutely  unacceptable.\n\nWhile companies like Huawei and ZTE are well known, others controlled  by the CCP continue to fly under the radar. They are doing this  purposely. They are creating entities that are third- and fourth-order  separates from these main organizations…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690263/foreign-adversary-communications-transparency-act"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…were created and revenue rose for the United States of  America. I have to say that.\n\nLet me also say this: There have been times, very recently, when the  Democratic party controlled the Presidency, the House of  Representatives, and the U.S. Senate. And even in those situations-- those recent situations--this legislation costing in excess of $9  billion…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696110/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…insured since the act prohibits stablecoins  from being covered by FDI insurance.\n\nA robust, well-regulated stablecoin market eliminates any  justification for a government controlled Central Bank Digital  Currency, or CBDC, which jeopardizes Americans' access to freedom,  privacy, and apolitical private capital.\n\nThis is an important point for all of…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693841/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…so you have that.\n\nMy Democrat brothers and sisters have legislation they have  introduced over the years. They have never actually brought it to the  floor even when they controlled this body and controlled the White  House. It gives you a sense, Mr. Speaker.\n\nEconomic study, go on Manhattan Institute, Riedl, it is about 1 year,  1.5 years old, they…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Joe Biden. We are in an  inflation crisis that President Trump inherited because of the spending  spree, the $10 trillion spending spree, that the Democrats did when  they controlled the White House, the House, and the Senate.\n\nMr. SMITH of Missouri. Mr. Speaker, I am prepared to close, and I  reserve the balance of my time.\n\nMr. Speaker, based on the…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700032/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…our export controls  are properly enforced as PRC shell companies have ways of working  around these trade controls in order to acquire American semiconductors  and other controlled products. Unfortunately, sometimes it seems like a  game of Whac-A-Mole because one company will pop its head up, and we  will deal with that, but then they change the name,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697555/china"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…checks related       to, as well as license applications and other requests for       authorization for the export, reexport, release, and in-      country transfer of items controlled under this part to       covered entities.\n\n``(2) Elements.--The report required by paragraph (1) shall       include, with respect to the preceding one year-period, the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690696/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…development. We  have proven that responsible energy development and environmental  stewardship actually go hand in hand. We have invested billions in  clean and emissions-controlled technology. We have reclaimed our lands  and maintained some of the strongest air quality records in the Nation.\n\nWe can grow the economy, power the country, and steward…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694907/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…experience in accordance with accepted       auditing standards.\n\n10.10. The workplace of the Committee shall be free from       illegal use, possession, sale, or distribution of controlled       substances by its employees. Any violation of such policy by       any member of the Committee staff shall be grounds for       termination of employment. Further,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…H.R. 2351\n\nBe it enacted by the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. CONTROLLED SUBSTANCE ONBOARD VESSELS.\n\nSection 70503(a) of title 46, United States Code, is       amended--\n\n(1) in the matter preceding paragraph (1) by striking       ``While on board…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692169/controlled-substance-onboard-vessels"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…2008, Congress passed the Ryan Haight Online Pharmacy Consumer  Protection Act to address the rise of rogue online pill mills and the  potential for abuse in prescribing controlled substances. At the time,  it was the right step to safeguard public health. Yet, the world of  2008 is not the world of today, and the law has not kept pace with the  realities…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695454/protecting-veteran-access-to-telemedicine-services-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…loophole that exists, and I will  provide a few more details.\n\nMr. Speaker, this bill would allow the U.S. Government to extend  existing export controls to the remote access of controlled U.S.  technology  through cloud infrastructure. Remote access is more than just the CCP.  Remote access is defined as access by foreign persons of concern,  specifically…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698858/remote-access-security-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…the previous  question be considered as ordered on the concurrent resolution to  adoption without intervening motion except for 1 hour of debate equally  divided among and controlled by Representative Mast of Florida,  Representative Meeks of New York, and Representative McGovern of  Massachusetts, or their respective designees.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699281/making-in-order-at-any-time-consideration-of-h-con-res-to-direct-the-removal-of-united-states-armed-forces-from-venezuela-that-have-not-been-authorized-by-congress"}]