[{"senator": "Scott Peters", "party": "Democrat", "sentence": "…office, we led  efforts to reinstate these crucial protections. Then, in 2022, House  Democrats passed the Inflation Reduction Act, which not only reinstated  strong methane controls but also implemented a market-driven approach  to reducing waste, the methane fee.\n\nThe methane fee is not a blanket tax on energy production. I think  the gentleman from…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688174/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…every Executive action ever taken  can now be considered a rule, whether it is or not, for purposes of the  Congressional Review Act. And a powerful special interest that controls  a powerful party can ram whatever it wants through this body without  constitutional procedure, without judicial safeguards, and without  compromise.\n\nSo they broke wide…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…will implement the reforms necessary to protect the safety of the  people of Minnesota.\n\nI will vote no today on H.R. 7148. In the coming weeks, my vote will  depend on what controls we can put in place for ICE and Border Patrol.  We must see an end to the surge in Minnesota, and a guarantee of  independent investigations into the killings of Renee Good…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699913/consolidated-appropriations-act-2026"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…to be made. This does not preordain an  outcome. The State Department can still either return such licenses for  adjustment or modification due to additional revisions or controls  determined necessary or reject the requested license outright.  Crucially, the bill also does not alter or undermine congressional  oversight over direct commercial sales.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694831/international-traffic-in-arms-regulations-licensing-reform-act"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…risk stalling the advancement of technologies crucial to our  competition with the CCP.\n\nSecond, these cuts will likely jeopardize our ability to enforce  critical export controls with the Chinese as well as gutting programs  that help us reshore manufacturing from China.\n\nWhile we have got to restore our fiscal house, these cuts to critical  programs…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688048/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…wholesale  attack on American history, on American democracy, on American  progress, and the stories of our people. It is, at its core, about  power. As George Orwell noted: ``Who controls the past controls the  future. Who controls the present controls the past.''\n\nThis is not, as this administration claims, about patriotism or  telling the American story.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699713/rewriting-history"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…the Nation's largest  polluters would get a free pass. Oil refineries, chemical  manufacturers, pesticide producers, they would all be allowed to shut  off their pollution controls and start spewing some of the most  dangerous chemicals directly into our air: lead, mercury, arsenic,  benzene. When inhaled, these pollutants are known to have significant…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691589/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…afloat  during troubling and uncertain economic times.\n\nUnfortunately, bad actors took advantage of the program early in the  pandemic when SBA removed or weakened internal controls. Upon taking  office, the Biden administration reinstituted longstanding antifraud  controls and put new safeguards into place to curb the flow of pandemic  dollars to fraudsters.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687932/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…cryptocurrency firm. The World Liberty Trump crypto is worse       because it cannot be resold. This Trump crypto buys only       ``governance,'' but only a minority share. Trump controls the       majority of the governance tokens.\n\nNow, the House considers a trio of bills regarding       cryptocurrencies. At the very least, Congress must bar the       president…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…advanced a single bill during this  entire Police Week or even this entire session of Congress to increase  funding to State and local police.\n\nIn fact, the party that now controls the White House and both  Chambers of Congress is now letting DOGE, Elon Musk, and their midnight  crew of computer hackers dismantle entire agencies, fire thousands of  Federal…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…already existed, the Joint Committee on Taxation, to  have their staff produce honest, nonpartisan numbers for the cost of  revenue provisions.\n\nThe section of the law that controls this special reconciliation  process says each provision, whether for a spending program or for  revenue, has to be costed out in order to be able to hold ourselves  accountable.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…House,  and Senator Chris Van Hollen is the sponsor of this bill in the Senate.\n\nThe governors of the states and territories control their National  Guards while the president controls the D.C. National Guard. This bill  would give the D.C. mayor, who knows D.C. better than the president,  the same control over the D.C. National Guard that the governors…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694829/introduction-of-the-district-of-columbia-national-guard-home-rule-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Administration Fraud, Waste And Abuse\n\n``When the [USAID] Inspector General, Paul Martin, reported       on half a billion in food aid that was rotting in warehouses,       having lost controls to prevent diversion to actors who       should not get it, the response was not to address the       problem, but instead to fire the inspector general.'' Dr.       Atul…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…seen growing attacks on  libraries and books nationwide. Now it seems even the Library of  Congress is not off limits.\n\nWhile personnel were fired, this is about power, who controls what  Americans read, learn, and dream. When you limit access to knowledge,  you limit freedom. You send a clear message that questioning authority  is no longer welcome.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691272/attacks-on-library-of-congress"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Rights Act pretends to help  pregnant students. It provides no childcare, no diapers, no formula, no  housing, nothing pregnant students actually need. What it does do is  it controls. Republicans seem to be always about controlling women,  controlling people in their doctor's offices. It is about control.\n\nIt requires schools to tell students about carrying…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…lobbyists who don't like that idea because, apparently, they  make money on the duplications. The inefficiencies and the frauds,  those things are a business model now. Government controls functionally  one-quarter of all the spending in the United States, of all the GDP. A  big chunk of that is functionally waste, fraud, misallocation, or bad  design. Give…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…United States through  the front door, this time with a tourist visa, under the Biden  administration.\n\nThis can never be allowed to happen again, regardless of which party  controls the executive branch. While we have a President who is  committed to securing our borders, protecting our communities, and  restoring the enforcement of our immigration laws,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…truck that is considered a gas guzzler, you could  pay $10 a gallon.\n\nIt is programmable money. You could design any feature in it you want  because the central government controls it.\n\nMr. Speaker, the central government controls it.\n\nThat is why central bank digital currency is truly a threat to  Western civilization. It puts the government between…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…directs Congress and the State Department to  develop a strategy to eliminate adversarial access to the key  technologies used in undersea cables. This strengthens our export  controls, requires transparency and public reporting, and promotes  collaboration with our allies abroad to ensure our standards and  infrastructure are secure.\n\nMr. Speaker, I thank…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694821/undersea-cable-control-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…results and analyses from that ongoing work. Specifically,       this report addresses preliminary results from our\n\n1. covert testing of federal Marketplace enrollment       controls for plan years 2024 and 2025,\n\n2. analyses of federal Marketplace enrollment data for plan       years 2023 and 2024, and\n\n3. evaluation of CMS's fraud risk assessment and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Liccardo  and I have introduced is the only one that actually does not increase  the deficit and, indeed, actually achieves savings for taxpayers.\n\nWe do this with sensible cost controls, income caps, to make sure  that the tax credits go to those who truly need it. You will still be  eligible as long as you are a family of four with an income level up to…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…roughly mirrors the compromise bipartisan bill that I have offered  with the gentleman from California (Mr. Liccardo) that does a temporary  extension with reforms and cost controls to provide runway, so then we  can begin the real hard work of fixing our healthcare system in this  country.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698807/breaking-the-gridlock-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…occurred. Specifically, I am asking Secretary  Kennedy to investigate whether Covered California violated  HIPAA or any other laws, who authorized the use of the trackers, what  controls exist to protect privacy in California's Affordable Care Act  exchange? How did Covered California evade those controls? How many  people have been impacted? Have they been…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Standards for Hazardous Air Pollutants would still exist. All  major sources would still have to abide by their Clean Air Act Title V  permits and various other Federal and local controls and regulations.\n\nRegardless, if Congress were to pass this joint resolution, rubber  tire manufacturers will still be subjected to pollution regulations.  The EPA can always…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…imprisoned, or die of  suspect causes like Alexei Navalny. In Russia, the government targets  religious minorities, imposing fines and criminal charges. In Russia,  the government controls the media. Independent media outlets are  censored, suppressed, or shuttered if they do not conform to the party  line. Under Vladimir Putin, government redistributes private…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Slope Region.\n\nThis vast area includes enormous critical mineral potential of  national and strategic importance. As our geostrategic adversaries  continue to place tighter controls on minerals essential for defense,  advanced technology, and manufacturing, America needs these resources  responsibly developed in places like Alaska. Additionally, the area…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…schedule I controlled substance is a drug, substance, or  chemical that has a high potential for abuse,  has no currently accepted medical value, and is subject to regulatory  controls and administrative civil and criminal penalties.\n\nToday, this Chamber is permanently scheduling fentanyl-related  substances as schedule I.\n\nWe owe it to our communities,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692343/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…unstable, and the conflict constantly threatens  to reignite. Like Saddam and Qadhafi, Maduro is unmistakably a  dictator. He  is a bad guy. He suppresses freedom of speech. He controls his people.  There is no free voting. He treats people poorly, and that is an  understatement.\n\nBut there are a lot of bad guys in the world. There are a lot of  dictators.…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…dollars into  a Blue Cross, Aetna, or some other insurance plan, right?\n\nMr. ROY. I yield to the gentleman from Missouri.\n\nMr. ROY. Because of a broken system created by wage controls post- World War II, instead of employers only being able to get the tax break  when they give dollars to pay Blue Cross to provide some sort of plans  and then you have to…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "Mr. HUIZENGA. Mr. Speaker, the Bureau's overdraft rule would  implement government price controls over a product that has proven  necessary for consumers to make day-to-day purchases.\n\nToday, Congress has an opportunity to invalidate this Biden-era rule  that, if implemented,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689844/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}]