[{"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…legacy is one  of integrity, dedication, and a deep commitment to the belief that  every child deserves a champion. We thank her for her remarkable career  and wish her continued success in all her future endeavors.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691728/recognizing-parvin-ahmadi"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…strengthened the Igbo  community but have enriched the broader Dallas- Fort Worth landscape. I  congratulate them once again on this remarkable occasion and wish them  continued success, growth, and many more milestones in the years ahead.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694153/recognizing-the-igbo-community-association-of-nigeria-dalles-fort-worth"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…currently enrolled  Minnesotans and has proudly graduated over 28,000 students from across  the state.\n\nI congratulate Rasmussen University and I look forward to their  continued success.", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694738/recognizing-rasmussen-university-for-their-125th-anniversary"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…development program that prepares young  people for careers in the rail industry. Her deep commitment to the  next generation is reflected in this initiative, which ensures the  continued success and sustainability of our region's transit systems by  investing in talent right here in the Valley. What truly sets Stacey  apart is her deep belief in partnership and…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696403/recognizing-the-retirement-and-career-of-stacey-mortensen"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…troops, sports teams, students,  and local businesses. The Thanksgiving food drive now feeds hundreds of  families each year and fed over 300 families last year.\n\nThe continued success of this food drive requires extensive  dedication, compassion, and community support. In the weeks and months  leading up to Thanksgiving, Terri starts setting up donation…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699949/recognizing-terri-judah"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…introduced programs  throughout Virginia that are aimed at strengthening the visibility of  Black businessowners.\n\nMr. Speaker, Ernisha's commitment to her community and continued  success serve as an inspiration to us all. As her Representative in  Congress, I am grateful for the work she does each day in pursuit of  economic justice. I congratulate her…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694877/constituent-of-the-week-ernisha-hall"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…who have selflessly given back to our country  and community.\n\nI commend American Legion Post 667 for fifty years of leadership,  service, and sacrifice, and I wish them continued success in the  decades ahead.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695761/recognizing-the-50th-anniversary-of-american-legion-post-667"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…people of Minnesota's 4th Congressional District, I  extend my warmest congratulations to Delta Air Lines on 100 years of  service and innovation, and I look forward to its continued success in  the century ahead.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695050/recognizing-delta-air-lines-100th-anniversary"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…commend Rajiv  Malhotra and the Infinity Foundation for their outstanding  contributions to Hindus around the world. I thank them for their  exceptional work. We wish them continued success in their quest to  foster better understanding and goodwill between Hindu Americans and  other faith communities.", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689467/recognizing-the-contributions-of-rajiv-malhotra-and-the-infinity-foundation"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…fraternity's  mission and its unwavering dedication to leadership development,  community upliftment, youth empowerment and social advocacy. Best  wishes to all of them for their continued success, brotherhood, and  impactful service for decades to come.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697509/commending-the-mu-mu-lamda-chapter-of-alpha-phi-alpha-fraternity-inc-on-its-50th-anniversary"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…Congress will  continue to shape the institution he devoted his career to  strengthening. I thank Gene Dodaro for his extraordinary service to our  country and wish him continued success in the next chapter of his  public service.", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698464/commending-the-honorable-gene-dodaro"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Charles, Matt Koppe, Alix Schnee, and many more.\n\nFrom the floor of the House of Representatives, we salute the Rotary  Club of Yonkers-East Yonkers, and I wish them continued success in all  of their good works.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699979/recognizing-yonkers-east-yonkers-rotary-club"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…community.\n\nI am deeply grateful for Robert's contributions and proud to  represent him in Congress. I congratulate him on this well-deserved  recognition and wish him continued success in all his endeavors.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695269/recognizing-the-work-of-robert-phillips"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…Gibson Center for Senior Services  for achieving this incredible milestone. Granite staters are grateful  for organizations such as the Gibson Center, and I wish them continued  success in the years to come.", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691690/recognizing-the-gibson-center-for-senior-services-serving-two-million-meals"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…collaboratively to ensure the Senate       discharged its constitutional responsibilities effectively.       Our responsibilities are important--vitally important--to the       continued success of our Republic. Our arcane rules and       customs are deliberatively intended to require broad       cooperation to function well at all. The most revered Members…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…taxpayer funds.\n\nMr. Speaker, I ask my colleagues to join me today in celebrating the  lifetime of work that Mr. Ellis has accomplished and wish him many more  years of continued success.", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688911/recognizing-mr-bill-ellis-for-his-contributions-to-long-island"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…an inspiration for  aspiring athletes everywhere.\n\nI applaud the SLCC Cross Country Program for their extraordinary  accomplishments, and I look forward to seeing their continued success  in the years to come. Their hard work, resilience, and sportsmanship  embody the best of what it means to be a Bruin.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690034/recognizing-the-slcc-cross-country-team"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…space.\n\nWith these resources, the State's workforce is uniquely positioned to  lead in areas that complement Northrup Grumman's work, creating a  synergy that ensures the continued success of space missions.\n\nUtah State University boasts one of the longest histories of  connections to space technologies with the establishment of Electro- Dynamics Laboratories…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687925/space-dominance"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…and partners of the  Mojave Water Agency for 65 years of exemplary service. I ask my  colleagues to join me in honoring this remarkable institution and in  wishing it continued success for decades to come.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694201/recognizing-the-mojave-water-agency-on-the-occasion-of-its-65th-anniversary"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…nonprofit programs.\n\nMr. Speaker, with a distinguished legacy of leadership, I  congratulate the entire DeGol family on this milestone anniversary and  offer best wishes for continued success.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699740/confronting-the-disease-of-addiction"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…Coach Schnall and all of the players on a season to  remember. Their run inspired fans across the Nation and reminded us why  we love this game. We look forward to their continued success in the  years to come. Chants Up.                     Honoring Robert Franklin Childs III\n\nMr. FRY. Mr. Speaker, I rise today to honor the life and legacy of a  dear…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692819/recognizing-coastal-carolina-university-baseball-team"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Mr. Speaker, I ask that the United States House of Representatives  join me in honoring Gary Braunscheidle for his remarkable 62 years of  service and in wishing him continued success and fulfillment in his  ongoing commitment to the community.", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699580/recognizing-gary-braunscheidle"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…2025. I  congratulate the Cocalico girls' soccer team on their accomplishments  in 2025 and coaches Hogan and Parmer, for their well-deserved  recognition. I wish them continued success both on and off the field.", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699464/congratulating-coach-dan-hogan-and-coach-lynn-parmer-on-coaching-honors"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Texas' Certificate of Appreciation. I am pleased to commend Carmen  for her dedication to serving and representing the City of Celina with  distinction, and I wish her continued success for many years to come.\n\nIt is an honor to bestow Cannen with the Patriot Award for her  exceptional service to the people of North Texas.", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690747/recognizing-congressional-patriot-award-recipient-carmen-roberts"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…soldiers. Her legacy is one of dedication, leadership, and  unwavering professionalism. I ask my colleagues to join me in honoring  her exceptional career and in wishing her continued success and  fulfillment in retirement.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693420/recognizing-jennie-fregoso-and-her-distinguished-military-career"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…and you try to do things  right, people will appreciate it,'' and that is exactly what Smith's  has done for decades.\n\nHere is to many more years of sweet memories and continued success  for one of the most popular small businesses in California's 20th  District.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690793/recognizing-smiths-bakeries"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…are incredibly grateful for the impact Jenya Rahazhynskaya has had  throughout her career and we happily celebrate the first anniversary of  her salon. We wish for her continued success as she continues to serve  and uplift our community.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691903/recognizing-beauty-moods-one-year-anniversary"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…will be recorded in the historical  annals and remembered by all who have witnessed her profound impact. On  behalf of the U.S. House of Representatives, we wish her continued  success and look forward to her enduring leadership in the continuous  struggle for a world where all are free.\n\nMr. Speaker, please join me in recognizing Annie Wilcox Boyajian's…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700047/recognizing-the-service-of-annie-wilcox-boyajian"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…this outstanding honor of being named the  2025 TIME Dealer of the Year. I commend him for all his contributions  to the community and wish him and his family's business continued  success.", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690130/time-dealer-of-the-year-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…children.\n\nI extend my heartfelt thanks to Rabbi Ciment for delivering a  beautiful opening prayer.\n\nMr. Speaker, I wish him, his family, and Chabad Lubavitch of Arkansas  continued success in serving the central Arkansas community.", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689253/welcoming-guest-chaplain-rabbi-pinchus-ciment"}]