[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…seniors is one of my highest  priorities in Congress, and that is why last year, when Social Security  celebrated its 90th birthday, I introduced a resolution to demonstrate  continued support from Congress for this program. It must be  strengthened to support Americans and the next generation throughout  their retirement for decades to come.\n\nRaising the…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699878/protecting-social-security"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Large companies have in recent years been able to negotiate lower  percentages for this process, which reduces their overall fee. At the  same time, smaller companies have continued to pay the same historic  percentage for this service.\n\nSimply put, this bill sheds light on how much small- and medium-sized  companies are paying for their underwriting…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693906/middle-market-ipo-cost-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…and adoption of  a master plan of local ecology preservation for the largest undeveloped  ecosystem in northern Middlesex County. This oversight will be  instrumental in the continued restoration of the Woodbrook Superfund  Site, and associated conservation efforts throughout the area. Dorothy  played a pivotal role in securing grants from Sustainable…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698050/recognizing-dorothy-giamboi-for-nearly-fifteen-years-of-public-service"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…people of Colorado's Seventh Congressional District,  it is my honor to congratulate John Curtis on his promotion to Chief of  South Metro Fire Rescue. We thank him for his continued commitment to  our community.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692026/recognizing-john-curtis"}, {"senator": "Ami Bera", "party": "Democrat", "sentence": "…living. Even though founding  residents experienced hardships like the Great Depression, World War  II, and a devastating freeze that wiped out many citrus crops, the area  continued to thrive and develop.\n\nAs Fair Oaks grew, so too did its industry and commerce. The  completion of the Folsom and Nimbus dams, and arrival of Aerojet  signaled a new page…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696704/recognizing-the-130th-anniversary-of-fair-oaks"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…if in this  bill, this big, beautiful bill that the President would have us sign  off on that I am already antithetical to, if there is money in that  bill to support the continued ethnic cleansing, the continued  inhumanity that is taking place against the Palestinians, I cannot  support that. I will not vote to send more money to see innocent men,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691156/speaking-truth-about-power"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…of children were killed and injured. Thousands are amputees.  And in just the last 3 months, the last 3 months--May, June, and July-- the Netanyahu government campaign has continued, and thousands more  homes have been flattened by controlled demolitions. That literally  means the military folks go up to a home, wire it, and blow it up. It  is a home.…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694438/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…registration and protects against race- based discrimination at the ballot box. The John Lewis Voting Rights  Advancement Act passed the House in 2021, but House Republicans have  continued to refuse to bring the bill to the House Floor for a vote.\n\nAgain, I oppose H.R. 22, the Republican SAVE Act, and I urge my  colleagues to join me in voting NO.", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690125/safeguard-american-voter-eligibility-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…American Hospital Association says more than 200,000 new registered  nurses are needed each year to meet increasing healthcare needs and to  replace retiring nurses. AHECs have continued to work towards  addressing workforce shortage areas, especially in rural and  underserved communities. Just in the past 5 years, the AHEC program has  trained 2 million…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689246/national-ahec-week"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Department of Energy and NASA's partnership is already  demonstrating impressive results. For example, earlier this year, NASA  and the DOE collaborated on selecting an award for continued industry  work on a space microreactor design that could provide a supply of  power for use on the Moon and beyond.\n\nJust last week, scientists posted new data from the Department…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688987/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…impacting the lives  of tens of thousands of patients. By prioritizing quality and  efficiency, we've cultivated a strong, dedicated team that has been  instrumental in our continued growth.''\n\nAmbulatory surgery centers (ASCs), such as DEC, are critical in  delivering timely preventative care, including vital screenings like  colonoscopies and endoscopies.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695923/recognizing-the-physicians-at-dallas-endoscopy-center"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…audit  will also result in a report with recommendations to improve the  program, which is important because evaluating and improving the  initiative is paramount for its continued progress.\n\nI believe the Energy Transitions Initiative Authorization Act can  further clean energy advancements in our most vulnerable communities. I  urge my colleagues…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692645/introduction-of-the-energy-transitions-initiative-authorization-act"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…the Gibson Center for Senior Services  for achieving this incredible milestone. Granite staters are grateful  for organizations such as the Gibson Center, and I wish them continued  success in the years to come.", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691690/recognizing-the-gibson-center-for-senior-services-serving-two-million-meals"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…even then he knew he would have to fight and work hard to achieve the  American Dream. He worked as a janitor to help to support his mother  and his young siblings while he continued to work to make sure he  pursued the American Dream.\n\nCarlo is a first-generation college graduate and has begun his career  as a financial auditor, and recently he earned…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689385/daca-and-the-american-dream"}, {"senator": "Grace Meng", "party": "Democrat", "sentence": "…34,000 women and girls who otherwise would have died from complications  of pregnancy and childbirth.\n\nThe UNFPA is a critical piece of that puzzle too. This bill ensures  continued funding for international organizations, including UNFPA.\n\nHistory has taught us that we cannot bury our head in the sand and  abandon the international community without…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699050/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…community.\n\nOn behalf of everyone in Pennsylvania's 13th Congressional District,  I express gratitude to Stewart for his distinguished legacy of service  and offer best wishes for continued success.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698643/recognizing-the-public-service-and-community-leadership-of-c-stewart-cleaf"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Organizations, Jeffrey began his journey at  the University of California, San Diego where he studied biochemistry  and cell biology. After graduating UC San Diego in 1988, he continued  his studies at the University of California, Los Angeles--School of  Public Health where he received his Master of Public Health degree. He  also attended UCLA Anderson…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694737/recognizing-jeffrey-b-caballero-mph-executive-director-of-the-association-of-asian-pacific-community-health-organizations-aapcho"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…is what our spending has  done.\n\nOur revenue has actually stayed at approximately 17 percent through  Republican and Democratic administrations. That means our revenue has  continued to grow, but it actually stays consistent as a percentage of  our entire GDP. Our spending has grown, up to 26 percent.\n\nThat is why you see in a Republican reconciliation…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…capabilities, strengthen our  nuclear forces, and expand our missile defense, all critical elements  of our national security.\n\nFirst and foremost, this bill supports the continued modernization of  our Nation's nuclear triad, our nuclear command and control systems,  and the scientific capabilities that maintain our nuclear stockpile. We  also established…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697798/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…very courageous work. I am proud to back the blue. I am  also grateful for their work to maintain the peace.\n\nAs chairman of the Senate Judiciary Committee this year, I have  continued my work to support law enforcement in Iowa but also  nationwide. In that role, I worked with Senate Republicans and the  White House as part of the Working Families Tax Cut…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698692/national-law-enforcement-appreciation-day"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…County.\n\nKathy is known by others for her quick wit, thoughtful guidance, and  for her significant contributions to the Mono County Board of  Education. Her leadership and continued devotion to service have been  the hallmark of her career.\n\nIt is because of people like Kathryn Mandichak that Mono County is  such a great place to live, to learn, to work,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688154/protect-medicaid-benefits-for-american-citizens"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…fostering mutual respect and religious tolerance on a global level.\n\nI look forward to the opportunity to welcome His All-Holiness and  express our collective gratitude for his continued leadership and  dedication to the cause of peace and religious liberty. In the words of  His All-Holiness: ``If our age will be remembered, it may be for those  who dedicated…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695541/welcoming-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomews-2025-visit-to-the-united-states"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Ribbon. These honors stand as a testament  to Mr. Tarr's unwavering dedication to his fellow Servicemembers and  our great Nation.\n\nAfter retiring from the U.S. Army, Mr. Tarr continued to serve his  community, fellow Veterans, and country as a member of numerous Veteran  organizations. Serving as a National Committee Member and Volunteer  Director for Wish…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696875/recognizing-mr-michael-tarr-on-being-named-marquette-county-veteran-of-the-year"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…example of how we strengthen our economy  by investing in our communities, empowering our workforce, and leading  the way in advanced manufacturing.\n\nI commend Alstom for their continued commitment to Hornell and thank  the skilled men and women who are driving this legacy forward.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692434/recognizing-alstoms-plant-in-hornell"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…soldiers. Her legacy is one of dedication, leadership, and  unwavering professionalism. I ask my colleagues to join me in honoring  her exceptional career and in wishing her continued success and  fulfillment in retirement.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693420/recognizing-jennie-fregoso-and-her-distinguished-military-career"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…Department of the  Interior, Environment, and Related Agencies Appropriations Act.\n\nFirst, I commend Chairman Cole for his leadership over the  Appropriations Committee and his continued support of the Interior  bill. A lot of people don't realize how hard it is to get all these  bills done. We had them all marked up through the committee by the end  of September,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698758/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…combined Active-Duty and Air  National Guard service, he elevated the CRTC's role in preparing  warfighters for great power competition.\n\nUnder his leadership, the center continued hosting quarterly large  force exercises, training specialists in theater-deployable  communications, and delivering exclusive cross-demand training from  Charleston to Orlando.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699886/mark-burns-inducted-into-living-legends-of-aviation"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…my colleagues in the United States House of Representatives  to join me in honoring the East Palestine Fire Department for  150 years of exemplary service and to wish them continued strength and  success for many years to come.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693528/congratulating-the-east-palestine-fire-department-for-150-years-of-service"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…for every professional truck driver and  an especially difficult goal for a woman professional truck driver.  Since her professional driving career began in 2006, Karen has  continued to further her education, completing, with Honors, a Business  Management course through Cleveland State Community College. Karen  recently completed an Advanced Critical…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689097/recognizing-ms-karen-partin"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…memoir, ``Witnessing the  American Century,'' sharing insights from a life lived at the  crossroads of world events.\n\nEven in his nineties, Allen embraced new adventures as he continued  to inspire students and veterans alike. Captain Brady exemplified the  values of patriotism, courage, and honor.\n\nIn his words: ``We will always need people who are willing…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691271/congratulating-northwest-florida-state-womens-basketball-team"}]