[{"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…provide assistance  to veterans, widows, and orphans. The National Woman's Relief Corps, as  it is now known, was congressionally chartered on September 7, 1962,  and continues to serve all of our veterans and their families.\n\nCongress has incorporated both public and private organizations since  1791. While organizations are free to incorporate under…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699500/moving-national-womans-relief-corps-incorporation-and-domicile-to-illinois-principal-office-to-murphysboro-illinois"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Veteran--and is further honored by two  nephews currently serving in the U.S. Marine Corps; and\n\nWhereas, with 48 years of experience in the field of dentistry, Cindy  continues to serve her community even in retirement, offering her time  and skills where needed and bringing the same care and diligence to her  professional life as she has to her AMVETS…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690126/proclamation-for-national-amvets-auxiliary-president-cindy-rice"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…creation, educating the next generation of  scientists, and strengthening economic growth.\n\nMedical research through the support of the National Institutes of  Health (NIH), continues to serve a vital role in the medical research  enterprise. This research can lead cutting edge preventative strategies  and research for treatments and additional cures for longstanding…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695475/introduction-of-a-resolution-recognizing-medical-research-week-from-september-15-through-september-2025"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…the United States in search of the American  Dream.\n\nIn the early 1990s, Alicia earned her certification as a certified  nurse assistant.\n\nToday, 30 years later, Alicia continues to serve her community at  French Park Care Center, where her impact is felt by her patients, her  colleagues, and the families she touches and supports on an everyday  basis.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692112/recognizing-diana-anahi-barrios"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "…improved policies  for the Police Department's interactions with homeless individuals, and  the Department's de-escalation and use of force protocols. Ms.  Figueroa-Villa continues to serve on numerous executive boards and  commissions, notably including the City's Children, Youth, and Family  Commission and the Los Angeles Unified School District's Redistricting…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696024/recognizing-the-achievements-of-sandra-figueroa-villa"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…the United States of America.\n\nColonel Dinh is married to Ashlie Anne Dinh, and they have two  daughters, Quintessa and Montelena.\n\nIn his civilian career, Colonel Dinh continues to serve honorably,  keeping our communities safe as an Orange County deputy sheriff, where  he has served for 27 years.\n\nMr. Speaker, I appreciate his commitment to service not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695089/congratulating-colonel-dominic-v-dinh-on-his-retirement"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…relationship between the United  States and Jordan and further expanding the military-to-military  relationship between Jordan's Armed Forces and ours.\n\nThis partnership continues to serve as a steadfast, capable,  strategic partner for peace and stability in the region. We need strong  allies. Jordan has been and continues to be one of our strongest.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…later modernized by Congress  to become the U.S. Postal Service on July 1, 1971, was created to  connect individuals and communities across the country.\n\nToday, USPS continues to serve communities and is relied on for its  ability to conduct last-mile deliveries that have rapidly increased in  the era of e-commerce. As USPS passes this incredible milestone,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698928/recognizing-american-postal-workers-chicago-local-0001"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…documented than his death.  Crispus Attucks escaped from slavery in Framingham, Massachusetts, in  1750 and spent two decades on trading ships and whaling vessels. His  death continues to serve as a reminder that African Americans took an  active role in the path to American independence, not a passive one.\n\nThe poet John Boyle O'Reilly celebrated Attucks as…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…recognize Monica Gurell during Jewish American  Heritage Month. Her unwavering dedication to faith, education, and  community has enriched the lives of countless others and continues to  serve as a beacon of strength.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691572/recognizing-monica-gurell"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…programming, and  better serve youth in the community.\n\nMr. Speaker, I thank the majority for working with us in the markup  to add language that ensures that this property continues to serve a  public purpose by the Boys & Girls Club. This is an important assurance  and guarantee.\n\nMr. Speaker, I urge support for this bill, and I reserve the balance  of my…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697650/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…through established and secured  channels.\n\nThe bill also provides other technical fixes and clarifications to  the already strong bipartisan AUKUS foundational text which continues  to serve all three AUKUS countries.\n\nAs the Trump administration conducts its belated review of AUKUS,  many of us here in Congress on both sides of the aisle look forward to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694780/aukus-reform-for-military-optimization-and-review-act"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…quiet strength of his  character.\n\nThat faith extended far beyond his home. Mr. Brewton was a founder of  the Brownsville Assembly of God in Pensacola, a church that continues  to serve his community today.\n\nThrough his life, he set a shining example--before his children, his  family, all who knew him, and to us--of what it means to honor God and  country.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700061/9999"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…respecting the  customer, offering competitive rates, and serving the community. Across  Kentucky, with 23 banking centers and three loan production offices,  Forcht Bank continues to serve Kentuckians and Bluegrass businesses.\n\nMr. Forcht's role has allowed for the enhancement and visionary  leadership of Forcht Bank to celebrate this 40th anniversary signifying…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688348/draining-the-swamp-in-order-to-put-america-first"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Deployment Ribbon with one  Bronze Service Star, and the Presidential Unit Citation.\n\nFollowing his honorable discharge in 2023, Mr. Moceri returned to  Michigan and continues to serve his community as a Construction Project  Manager with Moceri Companies, supporting development projects across  Lake Orion, Auburn Hills, Rochester Hills, and the City…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699292/recognizing-united-states-marine-corps-veteran-domenico-s-moceri"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…quarters in September 1925 with just four boys and four  teachers. One year later, the founders purchased the historic Michener  Farm, establishing the permanent campus that continues to serve  generations of students to this day.\n\nJust down the road from Solebury stood the Holmquist School for  Girls, founded in 1917 by Miss Karline Holmquist, who shared a…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696356/recognizing-the-100th-anniversary-of-solebury-school"}, {"senator": "John Carter", "party": "Republican", "sentence": "…honored to join LT Frick's friends and family in celebrating his  years of dedicated service and sacrifice. I applaud his work and wish  him success and safety as he continues to serve our community with  pride and honor.", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689331/saluting-the-service-of-lieutenant-brian-m-frick"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…She also joined the American Legion  Post 121 and actively supported their events. In late 2007, she became  involved with the McLennan County Veterans Association and continues to  serve as secretary, helping organize major community events such as  Vet's Fest and Veterans Day parades.\n\nAfter resigning from the Purple Heart organization in August 2019,…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696274/recognizing-technical-sergeant-martha-socorro-ybarra-usaf-retired-with-a-congressional-veteran-commendation"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…assistance  with VA benefits, community outreach, financial support for Veterans in  need, and programs to honor the sacrifices of those who served. Today,  Post 3134 continues to serve the needs of Veterans from its surrounding  communities under the leadership of its Commander, Jesse Casari.\n\nMr. Speaker, it is my honor to recognize VFW Ottawa Post…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696860/recognizing-the-80th-birthday-of-the-veterans-of-foreign-wars-ottawa-post-3134"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…troops and American troops in combat lifesaver skills.\n\nLyndsay medically retired in 2017 after service-connected injuries,  but today, Lyndsay is pursuing her Ph.D. and continues to serve fellow  veterans in our community.\n\nMr. Speaker, I salute Lyndsay Gray for outstanding service and her  lasting contribution to Floridians and all Americans.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691773/recognizing-lyndsay-gray"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…Church, to his and my home city of Kingston, and to families  across the Hudson Valley.\n\nElder Childs was born and raised in Kingston, New York, the very  community that he continues to serve to this day. He graduated from  Kingston High School, my alma mater, before beginning his career  working for IBM. He worked initially as a mail clerk and took every…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694021/recognizing-cornwall-cleanup-crew"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Cameron  Chamber of Commerce, which named him Citizen of the Year in 2007 and  presented him with its Lifetime Achievement Award in 2023. As a man of  great faith, Bill continues to serve as pastor of Davilla Baptist  Church.\n\nThrough community, both broadly as an American and much more  personally in any number of ways, through family, and of course through…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696330/recognizing-william-bill-forest-harris-with-a-congressional-veteran-commendation"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…for the impact Jenya Rahazhynskaya has had  throughout her career and we happily celebrate the first anniversary of  her salon. We wish for her continued success as she continues to serve  and uplift our community.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691903/recognizing-beauty-moods-one-year-anniversary"}, {"senator": "John Thune", "party": "Republican", "sentence": "…people and multiple businesses, Veblen is known for its rich  historical heritage and robust rural spirit. Since its beginning 125  years ago, the community of Veblen continues to serve as a strong  example of South Dakota values and traditions.\n\nI offer my congratulations to the citizens of Veblen on its  quasquicentennial and wish them continued prosperity…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692899/recognizing-the-125th-anniversary-veblen-south-dakota"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…Leader Award,  an honor bestowed upon alumni from the past decade who have achieved  early career success and made a positive impact in their communities.\n\nToday, Bryan continues to serve our country as a Special Assistant to  President Donald J. Trump. In this role, he will continue to fight for  our America First agenda and the hardworking men and women…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697548/recognizing-and-expressing-gratitude-to-former-chief-of-staff-bryan-brody"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…star,  a Meritorious Unit Commendation, a Global War on Terrorism Service  Medal, and a Presidential Unit Citation for OIF combat support. Upon  retiring, Ms. Prehoda continues to serve her country through  memberships in various Veteran organizations such as the American  Legion, Veterans of Foreign Wars, the Marine Corps League, and many  more.\n\nMr.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696846/recognizing-valerie-prehoda-on-her-induction-into-the-michigan-tech-president-council-of-alumnae"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…and disaster professional.\n\nMr. Sheffield's service also extends into the 911 Coordinators  Association and 6 years with the Jones County Coroner's Office, where  he continues to serve as deputy medical examiner.\n\nMr. Speaker, Mr. Sheffield's decades of leadership and dedication  have strengthened emergency preparedness across our State. Today, I am…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697326/recognizing-paul-sheffield"}]