[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…in support of H.R. 1549, the China Financial  Threat Mitigation Act, sponsored by Mr. Williams of Texas and Mr.  Gottheimer of New Jersey.\n\nThe People's Republic of China continues to pose a significant  challenge to America's economy and financial system. This doesn't mean  that China is simply an economic competitor. Rather, China has taken an  aggressive…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694120/china-financial-threat-mitigation-act-of-2025"}, {"senator": "Grace Meng", "party": "Democrat", "sentence": "…projecting our  soft power, were fired.\n\nThis bill isn't the one Democrats would have written if we were in  the majority, but I want to share why I support it. First, it continues  U.S. support for women around the world. Women are one-half of the  world's population, but too many still face obstacles to economic  opportunity, gender equality, and…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699050/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…the  CBP. It is what the vast majority of Americans want Congress to do.\n\nIt is good news that we have a deal to fund these key programs that  families count on while work continues on serious DHS accountability  over the next 2 weeks. It could not be more clear that ICE and the CBP  are out of control and that we cannot just wait for the same President…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699437/consolidated-appropriations-act-2026"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…we proved that what is good for  the air is good for business. What is good for the planet and public  health is good for the economy.\n\nBut, meanwhile, the cost of inaction continues to hit Americans where  it hurts the most: in our wallets. In 2021, the Natural Resources  Defense Council estimated that air pollution from fossil fuels cost  Americans…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…time that our Republican colleagues vote for this bill,  they will continue to remain silent as President Trump's callous  willingness to risk the safety of all Americans continues by his  planning to eliminate the CPSC and fold its mission into the Department  of Health and Human Services, which itself will have a dramatically  smaller workforce and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Navy Veteran--and is further honored by two  nephews currently serving in the U.S. Marine Corps; and\n\nWhereas, with 48 years of experience in the field of dentistry, Cindy  continues to serve her community even in retirement, offering her time  and skills where needed and bringing the same care and diligence to her  professional life as she has to her…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690126/proclamation-for-national-amvets-auxiliary-president-cindy-rice"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…home insurance, and electric bills are all soaring. The cost of beef,  coffee, and vegetables just keep climbing.\n\nPeople are really struggling to get by, yet Donald Trump continues to  block SNAP benefits to 42 million struggling seniors, parents, and  veterans.\n\nHow anyone could swipe food from the plates of nearly 20 million  children like that is…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…roll back free speech.\n\nLet's be clear. We do not have a democracy if we erode the right to  free speech. We will not have a democracy if the President of the  United States continues to abuse his power and push authoritarian  measures.", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692811/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…degree in  political science and sociology from UCLA with high honors and  completed a master's degree from Johns Hopkins University.\n\nDiana's commitment to public service continues to be unwavering, and  I was honored to name her as one of my 2025 Women of the Year.                            Honoring Denise Osorio\n\nMr. CORREA. Mr. Speaker, today I…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692112/recognizing-diana-anahi-barrios"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Many seniors who could have seen an increase of about $56 in their  monthly Social Security payments will be lucky to see $38 after premium  increases.\n\nThis administration continues to attack Americans' access to  healthcare and undermine affordability.\n\nThis is simply a disgrace.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697122/americans-access-to-healthcare-under-attack"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…further weakening the trust fund that is already under  stress.\n\nIf Congress does not act by 2033, there will be a 20 percent cut  across the board for everyone. If Trump continues down his path of not  paying for benefits, it will be over a 36 percent cut. There are over 5  million Americans, fellow citizens, who have paid in all their life and  got…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688584/congress-has-not-enhanced-social-security-in-more-than-50-years"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…connections  to their family members, land, the beautiful olive groves, and the 400  Palestinian villages that they all grew up in. We, of course, see that  the Israeli Government continues to illegally steal Palestinian land in  the occupied West Bank where my family lives. They illegally evict  Palestinian families, Mr. Speaker, demolish homes, and deny  Palestinians…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691384/the-nakba-never-ended"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…species'  needs below the Glen Canyon Dam, and preliminary data showed promising  results in protecting native fish species.\n\nAs drought conditions worsen and water demand continues to increase,  it is more critical than ever to ensure water management appropriately  balances agricultural, municipal, industrial, and environmental needs.\n\nThis legislation…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691058/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Moreland. She says: ``It is unthinkable  that our congressional decisionmakers continue to push to exploit the  Coastal Plain of the Arctic Refuge for oil and gas drilling.''\n\nShe continues: ``We rely on the caribou, not only spiritually and  culturally, but for our survival and subsistence. This action from D.C.  is an insult to the Gwich'in people and ignores…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…today to join my colleagues in reflecting on the  life, legacy, and enduring moral leadership of the great Dr. Martin  Luther King, Jr., whose vision of justice and equality continues to  shape our Nation's conscience.\n\nDr. King's work reminds us that progress in this country has never  been inevitable and that the rights and freedoms that we cherish have…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699198/building-a-beloved-community"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…borders policy that has  been pushed by the Democrats.\n\nPresident Trump won in 2016 on a few issues, but the electrical cord  that began when he came down the escalator, that continues to this day,  is taking on illegal immigration and the forgotten men and women of  this country whose jobs were initially displaced when the failed  policies of the politicians…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…see increased wages of  $7,200 on average. It contains my bipartisan legislation to make  research and development expensing permanent, a jobs provision ensuring  America continues to lead the world entirely on innovation. It  eliminates fraud and waste in ObamaCare, and it builds on President  Trump's successes at securing the border.\n\nDespite the…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693193/one-big-beautiful-bill-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…of  Northeast Georgia Health System, Dr. Hanley has demonstrated  exceptional vision and a relentless pursuit of excellence.\n\nDr. Hanley's seamless transition to leadership continues Northeast  Georgia Health System's remarkable growth, including five hospitals,  advanced medical programs, and an economic impact exceeding $7.5  billion.\n\nNamed alongside…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700076/recognizing-dr-matt-hanley"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "…same and protect  our children from the malign influence of the CCP.\n\nThe PROTECT Our Kids Act would prohibit Federal funding for any  elementary or secondary school that continues to host a Confucius  Classroom. Schools will be notified of these requirements and given  guidance for how to comply.\n\nTo be clear, this legislation is only concerned with…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697531/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…is Wyoming coal. We need more of it--not less of it--to power  our Nation. It is available, affordable, and reliable. This has powered  our Nation for  over a century. It continues to be a major source of power for our  Nation, and we need it far into the future.\n\nAnd today, to that case, President Trump is going to sign an  Executive order making clear…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689762/coal"}, {"senator": "James Risch", "party": "Republican", "sentence": "…$296       million.\n\nThis proposed sale will support the foreign policy and       national security of the United States by improving the       security of a NATO Ally that continues to be an important       force for political stability and economic progress in       Europe. This sale is consistent with U.S. initiatives to       provide key allies in…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692048/arms-sales-notification"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…of Firetrucks.''\n\nThough Young Fire closed in 1991, Dick's passion for innovation never  waned. In 1993, he launched the Performance Advantage Company in  Lancaster, which continues to design and distribute tool and equipment  mounting solutions for the fire service, military, and other industries  in over 38 countries.\n\nIn 2007, Dick established the…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690585/recognizing-the-life-of-service-of-dick-young"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…States and Turkiye have  worked together to promote regional stability, strengthen transatlantic  security, and advance the values of freedom and democracy. Our  collaboration continues to play a vital role in addressing global  challenges--from counterterrorism and defense cooperation to  humanitarian efforts and energy security.\n\nOur bilateral economic…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696871/recognizing-the-102nd-anniversary-of-the-founding-of-the-republic-of-turkiye"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…our  Nation's security through aerial spray, fire suppression, weather  reconnaissance, tactical airlift and airdrop and aeromedical  evacuation.\n\nAs Major General Coburn continues her service to the United States  upon her departure from Dobbins Air Reserve Base and the 22nd Air  Force, it has been a pleasure working closely with her to benefit our…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691981/recognizing-major-general-melissa-coburn-for-her-service-to-the-22nd-air-force"}, {"senator": "French Hill", "party": "Republican", "sentence": "…our Conference chair, Mrs.  McClain, demonstrates that the United States is a vital partner in  supporting Taiwan. We must remain committed to supporting Taiwan as  China continues to increase its military presence across the Taiwan  Strait.\n\nThe U.S. and Taiwan have maintained a firm stance against any  forceful efforts to change Taiwan's status for…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693876/taiwan-conflict-deterrence-act-of-2025"}, {"senator": "John Carter", "party": "Republican", "sentence": "…capabilities to our warfighters. He is also a champion for  expanding vocational education for all students, ensuring they are job-  or college-ready upon graduation.\n\nCOL Wilson continues to lead with strength, integrity, and dedication  for the betterment of his community. Aside from his role as State  Representative, he strives to support the next generation,…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689389/saluting-the-service-of-colonel-terry-wilson"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…began his career after purchasing a small gas station, going on to  own nine different domestic and foreign car dealerships across east  Tennessee. At the age of 90, he still continues to go into the office  three to four times a week, Mr. Speaker. I think Congress could learn a  lot from his work ethic and dedication to his community.\n\nRoscoe is also a…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692873/happy-90th-birthday-to-willis-roscoe-bowman"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…family, built by hard work, and  driven by a relentless belief in the power of community. We thank him  for the lives he's uplifted, the jobs he's created, and the example he  continues to set for what local leadership should look like.\n\nHe hasn't just carried forward a legacy--he's forged one of his own.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690252/recognizing-michael-j-mabin-jr-50-years-of-life-leadership-and-service"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…paying the bill, the patient doesn't care about  price, and the payer doesn't care about quality. The result is costs  spiraling out of control while patient satisfaction continues to  decline.\n\nAt the center of socialism is the mistaken belief that profit is  waste, and if it can be removed from the equation, everything will be  cheaper. That is the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697036/government-is-still-the-problem"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…overall as the Artemis Award  Winner with their development of the ``Production of Steel from Lunar  Regolith through Carbonyl Iron Refining'' project.\n\nAs the space industry continues to grow and evolve, Utah is at the  heart of it all, leading through ingenuity, collaboration, and  unwavering dedication to the future.\n\nMr. Speaker, I say to my good friend…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687925/space-dominance"}]