[{"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…her commitment to service. She was an inspiration to all  of us who knew her and called her a friend. Please join me in honoring  Gwen Watson for her invaluable contributions to her community and to  our country.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692306/recognizing-gwen-watson"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "Mr. CORREA. Mr. Speaker, I rise today to recognize Jessie Echaury for  his military service and contributions to our community.\n\nIn 2016, Jessie served our Nation as a U.S. Army soldier in  Afghanistan. A decade later, he now serves other veterans as president  of Cal State Fullerton's…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689745/recognizing-jessie-echaury"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…private practice.\n\nOn behalf of the people of Colorado's 7th Congressional District, it  is my honor to congratulate Tom Downey for his awards and thank him for  his contributions to our community.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696277/recognizing-tom-downey"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Recognizing Bharat Patel\n\nMr. CORREA. Mr. Speaker, I rise today to recognize my very good  friend, Mr. Bharat Patel, for his incredible career and contributions  to our community.\n\nIn 1976, the Patel family purchased the original Peter Pan Motor  Lodge in Anaheim, right across from Disneyland. Almost 50 years later,  Mr. Patel's leadership…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691173/congratulating-loris-griset-academy"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…NOW-NJ's legacy of resilience will live on for generations.\n\nMr. Speaker, I sincerely hope my colleagues will join me in honoring  NOW-NJ for their exceptional contributions to the community and  congratulating them on their 50th anniversary of service.", "date": "2025-11-25", "source_url": "https://justfacts.votesmart.org/public-statement/1697164/recognizing-the-50th-anniversary-of-the-national-organization-for-women-of-new-jersey"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…who, sadly, passed away last month.\n\nA North Carolina native, Ambassador Hyde was a trailblazer who paved  the path for generations of women in our State. Her contributions to  our community span industries, from her time as a social worker and  teacher to serving as the first woman on the North Carolina Board of  Transportation.\n\nAmbassador Hyde was…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689166/womens-history-month"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…March 24, 2025. Sepi was  a trailblazer and beloved member of the Wake County community who  nurtured her company from the ground-up in a male-dominated field. Her  contributions to our community will live on for years to come in her  children, friends. and the many members of our community she touched  throughout her life.\n\nBorn on October 10, 1962, Sepi…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689506/recognizing-the-life-and-legacy-of-sepi-saidi"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…that we ask or think, according to the  power that works in us.''\n\nThe 12th Congressional District is pleased to welcome Reverend  Robinson and look forward to his contributions to our community. We  wish him all the best in his leadership and ministry and look forward  to the significant impact he will have on the C.M.E. Church and our  district.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695372/recognizing-reverend-dr-perrico-j-robinson-sr"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…district. As the centerpiece of downtown Akron's Main  Street corridor, you can find a statue of a rubber factory worker  standing tall in commemoration of their contributions to our community  that is 200 years old this year. Unfortunately, a generation later, we  know now that the stories of far too many rubber workers and families  included cancer,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688529/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…Together, we must make a little noise and create good trouble to  protect the progress we have fought so hard for. Together, we can  ensure that the stories and contributions of our community continue to  inspire and uplift future generations.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687894/black-history-month"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "Mr. CORREA. Mr. Speaker, I rise today to recognize Mr. Bharat Patel  for his incredible career and contributions to our community.\n\nIn 1976, the Patel Family acquired the original Peter Pan Motor  Lodge, located right across the street from Disneyland, and began  renovating and expanding it…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688533/recognizing-mr-bharat-patel-for-his-contributions-to-our-orange-county-community"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…100th anniversary  of The Garden Club of Alexandria, which was founded in 1925 and  distinguished by a century of hands-on service, civic leadership, and  lasting contributions to our community.\n\nFor one hundred years, The Garden Club of Alexandria has been a  cornerstone of our community, dedicated to inspiring a love of  gardening, advancing civic beautification…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697252/recognizing-the-garden-club-of-alexandrias-centennial"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Dorothy stands as the longest-serving Council Member in  Metuchen's history. Please join me in celebrating my long-time friend,  Dorothy Giamboi, for her outstanding contributions to the community.\n\nSince 2011, Councilwoman Dorothy Giamboi has served on the Metuchen  Borough Council, acting as the liaison to the Metuchen Chamber of  Commerce, Development…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698050/recognizing-dorothy-giamboi-for-nearly-fifteen-years-of-public-service"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Temple, Texas in 1970  and was voted the top veterinarian in Central Texas for 17 years in a  row. Beyond his veterinary work, Dr. Gosney has made significant  contributions to his community. A past president and longtime member of  the Temple Founder Lions Club, he has raised thousands of dollars to  support local charities. Additionally, as an avid…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689327/saluting-the-service-of-dr-gary-l-gosney"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…family with  seven children, all of whom were instilled with the values of  compassion, faith, and kindness. I'm pleased to recognize Beth today  for her important contributions to our community, and I wish her  continued success.\n\nIt is an honor to bestow Beth with the Patriot Award for her  exceptional service to our Nation.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694169/recognizing-congressional-patriot-award-recipient-beth-terrell"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…in  our Nation's fabric.\n\nMr. Speaker, I ask my colleagues to join me in celebrating Tom Hebel  and the entire Bucks Country Gardens team for their remarkable  contributions to the community, their commitment to excellence, and  their role in nurturing both the community and the people they serve.", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696583/recognizing-bucks-country-gardens-president-tom-hebels-retirement-after-years-of-service"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…actively involved with Knights  of Columbus, Fourth Degree, and is a past Trustee. He lives the  Catholic Christian life of servitude. I am proud of Tom's lifelong  contributions to our community, and I wish him continued success for  many years to come.\n\nIt is an honor to bestow Tom with the Patriot Award for his  exceptional service to the people of North…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695482/recognizing-congressional-patriot-award-recipient-thomas-mccall"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…Dealers Association of Indiana. I  congratulate Mr. Farabaugh on this outstanding honor of being named the  2025 TIME Dealer of the Year. I commend him for all his contributions  to the community and wish him and his family's business continued  success.", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690130/time-dealer-of-the-year-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…extracurricular  activities for students, organizing tree-planting events, and awarding  scholarships, among many other efforts.\n\nI am grateful for their significant contributions in our community  and am confident that the legacy of service they have built over these  past 100 years will only continue to grow in the years to come. Their  efforts have made…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696716/recognizing-the-100th-anniversary-of-the-rotary-club-of-lincoln"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…retires after a long career serving the people of Stony Point,  Rockland County, and New York, I am proud to recognize my good friend,  Jim Monaghan, for his many contributions to our community. May this  next chapter for him be just as fulfilling as the last.                             Honoring Anthony Adamo\n\nMr. LAWLER. Mr. Speaker, I rise today to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698769/recognizing-jim-monaghan"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…a commitment to  excellence.\n\nI extend my gratitude to Mayor Esteban Bovo for his unwavering  dedication to public service and I look forward to his continued  contributions to the community.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690226/recognizing-hialeah-florida-mayor-esteban-bovo"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Alyn Michael Macleod with a Congressional Veteran  Commendation from the 17th Congressional District of Texas. His  exemplary service to our Nation and continued contributions to his  community stand as an inspiration to us all.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696275/recognizing-sergeant-first-class-alyn-michael-macleod-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…about bringing  people together, regardless of background, to make the world a better  place.\n\nMr. Speaker, I would like to thank the Wellsboro Rotary Club for its  contributions to the community and congratulate these volunteers on 100  years of making a difference.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687905/recognizing-wellsboro-rotary-clubs-centennial-anniversary"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…commitment to serving the needs of the community.\n\nAs Hoskins Drug Store enters its 95th year, we recognize and honor  the Hoskins family for their incredible contributions to the community  and the example they set for future generations of small business  owners.\n\nMr. Speaker, I ask my colleagues to join me in congratulating Hoskins  Drug Store on…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689423/recognizing-hoskins-drug-stores-95th-anniversary"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…community. This honor is given to women who  serve as an inspiration to others.\n\nMr. Speaker, I congratulate Dorothy on this outstanding achievement  and for her contributions to her community and her church.                         Congratulating Mason Miller\n\nMrs. FISCHBACH. Mr. Speaker, I rise to congratulate Mason Miller of  Ada, Minnesota, on signing…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691460/congratulating-kadyn-kulzer"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…scholarships for the children of veterans. Moreover, Mark  organizes annual trips for students to attend the Youth Leadership  Conferences. I am proud of Mark's contributions to our community, and I  am sure he will continue to make a positive impact on the world around  us for many years to come.\n\nIt is an honor to bestow Mark with the Patriot Award…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696968/recognizing-congressional-patriot-award-recipient-mark-kipphut"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…Self'', is more than a guiding  principle--it's a commitment the Bellevue-Papillion Rotary Club has  lived every day for 50 years. Its members have made immeasurable  contributions to the community and have set an example of civic  responsibility and service.\n\nI commend the Bellevue-Papillion Rotary Club for its remarkable  legacy and congratulate its members…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692687/recognizing-the-50th-anniversary-of-the-bellevue-papillion-rotary-club"}, {"senator": "French Hill", "party": "Republican", "sentence": "…started as a job at a hunting lodge has become a successful  multilocation restaurant and catering business that serves customers  across our State. Yet, Bart's contributions to his community are not  confined to his successful business.\n\nSince the tragic passing of his mother, he has been serving others in  our State, including sponsoring local sports…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688705/recognizing-lorie-tudor-on-her-retirement"}]