[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…Association in 1970, which provided a  healthcare plan for Chinese restaurant workers. He was also a committed  member of Cathay Post No. 186, where he served as Commander and  contributed to fundraising efforts for the Kin On Nursing Home and  youth scholarships. Additionally, Bill served as the English secretary  for the Gee How Oak Tin Family Association…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691351/recognizing-william-bill-leonard-chin-former-cathay-post-no-186-commander-and-world-war-ii-veteran"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…collaboration among a diverse range of  artists and provides a vibrant social space that celebrates creative  expression. Through her vision, Ms. Merkling has significantly  contributed to the cultural vitality of Crystal Lake, creating valuable  opportunities for artists to share their work with the community.\n\nMr. Speaker, I am proud to represent Nancy…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690945/recognizing-nancy-merkling-for-receiving-the-robert-o-covey-business-of-the-year-award"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…Transportation-Housing and Urban Development.\n\nAs a new member of the Subcommittee on Labor, Health and Human  Services, Education, and Related Agencies, I am pleased to have  contributed to the development of this legislation. I thank my  colleagues on the Committee on Appropriations and the dedicated staff  for their tireless work.\n\nDespite serving in the…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699330/consolidated-appropriations-act-2026"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…recovery and investigation, including the National Transportation  Safety Board, the FBI, the Federal Aviation Administration, the Coast  Guard, the Army, and all the others who contributed.\n\nI thank those from local jurisdictions, including hospitals, mental  health providers, and even caring neighbors and support services, who  offered on-the-scene support…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688368/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…mentoring new superintendents through  ACSA's professional development academies. In 2019, she was named  Senate District 10 Woman of the Year by Senator Bob Wieckowski and also  contributed her expertise as a member of Assemblymember Anthony  Rendon's State Blue Ribbon Commission on Early Childhood.\n\nIt is my honor to recognize Parvin Ahmadi for her decades…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691728/recognizing-parvin-ahmadi"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…pivotal role in championing the rights of Hindu  Americans, advocating against biases and Hinduphobia, and ensuring  their equal protection under civil rights laws. It has contributed  significantly to intellectual diversity in the United States by  fostering rigorous academic inquiry, research, and dialogue on Indian  philosophy, dharmic traditions,…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689467/recognizing-the-contributions-of-rajiv-malhotra-and-the-infinity-foundation"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…that he has made a top priority  in his administration.\n\nThere is a continuing legacy of racism, sexism, and discrimination in  our society. Bias and discrimination have contributed to the exclusion  of qualified women, people of color, LGBT, and persons with  disabilities, and veterans.\n\nDiversity, equity, and inclusion policies are not about mandates…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…PACs.\n\nAnother major supporter of Trump's presidential bid was       Building America's Future, a 501(c)(4) nonprofit that       reportedly received funding from Musk. It contributed more       than $35 million to super PACs that spent heavily on       seemingly pro-Harris ads falsely suggesting that her campaign       supported divisive policies.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Seth Moulton", "party": "Democrat", "sentence": "…many Greek Orthodox  Americans in Massachusetts and in my district. From churches in Lynn,  Peabody, and Salem, to communities across the Commonwealth, Greek  Americans have contributed profoundly to the civic, cultural, and  spiritual fabric of our state. The Ecumenical Patriarch's visit is a  source of deep pride for many of my constituents and a reminder…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695352/welcoming-his-all-holiness-bartholomew-to-washington-dc"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "Mr. BEYER. Mr. Speaker, I rise to recognize and include in the  Record, three prominent community members in the Nepali American  community who have contributed to cultivating arts, culture, and  business around the country.                                   Navin KC\n\nFor more than twenty-five years, Navin KC has been a tireless…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695611/recognizing-navin-kc-luna-shrestha-and-nabaraj-kc"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…this administration's student visa process.\n\nWe have students doing groundbreaking research that are being forced  to leave the country, students that last academic year contributed $43  billion to the U.S. economy. The administration is trying to prevent  institutions from enrolling top international students altogether.\n\nThe United States has welcomed…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693005/student-visa-process"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…have seen them felt  locally. Somerset County, for example, is one of the poorest counties  in my State, the State of Maryland. If that is not enough, its  geography has contributed to awful flooding problems for decades. The  city of Crisfield was depending on a Federal grant to finally help fix  the problem. It was a funding plan that people had worked…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…from a total of $16  million before Citizens United was passed to over $2.6 billion in the  years since Citizens United. What naive person would think that these  people who contributed these obscene amounts of money did it for  altruistic purposes? No, they did it for themselves. This is obscene  greed. How much do they need?\n\nWhen billionaires and corporations…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699234/restoring-election-integrity"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…stories of  colleagues who have gone into hospitals and healthcare clinics and  volunteered services. I can tell you that I have bagged and boxed food  for people. I have contributed, like many of my colleagues, to make  sure that when people have to pay for their healthcare and they are  trying to decide if they can buy groceries that we are coming…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697648/restoring-enhanced-premium-tax-credits"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Think about that for a second. Of the billions of dollars that were  spent on this election for the President of the United States right  now, 44 percent of that money was contributed by 10 people. This is not  just a purview of any party, though; this is something that is  infecting our entire system.\n\nPeople ask the question rightfully: What does all…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699090/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…of her career.\n\nIt is because of people like Kathryn Mandichak that Mono County is  such a great place to live, to learn, to work, and to recreate. Her  dedicated efforts contributed to the overall academic success of  students of the region, as well as the safety and security of the  people of Mono County.\n\nTherefore, on behalf of the United States…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688154/protect-medicaid-benefits-for-american-citizens"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…officers, ensuring that their families were properly honored at this  important event. In addition to his role in the memorial, Andy served  as president of DC FOP Lodge 1 and contributed to several other lodge  committees.\n\nAs Andy steps down from his role on the National FOP Memorial  Committee this May, we owe him our deepest gratitude for his leadership…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690084/recognizing-k9-officer-andy-maybo"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…performances. Jackson Jones  led with 37 goals and 47 assists. Holden Custer added 45 goals and 21  assists. Parker Dallas scored 42 goals with 36 assists. Jackson  Wininger contributed 24 goals and 26 assists.\n\nOn defense, Ronnie Frith, Brayden Hall, and Carson Garland combined  for over 120 takeaways and 180 ground balls, while goalie Richard Hof  made…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693527/congratulating-central-high-school-womens-softball-team"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…opportunities for expanding capacities and  risks to those refineries; an assessment of any State or Federal  executive actions, regulations, or policies that have caused or  contributed to  a decline in U.S. petrochemical refinery capacity; and recommendations  for how to increase refinery capacity.\n\nAmerican refineries have played a crucial role in providing…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697029/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…often, these  programs fall short of their well-intended purpose.\n\nBureaucratic overreach has resulted in the loss of trust from many  Americans. Waste, fraud, and abuse have contributed to excessive  spending without meaningful improvements in outcomes, and that is  driving our national debt now to $37 or $38 trillion.\n\nSecretary Kennedy has committed to…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691446/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…assists. Also integral to their success was  veteran coach Craig Dietrich, who was awarded District Three coach of  the year.\n\nI include in the Record the following individuals contributed to the  Manheim Central Barons' 2025 boys' volleyball championship:\n\nPlayers: Reagan Miller, Cole Arter, Dylan Musser, William       Meyers, Daniel Becker, Colin Rohrer,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692807/congratulating-the-manheim-central-high-school-boys-volleyball-state-champions"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…operation of my office. From travel,  events, and meeting coordination to office administration, she  consistently demonstrated precision and professionalism. She also  greatly contributed to the culture and environment of my office by  bringing her dog, Moose, in on out-of-session days. While working in my  office, Kathy continued her education at the Johns…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697542/recognizing-and-expressing-gratitude-to-former-director-of-operations-kathy-zhu"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…from remarkable artistic  leadership and the guidance of legendary mentors, such as Eleanor  Steber and Irene Dalis. A special thank you to the board of trustees,  who have contributed to the success of the opera: John Johnson,  President; Krista Vannoy, Immediate Past President; Frank Giannini,  Treasurer; Jim Dubinsky, Secretary; Isabel Ditzel; and Eric…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696845/recognizing-50th-anniversary-of-opera-roanoke"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…for reporting of covered       misconduct involving cadets or other military or civilian       personnel of the Academy--\n\n``(A) an analysis of the factors that may have contributed       to such incidents;\n\n``(B) an assessment of the role of such factors in       contributing to such incidents during such Academy program       year; and\n\n``(C) recommendations…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…rule, and I reserve the balance of my  time.\n\nMr. JACK. Mr. Speaker, for the Record, supporters of cryptocurrency  exercised their First Amendment right last election and contributed to  many candidates.\n\nIn fact, those supporters spent over $50 million in support of  Democrat candidates. Supporters of cryptocurrency are not just  Republicans or Democrats.…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "French Hill", "party": "Republican", "sentence": "…of insured depository       institutions and uninsured depositors;\n\n``(dd) any mismanagement by the executives and board of the       insured depository institution that contributed to the       failure of the insured depository institution;\n\n``(ee) a review of the compensation practices of the       insured depository institution;\n\n``(ff) any supervisory…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…involvement with  numerous civic and community organizations. He has served as a founding  member of the Board of Directors for the Cullman Parks & Recreation  Foundation, contributed to the Cullman Rotary Club, and supported  Wallace State Community College through the Future Foundation and  Alumni Association. He also served on the Cullman Area Chamber…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699608/recognizing-mr-dale-greer"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…family farm, he  worked diligently for hours on end to ensure the success of his  family's business. It was those early mornings and hours spent bailing  hay that he said contributed to the strong work ethic he carries with  him today.\n\nAfter graduating from Hancock Public Schools in 1975, Mr. Maki earned  an associate's degree in criminal justice from…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696858/recognizing-donald-maki-on-his-induction-into-the-upper-peninsula-labor-hall-of-fame"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…to right its wrong.\n\nThe Lumbees are more than 55,000 strong, making them the largest  Tribe east of the Mississippi. They have defended this Nation in  uniform. They have contributed to our economy and preserved a proud  heritage that strengthens our State and our country.\n\nToday, this House has an opportunity to finally deliver justice for  the ``People…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695243/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…sacrifice, and Jack, his wife, Paige, and their two  boys, Joel and Barrett, know that all too well. I thank Jack and his  entire family for the sacrifices that they have contributed in more  ways than I can describe. Their sacrifices over the last 6\\1/2\\ years  have contributed to the success of the T&I Committee and the House of  Representatives.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}]