[{"senator": "Mary Scanlon", "party": "Democrat", "sentence": "However, this morning in the Rules Committee, Republicans green- lighted dozens of amendments containing controversial poison pills that  may very well make their way into the bill."}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "With tensions mounting in the Middle  East and the internet containing significant bomb-making instructions  which are much more accessible to terrorist groups, this is not the  time when America can afford to step back."}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "We know that a quick response  is critical to containing wildfire and saving homes and lives."}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "At nearly 1.1 million acres, the Boundary Waters spreads       across the northeastern tip of Minnesota, containing over       1,100 lakes, 2,000 designated campsites, hundreds of miles of       rivers and streams, and the largest contiguous areas of uncut       forest remaining in the eastern United States."}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "This would be a digital record containing most anything that any part  of the government knows about you, tracking where you live, where you  work, your earnings, your bank account, your health insurance, your  child support agreements, and more."}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Speaker, today, I introduce the Train Noise and  Vibrations Reduction Act of 2025, which would direct the Government  Accountability Office (GAO) to submit a report to Congress containing  recommendations on how to reduce train noise and vibrations near homes,  as well as estimates of the costs and benefits of each such  recommendation."}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "CISA has to date refused to release the report by making a claim that  the report is predecisional and deliberative and protected by a so- called ``deliberative process privilege.'' Setting aside that a FOIA  exemption does not apply to disclosures to Congress, based on my  staff's review of this report, this report is a technical document  containing factual information about U.S."}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Investigators obtained an IP address linked to the Snapchat account,  which eventually led them to the perpetrator's house, where they  recovered a laptop, two hard drives, and four iPhones containing  evidence of the coercive treatment of more than 100 different girls."}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "For example, the Washington Post reported that the former chief data  officer for the Social Security Administration has said that Elon Musk  and his DOGE gang copied a mainframe database containing the personal  information of hundreds of millions of Americans, including names,  birth dates, addresses, and more."}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Carlton, Minnesota has been a leader in providing access to       care and containing costs and now stands vulnerable to       unworkable funding reductions with some of what is being       proposed in the Federal budget."}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "The statute also authorizes the Secretary to       designate lands ``containing any significant subsistence,       recreational, fish and wildlife, or historical or scenic       value'' and requires that exploration in these areas ``shall       be conducted in a manner which will assure the maximum       protection of such surface values to the extent consistent       with the'' statute's requirements for exploration activities."}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "289, the Youth Poisoning Protection Act, would ban the       sale of products containing 10 percent or more by weight of       sodium nitrite that are covered under the Consumer Product       Safety Act."}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "There will no doubt be time to debate other matters, but today the  matter at hand is an appropriations package containing the Financial  Services and General Government bill and the National Security,  Department of State, and Related Programs bill."}, {"senator": "French Hill", "party": "Republican", "sentence": "(b) Report.--Not later than the end of the 360-day period       beginning on the date of the enactment of this Act, the       Comptroller General of the United States shall issue a report       to the Congress containing all findings and determinations       made in carrying out the study required under subsection (a)       and any administrative or legislative recommendations the       Comptroller General may have."}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "(c) Report.--At the conclusion of the study required under       subsection (a), the National Academies shall submit to the       Secretary and to the Committees on Veterans' Affairs of the       House of Representatives and the Senate a report containing       the results of the study described in subsection (b)."}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "1737) to direct the Secretary of Commerce to submit to  Congress a report containing an assessment of the value, cost, and  feasibility of a trans-Atlantic submarine fiber optic cable connecting  the contiguous United States, the United States Virgin Islands, Ghana,  and Nigeria."}, {"senator": "Jason Smith", "party": "Republican", "sentence": "We also matched enrollee SSNs in the data to two       additional data sources: (1) Social Security Administration's       (SSA) full death file, a database containing records of death       that have been reported to SSA, as of November 2024 and (2)       April 2025 data from the Internal Revenue Service (IRS) on       APTC reconciliation from tax forms filed for tax year 2023."}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Currently, to trigger a 10-year mandatory minimum, an offense must  involve 100 or more grams of a mixture containing a fentanyl analogue."}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "(B) Findings.--Not later than 10 years after the date of       enactment of this Act, the Comptroller General shall submit       to the Committee on Energy and Commerce of the House of       Representatives and the Committee on Health, Education,       Labor, and Pensions of the Senate a report containing the       findings of the study conducted under subparagraph (A)."}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "``(B) Report to congress.--Prior to any rulemaking       described under subparagraph (A), the Commission shall submit       to Congress a report containing a list of the findings       supporting the basis of the rulemaking.''."}]