[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…all  they can to push ambitious but implementable regulatory agendas in the  country--some of the most ambitious in the country. But we are out of  options when it comes to controlling the pollution sources that State  and local governments are allowed to regulate.\n\nWhat is left--the biggest nut to crack--are the mobile sources of  pollution--the cars,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…a rule of agency       management or personnel. This exception applies to rules       relating to ``purely internal agency matters.'' These include       rules related to controlling, directing, or supervising       internal management issues, as well as rules related to       personnel issues like pay, leave, or benefits. The 2025       Policy Statement…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Rohingya and members  of other minority groups, face an even more dire situation. Amnesty  International reports that the Arakan Army, one of the ethnic armed  organizations controlling parts of Burma, is continuing to displace the  Rohingya. Many other Burmese citizens are fleeing bombardment by junta  artillery and warplanes. Despite these horrors, many…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697902/burma"}, {"senator": "Alexandria Ocasio-Cortez", "party": "Democrat", "sentence": "…right to vote was a mistake, who after the violent attack on Paul  Pelosi claimed that ``some amazing patriot'' should bail out his brutal  assailant, and accused Jews of controlling ``not just the colleges, it  is the nonprofits, it is the movies, it is Hollywood, it is all of  it.''\n\nHis rhetoric and beliefs were ignorant, uneducated, and sought to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695806/censured-but-not-silenced"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…start  to attack the institutions.\n\nWhat we are seeing in the United States right now, we are seeing it  in the form of the President willfully breaking the law on the rules  controlling the executive branch, time and time again. We see it in his  attack on the press, his attack on the universities, his attack on  extorting law firms. We see it in the form…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692551/alex-padilla"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…not       a rule of agency management or personnel. We have previously       held that rules that fall into this category relate to purely       internal matters, such as controlling, directing, or       supervising internal management issues. Because the       withdrawal of the Reporting Requirements is concerned with       the information regulated…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…has set up offshore  bank accounts in Qatar outside the U.S. system, and only he knows where  the money is going.\n\nThere is a $500 million slush fund that the President is controlling  right now. We are not going to benefit from that.\n\nNow, I ask my colleagues who have not joined us: How long will you  stand by and be on the sidelines of the most consequential…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699362/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…not too critical. You police speech to be on the right  side of the regime. That is what happens in all of these fake  democracies, and that is what is happening here.\n\nBut controlling speech on campuses is not enough. Controlling and  intimidating journalists is not enough. You have to go after the  lawyers too.\n\nNow, maybe there is not a lot of love…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…actually operate our  electric grids. They call up clean energy first because it is less  expensive, period.\n\nSo it is unfortunate that here we are with this web of denial  controlling so much of what happens in this building--fossil fuel  industry dark money slashing through this building--and we can't get  agreement that climate change is not a hoax,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…the couch, Speaker Johnson is  running the credit card, bankrupting our Nation.\n\nThey are taking away your Medicaid to line the pockets of the  wealthiest Americans who are controlling our government.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688273/medicaid-cuts-mean-hospital-closures"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…bill to help out  the richest man on the planet, the richest man on the planet who is a  friend of Mr. Trump's, who has not been elected by anybody and who is  absolutely controlling our government now. He is controlling the firing  of people and the destroying of agencies. All of that is being done by  an unelected billionaire who is intent on changing…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…obligation  includes the open, transparent process of Congressional hearings,  investigations, and subpoenas into potentially impeachable offenses.  The Republican majority controlling this Congress will not allow that  work to move forward.\n\nIn the face of this obstruction, I will continue to work with my  Democratic colleagues to document violations…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698091/concerns-with-h-res-939"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…uphold that after you take office and then come here and not only  vote for this massive debt but tear down, at the same time, the last  two pillars of the architecture for controlling deficits this year and  into the future. That doesn't square, so don't do it.\n\nI will close by saying this is not the first time we have been down  this road. And there…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…precipitate a broader geopolitical shift for Africa at a time       when many nations have already abandoned ties with Europe.\n\n``The Russian presence in Libya is not only controlling       Libya. No, they are controlling Africa,'' Sahad said. ``They       are sending troops to other African countries, and they want       to be in control of them. And…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…a rule of agency management or       personnel. This exception applies to rules relating to       ``purely internal agency matters.'' These include rules       related to controlling, directing, or supervising internal       management issues, as well as those related to personnel       issues like communications between employees and managers,…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693338/us-government-accountability-office-legal-opinion"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…this Act--\n\n(A) is responsible for, complicit in, or has directly or       indirectly engaged in or attempted to engage in, actions or       policies, including ordering, controlling, or otherwise       directing acts that are intended to undermine the peace,       security, stability, sovereignty, or territorial integrity of       Georgia;\n\n(B) is or…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Monroe Doctrine with current American security interests.\n\nUnder the National Security Strategy, the United States will enlist  allies in the Western Hemisphere to partner in controlling migration,  halting drug trafficking, and mutually strengthening stability and  security.\n\nAlso, under the Trump National Security Strategy, the United States  will expand…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698884/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…paragraph (1), the Secretary shall, to the extent       practicable, analyze and compare individuals who participate       and do not participate in the initiative controlling for       selection bias or other factors that may impact the       reliability of data.\n\n``(3) Report.--Not later than September 30, 2028, the       Secretary of Health…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697169/hospital-inpatient-services-modernization-act"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…life better for Americans.\n\nThe American people are watching us. They want to see Congress do our  most basic, essential function, which is spending government dollars  and controlling the power of the purse. Through bipartisan, bicameral  negotiations, led by appropriators, we are turning priorities into  action and putting America first.\n\nMr. Speaker,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698632/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…was under the impression that this bill would be an  opportunity to decrease the amount of government programs, decrease the  degree to which we have government programs controlling or directing  Americans' lives.\n\nOne of those programs that I really don't like the more I talk to  experts on the topic is something called low-income tax credits.\n\nThese…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…History is replete with examples of leaders who, in their hubris,  thought they could shape the fate of nations, but we are subsequently  proven wrong as events ended up controlling them. Our own country,  sadly, experienced this during Vietnam.\n\nThe needless tragedy of that war in which 58,000 Americans paid the  ultimate sacrifice led Congress to…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…partners.\n\nThe U.S. Constitution in the Commerce Clause, article I, section 8,  gives Congress jurisdiction over trade policy. It is time that we take  ownership back of controlling the ability to impose tariffs willy-nilly  on our trusted partners and allies by passing this bill and reining in  President Trump's costly and damaging ideas.\n\n348 and…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688254/unanimous-consent-request-s-348"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…on the challenges that the United States faces in staying ahead of  China in this critical sector.\n\nEach of these witnesses emphasized the importance of export controls,  controlling what technology goes from the United States into China,  where they can then use that to compete with us and potentially even  beat us in the AI race.\n\nOne quoted a senior…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697555/china"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…49, Code of Federal Regulations (or a       successor regulation), that the applicant answer the       following questions:\n\n(A) Whether the FMOC applying, or any entity controlling       more than 10 percent of that FMOC, has ever been subject to a       civil monetary penalty under title 49, United States Code,       relating to any actions carried…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692179/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…hand, and  welcomed me to participate in this tour.\n\nI saw nothing there. I saw a few things--frustration. You know, you  have got the historic commission and everybody else controlling the  state of the project. But I certainly didn't see any criminal activity.  I certainly didn't see any of these alleged rooftop garden terraces,  water features, VIP elevators,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…that two of our most dangerous States as measured by  violent crime and property crime rates are the States of New Mexico and  Colorado, which also happen to have Democrats controlling all levels of  power.\n\nI would note that last summer, the good people of Aurora, Colorado,  were dealing with Tren de Aragua, who were engaging in violent  activities in…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…costs of  pharmaceuticals that are out there. We all experience that, and  everybody says: What is the problem? It is the middleman in the middle  of this who is actually controlling the formulary and controlling a lot  of the pricing, and that completely hides the cost of everything on it.\n\nThe pharmacy benefit managers are destroying our independent…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…trends relating to--          (A) the geographic distribution of capital to portfolio       companies;          (B) the socio-economic characteristics of founders or       controlling persons;          (C) the veteran status of founders or controlling       persons;          (D) the industry sector, size, stage of development, and       related details;…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697244/improving-capital-allocation-for-newcomers-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…a rule of agency management or       personnel. This exception applies to rules relating to       ``purely internal agency matters.'' These include rules       related to controlling, directing, or supervising internal       management issues, as well as rules related to personnel       issues like communications between employees and managers,…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694269/us-government-accountability-office-legal-opinion"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…finish line by sometime this  summer. In addition to preventing the biggest tax increase in history,  this bill will provide an opportunity for us to take important steps in  controlling spending and addressing our national debt.\n\nNow, I noticed the chairman of the Armed Services Committee just came  into the Chamber, and he knows, like I know, as the Presiding…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}]