[{"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…small businesses are getting larger  contracts and that contracts are becoming out of reach for many small  businesses, especially those that are not already government  contractors.\n\nThis legislation is a productive step that will help break that  cycle. The SPUR Act will require SBA to take into account new small  business government contractors when…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687940/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…his  mother's basement playing video games. They are restaurateurs,  beauticians, landscapers, mediators, chiropractors, funeral directors,  farmers, ranchers, freelancers, contractors, and gig workers, and now  they are stuck.\n\nAs open enrollment began and they opened their mail, they found that  their premiums, in some cases, doubled; in some cases,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…the first  Trump administration, he lobbied for the pardoning of several military  personnel who were turned in by their own teammates for war crimes as  well as military contractors convicted of killing 14 Iraqi civilians.  He has also called for reinstating waterboarding and other forms of  torture.\n\nIn his book ``The War on Warriors,'' he wrote:…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697387/caribbean-boat-strike"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…committee--Democrats and Republicans.\n\nWe have no way of knowing if the submissions are related to rules.  They could have easily been about tariffs or unpaid invoices to  contractors.\n\nTo the best of my knowledge, the Office of Advocacy has not weighed  in with the administration, which raises concern over its lack of  independence from the administration.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697350/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…wage protections for home care workers that would  enable them to keep minimum wage and other protections. They are  rolling that back.\n\nThe regulation requiring Federal contractors to pay workers at least  $15 an hour. They are rolling that back. They are rolling back  regulations to create clear and specific requirements for occasions  when employers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695574/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…adults; that is one out of every eight Virginians is a  veteran--and you add Active Duty, you add the Guard, you add the  Reserve, and you add the civilian DOD and the military contractors and  their families. We train all the Marine officers in the world. We have  the biggest shipbuilding enterprise in the world. We have the Pentagon,  the largest military…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…affordable for  all Americans. If the Senate does not act immediately, constituents  like Stephen from Van Nuys will bear that burden. Stephen and his wife  are both independent contractors who pay for their own health  insurance. In 2026, they are facing a monthly increase of over $1,000 a  month each. This is absolutely unacceptable in the United States.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698671/protecting-healthcare-for-millions-of-americans"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…with the Pentagon and  modernizing the Pentagon. This is what Elon Musk actually signed up to  do with SpaceX and initially with DOGE. He wanted to cut the bloated  defense contractors and the waste out of the Pentagon. We need not  cost-plus accounting. We need new competition.\n\nSecondly, we need to go after negotiating with Big Pharma. Medicare  should…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692232/addressing-our-exploding-deficit"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…Speaker, on March 13, the Department of Defense  issued new guidance: Military health clinics overseas would no longer  provide rape test kits to American civilian workers and contractors  serving alongside our servicemembers abroad. These are our intelligence  analysts, our teachers, our doctors, and our support staff performing  critical roles all in support…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694036/safe-kits"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Republicans, they just can't  seem to find anything to help working families and grandma and grandpa,  but they can find it for the billionaires. They can find it for the  defense contractors.\n\nAnd you want to talk about waste and fraud. Just look at the defense  budget. You just look at it. It is just loaded with waste and fraud,  but they aren't going to look…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "Mr. KRISHNAMOORTHI. Mr. Speaker, I rise today to recognize the  National Roofing Contractors Association headquartered in Itasca,  Illinois, on the occasion of National Roofing Week between June 1-7,  2025.\n\nNational Roofing Week honors the efforts of thousands…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691476/recognizing-national-roofing-contractors-association-and-national-roofing-week"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…going to see their health insurance  premiums spike? They are restaurateurs, beauticians, landscapers,  mediators, chiropractors, funeral directors, farmers, freelancers,  contractors, and gig workers. They are the ones caught in the cross  fire of a political battle that has now reached a stalemate.\n\nRoughly, half of the adults covered under the Affordable…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…is demanding that companies send proof that  they are eliminating their antidiscrimination programs and show proof  that they abandoned affirmative action plans.\n\nFederal contractors may sound to some people like a narrow, far-off  group. Who even are they? In reality, Federal contractors are a massive  segment of our economy, and chances are that you…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…voices of my constituents, Republicans and  Democrats, and Americans across the country who talk about healthcare  and the looming crisis. Small business owners, independent contractors,  retirees, farmers, and constituents in my district continue to call my  office or stop me to share how they will be unable to afford healthcare  as they continue to experience…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698301/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…Diego (405) and Costa Mesa (55) freeways to the series of issues that  delayed the Bay Bridge, there are numerous examples where outsourcing  inspection work to private contractors has undermined public safety,  delayed projects, and contributed to cost overruns. Our bill seeks to  avoid these potential conflicts of interest, while also mandating…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692433/introduction-of-the-public-inspectors-for-safe-infrastructure-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…that provides services to       the Senate, including federal government liaison offices,       independent government commissions, and non-government       entities such as contractors, credit unions, restaurants, and       other private service organizations.\n\n2.6 Leadership office means the offices of the U.S. Senate       majority and minority leaders,…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690981/us-senate-hallways-and-balconies-regulations"}, {"senator": "James Risch", "party": "Republican", "sentence": "…articles and services into its       armed forces.\n\nThe proposed sale of this equipment and support will not       alter the basic military balance in the region.\n\nThe principal contractors will be Sierra Nevada       Corporation, located in Sparks, NV; V2X, Inc., located in       McLean, VA; Radionix, located in Kyiv, Ukraine; and Systems       Electronic…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694285/arms-sales-notification"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…the authority to enter into other transactional agreements, commonly  known as OTAs.\n\nThese legally binding agreements allowed the Department to engage  with nontraditional contractors that would not normally do business  with the Federal Government. This includes small business innovators,  public universities, and other cutting-edge technological incubators…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688704/producing-advanced-technologies-for-homeland-security-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…bill does not address the immediate urgent  problem in front of us, which is that 22 million people are about to  pay a lot more for health insurance. These are independent contractors,  freelancers, gig workers, and Uber drivers. It is small business owners  and their employees, and retirees who are not yet eligible for Medicare  who are going to pay…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698374/lower-health-care-premiums-for-all-americans-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…and services into its armed forces.\n\nThe proposed sale of this equipment and support will not       alter the basic military balance in the region.\n\nThere are no principal contractors associated with this       potential sale. At this time, the U.S. government is not       aware of any offset agreement proposed in connection with       this potential…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696549/arms-sales-notification"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…require that a traceability analysis is performed and       documented;\n\n(9) require that security-related subject matter experts       are involved in selection process for contractors for a       project;\n\n(10) develop master schedules using the guidelines       contained in the publication of the Comptroller General       titled ``GAO Schedule Assessment…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697273/sba-it-modernization-reporting-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…cooperating agencies, participating       agencies, any project sponsor that prepared an environmental       impact statement under the supervision of the lead agency,       and contractors; and\n\n``(4) the timelines to complete environmental impact       statements pursuant to section 102(2)(C) during the period of       10 years that ends on June 1 of the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697711/studying-nepas-impact-on-projects-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…absorbing this equipment into its Armed Forces.\n\nThe proposed sale of this equipment and support will not       alter the basic military balance in the region.\n\nThe principal contractors will be Repkon USA, located in       Tampa, FL; and The Boeing Company, located in St. Charles,       MO. At this time, the U.S. Government is not aware of any       offset…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…absorbing this equipment into its armed forces.\n\nThe proposed sale of this equipment and support will not       alter the military balance in the region.\n\nThere are no principal contractors involved with this       potential sale. At this time, the U.S. government is not       aware of any offset agreement proposed in connection with       this potential sale.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697340/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…articles and services into       its armed forces.\n\nThe proposed sale of this equipment and support will not       alter the basic military balance in the region.\n\nThe principal contractors will be BAE Systems, Cummins       Inc., Leonardo DRS Inc., and Renk Group AG, with all work       occurring in Europe. At this time, the U.S. Government is not       aware…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694097/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…this equipment into its armed forces.\n\nThe proposed sale of this equipment and support will not       alter the basic military balance in the region.\n\nThe principal contractors will be Lockheed Martin, located       in Grand Prairie, TX; L3Harris Corporation, located in       Melbourne, FL; Leonardo DRS, located in Arlington, VA; and       Oshkosh…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695912/arms-sales-notification"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…processes that can  delay construction projects for months or even years.\n\nFamily-owned shops face costly data privacy mandates designed for  multinational corporations, while contractors struggle with ever- shifting OSHA paperwork requirements that eat up their time better  spent on the jobsite.\n\nEarlier this year, the Small Business Administration created…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697345/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…Speaker, I rise today to recognize a community  leader and my good friend, Brian Mathiowetz, who received the 2024  Lifetime Achievement Award from the Associated General Contractors last  Tuesday.\n\nBrian joined the family business, Mathiowetz Construction, full-time  in 1981, working for his father Richard.\n\nBrian quickly proved to be a driving force…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688312/recognizing-brian-mathiowetz"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…care and clean this mess  up. The law improved the management and the oversight of our organ  transplant system and encouraged participation from competent and  transparent contractors.\n\nTo build onto those reforms, in March, the President signed a  continuing resolution that provided authority for the Department of  Health and Human Services to collect…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690102/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "James Risch", "party": "Republican", "sentence": "…articles and services into its       armed forces.\n\nThe proposed sale of this equipment and support will not       alter the basic military balance in the region.\n\nThe principal contractors will be RTX Corporation, located       in Arlington, VA; and Lockheed Martin, located in Bethesda,       MD. At this time, the U.S. Government is not aware of any…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694901/arms-sales-notification"}]