[{"senator": "Al Green", "party": "Democrat", "sentence": "…Marbury  v. Madison means nothing, when you decide that you are the supreme law  of the land, then on that day we will have a dictatorship.\n\nWe are close because you are continually inching right up to the  line, you are looking over to the other side, and at some point,  regrettably, you may cross over.\n\nMr. President, I beg that you not do so. I beg…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688663/incivility-in-chamber"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…of President Trump's  suspension of most asylum applications, which was ruled unlawful in  Federal court.\n\nThe American people now see that the Trump administration has  continually lied about what they are going to do on immigration.  According to a CBS poll, a majority of Americans believe that the Trump  administration is not prioritizing the removal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695359/stop-illegal-entry-act-of-2025"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…the United States-Australia partnership has  never been stronger. He understands that our alliance isn't just an old  friendship to be maintained; it is a living bond to be continually  strengthened. He built personal relationships across the whole  political spectrum in working with Democrats and Republicans and across  two very different Presidential…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699544/9999"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…fault. It is always the judge. It is never his fault. It  is always the judge.\n\nWhen we start this process of having the person who holds the highest  office in the land continually say that judges are not fair when they  are dealing with him and things that he would have done, when we allow  that, we are now sending a signal to the rest of society…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…That is precisely the  purpose of the legislation that was rejected at the end of 2024 on  toughening up the border. We should go back and do that rather than  having people continually come back in.\n\nMadam Speaker, I yield 3 minutes to the distinguished gentleman from  California (Mr. Correa).\n\nMr. RASKIN. Madam Speaker, I yield an additional 1 minute…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…agency committed to the  highest standards of public service.\n\nFrom the earliest days of policing rural roads to the current use of  cutting-edge technology, the agency has continually evolved to meet the  challenges of each era while striving to maintain the trust and respect  of the public it serves.\n\nEven their uniforms made an impression--most notably…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692219/rhode-island-state-police-centenary"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…giving the Secretary of Homeland Security the  authority to grant waivers. That means universities are expected to ask  for a waiver from the same administration that is continually  threatening their Federal funding and their tax-exempt status.\n\nThis is a harmful bill that would only serve to weaken America and  give the Trump administration yet another…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690824/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…People of goodwill want to see us unite and deal  with the great issues of our time.\n\nBut you can't deal with the great issues of the time if you have a  President who is continually ignoring the norms, ignoring the rules,  ignoring the Constitution. When you have a President who has decided  that he can go to war at will, without conferring with the…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700250/peaceful-silent-protest"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…one this controversial.\n\nBut we did have a hearing in the VA, and it was highly illuminating-- not for what we learned but for what she denied doing. Listen to her.  She continually avoided giving committee members any specific  information about her role in realigning the senior executives at the  VA or her role in the firing or reorganization or her…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694542/9999"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…Philadelphia is an expression of the American values of courage  and honesty, acknowledging that our Founders and our Nation were  not perfect at its inception, but that we must continually strive to  form a more perfect union, to learn from the lessons of the past, lest  we repeat them, and to acknowledge the humanity of those who were  enslaved.\n\nTelling…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699712/rewriting-history"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…assure you, you will find a passionate group of caretakers, educators,  historians, and advocates who take such care to keep these lands  sacred.\n\nIt is people like this who continually work to ensure those buried  far from home are done so in dignity and with their true heritage  represented. Their efforts and the efforts of those who have worked so  hard…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695467/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Congress passed, and they did, and that, as a result of  these two Members passing, the Houston Chronicle believes that ageism  is an appropriate thing for them to express continually in their  newspaper.\n\nThe Houston Chronicle has engaged in what I call ageism, and if you  read the stories, I think you will come to the same conclusion. So,  they decided…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Mr. MORELLE. Mr. Speaker, I rise today to congratulate the Rochester  Community Players theater group on their 100th season.\n\nAs the second oldest continually operating community theater in the  State of New York and a part of the Little Theatre Movement in America,  their rich history dates back to 1925, with their opening performance…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689016/congratulating-rochester-community-players"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…of April 1793 is the index to my plan. Sanctioned by your  approving voice and by that of your representatives in both houses of  Congress, the spirit of that measure has continually governed me,  uninfluenced by any attempts to deter or divert me from it.\n\nAfter deliberate examination with the aid of the best lights I could  obtain, I was well satisfied…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…with  reliability with those.\n\nWe need to have everything, all of the above. Republicans keep saying  that they are for all of the above, but the President and Republicans  continually say: No renewables, no wind, no solar, and other forms of  renewables.\n\nThis idea that somehow one form of energy is more reliable than  another is simply not the case.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…Chairman, nationwide injunctions are highly  disfavored. There was a time that people across both sides of the aisle  here recognized that.\n\nA certain judge named Boasberg continually exercises those nationwide  injunctions, and that wouldn't necessarily be a problem, except he has  repeatedly displayed bias and partisanship.\n\nFor instance, without substance…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699047/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Remember that, in 2017, even though we reduced taxes in multiple  areas, we have what is called broadened the base, which actually helped  bring in more tax revenue. We have continually maintained that 17  percent of GDP, but our spending has gone from about 17 percent to 26  percent over the last 25 years.\n\nYou have to look at things with respect to GDP.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…at the James E. Van Zandt Medical Center, where he  worked tirelessly to help local veterans receive their benefits.\n\nIn the true spirit of Semper Fidelis, Lieutenant Peck continually  demonstrated his steadfast loyalty to his fellow veterans and  continually worked to help our Nation become that more perfect Union.\n\nAs we remember Lloyd Peck, we also…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688957/president-trump-bringing-back-investments"}, {"senator": "French Hill", "party": "Republican", "sentence": "…of April 1793 is the index to my  plan. Sanctioned by your approving voice and by that of your  representatives in both houses of Congress, the spirit of that measure  has continually governed me, uninfluenced by any attempts to deter or  divert me from it.\n\n``After deliberate examination with the aid of the best lights I  could obtain, I was well satisfied…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700272/president-washingtons-farewell-address"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…our country that pushes back against the prevention of crime  and the enforcement of law, and sells this idea that we are somehow a  less compassionate nation if we do not continually release career  criminals upon the streets. There is this notion that we can somehow  enforce criminal law with social vagaries; this idea that somehow if we  will just…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…Force.\n\nApart from his public service, Dave enjoys being with family and  spending time outdoors. Dave McMahon is truly a man of strong  character. At every moment, he has continually shown up with integrity,  with professionalism, and with a commitment to making his community  safer. He represents the very best of public service.\n\nOn behalf of the people…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698763/recognizing-david-mcmahon"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…recover after disasters.\n\nUnfortunately, over the years, in my view, the agency has shown time  and time again they are unable to perform some basic functions. The  agency continually fails to hold local public housing authorities  responsible for providing safe housing.\n\nReports from the inspector general, the Government Accountability  Office, and our…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697209/hud-transparency-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…requirements for foreign funding and  contracts. It also will hold institutions accountable by imposing  fines, such as the loss of student aid funding for schools that  continually fail to comply.\n\nThis bipartisan bill is a commonsense solution to an irrefutable  problem, which is why it passed last Congress with bipartisan support.  We should be loud…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…address it.  It is no longer a free market in healthcare.\n\nSo I believe that we, as Congress, are going to have to start taking  measures to be sure that the cost isn't just continually passed on to  the American people and driving our debt further and further.\n\nI would challenge the healthcare industry: Start doing it now; start  lowering the cost.\n\nWe…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691249/president-trump-in-the-middle-east"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…Carolinians who are left without shelter following  Hurricane Helene, I ask: Should your tax dollars go to housing illegal  aliens, to transporting illegal aliens while you continually suffer?\n\nAgain, I say definitively: Under no circumstances is this  appropriate.\n\nI urge all of my colleagues in Congress to join me in reversing this  perverse incentive…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…this world of rolling redistricting where  district lines are never settled for more than a couple of years and  where the connection between voters and Representatives is continually  being severed.\n\nI have called time and again for an end to this redistricting war or  an armistice. The fact of the matter is that there is still an  opportunity to do…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…trial participant, and church leader, Carrington's record  is defined by energy, humility, and resolve.\n\nI have had the pleasure of getting to know SirMichael and have been  continually impressed by his focus, ambition, and unwavering belief in  the power of servant leadership.\n\nMr. Speaker, SirMichael Carrington Williams-Thomas represents the  very best…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691587/recognizing-sirmichael-carrington-williams-thomas-on-receiving-the-2025-billy-michal-student-leadership-award"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…tremendous support, as  well as our current Senators Thom Tillis and Ted Budd, former Senators  Elizabeth Dole and Richard Burr, and my many colleagues here in the  House who continually supported this effort.\n\nMadam Speaker, I thank them all, for the Lumbee are a great and  honorable people who deserve Federal recognition with all the rights  and benefits…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698409/federal-recognition-for-lumbee-tribe"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…their problems with  their so-called Affordable Care Act.\n\nMr. GRIFFITH.  Foxx) who is the chairwoman of the Rules Committee.\n\nMr. Speaker, my colleagues on the other side continually say that we  haven't done anything. We just received a message from the Senate on a  Republican bill that does something. Now, they may not like it, but I  find it fascinating.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…single, unique ZIP Codes for communities across the United States.\n\nH.R. 672, which includes the community of Mills, Wyoming, would  resolve longstanding issues that have continually impacted a host of  services, ranging from the delivery of mail to confusion for the local  fire department and utilities providers, while also complicating  economic development.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693862/establishing-new-zip-codes"}]