[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…data, who look at the underlying  causes of why these women are dying anyway, let alone at three times  higher rates than White women, they are gone. Well, at least we can  continue to fight for the policies.\n\nI am on the Energy and Commerce Committee that was told in a markup  on March 7 to find $880 billion worth of cuts. The Congressional Budget  Office…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…grain grading technologies. The U.S.  grain inspection system is known around the world for quality and  reliability. By focusing USDA's attention on modernization, we can  continue to hold our place as the world's gold standard in grain  inspection.\n\nReauthorizing the U.S. Grain Standards Act is important for our  farmers and their customers, and I urge…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695053/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…answer? Make it harder to investigate them; make  it harder to kick these abusive recruiters out of the H-2A system; and,  against their own promises, let the trafficking continue.\n\nLet's be clear again. The H-2A program is one of the largest sources  of labor trafficking in the United States.\n\nThe safety regulations the Department of Labor is going…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…effort to turn part of their West St.  Paul space into affordable senior apartments. When the pandemic hit in  2020, Ann ensured her team and volunteers were positioned to continue  engagement with seniors in a safe way. DARTS also provided support to  organizations that were struggling.\n\nOver the last 10 years, Ann has made DARTS a well-known and reliable…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689623/congratulating-ann-bailey-on-her-retirement-from-darts"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…together and fight for the rights of our great  country, this great Constitution, the First Amendment right of free  speech, and the Fifth Amendment right of due process. We must continue  speaking up and fighting back against these tyrants and preserve our  Constitution.\n\nMr. Speaker, I am not sure if you found this funny or if you are  laughing at a joke…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690503/trump-immigration-policies"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…so long?\n\nWhat we need is for the Trump administration to not change its policy  but to honor its word. They say that they are going to do this, so do  it already.\n\nI will continue to stand on the House floor every single day until  they do. Restore the funding now.                   Go After Criminals, Not Innocent People\n\nMr. MAGAZINER. Mr. Speaker,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693021/trump-administration-needs-to-honor-its-word-on-food-aid"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…will  speak in one voice to unequivocally denounce acts of political  violence.\n\nBut even as Congress stands together to oppose this attack on our  democracy, Minnesotans continue to mourn the unbearable loss of one of  our Nation's finest public servants.\n\nI first Melissa Hortman in 1998 when we knocked doors together during  her first campaign for…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693118/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…after his Presidency, where he made the fight against  slavery one of his primary causes. His advocacy for public education  and the sciences is a legacy that I am proud to continue.\n\nMr. Speaker, this is the third attempt at this effort. It is a  glaring oversight that on the eve of our 250th anniversary there is  still no memorial in our Nation's Capital…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697631/adams-memorial-great-american-heroes-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…and families.\n\nI cannot believe that in the year 2025, I have to stand here on the  House floor of the United States to defend a woman's right to vote, but  I will. I will continue to stand here every single day if that is what  it takes because this isn't theoretical. This is personal.\n\nIt is for the mom in Gresham who can't take unpaid time off to…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689408/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…appropriate medical measures to rule  out an ectopic pregnancy.\n\nRather than referring the patient for immediate medical evaluation,  Clear Way staff focused on encouraging her to continue the pregnancy.  As a result of the misdiagnosis, this woman's ectopic pregnancy  ruptured, causing massive internal bleeding and requiring emergency  surgery. She lost a fallopian…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…building of bridges, between East and  West, faith and justice. His  enduring witness to peace and extraordinary work for humanity is an  inspiration to us all. May his example continue to inspire us to build  bridges of understanding, to care for all of God's creation, and  continuously seek justice and reconciliation.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695368/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…slightly over 10       percent, said Paul Kidwell, senior vice president at the       Connecticut Hospital Association. It's unclear whether the       federal government will continue to grant such waivers, he       added.\n\n``It's a big question mark,'' Kidwell said. ``We're       proceeding as if we can continue, with the knowledge that we       need more…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Department of Defense, ``credit cards, auto loans, and personal loans  are widely available at risk-based rates under the 36 percent  [military] APR'' and ``[s]ervice members continue to have ample access  to necessary credit.''\n\nMoreover, this legislation would follow the trend in many States  towards greater protections against predatory loans. Nineteen…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699782/9999"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…greenhouse gases?\n\nWe know renewable energy can lower energy costs.\n\nI will be waiting for Godot if I expect this majority to take that  up. We can look to the future, or we can continue to reject the future  and pander to the past.", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697162/renewable-energy-means-lower-energy-costs"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…Republicans prepared to vote ``yes'' today,  Speaker Johnson is calling this a show vote. He is calling it  dangerous. He is signaling the U.S. Senate to block it.\n\nRepublicans continue to use their power to shield rich pedophiles  from justice. If you can't stand up for these survivors, how can anyone  trust you to stand up for them?", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696821/epstein-files-transparency-act"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…and can't say no  when asked for help.\n\nDelman's story reflects the unwavering spirit of America's veterans,  men and women who not only fought for freedom abroad but who continue  to strengthen the fabric of our Nation here at home.\n\nIt is my distinct privilege to recognize Delman Leon Orme for his  exceptional service to the United States of America…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696279/recognizing-delman-leon-orme-with-a-congressional-veteran-commendation"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…out of their way to dilute the voices of  American citizens, the very American citizens who elected them to  represent them?\n\nIt is incredibly frustrating to hear that they continue to double  down or triple down on giving rights to people who are not citizens of  this country at American taxpayers' and citizens' expense.\n\nThe lead debater on the other…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692316/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…opportunity. Today, it is  equally defined by innovation and resilience. A stronger Taiwan means a  stronger United States and vice versa. That is why both our Nations  must continue working deliberately and decisively to deepen  cooperation. The payoff is clear: greater prosperity for our people and  greater stability for the world.\n\nTaiwan has made remarkable…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…adults, like the rest of the country. It also removes  judicial discretion to sentence youth offenders under the minimum  sentencing structures in place.\n\nOur Capital cannot continue to let criminals freely roam the streets  and expect this crime crisis to end.\n\nAs juvenile crime soars in the District, the bill also requires the  D.C. Attorney General…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695558/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…to adhere to the Speaker's  direction to cease such behavior, regardless of their political party  and regardless of who is at the lectern giving a speech, has to and  must continue to be reprimanded. We cannot afford to let it go by.\n\nMr. Speaker, we can do better. Mr. Speaker, we must do better for  ourselves, for the institution, and for the people…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688496/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…assistance. FEMA should be on the ground, working with families to try  to help identify any type of assistance that the families in need can  qualify for, and I encourage FEMA to continue to work with the local  governments to ensure that the heavy burden of debris removal is  reimbursed by the Federal Government. That is something that my office  will continue…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690765/recovering-from-north-carolina-floods"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…closing, this legislation will help improve the  Federal Government's use of shared space and save taxpayer dollars. By  building on the success of the last Congress, we can continue to  implement policies that ensure that we are good stewards of our  taxpayer resources and hold agencies accountable for the effective and  efficient use of our Federal real…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695013/shared-property-agency-collaboration-and-engagement-act-of-2025"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…individuals have been arrested. This level of  violence against Iran's own people is indefensible.\n\nI commend President Trump for imposing economic pressure on those who  continue to support and sustain that regime. These measures send a  clear message: The United States will not ignore the suffering of the  Iranian people, and the exploitation of the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699103/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…deduction or itemize. It will benefit millions of Americans on fixed  incomes, providing meaningful relief as costs for housing, healthcare,  prescriptions, and groceries continue to rise.\n\nBut our work is not done, Mr. Speaker. To many seniors, they still  see their Social Security benefits taxed. That is why I support  legislation to fully exempt…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700050/tax-policy-should-reward-a-lifetime-of-hard-work"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…face of  tragedies like the floods in Texas, we are incredibly fortunate to have  brave first responders who choose to run toward danger instead of away  from it.\n\nI will continue to pray for the safety of our first responders, as  well as the victims and families affected by this horrific disaster. I  am grateful that this team was able to put their…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694073/recognizing-virginia-beach-fire-departments-swiftwater-rescue-team"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…a crisis. Having a society that is getting older is not  Republican or Democrat; it is just what we are. It is math.\n\nLook, if we are not willing to tell the truth, we can continue to use  our campaigns--all right. I will take a slight non sequitur.\n\nWe are going to get a new Social Security-Medicare actuary report in  the next couple weeks. I know we…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…American Dream. That is what House Republicans are fighting for.\n\nIt is unfortunate that the other side would rather see programs that  were meant to help the neediest Americans continue to be riddled with  fraud and abuse, intentionally mismanaged, and undermined all for the  sake of scoring political points.\n\nHouse Republicans are committed to ensuring our…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691361/dignity-of-the-american-dream"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Heirs and beneficiaries of deceased owners.--Housing       that meets the criteria described in subsection (b)(3) prior       to the death of an owner of such housing shall continue to       qualify as affordable housing under this title if--\n\n``(A) the housing is the principal residence of an heir or       beneficiary of the deceased owner, as defined…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "…district. These young people  give back to their communities and make investments in themselves. It  is very important that we reauthorize this successful program so that  we can continue to inspire and reward our young Americans and encourage  each of them to reach their full potential.\n\nMr. Speaker, I encourage my colleagues to vote in support of S. 284.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698221/congressional-award-program-reauthorization-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…and the world needs more people like James Min in  it.\n\nMr. Speaker, I thank James for his many years of service to this  great institution and for his friendship. May God continue to bless him  as he turns the page and begins a new chapter in his life.", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688721/recognizing-james-min-after-25-remarkable-years-of-service"}]