[{"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…reform and ban Members of Congress from trading  stocks once and for all.\n\nI am going to start by recognizing a Member from the Republican side  who I have had several great conversations with on this issue. He has  introduced a bill that would put a congressional stock trading ban into  effect.\n\nMr. MAGAZINER. Mr. Speaker, I appreciate the gentleman.\n\nMr.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691216/stock-trading-ban-for-members-of-congress"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…these Republican Senators and House Members know, phone records  are among the most routine tools used in criminal investigations. They  do not reveal the content of any conversations. They simply show which  numbers were called, which numbers called them, and when those calls  were made.\n\nThey are essentially phone bills. If these Republican Senators…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696924/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…there were 14 victims of this attack. He is wrong. There  are 15 victims. Maybe he got that from Google or found it in a  newspaper article, but had he been involved in the conversations with  law enforcement, as I have, he would know that there were 15 victims of  this terrible attack.\n\nIt is poor decorum to ask this body to vote on a resolution that…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692191/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…enhancing the recovery efforts, this  legislation protects the integrity of our tax system and restores trust  in financial security.\n\nMr. Speaker, I have had dozens of conversations with constituents who  have spent months trying to receive a check from Treasury. In one  instance, a constituent was sent two checks by the Treasury Department,  neither…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689292/recovery-of-stolen-checks-act"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…Washington, D.C. As a former mayor of 8  years, I worked with over 700 amazing men and women of a police  department who were heroic in the work that they did. I know that, in  conversations with our chief, our police officers, and our community,  these decisions are best left to our communities to write the laws of  when these police chases should actually…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695640/district-of-columbia-policing-protection-act"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…World Council of Churches.\n\nPatriarch Bartholomew has a focus on creating advocacy for  environmental issues and in his time launched a series of initiatives  to help start conversations worldwide. Among these initiatives were a  variety of trips with political leaders and accredited scientists  discussing issues such as water pollution in the Black Sea,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695458/welcoming-the-ecumenical-patriarch-bartholomew-of-constantinople-to-washington-dc"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…going to have to return  home, and they are going to have to face their constituents. Let's see  how many of them have the courage to hold townhalls and actually have  real conversations with their constituents and take real questions.\n\nI hope my Republican colleagues are ready to explain why they gave  the ultrawealthy a $250,000 tax break--you heard that…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694383/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Thanksgiving Dinner is now down 25% . . . since 2024.''  ``AFFORDABILITY,'' he said, ``is a Republican Stronghold.''\n\nDoes the President of the United States actually have any  conversations with families who are shopping for groceries?\n\nHere is the truth: Costs are going through the roof because of  President Trump and his MAGA policies. The American people…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…we  act.\n\nI believe this body should come together in a bipartisan way to end  the nightmare that has been unleashed on America by Citizens United. I  know from private conversations with people on both sides of the aisle  that it would be a relief not to have this outsized influence of money  and power on this body. It would allow us to focus in an…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699090/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…dignity, and privacy of our clients,       staff and community partners, no identifying information is       included. Our mission has been to destigmatize and normatize       conversations around mental health within the Haitian       community, a community that has long been taught to endure       suffering in silence, to ``be strong,'' and to survive…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…needed to get it done by the end of next week. We said: Sure, keep  negotiations open. And we ran a hotline on that, and it cleared our  hotline.\n\nWe had some very difficult conversations with Members who hate this  idea. But just to keep the aperture open to renegotiate and to preserve  the majority's prerogative to move forward with some pace, we  accommodated…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695313/cloture-motion"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…got  their just due in or out of the military.\n\nMy father had two brothers. Both of them, William and Charlie, served  in World War I. Every time I tried to engage them in conversations  about their experiences in that war, they never ever would discuss  that. They made it very clear to me that the treatment they got both in  that war and when they came…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…to do whatever we can to ensure  Ukraine's protection and sovereignty because what happens to Ukraine  and its young democracy happens to theirs and happens to ours.\n\nThe conversations were filled with such emotion and a clear desire to  do the right thing. As cease-fire talks continue, may we strive for an  end to this devastating war, to its suffering…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690214/supporting-ukraines-independence"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…communities that don't have large tax bases that will be  hurt the most. It is my community.\n\nEducation is the great equalizer. I don't understand how if we want  to have conversations about making the  Department more efficient or more effective that isn't happening here  in Congress. That isn't happening in the committees of jurisdiction. I  don't understand…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689644/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…soon as our current Treasury Secretary was brought into office, I  wanted to know what DOGE was doing and where the information was going.  I don't think we have had any conversations of any substance regarding  the location of that data.\n\nWhile this bill will have a modest but meaningful improvement to  Social Security's customer service to the victims…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697187/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…conferences and meetings to  advance greater cooperation and mutual understanding. His efforts to  promote mutual respect and religious tolerance included having  theological conversations with Muslim and Jewish leaders.\n\nHis push for peace includes calling out both the Russian state and  the Russian church for the invasion of Ukraine. In Ecumenical Patriarch…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695924/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Mr. HARIDOPOLOS. Mr. Speaker, I thank Congressman Knott for yielding  and for holding this hearing.\n\nMr. Speaker, these are the kind of conversations the American public  needs to hear. They need to understand the impact that illegal  immigration is having on our country and how it undercuts the rule of  law and really…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…veteran-owned small business  contractors. Now, it is time to do the same with the WOSB program to  help ensure integrity across SBA programs.\n\nWhile we continue to have conversations on how to better align small  businesses' contracting goals with merit-based principles, this bill  would reduce the ability of fraudsters to exploit the system that is…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691798/wosb-accountability-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…upset, but it is called math, is over the next 10  years, the vast majority of debt is interest and healthcare costs,  mostly Medicare.\n\nUnless you are willing to have honest conversations about debt  deficits and demographics, the demographics is the driver of U.S.  sovereign debt. We have a shortage of young people in America. We have  foreigners come and…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…Austin's  show on many occasions to discuss key issues impacting our Nation and  the CSRA. I will always appreciate Austin's flexibility, willingness to  have important conversations, and most of all his ability to tell it  like he sees it.\n\nI congratulate Austin on this well-deserved honor. I have no doubt  that he will continue to be our afternoon…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692847/congratulating-austin-rhodes"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…rarely happens so  we don't need to do anything about it. It couldn't be further from the  truth.\n\nHowever, let's look back 2 months ago. The secretaries of state that  I had conversations with shared with me their difficulties that they  are experiencing in administering the most recent election. Two of  their top concerns were about integrity of voter rolls…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…primary drivers of U.S. sovereign  debt. Will the bond market continue to finance this?\n\nWhat happens when one of your greatest solutions is: Can we actually  have honest conversations about healthcare costs? Are we willing to  legalize the very technologies and the methodologies of helping our  brothers and sisters stay healthier and, therefore, use…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…Homeland Security, which will  give the White House additional time for negotiations.\n\nPresident Trump is leading by example and engaging directly with  Democrats in good-faith conversations on that front. He also has been  explicitly clear that holding the government hostage is wrong. I  wholeheartedly agree with him.\n\nAs he stated just yesterday: We need…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…common sense, and to lead with integrity.\n\nMr. KNOTT. Mr. Speaker, I thank the Congressman from North Carolina  (Mr. Moore).\n\nCongressman Haridopolos and I have had many conversations about the  cost of illegal immigration on programs that are designed to help and  support vulnerable Americans, especially Medicaid.\n\nCongressman Haridopolos has extensive…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…have major concerns with the portion of the bill that  is being fixed by the efforts today, here on the Senate floor, with  this unanimous consent request.\n\nAfter numerous conversations with my colleagues Senator Cruz and  Senator Cantwell, we secured an agreement from the Senate leadership-- and I thank that Senate leadership, Senator Thune--for an amended…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698321/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…bill: who got subsidized, who has to pay.\n\nI beg of our brothers and sisters around here, open up your brain. We  live in a time of miracles. We are going to have some conversations  about how you change the view of healthcare. It is all about what we  pay. Can we change the cost by doing it better, faster, cheaper with  technology and our brothers…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…while California games the  system to give money to illegal aliens. That is expressly and openly  being acknowledged by California leadership.\n\nThey don't want to have those conversations. They don't want to talk  about how you manage that problem, how you get more people to be able  to have affordable care instead of what they currently have, which is a…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "James Risch", "party": "Republican", "sentence": "…staff shall not accept public speaking       engagements or write for publication in the field of foreign       relations.\n\n(2) The staff shall not discuss their private conversations       with members of the committee without specific advance       permission from the Senator or Senators concerned.\n\n(3) The staff shall not discuss with anyone the proceedings…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…spirit, wry sense  of humor, keen insight, and love of all things mechanical. In fact, one  of his favorite pastimes was tinkering on engines, along with pulling  weeds, long conversations on the front porch, kayaking, eating hearty  meals, and rescuing animals, like Charlie the dog and Gus the goose.\n\nMr. Chapman was also known for his work ethic and perseverance…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693467/recognizing-ben-chapman"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…other promises that he made on the campaign  trail. And we are on our way to what President Trump likes to call  ``one, big, beautiful bill.''\n\nWell, a lot of important conversations have been taking place, on  both sides of the Capitol, about what the result will be. But while  these questions and some differences are natural, the critical matter…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}]