[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…left--11 out  of 1,200--11 left that put us on a pathway to climate safety to get us  back below the 1.5 degrees centigrade safety margin--maybe safety  margin. But that is a conventional one, so I will stick with it, even  though it is not a guarantee.\n\nEvery single one of them puts a price on carbon. No price on carbon,  we fail. Other stuff that helps…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…of Staff, and including Congress. Vesting  this much power in one person, particularly this President, is  irresponsible, dangerous, and unnecessary.\n\nGiven our massive conventional military advantages over our  adversaries--think of Venezuela--there is no plausible circumstance  that could justify the use of nuclear weapons to deal with a nonnuclear…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699033/expiration-of-new-start"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…with 90,000 boxes of Plumpy'Nut, lifesaving food aid that is designed  to save the lives of starving children whose organs are shutting down  and can no longer process conventional food.\n\nThis food aid has already been manufactured and has already been paid  for but is sitting in a warehouse in Rhode Island because some  bureaucrat in the Trump administration…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694157/plumpynut-saves-lives"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Ecolab, Xcel  Energy, and the Metropolitan Airports Commission in the Nation's first  large-scale hub committed to scaling production of sustainable aviation  fuel to replace conventional jet fuel. As an anchor partner of the  Minnesota SAF Hub, Delta is helping to create an industrial-scale  supply chain for sustainable aviation fuel, anchored in Minnesota.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695050/recognizing-delta-air-lines-100th-anniversary"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…manufactures Plumpy'Nut, a nutritional supplement that is  needed to get starving children back to health. When kids are starving,  their organs break down, and they cannot digest conventional food.\n\nMillions of lives have been saved by this product, and now there are  thousands of boxes sitting in a warehouse in Rhode Island because the  Trump administration…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695817/lifesaving-food-aid"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…same as the Boston Celtics have in the  NBA. The Los Angeles Lakers have 18 titles, as well.\n\nEighteen titles for a land-grant university in rural Connecticut  defies any conventional wisdom about big, high-paying university  programs. They just keep getting it done.\n\nCoach Hurley, who coaches the men's team, was rooting on Geno and the  women as loudly…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689671/congratulating-uconn-womens-basketball-stars"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…nothing; establishing with powers so disposed--in  order to give to trade a stable course, to define the rights of our  merchants, and to enable the government to support them--conventional  rules of intercourse, the best that present circumstances and mutual  opinion will permit, but temporary, and liable to be from time to time  abandoned or varied, as experience…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Trump administration to restore lifesaving food aid for  malnourished children.\n\nWhen kids are starving to death, their organs break down. Even if we  are able to feed them conventional food, they cannot digest it. It  takes specialized nutrition to bring them back to health, including the  nutrition manufactured by Edesia Nutrition in North Kingstown,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695582/release-food-aid-sitting-for-9-months"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Representative of the Secretary  General on Sexual Violence in Conflict, the United Nations Population  Fund, the UN Framework Convention on Climate Change, the UN Register of  Conventional Arms, the International Tropical Timber Organization, the  International Union for the Conservation of Nature, and the  Intergovernmental Panel on Climate Change.\n\nI seriously…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699129/us-withdrawal-from-united-nations-organizations-and-programs"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…every day that they wait is another day that  children die of starvation unnecessarily.\n\nEvery day, there are children whose organs are shutting down, who are  unable to eat conventional food, and who can only have their lives  saved by ready-to-use therapeutic food manufactured in the United  States.\n\nEvery day, the clock is ticking. The administration…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693095/calling-on-trump-administration-to-restore-lifesaving-food-aid"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…incentivized  to pull their money out of private-sector banks.\n\nMr. BARR. Just to conclude, we want to avoid eroding the deposit base  and starving the private sector of conventional bank financing. The  GENIUS Act will not erode the deposit base. It will allow banks to  issue and custody stablecoins and participate in this emerging crypto  economy cementing…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693841/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…section, the term       `covered sector' means any of the following sectors:\n\n``(1) Aviation and space.\n\n``(2) Broadband.\n\n``(3) Carbon capture and sequestration.\n\n``(4) Conventional energy production.\n\n``(5) Electricity transmission.\n\n``(6) Forestry.\n\n``(7) Information technology infrastructure.\n\n``(8) Manufacturing.\n\n``(9) Mining.\n\n``(10) Pipelines.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697711/studying-nepas-impact-on-projects-act"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…Mr. BURLISON. Correct. In fact, the swampy thing to do and what you  would expect this town to normally do is to tinker with those things--\n\nMr. BURLISON.--and do what the conventional thought is before. Let's  tinker with PBMs. Let's tinker with this account.\n\nMr. BURLISON. Right? The end result will be less choice for patients  and higher costs. Even…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…that I have, that a CBDC would substantially  decrease the availability of credit and increase the cost of financial  services and products for consumers, destroying our conventional,  traditional banking system.\n\nOur banking system, in contrast to Europe and China, is the envy of  the world due to its free market principles, dynamism, and diversity.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693730/anti-cbdc-surveillance-state-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…serious situation.\n\nInstead of taking steps to increase our energy supply, the Biden  administration pushed us further toward crisis with measures designed  to restrict conventional energy development and force Americans to  adopt electric cars, putting a vast new burden on our electric grid.\n\nFortunately, President Trump recognizes the precarious situation…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688403/joint-session-of-congress"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…county maintains them.\n\nThese restrictions are unnecessary and, frankly, lack common sense.  Many of these routes are restricted to off-highway vehicles and remain  open to conventional vehicles. This creates public safety concerns by  incentivizing the use of vehicles that are not meant to handle rough  terrain and rugged trails.\n\nRestricting off-highway…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…with me today. You can see for yourself  how shortsighted policies can drive up electricity costs from one State  to the next. When Democratic States sidelined reliable, conventional  fuels and mandated rushed transition to renewables, consumers paid  more.\n\nI don't know about New York or California, but Ohio cannot afford  rolling blackouts, price spikes,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698277/reliable-power-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…I (SDB-I) all-      up-round (AUR) is a 250 lb bomb with a GPS-aided inertial       navigation system. It is a small, autonomous, day or night       and adverse weather, conventional, air-to-ground precision       glide weapon able to strike fixed and stationary re-locatable       non-hardened targets from standoff ranges. It is intended to       provide…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696967/arms-sales-notification"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…individuals       in confined spaces, such as underground mines, and other       shielded environments, such as high-rise buildings or       collapsed structures, where conventional radio communication       is limited.\n\n``(2) Activities.--In order to carry out this subsection,       the Assistant Secretary, acting through the head of ITS,       shall…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693439/institute-for-telecommunication-sciences-codification-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…The Iran Sanctions Act of 1996 (Public Law 104-172; 50       U.S.C. 1701 note) requires the imposition of sanctions with       respect to Iran's illicit weapons programs, conventional       weapons and ballistic missile development, and support for       terrorism, including Iran's Revolutionary Guards Corps.\n\n(2) The Government of Iran has acquired destabilizing…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690688/solidify-iran-sanctions-act-of-2025"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…a well-established record of destabilizing the Middle East  and threatening its neighbors.\n\nThe Government of Iran is manufacturing weapons, including drones,  acquiring conventional weapons through malign actors, and supporting  those actors around the world by funneling weapons and financial  support. They do it through their terrorist proxy network…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690689/solidify-iran-sanctions-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…150 km (double that       of the baseline GMLRS) while also including a new height of       burst capability.\n\n5. The M57 Army Tactical Missile System (ATACMS) is a       conventional, semi-ballistic missile that utilizes a 500-      pound high explosive warhead. It has an effective range of       between 70 and 300 kilometers and has increased accuracy…", "date": "2025-10-02", "source_url": "https://justfacts.votesmart.org/public-statement/1695978/arms-sales-notification"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…rules regulating the lives of Americans. Previous regulatory  actions undertaken include air cleaners, fans and blowers,  dehumidifiers, commercial clothes washers, and conventional cooktops.  Who in the hell do these people think they are? We are Americans. We  ought to be able to choose whatever we want to, yet they tell us what  we can have and what…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…technologically feasible.\n\nHowever, under the Biden administration, the EPCA language was  persistently misinterpreted to impose more stringent standards on the  use of conventional home appliances and force the costly rush-to-green  agenda on the American people in their outright war on the fossil fuel  industry.\n\nAll of this was done with the stroke…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700167/dont-mess-with-my-home-appliances-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…nothing; establishing with powers so disposed--in  order to give to trade a stable course, to define the rights of our  merchants, and to enable the government to support them--conventional  rules of intercourse, the best that present circumstances and mutual  opinion will permit, but temporary, and liable to be from time to time  abandoned or varied, as experience…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700270/president-washingtons-farewell-address"}]