[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…comes  to the Constitution. Article I, section 8 provides that ``Congress  shall have [the] Power . . . To declare War''--not the President, or  the President if it is not convenient to the Congress, but the  Congress. And this body, for far too long, has been allergic to the  responsibility it has to govern the use of military force.\n\nNot since the very…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…a Republican majority, it would actually be pretty ironic that  the party who claims to be the staunch defender of the filibuster threw  the rules aside as soon as it was convenient.\n\nI have been honest on my views of the filibuster. I do think it needs  to be changed overall going forward, but it was my colleagues on the  other side of the aisle who…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691542/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…greater expense to receive in-person service.\n\nI implore this body to hold the Social Security Administration  accountable and ensure that our constituents receive good, convenient,  quality service.\n\nWe must immediately provide more funding and reinstate positions that  were lost. We will be held accountable by the voters if we fail this  task.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699376/concerning-state-of-service-at-social-security-administration"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…too cowardly to tell the truth about what really  happened on January 6.\n\nWe deserve leaders who stand for the Constitution, stand for our  democracy, not only when it is convenient for them but always. We must  defend American democracy.", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698553/january-6-attack"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…United States citizens with. Now we hear their  demand that we allow the current tax rates to expire, thereby raising  taxes on virtually every American citizen.\n\nIt is very convenient that they say billionaires. Now, they have  acknowledged millionaires, but just factually speaking, if the tax  rates are allowed to expire, virtually every American that…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Connecticut: We are going to stand up  for you to save your healthcare because you can't wait to get sick. You  don't choose to get sick on November 22 or January 3 when it is  convenient for Donald Trump and the Republican majority.\n\nYou need to know, when there is open enrollment on November 1,  whether or not your insurance will be affordable for you. You…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695873/9999"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…America has always been cyclical. At one time, one party is  in power. The next moment, another is. That is why we must all protect  it all of the time and not just when it is convenient for us.\n\nEveryone must defend the ability of a minority, Republican or  Democrat, to question and protest, because at some point, we will need  that right. That is why an…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…every classroom and to ensure also that every family has the services  they need for their children to succeed.\n\nWe didn't say educate children with disabilities if it is convenient.  We didn't say protect their rights unless the budgets are too tight or  we don't have enough money. We made a promise. We made a promise to  fund 40 percent of the cost…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698946/protecting-education-for-children-with-disabilities"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…detention center and do  their congressional oversight and see what is going on in those  detention centers?\n\nIt seems like Republicans are okay with transparency when it is  convenient to them, but when it is about Members of Congress,  regardless of their party that they are a part of, going to one of  these detention centers or holding centers, they are…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693072/special-interest-alien-reporting-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…truth, Mr.  Speaker.\n\nIn the process, Republicans are adding trillions of dollars to the  very national debt that the majority loves to complain about when it is  politically convenient. That is also the cold, hard truth.\n\nNumbers don't lie. Look at the Congressional Budget Office's  analysis. The Republicans' math does not add up. Again, this adds  trillions…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…residents can enjoy outdoor living with 700 acres dedicated to open  green spaces, parks and trails. This award-winning community is home to  over 70 diverse neighborhoods with convenient access to strong schools,  shopping centers, and other amenities. Not only does its outdoor  recreation set it apart, but Mountain's Edge offers its residents a  strong sense…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691310/recognizing-the-20th-anniversary-of-mountains-edge-community-in-clark-county-nevada"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…This would keep government services in the  community where it belongs.\n\nMr. Speaker, I strongly urge the new administration to reconsider  driving constituents away from convenient services and to work with  Members from New York State to find a solution before May.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687931/white-plains-social-security-hearing-office-closure"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…populations. These centers can offer increased accessibility for  individuals facing barriers to care, such as lack of insurance or  transportation difficulties. By providing convenient and affordable  options, ASCs can help to reduce health disparities and improve overall  community health.\n\nI want to acknowledge the following physicians for their exemplary…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695923/recognizing-the-physicians-at-dallas-endoscopy-center"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…Government, not at  the behest of foreign officials. Yet their findings were rejected and  their leadership positions removed simply because the truth didn't fit  a politically convenient story.\n\nAnd again, to be clear, there is no question that Maduro's regime in  Venezuela and the TDA are ruthless actors who pose real threats, but  punishing officials--punishing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…value ($10 billion) to       register under individual states. This allows a race to the       bottom, where unscrupulous sponsors would seek the state with       the most convenient rules. The bill calls on the states to       establish safety standards, but these will inevitably be       worked out between industry and lawmakers with little       consumer…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Pennsylvania. Mr. Speaker, I rise today to celebrate  Frozen Food Month and recognize the vital role that frozen foods play  in American households. Frozen food is more than just a convenient  option. It is a solution to food waste and a way to save families  hundreds of dollars.\n\nStudies show that frozen produce is less likely to be wasted compared  to fresh…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689069/frozen-food"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…taken correctly,  while offering simplified routines, clear explanations of benefits and  side effects, adherence tools such as pill organizers and synchronized  refills, and convenient delivery options.\n\nPharmacists provide accessible guidance anytime, empowering informed  decisions that promote safety, independence, and healthy aging.           Recognizing…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699709/retirement-of-judge-ronnie-fender"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…because they understand the importance of what we are trying to do in  this legislation.\n\nBy updating the way the VA communicates, we are guaranteeing veterans  receive convenient and timely updates wherever they are, on their  computer, phone, or tablet. Like so many students, they may live  remotely from their home address, which would prevent them…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695436/delivering-digitally-to-our-veterans-act-of-2025"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…know,  conveniently, the Biden DOJ neglected to investigate members of the  intelligence community for their treasonous involvement in the events  of January 6. That was very convenient. As a matter of fact, they never  brought the guy in who was in charge of Capitol Hill police for an  interview. They never wanted to talk to him. He was in charge of the…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698541/9999"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…for the $3 that she had on  her so an illegal immigrant could go to Target with his buddy and spend  the 3 bucks.\n\nWhy don't we hear about those stories? Because it is not convenient  to the narrative.\n\nThat is what we are fighting against and who we are fighting for-- that is who I am fighting for--and if it were up to me, we would be on  this floor…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Blockbuster Video last night? The fact of the matter is technology  changed because you now go home and hit a button, there are all your  movies. Oh, well, that made my life more convenient.\n\nYou are telling me that the thing you can blow into, the thing you  can wear on your body, the technology on this, you couldn't also use it  to keep yourself healthy when…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…the Constitution when the opposing party  is in power. Each of us took an oath to the Constitution to defend it  that applies at all times, not just when it is politically convenient.\n\nCongress maintains a constitutional duty to debate matters of war.  Playing politics when the lives of our brave servicemembers are on the  line and our country is at risk…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699091/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…spent at the institution to carry out the       examination;\n\n``(C) make every effort, to the maximum extent practicable,       to schedule the examination at a time that is convenient for       the institution; and\n\n``(D) to the maximum extent practicable, give the       institution advance notice of issues expected to be covered       in the examination.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…very bill from the beginning,  from jump start, because we should never protect pedophiles.\n\nFor months, my Democratic colleagues have done what they think is  politically convenient through all the yelling, through all the tears,  and through all the sadness.\n\nThey say releasing the Epstein list is of grave concern to them. If  that was true, where were…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696818/epstein-files-transparency-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…interest rates on  credit cards. That is why we are actually talking about overdraft  protection today, because time and time again people take advantage of  affordable, convenient, disclosed, not hidden overdraft protection so  that their family can avoid a late fee on a credit card, which she just  gave an excellent overview of her concerns about.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Representative  Fulcher.\n\nIn recent years, we have witnessed remarkable advancements in  consumer goods technologies. While these innovations certainly make  daily life more convenient, they also carry the risk of collecting data  from users, often without their knowledge.\n\nIt is clear to most people that devices like laptops have the  capability to record…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690179/informing-consumers-about-smart-devices-act"}]