[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…of progress--using the power of my congressional letterhead,       using the power of my pen as a lawmaker, using the power of       my platform, using the power of convening, which is what       brings us here today.\n\nI also do want to take a moment to acknowledge the       indefatigable efforts of my staff that I call the A team who       make…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699707/congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…HOULAHAN. The gentlewoman is very welcome. It is my privilege.\n\nMr. KENNEDY of New York. Mr. Speaker, I begin by thanking my friend  and colleague, Representative Houlahan, for convening this Special  Order.\n\nMr. Speaker, I rise today to support our ally, Ukraine, and speak up  against the grave threat the Trump administration's support for Russia  poses…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "Mr. JACKSON of Illinois. Mr. Speaker, I thank the Congresswoman for  her leadership and her stewardship. I thank the body for convening  during this very special hour.\n\nDemocracy is on trial this week.\n\nMr. Speaker, I rise tonight with a fervor and the burden of history  on all of our backs. The question…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…environmental stewardship, reminding the world that  creation itself is a sacred trust. Through initiatives such as  establishing a worldwide day of prayer for the environment and  convening international gatherings of scientists, leaders, and  theologians, he has exemplified how faith can serve the common good.  His tireless journeys across continents and his…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695368/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…democracy. Today we are talking about how we preserve democracy  under the circumstances that we are living in.\n\nMrs. WATSON COLEMAN. Mr. Speaker, I thank Mrs. Ramirez for convening  this very important discussion.\n\nI will talk about something that is a little bit of an extension of  this, but I do want to remind people that I visited Delaney Hall  Detention…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Ms. STANSBURY. Mr. Speaker, I thank Mr. Min for convening this  Special Order hour. As we are getting set up, I know that we have a  poster that we want to get up here, so let me just start out.\n\nMr. Speaker, breakups are hard.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692039/consequences-of-doge"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "Mr. KHANNA. Mr. Speaker, I thank Representative Deluzio for his  leadership and for convening this group and focusing us on an agenda of  economic patriotism.\n\nThe reality is in this country, and as you know in western  Pennsylvania, we have watched industry after…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689079/economic-populism"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "Mr. TONKO. Mr. Speaker, I thank the gentleman for yielding.\n\nMr. Speaker, I thank the Congressional Hispanic Caucus and  Congressional Progressive Caucus for convening this very important  discussion this evening.\n\nOver the past year, the Trump administration has pursued immigration  enforcement actions, actions that are deplorable, inhumane,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699664/horrific-ice-abuses"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…replied: Anyone. Mr. Speaker, I am from  the working class town of Toledo, Ohio. We understand a dodge when we  hear one. I then reasked the question yesterday in a bipartisan  convening here in the Congress: From which accounts, Mr. Secretary,  were funds diverted to pay for the billions of dollars being expended  in the Gulf and Atlantic theater. Again,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…tragically died in that outbreak. And  while measles is spreading across our Nation and we are having one of  the worst flu seasons in the last decade, HHS has delayed the convening  of critical advisory councils of the CDC and FDA. These advisory  councils are responsible for determining the vaccine schedule--what  vaccines must be covered by insurance--and…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…live in this  country and care for their families, and that is un-American.\n\nI am so grateful to Chairwoman Clarke and my fellow CBC member,  Representative McClellan, for convening us again tonight as we look  ahead to the year 2026. I truly look forward to working with every  single one of my colleagues to build a better life for the hardworking  families…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697215/medical-bills-are-too-high"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…out of the House Ways and Means Committee. It  enjoys overwhelmingly bipartisan support with 332 House cosponsors and  67 Senate cosponsors.\n\nLater today, I look forward to convening lawmakers, researchers,  advocates, and families for a roundtable on the latest developments in  prevention, early detection, and treatment. I thank the Pancreatic  Cancer…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697076/observing-world-pancreatic-cancer-day"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…am sickened by what this administration has done to USAID and to  the world. I will do everything I can to reverse this awful decision.\n\nMr. Speaker, I thank Dr. Foster for convening us together and for his  leadership.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699033/expiration-of-new-start"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…conveniently  avoid the CFPB's oversight and supervision.\n\nWhen I was chair of the Committee on Financial Services, Democrats  held Big Tech companies to account, including convening a hearing with  Facebook CEO Mark Zuckerberg over his plans to develop cryptocurrency  called Libra.\n\nMoreover, when Democrats led passage of the Dodd-Frank Act, we  empowered…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…for Global Health, USAID                       Oral Statement by Nick Enrich\n\nRanking Member Shaheen, Members of the Senate Foreign       Relations Committee, Thank you for convening this important       round table.\n\nI am Nicholas Enrich, a career civil servant with 15 years       in the federal government under four administrations--both       Democrat…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…transaction of routine business, provided       that one Member of the Minority is present. For the purpose       of this paragraph, the term ``routine business'' includes the       convening of a meeting and the consideration of any business       of the Subcommittee other than reporting to the full       Committee on Homeland Security and Government Affairs…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688278/us-senate-subcommittee-on-disaster-management-district-of-columbia-and-census-rules-of-procedure"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…determination of the       Chief Prosecutor of the Coast Guard to refer charges and       specifications to a court-martial for trial shall be binding       on any applicable convening authority for the referral of       such charges and specifications.\n\n``(5) Deferral to commander or convening authority.--If the       Chief Prosecutor of the Coast Guard…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "Convening of Meetings\n\n1.1. The regular meeting day of the Select Committee on       Intelligence for the transaction of Committee business shall       be every Tuesday of each month…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}]