[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…scientist himself, he was popular,       well-respected and beloved for his hard work and dedication.\n\nLess than two years ago, in recognition for his service, he       was converted from contractor to federal employee. We were so       proud. On a day ironically devoted to love, my son was yanked       from the position he cared about and discarded like…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…percent that is  utilized for civilian energy--it was still not enriched to the level to  build a bomb. It would have had to be enriched to 90 percent. It would  have had to be converted to metallic form. It would have had to be  arranged with an extensive system of explosives that compress it in  order to start a chain reaction. That is a very difficult…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693126/motion-to-discharge-sj-res-59"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…Among them is Artemis Ghasemzadeh, an Iranian woman who fled Iran  after converting to Christianity, a crime punishable by death under the  brutal Islamic regime.\n\nArtemis converted to Christianity in secret through a network of  underground churches and online classes in Iran. Last December, she set  out for the United States in search of a new life.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688337/migrants-fleeing-religious-persecution"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…thinking about as, over time, special events  take place that change the direction.\n\nThe first special event was the passage of the 1964 and 1965 bills,  led by Democrats that converted the anti-civil rights party into the  pro-civil rights party. And the flip on the Trans-Pacific Partnership  being driven by Trump's effort as a Republican candidate to become…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…of Norwich, it is often used as a landmark: ``Turn right at  Dan & Whit's.'' The building itself is historic, too, having served as  a townhall and post office before being converted into a general store.  Dan Fraser and Whit Hicks, longtime friends, bought the store from its  previous owners in 1955 and renamed it Dan & Whit's. The store has been  run…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694332/recognizing-dan-whits-general-store"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…definition of ``firearm''       under the Gun Control Act of 1968 (GCA).\n\nUnder the GCA, a ``firearm'' includes ``any weapon which       will or is designed to or may readily be converted to expel a       projectile by the action of an explosive,'' as well as ``the       frame or receiver of any such weapon,'' which houses the       critical fire control components…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…de-escalation, not firearms. It draws clear  lines, focuses on devices designed to incapacitate without causing  serious injury, and explicitly prevents any device that would be  converted into a lethal weapon from falling under the new definition.\n\nDemocrats will claim that this bill is dangerous. They always do. The  real danger is forcing our law enforcement…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…the date of enactment of this Act--\n\n(A) under chapter 7 of title 11, United States Code; or\n\n(B) under chapter 11, 12, or 13 of title 11, United States       Code, that is converted to a case under chapter 7 of title       11, United States Code.\n\n(2) Bankruptcy fees.--Section 4 and the amendments made by       section 4 shall apply to--\n\n(A) any case…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698845/bankruptcy-administration-improvement-act-of-2025"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…like my own. So I am going to vote for all of it so they can all  stay in there.\n\nRemember, the Republican conference, back in 2010, adopted an earmark  moratorium. This was converted into a permanent earmark ban, in 2019,  that is still in effect, which shouldn't be ignored.\n\nWhat do these $7 billion do? Well, among other things, they do a lot,  including…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699442/consolidated-appropriations-act-2026"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…404 permitting is the Waters of       the United States rule. This bill codifies long-established       exclusions such as ephemeral features, groundwater, and prior       converted cropland that have been included as part of WOTUS       regulations over the years. This will provide important       predictability and consistency for property owners when…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…prevent these ideas from taking hold amongst  discussions about ghost guns, which is something that is out there on  the street. For any weapon that also has kits that can be converted to  a firearm, it doesn't apply to them.\n\nThis bill also requires ATF to deny classification to any device that  could be readily modified into a firearm.\n\nI know there is…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700039/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…That was just the start.\n\nMr. Speaker, they followed it with another $150 million in March 2022  and then $800 million more in December of that year. FEMA was  effectively converted into a border response welfare agency and  rebranded as the Shelter and Services Program. It paid for migrant  housing, transportation, and services in sanctuary cities,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "French Hill", "party": "Republican", "sentence": "…original scope of the       project:\n\n(I) Acquisitions of open space or residential property,       where such property will be retained for the same use or will       be converted to open space to help residents relocate out of       an area designated as a high-risk area by the Secretary.\n\n(II) Conversion of existing office buildings into       residential…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…projectile device to include only those devices that meet all       the following tests:\n\nThe device is not designed or intended to expel, and may       not be readily converted to accept and discharge, ammunition       commonly used in handguns, rifles, or shotguns.\n\nThe device is not designed or intended to expel, and may       not be readily converted…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…School of Trades continued to thrive as a training center  for the area's technical industry with increasing student enrollment  and course offerings. In 1942, courses were converted to War Training.  At the close of World War II, new courses were added to help veterans  re-enter the workforce such as: Radio, TV, Auto Mechanics, Machine  Shop, Refrigeration,…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696575/recognizing-the-100th-anniversary-of-gadsden-state-community-college"}]