[{"senator": "Terri Sewell", "party": "Democrat", "sentence": "…legacy.\n\nSince his defeat in the 2020 election, President Donald Trump and his  Republican allies have pushed the big lie of a stolen election. The  majority has tried to convince the American people of the lie that  noncitizens are a threat to our elections and are using that lie as an  excuse to pass a new law, such as the SAVE Act, which would make…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689343/fighting-voter-suppression"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…That alone demonstrates Republicans' inability to govern.\n\nThen we have the so-called SAVE America Act. The gentleman from Texas  is going to spend today's debate trying to convince you that this is a  commonsense, simple bill, but I want you to remember a very few  important facts while he is talking.\n\nFirst of all, it is already illegal for noncitizens…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…floor today would  overturn those protections, once again putting our beloved Boundary  Waters at risk of toxic pollution from a foreign-owned mine.\n\nIf that weren't enough to convince my colleagues that this resolution  is a terrible idea, I will briefly touch on the abuse of the  Congressional Review Act itself that this resolution represents.\n\nThe Congressional…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…future generations of Americans.\n\nThird, extend the same opportunity that the Democratic       Women's Caucus did and invite us to meet with you so that we       can try to convince you that we matter. We will come back to       Washington. We will tell you why we matter. We will tell you       why this matters.\n\nWe are not a ``hoax.'' We are mothers,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695788/a-letter-from-survivors-of-jeffrey-epstein-and-ghislaine-maxwell"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…what so many communities have already  known to be true: Terrorizing is the point. Violating our rights is the  point. Fear is the point.\n\nCreating a public enemy is meant to convince Americans to sacrifice  our freedoms for the promise of security. Let me be very clear. Nothing  that the Department of Homeland Security is doing is making us any  safer.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697453/fighting-dhs-immigration-raids"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…RAMIREZ. Mr. Speaker, fascism always demands a public enemy.  Through lies and scapegoating, the Trump administration has tried to  make immigrants the enemy. They have tried to convince us that the  problem isn't their abuses of power or the unchecked greed of  multinational corporations but it is immigrants.\n\nIn their 100 days in office, the Trump administration…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690501/trump-immigration-policies"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…do pollution and health risks,  especially along the Gulf Coast.\n\nNow, let's talk about point number two. Mr. Speaker, if higher costs  in electric bills are not going to convince you to vote against this  bill, then I hope that America's national security will. Republicans  and the gas industry and their lobbyists want carte blanche to export  gas…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…but we have to do the job. The Founders lit the flame, but we  have to keep it burning. They started the work, and we must continue  it.\n\nTonight, the President will try to convince you that everything is  fine. I am asking you to trust your own eyes, to trust your own  experience, to trust the evidence, and then I am asking you to trust  something else:…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…can only lead to the demise of our  country and the destruction of our humanity.\n\nSo in this defining moment, may we resist the seductive sirens of  those who are trying to convince us that we are at war with one  another. Amidst our fierce debates, I submit that at the end of the  day, we are all we have got--we the people. All we really have is one…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695312/cloture-motion"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…has earned the right to citizenship in the United States.''\n\nDouglass believed the Civil War offered the Black soldier an  opportunity to gain his stripes, but he could not convince his friend,  Abraham Lincoln, to allow Blacks to serve. In August 1862, a formerly  enslaved Black man from South Carolina came here to Washington and  convinced Lincoln to…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…``wouldn't have wanted that, not a second  strike.''\n\nLet me be clear. Secretary Hegseth has blatantly carried out illegal  acts of violence and, right now, he is trying to convince the American  people that these actions are okay. Mr. Speaker, the American people  know better, and they deserve better.\n\nMr. Speaker, in case anybody tuned in to the President's…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…when the Chamber was stormed, and  that is a day I will never forget. Forgive my passion on the point of  getting that plaque up. I wish our colleagues would just help us  convince the Speaker of the House that this is something that is  simple, and it should be done. It is not a partisan issue.\n\nOn that day, we were not Democrats or Republicans. We…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…no guarantee that  the United States Senate is going to take this up. This may all be for  show just to make people feel guilty about having voted for this or  wanting to convince voters back home that they really weren't complicit  in giving this extraordinary bonanza to a handful of elitists who feel  somehow aggrieved by the fact that they had information…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696924/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…nation would the penalty for seeking a better life for  yourself or your neighbors be a terrible death?\n\nIn what decent society would the government deploy propaganda to  convince the masses that its victims deserved their fate?\n\nCatching an ICE agent in a bad mood should not warrant capital  punishment. Being undocumented should not be a death sentence.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699655/horrific-ice-abuses"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…of women would face additional  burdensome steps to register to vote.\n\nI want to be clear; this bill is not simply a voter ID bill and  labelling it as such is a trick to convince Americans of its intent. It  is already illegal for noncitizens to vote in federal elections. Now,  Republicans want to force every American to provide burdensome and  expensive…", "date": "2026-02-13", "source_url": "https://justfacts.votesmart.org/public-statement/1700083/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…should do, not unelected nameless bureaucrats.\n\nMr. Speaker, our colleagues on the other side of the aisle have spent  an enormous amount of time the past few weeks trying to convince  Americans they are the party of blue-collar American workers.\n\nWell, in the spirit of bipartisanship, I encourage my Democratic  colleagues to join me in support of this…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688098/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Madam President, recently, we witnessed China peddling  false claims as it continues to try and convince the United States that  China is a good partner. China has recently claimed that ``the Chinese  always honor and deliver what has been promised.'' What China asserted  is…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692787/intercountry-adoptions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…interest rates, my math is 45 percent of all tax receipts  would go to interest.\n\nWhen you see people come behind these microphones, how many people  are saying: Hey, how do we convince the bond markets? The bond markets  are basically on the edge of running this country now because when you  borrow $6 billion a day--next year, I think we borrow $6.5, maybe…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…will tell  everybody, will try and get pictures: We stand with law enforcement. We  stand with the police. We support them. Whatever they need, we are  there.\n\nThey want to convince you of that because, of course, as law-abiding  American citizens, it is the right thing to do.\n\nRepresentative Roy, when I was growing up, if there was a criminal  running…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…can't punish Federal employees  for our dysfunction.\n\nIf you are serious about that, I told the Senator from Maryland, vote  to get on the bill. I will include that; I will convince our conference  to include furloughed workers. Get on the bill. We will amend it. We  will get this passed, and we will start paying people.\n\nHe rejected that offer. Now,…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…government that exploded our national debt, exploded  prices, not to the tune of $1,000 but tens of thousands of dollars on  Americans across the board, and they still tried to convince people  that their policies had nothing to do with it.\n\nThat is why this House is in Republican hands, the U.S. Senate is in  Republican hands, and the White House is in Republican…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "French Hill", "party": "Republican", "sentence": "…assessment of the  strategic minerals available for Ukraine's further economic  development.\n\nThe time for action is now. Apparently, Putin needs more unified  pressure to convince him that, in fact, jaw-jaw is better than war-war.\n\nLet's not look back with regret that Congress did not act in the face  of Putin's corrupt, catastrophic, and contemptuous…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695367/greater-sanction-pressure-on-russia"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…completely false. They will prey on the fears of  our most vulnerable Americans and they will try to intimidate my  Republican colleagues into inaction.\n\nThey will try to convince our seniors and those families and  individuals who struggle that we will somehow steal their safety net or  cut their program, which couldn't be further from the truth.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…help our brothers and sisters, only to later find out  that we have been financing scammers.\n\nI have a passion for dealing with the long-run debt of this country.  How do I convince the American people that we are going to have to do  hard things when they are able to point and say that you haven't taken  care of the filth and the stealing from our society,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…saw Americans, one  nation under God, and their goal was to destroy us. When we lose sight  of seeing the humanity in our fellow Americans who think differently  than us and convince ourselves they are the enemy instead of our  neighbor, we are feeding into the very thing our adversaries want, and  destroy our great country from within. We are better than…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695600/we-are-better-together"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…offices saying: Don't let DOGE and those actually make the system work.  I am sorry they are scared of change.\n\nDid I mention that we borrow $72,000 a second?\n\nHow do we convince our brothers and sisters across the country that  we, as Members of Congress, the administration, and the bureaucracy,  are taking it seriously if we are not even willing…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "French Hill", "party": "Republican", "sentence": "…inquire of my good  friend from California if she has any other speakers.\n\nMr. Speaker, I thank my friends on this side of the aisle who have  worked hard today, Mr. Speaker, to convince everybody in this body that  this is a serious overreach by the CFPB in a Federal price mandate.\n\nInstead of letting consumers choose their financial institution and  choose…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…immediately struck down in court.\n\nWhat they are now plotting is a special election where they will use  confusing ballot language and other means of deception to try to  convince voters--to fool voters--into dismantling the very independent  commission that they recently established.\n\nThe point of this is that the Governor would like to reduce the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694130/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…American people when she was campaigning  across this country. Instead, all we heard was about Kamala brat summer  and the last-ditch jittery attempt at once again trying to convince  Americans that Trump was somehow a threat to democracy. Democrats lost,  historically, on November 5, 2024. They lost the electoral vote, the  popular vote, and they lost…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…we need a scorekeeper.\n\nMy grandfather used to have this saying: It doesn't matter how you  play the game. It is who keeps score. He thought that was hysterical.\n\nHow do we convince the American people we are serious about economic  growth, productivity, taking on the debt and deficits, and not  bankrupting their future when we spend almost every day…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}]