[{"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "Ms. JAYAPAL. Mr. Speaker, I thank the gentleman for leading this  conversation about how we can stand up  for our people and unrig the economy. That is economic patriotism.\n\nI want to be very clear. Our economy has been rigged by giant  corporations…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689086/economic-populism"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…you can come from a very humble  origin, and you can end up here. When I first got here, Jon Tester, a  farmer from Montana and a Senator from Montana, told me about a  conversation he had with John D. Rockefeller when he got here. He said  Rockefeller told him: You and I came from very different places, but we  both ended up here.\n\nIt is the beauty…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692501/alex-padilla"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…action.\n\nShe ran for Congress as a mother, a nurse, and a voice for families  devastated by the senseless scourge of gun violence. Her courage helped  shape the national conversation and inspired a generation of advocates  whose work is saving lives in communities across our country every day.\n\nShe also advocated for America's children as a member of…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693023/moment-of-silence-in-memory-of-the-honorable-carolyn-mccarthy"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…difficult to make sure that I can cover the costs, so I have to work  a second job. What are you going to do about it?''\n\nThat is why I am so grateful that we are here having a conversation  about what the job of Members of Congress is: to make the lives of  their constituents better.\n\nIt is not to make Donald Trump's life better, not to make Kristi  Noem's…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…their vital work in uplifting their  community, challenging stereotypes, and leading with grace and love.  Their efforts remind us that reconciliation is possible--one  conversation, one relationship, and one act of compassion at a time.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692273/recognizing-mission-mississippi-of-leflore-county-for-its-commitment-to-racial-reconciliation-and-community-unity"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…rooms. We know that because people will try to get  healthcare wherever they can, even if it is the most expensive way of  doing it.\n\nWe would be a lot better off having a conversation about how to cover  everybody in a way that costs us as little as it costs in other  countries around the world.\n\nBut not only are we not having that discussion with this…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…here, listening to you themselves, and others who, I am sure,  are tuning in. Whether it is on social media or on C-SPAN or on one of  the news outlets that is carrying the conversation that you are having  on behalf of the American people, I want to say thank you. Thank you  for your courage, for your conviction, and for your tireless leadership  in speaking…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…takes working people and makes their challenges harder, all to give  more tax cuts to billionaires and drives up our deficit by the  trillions--that should be the central conversation in our country.\n\nBut this President, almost as if he knows the unpopularity of his  bill, the betrayal of his bill, is misusing, abusing his powers and  trying to change…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692454/alex-padilla"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…deceased, to be filled soon; District 29,  occupied by a person of color; District 33, occupied by a person of  color.\n\nNow, this letter goes on to infuse race into the conversation. The  last sentence in the last paragraph reads: ``If the State of Texas  fails to rectify the racial gerrymandering of TX-09, TX-18, TX-29, and  TX-33, the Attorney General…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694163/racism-infused-in-texas-politics"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…America's  servicewomen and -men as they become veterans; that we will take care  of you just as you have taken care of us.\n\nBecause of this, I find it disheartening when I hear conversation  gaining speed about veterans not deserving the benefits provided to  them or of defrauding the compensation and pension system en masse:  Project 2025, The Economist, The…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696762/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…people packed  here on the House floor. There is staff. It is sometimes hard to move  around. You have to get your vote in, Mr. Speaker. You can't get too  entranced in the conversation, or you miss a vote.\n\nMr. Lewis came up to me, and he tapped me on the shoulder. He said to  me that he heard my words about his friend, John Dingell, and that he  appreciated…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…nuclear deal back in 2015 have to be recreated. And, in fact, we  learned over the last few days how diplomats from President Trump's  team have been working on this, were in conversation with Iran before  Israel's attack to create such an arrangement. In fact, they continued  those conversations even as bombs were dropping.\n\nWe have to succeed to put in…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693126/motion-to-discharge-sj-res-59"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…especially those on the Energy and  Commerce Committee, have been completely unwilling to acknowledge the  role that expanding the grid must play in any serious, bipartisan  conversation on permitting.\n\nThe bills this week and next week aren't a serious attempt at  permitting reform, far from it. One of them tells us that, despite  Democrats talking for…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Democrats are asking for is something you ought to be doing anyway just  to help your own constituents. This shouldn't be hard at all. We should  not be here having this conversation. This should have been resolved  already--except that the Republican majority wants to rule, not govern,  and they have this strange fixation with taking away healthcare…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695927/government-funding"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…existence of our humanity as a people, and by  extension, the humanity of all people.\n\nMr. JACKSON of Illinois. Mr. Speaker, I find it interesting when we  started this conversation about diversity, equity, and inclusion, I  invited some of my other colleagues to participate. One person asked  me: Is it legal for you to discuss DEI, diversity, equity,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…support of H.R. 1190, the Expanding Access to  Capital for Rural Job Creators Act. I commend Congressman Downing for  leading this commonsense bipartisan bill.\n\nToo often, the conversation around capital formation is centered on  financial hubs like New York and San Francisco, but the backbone of  America's economy is the local business communities in cities…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692759/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…were three motorcycle officers, all killed.\n\nAt their memorial service to honor them, President Trump, myself, and  a few of our friends, Eric and Dan, we were having a conversation that  there is no medal which is awarded posthumously to law enforcement  officers and first responders killed in the line of duty directly from  the Office of President…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699504/medal-of-sacrifice-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…State  basketball champions in Wa-Hi history. Yet, for more than four decades,  the 1984 champions have had no victory cup to mark their achievement.\n\nWhat began as a casual conversation last spring has turned into the  long-awaited correction of that injustice. This Saturday, after 42  years, the 1984 team will finally be recognized with a ceremony and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699649/recognizing-1984-walla-walla-high-school-girls-basketball-team"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…subsidies that were added in  2021. Those temporary tax gifts to insurance companies expire in just a  few weeks.\n\nNow, he knew that they would expire. As he told me in our  conversation we had this week, he said he knew they were temporary, but  now he is trying to figure out what to do to find affordable healthcare  options for himself because his healthcare…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…constant basis with the LAF. I have stood  in Lebanon and seen the destruction of Hezbollah caches, massive  amounts. More than that, I have met with our ally Israel, and in  conversation with Prime Minister Bibi Netanyahu, I asked him: Should we  continue to give money to the LAF? His answer was short: Give them  more.\n\nMadam Chair, King Abdullah of Jordan…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693681/department-of-defense-appropriations-act-2026"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…bring creativity, and they bring drive. We should be clearing the path  and not blocking it.\n\nMr. Speaker, today is a fly-in day for the House of Representatives.  This conversation between Chairman Williams, Mr. McGarvey, and the  leadership of Ranking Member Velazquez won't get the headlines because  this apparently doesn't sell to the news media.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691757/entrepreneurs-with-disabilities-reporting-act-of-2025"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…skis and those Panga  boats that are smuggling in people and drugs.\n\nThey are doing a great job. I am grateful those folks are there. But  this body needs to have a further conversation about how do we move  more Coast Guard folks there so that they can take on that job,  allowing our military to go back to doing their first job. How we can  actually reinforce…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…Ever since Ben has stepped back from public life following his time  in the Senate and at the University of Florida, his intellect and voice  have continued to influence conversation across the country.\n\nFrom education to healthcare and beyond, he has shaped debates in  higher ed, politics, journalism, and more through the years. Ben did  this all at…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698932/recognizing-mayor-david-black"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "Mr. HIGGINS of Louisiana. Mr. Speaker, let's have a candid  conversation if we could, sir, with my colleague across the aisle about  what is happening here.\n\nCongress and America, we need to clarify for the citizens watching,  Mr. Speaker, Congress…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692375/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…way that empowers those closest to the student, because they  are in the best position to do what is right for that student.\n\nWhen I met with Mrs. McMahon, we had a long conversation about South  Dakota's unique education needs, including our Tribal schools, and I  look forward to working with Linda McMahon to limit bureaucracy,  empower State and local…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688343/nomination-of-linda-mcmahon"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…has  opportunity in America if they are allowed to live.\n\nIt is this ongoing dialogue that we have as a country: Do we value  the most vulnerable in our society? It is a conversation that has been  going on now five decades, and next week, there will be tens of  thousands--probably, actually, hundreds of thousands--of students and  adults that will all…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…environment--a practical, pragmatic, economical  approach--and I look forward to the day when my friends across the  aisle want to sit down with Republicans and have a real conversation  about how we get there.\n\nAnd, again, I am just committed to leaving this world cleaner,  healthier, and safer. I don't believe that we can go along with my  colleague from…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698992/unanimous-consent-request-s-res-550"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…benefits. This is actually based on some numbers  where I think they may have too high a fertility rate.\n\nThe reason I point that out is we are not having the really difficult  conversation here. What happens in a country this year when my  economists on the Joint Economic Committee are saying that we may have  zero population growth in the United States this…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…is  something historic, and it is something monumental.\n\nAs I was talking about at the beginning of my remarks, when I first  ran for Congress in January 2020, the entire conversation of every  single candidate was: How do we go about extending and making permanent  the tax reform that just took place in our country a few years prior  and the juice that…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…supply chains  begin with resources and begin with energy  to process those resources. Alaska is the cornerstone of this strategy,  and we are excited to be a part of that conversation. I look forward to  the opportunities that we will be bringing forward in the 119th  Congress to advance Alaska's interests, our Nation's interests, and  restore domestic…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689194/work-highlights-of-western-caucus"}]