[{"senator": "Rob Menendez", "party": "Democrat", "sentence": "…food and groceries.\n\nTrump said his mass deportation agenda would only target violent  criminals, but over 90 percent of detainees being held in New Jersey  have no criminal conviction.\n\nTrump said he would improve the Affordable Care Act, yet he just  signed a bill into law that cuts over $1 trillion from healthcare and  will cause an average ACA premium…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694040/trump-administration-chaos"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…force was born, a force of grit,  determination, and unshakable loyalty. Since that day in 1775, marines  have answered every call, without any exception, with courage and  conviction, not because it was easy but because it was right.\n\nThe motto of the Marine Corps, ``Semper Fidelis''--``Always  Faithful''--is more than just a phrase; it is a lifelong…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696623/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…colleagues and my dear  friends, Majority Leader Scalise and Majority Whip Emmer, for being  here.\n\nMr. Speaker, I rise today with, obviously, mixed emotions and  reluctant conviction. There is a true story I have told many times over  the past 60 years. It is about a young man--myself--who was a student  at the University of Maryland, College Park, just…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698817/retirement-announcement-of-steny-hoyer"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the future to healthcare, to education, anything  Republicans decide they don't like, all on a party-line vote, all  because of obeisance and fear of Donald Trump, not a conviction that he  is doing the right thing. This is a dark omen moving forward.\n\nOur Republican friends say they fight for the middle class. They say  they fight for working people.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693459/rescissions"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…without any opportunity for judicial discretion or waiver.  Under current immigration law, undocumented people are already both  inadmissible and deportable. Furthermore, conviction for serious DUIs  already render even lawful permanent residents who have been in the  country for decades potentially deportable and inadmissible in the  first instance.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693082/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…Iran. As I stated this week in the Intelligence Committee: Those  strikes having been taken, I certainly hope they were effective. Most  of the Congress is united in our conviction that Iran must not build or  acquire a nuclear weapon. An urgent unanswered question is whether the  administration's use of force meaningfully advanced that longstanding…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693087/sj-res-59"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the most during my career. There are a few that stand out,  including my steadfast belief that the promise of medical research  funding is one of the most important. That conviction led me to join  forces more than 10 years ago with a bipartisan group of Senators:  myself; Senator Patty Murray, a Democrat from Washington; Senator Roy  Blunt, then-Republican…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690656/national-institutes-of-health"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…affordable housing for seniors, and  championing NASA Glenn Research Center as a hub of innovation.\n\nShe also stood as a symbol of representation. Her legacy of courage  and conviction inspired countless women and minorities to enter public  service, knowing that their voices would be heard at the national  table.\n\nCongresswoman Oakar's public service was…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695548/moment-of-silence-for-mary-rose-oakar"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…judiciary, threatening Members of the House  of Representatives, and threatening Members of the Senate.\n\nDonald John Trump, by his conduct, merits impeachment, trial, and  conviction in the Senate of the United States of America and should  never hold any office of public trust ever again.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697871/and-still-i-rise"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…she cast her very first vote, proof her decades of advocacy helped  transform our Nation.\n\nShe was a minister, a reformer, a writer, and, above all, a woman of  courage and conviction. We remember Antoinette Brown Blackwell not just  for what she achieved but for the path she paved for generations to  follow.\n\nLet us honor her on her 200th birthday and…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691473/antoinette-brown-blackwell"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…despite its popularity across the Nation, across the  political aisle. He was going after something that wasn't left or  right, that Americans were saying in the course of conviction that this  is about right or wrong, and it is wrong to take away healthcare for  millions of people.\n\nLet me explain, if I can, or speak to a few points from a recent  report…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…the news outlets that is carrying the conversation that you are having  on behalf of the American people, I want to say thank you. Thank you  for your courage, for your conviction, and for your tireless leadership  in speaking up today on behalf of all that is going on across America  and around the world but especially what is impacting your  constituents.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…situation might imply, I am influenced by no  diminution of zeal for your future interest, no deficiency of grateful  respect for your past kindness, but am supported by a full conviction  that the step is compatible with both.\n\nThe acceptance of, and continuance hitherto in, the office to which  your suffrages have twice called me have been a uniform sacrifice…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…was right. Dr. King has given us the notion that the  time is always right to do what is right.\n\nThere is but one solution, and that solution is impeachment, trial,  and conviction, but if not trial and conviction, impeachment, so that  those who look through the vista of time will understand that we took a  stand against a reckless, ruthless, lawless…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700176/state-of-our-union-is-fragile"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…Garcia when hearings were held  about the inhumane and barbaric  treatment of Chicagoans across his district and other districts by this  administration and ICE. I saw his conviction, his commitment, his love  for not just his district but the city in which he was raised and  lives.\n\nThis is a man who is a legend. He is a legend to his district, and he…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696775/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…Fleet.  He was a veteran of both the Vietnam War and Desert Storm, embodying  courage, commitment, and leadership throughout his military career.\n\nJerry brought the same conviction and discipline to his leadership  within the Oneida Nation. He was elected Chairman of the Oneida  Business Committee in 1995 and again in 2005, where he advocated  tirelessly…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692114/recognizing-gerald-jerry-danforth"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…country.\n\nToday, I am proud to tell you just one of many stories of Bruce  ``Puppy'' Fecht, and we honor him not just for what he did but for how  he did it, with courage, with conviction, and with a spirit that lifted  up everyone around him.\n\nHis legacy lives on in the hearts of those who served alongside him  and the freedom that he so selflessly defended.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…cannot be taught, only lived.\n\nHe fought tirelessly for the farmers, the ranchers, and the  communities too often ignored by the coastal elites, and he did so with  candor and conviction and a sense of humor that made even the hardest  days feel better.\n\nDoug was more than a colleague. He was a friend. He was a brother.  His leadership, his wisdom, and his…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698721/9999"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…of the Nova music festival, where  Hamas terrorists carried out one of the most horrific attacks on  October 7.\n\nThe trip was both sobering and inspiring. It reaffirmed my conviction  to stand with the people of Israel, while working toward the goal of a  more peaceful Middle East.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695802/reflecting-on-trip-to-israel"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…under section 301 of the National Organ Transplant       Act (42 U.S.C. 274e) and is subject to imprisonment or parole       or other supervised release as the result of such conviction       if such individual, in the commission of such an offense,       used a passport or crossed an international border.\n\n(b) Revocation.--The Secretary of State may revoke…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…many.\n\nMia brought passion, energy, and an unwavering commitment to the  people of Utah's Fourth District, a district that I am now proud to  serve. She led with grace and conviction, never backing down from a  challenge, and always striving to make a difference for those she  served. It is for me a profound honor to follow in her footsteps.\n\nHer legacy…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689230/moment-of-silence-in-remembrance-of-the-honorable-mia-love"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…been spared the harm committed by such  aliens, as we saw in the case of Arturo Cruz-Badillo. Cruz-Badillo is a  Mexican national who had seven--seven--DWI convictions, a conviction  for battery, and was removed from the United States three separate  times. But despite all of these criminal convictions and removal for  illegal entry in the United States,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "John Rose", "party": "Republican", "sentence": "…away from their families to protect ours. They stay late  writing reports or working events. They are often required to testify  in court on their days off to ensure the conviction of a suspect they  have arrested. That time, overtime, is needed to truly serve their  communities. They do it without complaint.\n\nThey do receive extra pay, of course, for…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693037/benefits-of-the-one-big-beautiful-bill"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…with page after page of Palau's incredible landscapes. But  beneath that beauty, lies real strategic importance. Palau reminds us  that size is not what determines strength; conviction is.\n\nGuam, home to over 150,000 U.S. citizens, is central to our Indo- Pacific posture. Together, with partners like the Philippines, Palau,  and Taiwan, we are building…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…new beginnings through National Adoption  Day events, or demonstrating compassion in the Scotts Bluff juvenile  drug court, he exemplified a judicial career built on the conviction  that justice should be firm, fair, and just.\n\nJudge Worden will be remembered for his strong faith and devotion to  his family and as a trusted member of his community.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699724/recognizing-and-thanking-judge-james-worden-upon-his-retirement"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…country illegally is guilty of criminal conduct.  However, what triggers the enhanced penalties is either illegal  reentry--illegal reentry--after deportation or a felony conviction  within the United States.\n\nLet me be clear to preempt some of the concerns on the other side of  the aisle. This bill adheres to strict and constitutionally protected  due…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "Mr. COMER. Mr. Speaker, pursuant to House Resolution 879, I call up  the bill (H.R. 5214) to require mandatory pretrial and post conviction  detention for crimes of violence and dangerous crimes and require  mandatory cash bail for certain offenses that pose a threat to public  safety or order in the District…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696981/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…renewed hope and  dignity.\n\nMr. Speaker, Diane Reitz embodies the highest ideals of duty, honor,  and country. Her story is a powerful reminder that one person, armed  with conviction and compassion, can change the world.", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688923/recognizing-diane-reitz-a-light-of-service-a-heart-of-strength-and-a-legacy-of-honor"}, {"senator": "French Hill", "party": "Republican", "sentence": "…situation might imply, I am influenced by no  diminution of zeal for your future interest, no deficiency of grateful  respect for your past kindness; but am supported by a full conviction  that the step is compatible with both.\n\n``The acceptance of, and continuance hitherto in, the office to which  your suffrages have twice called me, have been a uniform sacrifice…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700272/president-washingtons-farewell-address"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…our Nation's heart and soul. Deep down, we know that  protecting those who cannot defend themselves is the foundation for  every meaningful cause in today's society. That conviction is why so  many of my pro-life colleagues step forward to lead legislative efforts  to protect vulnerable preborn babies and their mothers.\n\nToday, I am reintroducing one…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699386/statements-on-introduced-bills-and-joint-resolutions"}]