[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…include in the Record the following  proclamation recognizing National Dynamic Random Access Memory (DRAM)  Day:\n\nWhereas, Dynamic Random Access Memory (DRAM) has been a       cornerstone of technological innovation since its invention.       On June 4, 1968, Dr. Robert Dennard was granted the patent       for DRAM, a breakthrough that revolutionized computing…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691950/recognizing-dynamic-random-access-memory-dram-day"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…pathogens and bioterrorism  agents, represent a constant and emerging danger to the public health  and security of our Nation. However, the BioWatch program, which has  been the cornerstone of our biodetection efforts, is now outdated.\n\nH.R. 706 takes a crucial step forward by requiring DHS to assess how  the Department of Energy's national laboratories can…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688729/dhs-biodetection-improvement-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…experienced significant growth, expanding its campus, enhancing  academic facilities, and welcoming national figures, including  President Dwight D. Eisenhower, who laid the cornerstone for the  Anthony Wayne Library of American Study in 1953 and returned in 1963 to  deliver a commencement address; and\n\nWhereas, Defiance College remains a distinguished…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688913/proclamation-for-defiance-colleges-demisemiseptcentennial"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Celebrating Rajdhani Mandir\n\nMr. SUBRAMANYAM. Mr. Speaker, from celebrating holidays to hosting  community events, the Rajdhani Mandir temple is a cornerstone of the  Hindu community in our region.\n\nThis year, we will mark an important milestone of the temple's 25- year anniversary, years of bringing people together at events,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691559/protect-the-afghans-who-served-us"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…the Small Business Administration and the  Department of Energy, all in the name of improving research and  development efforts.\n\nLet's not forget small businesses are a cornerstone of this country.  The innovation we stimulate within this sector is not just important,  it is vital for America's future. This legislation does not simply  propose research…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687907/doe-and-sba-research-act"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…on Ways and Means, Charlie Rangel, and what he said about AGOA. He is  often known as the father of AGOA. Charlie said: ``Since it was enacted  in 2000, AGOA has been the cornerstone of the U.S. trade policy with  Sub-Saharan Africa and has been a true success.''\n\nAGOA has further contributed to diversification and competitiveness  of Sub-Saharan Africa's…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…rights of workers whose rights under Title VII of  the Civil Rights Act have been violated.\n\nSimilarly, President Trump rescinded Executive Order 11246, which has  been the cornerstone of civil rights protections in federal contracting  since the 1960's. This Executive Order ensures that federal contractors  must take affirmative action to ensure that…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…the son of a public  schoolteacher, and having watched my own three children attend public  schools, I know firsthand the importance of public education.\n\nEducation is the cornerstone of academic achievement, career  development, and lifelong learning in our society. A strong public  education system is critical to not only our Nation's economy but  community…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688249/nomination-of-linda-mcmahon"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…distinguished by a century of hands-on service, civic leadership, and  lasting contributions to our community.\n\nFor one hundred years, The Garden Club of Alexandria has been a  cornerstone of our community, dedicated to inspiring a love of  gardening, advancing civic beautification and championing environmental  stewardship.\n\nIts members have transformed public…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697252/recognizing-the-garden-club-of-alexandrias-centennial"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…been hearing a lot of calls about the  resumption of nuclear testing. This is particularly worrying because  the move away from nuclear testing has been really one of the  cornerstone successes of nonproliferation and nuclear security.\n\nJust think of all the attention Donald Trump could get by giving the  order that he wants to blow up a nuclear weapon…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…Program Risk Oversight Act, bipartisan legislation that  strengthens one of SBA's most successful financing programs.\n\nFor decades, the SBA's 504 loan program has been a cornerstone of  economic development in communities across America. Through public and  private partnership with certified development companies, the 504  program helps small businesses…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699186/504-program-risk-oversight-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…longer  be excluded from the clinical studies that guide lifesaving treatments.\n\nCo-founded the Congressional Caucus for Women's Issues, a bipartisan  forum that remains a cornerstone of women's advocacy in Congress today.\n\nSecured a historic increase in federal breast cancer research  funding, exceeding $400 Million, and mandated insurance coverage for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695548/moment-of-silence-for-mary-rose-oakar"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…across the capital  region and beyond.\n\nSince 1995, Maggie has directed more than 125 productions, workshops,  and readings, helping to cement the repertory as a treasured  cornerstone of both the city of Albany and the wider theater community.  The warmth of her personality would always shine through as she  enthusiastically welcomed audiences at the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695332/recognizing-maggie-mancinelli-cahill"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Church of Merrifield on the occasion of the 155th anniversary of its  sanctuary. For more than a century and a half, First Baptist Church of  Merrifield has served as a cornerstone of faith, service, and community  for the Northern Virginia region. First Baptist Church of Merrifield  was started in a log cabin between 1871 to 1872. FBCM had then branched…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696034/recognizing-the-first-baptist-church-of-merrifield-on-their-155th-anniversary"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today to recognize the 50th  anniversary of American Legion Post 667 in Universal City, Texas.\n\nSince its chartering in 1975, Post 667 has stood as a cornerstone of  service, supporting veterans, active-duty service members, and families  across northeast Bexar County.\n\nFor five decades, the Post has served as a hub for camaraderie,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695761/recognizing-the-50th-anniversary-of-american-legion-post-667"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Carol has served Oasis  with warmth, compassion, and dedication to the families of Oasis. Carol  was an integral part of the start-up of Oasis in 2009 and continues to  be a cornerstone of the ministry at the Land O' Lakes center. Her  unwavering desire to be a light to each woman who walks through the  door of Oasis is a shining example of her obedience…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690132/recognizing-carol-berti"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…destruction. By eliminating the  expiration date, we ensure that these sanctions remain a steadfast  component of our national security strategy.\n\nThe Iran Sanctions Act has been a cornerstone in our efforts to deter  Iran's malign activities, and this legislation will show our clear  resolve on that issue. We must send this message: The United States  will not…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690689/solidify-iran-sanctions-act-of-2025"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…their children, Mina and Mike,  are the longtime owners of the Wagon Wheel Restaurant in Fort Lawn,  South Carolina.\n\nFor nearly five decades, the Wagon Wheel has been a cornerstone of  the community and a gathering place for generations of families all  across Chester County.\n\nGeorge and Joanna came to the United States from Greece in the 1970s  in…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696937/recognizing-the-katergaris-family"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…AUSTIN SCOTT of Georgia. Mr. Speaker, I appreciate the  opportunity to speak in support of H.R. 4550. This legislation  reauthorizes the United States Grain Standards Act, a cornerstone of  American agriculture and trade for nearly a century.\n\nMr. Speaker, I don't want to go any further without first thanking  Chairman Thompson for his work, Ranking Member…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…electricity demands, and lower costs for  families.\n\nBy reestablishing the National Coal Council, Congress will ensure  that reliable, affordable baseload power remains a cornerstone of our  energy policy while supporting family-sustaining jobs and fueling next- generation industries like artificial intelligence.\n\nThe rule also provides for consideration…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…six decades, helped beautify homes and enrich communities  throughout Bucks County and beyond.\n\nFounded in 1961 as Royer Nurseries, the family run business has  become a cornerstone of the local community, known for its commitment  to excellence, creativity, and service. Mr. Hebel joined the company in  1981 as a young landscape designer, quickly finding…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696583/recognizing-bucks-country-gardens-president-tom-hebels-retirement-after-years-of-service"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…their local chapters.\n\nThe Celebrate Community Week resolution highlights the critical work  of our community service organizations.\n\nMr. Speaker, volunteer service is the cornerstone of a successful,  strong, and healthy community, and it is an important staple of  American life.\n\nMr. Speaker, I commend our community service organizations for  everything…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695366/recognizing-celebrate-community-week"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…authorized  Indian housing programs, which provide Tribes greater autonomy when  using Federal resources for housing projects on Tribal lands.\n\nMr. Speaker, homeownership is a cornerstone of the American Dream.  Families should not have to wait decades before buying their first  house. Kids should grow up playing in the living room of their  childhood home,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699815/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…second career in  direct service to the people of Cooke County as the Emergency Manager  and Fire Marshal. In this role, which he held for an additional 22  years, he became a cornerstone of public safety and emergency  preparedness in North Texas. Mr. Fletcher led Cooke County through  seven federally declared disasters, investigated over 400 fires, and…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693149/recognizing-mr-ray-fletcher"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…ritchey's dairy\n\nMr. JOYCE of Pennsylvania. Madam Speaker, I rise today to honor a  family-owned and operated dairy business in Martinsburg, Pennsylvania,  that has been a cornerstone of the dairy industry in Blair County for  85 years.\n\nRitchey's Dairy was founded by Oliver Ritchey in 1940 just outside of  Martinsburg in Blair County. With the help of…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693458/golden-age-of-america-has-arrived"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  the 60th anniversary of the Armstrong County Community Action  Partnership.\n\nFor six decades, ACCAP has been a cornerstone of our community,  dedicated to empowering individuals and families, promoting self- sufficiency, and improving the quality of life for so many.\n\nSince its founding, ACCAP…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689395/recognition-of-accaps-60th-anniversary"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…remarkable  milestone in the history of Hoskins Drug Store & Soda Fountain, a  cherished community institution in Clinton, TN. For nearly a century,  Hoskins Drugstore has been a cornerstone of the community, providing  not only essential services but also a deep sense of connection and  tradition.\n\nOn April 4, 2025, Hoskins Drug Store will celebrate 95 years…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689423/recognizing-hoskins-drug-stores-95th-anniversary"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…honor to serve the people of Paducah and McCracken County in  Congress. One of their community's most impactful institutions, the  Oscar Cross Boys & Girls Club has been a cornerstone of support and  opportunity for local youth for over 60 years.\n\nThe club is located on land currently owned by the city of Paducah,  which has held the property since 2012.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697652/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Speaker, I rise in support of H.R. 1800, the Solidify Iran  Sanctions Act of 2025.\n\nThe Iran Sanctions Act was enacted back in 1996. For 29 years, this  law has acted as the cornerstone of U.S. efforts to address the Iran  regime's malign influence. From its support to terrorist proxies to its  dangerous nuclear program, the impact of the regime's provocative…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690688/solidify-iran-sanctions-act-of-2025"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…Bureau of Land Management's restrictive Miles City Field Office  Resource Management Plan.\n\nThis resolution is a critical step toward restoring American energy  dominance, a cornerstone of President Trump's agenda to secure our  Nation's economic and energy future.\n\nThe BLM's rule stifles resource development in Montana, limiting  access to our abundant…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694890/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}]