[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…It is bad enough that Trump and congressional Republicans have  ignored the affordability crisis and have instead done everything they  can to help out their rich and big corporate interest buddies, but  House Republicans are bringing up a bill today that will actually  increase your monthly energy bill and make the appliances in your home  more expensive…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700165/dont-mess-with-my-home-appliances-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…form of an energy rebate  to help them pay their rising utility bills. That is, Congress could  mandate that any company that draws up Venezuelan dirty crude oil for  their corporate coffers should instead be required to share in the cost  of the operation and rebate any profit to the hardworking American  taxpayers. The military operations amount to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…from more than 13 million Americans.\n\nI mean, they are jeopardizing our health and taking away our  healthcare. I urge my colleagues to strongly oppose this bill. It is a  corporate giveaway that hurts our constituents once again.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691595/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…campaign-- they can still share staff. I mean, there is no real division between  them.\n\nSo that was a completely phony distinction created by the Court to  create a system of corporate and billionaire power in America. As my  colleague pointed out in the context of climate, we saw a radical  change immediately.\n\nWell, the growth in dark money has been stunning.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…training.\n\nEven respiratory and chemical safety standards in hazardous  workplaces are being rolled back.\n\nThese changes represent a fundamental shift in priorities, putting  corporate convenience over worker safety. Eliminating all of these  rules is a clear signal from the Trump administration that they view  workers' lives as expendable.\n\nWhen protections…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695573/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…necessary information to make smart and informed decisions.\n\nLet me be clear: I very much understand the benefit of multiclass  share structures and think they have a place in corporate governance.  Major companies from outside of the United States have chosen to list  in New York City precisely because we have more flexible multiclass  structures. Yet,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693912/enhancing-multi-class-share-disclosures-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "Mr. WYDEN. Madam President, the Senate will vote very soon on a  resolution I put forward to overturn a new Trump administration policy  regarding corporate taxes and partnerships. When you start using a  whole bunch of Washington lingo about the corporate alternative minimum  tax and income allocated across partnerships, people…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699925/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…disaster strikes.\n\nRather than protect workers from these deadly hazards, Republicans  want to repeal this commonsense rule, rolling the dice with human life  in the name of corporate profits. They wrap it all up in a phony pitch  about prices like they are standing up for the little guy while they  look the other way when their oil oligarch pals collude…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…thank Senator Kelly for bringing us down  to the floor today.\n\nIt is hard to believe it has been 16 years since our politics were  upended, since the floodgates were opened to corporate money in an  unlimited way, in an anonymous way, coming into our elections.\n\nSenator Durbin, of course, has been a hero, as he mentioned spending  much of his career trying…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699117/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…tariffs have  made it worse.\n\nOf course, it is not just the tariffs. Tax cuts to the rich people  and corporations have exploded the deficit. Regulatory rollbacks have  boosted corporate profits but created long-term risks. And attacks on  the Federal Reserve's independence have undermined the Nation's economy  and driven prices even higher.\n\nTrump promised…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…adversaries, this bill protects the U.S. supply chain, reduces security  vulnerabilities and ensures that the Jones Act serves our people, our  economy, and our military, not just corporate bottom lines.\n\nMr. Speaker, we cannot afford to continue defending a system that  fails to defend us. The Merchant Marine Allies Partnership Act is a  bipartisan, commonsense…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694572/introduction-of-the-merchant-marine-allies-partnership-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. Speaker, I rise in strong opposition to H.R. 3616, yet another  Republican bill that puts large corporate polluters over people. At a  time when American families are struggling with rising monthly energy  bills, this legislation does nothing to address the affordability  crisis.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…to  act immediately to curb some of its damage.\n\nWe are talking about bills like the Freedom to Vote Act, the DISCLOSE  Act, the Protecting Our Democracy Act, and the Ban Corporate PACs Act.  These bills will help reduce and mitigate the influence of big money,  strengthen transparency around it, and limit corporate power. This is a  moment to draw…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…We know that facial recognition technology discriminates against  our Black and Brown neighbors. This is not just about discriminatory  technology, Mr. Speaker. It is about corporate greed, and the CEOs are  getting rich while working people struggle.\n\nIt is essential that we work together in this body to protect our  communities and ban these practices.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693028/surveillance-pricing-in-grocery-stores"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Trump administration approved it anyway, and I know the gentleman  from Kentucky (Mr. Barr) did what Trump wanted him to do.\n\nWe already have enough megabanks with too much corporate power. In  the mid-1990s, the 20 largest banks held 15 percent of all bank assets.  Today, they hold more than 65 percent of all bank assets. The four  largest megabanks…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…1990 All-Rookie Team. He also played with the New York Jets, Carolina  Panthers, and Green Bay Packers from 1994 to 1998. After retiring from  football in 1999, Pat flew corporate jets for United Airlines and Delta  Air Lines before becoming a Captain at  American Trans Air, now ATA Airlines. Moreover, he founded Terrell  Materials, a very successful…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694136/recognizing-congressional-patriot-award-recipient-pat-terrell"}, {"senator": "Troy Nehls", "party": "Republican", "sentence": "…the endowment itself.  Harvard has $53 billion. We are not taxing that. We are just going to  tax the net earnings on their investments at 21 percent, which is equal  to the corporate tax rate.\n\nWhat did the Senate do? They reduced it to 8 percent, just under 8  percent.\n\nIt is about time that we get these universities to pay the same that  corporate America…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693219/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…last lifeboat that people have right now for access to care.\n\nWe want to allow providers to own hospitals rather than be restricted  from being able to do that so that the corporate, monolithic hospitals  are not the only option.\n\nWe want 1,000 flowers to bloom and for people to have the freedom  option.\n\nGuess what, Mr. Speaker?\n\nYou can leave ObamaCare,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…actually take in.\n\nRemember, Mr. Speaker, our rules about the size of the economy, 17.1  or mid-17 percent of the GDP.\n\nIndividual income tax, investment tax, raising the corporate taxes,  and raising the State taxes, when you got to the end, Mr. Speaker, you  functionally were getting about 1.5 percent of new tax receipts for the  economy.\n\nI look…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "…of our children? Our children are not safe online.\n\nAnd I also want to say that this bill is based on another important  principle, a simple one, which is that no amount of corporate profit  justifies the exploitation of our children. All the Big Tech companies  are rich beyond belief. They are the wealthiest companies, the richest,  biggest companies,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697735/9999"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…detailing my House  Oversight Committee's good work to date on our Epstein investigation.  After all, Hakeem Jeffries, the Democrats in Congress, and their allies  in the corporate media have been demanding a full release of the  Epstein documents for months, including all the documents from the  Epstein estate.\n\nWithout hesitation, I subpoenaed all…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697128/irrefutable-evidence"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…first transferred to Shipping,  then to the Transportation Department Dispatch Office approximately  eleven years later. Fast-forward four more years, in 2002, she moved to  Corporate Fleet Safety, where she began to learn about Safety in the  trucking industry.\n\nIn 2004, Karen chose to work part-time to fulfill her lifelong dream  of being a long-haul…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689097/recognizing-ms-karen-partin"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…Outstanding Professional of the Year; Pueblo City- County Library District, for the Lorraine K. Salas Outstanding  Community Partner of the Year; Vectra Bank Colorado, Outstanding  Corporate Member of the Year; Rebecca Gomez, Gil Padilla Outstanding  Ambassador of the Year; El Pomar Foundation, Outstanding Non-Profit  Member of the Year; and Freddie Martinez…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700094/congratulating-the-latino-chamber-of-commerce-of-pueblo-dinner-dance-awardees"}, {"senator": "French Hill", "party": "Republican", "sentence": "…exempt from       registration under section 5 of the Securities Act of 1933 as       compared to issuers and offerings of securities subject to       such section 5;\n\n(iii) corporate governance;\n\n(iv) financial statements and the components of such       statements;\n\n(v) aspects of unregistered securities, securities issued       by private companies,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693888/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…who has this whole thing  where they do analytics on debt and spending. Mr. Speaker, their  estimate is in 9 years, 30 percent of U.S. tax collections, that is  everything, corporate, individual, estate, the tariffs, everything,  they estimate in 9 years, 30 percent of all those tax receipts that  come into the Federal Government will just pay interest.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…it.\n\nIf the first year where the Social Security trust fund is completely  empty--our rough math is it is over a $600 billion a year shortfall. I  think that is the entire corporate income tax.\n\nThere is this lack of understanding of the scale. We are in trouble.  What is wrong with this place?\n\nIs it so much easier to go home and just lie?\n\nOn cable…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…involved in  communities across Illinois and with his alma maters. He serves on both  the Illinois Family Violence Coordinating Council and on the National  Advisory Board of the Corporate Alliance to End Partner Violence.\n\nAt his undergraduate alma mater, Illinois State University, Judge  Knecht was an adjunct professor for nearly three decades and is a  recipient…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694181/congratulating-the-honorable-james-knecht-illinois-fourth-district-appellate-court-justice"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the entire  economy. Our borrowing would equal 7.3 percent of the economy.\n\nEvery tax hike that we have scored that the Democrats have proposed,  capital gains, income tax, corporate taxes, the whole litany, when you  do the economic adjustment, it comes in at 1.5 percent, maybe 1.6, but  the math is easier, 1.5 percent of the economy. That is what we…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Speaker, you see this 26 percent that is in blue, that is defense  and nondefense discretionary.\n\nThis year we are on track for every dollar we bring in in tax  receipts--that is corporate taxes, that is individual taxes, that is  everything--we are going to spend $1 in, $1.39 out the door.\n\nDoes anyone see a math problem?\n\nMr. Speaker, 1 month ago, Moody's…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…DePaul University. Still, in 1997,  she felt a call to serve and address inequities in the world that she  had become aware of. So, she dropped everything and moved from the  corporate world in Chicago to Georgia, where she became a full-time  volunteer with Habitat for Humanity International.\n\nReturning to Nebraska in 1999, she joined Habitat for Humanity…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689058/recognizing-amanda-brewer-for-womens-history-month"}]