[{"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. TAKANO. Mr. Speaker, we gather on the floor of the House of  Representatives to pay tribute to two United States marines who died in  service to our Nation. Lance Corporal Albert A. Aguilera of Riverside  and Lance Corporal Marcelino M. Gamino of Fresno were both killed in a  tragic vehicle accident while on deployment as part of Joint Task…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690810/moment-of-silence-in-memory-of-lance-corporal-albert-a-aguilera-and-lance-corporal-marcelino-m-gamino"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Among this year's Lifetime Achievement Awards was Warrenton Police  Chief Tim Carter. A native of Fauquier County, Chief Carter has served  his hometown as a police officer, corporal, detective sergeant,  lieutenant, and deputy chief before becoming police chief in 2023.\n\nAlso recognized with a Lifetime Achievement Award was retired fire  chief Dale Koglin.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690556/recognizing-valor-award-winners-and-honorees-from-fauquier-county"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Mr. VINDMAN. Mr. Speaker, I rise today to honor United States Marine  Corporal Joseph Donald for his incredible service to our country and to  recognize his recent approval to receive the Purple Heart.\n\nThe Purple Heart is one of the oldest and most…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691113/recognizing-the-incredible-service-of-united-states-marine-corporal-joseph-donald"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…tireless efforts to lead from the front, have contributed to  the safety and security of all Americans. Today, his legacy lives on  through the Black family, with their daughter, Corporal Are'wynn Black,  following in her parents' footsteps in the Marine Corps.\n\nOn behalf of a grateful Nation, I offer my deepest thanks and best  wishes to Sergeant Major Troy…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694958/recognizing-the-retirement-of-sergeant-major-troy-e-black"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…Jr., U.S. Air Force.\n\nSergeant Paul David Hoch, U.S. Army.\n\nChief Petty Officer Michael Thompson, Jr., U.S. Navy.\n\nPetty Officer Second Class James Johnson, U.S. Navy.\n\nLance Corporal Frank Walker, Jr., U.S. Marine Corps.\n\nCommand Master Chief Petty Officer Robert Jordan, U.S. Navy.\n\nGunnery Sergeant Nick Mendoza, Jr., U.S. Marine Corps.\n\nMr. Speaker, I…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696747/recognizing-veterans-in-texas-third-congressional-district"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…quickly distinguished himself  through exceptional dedication and leadership. Throughout his tenure,  he earned multiple promotions, rising through the ranks of Officer,  Corporal, Sergeant, and ultimately Lieutenant. In each role, Lieutenant  Moffett brought integrity and professionalism.\n\nNotably, Lieutenant Moffett played a major role in implementing…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694744/recognizing-buckingham-township-police-department-lieutenant-william-moffetts-35-years-of-service"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…August 1985. In 1986,  he attended the Pennsylvania State Police Academy in Hershey and  graduated as a member of the 49th Municipal Police Training Class. He  was promoted to Corporal in January 1987 and served for 10 years before  being promoted to Sergeant. In 2017, he was promoted to Lieutenant,  where he served for three years before being named Chief…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698017/recognizing-chief-steven-kingsborough"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…among the 268 members of  the legendary regiment who fell at the Battle of the Little Bighorn.\n\nIn recent years, the townspeople have worked together to dedicate the  Lance Corporal Scott B. Paul Memorial Park in honor of the young marine  who fell  in 1992 during the Gulf War. A section of the beautiful park, the Sgt.  Richard Parker Memorial Wing, pays…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699397/225th-anniversary-of-the-town-of-strong"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the school's oldest living alumnus.\n\nHe is a World War II veteran. John was drafted at 18 and served in  England, Belgium, Germany, France, and the Netherlands as an Army  corporal in the field artillery attachment of the 5th Army Division,  the 9th Army spearhead, the 5th Armored Division, and the 29th Division  in Operation Kaput.\n\nJohn married his…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688942/keaton-beasley-teaches-importance-of-financial-literacy"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…the show last night was the oldest marine,  Cpl Nils Mockler--99 years old; born in 1926; Iwo Jima combat marine,  D1; looking as strong as he did when he was an 18-year-old corporal  storming the beaches of Iwo Jima. Last night, he was there. The place  went nuts when he was recognized--a 5-minute standing ovation for this  great American hero. What a…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696624/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "Mr. PERRY. Mr. Speaker, I'm honored to recognize Corporal (Cpl)  George Ivanoff, United States Marine Corps (USMC), on the auspicious  occasion of his 100th Birthday on July 24, 2025.\n\nCpl Ivanoff, born in Harrisburg in 1925, left…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693427/recognizing-corporal-george-ivanoff-usmc"}, {"senator": "John Carter", "party": "Republican", "sentence": "…U.S. Air Force in various roles including  Law Enforcement, Security Operation, and Emergency Management. During  his four years in the Marine Corps, he served as an Infantry Corporal  in Subic Bay, Philippines.\n\nUpon transitioning to the Air Force, MSgt Bygum served under the  Secretary of the Air Force Director, Security, Counterintelligence and  Special…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689326/saluting-the-service-of-master-sergeant-duane-c-bygum-jr"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, I am pleased to congratulate and recognize  Young Marine Corporal Chase Muchmore on being named the Pennsylvania  Regiment Junior Young Marine of the Year.\n\nChase Muchmore is a current student at Manor Middle School and is a  Corporal with…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699827/recognizing-young-marine-corporal-chase-muchmore-on-being-named-the-pennsylvania-regiment-junior-young-marine-of-the-year"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…sheriff in 2009 and served in  this role for four consecutive terms. Over his 50-year career, Mark has  held a variety of positions, including patrolman, criminal  investigator, corporal, chief of police, and deputy coroner.\n\nMark's leadership has been pivotal, and he was responsible for many  rescue operations when the county experienced major floods.\n\nBeyond…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698576/recognizing-mark-lusk"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the Lincoln Police Department in June  2006. Over his last 19 years with the department, Officer Schneider has  held various roles, including EMT, field training officer, corporal,  active-shooter response instructor, UAV coordinator, accident  reconstructionist, department instructor, and he is currently assigned  as a motorcycle officer with the traffic…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}]