[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…to the  underlying bill.\n\nThe bill itself cuts over $750 million from the FY25 spending levels,  revokes $5 billion from the Bipartisan Infrastructure Law, zeroes out  Army Corps programs that clean up radioactive waste and blocks clean  energy initiatives. My four amendments support essential funding for  our National Labs and our continued goal to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694942/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…South Patterson Avenue post office in  recognition of General Lopez's distinguished legacy of service and his  dedication to our country, serving in the United States Marine Corps  for over 30 years, both in Active Duty and the Reserves.\n\nGeneral Lopez was born in Santa Barbara as the oldest of six siblings  and spent his childhood between the communities…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697745/brigadier-general-frederick-r-lopez-post-office-building"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. PALLONE. Mr. Speaker, it is my honor to recognize Joseph Seebode  on his retirement from the United States Army Corps of Engineers. Mr.  Seebode has dedicated 44 years of Federal service to USACE and his many  achievements and contributions as an Environmental Engineer should be  celebrated.…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696524/recognizing-joseph-seebode"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…the Reverend Dr. McKinney was devoted to serving his community  throughout his life. McKinney bravely served during World War II in a  segregated unit of the U.S. Army Air Corps. He graduated from Morehouse  College in Atlanta after returning home from war, and then he went on  to earn a divinity degree from Colgate in 1952. He settled down in  Seattle,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698261/recognizing-reverend-dr-sammuel-mckinney"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…colleague, Congressman Mark DeSaulnier--and also a graduate of  Weston Jesuit School of Theology, and the Naval War College.\n\nFather Shaughnessy served as a member of the Chaplain Corps of the  U.S. Navy and served four tours of duty to Iraq, helping sailors and  marines cope with life-and-death issues, while also providing spiritual  moral guidance. He was…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692491/welcoming-reverend-paul-shaughnessy"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "Mr. BELL. Mr. Speaker, if anyone stood outside the St. Louis Job  Corps Center last week, they saw what happens when cruelty becomes  policy. They saw students being escorted off campus, bags in hand,  dreams on hold; grandparents crying because…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692061/st-louis-job-corps-center"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…congratulate Second  Lieutenant Jack C. O'Neill on his graduation from The Basic School. I  include in the Record the following proclamation:\n\nWhereas, the United States Marine Corps upholds a proud       tradition of honor, courage, and commitment, and remains one       of the most respected fighting forces in the world; and\n\nWhereas, The Basic School…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694090/congratulating-second-lieutenant-jack-c-oneill-on-his-graduation-from-the-basic-school"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…dramatically.\n\nWhy? On January 20, the President froze Federal leasing for wind  projects and blocked permits for projects that had already been  approved.\n\nOn February 5, the Army Corps of Engineers halted permits for 168  renewable energy projects on private lands.\n\nIn March, as part of his tariff war, he imposed a 10 percent tax on  energy imported from…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697027/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…alienating our  allies.\n\nNo. 46, cut Alzheimer's research, delaying breakthroughs that could  find a cure for this tragic and deadly disease.\n\nNo. 47, terminated the American Climate Corps.\n\nNo. 48, cut hundreds of employees from the FAA.\n\nNo. 49, fired more than 200 probationary FEMA workers.\n\nAnd No. 50, fired more--this is unbelievable--than 2,400 National…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…bipartisan efforts here in this U.S.  Congress. I am talking about the World Food Programme, about UNICEF,  about the Integrated Food Security Phase Classification, about Mercy  Corps, about Doctors Without Borders. All of these organizations have  documented the devastating starvation. So this is not a question of  whether there is starvation or there isn't.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…only threatens to  erase the stories and experiences of these brave women who just wanted  to serve our great Nation.\n\nI strongly believe that we should have a Navy and Marine Corps that  look like our country, where our midshipmen receive an education that  teaches the accurate and full history of this Nation, where the stories  of women and people of…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689167/womens-history-month"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…Court in  the Students for Fair Admissions.\n\nMr. Speaker, the generals that have written the amicus brief said:  ``Growing and maintaining a highly qualified, diverse officer corps  remains a U.S. national security imperative.''\n\nWe had discussed this at one point. Further on, they go on to say:  ``The U.S. military's commitment to diverse and inclusive…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…include ambassadors, Foreign Service Officers, military  and intelligence officials, political appointees from both major  parties, Members of Congress and their staffs, Peace Corps and  International Monetary Fund officials, global business leaders, and  other professionals dedicated to promoting American interests and  diplomatic relations.\n\nThrough…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692065/recognizing-the-dacor-bacon-house-bicentennial-day"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…punched repeatedly in the  head by ICE agents this past Sunday.\n\nIs this something my Republican colleagues are proud of? That we  repay veterans of the United States Marine Corps by assaulting,  detaining, and deporting their father who was simply trying to provide  for his family?\n\nLast week, I joined several of my colleagues to tour the Adelanto ICE…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692930/holding-power-accountable"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…Tess has dedicated her entire career to improving public health.  After earning her Master's in Nursing and Public/Community Health in  1990, she worked in Nepal as a Peace Corps nurse for five years. There,  Tess taught women to be birth attendants and designed sustainable  maternal and child health programs. While Tess loved working one-on-one  with…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695528/recognizing-tess-kuenning"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…passion for civic engagement, an issue that demands the attention  of our next generation of leaders. Her passion to serve began at a  young age as a daughter of a U.S. Marine Corps colonel.\n\nPeyton's dedication only grew in time as she witnessed government in  action as a U.S. Senate page. Now, she is taking her passion  nationwide, encouraging our young…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689386/recognizing-peyton-bolling-miss-americas-teen"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Mr. WESTERMAN. Mr. Speaker, I rise today to recognize an exceptional  young leader from my district, Jayden Coffey, a student at Cass Job  Corps in Franklin County, Arkansas, and the latest recipient of the  Westerman Award--a quarterly honor given to students who demonstrate  outstanding character, leadership, and…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692255/recognizing-ms-jayden-coffey"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…support of this bill, which would rename a  post office in Guthrie, Oklahoma, for Oscar J. Upham. Oscar John  Jefferson Upham was a private serving in the United States Marine Corps  during the Boxer Rebellion and Spanish-American War, ultimately earning  the Medal of Honor for his service in Peking, China, in the summer of  1900.\n\nIn addition to serving…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697638/oscar-j-upham-post-office"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…every sports  team in town, contributed to Watersprings Ranch, and served as the go- to man behind the scenes whenever help was needed. He even advocated  directly with the Army Corps of Engineers to advocate improvements to  local flood control and levee systems.\n\nSteve counts among his greatest blessings, his wonderful parents,  devoted family, his incredible…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696827/recognizing-congressional-patriot-award-recipient-steve-ledwell"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…276. Report on impacts of joint travel regulations on members of                Coast Guard who rely on ferry systems. Sec. 277. Report on Junior Reserve Officers' Training Corps program. Sec. 278. Report and briefings on implementing section 564 of title 14. Sec. 279. Report on role of Coast Guard. Sec. 280. Report on Coast Guard personnel skills.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…receiving the  2025 Veteran Commendation Award are as follows:\n\nSergeant Christopher Acevedo, U.S. Army.\n\nCaptain Travis Mills, U.S. Army.\n\nMajor Gary Billings, U.S. Marine Corps.\n\nSecond Lieutenant Charles Neubecker, U.S. Army.\n\nMaster Sergeant Fernando Cruz, Jr., U.S. Marine Corps.\n\nSenior Chief Petty Officer Vincent Riggs, U.S. Navy.\n\nSenior Airman…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696747/recognizing-veterans-in-texas-third-congressional-district"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Speaker, I rise to recognize the  Nittany Leathernecks' contribution to Christmas throughout the  Commonwealth of Pennsylvania.\n\nThe Nittany Leathernecks Detachment of the Marine Corps League is a  community service organization composed of active, retired, and former  Marines. Since 1947, the mission of the U.S. Marine Corps Reserve Toys  for Tots program…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698118/recognizing-nittany-leathernecks"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…work our way not only through the big reconciliation bill but through  the appropriations bills, as well.\n\nFirst of all, I think it is important that the public and the press  corps pay attention to what becomes of the low-income housing tax  credits in this bill.\n\nCurrently, the low-income tax credits were brought to my attention  when I attended part…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692064/monitoring-big-beautiful-bill-provisions"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…Caroline  Kehrli, Brooke Alred, and Andrew Smith.\n\nIn my office, I thank my lead Military Legislative Assistant, Andrew  Maloney; in the Department of War, United States Marine Corps Captain  Alex Feldman.\n\nMr. Speaker, with that, I urge my colleagues to support this year's  NDAA.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697794/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…thirteen years as an employee within the United States House  of Representatives.\n\nAfter graduating from the University of South Carolina, Mac enlisted  in the United States Marine Corps as an infantry officer in 1987. Mac  remained on active duty for eight years and continued his reserve duty  through 2012. During his distinguished military career Mac was…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…bill, the Jurisdictional  Determination Backlog Reduction Act, is included as a part of this  package. Across the country, Americans depend on timely answers from  the Army Corps so they know whether their projects require Clean Water  Act permits, but the Corps is not keeping up. Right now, thousands of  determinations and wetland delineations are…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698019/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Ally that is an       important force for ensuring peace and stability in Europe.\n\n(vi) Sensitivity of Technology: The IFATDS is a multi-      service (U.S. Army and Marine Corps) automated, expert       decision support system used for command, control,       communications, and integration and synchronization of fires       on ground targets during…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690233/arms-sales-notification"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…again  graduated valedictorian from dental school. He went on to serve with  the 1st Marine Division at Camp Lejeune, providing essential care as a  naval officer in the Dental Corps. His distinguished career spanned sea  service, Active Duty, Reserve Duty, and retiring as a lieutenant  commander.\n\nMr. Speaker, Dr. Mitchell has built a legacy of excellence…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698093/9999"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Covered Individual Defined.--In this section, the term       ``covered individual'' means an individual who served on       active duty in the Army, Navy, Air Force, or Marine Corps as       an aircrew member of a fixed-wing aircraft, including as a       pilot, navigator, weapons systems operator, aircraft system       operator, or any other crew member…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693894/aces-act-of-2025"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…of their first grandchild  in October.\n\nThroughout his career, General Rasch served in various capacities,  including key roles within the acquisition and systems automation  corps. He led as the project manager for the Army's Integrated Battle  Command System and later as the military deputy to the commanding  general of the Army Aviation and Missile…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695727/congratulating-lieutenant-general-robert-a-rasch-jr"}]