[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…those incentives has been overwhelmingly successful, VA  did make some initial missteps in oversight and utilization of the  awards for senior executives. These missteps were corrected during the  last administration. Despite what my colleague says about  investigations, the administration was quite forthcoming and  transparent about those missteps. The…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693968/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…===========================\n\nOn September 15, 2025, page E845, in the second column, the  following appeared: Mr. TLAIB. Mr. Speaker, today, the 12th\n\nThe online version has been corrected to read: Ms. TLAIB. Mr.  Speaker, today, the 12th    ========================= END NOTE =========================    Congressional District proudly recognizes the 100th Anniversary…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695383/recognizing-the-100th-anniversary-of-the-warrendale-community"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Congressional Districts at issue are       nothing more than       vestiges of an unconstitutional racially based gerrymandering       past, which must be abandoned, and must now be corrected by       Texas.\n\nPlease respond to this letter by July 7, 2025, and advise       me of the State's intention to bring its current       redistricting plans into compliance…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…decisions based on secret threats and  promises about massive political spending.\n\nWe have to get rid of this. The decision was ill-founded, factually  wrong, and needs to be corrected.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699104/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…without any explanation to the American  people about what this operation will cost or what success will look  like. This is a profound constitutional failure, and it must be  corrected.\n\nI hope I am wrong about these dangers ahead. I hope this  administration is right, and the transition in Venezuela proceeds  smoothly. I hope that the Venezuelan people…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…government efficiency, and why did they steal  them and put them in an unsecure cloud that anyone could hack from the  outside?\n\nThis is an abomination, and it needs to be corrected. It can very  easily be corrected by the legislation that we have introduced calling  to make sure that DOGE comes before Congress.\n\nMr. Speaker, Republicans need to stand…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695514/accountability-for-doge"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…reinforces  D.C.'s request to be represented among the stained glass panels in the  Main Reading Room, which is open to the public.\n\nCongress already includes D.C., or has corrected D.C.'s omission,  when honoring the states. For example, each state is entitled to two  statues in the Capitol, and D.C. has two statues in the Capitol. The  National Defense…", "date": "2025-11-25", "source_url": "https://justfacts.votesmart.org/public-statement/1697163/introduction-of-a-bill-to-require-the-library-of-congress-to-install-the-district-of-columbia-seal"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…page H1260, March 25, 2025, in the third column, the  following appeared: minutes as the designee of the minority  leader.)  Mr. Speaker, I am\n\nThe online version has been corrected to read: minutes as the  designee of the minority leader.) GENERAL LEAVE   The  SPEAKER pro tempore. Is there objection to the request of the  gentleman from Pennsylvania?…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…phony front groups to spread climate  disinformation, stuff that just isn't true.\n\nBy the way, they don't care that it is not true. That is the point.  So they  don't stand corrected when somebody says ``Oh, that is not true''; they  just dial up the volume and say it twice as much. It is not intended to  be true. This is not a quest for truth; this is…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…LATTIMER asked and was given permission  to address the House for 1 minute and to revise and extend his  remarks.) Mr. LATTIMER. Mr. Speaker, as a\n\nThe online version has been corrected to read: (Mr. LATIMER  asked and was given permission to address the House for 1 minute  and to revise and extend his remarks.) Mr. LATIMER. Mr. Speaker,  as a    =========================…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695435/cdcs-dangerous-turn-on-vaccines"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…never defunded the police, and we never  tried to defund the police.\n\nOn the other hand, my good friend, I believe, participated in--and if  he didn't, I am happy to stand corrected, but I know a bunch of his  colleagues said they wanted to defund the FBI, just like those who want  to defund the ATF and shut it down right now, so that is a reality.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…transaction. For 90 minutes before an employee caught the mistake, one  lucky customer had $81 trillion credited to their account.  Unfortunately, for that customer, the bank corrected their error and  far too often these kinds of mismanagement mistakes actually lead to  harm for consumers.\n\nIn fact, since 2000, Citigroup has paid over--listen to this--$27…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…afford health insurance to complete the multiple back  surgeries she needs.\n\nFor many Georgians, healthcare is a matter of life and death. Our  Republican colleagues could have corrected this in the Rules Committee,  but they rejected an amendment last night that would have lowered  healthcare premium costs. To me, that is unconscionable. So are the  administration's…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696744/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…18-      month period, the District paid $5.6 million in back pay to       just ten officers who were fired and then returned to duty       through arbitration. The CPJRAA corrected this. These bills       would take us backward.\n\nThe CPJRAA also protects residents from dangerous and       deadly encounters.\n\nIt restricts deadly force; bans neck restraints;…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696988/opposition-letter-led-by-the-dc-justice-lab-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…farms  because the agricultural sector is in crisis and people are saying we  need the workers.\n\nWell, I wanted to echo what President Trump said briefly there before  he was corrected by Mr. Miller. I was just in upstate New York in the  Adirondacks in the 21st Congressional District represented by Ms.  Stefanik. I met a bunch of dairy farmers there, who…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…1956, Congress acknowledged the Lumbee Tribe but cruelly denied  them the services and the benefits afforded to other federally  recognized Tribes. That mistake has never been corrected, but finally  Congress has the opportunity to right its wrong.\n\nThe Lumbees are more than 55,000 strong, making them the largest  Tribe east of the Mississippi. They have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695243/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…involved a loan agent. Unfortunately, the inspector general also  noted that there has been over $335 million in documented loan agent  fraud. This, of course, needs to be corrected and changed, Mr. Speaker.\n\nAdditionally, my legislation requires the SBA to submit their  findings to Congress, which allows us to conduct proper oversight of  the 7(a) loan…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691855/9999"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…===========================\n\nOn September 18, 2025, on Page H4423, in the first column, the  following appeared: Mr. BEAN. Mr. Speaker, some of our\n\nThe online version has been corrected to read: Mr. BEAN of  Florida. Mr. Speaker, some of our    ========================= END NOTE =========================     Nation's heroes never made it home. Others returned…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695779/national-prisoner-of-warmissing-in-action-recognition-day"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…companies into major source status  forever, even if they had dramatically reduced their emissions. That is  just plain wrong.\n\nThankfully, in 2020, the Trump administration corrected this  nonsense. They rightly said that the Clean Air Act doesn't prohibit  facilities from reclassifying if and when they reduce emissions below  the legal threshold.\n\nDo…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691596/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…and eroded respect for  the judiciary by turning judges into policymakers. Worst of all, it  cost millions of innocent lives.\n\nIn overturning Roe, the Supreme Court rightly corrected a grave legal  error and returned authority to the States where it belongs. That  restoration of constitutional order was long overdue.\n\nI also bid hello and welcome to my…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699374/roe-v-wade-anniversary"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…2025, on Page H5013, in the third column, the  following appeared: faced daily. Tragically, in 2021, Sam lost his  silent struggle. His story is a\n\nThe online version has been corrected to read: faced daily.  Tragically, in 2020, Sam lost his silent struggle. His story is a    ========================= END NOTE =========================     powerful reminder…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697382/the-fight-against-suicide"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Bolts Ditch Headgate prevented new development in the area, which would  have required the expansion of Bolts Lake to provide a water supply for  surrounding homes.\n\nCongress corrected this error in 2019 by allowing the town of Minturn  to access Bolts Ditch for maintenance and repairs. H.R. 1729 builds on  this legislation by allowing additional local…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693454/bolts-ditch-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "Mr. ROSE. Mr. Speaker, President Trump signed a funding bill into law  yesterday that did more than just end a partial government shutdown. It  corrected a serious wrong.\n\nBuried deep inside the funding bill that the Senate passed and sent  to us last November was a hidden provision that never should have seen  the light of…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699753/repeal-of-senate-payday-provision"}]