[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…reliable energy is key to affordability. The future lies with low-cost  wind and solar, not more expensive oil, gas, and coal. We have to  increase energy supply or costs will continue to rise for the American  people--and we will be dependent on importing energy to meet our goals.\n\nInstead of focusing on ways to help lower energy costs, House  Republicans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694862/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…in 2025, but without the extended premium tax  credit, likely to face $1,551 cost per month in 2026.\n\nSo these costs are adding up on American families. Together, these  costs continue to hold individual households and their budgets in an  undesirable position. We are already hearing stories about people  squeezing in medical procedures before the end…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696494/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…are not just about  raising the prices on the goods that we import; they are also driving  up prices across the board on all types of goods and services-- electricity costs. If we continue down this path, as I noted, the  average family will likely see a $2,000 increase per year.\n\nThis might not mean a lot to some of the President's friends and  family…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…half would not be able to afford  essentials such as food, housing, and clothing without Social Security  benefits. Now due to tariffs and inflation caused by Trump, those costs  continue to go up, up, and up for everybody including seniors. It is  hardest on them.\n\nEvery county in Ohio has at least 20 percent of its population  receiving some form of Social…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699878/protecting-social-security"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…costs when no one can tell them if there is going to be a new 30- or  even 50-percent tax on their materials come Friday?\n\nHow can a family already struggling with high costs continue to pay  the rent and put food on the table if their household expenses are  going up $2,400 this year? And now, on Friday, the administration is  planning to make the goods…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694454/9999"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…health  and substance use services, and it is on the chopping block if my  Republican colleagues' budget bill is signed into law.\n\nWe have to protect Medicaid at all costs. I will continue standing up  against any cuts to these lifesaving benefits.\n\nMr. Chair, I thank everyone who has been part of this fight. This  bill will save lives.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691877/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…prices. We are seeing the cost of living grow out of control as  families experience freezes in critical funding that supports their  households. We are seeing housing costs continue to skyrocket as well.\n\nAgain, we were promised the exact opposite, which is that this  President knew and understood what it was for the average American  family to struggle…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…This bill in Michigan will kick 750,000 people  off their Medicaid. It will eliminate critical investments in Michigan  manufacturing. It means, for Michiganders, that costs will continue to  go up and up.\n\nAs someone who served as the chief of staff on the U.S. auto rescue  in the Obama administration, I know what it means to see Michiganders  struggling.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693221/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…Order because here we are, now  151 days since the beginning of this 119th Congress, and American  families have seen zero relief. Nothing has been done to help them as  costs continue to rise, despite promises from the administration and  the GOP congressional majority to lower prices on day one. Instead,  this Republican majority is poised to make things…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691770/151-days-without-a-vote-to-lower-costs"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…tonight to talk  about a few issues. Literally, I thought I was going to come and talk  about healthcare and the need for us to come together to help reduce  healthcare costs and to continue to fight to make sure Americans are  covered because covering them helps reduce all our costs when you have  the reduction of uncompensated care. But I also wanted…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697849/national-weather-service"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…in June 2024, and their  peers in the affordable housing industry recognized the community  development team with Housing Colorado's Eagle Award.\n\nAt a time when housing costs continue to rise, The Ives keeps housing  prices down in Wheat Ridge without compromising on quality. We are  grateful for the community development team at Foothills Regional…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694724/recognizing-the-ives"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…can start  building the housing that New Hampshire desperately needs if their  lumber costs 25 percent more overnight? And how can a family already  struggling with high costs continue to pay the rent or put food on the  table if their household costs are going to go up $1,200 this year?\n\nI want families and businesses to know that the whims of this…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "John Thune", "party": "Republican", "sentence": "…extend this for 3 years at a cost of $83 billion to taxpayers--$83  billion to the taxpayers--what happens after 3 years? Another 3-year  extension or patch as ObamaCare costs continue to spiral?\n\nDuring the Democrats' shutdown, one Democrat Senator came to the  floor, and, to his credit, he admitted the truth, and this is what he  said. He said:\n\nWe…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…focus on policies that are going to fulfill the American Dream,  which homeownership is integral to.\n\nThe American Dream is getting more and more out of reach as housing  costs continue to climb. While demand soars, the country remains  stalled by a 5\\1/2\\ million unit shortfall.\n\nBetween the red tape of regulatory delays and the rigid constraints  of…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699811/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Speaker, I agree with points that are  being made on both sides. The fundamental point of our side is  undeniably true, which is that our healthcare system is broken and  costs continue to spiral out of control.\n\nHowever, it is also true that suddenly withdrawing premium support  from 22 million Americans is going to force those folks into a terrible…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698807/breaking-the-gridlock-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…which require substantial  capital investments.\n\nMergers often present the only viable path for these institutions to  keep up with these regulatory and technological costs and continue  serving their local communities.\n\nThey also play a vital role in ensuring the safety and soundness of  the financial system. By enabling stronger, well-managed institutions…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…credits were created and again when they were  extended, but rather than fix that problem, the credits only  exacerbated the underlying issues that are driving up the costs. We  cannot continue to rely on the same broken policies to fix those  systemic problems.\n\nIn December, Senator Cassidy and I proposed to begin the process of  true healthcare reform.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699099/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]