[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Donald Trump is like the Grinch--just  with a lot more bronzer.\n\nNow, today, Senate Democrats will hold a special caucus lunch to roll  out a new initiative to lower costs for the American people and show  precisely how Donald Trump and Republicans have made life far more  expensive for Americans.\n\nThis morning, a report came out that Americans will pay…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…protected democracy.\n\nAnd as one of the first official acts of President Trump, as he came  back into power in January of 2025, President Trump chose not to lower  costs for the American people or to end Putin's war in Ukraine in 1  day, as he promised, and instead on his first day in office, Donald  Trump chose to betray the brave law enforcement officers…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698517/anniversary-of-january-6"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…care about their healthcare. Why should the American people  believe these lies as they are, even as we speak, getting notices of  huge increases in their healthcare costs? The American people don't  believe the Republican lies. They see right through them.\n\nMeanwhile, Republicans, unwilling to do what the American people  want, now claim that, well, extending…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696175/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…longer.\n\nHow many of you want to see us bogged down in Venezuela for a whole  bunch of years? If you don't want to see that, if you want to see us  focused on the costs the American people are facing and reduce them,  vote with us.\n\nVote yes on this very important resolution.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698818/venezuela"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…money when water heaters  are less efficient and use more gas.\n\nMadam Speaker, I urge my colleagues to reject this resolution and  live up to the promise of lowering costs for the American people by  lowering their energy bills.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688290/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…increases Americans'  utility bills by even more, by hundreds of dollars, in fact.\n\nSo, once again, we are back here, and we are doing things that  actually raise costs on the American people. So with tariff policies  that promote monopolies or policies that simply raise costs directly on  the American people, this Congress, this leadership continues…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697138/affordability"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…he cares  about rising costs.\n\nIn the last week, he has talked about housing, credit cards, the  price of beef, trade, and done nothing on any of them, and costs keep  rising. The American people don't want a bunch of words that have  nothing of substance behind them. They don't want pandering. They don't  want posturing. They want Donald Trump to take…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…growers.\n\nInstead, the Rules Committee blocked my amendment, and not a single  amendment was made in order. We need to do better than this and deliver  on lowering costs for the American people.\n\nI call on my colleagues on the other side of the aisle to reconsider  this reckless plan that would benefit billionaires at the expense of  everyday Americans.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688133/republican-budget-betrayal"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…to come together in a bipartisan way and listen to the American  people. Let's extend the Affordable Care Act tax credits, reverse the  Medicaid cuts, and lower costs for the American people.\n\nMr. Speaker, stop wasting time with ballrooms and bailouts, and  instead deliver for the American people.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697432/recognizing-sarah-dully-rhode-island-teacher-of-the-year"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…should be  standing up for their constituents rather than falling in line behind  President Trump.\n\nI am going to keep fighting for affordable healthcare and lower  costs. The American people deserve better.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696726/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…of the story  when it comes to lowering the cost of living. In the coming weeks and  months, Democrats will lay out cleanly and comprehensively how we can  lower costs for the American people on a number of different topics-- from health to housing, to groceries, to childcare, to energy costs,  and beyond.\n\nIn the coming weeks, for example, I will work…", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698474/cost-of-living"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…connect a couple other dots for you, just to really bring  home this point. President Trump promised all along the campaign trail  that he was going to bring down costs for the American people. These  are costs at the grocery store, costs everywhere really.\n\nWe could talk about tariffs, but what I really want to focus on,  which is a big issue in my district…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…democracy.\n\nThe Federal Government is currently shut down because Republicans who  control the House, the Senate, and the White House are hell-bent on  raising healthcare costs for the American people. In fact, 22 million  Americans are about to see their health insurance costs potentially  double, triple, or more. And the only way for us to get out of this…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696335/trump-administration"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…facing higher prices is because of  his policies.\n\nWhile Republicans ignore higher costs at their own peril, Democrats  are still going to keep fighting to lower costs for the American  people. We know that there is an opportunity that is going to come  before the Senate in just a few days to do something about the high  cost of health insurance premiums.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…the madness of this trend line. It is a through line  in the administration's tactics here. It is a through line of cruelty  and stupidity that has magnified the costs for the American people not  just in blue States but all across the country.\n\nWe should seek reform and improvement in the ACA, eliminating any  kind of fraud and stopping the spiraling…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696612/9999"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…affordability challenges in housing,  Mr. Speaker, is because we have an inventory shortage. Republicans are  offering solutions to provide more housing stock to lower the costs for  the American people and deliver on that American Dream of  homeownership.\n\nThis bill cuts through the regulatory choke hold that Washington has  imposed on housing. It streamlines…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "John Thune", "party": "Republican", "sentence": "…mean costs--costs that are almost always passed  on to the consumer.\n\nRepublicans are continuing our efforts to get government out of the  way and to bring down costs for the American people.", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697344/biden-administration"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…critical supply chain risk  associated with foreign dependence and this would be a disaster.\n\nWe need to focus right now on prioritizing American businesses,  reducing costs for American people, and we need to be focused on  opening factories in America, not closing them, especially for such  critical products as these that allow for large-scale food distribution…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690525/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…economy with burdensome regulations, stifling growth and  restricting Americans' freedoms. In total, these regulations have  imposed a staggering $1.7 trillion in costs on the American people.  Fortunately, House Republicans and President Trump are committed to  rolling back these unnecessary and costly mandates.\n\nThe latest example of overreach came…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688545/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…guarantee only citizens vote and that they show up with a voter  identification.\n\nMr. Speaker, I am proud that this administration is relieving the  devastating costs on the American people by creating economic growth  and undoing a lot of the damage of the previous administration. We are  seeing that on a daily basis.\n\nMr. Speaker, the gentleman is…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}]