[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…when people came together to  solve problems and to help people who were hurting through no fault of  their own. These were people who were working day in and day out and  couldn't afford to put food on the table. They couldn't afford  healthcare when they got sick. They couldn't afford a roof over their  heads.\n\nThe worst of government is when we sit…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…and conflicts of interests--and now a $400 million plane-- they seem designed to benefit the President more than anything.''\n\nThis from the New York Post editorial board. I couldn't have said it  better myself.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691089/new-york-post-editorial-on-qatari-jet"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Little in common nothing to tether      Finding comfort in each other      My roommate soon became my brother.      Each day our bonds were tested      Crossing party lines that couldn't be bested      Making memories on the Senate floor      Forming bonds that last evermore.      Becoming a Senate page was never a safe bet      Looking at these strangers,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…testing in the breach  of the Comprehensive Nuclear-Test-Ban Treaty. Back then, I led the  charge in the FY 2021 NDAA process to ensure that that didn't happen  and that we couldn't resume that testing in the United States.\n\nPardon my bad French, but ``the more things change, the more they  stay the same''; ``plus ca change, plus c'est la meme chose.''…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699032/expiration-of-new-start"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…saying: My baby was born with a heart  condition costing millions of dollars before the Affordable Care  Act. Husbands saying: My wife was diagnosed with breast cancer, and we  couldn't afford it. Families saying: Dad had a stroke, and we couldn't  handle the cost.\n\nThat will not happen anymore because we are protecting these families  in this bill.\n\nMr.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698809/breaking-the-gridlock-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…January 15.\n\nMr. Speaker, 1 year ago today was Martin Luther King Day. It was also  Inauguration Day. As I sat in the rotunda watching the President take  the oath of office, I couldn't help but ponder the final question that  Dr. King pondered in the last year of his life: Where do we go from  here? Chaos or community.\n\nDr. King asked this question after…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…News story  here when the gentleman referred to the $9.4 billion as a teardrop in  the ocean when he was interviewed. I don't know what happened, but  somehow the gentleman couldn't bring himself to talk about the $3  trillion that Republicans are adding to the debt.\n\nMr. Speaker, I am going to urge that we defeat the previous question.  If we do, I…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…to spinal injuries.  With less people working at the Social Security office, it has taken  longer than it should to review my case.\n\n``I am barely surviving as it is, and I couldn't see any of my  doctors without Medicaid. My grandchildren couldn't be able to see  doctors. My single daughter and myself both rely on SNAP to eat and  Medicaid to see our…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691522/medicaid"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…talk about the sanitary conditions, but they are not good. I have been  into wards with people who are mentally ill, and I have seen the sad  situation in which they live. I couldn't even imagine someone from my  family having to exist in those conditions.\n\nI have walked across the country in different places and met Russians  who are trying to make a…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…history of diabetes, heart disease, or  even a past pregnancy, insurance companies used to be able to exclude  those services from your plan or charge you an amount that you couldn't  afford.\n\nThanks to the Affordable Care Act, insurance companies are no longer  allowed to discriminate against patients with preexisting conditions.  We required in that…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…and respond to mass shootings at their schools.\n\nAt Evergreen, teachers acted so quickly that when the shooter tried  door after door, looking for students and teachers, he couldn't reach a  single classroom. Law enforcement arrived on the scene in under 2  minutes and located the shooter in fewer than 5. Every single one of us  should be grateful to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695673/cloture-motion"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…is--finally, we were to see the details of the Republican  healthcare agenda for America.\n\nBut congressional Republicans jumped all over the White House and  told the President he couldn't do it. They threw cold water on the idea  of the President cooperating with the Democrats to solve this problem.  The President has been tough to pin down on this subject,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697295/affordable-care-act"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…who doesn't believe  that 100,000 overdoses is an appalling outcome. There is not a Democrat  here who doesn't experience the crushing, disgusting horror of those  losses. We couldn't agree with the majority more that this is a huge  problem.\n\nWhat this is about is whether the Representatives of the people  should be involved in a discussion about how…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698242/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…these issues, we issued a legal decision       concluding that a Clean Air Act preemption waiver was not a       rule subject to CRA but was instead an adjudicatory order.\n\nIt couldn't be more clear than that.\n\nFurthermore, we explained that even if the waiver were to       satisfy the APA definition of a rule, it would be considered       a rule of particular…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…this  new technology in tasers. They just have to get a background check to  make sure they aren't domestic abusers and to make sure they are not  prohibited individuals who couldn't otherwise get firearms.\n\nThis bill does a lot more than the proponents are suggesting that it  does. If, in fact, they want to deal with the issues that they stood on  this…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…screaming in the faces of crying children  that their parents were Nazis who were going to burn in Hell. They  blocked the stairs to the childcare area so that the parents couldn't  reach their kids, and as parishioners tried to flee the chaos, they  followed them into the parking lot, surrounded their cars, and  attempted to trap families inside.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…on the open market by 114 percent.\n\nWhen I asked Leader Jeffries to sign on to the 1-year extension of  the premium tax credit, he refused. He stuttered. He stammered. He  couldn't answer a single question because this shutdown was never about  healthcare. It was always about appeasing a far-left radical base.\n\nChuck Schumer said: Every day gets better…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696694/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…both sides of  the aisle, should want our government to operate as effectively and  efficiently as possible.''\n\nHe adds: ``Outrage over Elon Musk's email surprised me.\n\n``I couldn't believe the outrage on social media and broadcast news  because DOGE asked government employees to write down five things they  did at work the previous week.''\n\nHe adds,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688492/demanding-transparency-efficiency-and-accountability-from-our-government-is-not-extreme"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…being shared on this rule by my colleagues on the  other side.\n\nI am a mom of three. When my kids were growing up, they woke up every  Saturday morning to a job list, and they couldn't get their allowance  until they completed the jobs on the list. They were motivated to get  their jobs done by that allowance, and I would have had very little  luck incentivizing…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691597/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…dramatically increased in 2017.\n\nDespite these hard facts, our Democratic colleagues continue to  peddle the myth that President Trump's tax cuts are just for rich  folks. It couldn't be more clear that these claims are nothing more  than just that--myths.\n\nSo I urge my fellow Republican colleagues to never mind the naysayers  across the aisle. The American…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…informed.  Let the people who have actually done the work write the bills. In this  case, in these three and the three preceding bills, that is exactly  what happened, and I couldn't be more pleased with that result.\n\nI would be remiss not to build on a remark my friend, Ms. McCollum,  made in her speech. I am very proud of  this bill on Native-American…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698749/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…themselves well against Russia. They are  not even spending 2 percent of their GDP on defense in the current  state. That is a minimum for admission into NATO.\n\nMy colleagues couldn't blame them for thinking that it doesn't really  matter because even the biggest countries, like Germany, haven't  historically hit that threshold either, but their economy…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690700/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…the State  government in Minnesota gave them the OK, went out and started  recruiting autistic children. They say: Well, OK. We have to get the  word out somehow.\n\nBut they couldn't find very many autistic children, so they started  going to parents in the Somali community and saying: Can we call your  child autistic? Can we certify that your child is…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Joel Trotter, one of the authors of the JOBS Act,  ``Decades of successful experience show that the well-known seasoned  issuer category is long overdue for expansion.''\n\nI couldn't agree more, and this bill does exactly that. It lowers the  size threshold for WKSI qualification while maintaining all the  existing good governance requirements.\n\nIn other…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697266/expanding-wksi-eligibility-act"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…hearing,  I asked a member of Biden's Department of Energy to tell me one  producer they had worked with. I asked them to name one producer they  had worked with, and they couldn't come up with that producer. They  couldn't come up with even one until pressed. Then they said whatever  producer they thought. I went back and double-checked that. They…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688184/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…don't fix that, we will have failed.\n\nLet me ask the gentleman a couple of questions.\n\nPrior to the existence of Medicaid, there was no Federal subsidy at  all. This scheme couldn't have possibly existed in this way.\n\nMr. ROY. So Medicaid was created, and Medicaid was created to  ostensibly provide an avenue to healthcare for the poor and vulnerable,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690587/economic-anxiety"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…eager to offshore got big bonuses at the American workers'  expense. The businesses that wanted to stay here found themselves  struggling to stay alive in conditions where they couldn't compete.\n\nNow, some might argue that Americans don't want to make shoes  anymore, but we did a generation ago. The American workers of that age  knew that there was something…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…scare people and talk about Jim Crow, then  you might want to ask those same people why the Democratic Party at  their convention just in 2024 required photo ID to get in. You couldn't  get into the Democratic convention without showing a photo ID. If they  want to call it Jim Crow, they need to look in the mirror, Mr. Speaker.\n\nIf you want to ensure the…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700016/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…Nazi collaborators and  PLO terrorists. This simply adds Hamas and the Palestinian Islamic  Jihad to that list.\n\nMadam Speaker, for reasons I find inexplicable, the Senate couldn't  be bothered to take up this bill in the last session. They will  hopefully find the time in this session.\n\nUnder current law, being a member of Hamas or associated with…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…now stands overrides the regulatory frameworks of  several States, cancels the collective decisions of hemp consumers, and  destroys the livelihoods of hemp farmers. And it couldn't come at a  worse time for America farmers. Times are tough for our farmers.  Farmers' costs have increased as the price of fertilizer and machinery  have jumped, while prices…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696661/continuing-appropriations-and-extensions-act-2026"}]