[{"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…of her  community, Quaker Valley, and beyond.\n\nMrs. Cole was passionate about the history of her family and the  community in her hometowns.\n\nFor 20 years, she conducted countless hours of historic research,  including interviewing more than 100 community members. In 2000, that  work came to fruition with the publication of her book titled, ``Their  Story:…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697614/mary-elizabeth-bettie-cole-post-office-building"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…championship game. The team claimed the school's  first-ever championship in a nail-biting 14-6 win.\n\nUnder the leadership of their head coach, Frank Gallardo, the team  devoted countless hours to training this season. Their hard work and  competitive spirit carried them forward when the game was tied at six.\n\nIn the final minutes, Eagles quarterback Michael…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697339/congratulations-to-the-lady-eagles-volleyball-team"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…city council member, serving as board chair of  the Five Star Education Foundation, and as citizen chair for a school  district's bond campaign. Representative Bird spent countless hours  volunteering in students' classrooms, which led to her co-founding the  Adams 12 Community Action Network, dedicated to empowering students by  providing equal learning…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698814/recognizing-colorado-state-representative-shannon-bird"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…people can achieve. It is not easy to earn the prestigious rank of  Eagle Scout--one must persevere through years of hard work, demonstrate  strong leadership, and dedicate countless hours of service to others.\n\nThe Scout Motto is ``Be Prepared'' and becoming an Eagle Scout is one  of the best ways for a young person to prepare for a life of service  and…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697395/recognizing-the-eleven-newest-eagle-scouts-from-troop-407"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…teamwork and  community. I would like to express my gratitude to John for bringing  these valuable opportunities to children in his community.\n\nUnseen hours of sacrifice and countless hours behind the scenes are  what distinguishes service from other kinds of work. John's story is a  shining example of everyday people rolling up their sleeves and  answering…", "date": "2025-11-25", "source_url": "https://justfacts.votesmart.org/public-statement/1697165/recognizing-john-piersol-as-ohios-13th-congressional-districts-champion-of-the-week"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…the community has the medical supplies and  equipment it needs at all times.\n\nHis impact on the community extends well beyond the firehouse walls.  Mr. Fountain committed countless hours to mentoring newly minted  firefighters and leading the firefighters' union as president.\n\nThrough his example, Mike Fountain has shown us what leadership is  all about.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694967/congratulating-mike-fountain-on-his-retirement"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…deliver real, meaningful  public safety investments for the people whom I serve.\n\nMr. Speaker, I also thank Rosa DeLauro, our ranking member, and  Chairman Cole for the countless hours truly working in a bipartisan way  and being an example to me of how people should work together for the  interests of our Nation. I thank them both very much for their…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698753/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…sportsmanship.\n\nLet's follow the example of our Little League parents and volunteers  by making a pledge to support youth in our community and to support the  people who spend countless hours teaching America's favorite pastime.\n\nLet's play ball, Mr. Speaker.", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700082/east-fullerton-little-league-70th-anniversary"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…I rise today to recognize the outstanding  contributions that Ms. Ruth Gavish has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691963/recognizing-ruth-gavish"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…Congressional Award has empowered over  500,000 participants nationwide and is the highest honor Congress  bestows on American youth.\n\nBy reauthorizing this program, we honor the countless hours of hard  work and dedication of so many past and present participants.\n\nMr. Speaker, I urge my colleagues to support this bill, and I reserve  the balance of my time.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698222/congressional-award-program-reauthorization-act"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…and Speaker; and became my chief of staff  when I was elected last year.\n\nJames has not only dedicated his career to advising some of our top  lawmakers but also devoted countless hours to mentoring the next  generation of congressional staffers and public servants.\n\nMr. Speaker, I thank James for his constant support and loyalty.  James helped develop…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688677/recognizing-james-min"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…operating costs by $4  million over the next 4 years.\n\nEliminating the print requirement will also eliminate inefficient use  of CRS staff time. Requiring CRS staff to spend countless hours  formatting and paginating the print version of CONAN does not support  the work of Congress, nor does it benefit our constituents.\n\nMr. Speaker, replacing the CONAN print…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689324/repeal-requirement-for-congressional-research-service-to-prepare-annotated-constitution-and-supplements-in-hardbound-version"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…have been revitalized,  contributing to the town's unique character and charm. Beyond her work  in historic preservation, Andrea is a dedicated volunteer who has given  countless hours to various community projects. She has been  instrumental in organizing events that celebrate our local heritage,  including historical walking tours, educational workshops,…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690145/recognizing-andrea-read"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…rise today to recognize the outstanding  contributions that Mr. Glen Youngblood has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690716/recognizing-glen-youngblood"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…I rise today to recognize the outstanding  contributions that Ms. Kay Hoffland has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691124/recognizing-kay-hoffland"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…rise today to recognize the outstanding  contributions that Ms. Kristina Arnold has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691077/recognizing-kristina-arnold"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "Mr. ELLZEY. Mr. Speaker, I thank my honorable friend from Arizona  whose crusade against the debt is a  true public service. He has spent countless hours in here educating the  American people on the dangers of the debt for our country, and we  should all be grateful. I thank him for this time.\n\nI also thank the folks here…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…I rise today to recognize the outstanding  contributions that Ms. Jami Frazier has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690794/recognizing-jami-frazier"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…I rise today to recognize the outstanding  contributions that Mr. Mike Lastra has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691772/recognizing-mike-lastra"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…I rise today to recognize the outstanding  contributions that Mr. Travis Smith has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692197/recognizing-travis-smith"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…young men toward the rank of  Eagle Scout, instilling in them values of discipline, responsibility,  and service. His impact extends beyond Scouting, as he has dedicated  countless hours to coaching youth athletics, shaping the lives of young  athletes in Little League Baseball, high school football, and the Cass  City Youth Football initiative. His belief…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689609/recognizing-james-e-baker-ii-as-cass-citys-2025-citizen-of-the-year"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…rise today to recognize the outstanding  contributions that Mr. Ronnie Hutton has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691912/recognizing-ronnie-hutton"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…dedication, passion, and unwavering commitment to a cause that truly  changes lives.\n\nFor the past year, as Penn Staters have done for more than 50 years,  these students devoted countless hours to supporting pediatric cancer  patients through THON, the largest student-run philanthropic  organization in the entire world.\n\nTHON is a yearlong fundraising effort…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688351/recognizing-thon"}]