[{"senator": "Sarah McBride", "party": "Democrat", "sentence": "…the  Wilmington VA Medical Center, a facility that provided 338,000  appointments last year alone. That is visits to a primary care doctor,  a dentist, and drug and alcohol counseling. Every single one of those  visits is fulfilling a sacred promise that the government has made to  show up for those who have sacrificed for all of us.\n\nAs we head into Memorial…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691492/protecting-american-maritime-research"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…violence shelters, child advocacy programs, and services for  survivors like me of homicide, assault, and human trafficking in every  State and in every territory. It pays for counseling, emergency  shelters, legal aid, and lost wages.\n\nIn short, the Crime Victims Fund is the bedrock of our Nation's  promise to help victims rebuild their lives, serving nearly…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698840/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Tennessee. He began his  education at Freed-Hardeman University, where he received a bachelor's  degree in biblical studies. He also holds a Master of Ministry in  Pastoral Counseling from Rawlings School of Divinity and a Doctorate  from Andersonville Theological Seminary.\n\nWith over two decades of ministerial experience, Reverend Robinson  has held several…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695372/recognizing-reverend-dr-perrico-j-robinson-sr"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…resources prevent many of them from seeking help. This  bill will help us track mental health trends, evaluate the  effectiveness of peer support programs, and expand access to  counseling. Healthy officers are better officers. They are more  effective officers, both for their own well-being and for the  communities that they serve.\n\nWhen officers are safer,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…officers and keep hotlines to  victims of crime open, programs that assist law enforcement in rural  communities, provide guidance on finding safe housing, and offer care  and counseling for children facing abuse.\n\nMr. Speaker, local organizations have been sounding the alarm of what  these cuts would mean for our communities, and today I am joining them.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690993/support-safer-communities"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…protects investments for mayors and Governors by providing $3.3  billion for the popular Community Development Block Grants program.\n\nIt includes $58 million for housing counseling assistance for renters  and first-time home buyers and $8 billion to continue legal aid for  evictions assistance.\n\nFor transportation, the bill invests in the safety of…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699579/consolidated-appropriations-act-2026"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…loss of one  or more of their loved ones.\n\nIn times of tragedy, it can be difficult to sort through the torrent  of emotions--sadness, rage, loneliness, and regret. While counseling  cannot bring back the loved ones lost, it can help survivors process  the storm and maybe, just a little bit, blunt some of the pain.\n\nThe NTSB is also leading the accident…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688369/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…freeze; openings for new clinics that have been delayed because  the VA can't hire the necessary staff to open their doors; the VA  mental health staff forced to conduct counseling sessions in open  cubicles without privacy, basic privacy, for the veterans who are  talking about their innermost doubts and fears; service lines at VA  hospitals and clinics…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "…prevention programs, which helps reduce youth violence and strengthen  local families. In addition, El Centro is home to the Echo Park Family  Source Center, providing financial counseling, tax preparation,  tutoring and college prep classes and other critical services to  Angelenos.\n\nMs. Figueroa-Villa has also been active in public service, serving on  the…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696024/recognizing-the-achievements-of-sandra-figueroa-villa"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "Ms. BALINT. Mr. Chair, I rise today in strong opposition to this  amendment.\n\nIf passed, this amendment would immediately prohibit TRICARE coverage  of mental health counseling for transgender young people. Let me repeat  that. This amendment would take away mental health care services for  transgender kids of servicemembers. That is what we are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695248/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…than 12,000 patients a year and offers 30 specialized  addiction and recovery programs in support of its mission. These  programs also support job training and mental health counseling for  patients, helping to address the root causes of suffering and providing  patients with a path forward. Haymarket Center continues to push our  understanding surrounding…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694580/recognizing-50-years-of-haymarket-center"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…threat  to making good on that promise, specifically for children with  disabilities.\n\nIn February, parents in Georgia received this exact email, telling  them that year-round counseling and support services meant to assist  them and their disabled child in transitioning from high school to  adulthood have been discontinued--overnight, in the middle of the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689642/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…carves out an earmark for an industry with  a narrow ideological mission to provide, I guess what I call anti- abortion, but Mr. Chairman over there, he called it pro-life counseling  services.\n\nActually, this just does not fit within the four core purposes of the  TANF bill, which is why the Biden administration prohibited this. No  more that we provide…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…at HUD to  ease compliance for small properties and to recognize community land  trusts as eligible HOME fund recipients.\n\nThe package also expands foreclosure mitigation counseling to  delinquent borrowers and raises the public welfare investment, or PWI,  cap to 20 percent to free up capital for historic investments in  affordable housing and community…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699805/housing-for-the-21st-century-act"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "…Los Angeles.\n\nFounded in 1975, KYCC has grown into a leading multiservice  organization in Koreatown, serving more than 12,500 people each year.\n\nFrom youth development and counseling, to housing, health care, and  economic empowerment, KYCC has met the evolving needs of families  across Koreatown\n\nAnd we have seen KYCC give back year after year.\n\nDuring…", "date": "2025-12-30", "source_url": "https://justfacts.votesmart.org/public-statement/1698473/recognizing-the-50th-anniversary-of-the-koreatown-youth-and-community-center"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…specifically, this bill requires information to be emailed to  students at least once each academic year and appear in student  handbooks at orientation, at student health or counseling centers, and  on the institution's website. When students know their rights, they are  empowered to stay enrolled, stay engaged, and succeed.\n\nThis legislation doesn't burden…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699316/pregnant-students-rights-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…the outreach and promotion of  existing veteran-focused small business programs to make sure that  veterans can access all the available resources, the capital, and the  counseling that they need to succeed.\n\nMr. Speaker, this legislation also mandates the Interagency Task  Force on Veterans Small Business Development to devise an outreach and  promotion…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687888/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…entrepreneurship, secure employment with small businesses, and  overcome accessibility challenges. This will help ensure that  individuals with disabilities have access to business counseling  through existing SBA programs, like the Small Business Development  Centers.\n\nImportantly, H.R. 1634 is a commonsense, no-cost solution that  provides individuals with disabilities…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691777/thinkdifferently-about-disability-employment-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…These bills are about something very simple: Protecting the dignity  of the unborn and meeting very real needs of mothers and families.\n\nPregnancy resource centers offer counseling, medical services,  parenting resources, and support systems through some of the most  difficult moments that a mother can face. They should never be targeted  or defunded…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699218/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…$50,000.00 Hero's Award. Each year, during the  annual meeting, funds are donated throughout the Foundation's programs,  which include: Charity Care, Adult and Child Bereavement Counseling, a  camp for kids ages 6 to 17 that teaches them to manage grief and  reassures them they are not alone in their loss, Building a Children's  Bereavement Center, Circle of…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691906/recognizing-sue-simone"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…qualified individual.\n\n(8) Related services.--The term ``related services'' means       services related to an organ transplant that consist of--\n\n(A) evaluation;\n\n(B) counseling;\n\n(C) treatment, including postoperative treatment, and care;\n\n(D) provision of information; and\n\n(E) any other service recommended or required by a       physician.\n\n(9)…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692719/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…suspend the rules and pass the  bill (H.R. 3055) to direct the Secretary of Transportation to develop  an action plan on members of the Armed Forces eligible for  preseparation counseling and veterans becoming supply chain employees,  and for other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695018/transitioning-retiring-and-new-service-members-to-port-ocean-rail-and-truck-jobs-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…information on how to hire  graduates of career and technical education programs.\n\nIn addition, it ensures that students and graduates of these programs  know about the business counseling resources available through SBA  resource partners to help them start and grow their own small  businesses.\n\nSolving the skilled workforce shortage will take an all-hands-on-deck…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691731/connecting-small-businesses-with-career-and-technical-education-graduates-act-of-2025"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…there. This bill supports a full range of evidence- based treatment options, from emergency overdose reversal to long-term  recovery tools, like medication-assisted treatment, counseling, and  peer support.\n\nThe SUPPORT for Patients and Communities Reauthorization Act of 2025  has the backing of more than 160 different organizations dedicated to  substance…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691884/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…longitudinal study that was done by a Dr. Zucker years  and years ago in Canada. They took minors who were looking at  transitioning and actually gave them mental health counseling. By the  end of that, at the age of 18, they had the option to transition or  not. Ninety percent or more did not transition.\n\nWe have a mental health crisis in this country.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698346/protect-childrens-innocence-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Since then, it has grown from a one-room  operation in State College to three locations which are the  administrative offices and Sylvia Stein Shelter in State College, the  counseling and legal advocacy satellite office in Bellefonte, and the  Child Access Center in Bellefonte.\n\nWhile Centre Safe began as an agency by women, for women, it works to  support…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693919/recognizing-centre-safe"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…wellness is supported by onsite gym access, organized  challenges and workouts, and free wellness exams and cancer screenings.  Its mental health support includes confidential counseling, peer and  chaplain programs, and an annual screening with a licensed mental  health clinician. Additionally, between 2023 and 2024, information  gleaned from nutrition and…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697742/congratulating-the-independence-police-department"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…important to the success of our  American economy.\n\nThat is why, together with the CTE Caucus co-chair, Congresswoman  Bonamici, I introduced two bills that increase career counseling for  students and adult learners.\n\nThe Counseling for Career Choice Act would expand K-12 career  counseling services and provide more resources focused on financial  literacy,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695635/career-and-technical-education-caucus"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…By the way, they are also using AI. That is exactly  what this bill addresses.\n\nThe AI for Main Street Act directs Small Business Development  Centers, SBDCs, to provide counseling, training, and outreach to help  small businesses safely evaluate and adopt artificial intelligence  tools.\n\nThese centers already serve as trusted boots-on-the-ground advisers…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699180/ai-for-main-street-act"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…civilian life.\n\nThis legislation does so by providing much-needed oversight over the  VA's Veteran Readiness and Employment program, which offers specific  job training and counseling to veterans with a service-connected  disability. This bill requires the VA to track employment outcomes and  wait times for participants in order for us to know if this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695443/veterans-readiness-and-employment-program-integrity-act"}]