[{"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, I rise to recognize a milestone in the life  of Derrick Thompson, city council president of the city of Mount Vernon  on his 50th birthday celebrated this week. He will be doing the  celebrating on Saturday night of his journey so far. He is a graduate…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699911/recognizing-derrick-thompson"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…removal protocols.\n\nThe ROD states that it was prepared in accordance with the       requirements of the National Environmental Policy Act of       1969, as amended (NEPA), the Council on Environmental       Quality's NEPA implementing regulations in effect when the       NEPA process commenced, and Interior's NEPA regulations. As       part of the NEPA…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693338/us-government-accountability-office-legal-opinion"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Harold Pope, the first  Black State senator to serve in the history of the State of New Mexico;  Councilor Nichole Rogers, the first Black woman to serve on  Albuquerque's City Council; and Representative Pamelya Herndon, who is  the first Black State house representative to represent New Mexico  State House District 28, which is my State house representative…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687897/black-history-month"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "Ms. OMAR. Mr. Speaker, I rise today in recognition of the Minnesota  Assistance Council for Veterans (MACV) for their grand opening of the  newly renovated Robin property. Formerly the Robin Hotel, MACV has  transformed the century-old property into 14 units…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694978/recognizing-the-minnesota-assistance-council-for-veterans"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…Berzon, LLP;       Alyssa Rodriguez Center for Gender Justice; American Civil       Liberties Union; American Constitution Society; American       Gateways; American Immigration Council; American Immigration       Lawyers Association; American Oversight; Americans United for       Separation of Church and State; Amica Center for Immigrant;       Rights; Amsale…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689713/no-rogue-rulings-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…federal officials the (the Architect of the Capitol  (AOC) and the Director of the National Park Service (NPS)) and three  members appointed by the D.C. mayor, subject to D.C. Council approval.  Federal officials are members of the Commission even though the  Commission has no authority over federal property.\n\nLand use is a quintessential local matter.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692763/introduction-of-the-district-of-columbia-zoning-commission-home-rule-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. Speaker, I rise in opposition to this bill, which is a complete  and utter waste of the House of Representatives' time.\n\nIt asks the National Petroleum Council to do a study, and that is it.  That is the entire bill. In my opinion, to ask the National Petroleum  Council to do something it can already do on its own makes absolutely…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…downfall and ultimate slaying at the hands of opposition       fighters.\n\nLibya's initial post-Qaddafi steps appeared hopeful as the       temporary National Transitional Council handed the reigns to       the elected General National Congress in 2012, marking the       nation's first-ever peaceful transfer of power. But new       elections held in…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…rights. He fought for the right to earn a fair  paycheck and have dignity and safety on the job.\n\nHe started out as the business manager of the Rhode Island Laborers'  District Council and rose to become the general president of LiUNA and  vice president of the AFL-CIO.\n\nArthur worked tirelessly to make life better for the working men and  women of our country.…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693984/recognizing-arthur-coia-of-rhode-island"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…individuals, and  businesses in Fairfax County, the City of Fairfax, and the City of  Falls Church that support the arts in our community.\n\nFounded in 1964, the formally named Arts Council of Fairfax County is  a non-profit organization designated as Fairfax County's local arts  agency. Today, ArtsFairfax operates programs and initiatives that  include grant…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697103/recognizing-the-recipients-of-the-2025-artsfairfax-arts-awards"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…teacher--she was a  teacher all her life in many ways--before serving on the Walnut Creek  School District governing board for almost a decade.\n\nGwen later served on the city council for 21 years and also served  regionally on the Association of Bay Area Governments. She had five  terms as the mayor of the city of Walnut Creek, during which time she  championed…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697386/recognizing-gwen-regalia"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…it needlessly pits two things that are not in conflict, that is,  brokerage windows and the plan's designated investments.\n\nMy colleagues know, in 2021, the ERISA Advisory Council examined  brokerage windows. They noted that fewer than one-third of the  retirement plans even offer a brokerage window, and roughly 2 percent  of plan participants with…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today I introduce the District of Columbia  Courts Home Rule Act. This bill would give the Council of the District  of Columbia authority over the jurisdiction and organization of the  local D.C. courts. The D.C. Home Rule Act (HRA) prohibits the Council  from enacting…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693858/introduction-of-the-district-of-columbia-courts-home-rule-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Riverkeeper; Lutefisk Technologies,       Inc.\n\nMN Center for Environmental Advocacy; mtn bio; National       Parks Conservation Association; Natural Resources Defense       Council; Nebraska Division IWLA; New Mexico Wild; New York       State Division IWLA; Next 100 Coalition; Nimiipuu Protecting       the Environment; Ocean Defense Initiative; Ohio…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…huge group that includes the National Alliance on Mental  Illness, the March of Dimes, the Muscular Dystrophy Association, the  National Cancer Coalition, the National Health Council, the National  Kidney Foundation, the National Multiple Sclerosis Society, the  National Organization for Rare Disorders. It is about--and I will  estimate and give it to…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…businesses, including a national natural products  distribution company and one of the top-performing UPS franchise in  North Texas. He was also elected to the Celina City Council in 2015,  where his leadership as Mayor Pro Tempore and councilmember has played  a critical role in the city's rapid economic growth and development.\n\nIn addition to his…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690707/recognizing-congressional-patriot-award-recipient-andy-hopkins"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…1925, the Hanford Civic Auditorium has  served as the cornerstone of community life--a vibrant hub for artistic  performances, civic engagement, and social events. From city council  meetings and public forums to receptions, family reunions, and  community celebrations, it has hosted countless gatherings that reflect  the heart and spirit of Hanford.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698408/recognizing-the-hanford-civic-auditorium"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…disbanding of the Islamic Revolutionary Guard Corps, the IRGC; the  terrorist Quds Force; plainclothes groups; the unpopular Basij; the  Ministry of Intelligence; the Supreme Council of the Cultural  Revolution; and all suppressive patrols and institutions in cities,  villages, schools, universities, offices, and factories.\n\nMr. Speaker, we heard the gentlewoman…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…Principal  served.\n\nBeyond the workplace, Dan remains a strong supporter of education,  civic engagement, and local leadership. He serves on the boards of the  Iowa Business Council, the Greater Des Moines Partnership, the Iowa  State University College of Business, the Partnership for a Healthier  America, and the Community Foundation of Greater Des…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695028/recognizing-the-service-and-leadership-of-dan-houston"}, {"senator": "John Carter", "party": "Republican", "sentence": "…accolades, including  the Legion of Merit and the Humanitarian Service Medal.\n\nAfter retiring, LTC MacMillan continued her commitment to service,  joining the Fort Cavazos Retiree Council and working with  The Caring Place, speaking to schools about selfless service and  visiting veterans at homes and local events. LTC MacMillan works  tirelessly for youth…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689338/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…raise the prospect of an organized, radical left  that has been fomenting the targeting of people that I care about,  people like Charlie Kirk, groups like the Family Research Council,  targeting families and communities and our way of life, Chip, why would  you do that? Aren't you just sowing more division in calling for a  select committee to investigate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Fields  for more than 50 years of service to the borough of McConnellsburg in  Fulton County, Pennsylvania.\n\nJack recently retired as secretary and treasurer of the borough  council, acting as borough manager and head of maintenance and  permitting.\n\nJust 2 years after graduating from McConnellsburg High School, Jack  was drafted in 1953 and served our…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699211/streamlining-review-process-for-federal-projects"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Families Tax  Cut Act to deliver tax relief to millions of Americans that included no  tax on tips, no tax on overtime, and support for small businesses, so  what does the D.C. Council do?\n\nThey voted to deny their own residents these benefits. This means a  waitress working in a Washington, D.C., restaurant gets taxed on her  tips on her D.C. tax return…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699677/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…not stop when he returned from World War II. Sam has been  incredibly active in Franklin County, serving as a judge of elections,  Franklin County commissioner, Chambersburg Council president, and mayor  of Chambersburg.\n\nSam Worley's commitment has never slowed down. Sam is still a vibrant  member of our community, bringing so much love and joy to everyone…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692145/doge-rescissions-package"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…median of 3 years from final  agency approval to a final court decision, with some projects facing  delays that last for decades.\n\nAt various points in time, the White House Council on Environmental  Quality, or CEQ, has compiled reports on lawsuits, paperwork, and  delays associated with NEPA, but these efforts have mostly been ad hoc.\n\nThis bill would…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697709/studying-nepas-impact-on-projects-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…student who demonstrates  exceptional leadership, embodies their organization's values, and  positively impacts student life on campus.\n\nAs president of the Interfraternity Council during the 2024-2025  academic year, he played an essential role in advancing Greek life and  fostering collaboration among Greek organizations. Robert is an  outstanding…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692245/congratulating-greg-parker-retailer-executive-of-the-year"}, {"senator": "French Hill", "party": "Republican", "sentence": "…offices within       the Commission, other taskforces that may be established       within the Commission, self-regulatory organizations, and the       Elder Justice Coordinating Council; and\n\n``(D) consult, as appropriate, with State securities and       law enforcement authorities, State insurance regulators, and       other Federal agencies.\n\n``(7) Report.--The…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693935/national-senior-investor-initiative-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…transmission and attendant resources to develop the economic,       financial, social and cultural well-being of the Navajo       People and the Navajo Nation.'' See Navajo Nation Council       Resolution CAP-20-13 (2013), NTEC is, thus, a Navajo Nation       limited liability company with one shareholder, the Navajo       Nation. NTEC owns and operates three…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…President and  CEO, he serves as a Michigan Federal Delegate for the Independent  Community Bankers of America and is a long-time member of FIS's  Strategic Planning Advisory Council.\n\nMr. Speaker, let us join in recognizing Mr. David Williams for  receiving the distinguished Best Community Banking Award for 2025. I  thank him for his enduring commitment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695770/recognizing-mr-david-williams-for-receiving-the-best-community-banking-award-for-2025"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "Mr. OWENS. Mr. Speaker, I rise today to recognize Margaret Peterson,  a dedicated public servant and respected leader in West Valley City.\n\nMargaret served on the city council for 18 years, always putting  families and students first. She is also the founder and Executive  Director of the Community Education Partnership, a nonprofit that  supports…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690092/recognizing-margaret-peterson"}]