[{"senator": "Al Green", "party": "Democrat", "sentence": "…way of this  tariff.\n\nI would also remind people that as we move forward, I have indicated  that the filing of Articles of Impeachment is imminent. We are  currently in a countdown to impeachment.\n\nNow, those who know me know that I wouldn't say this if I were not  going to move on with it, and I am. We will have Articles of  Impeachment filed.\n\nI cannot…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…culprit in the process,  and that would be the President. The President is the biggest dastard  in the country. President Donald Trump is dastard number one.\n\nThis says: ``Countdown to Impeachment.'' This is the President of the  United States of America seated here. I am proud to tell you that I  stood right over there and told the President to his…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…in  Texas.\n\nThey really don't want this impeachment again. He is already a twice- impeached President and 34 times a felon.  They don't want this. Yet, we are still in the countdown to  impeachment. This is one of the remedies that we have. It is probably  the only one that we have currently that we can impose upon the  Congress for a vote; it is impeachment.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…revelations are yet to come, and in the revelations, I assure  you, Mr. Speaker, we will come to conclusions that will cause this  President to be removed.\n\nWe are now into the countdown for impeachment. This countdown will  manifest itself in articles being brought to the floor of the House of  Representatives next week. I fully intend to do so. For edification…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690862/and-still-i-rise-impeaching-president-trump"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…this Congress and through life.\n\nI have been silenced, no. I have been censured, yes. I plan to  continue with this movement. This movement is something that I call now  a countdown to impeachment. This countdown is something that I embrace.  I embrace it with my friends, all of whom I have named, but I think  sometimes it bears repeating certain things.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692296/and-still-i-rise-denouncing-the-presidents-authoritar-ianism-and-recognizing-the-impeachment-warriors"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…us, I will be talking about it a good deal of the  time in the future. I am censured but I am not silenced.\n\nI am, at this moment, bringing to the attention of everyone the  countdown to impeachment. The countdown begins tonight with a message  that I have for my colleagues, for the press, for the public, and for  all who are interested in this topic.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…advocated for people to  follow the law, saying that these Democrats should be lynched, at some  point there is a line. This is the line. This is the solution.\n\nWe are in a countdown to impeachment. I intend to bring Articles of  Impeachment to remove this President, who is normalizing violations of  the Constitution. He could care less about due process.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…power.\n\nWe have but one power that we can use without the consent of the  other side. That one power is impeachment. We have one power: the power  to impeach.\n\nWe are in a countdown. We are in a countdown because, whether the  President likes it or not, whether I like it or not, the people of the  country want to see him impeached. Whether he likes it…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700250/peaceful-silent-protest"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…enough--enough to wasteful  spending, enough to out-of-control deficits.\n\nWe do have a long journey ahead, but, thankfully, not as far as the  Moon. All systems are go. Let the countdown begin, and let's launch to  fiscal sanity by voting ``yes'' to clawing back $9 billion.\n\nI am ready. The House is ready. America is ready. Let's go get `em.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693715/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…452, the Miracle on Ice Congressional Gold Medal Act.\n\nWho can forget those words from legendary announcer Al Michaels:  ``Eleven seconds. You've got 10 seconds to go. The countdown going on  right now. Morrow up to Silk. Five seconds left in the game. Do you  believe in miracles? Yes.''\n\nWho can forget those legendary words on that Friday, February…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690280/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…papers down. Mr. Speaker,  when you talk about the 1980 Olympic game, I don't need any notes. I  don't need any recollection.\n\n``Eleven seconds. You've got 10 seconds. The countdown is going on  right now! Morrow, up to Silk. Five seconds left in the game. Do you  believe in miracles? Yes!''\n\nFriday, February 22, 1980, the game started at 5 p.m. Eastern…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695441/miracle-on-ice-congressional-gold-medal-act"}]