[{"senator": "Julia Brownley", "party": "Democrat", "sentence": "…hands. It says:  Don't even consider it.\n\nMeanwhile, China has already made cultivated meat a national priority  in its 5-year plan. They are scaling up production, while countries  like Singapore, Israel, Australia, and the U.K. are moving forward, as  well.\n\nIf cultivated meat helps deliver cheaper, scaleable protein solutions  worldwide, do we really…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695257/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…to power and about  power. Here is the truth: Under this President, Republicanism is  eroding and devolving into racism. This President has declined to allow  persons from countries of color to come into the country when he has  opened the door to Anglos from South Africa. This President has found a  way to circumvent what would ordinarily be a society…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694163/racism-infused-in-texas-politics"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…the tariffs that he put in place. He did so  not just against China, not just against our adversaries, but against  allies like Canada, Mexico, France, Germany, and other countries. It  has been devastating to the American economy and businesses across the  country.\n\nHe ran for election telling the American people that he was going to  make their economic…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…security, or political reason for the  U.S. to resume nuclear explosive testing. If a nuclear power resumes  testing because the U.S. is abandoning the testing moratorium, those  countries will develop new types of warheads and close the scientific  and technical advantage we have always enjoyed in warhead design. It  would be a net detriment to U.S. national…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696948/opposition-to-explosive-nuclear-testing"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…private sale loophole, which the majority refuses to close.\n\nWe don't need more loopholes. America already stands out as an  outlier in the world among advanced industrialized countries. We have  rates of gun violence and gun homicide that are 10 or 20 times higher  than Canada, the United Kingdom, France, Germany, Israel, and Japan.  You name it, nothing…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…extend to our neighbors. David has opened his farm to more than 450  participants in the U.S. Department of State's International Visitor  Leadership Program from over 100 countries to learn from his practices  and spark ideas they can carry back home.\n\nKentucky is proud to call Mr. Neville one of our own, and I am  honored to recognize his remarkable…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699894/recognizing-david-neville"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…prioritize nuclear disarmament and adopt  measures to reduce the risk of nuclear war.\n\nWe must continue to work toward international agreements, Mr.  Speaker, with all nine countries that possess nuclear weapons through  comprehensive nuclear test ban treaties, as well as the treaty on  prohibiting a nuclear weapon.\n\nAgain, we must come together. I cannot…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694114/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…longer the point. They did this in the  1990s, too, when they took control of the House. Do you know what they  did? They opened the door for China and Russia to go into these  countries, have geopolitical victories funded by our money that they  made in trade against us, speaking of China, and then, and then us  walking  out the door. This is absolutely…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693708/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…nonviolence or nonexistence, and we are marching toward  nonexistence.\n\nAs we decide who is going to have certain pieces of land and how land  is going to be divided, many countries who are viewing this are  concluding that to protect themselves, they are going to have to have  the ultimate weapon. Just as North Korea made that decision, others are…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…President and his ways, or do they vote for their people, their  constituents?\n\nLet's be clear about this so-called emergency Donald Trump declared  on Canada and so many other countries where no emergency exists. For  over 50 years, emergency authorities have been declared. What have they  been? Yes, they have been for civil wars. Pandemics? I think that…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…started as a Wall Street problem,  became a global depression because the world failed to realize that,  even then, our economies were connected and that tariffs could hurt all  countries when all countries adopted them, when a trade war ensued. And  a trade war now is what we face.\n\nCanada has long been one of our Nation's closest allies and trading  partners.…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689487/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Afghanistan, many losing their lives, their limbs, and their  loved ones, the last thing the American people want is to send our  troops to any new wars, especially against countries that pose no  threat to our own.\n\nNow President Trump will not stop talking about taking over Canada,  Greenland, and Panama. He is obsessed.\n\nListen to me when I tell you…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689063/prevent-president-trump-from-invading-other-countries"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…My friend, Fareed Zakaria, had this whole spiel on how manufacturing  doesn't matter. I like Fareed usually, but on this he is dead wrong. He  cited Japan and Germany as countries that did manufacturing and missed  the tech boom. So he said: Well, we should do the tech boom and the  finance boom, and we don't need to do manufacturing.\n\nHe did cite…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689079/economic-populism"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…this Republic that, if it  is more than defending the United States--if it is going on offense in  any  way--congressional authorization is needed.\n\nIt is so rare. In other countries and at other times, war has been  for the Executive. It has been for the King. It has been for the  Emperor. It has been for the Monarch. It has been for the Czar. It has…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…harmful collection practices occur in international  waters, particularly in regions such as Southeast Asia, where most of  the world's coral reefs are located. In many of these countries, there  are weak or insufficient regulations to prevent destructive collection  methods. As the largest importer of ornamental reef fish and corals,  the United States bears…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688918/saving-nemo-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…disclosure requirements relating to foreign gifts and       contracts, to prohibit contracts between institutions of       higher education and certain foreign entities and countries       of concern, and for other purposes. The first reading of the       bill shall be dispensed with. All points of order against       consideration of the bill are waived.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…living in  the Donbas and other areas of Ukraine. This is the same vile, absurd  pretext that Adolf Hitler used when he invaded the German-speaking  regions of neighboring countries in Europe, including Poland. That is  who Vladimir Putin is.\n\nRegrettably, the people of Russia are led brutally by Putin, this  world-historical villain.\n\nUkrainians will…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699095/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…subsection (a).       SEC. 5. REPORTS ON FORCED ORGAN HARVESTING AND TRAFFICKING IN                     PERSONS FOR PURPOSES OF THE REMOVAL OF ORGANS                     IN FOREIGN COUNTRIES.\n\nThe Foreign Assistance Act of 1961 (22 U.S.C. 2151 et seq.)       is amended--\n\n(1) in section 116 (22 U.S.C. 2151n), by adding at the end       the following:\n\n``(h) Forced…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…``(8) Technologies that can be retrofitted at cement,       concrete, and asphalt plants that represent the most common       facility types in the United States and in other countries,       with consideration for field validation of such retrofits.\n\n``(9) Best practices for data standardization and data       sharing tools and technologies, in coordination…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…AGOA program--first established by  Congress in 2000. AGOA is a nonreciprocal U.S. trade preference program  that encourages trade and investment with sub-Saharan African  countries.\n\nEconomic benefits of AGOA include:\n\nThe bolstering of economic growth.\n\nPromoted economic and political reform.\n\nImproved U.S. economic relations in the sub-Saharan Africa…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698905/agoa-extension-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…seen continued decline when it comes to  student achievement. Spending has continued to go up, and student  achievement has continued to go down. We are falling behind other  countries, and it is putting our country at significant risk for the  future.\n\nMillions of kids in California and throughout the country are not  getting the education that they deserve.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…thousands in Canada and thousands in Mexico. Those numbers are  staggering, but those numbers are a small part of the tragedy to  families.\n\nFor every fentanyl death in our countries, there are families who are  suffering. For every fentanyl death, there is somebody who goes to the  hospital multiple times. For every fentanyl death, there are three or…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699964/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…here on student visas. People being  what they are, many of these people on visas stay in the United States  anyway.\n\nIn addition to that, the United States is one of the few countries in  the world in which we have birthright citizenship. We have new  citizens. If a woman from China flies into San Diego, has a child, and  comes back, the way we are interpreting…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…collaboration and transparency. The challenge  is ensuring this openness does not compromise our research security.\n\nWhile the U.S. has significantly profited from this system, other  countries--friends and foes--also benefit from U.S. investments. The  theft of our basic research poses a significant risk to our global  competitiveness. It takes our cutting-edge…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688931/united-states-research-protection-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Advantage Company in  Lancaster, which continues to design and distribute tool and equipment  mounting solutions for the fire service, military, and other industries  in over 38 countries.\n\nIn 2007, Dick established the Greater Lancaster Museum of  Firefighting, located next to his business. The museum showcases  historic firefighting artifacts, including…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690585/recognizing-the-life-of-service-of-dick-young"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "Mr. BACON. Mr. Chair, I 100 percent support the Baltic Security  Initiative. All three countries are our best friends. They embrace  freedom, democracy, free markets, and the rule of law, and no one has  embraced our values like these Baltic States.\n\nThese countries…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695259/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…Under the current framework,  fraudsters go unpunished, consumers remain unprotected, and the best  and brightest minds in the industry have picked up and left for other  countries.\n\nThe CLARITY Act finally establishes distinct jurisdictional  boundaries between the Securities and Exchange Commission and the  Commodity Futures Trading Commission, while…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693781/digital-asset-market-clarity-act-of-2025"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…the southern border is closed. Drug dealers, sexual  predators, human traffickers, and those who illegally invaded our  country during the Biden administration from over 160 countries are  being returned to the country of their origin.\n\nUnder Biden, our emergency departments and local hospitals became the  preferred free healthcare provider for illegal…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…problem in our  hemisphere worse. Certainly, any war will exacerbate the already  precarious humanitarian crisis in Venezuela and lead to mass migration  into neighboring countries already struggling under the strain of  millions of refugees. And rest assured, many of those who flee the  disaster of the war that will come will make their way to the…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…economics.\n\nMr. Speaker, I have two last boards. I want to make a point. We  updated this as of a couple of hours ago. We are actually remarkably  lucky. In other industrialized countries, the debt is starting to scare  the hell out of bond markets. A bunch of our longer term--10 years and  out--have actually been operating very efficiently.\n\nDoes it bother…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}]