[{"senator": "Jared Huffman", "party": "Democrat", "sentence": "…production.  . . . And the U.S. farm economy is in a tough spot, and we just don't  have any room for error right now.''\n\nHere is Chris Harner, owner of Harner Farm in Centre County,  Pennsylvania: ``We did get a letter from our one supplier that once the  tariffs kick in, they will be passing on the costs.''\n\nPaul Krueger, a corn and soybean farmer from Bladen,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Mr. Speaker, I rise today with deep pride and  gratitude to recognize a truly remarkable individual from my district-- Chief Glenn Forsyth of Newtown Township in Bucks County, Pennsylvania.\n\nThis year, Chief Forsyth is celebrating an incredible milestone--50  years of continuous service with the Newtown Fire Association.\n\nLet me repeat that: Five decades…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691839/recognizing-chief-glenn-forsyths-50-years-of-service-with-the-newtown-fire-association"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Jim Decker as he retires from the Warren County Chamber of Business and  Industry.\n\nJim's professional life is deeply intertwined with the economic  vitality of Warren County, Pennsylvania. Since 1989, he has served in  some capacity with the Warren County Chamber of Business and Industry.\n\nSince 1997, he has led the WCCBI as president and CEO. He also…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697068/recognizing-jim-decker"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…political violence is not the answer\n\nMr. JOYCE of Pennsylvania. Madam Speaker, this past weekend marked 1  year since the attempt on President Trump's life in Butler County,  Pennsylvania. While we thank God that President Trump's life was not  taken, we mourn the loss of an innocent father, firefighter, and proud  Pennsylvanian, Corey Comperatore.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693458/golden-age-of-america-has-arrived"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…today to recognize and commend  Mr. Paul Calderaio for his extraordinary dedication to public service  and his lasting contributions to Buckingham Township in Bucks County,  Pennsylvania.\n\nPaul's commitment to service began early in his life while living in  Florida. That dedication only deepened after he and his family made  Buckingham Township their…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698361/9999"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…for  continued success.                           honoring the metz family\n\nMr. JOYCE of Pennsylvania. Madam Speaker, I rise today to honor the  Metz family of Perry County, Pennsylvania, for receiving the  designation of bicentennial farm from the Pennsylvania Department of  Agriculture.\n\nA bicentennial farm is a farm that has been owned by the same…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694805/critical-supply-chains"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…pleased to congratulate and recognize  the Garden Spot Future Farmers of America chapter (Garden Spot FFA),  affiliated with Lampeter-Strasburg High School in Lancaster County,  Pennsylvania, on their success at the 98th National FFA Convention &  Expo.\n\nThe Garden Spot FFA represented themselves well during the 98th  National FFA Convention & Expo, which…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698930/congratulating-the-garden-spot-future-farmers-of-america"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…I rise today with deep admiration and  appreciation to recognize a truly outstanding individual from my  district--Volunteer Firefighter Mr. Larry Newman from Bucks County,  Pennsylvania.\n\nThis year, Mr. Larry Newman is celebrating 40 remarkable years of  continuous service with the Yardley-Makefield Fire Company.\n\nLarry's story began long before he…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695286/recognizing-larry-newmans-40-years-of-service-with-the-yardley-makefield-fire-company"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Designation of Black's Willow Run Farm\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, I rise today to honor four  generations of the Black family in Tyrone Township, Blair County,  Pennsylvania, on the designation of their farm as a Century Farm by the  Pennsylvania Department of Agriculture.\n\nJames Black purchased the farm in December 1920 at a cost of $28…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696753/improving-domestic-energy-market"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Speaker, I am pleased to congratulate and recognize  the Penn Manor Future Farmers of America chapter (Manor FFA),  affiliated with Penn Manor High School in Lancaster County,  Pennsylvania, on their accomplishments at the 98th National FFA  Convention & Expo.\n\nPrior to the national convention, the Manor FFA was named as a  national finalist for the 2025…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697257/congratulating-the-manor-future-farmers-of-america"}, {"senator": "Mike Kelly, Jr.", "party": "Republican", "sentence": "Mr. KELLY of Pennsylvania. Mr. Speaker, I rise to recognize Mercer  County Pennsylvania as they commemorate their 225th Anniversary. It is  with immense pride that we acknowledge 225 years of history, community,  and resilience. This milestone is not simply…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689795/recognizing-mercer-county-pennsylvanias-225th-anniversary"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to honor and commend Mayor  Joe Taylor of Langhorne Borough, Bucks County, Pennsylvania, a devoted  public servant whose life's work reflects unwavering commitment,  integrity, and the highest ideals of civic leadership.\n\nSince making Langhorne Borough…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697645/commending-mayor-joe-taylor-for-his-dedicated-service-to-langhorne-borough"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Sister Paula a happy birthday.                             Honoring George Lake\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, I rise today to honor George  Lake of Huntingdon County, Pennsylvania, as the first recipient of the  Pennsylvania Veteran Ag Entrepreneurship Award.\n\nAfter completing his service in the U.S. Marine Corps, George took  the responsibility…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699740/confronting-the-disease-of-addiction"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Speaker, I am proud to recognize Jonathan D. Holmes,  Chairman of the Jackson Township Board of Supervisors, for his many  years of service to Jackson Township, York County, Pennsylvania.\n\nJon has dedicated his life to serving the great People of Jackson  Township. He began in 1990 after being appointed as an alternate to the  Township Zoning Hearing…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697178/recognizing-jackson-township-board-of-supervisors-chairman-jonathan-d-holmes"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to recognize an incredible  individual from my district. Brian Kern of Bucks County, Pennsylvania  has served the Neshaminy School District for the past 32 years. On July  1, Principal Kern retired from his career in public education, closing  a chapter marked by…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694739/recognizing-neshaminy-school-district-core-creek-elementary-school-principal-brian-kern-for-32-years-of-service"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…public service and community leadership of C. Stewart McCleaf, who was  sworn in on January 5th to begin his fourth term as a Washington  Township Supervisor in Franklin County, Pennsylvania.\n\nOver the years, Stewart has served in leadership positions with the  Township Board of Supervisors, Rouzerville Business Association,  Pennsylvania State Association…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698643/recognizing-the-public-service-and-community-leadership-of-c-stewart-cleaf"}]