[{"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…including the Minority Business Development Agency, the only Federal  agency dedicated to uplifting minority businesses. This agency helped  entrepreneurs all across the country, including in my own district,  keep their doors open and their workers employed. Now, it is under  attack.\n\nWhile all of this is happening, they are dismantling environmental…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…were operating normally; the       10th had not yet opened for the day when officials arrived.\n\nShirley's video prompted other conservative activists       around the country, including in San Diego, to follow his       lead.\n\nIn San Diego, one proponent of unfounded fraud allegations       has been activist Amy Reichert, who founded Restore San Diego…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…emergency       response official and was preparing to deploy to help the       efforts combating the avian influenza epidemic.\n\nBird flu cases are popping up across the country, including in my  district, yet Trump is firing the public servants who are responsible  for fighting the disease.\n\nDonald Trump is not only jeopardizing the livelihoods of thousands…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688173/fired-by-president-trump"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…from Andersonville Theological Seminary.\n\nWith over two decades of ministerial experience, Reverend Robinson  has held several leadership roles in churches across our country,  including Louisiana, Missouri, Wisconsin, and Illinois. Dr. Robinson is  known for delivering powerful sermons. His favorite biblical passage is  Ephesians 3:20, which states,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695372/recognizing-reverend-dr-perrico-j-robinson-sr"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "…his strong suit  with the American people, which is immigration.\n\nAmericans are now realizing that Donald Trump's anti-immigrant  policies are targeting everyone in our country, including U.S.  citizens.\n\nWhen Donald Trump eliminates due process for immigrants, whether it  is  for legal immigrants or students who are here with legitimate visas, he  is…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690507/trump-immigration-policies"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…legislation would cut $1.1 billion in funding for the  Corporation for Public Broadcasting, which supports over 1,500 public  radio and television stations across the country, including over 50 in  Colorado. Colorado outlets stand to lose over $7.6 million in funding-- with a disproportionate effect for rural and Tribal communities across  the State.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693642/hr-4"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Governor urging opposition  to healthcare cuts, citing the need for more care and less bureaucracy.\n\nAnd on June 12, 900 State and local elected officials from across the  country--including mayors and State senators and representatives,  attorneys general--all stood up to come out against ``the damaging and  reckless plan.''\n\nAnd these proposed cuts are…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "Ms. BARRAGAN. Mr. Speaker, the Trump administration continues to take  away access to STEM education from students across the country,  including hundreds of middle school students in my district.\n\nFor years, the Long Beach Public Library's Youth SEED program  delivered hundreds of workshops in science, technology,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699137/denouncing-cancellation-of-long-beach-public-library-seed-program"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…in Project 2025 to eliminate  funding for title I schools, which support low-income students. We are  talking about funding for 49,000 title I schools throughout the  country, including 170 schools in my State of Hawaii, 2,091 title I  schools in Florida, 7,500 title I schools in Texas, and so many more.  Every single State has title I schools. There…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688248/nomination-of-linda-mcmahon"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…new Federal gun safety legislation in 30  years.\n\nOur job, of course, as Gabby makes clear, is far from finished. Every  day an average of 327 people are shot in this country, including 23  children shot on average every day. Over 65 million Americans say at  least one person in their family has been fatally shot, their lives  extinguished by gun violence…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698770/marking-15-years-since-tucson-shooting"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…of       overturning any resulting discipline.''\n\nH.R. 5107 would also repeal many other common-sense reforms       of D.C.'s laws that have been adopted across the country,       including:\n\nTimely and thorough investigation of incidents that involve       deadly use of force by an officer or a death in custody.\n\nRelease of body camera footage in cases…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696949/opposition-letter-led-by-the-american-civil-liberties-union-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…for our family, especially for my 5-year-old daughter who  has autism.''\n\nThat is the thing, Mr. Speaker, Medicaid is important for so many  Americans all across this country, including people with disabilities.  It is a necessary lifeline so that parents can help their children live  a better life with dignity and respect.\n\nWhy would any legislation…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "Mr. LANDSMAN. Mr. Speaker, I rise today on behalf of all the NIOSH  workers around the country, including the 400 in my district. For 50  years, NIOSH has been helping workers all over the country, making sure  that workers are safe and healthy.\n\nDuring all the DOGE cuts,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699625/niosh-workers-got-their-jobs-back"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…staff work with stakeholders to connect people  with community services and resources that set them up for success.\n\nThis week, Federal probation officers from across the country,  including my home State of Rhode Island, gathered in our Nation's  Capital to celebrate the progress made over the past hundred years and  look ahead to its future. I extend my…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688716/centennial-of-the-probation-act-of-1925"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…communicating through speech and that holds the documents a police  officer might request during a traffic stop. These programs exist in  many jurisdictions across the country, including statewide in  Massachusetts, Connecticut, Arkansas, Rhode Island, Arizona and  Vermont.\n\nI urge my colleagues to support this bill.", "date": "2025-08-05", "source_url": "https://justfacts.votesmart.org/public-statement/1694714/introduction-of-the-blue-envelope-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…possibility that the integrity  of competition could be called into question.\n\nThis bipartisan bill has received overwhelming support from schools  and conferences across the country, including the NCAA. I believe this  bill is the first step--not the last, the first step--in protecting  college athletes and ensuring there is a national standard and an even…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…Oklahoma. LNG exports alone in the U.S. support more than 273,000 U.S.  jobs and contribute $40 billion to our GDP.\n\nThis sector is a lifeline for communities across the country,  including Oklahoma's Fifth Congressional District, and we must ensure  it has a stable framework to reach its full potential.\n\nLNG exports are also a win for the environment.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697092/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…blocks of good citizenship.\n\nI congratulate each of the awards' winners.\n\nI include in the Record a list of this year's Congressional Award  Gold Medalists from around the country, including three recipients from  the great state of Wisconsin.                   2025 Congressional Award Gold Medalists\n\nAK: Joshua Pak\n\nAL: Grant David Hershbine, Autumn Kerby,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692400/congratulating-the-2025-congressional-award-gold-medalists"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…will provide critical time for law  enforcement to track down criminals who have defrauded the U.S.  Government and hold them accountable.\n\nSmall businesses across our country, including in my home district of  central and eastern Montana, deserve an SBA that efficiently supports  local job creators and isn't undercut by fraud.\n\nMr. Speaker, I thank my…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697225/sba-fraud-enforcement-extension-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…PEACE Act. This proposal would finally kneecap Russia's  energy revenues, which still total some $200 billion per year. This  would impose secondary sanctions on the country, including on Gazprom  and Rosneft.\n\nIt passed out of my committee, the Financial Services Committee, by a  vote of 53-1. It would be the first intensive sanctioning of the  Russian…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695367/greater-sanction-pressure-on-russia"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…authorities granted to       officers and agents of Air and Marine Operations may provide       the support described in subparagraph (B) to the government       of a foreign country, including by conducting joint       operations with appropriate government officials within the       territory of such country, if an arrangement has been entered       into between…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696951/combatting-international-drug-trafficking-and-human-smuggling-partnership-act-of-2025"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…across the country and in this body, most Americans know I am  very plugged into law enforcement. I get calls every day from these  guys, boots on the ground across the country, including deep in Federal  law enforcement, and they support this law. Don't tell me that Federal  law enforcement doesn't want to do this or it is bad for the country in  some…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693077/special-interest-alien-reporting-act-of-2025"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…The gentlewoman acknowledged that there is danger involved, yes. Yes,  enforcing the law is dangerous. This is why the professional law  enforcement officers across the country, including here in D.C., are  incredibly well vetted and trained and equipped to make decisions in a  matter of seconds or less to pursue criminals and to enforce the law.\n\nIt is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695643/district-of-columbia-policing-protection-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…an Office of the Advocate  for Small Business Capital Formation.\n\nEach year, the Office of the Advocate for Small Business Capital  Formation hosts events across the country, including California.\n\nThese events aim to support small businesses and better understand  the issues that they face in raising funds. Unfortunately, burdensome  regulations often…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693953/improving-access-to-small-business-information-act"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…internationally  banned.\n\nNational injunctions are being used to halt executive actions and  executive orders not just for plaintiffs before the court but across  the entire country, including individuals and entities that are not  even parties to the litigation and, in many cases, may not favor the  outcome and would not have been willing plaintiffs.\n\nThis…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Americans will miss out on  their monthly benefits from the Supplemental Nutrition Assistance  Program, or SNAP, which are essential for individuals and families  across the country, including countless military families in Alaska.\n\nWe have seen delays at major airports. People are canceling  appointments as they cut back on expenses. Businesses are losing…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696473/vote-explanation"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…compliance regimes that do not  reflect their improved emissions profile.\n\nFinally, let's not forget our small and rural manufacturing  facilities in communities across this country, including in my own  district in New York's southern tier. These facilities include metal  fabricators and food processors, many of whom have taken proactive  steps to cut emissions…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…previous levels and restores critical  staffing positions lost under the fiscal year 2025 continuing  resolution. It also delivers funds directly to communities across the  country, including my own Yakima County, to establish a dedicated  emergency operation center and ensure timely and well-coordinated  emergency response efforts.\n\nThe U.S. Coast Guard is…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699356/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…Performance in Germany       were tucked into his travels also.\n\nA noted and gifted motivational speaker, Jim spoke to       several varied groups locally and around the country       including the Fellowship of Christian Athletes national       gathering. As Joe Dill, a former Fargo Forum editor, stated,       ``Jim Bjorge is among the best speakers I have…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}]