[{"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…of her  community, Quaker Valley, and beyond.\n\nMrs. Cole was passionate about the history of her family and the  community in her hometowns.\n\nFor 20 years, she conducted countless hours of historic research,  including interviewing more than 100 community members. In 2000, that  work came to fruition with the publication of her book titled, ``Their  Story:…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697614/mary-elizabeth-bettie-cole-post-office-building"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…championship game. The team claimed the school's  first-ever championship in a nail-biting 14-6 win.\n\nUnder the leadership of their head coach, Frank Gallardo, the team  devoted countless hours to training this season. Their hard work and  competitive spirit carried them forward when the game was tied at six.\n\nIn the final minutes, Eagles quarterback Michael…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697339/congratulations-to-the-lady-eagles-volleyball-team"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…city council member, serving as board chair of  the Five Star Education Foundation, and as citizen chair for a school  district's bond campaign. Representative Bird spent countless hours  volunteering in students' classrooms, which led to her co-founding the  Adams 12 Community Action Network, dedicated to empowering students by  providing equal learning…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698814/recognizing-colorado-state-representative-shannon-bird"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…people can achieve. It is not easy to earn the prestigious rank of  Eagle Scout--one must persevere through years of hard work, demonstrate  strong leadership, and dedicate countless hours of service to others.\n\nThe Scout Motto is ``Be Prepared'' and becoming an Eagle Scout is one  of the best ways for a young person to prepare for a life of service  and…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697395/recognizing-the-eleven-newest-eagle-scouts-from-troop-407"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…teamwork and  community. I would like to express my gratitude to John for bringing  these valuable opportunities to children in his community.\n\nUnseen hours of sacrifice and countless hours behind the scenes are  what distinguishes service from other kinds of work. John's story is a  shining example of everyday people rolling up their sleeves and  answering…", "date": "2025-11-25", "source_url": "https://justfacts.votesmart.org/public-statement/1697165/recognizing-john-piersol-as-ohios-13th-congressional-districts-champion-of-the-week"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…the community has the medical supplies and  equipment it needs at all times.\n\nHis impact on the community extends well beyond the firehouse walls.  Mr. Fountain committed countless hours to mentoring newly minted  firefighters and leading the firefighters' union as president.\n\nThrough his example, Mike Fountain has shown us what leadership is  all about.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694967/congratulating-mike-fountain-on-his-retirement"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…deliver real, meaningful  public safety investments for the people whom I serve.\n\nMr. Speaker, I also thank Rosa DeLauro, our ranking member, and  Chairman Cole for the countless hours truly working in a bipartisan way  and being an example to me of how people should work together for the  interests of our Nation. I thank them both very much for their…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698753/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…sportsmanship.\n\nLet's follow the example of our Little League parents and volunteers  by making a pledge to support youth in our community and to support the  people who spend countless hours teaching America's favorite pastime.\n\nLet's play ball, Mr. Speaker.", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700082/east-fullerton-little-league-70th-anniversary"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…I rise today to recognize the outstanding  contributions that Mr. Jason Chase has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690800/recognizing-jason-chase"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Orientation Course in 1975.\n\nAfter his 32-year career in the Marine Corps, Colonel Airola  transitioned his service over to the HEARTS Veterans Museum from its  inception. His countless hours of volunteering, setting up museum  displays, participating in parades, and educating the visitors and  children is nothing short of amazing. Up until the summer of 2025,…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696280/recognizing-colonel-john-battista-airola-usmc-retired-with-a-congressional-veteran-commendation"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…listening to the concerns of citizens and striving to make decisions  that benefited the entire community. Beyond his official role in  government, Casey has dedicated countless hours to various civic  organizations that make Brooksville a better place to live. He is an  active member of multiple local groups, always stepping up to help  organize community…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690159/recognizing-casey-thieryung"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…operating costs by $4  million over the next 4 years.\n\nEliminating the print requirement will also eliminate inefficient use  of CRS staff time. Requiring CRS staff to spend countless hours  formatting and paginating the print version of CONAN does not support  the work of Congress, nor does it benefit our constituents.\n\nMr. Speaker, replacing the CONAN print…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689324/repeal-requirement-for-congressional-research-service-to-prepare-annotated-constitution-and-supplements-in-hardbound-version"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Speaker, I rise today to recognize the outstanding  contributions that Tyrone Young has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692468/recognizing-tyrone-young"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…pilot, Pat volunteered to transport hundreds of American and  allied troops through the Middle East during Operation Iraqi Freedom.  On top of that, Pat and Beth have poured countless hours into  volunteering with local schools, educational programs, and park  district programs.\n\nIt is an honor to bestow Pat with the Patriot Award for his  exceptional service…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694136/recognizing-congressional-patriot-award-recipient-pat-terrell"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…I rise today to recognize the outstanding  contributions that Ms. Carol Noble has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690136/recognizing-carol-noble"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…rise today to recognize the outstanding  contributions that Mr. Mike Phillips has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691726/recognizing-mike-phillips"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…I rise today to recognize the outstanding  contributions that Ms. Kay Hoffland has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691124/recognizing-kay-hoffland"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…rise today to recognize the outstanding  contributions that Ms. Tasha Phillips has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692158/recognizing-tasha-phillips"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…have been revitalized,  contributing to the town's unique character and charm. Beyond her work  in historic preservation, Andrea is a dedicated volunteer who has given  countless hours to various community projects. She has been  instrumental in organizing events that celebrate our local heritage,  including historical walking tours, educational workshops,…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690145/recognizing-andrea-read"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…dedication, passion, and unwavering commitment to a cause that truly  changes lives.\n\nFor the past year, as Penn Staters have done for more than 50 years,  these students devoted countless hours to supporting pediatric cancer  patients through THON, the largest student-run philanthropic  organization in the entire world.\n\nTHON is a yearlong fundraising effort…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688351/recognizing-thon"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…I rise today to recognize the outstanding  contributions that Mr. Mike Lastra has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691772/recognizing-mike-lastra"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…1972 and continues as an active Mason in  the Huntsville Forest Lodge No. 19 as a Tiler. He is a self-taught  Farrier working with Horses and Livestock and has devoted countless  hours working with FFA students as a Board of Director with the Waller  County Fair Association. He is also a Life Member of the world-famous  Houston Livestock Show and Rodeo…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696281/recognizing-richard-reagan-horn-with-a-congressional-veteran-commendation"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…time or the place. He  teaches during lunch, before school, after school, into the evening,  and sometimes over the weekend before an upcoming important test,  dedicating countless hours towards promoting the success of his  students. He even extends himself at times to help students that aren't  specifically in his class. He brings enthusiasm, positivity,…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}]