[{"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…of the ills that they are trying to  cure.\n\nOnce again, as Representative Brown shared, the diversity, the  equity, and the inclusion, and when last I checked, this country was  founded on all of those things. It has been made great because of all  of those things.\n\nWhen we talk about DOGE, I know one thing for sure is that these  folks working for…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Members of Congress in fear for themselves, their  families, their loved ones, and treasured members of their community.\n\nAmerica does not live in fear. That isn't why our country was  founded. We have been a refuge for our entire history, and we need to  continue to be a refuge for those seeking a better life. Who will speak  up for these people while they…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…people in the masses.\n\nI am not one of the persons who would do this. I believe that  authoritarianism, Mr. Speaker, must not be managed. It must be  eliminated.\n\nThis country was founded upon the basic premise that it would be a  democratic republic where you elect your Representatives to vote for  you. This is a democracy. As such, in this democratic…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "Ms. RIVAS. Mr. Speaker, I thank Congressman Takano for recognizing me  and for hosting this important discussion in front of the American  people.\n\nOur country was founded on the values of life, liberty, and the  pursuit of happiness, but who are we as a country if we backtrack on  those founding values? We would not be the country that…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690513/trump-immigration-policies"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…one another. It is where we feed the  hungry, where we care for the sick, and where we house the homeless.\n\nHe focused on making sure that the promises upon which this country  was founded ring true for every American.\n\nBefore he died, he wondered if the dream that he talked about on the  March on Washington had become a nightmare and was too far out of…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…residents--passed       those laws after extensive debate and consideration. It would       be undemocratic and contrary to the principles of local       autonomy on which this country was founded for Members of       Congress, in whose election District residents have no say,       to vote to upend these purely local laws.\n\nDistrict residents should have the…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…residents--passed       those laws after extensive debate and consideration. It would       be undemocratic and contrary to the principles of local       autonomy on which this country was founded for Members of       Congress, in whose election District residents have no say,       to vote to upend these purely local laws.\n\nDistrict residents should have the…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692373/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…They are afraid  for their lives as they wait to be sent back to their home countries to  face deadly consequences for their human right of religious freedom,  what this country was founded on.\n\nThe United States should never be responsible for sending people to  face persecution, especially those who have risked everything to seek  refuge right here. These…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688337/migrants-fleeing-religious-persecution"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…to the next generation.\n\nIn this moment, we have no choice but to stand up for our  communities, for Renee Good, for Alex Pretti, and for the very  principles that our country was founded on. That is why I will be  voting no on the bill before us unless--unless--DHS funding is stripped  out or unless critical reforms are incorporated into the bill.\n\nIf…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699402/9999"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…three.\n\n``First, it shows our commitment to truth. A great nation does not  hide its history; it faces its flaws and corrects them. This museum  tells the truth, that a country founded on the promise of liberty held  millions in chains . . . that the price of our Union was America's  original sin. From the beginning, some spoke the truth--John Adams…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…residents--passed       those laws after extensive debate and consideration. It would       be undemocratic and contrary to the principles of local       autonomy on which this country was founded for Members of       Congress, in whose election District residents have no say,       to vote to upend these purely local laws.\n\nDistrict residents should have the…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692302/protecting-our-nations-capital-emergency-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…our own race to cheat their way into prominence.''\n\nThis was the first great backlash in American history to making  progress toward making the ideals of upon which our country was founded  true for everyone.\n\nEnter my own family history. My great-grandfather in Alabama around  the same time had to take a literacy test in order to be able to  register…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689341/fighting-voter-suppression"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…meet their needs. For some of them, that is an  electric vehicle. For some of my delivery companies, that is an  electric truck; but for some, it is not. I believe our country was  founded on the principles of freedom and liberty, and that means we are  empowered to choose for ourselves about those decisions and not have  our government make those decisions…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690433/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…sparked the  Revolution. And, yet, today we are here before the Senate because one  person in our country wishes to raise taxes.\n\nWell, this is contrary to everything our country was founded upon.  One person is not allowed to raise taxes. The Constitution forbids it.\n\nThe Constitution was so concerned with the power of taxes--which some  have said the power…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…moral problems.\n\nIn a great book that I am reading, ``The Tragedy of American  Compassion,'' the type of people who were involved in providing food  for the poor when our country was founded were very keenly aware that  programs which indiscriminately gave things to people were actually  harmful to people, that you had to weigh in with them on their moral…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…came to speak because the cause of Iran is not just a  cause that we should care about for the Iranian people, though we  should. As Americans, we are a people whose country was founded because  a group of people were unhappy by the tyranny we faced. There is no  question they face it over there, as well.\n\nThe cause of Iran is one that we should care…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691211/supporting-a-free-democratic-and-secular-iran"}, {"senator": "John Thune", "party": "Republican", "sentence": "…sacrificed everything in service to our country. We remember their  heroism and courage, and we take inspiration from their commitment to  the ideals upon which our country is founded.\n\nThis year marks 80 years since the end of World War II. Millions of  Americans served in the military during the war, and more than 400,000  Americans died. Among these…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691674/memorial-day"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…community-supported  nonprofit that is transforming lives in Spokane.\n\nMr. Speaker, we have too many fat kids in America, and we need to get  more of them out running cross-country.\n\nFounded 25 years ago by local teacher Heidi Bresson and her husband,  Mike, Active4Youth brings free cross-country programs to as many as  6,000 elementary students each fall.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695071/operation-rolling-thunder"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "…threat of Chinese  propaganda.\n\nThe CCP has committed countless violations of human rights, and its  authoritarian agenda is antithetical to  the democratic principles our country was founded on. Chinese  propaganda has no place in our education system.\n\nWe have taken important steps toward mitigating Chinese influence at  our American universities by cracking…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697531/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Otis was,  ``Taxation without representation is tyranny.''\n\nThese were the words of James Otis, but they still ring true today.  It should not come as a surprise that in a country founded on a tax  revolt, one person  is not allowed to raise taxes. Our Founding Fathers saw this and said:  No, we want to make sure that the authority of taxation begins not…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}]