[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…while lower  income Americans are made worse off through their largest cuts to  healthcare and food assistance in our Nation's history.\n\nWe live in the richest country in the history of the world. I will  inform the gentlewoman and those in this Chamber that we have 46  million people in the United States of America who are hungry or food  insecure. We…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…position  offers affordable or comprehensive enough healthcare, so an ACA plan is  her only real option.\n\nIn this, the richest country in the world, the richest country in the  history of the world, this is simply unacceptable. No one should be  spending nearly all of their waking hours working multiple jobs and  still unable to afford basic healthcare…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698667/protecting-healthcare-for-millions-of-americans"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…I agree with all of the arguments that were made. I  think the most crucial point here is that the United States of America  is the most economically powerful country in the history of the world.  That has been the case since the end of World War II. A large part of  that is because of our efforts to work with the rest of the world to  maintain peace…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…short-term  help so they can avoid eviction from their homes and the homelessness  that we are all ashamed to acknowledge continues to exist in the  greatest country in the history of the world.\n\nOur veterans are on the streets without shelter because they lack  homes, and here is a program designed to keep them in their homes, and  the Secretary is…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…a good-paying job, good housing, good education for your children,  good healthcare, and a good retirement. That is not too much to ask for  in the wealthiest country in the history of the world.\n\nThere is a lot of work that needs to be done to make that aspiration,  the American Dream, the good life, a reality. Today, we take an  important step forward…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698795/breaking-the-gridlock-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…organizations that  are making a difference in people's lives.\n\nI am proud that Massachusetts is taking a stand to fight hunger, but  I am ashamed that in the richest country in the history of the world  nearly 48 million people, including 14 million children, don't know  where their next meal is going to come from.\n\nI think our national hunger crisis is more…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698923/end-hunger-now-tour"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…choose between putting food on the  table, clothing on their backs, access to medication, or paying the  rent. The United States of America is the wealthiest country in the  history of the world. Not a single hardworking American taxpayer should  ever have to choose between food or medicine or rent or putting  clothing on their back. Not a single hardworking…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…month after month, it will go up $1,000 or  $2,000 per month. That is tens of thousands of dollars per year. It is  unacceptable in this country, the wealthiest country in the history of  the world. This is in the midst of a Republican healthcare crisis.\n\nRepublicans enacted the largest cut to Medicaid in American history.  They ripped health insurance…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696738/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…stain not on the Trump administration  alone. It is a stain on America. It is a stain on our national honor.  It is a stain on the integrity of the greatest country in the history  of the world.\n\nForeign governments have figured out how to get to Donald Trump. It  is through his wallet, his vanity, and his bank account.\n\nIt is not just this ``palace…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691071/9999"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…children, infants, women, families, veterans, and older Americans,  literally taking food out of the mouths of babies in the United States  of America, the wealthiest country in the history of the world, this is  why we say it is a cruel budget. It is a callous budget. It is a budget  that will have catastrophic consequences.\n\nVeterans will be hurt, people who…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689902/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…of it, but it is nothing compared to the struggle people in  poverty face every single day just trying to survive in the United  States of America, the richest country in the history of the world.\n\nMy great desire is to never again have to do this walk, not because  of the long days or the cold weather or the aching legs and feet, but  because I dream…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697684/16th-annual-march-for-the-food-bank"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…and now they want to blame us for the consequences of  their own actions.\n\nWhat the hell is wrong with them?\n\nGive me a frigging break.\n\nAmerica is the richest country in the history of the world. We are  blessed with an abundance of so much. There should not be an  affordability crisis. Every single person in this country should be  able to have a good…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…legislation, and the American  people know Republicans have zero credibility on fighting to protect  their healthcare.\n\nIn this great country of ours, the wealthiest country in the history  of the world, it should be the case, we believe, that access to high- quality healthcare should not simply be a privilege available only to  the wealthy, the well-off, and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698365/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…families are now left trying to  figure out how they can afford their healthcare.\n\nMr. Speaker, I would like to think it is not up for debate that in  the richest country in the history of the world, no person--and I mean  no person--should be left without healthcare. No mom or dad should have  to forego their own health insurance because they can't afford…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698593/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…which is  the Hudson Valley of New York State, and across this country.\n\nMr. Speaker, I rise today because I love this country. I believe it  is the greatest country in the history of the world. I believe it is  worth fighting for, and we must fight for it now.\n\nI also believe when you see something that isn't working, Mr.  Speaker, you stand up and…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689084/economic-populism"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…to try to insult and separate our country based on how much money  they make.\n\nWhatever a person makes today, the greatest thing about America, the  greatest country in the history of the world, is that whatever someone  is today, however much they make today, wherever they came from today,  they can be anything they want to be if they work hard, play…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…lose, but I want them to know and also my colleagues  that I am 100-percent committed to this. It is central to the idea of  being a sovereign country. No sane country in the history of the world  would do this. By the way, in speaking of heading over to Europe, ask  them how mass migration is working out for them. They have done it, and  it isn't working.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…of change. Take power away from Washington, give it back to  the people, and watch what happens. Great things are ahead for this  country. We are the greatest country in the history of the world. We  are finally going to restore that great American Dream and that hope  for those families who have been waiting way too long. That help is  coming.\n\nWe are…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}]