[{"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…lives of our Black, Native, Chicano,  AAPI, and LGBT+ communities.\n\nI rise tonight to talk about what this means for the past, the  present, and the future of this country because, as they say, those who  cannot remember the past are doomed to repeat it, and this country has  come too far to forget.\n\nMr. Speaker, how we as a nation remember matters, what…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699713/rewriting-history"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…might not agree with, but he  had a right to do this.\n\nHe had a right to life. He had a right to say these things in venues  across the length and breadth of this country and, I would say, across  the globe. These were his rights.\n\nHe had the right to be where he was and to do what he was doing.\n\nI don't know him as a person who has said things that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…because she is a survivor, when she heard their  stories. Lauren Boebert has said we need to speak up for the survivors.\n\nThis is an issue that could actually bring this country together to  say that a Nation in which rich and powerful men can rape young girls  without consequence is a nation that has lost its moral and spiritual  soul.\n\nWe can fight about…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694883/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…to the difference between a  democracy and an autocracy. In a democracy, we come together with all  of our varied experiences, with all of our different parts of the  country, and we say: Here are programs and funding that fit our Nation  as a whole. It is a master compromise. But in an authoritarian  government, one person decides what is funded and…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696665/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…is staffed by incredibly  experienced engineers, technical experts, and tech policy professionals  who understand the breadth and depth of telecom and AI impacting our  country.\n\nI say this because I had the privilege of recently serving as the  Deputy Assistant Secretary and Deputy Administrator of NTIA, this  amazing agency. I well understand how much…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690254/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…survivors of violence in the United States.\n\nToday, I recognize the strength, courage, and spirit of the  Vietnamese community in Virginia's 10th District  and across the country, and I say to our Vietnamese veterans: Welcome  home.                            Cuts to CASA Programs\n\nMr. SUBRAMANYAM. Mr. Speaker, we have heard how the recent DOGE cuts  are…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690520/election-integrity"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…it in every possible way.\n\nI am so proud of the 7 million Americans who took to the street in  every one of our States at those 2,700 different locations all across  the country to say ``No Kings.'' They were ringing the alarm bells.  They were saying that it is absolutely unacceptable to have an  authoritarian government. And that is the largest demonstration…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…to get polluting gas plants online faster.\n\nYes, we need more energy, but this comes at a time when they are, in  doing so, going to raise electric bills across the country because they  say it is only oil and gas. Forget about solar, wind, storage, all the  energy that is ready to come onto the grid.\n\nIt is another example of sacrificing the people's…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691593/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…this. There is something wrong with that? They find out that their  healthcare--that they are being helped by their neighbors and their  friends and the people in this country who say it is important for all  of us to make sure our healthcare premiums are lowered? I would say to  my Republican colleagues: Listen to your constituents. It is their  health.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696460/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…Figures, Sykes, McClellan, Lee, Crockett, Johnson,  Sewell, Meeks, Neguse, Jeffries, and Bishop, who all possess law  degrees.\n\nWe have some of the best orators in the country. I could say Ayanna  Pressley, and I can tell you historians like Jim Clyburn. I could tell  you that we are fighting because we possess those talents in fields  because we have…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687896/black-history-month"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…California put in a request to the Biden  administration and said: We want to do a rule that is different in our  State for electric vehicles than the rest of the country.\n\nNow, you may say: Well, they can't do that.\n\nWell, actually, interestingly enough, California can. California is  the only State in America--because they had environmental rules even…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691634/congressional-review-act"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…country who is indicted by the U.S. courts for drug trafficking. In  both cases, that leader is not recognized by the U.S. Government as the  legitimate leader of his country. I would say the comparison ends there  because the case is much stronger here than it was in 1989.\n\nMaduro also has I think a $50 million reward on his head from our  government.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696118/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Let's be real: This isn't about cleaner air. Never was. Never gonna  be. It is about control. It is about forcing a one-size-fits-all green  agenda on the rest of the country--I might say the unsuspecting  country--regardless of what it costs working families, what it costs  farmers, job creators, and, yes, truckers. They just don't care.\n\nThis CRA sends…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690481/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…with the American  people. And that is why the President is taking this action to try to  get these cities to come along and be part of the program with the rest  of the country to say: We are all going to work together to keep our  communities safe.\n\nThis provision is a direct attempt to undermine the Trump  administration's attempt to do that and their…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696003/unanimous-consent-requests"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…workers. Sorry to leave them  out. As a longtime poker player, I certainly don't want to leave them  out. But we ought to be fighting for blue-collar workers across this  country.\n\nAnd I will say, I have been urging--I have urged the House of  Representatives and I have urged the White House that we should take up  No Tax on Tips in the House and pass it. And…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691422/no-tax-on-tips-act"}]