[{"senator": "Luz Rivas", "party": "Democrat", "sentence": "…training for our  current and future cybersecurity professionals to engage with.\n\nCybersecurity is one of the fastest growing career fields in  California and across the country. In fact, California has promoted a  statewide initiative to train 50,000 entry-level cybersecurity  professionals by 2030. The expansion of STEM education in my district  will…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699916/funding-for-los-angeles"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…and anyone else to  potentially access and misuse their constituents' personal information.\n\nIt is not just the recklessness that should concern everyone across  the country. It is the fact that the data being held by the government  is being weaponized by the Trump administration.\n\nThe IRS recently entered into an agreement with ICE to share  information…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690782/protecting-sensitive-data-for-millions-of-americans"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…and calories  than fat-free and low-fat milk. Experts agree that saturated fat from  whole milk increases the risk of heart disease, the leading cause of  death in this country.\n\nIn fact, the majority of Americans consume too much saturated fat.  More than 80 percent of the U.S. population exceeds the recommended  limit. This bill needlessly inserts politics…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698183/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…while ignoring the crises in their own  backyards.\n\nNow, President Trump is doing nothing to address violent crime in  States with some of the highest crime rates in the country. In fact,  his administration has made things worse.\n\nTrump has opposed efforts to expand criminal background checks. He  has blocked attempts to reduce ghost guns and machine…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695557/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…indoctrinating them into the  cult of Trump.\n\nMr. Speaker, make no mistake. These attacks on the Department of  Education are deeply, deeply unpopular in every corner of the country.  In fact, two-thirds of Americans oppose them. They oppose them because  families from all walks of life rely on the Department of Education to  meet their children's needs.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…Government, especially in these dangerous jobs.\n\nI am so fortunate to represent Washington's Eighth Congressional  District. We have some of the most stunning nature in the country. In  fact, we have the North Cascades National Park, Mount Rainier National  Park, and two national forests stretching over 2 million acres. That is  a fifth of the national forest,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…bring down prices for  families. He has failed to keep Americans safe. He has failed to heal  or even attempt or pretend to address the deep divides that plague this  country. In fact, he is making them worse.\n\nWorse still, he has refused any kind of accountability for the  countless mistakes that he, Elon, and the crew have made over the past  100…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690634/trumps-first-100-days"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…president and is a  federal employee. There are residency requirements for government  officials in federal law, D.C. law and the laws of jurisdictions  throughout the country. In fact, several states have laws that require  the top official in their National Guard to reside in the state, and it  is highly likely that every state and territory only appoints…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694307/introduction-of-the-district-of-columbia-national-guard-commanding-general-residency-act"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…energy dominance and  independence. The U.S. is still the number one producer of oil and gas  in the world and has been since 2009. We are producing more oil than  any country ever.\n\nIn fact, we are exporting energy, which is what is really hurting  American energy prices. This rule didn't even meet the threshold to  require a Statement of Energy Effects…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688635/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…of the worst. They sold drugs  and said they were going to shove it up their noses. He wasn't killed.  He shouldn't have been killed. He was tried. He was from another  country. In fact, he was the President of another country.\n\nHe was tried in a court of law, and he was convicted by a unanimous  jury. He is on the streets today. Why? Because the President…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…executive orders, countless rescissions that have  come out of the White House, not one has been directed in terms of  lowering the cost of living for Americans in this country.\n\nIn fact, last week, the Consumer Price Index was released. It showed  that prices jumped again at 2.8 percent, well above the Federal  Reserve's target of 2 percent, which is…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689376/cost-of-living-still-high"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…is a  couple of miles or more from an open road, the odds that elk live there  are really, really high. So it is almost like the roadless rule was  written for elk country because, in fact, it was.\n\nAnd if you like to catch wild trout that have never seen the inside  of a hatchery, you are probably familiar with some of the roadless  refuges where these…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…60-year-old couple to pay over $16,000 more annually for  coverage.\n\nNow, in my district and in my State, we have some of the best service  records of veterans in this entire country. In fact, we are home to the  Code Talkers. We are home to folks who have served our country with  pride and with dignity for so many years that when I look at the cuts  that are…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688084/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Black Caucus. In fact, they are of great  importance to our constituents and to all Americans.\n\nWhen I think about this day, as many of us will be traveling all over  the country--in fact, I am going to be in the hometown of  Representative Kennedy to celebrate Martin Luther King Jr. Day I think  on the 18 of this month--I am thinking tonight about King's…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…ago, I was there. There is almost no  Israeli that hasn't seen a mom, a dad, a son, a grandson, granddaughter  that hasn't been either injured or killed to protect their country. The  fact that we are disparaging our greatest ally at this level is  completely outrageous.\n\nI had plans to go home, see my wife and kids, but I rose today  because I cannot stay…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690859/gaza"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Mr. Speaker, I am going to take a few minutes in the time  that I have remaining to talk about another issue that is critical to  the State of Texas and this entire country.\n\nThat is the fact that America, Texas, and Western civilization are  under attack from within. The cheap labor lobby, leftwing NGOs, radical  progressive Democrats, Marxists, globalist…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Markwayne Mullin", "party": "Republican", "sentence": "…streets, that are killing our  families, that are killing our friends, that are affecting all of our  homes and all of our streets in all of our States all across the  country--in fact, to the tune that there have been more people killed  in 2024 by drug overdoses--the sum of 10,000 more individuals--than we  lost in U.S. personnel during the entire…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698424/unanimous-consent-requests-the-calendar"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…people have jobs.\n\nMr. Speaker, one more time before I leave here, I beg my leadership  to do something about what I still believe is the number one problem in  this country. That is the fact that we have many programs, most of  which originated in the 1960s, which are designed to incentivize  families to form without a father in the family. There are…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…opportunities if a solicitation on which they made an offer  is canceled so that they can go after these opportunities.\n\nSmall businesses create most of the new jobs in this country. In  fact, in Missouri's Fourth Congressional District and in rural  communities across America, they are the lifeline and fabric of our  communities, but time and time again,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691762/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…get appointments because now there is a whole new  population that is looking to get into the system and doing so in a way  that has no precedent anywhere else in the country.\n\nIn fact, in many cases, it actually costs the State more money to  provide Medicaid to a person who is in the State illegally because,  number one, there is no Federal funding…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}]