[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…are willing to join us in protecting our Nation's  healthcare.\n\nAllowing these tax credits to expire is, indeed, a choice, and it is  the wrong choice. Our communities are counting on us to do the right  thing and to put their needs over politics. It is people over politics.\n\nMs. McCLELLAN. Mr. Speaker, I thank our chair for her tireless  efforts to…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…fight with  him. I am glad to call out the egregious giveaway to billionaires and  big corporations being orchestrated in this Republican tax bill.\n\nThe $4.5 trillion--and counting, counting because we do not have the  full CBO score as this bill is being jammed through the House--is what  we are talking about. That is what Republicans are preparing…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691687/providing-for-consideration-of-hr-one-big-beautiful-bill-act"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…dysfunctional, and divisive they are.\n\nMy dear friend, the late Elijah Cummings, with whom some of you  served, said: ``We are better than this.''\n\nThe American people are counting on us to be better than this. We  ought to be debating legislation to bring down costs, to pay our debts,  and to fix our broken immigration system.\n\nInstead, MAGA Republicans…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690942/gulf-of-america-act"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…and       Musk took over I don't know from one month to the next what       might happen. So scary now!\n\nThis is what Donald Trump and Elon Musk are doing to people who are  counting on Social Security.\n\nOr another:\n\nI only get $25,000 yearly from Social Security, and it       constitutes more than half of my income. I have a small       pension from the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690633/nomination-of-frank-bisignano"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…responsibility to act and finally make healthcare  affordable for all Americans because a single mother in Lauderhill who  is rationing her medication to keep the lights on is counting on us.  The disabled veteran in Riviera Beach who is working two jobs is  counting on us. The recent college grad in Tamarac who makes enough  money only to pay rent is counting…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698415/we-must-extend-aca-tax-credits"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…break down two things with the bill. First, it allows startups  to discuss their products and business plans at certain events known as  demo days without such discussions counting as a general solicitation  under our securities regulations and, therefore, as an investment  offering necessitating SEC registration.\n\nSecond, it defines what an angel investor…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692724/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…research. The       vast majority was not reported to the FEC. As explained in       the methodology below, this study's dark money total of $1.9       billion avoids double counting the small amount of spending       that may be included in both data from the Wesleyan Media       Project and FEC data.\n\nFederal rules only require certain campaign ads to…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…in just 8 weeks since Trump has been back in office amounts to  a total betrayal. He has already fired more veterans than any other  President in modern history--6,000 and counting--for no apparent  reason, forcing the bravest people you and I could ever meet to have to  worry about how they are going to put food on their family's table next  week or…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688892/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…retirement.''\n\nMr. Speaker, these are just three stories from about 16,000 in my  district, and there are millions just like these across our country.  Our constituents are counting on this body to lower their costs and  save their healthcare.\n\nMr. Speaker, I urge an ``aye'' vote.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698787/breaking-the-gridlock-act"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…Rochester, and Reed, to make a motion to recommit the bill to the  Committee on Appropriations of the Senate with instructions to report  the same back to the Senate in 3 days, not counting any day on which  the Senate is not in session, with changes that--(1) are within the  jurisdiction of such committee; and  (2) would ensure that no recipient of funds from…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693619/hr-4"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…1. A motion to recommit the bill H.R. 4 to the Committee on       Appropriations of the Senate with instructions to report the       same back to the Senate in 3 days, not counting any day on       which the Senate is not in session, with changes that--\n\n(1) are within the jurisdiction of such committee; and\n\n(2) would strike any rescission of funding…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693615/hr-4"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…cancer, Parkinson's, ALS, Alzheimer's, and so many  other devastating diseases. I felt the pain and hope of patients,  grandparents, mothers, fathers, and children who are counting on the  next clinical breakthrough to survive. These cuts say to them: Your  health doesn't matter. Your life doesn't matter.\n\nPresident Trump, unelected billionaire Elon…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…demanding that the administration follow the law and  release this funding. House Democrats will continue to do everything  that we can to make this right for the families who are counting on us  every day.\n\nThere is no legitimate reason that any child or family in this  country should have to personally deal with program closures and larger  class sizes. That…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693588/americans-have-a-right-to-a-quality-public-education"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…framework--requires mutual  funds and other investment vehicles that invest in BDCs to disclose the  management fees, expenses, and AFFE of the BDC itself.\n\nThis has the effect of double-counting BDC expenses, because BDC  costs are already factored into their share price and returns. By  adding them again as acquired fund fees, the SEC rule artificially  inflates…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697831/increasing-investor-opportunities-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…Appropriations:\n\nMr. Bennet moves to recommit the bill H.R. 4 to the       Committee on Appropriations with instructions to report the       same back to the Senate in 3 days, not counting any day on       which the Senate is not in session, with changes that--\n\n(1) are within the jurisdiction of such committee; and\n\n(2) would strike provisions that prevent…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693642/hr-4"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…of the people in Texas who have come together under the cross  that stands up on that hill in Kerrville and the people who have  generously contributed now $150 million and counting that are going in  to help those people, and the first responders who showed up on the  scene and the people like my friend and the former sheriff, my buddy  from Louisiana,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…Coons moves to recommit the bill H.R. 4 to the       Committee on Appropriations of the Senate with instructions       to report the same back to the Senate in 3 days, not counting       any day on which the Senate is not in session, with changes       that--\n\n(1) are within the jurisdiction of such committee; and\n\n(2) would prohibit the Director of…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693657/hr-4"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…have record amounts of  growth.\n\nOur version of the bill only accounts for about 2.6 percent of  growth. Some of these agencies are accounting for only 1.8 percent  growth counting toward the calculations in this bill. If we are not  accounting for robust growth, which I think we will get, then we will  have an unclear picture, which is why I am leaning…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…anything they want from the American people and  force Americans to bow to their will.\n\nSomali immigrants in Minnesota were recently caught stealing more  than 1 billion and counting from American taxpayers--stealing. They  pretended to use the money to feed children or help people with autism,  but really they were stealing. They were stealing the money…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…election day voting, and  proof of identity.\n\nIn recent years, in many States, the woke left has torn down these  safeguards. Mail-in ballots where there is no chain of custody,  counting ballots weeks after election day, counting ballots in secret,  ballot harvesting, same-day registration, turning election day into  election month, and forbidding proof of…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690012/safeguard-american-voter-eligibility-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…the gentleman from Kentucky (Mr.  McGarvey), the gentlewoman from New York (Ms. Velazquez), and the  gentleman from New York (Mr. LaLota).\n\nH.R. 1816 prohibits agencies from counting self-certified women-owned  small business contractors, otherwise known as WOSBs, toward an  agency's women-owned small business contracting goals.\n\nThe committee has repeatedly…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691798/wosb-accountability-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…order to vote is a  needed corrective. I believe, in my State, it will complement other  initiatives that we are advancing now to require voter ID and to have a  timely vote-counting process in order to restore public confidence in  our election process.\n\nWhat is at stake is not only election integrity and election security  but democratic legitimacy,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689999/safeguard-american-voter-eligibility-act"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…11th District who needed help navigating  Washington's vast alphabet soup of agencies and departments.\n\nWe did some calculation, and during her time in my office alone, not  counting her time with Congressman Pitts, Joanne helped more than 7,500  individuals and secured over $46.8 million in savings and benefits that  were rightfully owed to the people…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698569/recognizing-and-thanking-joanne-horn"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…that any form of government will secure       liberty or happiness without any virtue in the people, is a       chimerical idea.''\n\nThe American people who elected us are counting on us to live by  those standards. National Character Counts Week is a good time to do  what is right.", "date": "2025-10-20", "source_url": "https://justfacts.votesmart.org/public-statement/1696289/national-character-counts-week"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…have fought to protect similar exemptions for students from family  farms and small businesses. Last year, new FAFSA provisions altered the  Federal formula for student aid, counting assets in small businesses  and family farms as part of the family's net worth. My Family Farm and  Small Business Exemption Act seeks to correct this flaw and to level  the…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690715/help-small-businesses-thrive-again"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…to pay for it.\n\nCBO says that when we finish this fiscal year, U.S. debt will be at  $37.2 trillion. We have to take to market this year in just  refinancing--and I am not counting the short roll on the short end of  the curve if you want to geek out. I think we are going to bring $9  trillion to market. We are probably going to bring another $2 trillion,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…flourishing. It will add  $25.3 billion to the U.S. GDP and support more than 128,000 full-time  jobs. President Trump and Secretary Rollins support this effort. Rural  America is counting on us to deliver.\n\nMr. Speaker, please join me, and let's get this done.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699351/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…DeLauro. If the communities  want these, that is fine. They ought to pay for them. I don't know  whether my colleague realizes it or not, but we are $39 trillion in  debt and counting. Let me just give my friend examples of some of the  things she may have not thought about.\n\nWe have $1,599,000 for Eastern Maine Healthcare Systems. It operates  a pediatric…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699289/amendment-no-1-offered-by-mr-massie"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…January  1. A family making $75,000 a year won't feel its taxes rise $1,500, so  it won't feel relief from this provision. We don't feel what doesn't  happen.\n\nDemocrats are counting on this fact while stoking class resentments  over tax breaks for millionaires and billionaires, but millionaires and  billionaires don't work for tips. They don't get paid…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693629/democrats-big-mistake"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…U.S. Senate, beginning in 1981. It is a privilege to represent Iowans  and my home State here in the greatest deliberative body in the world.\n\nFor more than four decades and counting, I have joined my colleagues  here in this Chamber to debate public policy, shed light on wrongdoing,  and celebrate historic milestones. I have cast votes on behalf of  Iowans,…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691703/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}]