[{"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "Our country could not have a better neighbor or trading  partner than Canada.", "title": "Relating to A National Emergency By the President on February 2025", "date": "2026-02-11"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "Speaker, across New Jersey and our country, Americans  are struggling with skyrocketing energy costs and are demanding relief.", "title": "Providing for Consideration of H.R. Energy and Water Development and Related Agencies Appropriations Act, Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Miles City Field Office Record of Decision and Approved Resource Management Plan Amendment''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``North Dakota Field Office Record of Decision and Approved Resource Management Plan''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Central Yukon Record of Decision and Approved Resource Management Plan''; and for Other Purposes", "date": null}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "This is a devastating  moment for transgender youth, their parents, and their healthcare  providers across the country.", "title": "Protect Children's Innocence Act", "date": "2025-12-17"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "States across the country       have enacted policies like these because many believe that       holding law enforcement accountable for abuse of power and       racial bias can deter misconduct.", "title": "Opposition Letter By the Naacp Legal Defense and Educational Fund, Inc. on the Common-Sense Law Enforcement and Accountability Now in DC Act of 2025 (H.R. and the District of Columbia Cash Bail Reform Act of 2025 (H.R.", "date": "2025-11-19"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Without it, hospitals  operating on thin margins will close, medical debt will skyrocket, and  kids across the country will suffer.", "title": "Medicaid is America's Healthcare Safety Net", "date": "2025-04-29"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "Medicaid is the country's single-largest payer of both mental health  and substance use services, and it is on the chopping block if my  Republican colleagues' budget bill is signed into law.", "title": "Support for Patients and Communities Reauthorization Act of 2025", "date": "2025-06-04"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "Speaker, across the country, food banks are facing  an urgent crisis, and Delaware is no exception.", "title": "Food Banks Facing Urgent Crisis", "date": "2025-03-25"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "As you know, there were cuts,  but we are providing money there to make sure that we fight the threats  to our critical infrastructure that we are seeing across the country.", "title": "Department of Homeland Security Appropriations Act, 2026", "date": "2026-01-22"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "The Treasury's decision to put Donald  Trump's face, a living President, on our currency is illegal and  reminiscent of a monarchy, which 250 years ago our country firmly  rejected.", "title": "For America's 250th Act", "date": "2026-02-09"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "Every young person  in Hawaii and across this country just needs a chance.", "title": "Opposition to Job Corps Closures", "date": "2025-06-05"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Last month, DOGE decided unilaterally to cancel more than $500  million of Department of Justice grant funding for local law  enforcement, public safety, and crime prevention programs all over the  country in our communities.", "title": "Federal Law Enforcement Officer Service Weapon Purchase Act of 2025", "date": "2025-05-15"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "John McCain, an  extraordinary man, served this country in ways that we could hardly ask  anyone else to serve: a prisoner of war for over 5 years during  Vietnam, came battling back, and was elected to the U.S.", "title": "Establishing the Congressional Budget for the United States Government for Fiscal Year 2025 and Setting Forth the Appropriate Budgetary Levels for Fiscal Years 2026 Through 2034", "date": "2025-04-03"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "Fairfax County is regarded as one of the best places  in the country in which to live, work, and raise a family, and our  nationally recognized park system has played a key role in that  distinction.", "title": "Recognizing the 2025 Elly Doyle Park Service Awardees", "date": "2025-10-06"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "Many people in this country will lose everything.", "title": "Protecting Healthcare for Millions of Americans", "date": "2026-01-08"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "This is an issue that could actually bring this country together to  say that a Nation in which rich and powerful men can rape young girls  without consequence is a nation that has lost its moral and spiritual  soul.", "title": "Providing for Consideration of H.R. Energy and Water Development and Related Agencies Appropriations Act, Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Miles City Field Office Record of Decision and Approved Resource Management Plan Amendment''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``North Dakota Field Office Record of Decision and Approved Resource Management Plan''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Central Yukon Record of Decision and Approved Resource Management Plan''; and for Other Purposes", "date": null}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Pat has dedicated himself to faithfully  serving our community and country.", "title": "Recognizing Congressional Patriot Award Recipient Pat Terrell", "date": "2025-07-23"}, {"senator": "David Valadao", "party": "Republican", "sentence": "As a Representative of one of the most agriculturally rich districts  in  the country, it is my constituents who are responsible for putting food  on everyone's table.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-02-25"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Simply put, we need to work with the Trump  administration to make it easier to build in our country so that free- market investment for the electric supply chain flow into communities  across the country, driving economic growth and creating good-paying  jobs for households.", "title": "Electric Supply Chain Act", "date": "2025-12-10"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "It is my honor to recognize Tom Crowley for his decades of dedicated  service to his community, his country, and his family, and for his  lasting commitment to strengthening Royse City and Rockwall County.", "title": "Recognizing the Success of Tom Crowley", "date": "2025-12-17"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "Today, KA's across the country continue to make a meaningful impact  through ongoing charitable work, campus leadership, and a lifelong  commitment to honor and duty.", "title": "Recognizing Kappa Alpha Order's 81st Convention", "date": "2025-07-02"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Speaker, as the father of five, with my youngest  daughter attending her very first cross-country practice today, I rise  to commend the remarkable work of Active4Youth, a community-supported  nonprofit that is transforming lives in Spokane.", "title": "Operation Rolling Thunder", "date": null}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "Speaker, it is my distinct privilege to rise today  to present Christopher Aaron McGowen of Nacogdoches, Texas, as a  recipient of the 2025 Congressional Veteran Commendation in recognition  of his outstanding service to both his country and his community.", "title": "Recognizing Christopher Aaron Mcgowen with A Congressional Veteran Commendation", "date": "2025-10-17"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "My friends from the left, the minute the Biden administration took  office, opened the gates for over 170 different countries to let  everybody and anybody into this country.", "title": "Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Consumer Gas-Fired Instantaneous Water Heaters''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Waste Emissions Charge for Petroleum and Natural Gas Systems: Procedures for Facilitating Compliance, Including Netting and Exemptions''; and Providing for Consideration of H. Con. Res. Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-02-25"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "In the 1960s, about 5 percent of  the children in this country were born into families without both a  mother and father at home.", "title": "Breakdown of Traditional Families", "date": null}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "3, it directs the FAA to comprehensively evaluate the safety of  airspaces around airports across the country so that no other airspace  has the same risk of collisions that DCA did.", "title": "Rotorcraft Operations Transparency and Oversight Reform Act", "date": "2025-12-17"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "These  good Americans died at the hands of criminal aliens who should never  have set foot in our country.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Centers for Medicare Medicaid Services Relating to ``Patient Protection and Affordable Care", "date": "2026-01-13"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "Speaker, by creating a more focused regulatory approach for small  entities, the Small Entity Update Act will make it easier for  entrepreneurs across the country to achieve the American Dream.", "title": "Small Entity Update Act", "date": "2025-07-21"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "When his country called, Duane Brewton answered.", "title": "-9999", "date": "2026-02-12"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Speaker, as discussed, one of the major issues which caused the  housing affordability crisis in America is simply the fact of the last  4 years at least 10 million people have come into this country  illegally, and it has caused the reality that when you have too much  demand and not enough supply, prices go up.", "title": "Lowering Housing Costs and Advancing Main Street Community Banks", "date": "2026-02-09"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "Last week, tens of thousands of Americans of all  ages, from across the country, gathered in our Nation's Capital to  march for the most vulnerable among us: preborn children.", "title": "Statements on Introduced Bills and Joint Resolutions", "date": "2026-01-27"}]