[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "He managed our dear friend  Gerry Connolly's 2007 campaign for chairman of the Fairfax County Board  of Supervisors, and a year later he managed Gerry's successful campaign  for Congress.", "title": "Welcoming the Honorable James Walkinshaw to the House of Representatives", "date": null}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "This year, three officers from New Mexico are being added to the  National Law Enforcement Officers Memorial wall here in Washington:  Corrections Officer Roberto Rodriguez of Dona Ana County, Patrol  Officer Jonah Hernandez of the Las Cruces Police Department, and  Patrolman Justin C.", "title": "National Police Week", "date": "2025-05-15"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "5183, the District of Columbia Home Rule       Improvement Act, make the District less efficient,       competitive, and responsive to the needs of a highly complex       unique local government that serves local, county and state       functions.", "title": "District of Columbia Judicial Nominations Reform Act", "date": null}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "Hundreds of Maryland residents turned out for a town hall       meeting last week hosted by Baltimore County Council member       Pat Young about a mile from Social Security headquarters.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Office of Energy Efficiency and Renewable Energy, Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Commercial Refrigerators, Freezers, and Refrigerator- Freezers''", "date": "2025-03-26"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "Talented graduates come out of vocational education programs in my  district, like Coastline College in Fountain Valley, and have the  skills that small businesses in Orange County need.", "title": "Connecting Small Businesses with Career and Technical Education Graduates Act of 2025", "date": "2025-06-03"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "Sharon, in Thurston County, in my State--if Republicans refuse to  act, her premium is going to double, increasing by over $100 a month.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the United States Fish and Wildlife Service Relating to ``Record of Decision for the Barred Owl", "date": "2025-10-29"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "Specifically, our legislation would prompt State, county,  and municipal transportation departments to employ qualified, trained  corrosion control professionals who have completed federally registered  apprenticeship programs.", "title": "Introduction of the Bridge Corrosion Prevention and Repair Act of 2025", "date": "2025-06-26"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "I support the bill because I believe that the people of Otero County  and Bent County and Crowley County deserve access to clean water just  as every citizen of the great State that I serve and that Ms.", "title": "Finish the Arkansas Valley Conduit Act--Veto Message From the President of the United States", "date": "2026-01-08"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "Bishop Williams was born in Dougherty County, Albany, Georgia, to the  late Roosevelt Williams and Evangelist Katie Mae Anderson.", "title": "In Memory of Bishop Dr. Frederick Williams, Sr.", "date": "2026-01-30"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "Hydropower dams in my district are critical to keeping the  lights on and keeping the power flowing, and several, including the  Rock Island Dam at Chelan County PUD, are due for relicensing at the  end of 2028.", "title": "Hydropower Licensing Transparency Act", "date": "2025-07-14"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "On April  19, 2022, the Montgomery County Council introduced a resolution  affirming the county's support for this bill.", "title": "Francis G. Newlands Memorial Removal Act", "date": "2025-07-22"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "About 2 weeks ago, I went on a 14-county tour in rural Minnesota.", "title": "H. Con. Res. 14", "date": "2025-04-03"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "She began her service with the County of San Mateo and later joined the  San Francisco Veterans Affairs Medical Center where she rose to become  clinical director and chief nurse of Mental Health Services.", "title": "Recognizing Mary Ann Nihart", "date": "2026-02-04"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "The Republican agenda would dramatically increase premiums for more  than 198,000 Oregonians, including my constituent Teresa from Clatsop  County.", "title": "Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "It was also a great honor for the city and county of Orangeburg.", "title": "South Carolina State University Football Team 2025 Hbcu National Champions", "date": "2026-01-20"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "Benedictine College Preparatory School, located within Goochland  County, has made program history by capturing its third consecutive  VISAA Division I State Championship, defeating Trinity Episcopal 20-0.", "title": "Recognizing Benedictine College Preparatory School Football Team", "date": "2025-11-19"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "In Manti, I met with small business owners at a Sanpete County  Chamber of Commerce to talk about what this bill means to Main Street.", "title": "Promises Made, Promises Kept", "date": null}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "As former Commander of the Disabled American Veterans Twin Cities  Chapter 95, he spearheaded the Vietnam War 50-Year Commemoration in  Central Alabama, organizing the first ceremony of its kind in Lee  County in 2016 and ensuring hundreds of veterans were honored and  presented with commemorative pins and the public gratitude they had  long deserved.", "title": "Recognizing the Birthday of Wilbert D. Payne, Jr.", "date": "2025-07-15"}, {"senator": "John Joyce", "party": "Republican", "sentence": "In my district, I have had the privilege of visiting vocational  schools such as the Colonial Career and Technology Center in New Oxford  and the Bedford County Technical Center in Everett, and I am proud to  see President Trump continue to support the future of these talented  students with this executive order.", "title": "Repealing Green New Deal Policies", "date": "2025-04-28"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "Speaker, I rise today to recognize a distinguished  public servant from Hancock County, Mississippi, Brian ``Hooty'' Adam,  who will retire on December 21, 2025, after more than four decades of  serving his community.", "title": "Recognizing Brian ``hooty'' Adam", "date": "2025-11-18"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Speaker, I rise today to recognize and commend  Karry Hepting, the dedicated County Administrator of St.", "title": "Commending Karry Hepting for Her Exemplary Leadership and Dedication to St. Clair County, Michigan", "date": "2025-10-31"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Hernando County, and indeed  all of Florida, were fortunate to benefit from her decades of selfless  dedication.", "title": "Recognizing Mary Ann Keckler", "date": "2025-12-09"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "Following his service in Tallahassee, Mayor Bovo was elected to the  Miami Dade County Commission, where he served from 2011 to 2020.", "title": "Recognizing Hialeah, Florida Mayor Esteban Bovo", "date": "2025-04-28"}, {"senator": "Young Kim", "party": "Republican", "sentence": "Many of my constituents fled Vietnam in the Fall of Saigon and found  their new home in Orange County in southern California.", "title": "Recognizing Black April", "date": "2025-04-30"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "Greer  has helped shape the future of Cullman County through his steady  leadership, dedication to public service, and commitment to creating  opportunities for others.", "title": "Recognizing Mr. Dale Greer", "date": "2026-02-03"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "I also visited with SABIC, a company in Bartholomew County that is  part of a global plastics industry.", "title": "Return the United States to A Balanced Budget", "date": "2025-02-27"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Speaker, I rise today to recognize the  heroic actions of Deputy Hunter Thomas of the Ware County Sheriff's  Office, who recently saved a life through his quick thinking and  decisive actions.", "title": "Recognizing Hunter Thomas", "date": "2025-02-27"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "She also helped  establish the Victorville Wellness Center, the first facility of its  kind in San Bernardino County, which reduced the city's unsheltered  homeless population by fifty-seven percent and now serves as a model  for other communities.", "title": "Recognizing the Service of Debra Jones on Her Retirement", "date": "2025-10-21"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "Speaker, I rise today to recognize First Lieutenant  Duncan DeMarsh, a proud lifelong resident of Volusia County and an  outstanding young leader who will soon deploy for 1 year to the Middle  East with the Florida Army National Guard in service to our Nation.", "title": "-9999", "date": "2025-11-19"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "Speaker, I rise in strong support of legislation  honoring a man whose service and leadership left a lasting mark on  Rockland County and the town of Haverstraw.", "title": "Paul Piperato Post Office Building", "date": "2025-12-09"}]