[{"senator": "Sharice Davids", "party": "Democrat", "sentence": "…Drug  Control Policy, positioned within the Executive Office, ensures policy  neutrality, cross-agency alignment, and a whole-of-government approach  that is essential to countering complex drug trafficking networks.\n\nWhen it comes to HIDTA's great work, I speak with some experience.  For years, I have held fentanyl roundtables that bring together  educators,…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693340/recognizing-the-crucial-work-of-the-high-intensity-drug-trafficking-area-program"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…maintaining our democracy--but, also, to  the military itself, which is demoralized and potentially degraded by  the misuse of these resources that are designed to support them in  countering adversaries abroad, and, of course, to the faith and trust  of Americans in the military, as they see it misused.\n\nSo I want to ask my colleague from Oregon about perhaps…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696345/trump-administration"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…reauthorization, and the intel  community's reauthorization. Those are important to meet our national  security needs, as well.\n\nThere is also a very important component on countering UAS  domestically. The threat the drones pose to many of our military  installations and other sensitive areas in the country is a real  problem. This bill takes a step toward…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…dollars to  small businesses each year. However, many other factors, complexities,  and policies, like category management and overly strict past  performance requirements, are countering the impact of these programs.  As a result, the government has over 40 percent fewer small businesses  in its ecosystem than it did just a decade ago.\n\nThese trends mean…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687940/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…deep economic interests in Venezuela-- decide to block or back proxy groups in a country we have just  destabilized, nor have I heard any proposal for the next steps for  countering narcotrafficking.\n\nThe administration's goals are aspirational at best, and aspirations  are not enough when the stakes involve war and the future of millions  of people.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…over its proclaimed sphere of  influence or that Xi cannot exercise his will unchecked in the Indo- Pacific, including with respect to Taiwan? The United States should be  countering this vision of a world based on spheres of influence with  our own alternative of a stronger global order, not participating in  the destruction of the existing one by endorsing…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698621/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…all these problems with  healthcare, which is a fight that is raging right now, about this  budget, they can't handle it.\n\nTariffs, as I noted, can be an important tool for countering other  countries' unfair trade practices. I supported some of the steel  tariffs that were more narrow from the former Trump administration and  the Obama administration…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…for cities. It removes  the statutory requirement restricting participation in the program to  areas designated by FEMA. Instead, it requires Homeland Security's  Office of Countering Weapons of Mass Destruction to decide which cities  to partner with for the program based on the jurisdiction's capability  and capacity to prepare and respond to terrorist…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688698/securing-the-cities-improvement-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…continued security assistance  to our friends and allies throughout the world. It maintains some  effective projection of presence out there into the world. It funds the  Countering PRC Influence Fund that is so important to us.\n\nIn transportation, the Federal Aviation Administration, it funds the  FAA so that our air transportation system can continue…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699571/consolidated-appropriations-act-2026"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…what is happening and by whom in  sanctions evasion and money laundering investigations.\n\nWe need what this bill proposes because as the global anti-money  laundering and countering the financing of terrorism regime has become  increasingly effective in detecting and deterring the abuse of the  financial system, bad actors have often moved their transactions…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693941/ofac-licensure-for-investigators-act"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…around  DOGE and USAID--a lot of people are not tracking some of these funding  areas, but, for instance, this is about getting our message out in  Ukraine, this is about countering the Government of China's propaganda  in the Indo-Asia Pacific, and this is about people in Iran having  access to the internet through VPNs that we helped them to get.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…designated high-risk areas can change, and  they usually do.\n\nThis bill aims to improve the program's stability and strengthen  partnerships with at-risk cities by allowing the Countering Weapons of  Mass Destruction Office to select STC cities based on their  preparedness capabilities rather than UASI designations.\n\nThe bill, Mr. Speaker, also establishes…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688696/securing-the-cities-improvement-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…multinational  corporations that make the United States a destination for capital  flows in our country. They are a magnet for foreign direct investment.  They help us with countering terrorism. They give us a global  visibility that we wouldn't have if we didn't have large globally  important financial institutions that were forward positioned in other…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…down trade barriers. That means more exports, more jobs, and  stronger communities here at home.\n\nOn enforcement, ITA plays a vital role in confronting dumping  practices, countering illegal subsidies, and ensuring that foreign  competitors play by the rules. For too long, American workers were  undercut by countries exploiting loopholes, manipulating…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694342/confirmation-of-william-kimmitt"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Federation; or\n\n(C) any foreign person identified pursuant to subparagraph       (A) has been subjected to sanctions imposed pursuant to       sections 231 and 235 of the Countering America's Adversaries       Through Sanctions Act (22 U.S.C. 9525 and 9529).\n\n(b) Form and Availability.--\n\n(1) Form.--The report required by subsection (a) shall be…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690679/economic-espionage-prevention-act"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…Defense Intelligence  Enterprise, and the Defense Security Cooperation Agency have the tools  required to execute the Department's efforts in strategic competition  and in countering malign influences.\n\nAdditionally, I am extremely proud to have championed the SOCUM  Urgent Technologies and Capabilities Pilot Program which ensures our  special operators…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697804/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…reasons, I encourage my colleagues to support this rule,  which is the first step in ending our universities' appeasement of  China's crimes against the Uyghur people and countering China's malign  influence and espionage at our academic institutions.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690826/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…appropriate, shall submit to the       appropriate congressional committees a strategic plan (in       this subsection referred to as the ``Strategic Plan'')       relating to countering the threats identified in the threat       assessment, in accordance with paragraph (2).\n\n(2) Contents.--The Strategic Plan shall include, at a       minimum, a consideration…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696956/tren-de-aragua-border-security-threat-assessment-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…Members are going to go  check in with to get on a flight right now--they are not getting a  paycheck next week, although they are still working this week. They  defunded the Countering Weapons of Mass Destruction Office.\n\nListen, this is a big deal. We just had a shutdown of 43 days--the  longest in American history. Those TSA agents lost two paychecks…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700299/government-funding"}, {"senator": "James Risch", "party": "Republican", "sentence": "…weakest point in decades and hostages are returning  home.\n\nIsrael is one of America's greatest allies, a bastion of freedom in  the Middle East, and our closest partner in countering Iran's  destabilizing efforts in the region.\n\nTo execute on President Trump's ironclad support of Israel, we  urgently need a qualified ambassador in the region. I have no…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689827/9999"}, {"senator": "Bill Hagerty", "party": "Republican", "sentence": "…address  Iran's nuclear weapons program last weekend didn't start a war; they  ended a war. So I rise today to support President Trump's wisdom and  leadership in decisively countering Iran's nuclear threat and,  therefore, to oppose this ill-conceived joint resolution.\n\nAs a U.S. Senator and former Ambassador to Japan, I understand and  respect the role…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693130/motion-to-discharge-sj-res-59"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…Enterprise, and the security cooperation  enterprise with the tools required to ensure their capabilities can  support the Department's efforts in strategic competition and in  countering malign PRC actions.\n\nThis bill supports critical platforms like the V-22 and the MV-75,  which are assembled in Texas' 13th Congressional District. This  legislation also…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695148/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…elections, freedom of association, an independent and       accountable judiciary, an independent media, public-sector       transparency and accountability, the rule of law, countering       malign influence, and anti-corruption efforts and to impose       swift consequences on individuals who are directly       responsible for leading or have directly…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…intellectual  property, or threaten our immigrant population.\n\nThis Congress, I have partnered with my colleagues on other  legislation in this area. My bill, the bipartisan Countering  Transnational Repression Act, continues this important work by stopping  Chinese Communist Party surveillance and intimidating Chinese nationals  on U.S. soil.\n\nWe have…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690825/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…Patients and Communities Act  programs from 2018.\n\nMr. Chair, we are facing an epidemic of fentanyl overdoses in this  country and this bill provides meaningful steps in countering them. The  programs that this bill reauthorize provide naloxone for first  responders, funding for prevention programs, funding for treatment  programs, funding for recovery…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691879/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…in the global  fight for freedom and democracy. Ms. Boyajian's stewardship has upheld  and enhanced this legacy, positioning the institution as an  indispensable force in countering authoritarianism and fostering  democratic renewal worldwide.\n\nHer leadership and commitment will be missed greatly at Freedom  House, as her mark of excellence will be recorded…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700047/recognizing-the-service-of-annie-wilcox-boyajian"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…around Taiwan, threatening sanctions against Taiwanese industries, and  relentlessly targeting Taipei with economic and political intimidation.\n\nIf we are serious about countering the CCP's ambition to displace the  United States as a global leader, then we have to act with clarity and  conviction. That starts with standing firm alongside Taiwan. We…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690686/taiwan-assurance-implementation-act"}]