[{"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…misrepresent the history of this.\n\nIn 1915 and 1916, Carter G. Woodson started trying to get our country  to recognize what he called Black History Week. He finally got the  country in, I think, 1926 to recognize it. It became Black History  Week.\n\nWhen I was a student, that is when we celebrated it. I want the  Record to be clear because I want our history…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…to be able to not  only respond to the fentanyl crisis that we have certainly seen in our  country--we have seen it in Maryland, and we have seen it all across  the country--but I think the urgency of the moment requires to some  extent that we are able to walk and chew gum.\n\nWe have to fight fentanyl, but we also have to respond to the  devastation…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689471/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…this and pay attention because they will  never, ever fully fund Medicaid, universal school meals for every  hungry child, or guarantee healthcare as a human right in our country.  I think maybe it is because many of my colleagues in this Chamber are  actively profiting financially when they vote to pass more funding for  weapons and war because they own…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695276/taxing-excessive-ceo-pay"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…war. I happen to believe that  the United States engaging in a war against Iran--a third war in the  Middle East since 2001--would be a catastrophic blunder for this  country.\n\nI think there are some in this body who have a different point of  view than I on this point, but I think we should all be able to agree  in the fundamental constitutional principle…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…about it. Let's do what a  majority of the States have done. Let's make this a nationwide program.  A compulsory ignition interlock device is saving lives across the  country. I think it is in 31 States now and in the District of  Columbia.\n\nWhy don't we do that? Why don't we do something real, rather than  talk about cases that have nothing to do with…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693082/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…American people are paying attention.\n\nI will tell you it is clear from conversations with my constituents  in western Pennsylvania, and I know from people all over this country,  they think our system is rigged: rigged against hardworking people,  rigged for giant corporations and the rich and the powerful. That kind  of corporate power doesn't just happen.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691217/stock-trading-ban-for-members-of-congress"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…Speaker may claim that it is just a matter of schedule, but once  again, clearly, the gulf in America is between what Americans--the  people who live in D.C. and most of the country--think is important and  what House Republicans are willing to do.\n\nMr. AUSTIN SCOTT of Georgia. Mr. Speaker, I would remind you that the  Chinese Communist Party is no longer…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…It  took a few years to get our Constitution that we now have in place-- 1787. But we have been striving toward this vision in which everyone is  empowered in this country.\n\nI always think about how the foundation of the law is carved into the  facade above the Supreme Court pillars, and it says ``Equal Justice  Under Law.''\n\nYou know, the very first…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…deliberate effort this was  for years to take away their power and place it in the hands of the  wealthiest and, unfortunately, the most obscenely greedy people in this  country who think only they have the wisdom to govern.\n\nI thank the gentleman for giving me the opportunity to highlight how  Citizens United has impacted not just the political landscape…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699234/restoring-election-integrity"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…tied.'' That is the result of the kind of strict abortion ban  Republicans have imposed on Texas women that some here want to impose  on all 50 States and all women in our country.\n\nI think the death certificates for so many other women who have been  denied treatment for pregnancy complications should really read the  truth, which is ``Cause of Death: Republican…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699233/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…people think they are? We are Americans. We  ought to be able to choose whatever we want to, yet they tell us what  we can have and what we can't have. I am not sure what country you  think you live in or what it should be, but it shouldn't be this.\n\nMr. Chair, I still urge adoption of this amendment, and I yield back  the balance of my time.\n\nMr. PERRY.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…powerful: If we live by it  not just on October 1, as the resolution calls for, we can break the  cycle of abuse, strengthen families, and build a safer, more respectful  country.\n\nI think, at this point right now in our Nation's history, we could  all use that. I urge my colleagues to join me in passing this  resolution. Together, let's honor survivors,…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695990/supporting-the-goals-and-objectives-of-choose-respect-day"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…whatever the case may be--repeatedly say in overwhelming numbers that  the political divisions in this country are a serious problem.\n\nI believe it is weakening us as a country, and I think we need to  find opportunities to come together. We need to be looking for common  ground. The fact that we had one side that came to Tuesday's speech  intent on finding…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…step forward in the  process of strengthening the integrity of our elections, increasing  Americans' confidence, and garnering additional voter participation  across the country.\n\nI think it is relevant to also note that last Congress this bill came  before us, and 52 of our Democratic colleagues voted with every  Republican in the House. It will be interesting…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692319/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…organizing community events, or just being someone to  lean on, Bobby is always there. His efforts exemplify the very spirit  of the American Legion--``For God and Country''--and I could think of  no one more deserving of this tremendous honor.\n\nMr. Speaker, I ask my colleagues to join me in congratulating my good  friend, Bobby Brite, on this incredible…", "date": "2025-04-14", "source_url": "https://justfacts.votesmart.org/public-statement/1690118/recognizing-bobby-brite"}, {"senator": "French Hill", "party": "Republican", "sentence": "…brokerage, and all  through that time, the protection of our seniors was top of mind by  leaders in all those enterprises. Yet, we still have this terrible  problem across our country.\n\nI think having this point person at the SEC will make it more  responsive, more effective, do better training, and take better  planning actions to protect our seniors.\n\nMr.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693935/national-senior-investor-initiative-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Here in Congress, I have introduced legislation that will preserve  Medicaid benefits in California and across the country for only those  who are legal residents of our country. I think we also have an  opportunity to rein in what Governor Newsom is doing through the  reconciliation process, and I look forward to doing that in order to  protect Medicaid…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…ancestry is in Europe.\n\nIn any event, the way we consider things now, none of the top ten are  primarily European. As far as people saying that we have this horribly  racist country, I think it would be odd for a racist country to let the  ten most common nationalities to come here, all what our leftwing  friends would call people of color.\n\nIn any event,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…was vastly  different even inside the United States. At that time one State doing  something didn't have the impact or the ripple effect that it has today  across the country.\n\nI think we ought to vote ``yes'' on this resolution. I strongly  encourage all my colleagues to vote ``yes'' on H.J. Res. 89. I think it  is the right policy for all the reasons…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690434/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}]