[{"senator": "Kim Schrier", "party": "Democrat", "sentence": "…emergency room. We lose the ability to be seen quickly in the event of  an emergency because somebody who could have been taken care of by a  primary care physician a couple of days earlier with an uncomplicated  illness is now in the emergency room ahead of you in line, making you  wait when you are having a heart attack. That is completely preventable…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…the audacity of working to protect the health of  Californians and for having the audacity to lead the clean energy  economy.\n\nBut as I have said repeatedly over the last couple of days, it is not  just what Donald Trump's EPA and Senate Republicans are doing that is  problematic; it is how they made this possible--by fundamentally  changing how the Senate…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…appointment to receive at least an interview about her Social Security  benefits. You would think that we would be delighted that appointment  is going to happen in a couple of days, but this is also bad news  because she had actually reached out to our office in February and is  now getting an appointment in January.\n\nThat is 11 months since she reached…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697218/recognizing-bishop-michelle-c-thomas"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…today, consistent with what he did then.\n\nI am going to conclude and just say this: I know everybody in this  body is praying that the cease-fire that is in place now, for a couple  of days, works and that it holds.\n\nI know everybody is praying that when the administration now says  they are interested in a diplomatic resolution to this program, that  they…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…that get their materials or send their finished products to China.\n\nMany of them are small American businesses. We have seen and heard  from many of those over the past couple of days. I have been listening  to some who are toy manufacturers. They talk about what has happened to  their companies on the radio. They are concerned about what might  happen…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…$300,000  a year for his stage IV lung cancer drugs.\n\nBy the way, even as I am telling these stories, there are 22 million  of these stories that are all about to unfold a couple of days before  Christmas, when people have to figure out how big that new check is  that they have to write to get the coverage which they need.\n\nI will just tell you one final…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…want  to kind of break down and put in the Congressional Record what has  actually transpired over the last 72 hours.\n\nI think many of us were shocked when we saw just a couple of days ago  when, on Tuesday at 1:30, Elon Musk tweeted the following. He said:  ``I'm sorry, but I just can't stand it anymore. This massive,  outrageous, pork-filled Congressional…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692039/consequences-of-doge"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…again at 2.8 percent, well above the Federal  Reserve's target of 2 percent, which is why interest rates are going to  continue to stay unnecessarily high.\n\nOn Wednesday, a couple days from now, so-called Liberation Day, he is  now going to announce another wave of tariffs that every economist of  every stripe will tell you is going to, in fact, raise…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689376/cost-of-living-still-high"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Washington--reaching record levels and above record  levels and impacting flooding throughout the region.\n\nWe, obviously, had another weather event last night, and the last  couple of days have had what some people described as 50 to 60 miles  per hour winds that ultimately, in some places in the State, were  recorded at 90 miles per hour winds. So, this…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…felt. It is  already being felt on Wall Street and the stock market. Target's CEO  said this morning that the consumer ``will likely see price increases  over the next couple of days.'' And for small businesses, these tariff  taxes will be felt by small businesses in all of our States.\n\nI was here, a month ago today, sharing stories from businessowners…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…and more families pay the price.\n\nOur communities need economic certainty, not higher prices, not pink  slips, not utter chaos, and not tariff regimes that change every couple  of days. America needs a trade and tariff regime that yields good jobs,  well-paid workers, and prices for cars, trucks, and consumer goods that  Americans can afford to buy.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…and just give a snapshot of  what is happening back home.\n\nIt is still pretty cold, still have a fair amount of snow. Anchorage  just got a bunch of snow that lasted a couple of days. The 53rd  Iditarod just concluded in Nome with a stunning first-time win by  Alaskan Jessie Holmes and his 10-dog sled team.\n\nThe Iron Dog Race, that is a snow machine…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…The fourth jobs report in a row exceeds expectations.\n\nA sample of the headlines: Lowest monthly border encounters in U.S.  history. We closed the border.\n\nIn the last couple of days, there was a new trade deal with Vietnam,  and all the countries around the world are lining up for that.\n\nUPenn agrees to ban biological men from women's sports, and they…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…effective safety  intervention than wearing a seat belt, which, of course, you should  continue to wear a seat belt as well.\n\nThere was an article in The New York Times a couple of days ago from  a doctor who actually likened this to a clinical trial, where you  actually have to stop the trial because the drug performed so well and  it becomes unethical…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…idea. Brokers are going to prison right now because they have been  signing up folks in the system.\n\n``ObamaCare Is a Mecca for Fraud,'' The Wall Street Journal from just  a couple days ago. ``Open Enrollment is Healthcare's Most Expensive  Lie.''\n\nHow many more studies do we need to explain that you are being  defrauded, Mr. Speaker?\n\nIf this were helping…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…problem, and that telling the truth  about it--how do you say it?--oh, yeah, gets the crap kicked out of  you? Let's have at it, though.\n\nPresident Trump stood there just a couple days ago, and within his  speech, when you talk about some of the policy to help our brothers and  sisters in this country, there was the discussion of no tax on tips, no  tax…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…money, handing things out, telling people there  are no consequences, and making crap up, saying it is healthcare for  illegals. Okay, we shouldn't do that, but it is only a couple of days  of borrowing over 1 year.\n\nWe have to do lots and lots of difficult things. We have done entire  presentations where we have shown we could revolutionize the cost of…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Then there is this. I'm trying to help folks understand the reality  of what your Federal Government is.\n\nDo you see the blue area? This is defense and nondefense. In a couple  of days, we are actually going to get an update, and my team actually  thinks that this number will go from 26 percent of being, what we call,  discretionary to maybe down to…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…a number of these articles that I have here, but you still  have to do the math.\n\nThe fraud, just to give you an idea of the scale of our Nation's  borrowing, is only a couple of days of borrowing. How do I help people  understand the perspective of the scale and the fact that everything  that we as Members of Congress vote on is borrowed?\n\nIf you told…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…for the exact same levels.\n\nThe continuing resolution from March of this year is the exact same  levels as the Biden spending levels. What are we going to vote for in a  couple of days here? The Biden spending levels again. What does that  lead to? Two trillion dollars in deficit.\n\nSo every time we vote for a continuing resolution, for continuing the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…may have gotten through. I  think they called us. But just remember what I said. They shot missiles  at us today. They shot missiles at Israel last night.\n\nThe strikes a couple of days ago were designed to shut down the  enrichment facilities used to make this weapons-grade uranium. I think  we were substantially successful, and I have never been more…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…the bill. We have reached an agreement, and, in fact, the  House has already passed it. We are going to be considering that bill,  the Energy and Water bill, here in a couple of days. I just wanted to  quickly--I will speak more later, perhaps--I just wanted to quickly  highlight what we are going to be voting on here in the next couple  days.\n\nThe…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…reading the articles that a third, 30  percent of those in the enhanced ACA subsidies--so the subsidies on top  of the subsidies--didn't even know they had health insurance.\n\nA couple days ago, you saw someone got convicted of or pled guilty to  a couple hundred million-dollar fraud  scheme where they were signing people up, getting the money, getting  the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…much is borrowed. I want to cut more spending, but then you attack  us when we try to actually point out misalignment, bad acts.\n\nWhat was the report that just came out a couple days ago, where we  found 2.8 million of our brothers and sisters enrolled in subsidized  ACA plans as well as Medicaid plans.\n\nThey don't want to talk about that because it…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…emphasize the fact  that if you pass this now--again, to the Senator from Michigan, I am  literally begging him: Do not object. Do not object. It is still going  to take a couple of days to actually pass this. If we have to go the  route of a motion to proceed and getting on the bill, that is going to  take quite some time. Our skies can't remain at this…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…caught, right?\n\nMr. Speaker, I am going to try three things tonight. I will upset a  number of folks. I am sorry. My math will be accurate because we have  spent the last couple of days double-checking it.\n\nI am going to try to do something a little insane. I am going to walk  folks through the Social Security actuary report. We are just going to  do some…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}]