[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…electric interfered with the  impulse of Big Oil to sell more gasoline and, of course, do more  pollution.\n\nWhat was Big Oil to do in that circumstance? Well, there were a  couple of things that they could have done. They could have, for  instance, negotiated with California. Indeed, they could have asked the  President to negotiate with California and, perhaps,…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…Committee.\n\nMr. THOMPSON of California. Mr. Speaker, I thank the gentleman for  the passion he brings to this issue. I know how much work he has put  into it.\n\nI want to add a couple of things on the SALT topic.\n\nOne, as I think the gentleman remembers, when this was happening, my  subcommittee held hearings on SALT. We brought witnesses in from a  number of…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…transgender people exist. That is just a fact. Gender  dysphoria is a medical fact. No serious medical person disagrees on  that point. It is not even debatable. There are a couple of things that  are debatable.\n\nWhat do we do about it? What treatments are appropriate, given the  set of circumstances? Personally, I think it is wide open to have that  conversation.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…they are  going to execute the plan.\n\nIt is not true of our Russian adversaries. It took me a while to  learn this, but I found that they were motivated primarily by a couple  of things: One was the appearance that they were in charge. That  mattered to them more than anything else, that I look like I am in  charge of whatever this operation is, not…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696346/trump-administration"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Mr. Speaker, I urge my colleagues to oppose this rule.\n\nMr. AUSTIN SCOTT of Georgia. Mr. Speaker, while the gentlewoman was  speaking, I did take a second to pull up a couple of things on gas  prices since they are blaming President Trump for it. They are correct.\n\nIn Worcester, the gas price is $2.91 a gallon on average. In  Oklahoma, it is $2.21. In…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…Republican colleagues about some of that, but we need  to make sure we remain vigilant and keep working hard to protect those  rights.\n\nI had a chance over the weekend to do a couple of things. Friday,  Saturday, Sunday, and Monday, I had a chance to visit churches and  groups that were celebrating Dr. King, remembering Dr. King. I went to  First Baptist Church…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699200/building-a-beloved-community"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…replacements--far from it.  Not just myself, but Senator Schiff, my colleague from California, and  I both reached out to the White House months ago to inform them of a  couple of things--No. 1, that Eric Tung would be unacceptable.\n\nBut, importantly, it is important for my colleagues on the other side  of the aisle to understand that we signaled a willingness…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696538/government-funding"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…to vote ``yes'' on the rule and ``yes'' on the  underlying piece of legislation, especially the National Defense  Authorization Act.\n\nMr. Speaker, I want to address a couple of things since, as usual,  the Democrats continue to blame President Trump for everything.\n\nJust as a reminder, the Democrats controlled the House, Senate, and  White House until…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697852/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…education and think about the Trump  administration's efforts to minimize the importance of focusing on  areas that have been left out of the process, I will mention a couple  things here tonight that is going to run a little bit contrary to what  my staff has researched for me.\n\nThe knowledge and skills of our young people and the things that they…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…process. They deserve leaders who work for them,  not for the billionaires.\n\nMr. Speaker, I urge a ``no'' vote, and I reserve the balance of my  time.\n\nMr. Speaker, just a couple of things. First of all, I want to correct  the record. The gentleman said that this budget reconciliation bill  reflects a full, fair, and open process in all the committees of…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…America healthy again if we are ripping health  insurance away from 16 million people and undermining and then gutting  our public health workforce.\n\nThese are just a couple of the things that have happened. I haven't  even touched on the Medicare cuts that are triggered as a result of the  pay-as-you-go law.\n\nI said I was closing, but, like a good Baptist…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692205/raising-awareness-about-mens-health"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…programs like SNAP and Medicaid. It really is shameful.\n\nMr. AUSTIN SCOTT of Georgia. Mr. Speaker, may I inquire as to how  much time each side has remaining.\n\nMr. Speaker, a couple of things. The gentleman has had 30 minutes,  and he couldn't spend 30 seconds to condemn the Trump pardons of those  who viciously attacked our law enforcement on that terrible…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…toward helping American citizens rather than to illegal immigrants,  especially those recovering from Hurricane Helene.\n\nMr. MOORE of North Carolina. Mr. Speaker, just a couple things about  Congressman Knott, for folks who don't know, before he was a Member of  Congress here, he was actually a very well-esteemed prosecutor in the  U.S. Attorney's office.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…other crimes.\n\nYet we act like this isn't occurring. I have dozens of other examples  right here of arrests that have been occurring this year.\n\nMr. Speaker, I note that a couple of things that are important for  the American people to see is that this administration has driven  unemployment down to historic lows. Economic growth is now back up to  close…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Californians, don't take Arizona's  water.\n\nMr. Speaker, may I inquire as to the time remaining.\n\nMr. SCHWEIKERT. Mr. Speaker, I am going to try to do a run-through of  a couple things here. I am going to try to walk through some economics.  Then I am going to actually try to walk through some warnings that are  in the documents that are around us that…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Mr. SCHWEIKERT. Mr. Speaker, Mr. Green caught us a little bit off  guard. He suddenly stopped, and I am not used to him doing that.\n\nMr. Speaker, we are going to try a couple of things tonight, and I am  going to try to do this as efficiently as possible. I hate doing it  this way, but part of what I am going to do tonight is respond to  basically a…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…it is demographics. Remember, in less than  approximately 3 years, over half of the Federal spending will go to  those who are 65 and up. It is substantial because of a couple of  things.\n\nWe got older as a population. We have gone 30 to 40 years with  falling fertility rates. Remember, we are well below replacement rates  in the number of children we…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…minutes ago--I had no intention of speaking. Half  an hour ago, I had no intention of speaking today. But I need a little  therapy. So congratulations, therapists--I have a couple of things on  my mind.\n\nAs I stand here--as we stand here--uncertain about what this Saturday  morning in August is going to produce, I just had some thoughts. My  first thought…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694711/9999"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…that would affect law enforcement, so I immediately wanted to look  and see what he possibly could be talking about. I think what the  gentleman was talking about were a couple things.\n\nOne was getting rid of a $250,000 grant, funding for jailed trans  inmates working with incarcerated transgender individuals providing  gender-affirming care to include…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…understand, also  have a few thoughts on this legislation.\n\nMr. MARSHALL. Mr. President, before we wrap up this Whole Milk for  Healthy Kids Act, I just want to go back over a couple things as well.  Senator Welch, it is always a pleasure to work with you. Whether we are  trying to connect high-speed internet or give milk to schools, it is  always a joy. I…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697062/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…been in the process.  Everyone that I talked to about healthcare, they all say: It is  incredibly confusing. I can't figure out any of this.\n\nLet me try to explain just a couple of things we are talking about.\n\nMy Democratic colleagues are asking for a multibillion-dollar  extension, not of ObamaCare but of a subsidy that was put on top of  ObamaCare. And…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…gone and the  Medicare trust fund being gone. That is, what, 60 percent of today's  defense budget.\n\nWhy is math such an anathema to this place?\n\nLet's walk through a couple of other things here. I have only had  time to produce a couple of boards from the new CBO report, and then we  will try to tie these into what else is going on.\n\nThis year, we are…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…assessment of the bill.\n\nMrs. HOUCHIN. Mr. Speaker, I am prepared to close.\n\nMrs. HOUCHIN. Mr. Speaker, may I inquire how much time I have  remaining.\n\nI have got just a couple of things I would like to note in my  closing, and this is reasons why the One Big Beautiful Bill Act is the  best chance in a generation to pass critical reforms that the American…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "Mr. TILLIS. Mr. President, I appreciate the opportunity to come to  the floor and talk about a couple of things.\n\nEarlier today, we had a classified briefing on the situation in  Venezuela. I have to say that I am very impressed and thankful for the  expertise, the resources, and…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…actually solutions if we can be bold, if we can be creative,  and if we can take on the entrenched incumbency of the bureaucracy and  business models.\n\nLet's actually do a couple of things here and see if I can make this  make sense. Let's march along--this is sort of important--and see if I  can make this make sense.\n\nThis is last year. The red is spending.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…Border Patrol is seeing fewer coming across the land border,  the Coast Guard is seeing more. So we have got to pay attention to all  areas of our border.\n\nI did note a couple things that I have read. That was interesting for  me to actually go down and to be able to see because I have seen all  these media reports, all these different pieces of fake…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Mr. SCHWEIKERT. Mr. Speaker, I am going to try to just do a couple of  very simple things here. I will walk through that. I believe there are  actual solutions. The problem is they are hard, and it is one of those  occasions where I think we play this…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}]