[{"senator": "Becca Balint", "party": "Democrat", "sentence": "Ms. BALINT. Mr. Speaker, right now, ICE is showing up at courthouses  across the country, waiting to arrest people after their official  immigration hearings.\n\nIs this what we thought we would see in America? ICE officials lying  in wait…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693019/ice-turns-courthouses-into-traps"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…from violence. Gangs, able to  outgun the Haitian National Police, continue to launch heavily armed  attacks on ports, highways, critical infrastructure, police stations,  courthouses, prisons, hospitals, businesses, and neighborhoods. They  have committed gruesome massacres against senior citizens and, for more  than a year now, have dictated Haiti's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694816/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…human and economic destruction. These indiscriminate raids do not make  our communities safer--and often have the opposite effect when done in  sensitive locations like courthouses and schools. That is 20 times more  agents, arrests, and illegal detention centers. Further, the Trump  Administration is diverting FEMA funds away from disaster recovery…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…perverted to the point of turning its  attention on prosecuting a State court judge for interfering with a  deportation in her courtroom and in her courthouse. Even judges and  courthouses in this Nation are not safe from the reign of terror of  this President.\n\nIn Milwaukee, Judge Dugan, a State court judge, was arrested by the  FBI for obstructing justice…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…from Indiana (Mr.  Shreve), I thank him for his leadership and support on this issue.\n\nThis bill develops space-sharing guidelines to prevent overbuilding  of new Federal courthouses. As a former Department of Justice staffer  and a former Federal law clerk myself, I have had the privilege to see  many beautiful courthouses and courtrooms across this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695379/courthouse-affordability-and-space-efficiency-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Shelby County v. Holder case.\n\nWe have seen Black and Brown communities, including American  citizens, living in terror as ICE agents show up on streets, door to  door, in our courthouses, and on the way to school, grabbing people and  violating their due process rights.\n\nWe have seen trade wars that make the cost of everything go up. We  have seen a Federal…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "David Taylor", "party": "Republican", "sentence": "Mr. TAYLOR. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 3426) to amend title 40, United States Code, to limit the  construction of new courthouses under certain circumstances, and for  other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695378/courthouse-affordability-and-space-efficiency-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Federal public buildings.\n\nI think every American can imagine what we are talking about here.  When you look at the Capitol, our national monuments, the White House,  many courthouses, the classical style very much evokes the values that  we have in this country, the values of representative government, the  values of citizen participation.\n\nHowever,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "French Hill", "party": "Republican", "sentence": "…recounting  heartbreaking terrible events, these dogs provide comfort and support  to make those difficult moments just a little bit better.\n\nWhile these dogs can often cost courthouses around $50,000 each, PAWS  for Justice provides them free of charge.\n\nAs a proud owner of my great pup, Taft, I have an incredible  appreciation for PAWS for Justice's efforts…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688942/keaton-beasley-teaches-importance-of-financial-literacy"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…applaud C-SPAN's commitment to chronicling democracy in action here in  the Congress.\n\nIn fact, for more than 20 years, I have pushed to allow cameras into  the Federal courthouses, including the Supreme Court, to foster a  better understanding of the Federal judiciary and its role in our  system of checks and balances and in resolving legal disputes.…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691703/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…recognition increasingly within this Congress that  we have more space than our Federal Government needs. That is certainly  the case at the courthouse level in our Federal courthouses and the  supporting office space.\n\nMy legislation, the CASE Act, directs the GSA to construct the  courthouse space that is necessary and no more. I worked with the U.S.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695380/courthouse-affordability-and-space-efficiency-act-of-2025"}]