[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…agents. It was one of the most moving  experiences of my time in the U.S. Senate, not only because of the  words and the facts that they conveyed but because of their raw  courage, their bravery.\n\nI had tears in my eyes as I listened to Luke and Brett Ganger telling  us for the first time in public in such a setting what it was like to  lose their sister…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…no spin, no disgusting lie-filled website is going  to change the facts of the history of what happened on that day.\n\nI rise today to honor the men and women who with great courage and  sacrifice defended this Capitol Building. Our Capitol Police are still  being treated with disrespect and now denigration from the President  who today has accused them…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698536/a-somber-day-of-remembrance"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "Mr. REED. Will the Senator yield for a question? I think he will.\n\nMr. REED. Thank you very much.\n\nFirst, let me say that you are demonstrating incredible courage and  conscience today and last evening as you stand here and point out the  grave situation this country faces. You have clearly indicated--and I  believe you are right--that…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696343/trump-administration"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…will have fewer rights than I  have had. Those are troubling signs.\n\nIn 1965, the Voting Rights Act became the law of the land. It was  signed in blood and baptized by the courage of men and women who dared  to believe in something better. Selma gave us the foot soldiers,  Montgomery gave us the movement, and the movement gave us the right to  vote.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…rich and powerful who have had their thumb on the  scales and shafted Americans for decades?\n\nWe are going to get a vote again this afternoon. I hope people will  find the courage of a Republican like Ralph Norman or a Republican like  Marjorie Taylor Greene or a Republican like   Thomas Massie or the many  MAGA Republicans who are demanding the full…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693552/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…not oppose what we were doing  but chose to simply say: I will vote ``present.''\n\nThat was a significant vote, as well. I rise to thank them.\n\nAll of these persons had the courage to say to Donald John Trump:  Things are changing in this country. You are likely to face a vote of  218 more persons who would vote to have you impeached.\n\nI rise to thank…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…Black military history is not a  footnote. It is foundational. From the Revolutionary War to today's  All-Volunteer Force, Black servicemembers have defended this Nation  with courage, discipline, and sacrifice, even when this Nation did not  fully defend them in return.\n\nTheir service helped win wars. Their leadership strengthened our  institutions. Their…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…conscience. This is  not who we are, and it must not be who we become. The American people  are beginning to wake up. They are hungry for accountability from our  government and courage from Congress.\n\nI promise this. This is not the end of our voices. It is only the  beginning.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…Speaker, I am a history teacher so I know that we  have to do everything we can to document what is happening right now  because we are at a very dangerous moment, and it requires courage from  every single one of us.\n\nHere is the truth of it: This national nightmare started with a  series of lies, the first one being that Barack Obama was not born in  this…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691062/it-all-started-with-a-series-of-lies"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…everyday acts of resistance in your own life because, America, this  is not normal. We will not go back.\n\nI say to you, stay strong, raise your voices, and engage in acts of  courage.", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688627/this-is-not-normal"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…visionary leader who championed  public engagement and collaborative governance.\n\nIn her final battle with cancer, as with every other facet of her  life, Mary Ann Nihart embodied courage, kindness, and an unwavering  dedication to others.\n\nThough we mourned her loss last Saturday, we will be celebrating her  inspiring legacy for many years to come.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699748/recognizing-mary-ann-nihart"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…later today.\n\nI will have more to say later this morning. But for now, I simply  want to thank all the survivors and family members who are here today  at the Capitol. Their courage is inspiring. They have come a long way  from across the country, taking red eyes and flying overnight so they  can be here for this important moment. Their decision to be…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699879/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…extraordinary actions.\n\nThese heroes continue to serve, speaking throughout the country and  inspiring our citizens in schools and beyond. They continue to carry  the mantle of courage, sacrifice, patriotism, citizenship, integrity,  and commitment here at home.\n\nThere is nothing we can pay them that will ever match their  sacrifice, but voting for this…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688216/medal-of-honor-act"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…Americans.\n\nSo I would say to my Republican colleagues as a friend: Donald Trump  doesn't like you. He doesn't really like anybody. He just assumes that  you will  never find the courage to stand up to him so he is going to keep asking  you for more until you finally do.\n\nIf you are sick of being bullied and if you are ready to act like the  leaders you claim…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688021/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…rise to honor Robert ``Rex'' Baumgartner,  a true American hero, a man of the law. Rex embodied the very best of  our Nation: honor, respect, bravery, duty, and unwavering courage.\n\nBorn in east Toledo, Rex answered the call to serve early, joining  the United States Air Force and serving as an air policeman and sentry  dog handler around the globe.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…that all other beneficiaries currently receive.\n\nThese reservists face the same dangers and make identical sacrifices  as our Active-Duty counterparts when deployed. Their courage and  dedication deserve equal recognition.\n\nMr. Speaker, of the last eight servicemembers killed in the line of  duty, six of them were reservists, the two remaining being…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689695/montgomery-gi-bill-selected-reserves-tuition-fairness-act-of-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…their communities, and this country.\n\nIt is my distinct privilege to include their names in the Record. May  their example inspire future generations to serve with the same  courage, integrity, and selflessness.", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694579/recognizing-floridas-eighth-congressional-district-veterans"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…Our law enforcement officers put themselves in harm's way every day  in the pursuit of justice and protection of the innocent. They are the  thin blue line that represents courage when faced with unbelievable  chaos and uncertainty.\n\nOne of the greatest strengths of law enforcement is their ability to  bridge gaps, forge connections, and build trust…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691307/thanking-police-officers-for-all-they-do"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Mr. Sarrault  participated in numerous recovery missions, often under enemy fire. His  role in rescuing wounded soldiers from active combat zones demonstrated  extraordinary courage and was vital to saving countless lives. His  service reflects the bravely and sacrifice of so many Dustoff crew  members who risked everything to bring others to safety.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692726/thanking-roger-sarrault-for-his-service-with-the-us-army-as-a-member-of-the-dustoff-crews-during-the-vietnam-war"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Officer Blake Schwarz Suicide Prevention Act,  legislation aimed at providing the resources and recognition our  correctional officers deserve. I thank Jon and Haley for their courage,  compassion, and relentless advocacy bringing attention to this very  important issue.\n\nMr. Speaker, I want to wish a very happy birthday to my nephew,  Andrew Martino.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699214/proud-announcements"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…few townhalls that Republicans are brave  enough to have, and they are yelling at their Representatives. They are  saying: Do something.\n\nWhile Americans want us to have the courage to stand up to Trump,  House Republicans are doing the opposite.\n\nHidden in the rule we are debating today is a provision that will  cover up Secretary Hegseth's texting of…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…days of our Nation's founding to today's complex challenges,  Army soldiers have defended our freedoms, upheld our values, and  protected the American people with unwavering courage.\n\nThis historic anniversary reminds us of the countless sacrifices made  by generations of men and women in uniform, those who have answered the  call to serve, often at great…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692323/taking-an-important-step-for-rural-america"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…their son,  Christopher, who had passed away from cancer at just 11 years old.\n\nBefore his passing, Christopher wrote a story about a brave knight  seeking the four diamonds of courage, wisdom, honesty, and strength,  qualities his parents knew were essential in the fight against cancer.  In his memory, they created Four Diamonds to support families facing…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688351/recognizing-thon"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…uniform but those who continue to  serve our communities today.\n\nSurrounded by his family, friends, and fellow veterans, Mr. Gilman  finally received the medal that reflected his courage and selflessness  in Vietnam.\n\nMr. Gilman of Airway Heights served valiantly in the American  Division during the 1969 Tet Offensive. Amid intense combat near Phuoc  Hoa,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696843/focusing-on-results"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…Representative Keith Self of the Texas Third Congressional District, to  honor Colonel Chuck DeBellevue, United States Air Force retired, an  American patriot whose extraordinary courage, leadership, and lifetime  of service reflect the highest ideals of our Nation and the United  States Air Force.\n\nOn September 9, 1972, then-Captain DeBellevue and his F-4…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699080/9999"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Congress. Five Democrats joined us in voting for this bill. In a few  moments, we will be voting, Mr. Speaker. It will be darn interesting to  see how many Democrats have the courage to come across the line and say  ``yes'' to only U.S. citizens should vote in U.S. elections. My  colleagues should support this bill.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…American Dream.\n\nDuring times of crisis, when others run away, our brave police  officers run toward danger, putting themselves at risk to protect life  and property.\n\nTheir courage, selflessness, and dedication deserve our deepest  respect, not just this week, but every single day.\n\nLet us also remember, honor, and mourn the officers who made the  ultimate…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691350/national-police-week"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…family. A  true champion for Veterans, his legacy will live on in the work he did  and the countless lives he touched. Walt's commitment to serving his  fellow Veterans, his courage in the face of adversity, and his deep  love for his community will continue to inspire us all. His memory will  forever remind us of the importance of honoring those who…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692464/recognizing-the-life-and-service-of-united-states-army-veteran-walt-hartnett"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…Mr. Speaker, I rise today to recognize a  very brave young woman from Virginia's Second District. Vada Carawan is  an 11-year-old Virginia Beach native who recently showed courage beyond  her years when she saved her father's life. On November 23, 2024, Vada  was spending time with her father, Clinton, when he started to  experience what doctors later…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690307/recognizing-vada-carawan"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…down from a  challenge, and always striving to make a difference for those she  served. It is for me a profound honor to follow in her footsteps.\n\nHer legacy is one of faith, courage, and love, and the highlight of  her life was her husband, Jason, and her family. These descriptions are  all fitting for a woman whose name said it all.\n\nWhile we grieve…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689230/moment-of-silence-in-remembrance-of-the-honorable-mia-love"}]