[{"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…funding for programs like Medicaid. Nearly 2 million  people in my State of New Jersey rely on Medicaid for healthcare. It  raises the healthcare costs for folks who get their coverage through  the Affordable Care Act. In my district, folks could see their premiums  go up by $1,400 per year under this budget.\n\nThough I know my colleagues across the aisle…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689914/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…their healthcare premiums double or triple. It does absolutely  nothing to stop provisions in the reconciliation package that will  strip 15 million people of their Medicaid coverage.\n\nThese cuts will have a resounding impact on individuals and the  healthcare industry and economy as a whole. Safety net hospitals like  Montefiore in my district and federally…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696743/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…tax credits to expire. That has really nothing to do with lowering  costs on average Americans. And this whole idea, in my mind, is a  veiled attempt to repeal the expanded coverage that we saw for Medicaid  under the Affordable Care Act. Why is that important?\n\nWell, it is critically important because Medicaid has been the  cornerstone of, in the Affordable…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Congress to  achieve Medicaid savings is adding work requirements. In fact, Georgia  added work requirements to its Medicaid program in July 2023 through  its Pathways to Coverage program. It is currently the only state to  offer Medicaid coverage to low-income adults that is contingent on work  and other qualifying activities.\n\nAccording to the Georgia…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689905/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…had a history of cancer, diabetes, heart disease, HIV, asthma,  depression, pregnancy--the list goes on--insurers could force patients  to pay more or refuse to offer them coverage at all.\n\nStanding strong for the ACA very simply means providing healthcare to  Americans. Extending the healthcare tax credits for 1 year is a  compromise that makes sense.…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696612/9999"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…rural area lose.\n\n``These would be the largest Medicaid cuts in history and will leave  veterans, seniors, the disabled, children and working families without  healthcare coverage''--this is as the distinguished physician colleague  has said--``making emergency rooms the only point of care for millions  of people. Communities will be devastated; lives…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691417/gop-tax-scam-hurts-everyone"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…history.  It will cut Medicaid and the Affordable Care Act by over $1.1 trillion.\n\nIn Michigan, in my State alone, over 450,000 people are now at risk  of losing their healthcare coverage, including children, seniors, and  people with disabilities in our district.\n\nThese cuts will also impact EMS and ambulance services across our  Nation. This budget will shrink…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694018/budget-betrayal"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…strong support of  this legislation to extend the Affordable Care Act and the tax credits.\n\nIn my district alone, nearly 100,000 people rely on these tax credits  to afford coverage, and because Republicans let them expire, many of  them are starting off the year without access to care.\n\nI hear from families all across north Texas every day begging for…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698596/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…organization, procedure, or practice       requirements of an agency.'' 5 U.S.C. Sec. Sec. 551(4);       804(3). However, CRA excludes three categories of APA rules       from coverage: (1) rules of particular applicability; (2)       rules relating to agency management or personnel; and (3)       rules of agency organization, procedure, or practice that…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…reintroducing bipartisan, bicameral legislation with  Representatives Malliotakis, Pingree, Fitzpatrick, and Evans and  Senators Booker, Marshall, Smith, and Cassidy to pilot the coverage of  MTMs in traditional Medicare. Our bill, which expands access to these  lifesaving meals, will lead to billions of dollars in savings without  adding one dime to the deficit.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695649/medically-tailored-meals-save-lives-and-lower-healthcare-costs"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…that makes  health insurance more affordable? I am afraid it is obvious. During the  2026 open enrollment period, millions of people decided to drop their  health insurance coverage. Others are being forced to make impossible  choices between food, car payments, and housing costs. If we fail to  immediately solve these problems, millions of people will…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698601/healthcare"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…to oppose other Trumpian blunders, whether they are  tariffs that burden families with higher grocery bills or the  deprivation of millions of Americans without healthcare coverage or the  kleptocratic meme coin schemes to enrich the Trump family by more than  $200 million. President Trump can simply ask Congress to pass a bill  here on Capitol Hill.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691336/pocca"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…of mind, not financial anxiety,  because when essential services are gutted, community health centers  and rural hospitals face shortfalls, and people are forced to drop  coverage. It impacts everyone through higher premiums, and all of us  will be paying more and are paying more to get less. The House has  wisely voted to extend the subsidies, and…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699587/stop-the-republican-affordability-crisis"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…the       Comptroller General. CRA adopts the definition of ``rule''       under the Administrative Procedure Act (APA) but excludes       certain categories of rules from coverage. We conclude that       the Policy Notice meets the APA definition of a rule, and no       CRA exception applies. Therefore, the Policy Notice is a rule       subject to CRA's…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698437/us-government-accountability-office-opinion-letter"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…excruciatingly painful to listen to.\n\nOver 1.5 million Georgians are in the health exchange, in the  marketplace, and 340,000 of those, or about one-quarter will lose their  coverage if we don't do something about these expiring tax credits.\n\nA family of four earning $82,000 a year will see their annual  premiums double to around $7,000 per year. It is…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697217/medical-bills-are-too-high"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…the       Comptroller General. CRA adopts the definition of ``rule''       under the Administrative Procedure Act (APA) but excludes       certain categories of rules from coverage. We conclude that       the Miles City RMPA meets the APA definition of a rule, and       no CRA exception applies. Therefore, the Miles City RMPA is a       rule subject…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693085/us-government-accountability-office-legal-opinion"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Mr. BEAN of Florida. Mr. Speaker, I rise today to address the  skyrocketing cost of healthcare. When President Obama signed the  Affordable Care Act, he promised affordable coverage for all.\n\nMr. Speaker, 15 years and trillions of dollars later, all we have  gotten is higher costs and less coverage.\n\nBasic economics tells us that when government subsidizes…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697139/skyrocketing-cost-of-healthcare"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Fuller Broadcasting Company, Inc. from 1985 until  1998. His six stations (WKKR, WMXA, WZMG, WTLM, WCJM and WPLV) received  numerous awards for community service and local news coverage. In 1988,  WZMG and WKKR became the first stations in Alabama to earn the National  Association of Broadcasters Crystal Award for community service. He was  also Managing…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696582/recognizing-the-retirement-of-mayor-gary-fuller"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…sessions  during vote-aramas, and tune in to history being made.\n\nSpeaking of the historic moments, it was 39 years ago today, June 2,  when C-SPAN2 started its gavel-to-gavel coverage of the U.S. Senate.  That was 7 years after C-SPAN started broadcasting live coverage of the  U.S. House of Representatives in 1979. At that time, I was a Member of  the House…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691703/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…support of  the Lower Health Care Premiums for All Americans Act, which is the  right prescription to lower healthcare costs and provide American  citizens with more affordable coverage.\n\nNearly 15 years ago, the Democrats unaffordable care act broke our  healthcare system. They broke our healthcare system. Since its  inception, ObamaCare premiums have skyrocketed…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698370/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…California. Mr. Speaker, yesterday California Governor  Gavin Newsom finally backed down from his irresponsible, reckless  policy of providing full-scope Medicaid, Medi-Cal coverage to every  person who is income eligible in our State illegally. Of course, the  Governor did not do the right thing on his own but only in response to  the pressure that we…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691353/governor-newsom-backs-down"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…programs.\n\nJust last week, the Congressional Budget Office found that the One  Big Beautiful Bill Act removes 2.1 billion ineligible individuals from  the ACA marketplace coverage, with 1.2 million of those being  unauthorized immigrants or noncitizens.\n\nCBO also found that 5.3 million able-bodied, unemployed adults  covered by Medicaid will now have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694788/promises-made-promises-kept"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…fraud, and abuse.                           Restoring law and order\n\nIn an extreme example of spinning reality, some have       alleged that the Los Angeles protests we've seen coverage of       online and on TV have been ``peaceful.''\n\nLet's set the record straight: Protestors were engaging in       violence and vandalism--burning cars, attacking police…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692878/newsletter-from-congressman-chuck-edwards"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…waste,  fraud, and abuse--to eliminate them, to at least address them--as well  as safeguards ensuring that subsidies go to patients who qualify, those  who need it to afford coverage.\n\nBy the way, the resolution being offered by my Democratic colleagues  will raise insurance premiums by 5 percent. They are offering a CRA  that raises premiums, the effect…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698998/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…healthcare premiums by up to $2,500 per family per year,  but since ObamaCare went into effect, premiums have nearly tripled and  deductibles have more than doubled. The cost of coverage for a family  of four has increased by more than $10,000.\n\nBack in July of this year, this Republican Congress passed the  Working Families Tax Cut Act. This important legislation…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698431/republicans-have-delivered-in-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…the rules and pass the bill  (H.R. 970) to amend title 38, United States Code, to require the  Secretary of Veterans Affairs to periodically review the automatic  maximum coverage under the Servicemembers' Group Life Insurance program  and the Veterans' Group Life Insurance program, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689629/fairness-for-servicemembers-and-their-families-act-of-2025"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…landscape is nothing short of  significant.\n\nThe breadth of Rob's career was reaffirmed when he recently accepted  the Nebraska Broadcasters Association's award for Best Election  Coverage on behalf of KETV.\n\nWhether reporting on our Huskers, traveling with the Nebraska  National Guard overseas, or sharing the inspiring recovery of an Omaha  police officer,…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699390/recognizing-rob-mccartneys-outstanding-ketv-career"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…the       Comptroller General. CRA adopts the definition of ``rule''       under the Administrative Procedure Act (APA) but excludes       certain categories of rules from coverage. We conclude that       the North Dakota RMP meets the APA definition of a rule, and       no CRA exception applies. Therefore, the North Dakota RMP is       a rule subject…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693059/us-government-accountability-office-legal-opinion"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…sports,  covering over 2,000 games in football, basketball, hockey, baseball,  and more. In 2017, he was inducted into the Brainerd High School Hall  of Fame for his remarkable coverage.\n\nOff the air, Colin served tirelessly--co-chairing United Way  campaigns, emceeing the Walk for Diabetes and Special Olympics Polar  Plunge, and coaching youth softball and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699726/9999"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…Federal  Government without causing the damage that is always alleged that is  being done.\n\nFrom groundbreaking biomedical advancements through the NIH to  critical healthcare coverage for America's most vulnerable patients,  the Department of Health and Human Services oversees many of the  Federal Government's most essential functions. But far too often,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691446/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}]