[{"senator": "Raphael Warnock", "party": "Democrat", "sentence": "If they lived in California, if they lived in  New York, if they lived in North Carolina, they would be covered.", "title": "-9999", "date": "2025-12-10"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "These cuts wouldn't just impact individuals covered by  Medicaid.", "title": "Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Consumer Gas-Fired Instantaneous Water Heaters''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Waste Emissions Charge for Petroleum and Natural Gas Systems: Procedures for Facilitating Compliance, Including Netting and Exemptions''; and Providing for Consideration of H. Con. Res. Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-02-25"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "Nearly 1 in 4 Americans, or 80 million American people, are covered  by Medicaid.", "title": "Republican Tax Cuts", "date": "2025-05-05"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "I grew up in a family of public servants, a bipartisan family, a  biracial family, and my dad, who was a civilian employee for the  Department of Defense, had pretty good government employee insurance,  but that insurance wouldn't have covered all of the surgeries,  specialists, and the equipment that Olivia needed to thrive.", "title": "Republican Budget Betrayal", "date": "2025-02-26"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "Nearly half of all children in the United States are  covered by Medicaid and CHIP.", "title": "Privileges of the Floor", "date": "2025-03-31"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "In Nassau  County, one in four children depend on Medicaid for their healthcare,  and two in three seniors in nursing homes are covered by Medicaid.", "title": "Medicaid is A Lifeline", "date": "2025-06-23"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "When the treatment they  need and the healthcare they need is not covered and the healthcare  system they are relying on is dismantled, the people in this community  who are the most vulnerable are disproportionately impacted.", "title": "Support for Patients and Communities Reauthorization Act of 2025", "date": "2025-06-04"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "They are just not going to be  covered by health insurance.", "title": "Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-10"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "He was thrown on the glass-covered ground in handcuffs after  he already identified himself to agents.", "title": "Fighting Dhs Immigration Raids", "date": "2025-12-03"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Riding over the bridge of one of the rivers to the museum the day  that Kikue and I decided to go, she told me about how the river was not  visible during the day that the bomb was dropped and the days afterward  because of the number of bodies that just covered the surface of that  water.", "title": "Risk of Conflict with Nuclear Weapons", "date": "2025-07-23"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "As a Congressman, Mike Pence  didn't vote for the Affordable Care Act, but when he became Governor of  Indiana, everybody in Indiana, the healthcare providers and others  convinced him--oh, it is a good idea, you should get people covered in  your State.", "title": "One Big Beautiful Bill", "date": "2025-06-25"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "Literally, I thought I was going to come and talk  about healthcare and the need for us to come together to help reduce  healthcare costs and to continue to fight to make sure Americans are  covered because covering them helps reduce all our costs when you have  the reduction of uncompensated care.", "title": "National Weather Service", "date": "2025-12-10"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "What wasn't covered as much in the big, ugly bill and its impact is  what it is going to do to drive up people's electric bill.", "title": "Promoting Cross-Border Energy Infrastructure Act", "date": null}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "In order to get repaved more than a  year after the road had been repaired, with the town borrowing money it  really couldn't afford for a project that clearly was ultimately going  to be covered by FEMA, the town clerk was getting questions about, what  is the size of the gravel stones in that roadbed 12 inches down?", "title": "Statements on Introduced Bills and Joint Resolutions", "date": "2025-07-10"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "If they would have just had  healthcare, had insurance, their costs would have been covered, instead  of the constant uncompensated care costs.", "title": "Healthcare", "date": "2025-12-10"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Out of 365 days,  we just covered 11 days of borrowing.", "title": "Facts and Math", "date": null}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Sell every stock, every yacht, every  this, every that, you covered government for 9 months.", "title": "Facing Fiscal Reality", "date": "2025-11-20"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "(2) Lead the Working Group established pursuant to section       3 and consult covered nongovernmental representatives,       industry, institutions of higher education, and State and       local governments in order to--\n\n(A) promote resilient critical supply chains; and\n\n(B) identify, prepare for, and respond to supply chain       shocks to--\n\n(i) critical industries;\n\n(ii) critical supply chains; and\n\n(iii) critical and emerging technologies.", "title": "Promoting Resilient Supply Chains Act of 2025", "date": "2025-04-28"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "1514) or any other provision of law,       and subject to paragraph (2), any entry of a covered article       to which duty-free treatment or other preferential treatment       under the Caribbean Basin Economic Recovery Act (19 U.S.C.", "title": "Haiti Economic Lift Program Extension Act", "date": "2026-01-12"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "Interns, clerks,       unpaid fellows, members of the media, and other non-      government employees that provide services to the Senate are       not covered under this term.", "title": "U.S. Senate Health and Fitness Facilities Regulations", "date": "2025-05-12"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Eighteen       enrollees were still covered as of September, suggesting that       the exchange and insurers didn't verify information even       after enrollment.", "title": "Affordable Care Act", "date": "2025-12-10"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "The assessment shall include the       following:\n\n(1) The determination of the FFRDC, made in consultation       with covered entities, whether each such notice may be       feasibly altered to reduce paper consumption by, and costs       to, the Federal Government.", "title": "Clear Communication for Veterans Claims Act", "date": "2025-04-07"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Senate being covered by C-SPAN2.", "title": "Senate Resolution 259--Recognizing June As the 39th Anniversary of C-Span Chronicling Democracy in the Senate", "date": "2025-06-02"}, {"senator": "James Lankford", "party": "Republican", "sentence": "Every single part of our healthcare operation with Federal dollars is  all covered by the Hyde amendment.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "This bill expands the covered offenses to  include body mutilation and chemical castration of minors.", "title": "Protect Children's Innocence Act", "date": "2025-12-17"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "DELIVERY, DISTRIBUTION, AND DISPENSATION OF                     CONTROLLED MEDICATIONS BY COVERED DEPARTMENT OF                     VETERANS AFFAIRS HEALTH CARE PROFESSIONALS VIA                     TELEMEDICINE.", "title": "Protecting Veteran Access to Telemedicine Services Act of 2025", "date": null}]