[{"senator": "Steve Cohen", "party": "Democrat", "sentence": "…state-of-the-art fire stations  and a new fire administration building. Chief Sweat's tenure also saw  the department expand into responding to medical emergencies. It also  included the Covid epidemic period when the fire department was the  lead local agency conducting vaccinations. In my contacts with Chief  Sweat, she was always pleasant. She was easy to communicate…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696576/congratulating-fire-chief-gina-sweat-on-her-retirement"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…In 2020, the Madera County Board of Supervisors  appointed Mr. Varney as County Administrative Officer, overseeing 25  county departments and a half-billion-dollar budget.\n\nCOVID hit almost as soon as he was hired, and Mr. Varney found  himself navigating Madera County through one of the most challenging  times in recent history. He played a vital role…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694999/recognizing-jay-varneys-retirement"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…officers  and now has hearing loss. Just this week, NBC reported that an 18- month-old baby who was detained in south Texas was rushed to a hospital  and treated for pneumonia, COVID-19, and RSV in serious and severe  respiratory distress. She was described as being at the brink of dying.\n\nThirty-five people died in custody last year, and at least 6 died…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700023/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…the  hospital's selection with MO HealthNet; working alongside dozens of  stakeholders to secure Missouri Medicaid expansion; advocating for  vital hospital support during the COVID-19 global pandemic; providing  community leadership by ensuring outreach and vaccinations were  available during the pandemic; securing multiple sources of public  funding…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688302/recognizing-mr-gerard-j-grimaldi-on-his-retirement-and-expressing-appreciation-for-a-lifetime-of-dedicated-service-to-our-community"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Since then, we have run deficits every year, and  our total debt and annual interest on that debt have ballooned.\n\nThe highest recorded annual deficit was in 2020 during the COVID-19  pandemic, reaching $3.1 trillion. Since then, the deficit has remained  high, with the current year's deficit at approximately $1.9 trillion.  If we continue on this path,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689288/introduction-of-the-sustainable-budget-act"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…that is crippling our Nation. Our young people, our older people, and  our people in between, are suffering.\n\nSocial media has made it very difficult for our young people. COVID  made it very difficult for our young people. The pressures of life make  it very difficult for people. Our poor economy makes it difficult for  people, and a lack of effective…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…the Nation, brilliant researchers have been finding out daily  the Trump administration has canceled their research--research on  critical issues like maternal health, long COVID, diabetes, new  pharmaceutical drugs, cancer, and so much more.\n\nThe NIH has decided to cancel its 2025 summer internship program. On  average, 1,100 interns participate in…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…than only       allowing physical copies be transferred. The challenge and       barriers created by this current requirement were clearly       exposed during both the recent COVID pandemic restrictions as       well as the Capitol campus restrictions following the January       6, 2021 attacks on the Capitol.\n\nThe other 13 measures that have been shared…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696979/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…mission driven organization that has been around for over 150       years.\n\nAs a Skilled Nursing Center we rely on a large labor force       to care for our residents. Throughout COVID many of these       positions sat vacant as undesirable jobs or careers. Over the       past few years we have been able to slowly regrow our       workforce and we are not…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…outside, surrounded by community notices  and posters, proudly reads ``Hate Does Not Grow In the Rocky Soil of  Norwich, Vermont.''\n\nWhen faced with staffing shortages during COVID-19, it seemed likely  Dan & Whit's would have to close its doors for the first time in  history. The store put out a cry for help, and the call did not go  unanswered. Dozens…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694332/recognizing-dan-whits-general-store"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…tax preparer and site coordinator at two VITA locations,  Mr. Phillips has helped thousands of individuals and families navigate  the tax system--even during the height of the COVID-19 pandemic, when  many other sites were forced to close. Thanks to his dedication, and  that of fellow volunteers, the program has completed over 17,900 tax  returns, returned…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695269/recognizing-the-work-of-robert-phillips"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…have someone  who can immediately help with any concerns and respond without delay.\n\nIn my home State of New Jersey, 190 veterans tragically lost their  lives because of the COVID outbreak at the veterans homes in Paramus,  New Jersey, and Menlo Park. This tragedy was preventable and  unacceptable. My amendment will help ensure catastrophes like that…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692953/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…SBA Fraud Enforcement Extension Act. I am the co-lead on this  legislation, along with my friend, colleague, and fellow Air Force  veteran, Representative Downing.\n\nDuring the COVID-19 pandemic, more than 30 million small businesses  were negatively impacted. The Federal Government took action to ensure  that an unprecedented amount of money flowed into…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697228/sba-fraud-enforcement-extension-act"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "Mr. Speaker, if the port congestion and vessel backlogs associated  with the COVID-19 pandemic taught us anything, it is the importance of  a resilient supply chain.\n\nH.R. 252, the Secure Our Ports Act, works to minimize interference in  U.S. ports from foreign…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692208/secure-our-ports-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…through telemedicine without first conducting an in-person  exam. This bill will make permanent a flexibility that has been  extended to VA and non-VA prescribers alike since the COVID-19  pandemic.\n\nThe current waiver, which has been extended by the Drug Enforcement  Administration and the Department of Health and Human Services, is set  to expire in December…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695455/protecting-veteran-access-to-telemedicine-services-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…$2.8 million by  2023 and expanding its focus from three to eight critical areas of  community needs. Under Charles's visionary guidance, UWPC rose to the  challenges of the COVID-19 pandemic with swift aid innovative action.  He launched Operation Feed Pasco, which not only supported 19 local  restaurants but also provided over 237,000 meals to individuals…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690203/recognizing-chuck-anderson"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…issues the Democrats  continue to bring up. They act like this had anything to do with the  premiums of everyone in the country. We are talking about the  Affordable Care Act COVID-era subsidies. This is not what is affecting  other people's premiums, other than those folks who qualify for those  COVID-era premium subsidies. That is it. They continue…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…owed to the people we serve.\n\nThose numbers only tell part of the story. Joanne always helped  seniors with Social Security, families navigating economic assistance  during COVID, veterans, and countless others who felt overwhelmed and  unheard until Joanne stepped in.\n\nShe didn't just do what we call casework. She actually changed lives.  Joanne treated…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698569/recognizing-and-thanking-joanne-horn"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…kicks in, while remaining HSA-eligible.\n\nI know we are all concerned about access to healthcare, and actually  one of  the biggest, most important things that came out of the COVID pandemic  and the way we responded, in addition to Operation Warp Speed, was the  broader application of telehealth.\n\nMost places around the country are being served by broadband.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…that continue to get  rich off of ObamaCare. That is insulting to the American people.\n\nThat is a program that is riddled--riddled--with fraud. That is what  they want, these COVID bonus programs put forth by Joe Biden. They want  to just--3 more years, more direct checks to insurance companies,  taxpayer money with no accountability.\n\nSo how bad are…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…over there, and I am not mad. I am miffed that Democrats  would all talk about affordability in healthcare and bring to this  Chamber the idea, the notion that Congress take a COVID-era program  that Democrats all designed to expire when COVID was over, that every  watchdog group has said is loaded with fraud and waste--as the chairman  said, Social Security…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698812/breaking-the-gridlock-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…while leftist  politicians egged them on.\n\nWe see the growing physical attacks on law enforcement. The left used  the FBI to suppress debate on critical issues ranging from COVID  lockdowns to Biden family influence peddling to climate hysteria. It  has called for government commissions to regulate it. In Europe,  leftist governments now criminalize…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695787/beating-heart-of-democracy-is-freedom-of-speech"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…well-being  but to that of their community and their family.\n\nSo it is more than just a paycheck. It can help address the  loneliness epidemic that we saw, particularly post-COVID, and it is  proven to improve mental health outcomes across the board.\n\nSo I would encourage my Republican colleagues to join me in  strengthening work requirements across…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…the President is very interested in this issue, but not on this  floor today.\n\nMr. Speaker, what I have tried to ask and nobody has answered is: The  enhanced tax credits, the COVID-era tax credits, were set to expire in  the Inflation Reduction Act, which was a bill under the reconciliation  process. It was solely the Democratic Party who put that in…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698566/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…might assume that  Republicans are eliminating the Affordable Care Act or ObamaCare  altogether. That is simply not the case.\n\nThe premium tax credits were developed during COVID to subsidize  Americans making more than 400 percent of the Federal poverty level,  including those making up to $600,000. People making up to $600,000 are  getting subsidized…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698784/breaking-the-gridlock-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…more than 27 years, I held the longest  voting streak in Senate history. My 8,927 consecutive rollcall votes  ended in November of 2020, when I was quarantined for exposure to  COVID-19.\n\nMy good friend from Maine Senator Susan Collins now holds the baton,  as she continues her unbroken voting streak since she was sworn into  office in 1997.\n\nDuring the…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691703/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…includes driving out to  camp on Christmas Day with his family to prepare for winter camp. Jay  is a steadfast proponent for getting youth outdoors. He was part of the  council COVID response committee which helped keep youth Scouting  during the pandemic and is currently chairing the committee for the  whole-council camporee this coming year.\n\nIt is clear…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690805/recognizing-james-sheridan"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…very creepy.\n\nAs we were working to protect secrecy, the Canadian Government was  literally imposing a shutdown on bank accounts for Canadian truck  drivers who were protesting COVID policies in Canada. It wasn't that  they were stacking SWAT teams or special operators outside the door of  houses. The one ring to rule them all, the massive amount of power,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…a ``no'' vote says is more important than  strengthening Social Security.\n\nThere is $135 million in contributions to the World Health  Organization, which we all saw during COVID was the mouthpiece for the  Chinese Communist Party. I would imagine if we stop this $135 million  funding, the CCP may pick it up because they were regurgitating their  talking…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…Small Business  Administration's own inspector general has repeatedly warned about the  risks of fraud under self-certification. This was especially apparent  with the SBA's COVID-19 lending programs, where fraudulent self- certification led to billions of dollars in losses.\n\nThat is why I am proud to support the WOSB Accountability Act, a  bipartisan…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691799/wosb-accountability-act"}]