[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…chief economist for Freddie Mac, the mortgage  company, predicted the cascade from climate risk to uninsurability, to  no mortgages, to what he called a coastal property values crash that  could lead to a recession like in 2008.\n\nI remember 2008. It was ugly. I do not want to go there again.\n\nBut here you see places in which home values are predicted to…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…breakfast and lunch.\n\nHe would say: You can't learn if you are hungry. When you get the  sugar high of eating some of what they serve in schools as your first  meal and then you crash around 2 o'clock in the afternoon when it is  time for the history lesson, you are not going to learn much.\n\nThe SNAP cuts in the big, billionaire bonus bill are literally…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691771/151-days-without-a-vote-to-lower-costs"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "Ms. DAVIDS of Kansas.  I rise in support of H. Res. 153, expressing condolences to  the families, friends, and loved ones of the victims of the plane crash  of American Eagle Flight 5342 and U.S. Army call sign PAT 25,  introduced by my colleagues from Kansas, Representatives Ron Estes and  Tracey Mann. I thank both Congressman…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688369/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…students who were taken too soon from the Santa Ana  community.\n\nA few weeks ago, five students from the Santa Ana Unified School  District were victims of a devastating car crash: Aurelia Robles,  Natalia Vidal Zarate, Jacqueline Torres Zarate, Cynthia Torres Zarate,  and Emanuel Gonzalez Martinez.\n\nThis tragic loss has broken the hearts of our community.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690780/five-santa-ana-students-taken-too-soon"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…activity; have  refused to adopt changes that ensure that stablecoins do not  destabilize our financial system and require taxpayers to bail out  crypto companies when they crash; have refused to adopt changes that  would prevent Big Tech billionaires from using this bill to issue their  own private currencies; have refused to adopt changes that would…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690905/genius-act"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…co-president have embraced  a dystopian ideology based on falsehoods. The effect of their  disinformation is rapidly bringing us to a crisis point where their  falsehoods will crash into the reality of a great power competition.\n\nIf America abandons Ukraine and embraces the Kremlin, the  consequences for the United States and for the world will prove…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688107/marking-third-anniversary-of-unprovoked-russian-invasion-of-ukraine"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…though it is not a guarantee.\n\nEvery single one of them puts a price on carbon. No price on carbon,  we fail. Other stuff that helps with climate, that may cause the  airplane to crash higher up the mountain, but the only thing that gets  the airplane safely across the mountain is putting a price on carbon.  Twenty years ago, we probably had other alternatives.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…buyers. And  what happens then is that the property value crashes.\n\nAnd that is the prediction: climate risk to insurance collapse, to  mortgage unavailability, to property value crash, to economic  collapse--recession. And it is coming from all over--all over. And we  won't listen to those warnings whether they come from insurance CEOs,  from Freddie Mac,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…who was named the 2025  National Hero of the Year by the National Association of Letter  Carriers.\n\nOn April 18, 2024, Mr. Deyasso witnessed a car drive off the highway  and crash into a barrier, erupting into flames. Without hesitation, he  rushed to the scene. Joined by a group of Good Samaritans, Mr. Deyasso  worked tirelessly to pry the car door…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690461/recognizing-the-extraordinary-bravery-of-tesfaye-deyasso"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…disastrous attempt to protect American  industry by walling off our economy to the rest of the world.\n\nIt sparked global retaliation. It strangled trade. It helped turn a  market crash into a full-blown depression.\n\nWhat are we seeing now? New tariffs, retaliation threats, political  attacks on States that lead, and now an attempt to tear down  environmental…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691621/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…if confirmed.\n\nI worked long and hard with the families of Flight 3407, years ago,  to establish the 1,500-hour rule after they lost all their loved ones  on a tragic plane crash that occurred on a winter's night in Western  New York. They have worked so hard, and they are so proud of their  accomplishments. In the face of unspeakable loss, they worked…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693275/nomination-of-bryan-bedford"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "Ms. GILLEN. Mr. Chair, I rise in strong opposition to this amendment.\n\nEvery day, 34 families lose a loved one to a drunk driving crash.  Drunk driving remains the leading cause of death on our highways.  Unfortunately, the problem is getting worse every year, despite  interlock devices.\n\nFar too many Long…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699283/amendment-no-1-offered-by-mr-massie"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…warrant signed by a  neutral judge, not an administrative warrant in-house, to enter private  property.\n\nYou have seen the videos--we have all seen them--where they are  trying to crash down doors by hitting them with axes. Those individuals  don't have the authority to do that.\n\nWhat I am quoting--the Fourth Amendment to the Constitution--is  black-letter…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699485/department-of-homeland-security"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…the Federal Government used its  power to help people who couldn't afford to put food on the table, to  help people who lost their life savings overnight in the stock market  crash, but didn't help all the people because at the same time, my  parents saw the worst of government, a government that oppresses some  for the benefit of a few.\n\nThat sparked…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…day.\n\nKeeping a small business open in today's economic environment is no  small feat, and Ronnie has endured many challenges along the way, such  as dealing with a recent car crash into his storefront. Hair  Innovations temporarily relocated while Ronnie is rebuilding, but he is  bouncing back with perseverance and his neighbors' support--embodying  the…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699893/recognizing-ronnie-torres"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…Hawk helicopter collided with  American Airlines Flight 5342 at Ronald Reagan Washington National  Airport. Sixty-seven souls were tragically lost in an instant.\n\nAfter the crash, it quickly became evident that there were  commonsense changes that would immediately enhance aviation safety.\n\nThe Army helicopter, flying along the Potomac River, had deliberately…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698320/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…beautifully illustrated volume, Arkansas Wilderness. I       dedicate these remarks to the memory of my friend and mentor,       John Tower. He was killed tragically in a plane crash with       his daughter Marian in April, 1991. He was 65 and she was 35.       Our country has had few public servants possessing his       patriotism, intellect and commitment…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…right now, in 2024, we have  2.9 people working for every person receiving their benefits. A decade  from now, that is going to fall to 2.7, 2.6. Then, it really starts to  crash. When we start to look at the 30-year window, we are down to  about 2.4. That may not mean much to you, but trying to make these  numbers work, it can be done. It is just hard.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "John James", "party": "Republican", "sentence": "…doing nothing to address infrastructure when literally their plan  will contribute directly to crumbling infrastructure due to the heavy  weight of these trucks. They could also crash into barriers, which  would endanger lives. This would make sure the number of around 45,000  fatalities in this country would increase. I wonder how many American  lives they…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690473/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…But how do I get the brain trust around here to  come together and say: We are going to take all of these ideas and  build a unified theory, and this unified theory is how we crash the  price of healthcare, instead of spending a couple more years arguing  back and forth on how much more money we should borrow to hand out as  subsidies, particularly to…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the IRS, and get the phone answered?\n\nHow do I get my brothers and sisters here to help us adopt this  technology? I have a handful of articles here using AI to functionally  crash parts of the cost of delivering healthcare. Here is one about  actually making the environment much cleaner, much faster, much  cheaper, and actually identifying bad acts with…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…on the many heinous crimes committed by illegal aliens  each year. These are individuals who have endangered Americans by drunk  driving.\n\nEvery 42 minutes, someone dies in a crash involving alcohol. As we  have seen in the news, many of these crashes  have been caused by illegal aliens who jeopardize the safety of law- abiding Americans. They have killed…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…our  Communities from DUIs Act, a bill that I introduced last Congress and  again this Congress.\n\nEvery 45 minutes, that is how often someone in the United States dies  in a crash involving an alcohol-impaired driver.\n\nIn 2022 alone, there were 13,524 alcohol-impaired driving fatalities.  In 2020, drunk driving crashes led to nearly 400,000 injuries.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693084/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…Dwight D.  Eisenhower National Airport and to the greater Wichita community, where  Flight 5342 originated, for their efforts to embrace and lift up those  impacted by that crash. In towns and cities across the Nation and the  world, countless other communities have banded together to similarly  show support to the members of their community who lost…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688372/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…company and they decide that we are going to manufacture our  own and we are going to do it cheaper than the government-subsidized  price, then bless them.\n\nThere are ways to crash the price of healthcare. We have one right  here. It is a discussion of AI. AI went through someone's medical bills  and started realizing how much mis-billing there was in…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…are here to stop  us from modernizing the system and bringing us into this century. Just  use the technology. We walk around with a supercomputer in our pocket.\n\nThis could crash the price of healthcare, make you healthier, give  you access, all these things, and there is an army of people trying to  stop us.\n\nRemember, telehealth here was an absolute…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…problem is, it is not allowed to prescribe. That would be  illegal because that would require us to actually do things, modernize  access to healthcare, use the technology to crash--oh, we can't use  technology to crash the price. It would really annoy a whole bunch of  the lobbyists. People are lined up at our doors. People would show up  at our fundraisers.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…thousands of dollars through smart cost cutting.\n\nSkip has been on the front lines of major incidents, from the Kane  tornado to floods, barn fires, and even a military plane crash.\n\nAt age 94, he remains calm, capable, and committed.\n\nMr. Speaker, I thank Skip for his lifetime of service and the  integral role he has played in ensuring his community's…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690559/recognizing-junior-r-skip-baker"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…begin with, often foreign  nationals in the country illegally who exploited weaknesses in our  commercial driver's license or CDL system.\n\nWe have seen the video of the horrific crash in Florida where an  undocumented immigrant driving an 18-wheeler made an illegal U-turn on  the interstate, killing three Americans who should be with us here  today.\n\nIn…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697478/commercial-drivers-license-system"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…less healthcare?\n\nI have been coming behind this mike for over a decade with  presentation after presentation of technologies, new pharmaceuticals,  and new methodologies to crash the price of healthcare. I get the crap  kicked out of me because armies of lobbyists don't like it when we talk  about changing their business model.\n\nRemember, several months…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}]