[{"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…to overturn land management plans  is bad policy, bad economics, and bad land management. Truly, it is a  disrespect to the constituents who showed up to those meetings to  create that RPM in the first place, year over year over year.\n\nBy treating every resource management plan as a rule that is subject  to the CRA, Congress is throwing the legal status…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696880/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…That is right, the original purpose of reconciliation was to reduce the  deficit.\n\nThe reconciliation process was built on three pillars. First, a  reconciliation bill cannot create deficits in the first 10 years.  Second, a reconciliation bill can't increase the deficit in any year  after the first 10 years. And third, it should be measured using honest…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693857/hr-1"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…committee has a long  tradition of putting politics aside to deliver for our Nation's small  business employers.\n\nSmall businesses employ roughly half of the private workforce, create  the majority of new jobs, drive innovation, and generate almost half of  our Nation's economic activity. They are the heart and soul of our  communities. Whether it is a neighborhood…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687932/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…owners. These include places like bowling alleys, car  washes, marinas, funeral homes, and recreation centers. These are the  kinds of small businesses that serve local families, create jobs, and  keep our communities vibrant.\n\nFor many entrepreneurs, the higher equity requirement is the  difference between jumping in headfirst and creating new economic  opportunities…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699167/main-street-parity-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…from 13 visionary members in 1971 to a historic 62  members in the year 2025, 4 of whom serve in the United States Senate,  we have continued fighting to dismantle barriers, create opportunities,  and protect the rights of our communities.\n\nThroughout our Nation's history, the Congressional Black Caucus has  been called to confront countless threats to…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…in rural, urban, and suburban  communities to become highly skilled educators in the communities where  they live.\n\nAs a ``Grow Your Own'' initiative, Educators Rising helps create  diverse teaching workforces that reflect communities where students  live. Teachers who share similar backgrounds and experiences with their  students foster stronger student-teacher…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688484/recognizing-the-10th-anniversary-of-educators-rising"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…them on ICE raids will  only provoke confrontation.\n\nThe President is playing with the lives of Californians, and the  military is the pawn in his political game. He wants to create a  conflict that will allow him to invoke the Insurrection Act or martial  law--God only knows why--but California will never ever bend to the  will of a tyrant.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692322/denouncing-ice-raids-in-southern-california"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…fires decreases the usual       three-minute escape time to less than one minute, making       these fires a rapid death trap. These fires present unique       safety risks and create major hazards like flames, exploding       projectiles, and thermal runaway. This causes an explosive,       domino effect within the cells of a battery making it       especially…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…drill  in the Arctic National Wildlife Refuge could very well backfire on our  drilling advocates. If Congress votes to overturn the Biden record of  decision today, it would create legal and regulatory chaos, not  clarity.\n\nThat is because it would revive the Trump era leasing plan that is  legally flawed and under active litigation, effectively leaving…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697560/hj-res-131"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…years in the making.\n\nIn 2024, Donald Trump and J.D. Vance, peddled hateful lies about  Haitians in Springfield. Vance even admitted they weren't true. He  said: ``If I have to create stories . . . that is what I am going to  do.''\n\nWell, those stories dehumanized Haitians who were here legally  working and rebuilding a city. Now the Trump administration…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699519/ice-coming-to-springfield-ohio"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…to tax-free  savings accounts to cover the costs of medical expenses, to improve  communication between Medicare and caregivers to streamline the  benefits process, and to create a new $5,000 tax credit to help offset  the costs of family caregiving.\n\nJust a few weeks ago, I joined a bipartisan, bicameral group of  colleagues to introduce the Alleviating…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689770/hands-off-social-security"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…the backs of combat-injured  retirees. Doing so reneges on our obligation. It is a sacred obligation  to take care of veterans after their time in uniform.\n\nThe bill doesn't create some great, new, overly generous benefit, but  it would be enormously impactful and beneficial for each of those  retirees who would be affected. The average is about $1,200…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…over New Jersey, we are  cooperating with Federal authorities. What we have simply said is we  are responsible for local law enforcement. We are not going to do  things that create such fear in our communities that immigrant  communities are afraid to come to local police to report crimes. And  that somehow--not in Trump's first term--but somehow in this…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…evolution. This is why AI literacy is  crucial for small businesses to keep up with their larger competitors  considering and adopting AI.\n\nThe AI-WISE Act will direct SBA to create online AI literacy  resources for entrepreneurs, so they have the tools to make sound  choices on AI adoption and use. It will also direct the SBA to keep  their resources…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699205/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…wants to bypass laws and explore eminent  domain to fast-track fossil fuel projects--not alternate energy  projects, fossil fuel projects--and really not to lower prices or  create jobs but to benefit his Big Oil donors, whom President Trump  reportedly asked to donate $1 billion to his campaign. It sounds  awfully like quid pro quo, which in the past…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688190/sj-res-10"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Mr. SCHWEIKERT. Mr. Speaker, have you ever had the time here where  you basically are having to take on two things that push against each  other, that create a real math problem, and that telling the truth  about it--how do you say it?--oh, yeah, gets the crap kicked out of  you? Let's have at it, though.\n\nPresident Trump stood…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…helps ensure pilots receive  the care they need without fear of professional repercussions.\n\nWe cannot allow these essential professionals to suffer in silence.  Instead, let's create a system that supports their well-being and keeps  our skies safe.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692308/recognizing-aviation-professionals"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…amendment, which is included in this en bloc, will help show that  low Earth orbit satellites have the capabilities to provide adequate  broadband access to communities and create economic development within  the Appalachian region.\n\nAs a co-chair of the Rural Broadband Caucus, I am committed to  connecting folks as quickly as possible whether that be…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694869/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…honest, it  keeps the planning stable for the hottest months of the year, and it  avoids regulatory whiplash. Imagine if we are changing the rules  nonstop in DC. It would create great uncertainty. So this accommodates  the realities on the ground.\n\nIf this fix were overturned, Indiana would revert to older limits  designed for a fleet that no longer…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695511/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-emissions-budget-and-allowance-allocations-for-indiana-under-the-revised-cross-state-air-pollution"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…expertise and real estate knowledge, Mika has broad a unique  perspective to the Habitat Board, which she was voted onto in 2024.  Habitat Tampa Bay Gulfside has been working to create lasting  relationships in Hernando County. Mika has played a key role in making  introductions and working alongside our Hernando Executive Director to  provide information…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691741/recognizing-mika-rotunda"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…2016, the Fraud Reduction and Data Analytics Act of       2015 (FRDAA) required the Office of Management and Budget       (OMB) to establish guidelines for federal agencies to create       controls to identify and assess fraud risks to design and       implement antifraud control activities. The act further       required OMB to incorporate the leading…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…workforce are legendary. It takes a Herculean effort to fire a poorly  performing Federal worker or one who is engaged in misconduct.\n\nCollective bargaining agreements often create procedural hurdles to  firing such employees, above and beyond steps required in law and  regulation.\n\nFor example, unions can bring removals before private arbitrators  instead…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…down 67 percent, and it will continue to  come down.\n\nThe trade deficit is shrinking. Our Nation is bringing in trillions  of dollars in new investments, and this is going to create new  factories, jobs, and opportunities.\n\nMr. President, we are so pleased that some of those jobs are coming  into Tennessee. Some of those investments are coming into our…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…of innovation, job creation, and economic  growth.\n\nToday, over 90 percent of initial public offerings are filed by EGCs,  but when an EGC spins off part of its business to create a new public  company, that spinoff does not currently get the same treatment,  despite originating  from a company already recognized as an emerging growth company.\n\nH.R.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692762/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…colluded to destroy this country and have found a way to flood our  communities with third-world Muslims whose only goal is not to  assimilate but to destroy the West and create a worldwide caliphate. If  you don't understand what that looks like, just take a look at Europe.\n\nUnder Barack Obama and Joe Biden, our Federal Government imported  millions…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…in 1932, Alewel's has  grown into a fixture of Warrensburg's local community.\n\nThis federally inspected meat processing and retail facility  developed old German recipes to create quality fresh meats and homemade  specialty products.\n\nRandy Alewel, the third-generation CEO of Alewel's Country Meats, has  expanded the facility four times now.\n\nToday,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691505/recognizing-winners-of-2025-fourth-district-congressional-speech-competition"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…passenger train manufacturing.\n\nPlant 4 isn't just a facility. It is a symbol of what investment in  American industry looks like. It will retain 390 good-paying jobs  locally and create 258 new ones for families across my district.\n\nThese are high-quality, high-tech jobs that provide economic  stability and opportunity for the hardworking people of the southern…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692434/recognizing-alstoms-plant-in-hornell"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…placing urgency on CBDC research and  development.\n\nMoreover, the agency reports created under that executive order made  it clear that the previous administration was eager to create a CBDC  and was willing to trade Americans' right to financial privacy for a  CCP-style surveillance tool.\n\nOur bill, the Anti-CBDC Surveillance State Act, prevents future…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693735/anti-cbdc-surveillance-state-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the unions love me. Maybe  they would even send financial help and say nice things about me, but  it is not about that. It is about the entire continuity of society,  when we create these barriers for automation, for doing things better,  faster, healthier, and cheaper.\n\nIf you are going to have a command and control economy, let's just  admit we are populous.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "Mr. BEGICH. Mr. Speaker, Alaska's future is tied to land. It is how  we build infrastructure, develop our resources, and create  opportunities for our communities, but for far too long, Alaska Native  Corporations have faced unnecessary delays and constraints in securing  the lands they were promised…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698208/cape-fox-land-entitlement-finalization-act-of-2025"}]