[{"senator": "Sarah McBride", "party": "Democrat", "sentence": "…would  restore some common sense by banning the President from imposing  tariffs without congressional approval, capping the cost of childcare,  expanding health coverage, creating new pathways to  homeownership, raising the minimum wage, and expanding tax deductions  for working-class people.\n\nMr. Speaker, after Thanksgiving season, where so many families…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697421/delaware-day"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…but this  resolution will let those polluters off the hook. It also hurts  American companies that are innovating new technologies enabling leak  detection and repair, creating whole new pollution reduction  industries.\n\nThese new technologies are turning waste into economic value, all  while protecting our environment.\n\nI suggest that that is an exercise…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688179/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…jobs.\n\nForeign direct investment from nonadversarial Nations can be used to  grow critical sectors important for our economic success and national  security including by creating new jobs in our Nation's manufacturing  sector.\n\nOnce the envy of the world, our manufacturing base has faced steady  headwinds for the last several decades. Our Nation's share…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692696/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…harm on themselves or others, which sometimes makes  it hard for prosecutors to pursue these charges.\n\nThe CSAFE Act is meant to fill in the gaps in our Federal law by  creating a new crime that prohibits individuals from compelling,  attempting to compel, or conspiring to compel children into physically  harming themselves, others, or animals.\n\nWhile…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698879/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…Small businesses are still feeling the aftershock of inflation,  supply chain breakdowns, and rising costs. We should be focused on  helping them recover and grow, not creating new hoops for them to jump  through.\n\nWhat is especially troubling is that this bill would lock into law a  policy that was rolled out without enough input and with little regard…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692124/american-entrepreneurs-first-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…fall and winter, and to date, the U.S.  military has conducted 35 known strikes, killing at least 120 people.\n\nPresident Trump tries to justify these lethal attacks by creating a  new term--``designated terrorist organization''--a term that does not  exist in U.S. law or anywhere else, so far as we have been able to  determine. What does exist in law--authorized…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…colleagues and constituents and elected officials to become engaged. He  devoted his life to improving our community, to strengthening public  health and public safety, and to creating new opportunities for all  Rhode Islanders to thrive. He made significant strides toward improving  the lives of working Rhode Islanders, and he is credited with  spearheading…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691451/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…Globally, cement manufacturing accounts for nearly 8 percent of all  carbon emissions, and we have a unique opportunity to reduce pollution  in industrial emissions by creating new manufacturing opportunities  here at home that can take the place of aging processes based on fossil  fuels.\n\nThis bill will enable partnerships between industry, innovators,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688939/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…States. . . . `'\n\nThese people are finger painting all over the Constitution. They are  usurping the rule of law as adopted by the Congress of the United  States. They are creating new branches of government. I am glad that  they finally ran Elon Musk out of town because he was no longer  politically useful to him, but in the meantime we have to deal with…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…and would have far broader implications for public       safety. These bills would create a loophole for firearm       access by prohibited individuals by effectively creating a       new legal market for untraceable weapons. Additionally, they       will upend the Bureau of Alcohol, Tobacco, Firearms and       Explosives' (ATF) enforcement of firearm…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…the ranking member articulated, we know virtually  nothing about, will do nothing to help small businesses.\n\nWhile the majority is busy claiming to fight bureaucracy by creating  new bureaucracy, they are ignoring the real crisis small businesses are  begging us to address: the looming lapse of the enhanced premium tax  credits.\n\nI know this because…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697348/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…local families, create jobs, and  keep our communities vibrant.\n\nFor many entrepreneurs, the higher equity requirement is the  difference between jumping in headfirst and creating new economic  opportunities for their communities and families or walking away  entirely.\n\nThis way of doing business just doesn't reflect our current economic  or technological…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699167/main-street-parity-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…side of the aisle, then  what in the world were we doing having DOE employees?\n\nWe have got so many DOE employees that they have time to spend all  day, weeks, and months creating a new regulation that my colleagues on  the other side of the aisle claim doesn't really have much value to it,  it is just a little label.\n\nI would submit, Mr. Speaker, it costs…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688547/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…extraordinary emphasis on overhauling  the acquisition process, shifting focus from compliance to quickly  fielding new capabilities at speed and scale.\n\nIt slashes red tape by creating a new requirement process to enable  the Pentagon to actively seek existing technology solutions from  industry, rather than prescribing overly exquisite, gold-plated systems…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697794/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…program, which delivers an additional $100 billion of  investment over the next decade for rural and distressed communities or  both.\n\nWe are investing in education and creating new tax credits for  individuals who contribute to scholarship organizations. I am also very  passionate about teaching the next generation about the power and value  of compounding…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…for  every challenge that America faces.\n\nMr. NUNN of Iowa. Mr. Chairman, in closing, this amendment is about  helping States succeed to improve their water quality--not creating a  new mandate and not creating a new bureaucracy. It gives States the  support that they need to do the things that currently aren't being  executed under current law.\n\nThis…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698032/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…about buying bubble gum with bitcoin. This is about  blockchain innovation happening here rather than overseas, about more  liquid capital markets, about small businesses creating new services  and products, about removing friction from transactions for every  single American, and about protecting consumers so the debacles like  the FTX meltdown never…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693788/digital-asset-market-clarity-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…sponsored by Representative Valadao.\n\nThis bill would require the VA to review existing claims, automation  tools, and submit a plan to Congress on improving, modifying, or  creating new tools to support claims processors.\n\nThese improvements would, in return, help the VA automatically  retrieve veterans' records, compile evidence, automate Federal  Government…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695487/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…and former prosecutors who never knew Epstein  and never knew any visitors to his criminal enterprise who have genuine  concerns about supporting this bill out of fear of creating new victims  or harming existing victims or both.\n\nThat is what we have reduced Congress to, inserting itself into the  prosecutorial process for political motivations, driven…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696812/epstein-files-transparency-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…people.\n\nSolebury School was founded in 1925 by four visionary educators,  Laurie Erskine, Julian Lathrop, Robert Shaw, and Arthur ``Doc''  Washburn, who shared a dream of creating a new kind of educational  environment. As the school's first headmaster, Doc Washburn captured  that vision best when he wrote, ``Our goal is to start a small school  with an…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696356/recognizing-the-100th-anniversary-of-solebury-school"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…pipes and  pumps. He championed the transformation of Water Works Park into a  welcoming community space, helping to lead the development of the  Lauridsen Amphitheater and creating new opportunities for Iowans to  gather, enjoy outdoor recreation, and build stronger community ties.\n\nI have had the opportunity to work with Ted on matters of regional  infrastructure…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694988/recognizing-the-retirement-of-ted-corrigan-after-35-years-of-public-service"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Wilderness area can continue  to serve central Arkansas as a place of economic, recreational, and  historic importance.\n\nFirst, as Chairman Westerman noted, this is not creating a new  wilderness area but simply designating additional land. It has wide  support, as noted by my friend, including our local county and city  officials in the county where…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…H.R. 3095 cuts through this red tape with a clear directive to the  Postal Service to assign unique ZIP Codes to these deserving  communities.\n\nThis bill is not about creating a new bureaucracy or imposing heavy- handed mandates. It is about empowering local governments and residents  to take control of their future. It is about ensuring that every…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…today, but that research component has great potential for the  future.\n\nIn the short run, we stop the Chinese from bringing the precursors to  Mexico and the Mexican cartels creating new analogues and trying to get  around our laws by claiming it is not really fentanyl, it is an analog.  We stop those attempts by the bad guys, the illegal people trying to…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…affordable, reliable,  and clean baseload power in Montana and across the United States. For  years, I have worked with my colleagues to grow our hydropower  portfolio in creating new jobs, lowering prices, and strengthening our  grid.\n\nI want to thank Senator Fetterman for joining me as my colead to push  this bill across the finish line.\n\nOur bipartisan…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694335/requiring-the-federal-energy-regulatory-commission-to-extend-the-time-period-during-which-licensees-are-required-to-commence-construction-of-certain-hydropower-projects"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…control economy, let's just  admit we are populous. We want to run the economy. We want to own  businesses. We don't believe in the economic theories of creative  destruction, creating new, better, faster, but give up on the  productivity cycle and then you tell me how people's wages go up. You  have a middle class that is getting absolutely crushed and squeezed.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…provisions include increasing the child tax credit to  $2,500 per child; raising the standard deduction for all filers;  establishing savings accounts for newborns; and creating a new  deduction on Social Security benefits for senior citizens.\n\nFor the average family of four in North Dakota, this package will  help save an estimated $1,600 in taxes.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}]