[{"senator": "Lou Correa", "party": "Democrat", "sentence": "…and stop  more illegal drugs like fentanyl before they reach our communities and  harm our communities and children.\n\nMy bill requires the Secretary of Homeland Security to create a plan  to address capability gaps and integrating innovative technologies into  our border security operations.\n\nThis bill requires DHS to think strategically about opportunities…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688687/emerging-innovative-border-technologies-act"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…ever-growing network of historical markers, the Trail provides  opportunities for everyone in our state to learn these stories of  encouragement and achievement. These experiences create a lasting  impact as they highlight the critical role that African Americans have  had in shaping our country. They help all of us to understand,  confront, and overcome the…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700309/recognizing-the-black-heritage-trail-of-new-hampshire-for-black-history-month"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…efforts to support clean air legislation. I feel grateful  that His  All Holiness uses his authority to raise environmental awareness, and  I'm proud to stand beside him to create sustainable future together. On  behalf of my constituents and my colleagues here in Washington, I thank  His All Holiness for his bravery, guidance, and testimony. I hope…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695852/recognizing-the-ecumenical-patriarch-of-constantinople"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…New York, and other States of  New England against the pollution generated in Ohio and other  Midwestern States that is brought by the prevailing winds.\n\nThe polluters didn't create those prevailing winds, but, nonetheless,  the pollution is carried on them toward the east coast. The funny thing  about those little pieces of soot created in fuel-burning…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689118/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…economic development in communities across America. Through public and  private partnership with certified development companies, the 504  program helps small businesses to grow, create jobs, and invest in  their communities.\n\nSince its inception in 1986, the program has provided approximately  $400 billion in total project financing and created over 3.3 million…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699186/504-program-risk-oversight-act"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…Process       That Pays Dangerous Police Officers $374,000 on Average in       Backpay and Costs the District $895,000 Annually in Personnel       Resources. H.R. 2096 does not create a timelier process for       the resolution of police misconduct cases. H.R. 2096 will       reinstate a termination process that is not public and       overseen by arbitrators.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…unqualified people.\n\nSecretary Kennedy's pledge to make America healthy again is another  promise that this administration is either unwilling or incapable of  keeping. His idea to create a national registry for people with autism  is an example of what happens when incompetent and incapable leadership  is in place.\n\nThis administration is full of examples like…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the drug is even if it can  be discounted under the insurance coverage of your policy as well.\n\nThe list price is the proper method of disclosure because the drug  companies create the list price. We are not imposing a price on them;  it is a price they have to publish. It is an objective, factual figure.  Many patients do indeed pay this price when they…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694204/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…look pretty good.\n\nThe Great Lakes folks get along on both sides of the border, so why  disrupt something that is working? That is absolutely insane.\n\nTariffs can be a tool to create jobs and wealth, as well as bring  back jobs to our country, and we ought to head in that direction. Yet,  the President's efforts seem to be adding more trade deficits, not…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…States are  represented by Members on the other side who support this bill.\n\nThe main point I want to raise right now is that it appears to me  that this bill, as drafted, would create a scenario that is  unconstitutional. As I read it, it strikes a 5-day provision. In other  words, when somebody is initially arrested, they can be held for 5  days, and so,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696977/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…D.C.'s Frederick Douglass and Pierre L'Enfant statues placed in  the Capitol, alongside two statues from each state. We also  successfully worked with the U.S. Postal Service to create a D.C.  stamp, like the stamps for the states, and with the National Park  Service to add the D.C. flag alongside the state flags near Union  Station.\n\nI urge my colleagues…", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692567/introduction-of-a-bill-to-permit-the-flag-of-the-united-states-to-be-flown-at-half-staff-in-the-event-of-the-death-of-a-mayor-of-the-district-of-columbia"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…a lot not to like, but every American should be paying  attention to the cuts being proposed to Medicaid and SNAP benefits.  These cuts will hurt millions of Americans and create irreversible  damage to our communities.\n\nMr. Speaker, it will hurt my community, where tens of thousands of  people benefit from these programs, but this is going to impact…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687964/proposed-cuts-to-medicaid-and-snap-benefits"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…the mom in Newark who wants to open up a store or the  first-generation American in Bloomsburg, Pennsylvania, who wants to  bring a taste of home to town, small businesses create good jobs. They  give back. They reinvest, and they show us what is possible in our  communities.\n\nH.R. 1804, our 7(a) Loan Agent Oversight Act, is a smart, targeted  fix and…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691853/9999"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…aggression,  putting us on a pathway toward a more dangerous world in which ``might  means right'' and the rule of law is abandoned.\n\nColorado cannot allow this President to create such a world for our  children, which is why we need to continue to fight on a bipartisan  basis when possible to prevent another forever war in Venezuela or  beyond and to…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…why  they are canceling the solicitation and provide information about any  plans to reissue it. If an agency does not plan to reissue the  solicitation, then the bill would create procedures for a small  business to receive assistance in identifying similar contracting  opportunities.\n\nThis bill passed the Small Business Committee unanimously in March…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691761/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…energy  remains affordable, reliable, and abundant.\n\nAmerica's future is bright as we unleash responsible natural  resources development to meet our energy and mineral leads, to create  jobs, and to drive economic growth across the country.\n\nMr. Speaker, I urge adoption of this resolution, and I yield back the  balance of my time.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…workforce are legendary. It takes a Herculean effort to fire a poorly  performing Federal worker or one who is engaged in misconduct.\n\nCollective bargaining agreements often create procedural hurdles to  firing such employees, above and beyond steps required in law and  regulation.\n\nFor example, unions can bring removals before private arbitrators  instead…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…1912, only about 4 percent of Boy Scouts have earned the  award, making this achievement nothing short of extraordinary.\n\nI look forward to seeing how Carter can continue to create positive  change in Ohio's Second Congressional District.\n\nI would also like to recognize Carter's parents and Scout leaders for  their role in this process. Without them,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690320/recognizing-carter-bisig"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…expected Washington to keep its word, not abandon them  midway.\n\nH.R. 131 doesn't expand this drinking water project, authorize new  construction, increase the Federal share, or create any new  entitlement. It doesn't bail out any mismanagement. It simply gives  rural communities more time and flexibility to repay the Federal  Government. It extends the repayment…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698701/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…than it should be, especially for entrepreneurs and emerging  businesses trying to make the next step.\n\nIn 2012, Congress worked to fix that problem, passing the JOBS Act to  create a more affordable path for smaller companies to go public, raise  capital, and fuel the next wave of American innovation, but there is a  problem. After going public, these…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693854/greenlighting-growth-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…foolish to continue to send money to fuel these technologies that could  be used perhaps in the next few years against the United States and our  allies.\n\nThis legislation would create a notification regime to create more  transparency around investments that are not prohibited. You know, as  long as we are blind to how much money is  being invested in China…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688807/cormick-and-mmcr-fettermanhagerty-kim-cormick-schumer-sullivan-fetterman-and-others-for"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…commitment to Cyber Studies. Both degreed and certificate level  programs are growing at Sam Houston and the school is working with the  CIA, FBI, DHS and other agencies to create a pathway to jobs in this  fast-growing field.\n\nUnder her leadership, the SHSU College of Osteopathic Medicine is  making a name for itself in the medical field. Training predominantly…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691515/recognizing-dr-alisa-white-president-of-sam-houston-state-university"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…is steeped in tradition. Mrs. Wilkes'  Dining Room isn't just a restaurant; it is an experience.\n\nIt is a place where history, hospitality, and home-cooked meals unite  to create something truly special.           Commending the Islands of St. Simons, Jekyll, and Tybee\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to commend the  islands of St.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689617/commending-jekyll-island-club-resort-and-sea-island"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…is, under Governor Newsom, California has the  highest unemployment rate in the country. A recent jobs report showed  literally zero job growth in California. I would love to create more  jobs.\n\nWe could create jobs by hiring people to dig a hole and hire more  people to come and fill the dirt back in, which isn't that far from  what is actually happening…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…change their names because the  documentation might show two different names, but the SAVE Act itself  addresses this point in the text. Page 14, line 9 directs the States to  create a process for addressing this exact issue.\n\nI find myself asking: Why are the Democrats refusing to take steps to  safeguard our elections and protect the votes of every single…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690005/safeguard-american-voter-eligibility-act"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…trade agreements, and  funding wars around the world.\n\nInstead of driving our manufacturing overseas, I thank President  Trump for incentivizing companies to come back and create jobs and  leave the money here in our country. I thank him for incentivizing  production, for deregulating so Americans can be creative and  productive like they want to be.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688490/president-trump-is-getting-it-done-for-the-american-people"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…ultimately, deputy chief, she has continued to be a true  mentor.\n\nI thank Emily for all she has done for our team, especially her  ability to foster collaboration and growth and to create a more united  effort. Despite her University of Illinois pedigree, she will always be  an Iowan and a Hawkeye at heart, from the corn dogs at the State fair  to winning friends…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688336/recognizing-emily-tuttle-millard"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…is  Congress's fault for giving it. Over the last 70 years, there are  probably a dozen pieces of legislation where Congress said to the  President: Here, take this power. Create emergencies. Put on tariffs.  Negotiate for us because we are too feeble-minded to do it ourselves.\n\nBut the thing is, the Constitution doesn't let us give our power  away.…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…amendment, which is included in this en bloc, will help show that  low Earth orbit satellites have the capabilities to provide adequate  broadband access to communities and create economic development within  the Appalachian region.\n\nAs a co-chair of the Rural Broadband Caucus, I am committed to  connecting folks as quickly as possible whether that be…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694869/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…provides for  congressional disapproval of the rule titled Energy Conservation  Program: Energy Conservation Standards for Consumer Gas-Fired  Instantaneous Water Heaters, will create a structural imbalance. This  imbalance results from the Biden administration's issuance of an  efficiency rule for commercial tank and tankless water heaters in  October of…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690091/hj-res-20"}]