[{"senator": "Lauren Underwood", "party": "Democrat", "sentence": "Speaker, I rise today because, in just 2 weeks,  the Affordable Care Act tax credits that help millions of Americans  afford their premiums will expire, and this Republican healthcare bill  does absolutely nothing to keep costs from surging.", "title": "Lower Health Care Premiums for All Americans Act", "date": "2025-12-17"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "Republican leaders have failed to extend the expiring tax credits  that help people afford their insurance.", "title": "Affordability Crisis in America", "date": "2025-12-15"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "We can pass a bill now to extend the tax credits.", "title": "Lower Health Care Premiums for All Americans Act", "date": "2025-12-17"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "Like the Senator from  Wisconsin, my friend Senator Baldwin, I would have wanted the  healthcare tax credits to be permanently guaranteed.", "title": "-9999", "date": "2025-11-07"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "If Republicans are concerned about  energy supply chains, they should start by repealing the One Big  Beautiful Bill Act, which attacked tax credits and programs designed to  strengthen our supply chains.", "title": "Opposition to Permitting Bills", "date": "2025-12-12"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "For example, I am proud to have cosponsored  bills that will provide immediate relief by strengthening and  modernizing the child and earned income tax credits, expanding paid  leave, providing penalty-free retirement withdrawals, and giving  Americans more financial flexibility in these tough times.", "title": "Voters Sent Us to Congress to Lower Costs", "date": "2025-03-25"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "Folks across the country are going to get some bad news; that without  the tax credits that are in place now and are set to expire by the end  of the year, their healthcare premiums are going to double, triple,  and, in some cases, quadruple and even worse.", "title": "Terminating the National Emergency Declared to Impose Duties on Articles Imported From Canada", "date": "2025-10-29"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "3947 for the purposes of offering my amendment to extend the  Affordable Care Act tax credits for 1 year.", "title": "Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-10"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Speaker, let me first thank Richard Neal, the once  and future chairman of the powerful Ways and Means Committee, as well  as Frank Pallone,  Bobby Scott, all my colleagues in government on the  Democratic side, and the Republicans who have joined us now to make  sure that we extend the Affordable Care Act tax credits which are  scheduled to expire at the end of this month.", "title": "Lower Health Care Premiums for All Americans Act", "date": "2025-12-17"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "Speaker, on January 1, Republicans in  Congress allowed the Affordable Care Act credits to expire.", "title": "Pennie Enrollment", "date": "2026-02-12"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Instead of a plan on healthcare, last night in the Rules Committee, I  heard one Republican excuse after another about why they can't extend  these tax credits that help people get insurance coverage.", "title": "Providing for Consideration of H.R. Lower Health Care Premiums for All Americans Act; Providing for Consideration of H.R. Do No Harm in Medicaid Act; Providing for Consideration of H.R. Protect Children's Innocence Act; and Relating to Consideration of H.R. Standardizing Permitting and Expediting Economic Development Act", "date": "2025-12-17"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "BANKS assumed the Chair.)\n\nThe Jesuit Conference:\n\nPrograms that meet basic needs such as SNAP, Medicare and       Medicaid, health insurance premium tax credits, and Social       Security should be protected and remain as robust as       possible.", "title": "Privileges of the Floor", "date": "2025-03-31"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "As my colleagues know, Senator Schumer and I led the development of  the clean energy tax credits, which set in motion the possibility of  hundreds of billions of dollars of investment in clean energy and,  particularly, a policy that would keep prices down and keep good jobs  up.", "title": "Terminating the National Emergency Declared with Respect to Energy", "date": "2025-10-08"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "We have Lucinda from Whiting write in begging us to ``hold the line''  when it comes to fighting for healthcare because, in her words, ``I  definitely cannot afford my ACA insurance without the Advanced Premium  Tax Credits.", "title": "Government Funding", "date": null}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "The ACA tax credits are expiring December  31.", "title": "Lower Health Care Premiums for All Americans Act", "date": "2025-12-17"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "In fact, the biggest complaint that my colleagues have had throughout  the course of the last few weeks about the enhanced premium tax credits  was due to a temporary program that they said would end December of  2025, and now they claim nobody can afford it without this temporary  program that was brought in because of COVID.", "title": "Providing for Consideration of H.R. Student Compensation and Opportunity Through Rights and Endorsements Act; Providing for Consideration of H.R. Combating the Lies of Authoritarians in School Systems Act; Providing for Consideration of H.R. Transparency in Reporting of Adversarial Contributions to Education Act; Providing for Consideration of H.R. Promoting Responsible Oversight to Eliminate Communist Teachings for Our Kids Act; Providing for Consideration of H.R. Small Business Regulatory Reduction Act of Providing for Consideration of H.R. Destroying Unnecessary, Misaligned, and Prohibitive Red Tape Act", "date": "2025-12-02"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "And the second big Democrat idea was the premium tax credits, which  was created for people earning about $15,000 a year, and it was capped  at those making $60,000 a year.", "title": "-9999", "date": "2025-12-10"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "The premium tax credits were developed during COVID to subsidize  Americans making more than 400 percent of the Federal poverty level,  including those making up to $600,000.", "title": "Breaking the Gridlock Act", "date": "2026-01-08"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "Last month, the  GAO released findings that showed just how easy it was to commit fraud  with the Biden bonus credits under ObamaCare.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Chair, I appreciate my friend bringing up the enhanced or COVID- era premium tax credits that are expiring at the end of this month.", "title": "Electric Supply Chain Act", "date": "2025-12-10"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "One Social Security number used for 26,000 days  of coverage, and more than 58,000 deceased people receiving tax  credits.", "title": "Providing for Consideration of H.R. Lower Health Care Premiums for All Americans Act; Providing for Consideration of H.R. Do No Harm in Medicaid Act; Providing for Consideration of H.R. Protect Children's Innocence Act; and Relating to Consideration of H.R. Standardizing Permitting and Expediting Economic Development Act", "date": "2025-12-17"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Remember that we have sort of this negative tax income system, earned  income tax credits, and those things.", "title": "Economic Anxiety", "date": "2025-05-01"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Zach credits his Iowa coaches for  instilling a strong work ethic, and he used that Iowa work ethic to win  the U.S.", "title": "-9999", "date": "2026-02-04"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "We heard from Democrats repeatedly about the millions of people they  believe are going to be affected when their own temporary COVID credits  sunset at the end of this year--their own temporary COVID credits.", "title": "Providing for Consideration of Senate Amendment to H.R. Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Thanks to Senator Katie Britt of Alabama, Republicans modernized tax  credits for childcare.", "title": "Nominations", "date": "2025-12-17"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "It is shut down  because we can't come to an agreement here in the Senate, with the  President, and with the House to deal with the expiring Affordable Care  Act tax credits that make it affordable.", "title": "-9999", "date": "2025-10-16"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Restoration of Healthcare Tax Credits\n\nMr.", "title": "Congratulating Eco-Clean Solutions", "date": "2025-12-04"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "Additionally, the OBBB makes bonus depreciation, the small-business  deduction, and the R&D tax credits permanent, sharpening our  competitive edge and incentivizing capital investment.", "title": "American Economy Gaining Momentum", "date": "2025-06-25"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "But with the COVID-era enhanced ObamaCare credits set to expire  according to a timetable set by Democrats since no Republican voted for  it in the first place--instead of working through the regular order to  come up with a bipartisan solution, the Senate Democrats have chosen to  play hardball.", "title": "Senate Agenda", "date": "2025-12-01"}]