[{"senator": "Mike Thompson", "party": "Democrat", "sentence": "…bring this bill to the floor today. Yesterday, nine  Republicans voted with us to bring this tax credit extension up. Today,  it is 11. They know that letting these tax credits expire will hurt the  people that they represent as well.\n\nCongressional Republicans set the stage to price 4 million Americans  out of healthcare plans that they need. Democrats…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698811/breaking-the-gridlock-act"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…lowering healthcare costs for  millions of Americans.\n\nAs of January 1, more than 400,000 Alabamians faced higher premiums  because Republicans in this body let the ACA tax credits expire. That  is on top of the nearly $1 trillion in cuts that Republicans made to  healthcare earlier this year.\n\nToday's vote represents one more chance for Republicans to do…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698813/breaking-the-gridlock-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…with another New Yorker, a man named Jeremy. He lives in the  Hudson Valley, in Kingston, NY, who relies on the ACA tax credits to  pay for health insurance. As his tax credits expire, Jeremy is going to  pay more than double. Nearly $1,000 every single month is what he is  going to have to pay, and that is not an expense he can deal with or  that people…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698199/new-york"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…H.R. 6074, which provides for a clean 3-year extension of the  Affordable Care Act enhanced tax credits.\n\nCongress has 3 legislative days left to extend the ACA tax credits,  or they will expire at the end of the year. The impact of the tax  credits expiring is devastating. Expiration of the tax credits will  result in health premiums increasing by an average…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698301/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…colleagues, they do  propose on Medicaid to really make cuts that will hurt us. This isn't  about waste, fraud, and abuse. Their plan is to allow enhanced premium  tax credits to expire. That has really nothing to do with lowering  costs on average Americans. And this whole idea, in my mind, is a  veiled attempt to repeal the expanded coverage that we…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Lauren Underwood", "party": "Democrat", "sentence": "…discharge petition to extend  these tax credits for 3 years. If we defeat the previous question, we  can vote on that extension today, but if Republicans let these tax  credits expire, premiums will soar. Healthcare will be out of reach for  tens of millions of Americans. Families will be forced to go uninsured  or make incredibly tough choices just…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697855/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…more likely to work jobs without employer-provided benefits, making  the ACA their only real option for coverage.\n\nI want to make this clear: Republican leadership let tax credits  expire in order to pay for tax breaks for billionaires. They didn't  make an abstract budget decision. They decided that their wealthy and  well-connected donors deserved the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698673/protecting-healthcare-for-millions-of-americans"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…conditions. They  can live with dignity instead of fear of bankruptcy.\n\nDemocrats did not give up on the American people, unlike many  Republicans, who chose to let these tax credits expire 1 week ago. That  is right. When the ball dropped in Times Square on New Year's Eve,  millions of Americans saw their healthcare premiums rise. That is a  direct result…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698671/protecting-healthcare-for-millions-of-americans"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…for families who can't  afford for Congress to look the other direction.\n\nMr. Speaker, I rise to share the human cost of allowing the  Affordable Care Act healthcare tax credits to expire. I rise on behalf  of the families of the Third Congressional District that I serve in the  great State of Ohio.\n\nI rise on behalf of the families across this Nation.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697648/restoring-enhanced-premium-tax-credits"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…seeing  their insurance premiums double or even triple and for some to see  their health insurance premium spike beyond their ability to pay when  the enhanced premium tax credits expire on December 31.\n\nAn estimated 5 million people will find that they can no longer  afford those premiums and will lose their coverage altogether.\n\nFor the past month, the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…young adults, and workers who  now face the devastating reality that their healthcare premiums are  about to double--in some cases, triple and quadruple--when critical tax  credits expire at year's end.\n\nIn New York's Ninth Congressional District, this crisis is not  theoretical. It is happening to the single mother in Flatbush,  Brooklyn, who finally had…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…are debating the definition of showerheads. Really? Millions of  Americans are losing their healthcare coverage after Republicans  allowed the Affordable Care Act tax credits to expire.\n\nThe nightmare of families having to choose between taking their child  to the doctor or paying their rent is now a reality, hitting my home  State of Florida especially…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…credit funding  deadline, 30 days to go, and to give voice to everyday Americans who  will be harmed by the Republican-led healthcare crisis.\n\nThe enhanced ACA tax credits are set to expire on December 31 unless  congressional Republicans join Democrats to extend them.\n\nWithout an extension of the ACA tax credits, tens of millions of  individuals and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…from being homeless. This is the reality for rural  America today.\n\nThe big, ugly bill took a sledgehammer to rural healthcare, and  letting the ACA enhanced premium tax credits expire will accelerate the  damage and hasten the harm.\n\nIn rural America, places like Hawaii, insurance coverage is the  business model that keeps hospitals, clinics, and emergency…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698588/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…expire them in  the Inflation Reduction Act, which was spent money on the Green New  Deal.\n\nSo when you put in context what President Trump said--when the  premium tax credits were set to expire, we had a hearing on that and we  were talking about it. We asked: Why in the world did the Democrats set  them to expire? They said: We thought the price of insurance…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…beneficiaries.\n\nZero-claim enrollment numbers dwarf potential coverage loss       estimates of not extending the COVID credits. This anomaly       suggests that when the COVID credits expire on schedule at       the end of 2025, they will likely have little to no negative       effect on access to health care services or health.\n\nTo curb fraudulent enrollment…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698438/uncovering-widespread-fraud-in-obamacare"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…interested in this issue, but not on this  floor today.\n\nMr. Speaker, what I have tried to ask and nobody has answered is: The  enhanced tax credits, the COVID-era tax credits, were set to expire in  the Inflation Reduction Act, which was a bill under the reconciliation  process. It was solely the Democratic Party who put that in place, and  the question…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698566/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…slush fund.\n\nNow, Democrats are uniting behind that policy to send billions more  of taxpayer dollars to big health insurance plans. With the Democrats'  temporary COVID credits set to expire at the end of the year, they are  attempting to turn their policy failures into political gains using the  American people as collateral.\n\nIt is worth reiterating.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…secretary, Julie Su, to try to do the same thing, targeting independent  contractors on a national level. They are the folks who will perhaps  suffer the most if these tax credits expire because they rely on that  individual market, and they don't really have any other option. They  will be forced to pay thousands and thousands of dollars more when  their…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}]