[{"senator": "Deborah Ross", "party": "Democrat", "sentence": "…conscientious friend and mentor to many who aspired to follow in her  footsteps. She was also a fierce advocate for women's equality in the  workplace and in society. She credited her mother and grandmother for  encouraging her and her sister to pursue an education and pursue  careers they could be passionate about.\n\nI have known Sepi for more than…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689506/recognizing-the-life-and-legacy-of-sepi-saidi"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…votes for bills to  help their corporate polluter friends.\n\nThis bill guts the appliance energy conservation standards program at  the Department of Energy. This program is credited with helping  American households save $6,000 on their energy bills over the last  decade. The standards are projected to help reduce peak demand by 32  gigawatts by 2040.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700165/dont-mess-with-my-home-appliances-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…of such       contributions: Provided further, That contributions of money       for the purposes provided herein from any foreign government       or other entity may be credited to this account, to remain       available until September 30, 2027, and used for such       purposes: Provided further, That the Secretary of Defense       shall provide…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693693/department-of-defense-appropriations-act-2026"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…safety, and to creating new opportunities for all  Rhode Islanders to thrive. He made significant strides toward improving  the lives of working Rhode Islanders, and he is credited with  spearheading efforts to preserve pensions and raise the minimum wage.\n\nIn the face of recent, incredible, and ultimately insurmountable  health challenges, Donny valiantly…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691451/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…artistry extends far beyond  her portfolio. Rather, it is the voices that may otherwise have gone  unheard and the generations of filmmakers who she has inspired that  will be credited as her most powerful and enduring legacy.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696266/recognizing-ms-ava-duvernay-art-as-a-catalyst-for-change"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…first African-American four-star general in the Air Force.\n\nChappie James fought in both the Korean war and the Vietnam war. In  both those wars, he flew 160 missions and is credited with having shot  down 26 enemy planes.\n\nWhere in these textbooks do we hear any discussion of Chappie James?  I have never been able to understand what it is about folks…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…customer $280 but someone accidentally added way too many zeros to the  transaction. For 90 minutes before an employee caught the mistake, one  lucky customer had $81 trillion credited to their account.  Unfortunately, for that customer, the bank corrected their error and  far too often these kinds of mismanagement mistakes actually lead to  harm for consumers.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…under paragraph (1) directly or through       awards made under subsection (b)(1)(A).\n\n``(3) Distribution.--Any amounts collected under this       subsection shall--\n\n``(A) be credited to the currently applicable       appropriation, account, or fund of the Department of Health       and Human Services as discretionary offsetting collections;       and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…Command.\n\nIn 2017, he earned his first star as a deputy program executive  officer at PEO Missiles and Space. His second star came in 2019 when he  took over the PEO role. He is credited as a primary driver for the  modernization and integration of fires within the Army.\n\nHe earned his third and final star in 2022, becoming the director of  the Army's Rapid…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695727/congratulating-lieutenant-general-robert-a-rasch-jr"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…to both their fellow  servicemembers and their country. These crews--which include a pilot,  crew chief, and medic--courageously operated helicopter air ambulances  and are credited with saving more than 900,000 lives throughout the  Vietnam War.\n\nServing at the Marble Mountain Air Facility with Marine Aircraft  Group 16 (MAG-16) aboard CH-34 helicopters,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692874/recognizing-master-sergeant-gerald-timmins-for-his-service-with-the-us-marine-corps-as-a-member-of-the-medevac-crews-during-the-vietnam-war"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…earned the  Land of Make Believe the award of ``Best Theme Park in New Jersey'' by  MSN.com earlier this summer. Christopher Maier, Herman's son and the  park's current owner, credited its most recent achievement to the  park's enduring commitment to affordability, safety, and family- centered fun.\n\nAs we celebrate this accomplishment, I invite my colleagues…", "date": "2025-08-19", "source_url": "https://justfacts.votesmart.org/public-statement/1694751/recognizing-the-land-of-make-believe-the-worlds-greatest-amusement-park"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…earned the Land of Make Believe the award of  ``Best Theme Park in New Jersey'' by MSN.com earlier this summer.  Christopher Maier, Herman's son and the park's current owner, credited  its most recent achievement to the park's enduring commitment to  affordability, safety, and family-centered fun.\n\nAs we celebrate this accomplishment, I invite my colleagues…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694756/recognizing-the-land-of-make-believe-the-worlds-greatest-amusement-park"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…came to talk about Laken Riley, Rachel  Morin, Jocelyn Nungaray, the officer, the young lady, not one.\n\nMr. PERRY. No.\n\nMr. PERRY. President Trump did not. President Trump is credited with  having the most secure border in history.\n\nMr. PERRY. No. As I recall, about 10,000 people a week were coming  across the border illegally.\n\nMr. PERRY. Secretary Mayorkas…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…training exercises and the humanitarian  assistance activities conducted primarily in African nations.\n\nThis funding supports the Defense Health Program, and those funds are  credited with scaling back the AIDS epidemic in Africa. This program  has long enjoyed support across party lines.\n\nMr. CALVERT. Mr. Chair, I rise in opposition to the amendment.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…After graduating from Windom High School, Jim attended St.       Olaf College and graduated with honors. He went on to Luther       Seminary and received his M.Div. Jim always credited his       older brother `Big John' for encouraging him to attend       seminary. Although this was not Jim's original path choice,       he received the calling from God and…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the interest back to the Social Security trust fund twice a year.  That is why there are certain months where there is this sudden, big  spike of interest payments that are credited to the Social Security  account.\n\nThe chart is the chart. About halfway through 2032, so 7 years from  now, the trust fund is gone.\n\nHere is the irony of our budgeting. When…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…teacher--of young people. He helped educate millions of young Americans  about patriotism and conservative moral values.\n\nHis organization, Turning Point USA, is largely credited with  President Trump's unprecedented success with young voters in this past  election.\n\nBut he didn't just reach out to conservative students. He was a  champion of free…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695705/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…which'' and       inserting ``trust fund which'';\n\n(B) in paragraph (3)--\n\n(i) by striking ``fund created'' and inserting ``trust fund       created''; and\n\n(ii) by striking ``credited to the fund'' and inserting       ``credited to the trust fund account''; and\n\n(C) in paragraph (5), by striking ``2025'' and inserting       ``2030''.       SEC. 4. WEIGHING…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…the Philippines in  December of 1941, Buzz quickly shot down five Japanese planes, making  him the first ace pilot of World War II.\n\nBy April of the following year, Buzz was credited with eight air-to- air kills, as well as numerous successful bombing runs on Japanese  airfields, one of which earned him the Distinguished Service Cross  citation.\n\nThough…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689611/supporting-reversal-of-california-ev-mandate"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…past the scene, Judie instinctively pulled over and used  her incredible medical knowledge to administer critical aid. Her swift  response stabilized his wounds, and she is credited with saving the  man's leg and possibly even his life.\n\nIt is selfless acts like these that exemplify the best of our  community, and I am honored to recognize Judie's heroism…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688226/recognizing-judie-kent"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…him the highest scoring American ace of the Vietnam war.\n\nOver the course of his career, Colonel DeBellevue flew 220 combat  missions, including 96 over North Vietnam. He is credited with the  destruction of six North Vietnamese jet fighters in aerial combat,  making him America's leading ace of that conflict and the last American  ace to serve on Active…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699080/9999"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…While providing escort for  allied bombing missions during World War II, the 55th Pursuit Group  earned two Distinguished Unit Citations, produced 16 fighter aces, and  was credited with 90 air-to-air victories.\n\nAfter World War II, in 1946, the group was deactivated, only to be  reactivated less than a year later as the 55th Reconnaissance Group  under…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689070/recognizing-the-55th-wing-85th-birthday"}]