[{"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Speaker, I think it is incredibly shameful that my  Republican colleagues want to gut the rule that capped most credit card  late fees at just $5.\n\nCredit card companies over the people we represent, that is what they  are choosing with this.\n\nWorking families, as many of us know, are struggling…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689837/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…congressional Republicans'  policies. We are already seeing inflation rise on consumer  goods as Trump's tariffs take place. Now, Republicans want to raise the  cost of auto loans, credit card fees, and mortgages for Americans by  forcing the dollar to become a relic of the past. That is why I will  vote ``no.''\n\nFurther, Mr. Speaker, Mr. Himes made a great argument…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693736/anti-cbdc-surveillance-state-act"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…Speaker, I am actually stunned as we stand here today  because, as my colleagues talk about their plan, what they are doing,  in reality, is giving billionaires the national credit card and telling  them to go hog wild, racking up $14 trillion in national debt over the  next 10 years so that large corporations can pay less in taxes. That  doesn't lower…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689918/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Menand idea deserves attention. Searching       for a talking point, the bill's sponsors claim the idea would       lead to a surveillance state. They seem unaware that credit       card firms, major banks, and other financial institutions       already own personal financial data. By the bill's logic,       they should be banned as well.\n\nFor questions,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…power into a few financial giants and money centers  reduces competition, and it results in Americans paying higher prices  for their banking services. That means higher credit card interest  rates, higher fees, higher auto loan payments, and unaffordable  mortgages. And when these banks become too big to fail, the entire  economy feels the pain when…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690769/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…chaos often brings. It becomes more expensive for people to  borrow. It makes it harder to own a home. It makes it harder to build  more homes. It raises car payments and credit card payments. It raises  the price of almost anything.\n\nSo if Donald Trump is serious about bringing costs down, about  fighting inflation, about showing the American people…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…Of course, all of those cuts, over $1.5 trillion worth, don't come  close to paying for the more than $5 trillion worth of tax cuts. Who  pays the remainder? Our national credit card does.\n\nHere we are, actually voting not just for the biggest loss of  healthcare in American history, but the biggest increase in our  national debt in American history.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693195/one-big-beautiful-bill-act"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…it to $24.9 trillion.\n\nHere is what is going on in the Republican family: While Musk and  DOGE scrounge around for change under the couch, Speaker Johnson is  running the credit card, bankrupting our Nation.\n\nThey are taking away your Medicaid to line the pockets of the  wealthiest Americans who are controlling our government.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688273/medicaid-cuts-mean-hospital-closures"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…in front of us today is a fiscal sacrilege. It  depends on fantasy math and ignores that their deficit-busting tax  breaks will add at least $4.6 trillion to our Nation's credit card and  even more interest that our families must pay.\n\nThis interest has real costs. It slows economic growth. It depresses  the standard of living. It leads to higher inflation…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…than 90 percent of public commenters urged regulators to  oppose a recent Capital One and Discover merger--I think the gentleman  supported that--which created the largest credit card issuer.\n\nThe Trump administration approved it anyway, and I know the gentleman  from Kentucky (Mr. Barr) did what Trump wanted him to do.\n\nWe already have enough megabanks…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…this.\n\nThis is why I am introducing the Tax Excessive CEO Pay Act. While  these CEOs float around on their yachts, millions of Americans, our  residents, are drowning in credit card debt and struggling to keep  their heads above water.\n\nThis level of inequality is a threat to our democracy, and this kind  of economic power concentrated in a few hands…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695276/taxing-excessive-ceo-pay"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…[totaled] $550,000.\n\nInsurance covered most of it, but it was still more than he       could pay. He made payment plans with all of his various       bills, but when his credit card number changed, some of the       automatic payments he had arranged for did not go through,       and the bills ended up in collection before he even knew he       was…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…FTC and CFPB have done important work in identifying the  most pressing scams and fraudulent activities that target veterans and  their families. These include scams like credit card fraud, investment  schemes, and imposter scams, which seek to impersonate government  officials, technology support, or even love interests to collect money  or gain access…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699190/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Washington and across the  Nation? Of course we should.\n\nFor far too long, our government has put the cost of not just  emergencies but everyday expenses on our Nation's credit card. Now, as  a result, our national debt is a staggering $36 trillion and growing  every day.\n\nMr. Speaker, I am willing to put my money where my mouth is, and that  is why…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688322/putting-your-money-where-your-mouth-is"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…and MasterCard. They will tell you.\n\nThis is a very formidable competitor to MasterCard and Visa now that  there is an approved merger between Capital One, a substantial credit  card business, a substantial payment business, and Discover with their  substantial network. You create a third option for consumers. That is  procompetition, not anticompetition.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Speaker, we had months last year when we had to borrow money to  pay for our borrowing. That is partially because the tax collection  cycle goes up and down, but we raise your credit card. We raise your  car. We raise everything. When we screw up U.S. sovereigns, we make  bond markets nervous. They go up 30 basis points. You have to  understand that just…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…experiencing high  prices because we are still recovering from Bidenomics.\n\nReal wages under President Biden declined by more than 3 percent.  Mortgage rates skyrocketed. Credit card delinquencies rose by over 50  percent. Bidenomics cost American families more than $11,000 every year  for the last 4 years.\n\nMr. Speaker, these are facts. They are documented.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…cleaning house rather than just accepting bad deals  because they are already in motion?\n\nLet's put it in terms we can all understand: If you saw a suspicious  charge on your credit card, would you just shrug it off and pay for it?  I think not. You would demand answers. You would challenge it. That is  exactly what DOGE is doing with your tax dollars.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688492/demanding-transparency-efficiency-and-accountability-from-our-government-is-not-extreme"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…ICE's actions in  Minnesota.\n\nLet's shed some light on what ICE has been doing. They arrested a  criminal illegal alien from Somalia with a record of multiple counts of  credit card fraud, drug possession, controlled substance possession,  and drug trafficking. This criminal was issued a final order of removal  in 2022.\n\nICE also arrested a criminal…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699072/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…high prices because we are still recovering from  Bidenomics.\n\nPrices are up 21 percent. Real wages have declined by more than 3  percent. Mortgage rates have skyrocketed. Credit card delinquencies  have risen by over 50 percent. Bidenomics cost American families more  than $11,000 every year for the last 4 years.\n\nNext, this budget resolution prioritizes…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…dismiss it.\n\nThen the final thing is, I am in a position now, without question, to  say that anyone who thinks that President Trump adopting Elizabeth  Warren's idea on capping credit card interest rates--it is literally  what the President said over the past week. They are not the  conservatives that I thought they were. Anybody that thinks this is a  good…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…Minnesota during their most recent operations.\n\nFor instance, our Federal law enforcement arrested a criminal illegal  alien from Somalia with a record of multiple counts of credit card  fraud, drug possession, controlled substance possession, and drug  trafficking. By the way, this criminal was issued a final order of  removal in 2022. Of course, that…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…today, because time and time again people take advantage of  affordable, convenient, disclosed, not hidden overdraft protection so  that their family can avoid a late fee on a credit card, which she just  gave an excellent overview of her concerns about.\n\nIf we want to do that, then give people the financial tools that they  have in overdraft protection without…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Mastercard. They dominate the payment system in  the United States. Banks are behind the credit cards, so they are in  the scene, too, but fundamentally when you transact with a credit card  people think, well, that is digital, and you are using a credit card  company.\n\nWhat they do really is amazing. For a relatively small fee, they  guarantee that it really…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…some of us, we are stressing about: How do I not let the taxes go  up? How do I not play the scam of, ``Here, we are going to extend the  tax cuts,'' and, ``Here, give me a credit card so I can charge it to  you''? That is the scam.\n\nMr. Speaker, is it really economically honest? We have a great set of  data that shows if we borrow the money at the end…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…every day. We have got to do things like this so we are not  competing with you or your family trying to get a mortgage, trying to  get a car loan, trying to see what your credit card interest rates are  going to be.\n\nThink of this, in the last 12 months, half of all the debt in the  U.S. bond markets, half of it has just been the United States Federal…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…was stolen, a child must become victimized by actual  fraud before the Social Security Administration will give them a new  number.\n\nThat is ridiculous. If my bank issued a credit card and I didn't  receive it in the mail, they wouldn't send me another copy of the same  card. They would cancel the old one and send me a new card. Why would  we treat our…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697265/social-security-child-protection-act-of-2025"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…success.\n\nWe think about how much has happened in five decades. Fifty years  ago, women were still battling for so many rights, not just equal pay.  They could not get a credit card without a male cosigner. They had no  protections against pregnancy discrimination or sexual harassment. They  could not serve on juries, and they did not have the ability…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689367/womens-history-month"}]