[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…home State of Oregon every summer, and the threat is growing.  I am here today to speak out against cuts to programs that support  wildland firefighters and their frontline crews.\n\nFor years now, American families in the Pacific Northwest have lived  on the edge, wondering if this will be the year they are forced to flee  their homes at night with only…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692450/wildfires-in-oregon"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…tangled in fishing gear, or broken down into microplastics that end up  in the food we eat. Across the country, communities see the damage  every day.\n\nIn the Pacific Northwest, crews use Marine Debris Program grants to  remove abandoned and derelict vessels--rusting tankers that leak fuel,  collapse into waterways, and scatter debris with every storm. These…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698190/save-our-seas-amendments-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…just  uncomfortable, they are life-threatening for millions of workers across  the country.\n\nFrom agricultural workers in the fields, to warehouse employees, to  construction crews and factory staff, many are laboring in extreme heat  with no Federal protection from one of the oldest, most serious, most  common workplace hazards, and that is, of course,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695655/extreme-heat-caucus"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…they keep  all of us healthy, safe, and protected; putting their lives on the line  for the benefit of the community.\n\nAs a former volunteer firefighter myself, I thank the crews operating  out of the new Aldie Fire Station for their service and dedication to  our community.                   Effects of Big, Ugly Bill on Virginians\n\nMr. SUBRAMANYAM.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692238/backlog-in-irs"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…Speaker, early last year, the Flat fire burned over  23,000 acres of land in central Oregon, destroying homes and forcing  thousands of people to evacuate.\n\nOur historic fire crews were eventually able to contain the fire, but  they were unnecessarily delayed because someone was flying a drone in  the area, and it punctured a hole in the plane.\n\nOur historic…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698693/delayed-wildfire-response-efforts"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Act led by Democrats and Republicans representing Ohio. It is one  of the most comprehensive rail safety proposals before Congress.\n\nThe bill would require two-person train crews and increased  inspections, especially for trains carrying hazardous materials. It  would strengthen emergency notification so first responders are not  left in the dark. It…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699687/norfolk-southern-train-derailment"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…serious consequences, particularly for Hawaii.  My home state is not just a waypoint for the U.S. South Pacific fleet,  it is a central base of operations, home to many of the crews,  companies and services that keep the industry running. The fishing  industry supports good-paying jobs across the Hawaiian Islands and  ensures our communities have access…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691007/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…will continue to fight  back and win.\n\nLet me be clear: Defunding NOAA will hurt Oregonians, Americans, and  people across this country. It puts the lives of fishers and their  crews at risk. It leaves towns without early warning. It undermines  economies built on tourism, shipping, and fisheries.\n\nSlashing the budget of NOAA doesn't save money. A 2019…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691327/noaa-contributes-to-our-economy-and-well-being"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, it is wildfire season in Oregon, and the  Trump administration is making it harder for fire crews to do their  jobs. I met with them, some of whom voted for the President. They told  me that the funding cuts are a problem, and they don't have the  resources they need.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694775/fighting-fire-with-fire"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…investigations and reports are so crucial.\n\nThese NIOSH reports are critical for firefighting communities in  Maryland and around our country because they save lives. When released,  crews across this country gather around kitchen tables and read the  reports together.\n\nIn Maryland, our firefighters have told me that in those moments and  for the first time they…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689637/protecting-and-serving-our-firefighters"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…designed for warfare,  not interdiction or law enforcement.\n\nThe administration has offered no positive identification for those  killed, nor any information linking the boat crews to cartels. In fact,  they have not proven that these vessels were engaged in drug  trafficking, nor even that they were destined for the United States.\n\nI would note that…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…known, flew  more than--get ready for this--15,000 sorties between 1943 and 1945,  earning a reputation as some of the most skilled pilots in the United  States military.\n\nBomber crews specifically requested their escort, knowing the  Tuskegee Airmen would protect them against enemy attacks. They were  angels in the sky. They were so brave. They fought not…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…hurricane, and all  the power poles had just toppled over. It is almost as if you were  playing dominoes. They weren't touching, but they all toppled just like  that. And there were crews from around the country that had been-- electrical crews that had been mobilized to come and reinstall those.\n\nIf you hardened the grid, that doesn't happen. If you harden…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…vast scope of additional  regulatory documents that impact small businesses. These are guidance  documents, memoranda, bulletins, circulars, letters, and more, which  Wayne Crews, a fellow in regulatory studies at the Competitive  Enterprise Institute, has more properly referred to as regulatory dark  matter.\n\nOnly rules that are adopted pursuant to…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697347/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…vessels, deploying to the  Caribbean, eastern Pacific, and the Middle East. He also served as an  Aids to Navigation Officer in several major ports, supervising cutters  and crews responsible for maintaining critical waterways and restoring  navigation systems following hurricanes and other emergencies.\n\nIn the later years of his career, CWO4 McInnis…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698462/recognizing-united-states-coast-guard-cwo4-james-mcinnis-as-december-2025-veteran-of-the-month"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…upon.\n\nThe breadth and severity of this disaster have left swaths of the  Delta and north Mississippi with landscapes littered with shattered  trees and downed power lines. Line crews in this bitter cold from  Mississippi and other States are making steady progress in restoring  power to nearly 200,000 families and businesses that lost power. While  we applaud…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699701/9999"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…of Kentucky are just now  recovering from a devastating flood that we saw a few weeks ago. I  thank the first responders who were first on the scene, and thank our  utility crews who worked day and night to restore utilities.\n\nI want to let the families who lost everything know that if there is  anything my office can do to be of any assistance, don't…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690765/recovering-from-north-carolina-floods"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…be fine'', which carries weight  with everyone who knew him.\n\nFrank took immense pride in being a Night Stalker. These men and  women are some of the best rotary wing aviator crews in the world.  Frank's attention to detail, his skills, and his tenacity drove him to  join this elite regiment.\n\nFrank was very proud of both of his sons, Frank E. Cook IV…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696142/recognizing-frank-esten-cook-iii-and-his-service-to-his-country"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…support of the global war on terror. I have responded and helped with  tragedies in Boulder, Colorado, both as a National Guardsman fighting  wildfires, putting together the crews, and deploying the aircraft. I  also served as a police officer on the honor guard who has stood with  our colleagues in Boulder when they lost an officer in 2021 in an  active…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…stacked onto the mobile launch  platform. Just days ago, the core stage has been integrated with the  boosters, a major milestone in the path to launch.\n\nIn the coming months, the crews at the KSC will add more hard work to  the SLS, culminating in securing the Orion spacecraft to the top. The  Artemis II mission is currently on track to launch in April of…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689663/recognizing-extraordinary-work-of-kennedy-space-center"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…innovation at every turn.\n\nLeMaster's growth is a testament to their hard work, skill, and  dedication to its workforce: expert supervisors, veteran foremen, and  hardworking crews whose craftsmanship and professionalism have earned  the respect of clients across Indiana and beyond.\n\nBeyond their business success, LeMaster Steel Erectors has become a…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693965/9999"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…airport development.\n\nIn cold weather States like Wisconsin and many others across the  country, safe and efficient deicing operations are essential to keeping  passengers, crews, and cargo moving during winter months.\n\nAircraft are uniquely sensitive to any amount of ice and snow that  accumulates on the airframe, causing irregularities that add weight,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695009/facility-for-runway-operations-and-safe-transportation-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…monologues for American sons like Travis? Where were CNN and  MSNBC? Where were the New York Times and the Washington Post? Where  were the armies of journalists and camera crews to tell their stories,  to interview their grieving parents, to regale us all with stories  about their kindness and their decency and their innocence?\n\nWhere were Chuck Schumer…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Under a Schumer shutdown, those plans will be forced to be canceled.\n\nLocal businesses like hotels, restaurants, they will lose revenue.  Park staff are reduced to skeleton crews. Trash piles up. That is not  stewardship. That is neglect.\n\nThat is what the Democrats are risking. It is what Democrats are  threatening with this reckless talk of a shutdown.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695529/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…fight of today, and the U.S. gets  to be a leader in our ability to help present this.\n\nThe second supports the MAPS Generation II, a next-generation system  that allows vehicle crews to operate in GPS-denied environments,  preserving our battlefield advantage.\n\nAs someone who has flown combat operations in environments where GPS  denial can be a critical…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693653/department-of-defense-appropriations-act-2026"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…P-47s red, the nickname ``Red Tails'' was coined. The red markings that  distinguished the Tuskegee Airmen included red bands on the noses of  their P-51s.\n\nSome of the bomber crews who flew some of the most dangerous missions  during World War II called them the ``Red Tail Angels.''\n\nIn combat during the war, they flew over 15,000 sorties, escorting…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696983/tuskegee-airmen-moment-of-silence"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…9 full-time dedicated  employees, the Association is known for its unwavering professionalism,  safety, and reliability. Their efforts not only safeguard ships, cargo,  and crews, but also help maintain the physical and economic integrity  of the waterways they serve.\n\nThe Association's contributions extend beyond maritime operations.  Through community…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694741/recognizing-the-lakes-pilots-association-for-over-60-years-of-service-to-the-great-lakes-maritime-community"}]