[{"senator": "Robert Garcia", "party": "Democrat", "sentence": "Mr. Speaker, I stand tonight to strongly oppose this bill, which  repeals commonsense criminal justice reforms that were passed by D.C.'s  elected representatives in the wake of George Floyd and the Black Lives  Matter movement.\n\nMr. Speaker, we know that cities and communities…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696935/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…director for the  National Alliance on Mental Health Illness Minnesota, she helped pass  over two dozen landmark laws that reshaped education, healthcare,  housing, and criminal justice to better serve people living with mental  illness.\n\nSue championed legislation to require mental health training for  teachers and expanded crisis and early intervention…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691125/recognizing-sue-abderholden"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…expand the  President's gross overreach, and make things worse.\n\nThe bills proposed by my Republican colleagues will worsen the  already rampant injustices we see in the criminal justice system, make  law enforcement more dangerous, and steal the futures of many of our  youth.\n\nThese bills all send the same statement to Washingtonians: The  administration…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695638/district-of-columbia-policing-protection-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…off of her  committee--this, a distinguished former Federal prosecutor, diligent  public servant, and Representative of the people of the Virgin Islands.\n\nMr. Speaker, criminal justice has two parts to it. One is insisting  upon legal accountability for people who do wrong. The other part of it  is due process, which may be the two most beautiful words…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Government shutdowns the Federal and independent  agencies that are exclusively or primarily federally funded but have  jurisdiction over local District of Columbia civil and criminal justice  matters. This bill is modeled on a provision I have gotten enacted each  year since the 2013 Federal Government shutdown to exempt the D.C.  government from Federal Government…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695983/introduction-of-a-bill-to-provide-for-interim-appropriations-for-the-district-of-columbia-courts-and-related-agencies-with-respect-to-any-fiscal-year-for-which-appropriations-are-not-otherwise-provided-for-such-courts-and-agencies"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…scrutiny. This bill would set a dangerous       precedent, eroding basic civil liberties and undermining       decades of legal precedent that protect fairness in our       criminal justice system.        Vote NO on H.R. 5107--``The Common Sense Law Enforcement and                      Accountability in D.C. Now Act''\n\nCongress should reject H.R. 5107 because…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…creation of the Federal probation system that  we rely on today.\n\nThe probation and pretrial services system have become a backbone of  the Federal judiciary and the Federal criminal justice system. Over the  past 100 years, the Federal probation system has grown to employ around  7,600 personnel who work behind the scenes to assist judges and those  involved…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688716/centennial-of-the-probation-act-of-1925"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…government and what it looks like for  bipartisanship, and I hope we are able to do more of this going  forward.\n\nMr. Speaker, I rise today for the sake of an effective criminal  justice system. The laws within our criminal code, as has been  expressed before, have become outdated and a highway to  overcriminalization. We have so many unlawful acts within…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697206/count-the-crimes-to-cut-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…left the door open for an off-ramp to  substances found to have potential medical applications. However, this  Republican bill would also exacerbate inequities in our criminal  justice system because drugs placed on schedule I include mandatory  minimum sentencing. S. 331 also does not provide additional resources  for prevention, treatment, recovery,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…was born and raised in the City of Tracy and moved to  the community of Merced in 1995 where she has resided for 30 years. She  earned her Associate of Arts degree in Criminal Justice from Merced  Community College in 2012. Ms. Fragoso has owned the Farmers Insurance  Agency in downtown Merced, with more than 20 years of insurance  expertise.\n\nDuring…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695992/recognizing-annissa-fragoso"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…of sustained officer misconduct cases, and the       prohibition of the possession or acquisition of military       weapons by law enforcement agencies.\n\nHistorically criminal justice laws and policies have been       determined by local jurisdiction based on their specific       needs. Several other jurisdictions have enacted policies       similar…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697021/opposition-letter-by-the-naacp-legal-defense-and-educational-fund-inc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…County Sheriff's  Office in March of 1994 after taking a tour of the Adult Detention  Center (ADC) and liking what he saw.\n\nSince his graduation from the Fairfax County Criminal Justice  Academy, he has spent the majority of his career in the ADC but has  served with distinction in all areas of the agency, including court  security and internal affairs.…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696033/recognizing-lieutenant-colonel-jabar-shabazz-on-his-retirement-from-the-fairfax-county-sheriffs-office"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…bills queued       up for floor votes in the House attacking the District of       Columbia. These bills would severely erode DC's already       limited control over its criminal justice system and leave       individuals and organizations in DC at the mercy of this       administration as they continue implementing an authoritarian       agenda. These…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696946/opposition-letter-led-by-free-dc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…address it.\n\nDespite some progress towards justice for victims and their families,  Trump's budget announced Friday strips millions of dollars from public  safety and criminal justice programs across Indian Country. We have the  unique trust responsibility to our Tribal Nations and rarely, if ever,  has our Federal Government delivered.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690670/expression-of-outrage-on-national-day-of-awareness-for-missing-and-murdered-indigenous-women-and-girls"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…systems (sometimes confusingly referred to as ``cashless       bail'') do not cause or increase crime. The data on this is       clear. A study conducted by the DC Criminal Justice       Coordinating Council found that in a recent six-month period,       not a single person released after being charged with a       violent or dangerous crime was…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696958/opposition-letter-led-by-tzedek-dc-on-the-district-of-columbia-cash-bail-reform-act-of-2025-hr-november-2025"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…said contributed to the strong work ethic he carries with  him today.\n\nAfter graduating from Hancock Public Schools in 1975, Mr. Maki earned  an associate's degree in criminal justice from Suomi College, followed  by a bachelor's degree in criminal justice from Northern Michigan  University. While at NMU he worked multiple jobs as a student building…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696858/recognizing-donald-maki-on-his-induction-into-the-upper-peninsula-labor-hall-of-fame"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Congressional Patriot  Award. Lane has dedicated himself to faithfully serving and protecting  our community.\n\nA native of Greenville, Texas, Lane earned his bachelor's degree in  criminal justice from East Texas A&M University. He began his lengthy  law enforcement career in 1974 as a Department of Public Safety officer  at Dallas Fort Worth International Airport.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690196/recognizing-congressional-patriot-award-recipient-sheriff-lane-akin"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…of 22  deaths per week in 2022.\n\nFentanyl is the number one cause of death among adults 18 to 49, more  than cancer, heart disease, and car accidents. This isn't about  criminal justice reform. This is about victims getting justice.\n\nCurrently, to trigger a 10-year mandatory minimum, an offense must  involve 100 or more grams of a mixture containing a…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692343/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…and  that some have been released from the hospital. I hope they heal up  safely and  that they know that we are eternally grateful for their bringing a  transnational criminal to justice--hopefully so--as he goes through our  court system.                                     NATO\n\nMr. President, I am also here to talk about what I think is  amateurish…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…dissolution of the Biden bureaucratic  barrage and for safety in their communities. From bolstering American  energy dominance to upholding law and order, strengthening the criminal  justice system in our Nation's Capital to rejecting the failed ideology  of socialism, House Republicans continue to deliver measurable and  substantive progress.\n\nI urge my…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696902/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…rise today in regard to the latest  stabbing on the Charlotte Area Transit System of Iryna Zarutska. It is  just the latest awful example of what has gone wrong with our criminal  justice system.\n\nMr. Speaker, today, I felt compelled to tell my daughters to be  careful.\n\nThis suspect had been arrested 14 times, including for violent  offenses. Despite…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695036/failed-social-experiment-backfiring-on-our-communities"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…purveying it, creating it,  growing it, and creating it chemically.\n\nWhat the Energy and Commerce Committee is doing, today we are doing  the HALT Fentanyl Act to address the criminal justice side of it.  However, my friend from New Jersey is correct, what also has to be  addressed are the issues affecting people that are suffering from  substance use disorder.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692351/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…conclusion--the only conclusion is the law  is insufficient as it is currently drafted.\n\nWe are in Congress to make laws to protect Americans. When we have  such gaping holes in our criminal justice law as it relates to illegal  immigrant criminals, not dairy workers, not those who are not  committing crimes, the conclusion is straightforward. We need to change  the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Victoria Spartz", "party": "Republican", "sentence": "…Larkin  is also a referee for many local high school sports leagues. Deputy  Larkin is a graduate of Ole Miss University. He has given back to his  alma mater by teaching a criminal justice course as a guest lecturer.  Deputy Larkin also serves on a criminal justice committee at the  school.\n\nDeputy Larkin's professional contributions have had a lasting impact…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689236/recognizing-deputy-jeff-larkin"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…previously served as chief of police in Garden City,  Georgia, a position he held for 16 years. While serving as Garden City  police chief, Marshal Lyons was appointed to the Criminal Justice  Coordinating Council and was elected to the Executive Board of the  Georgia Association of Chiefs of Police.\n\nBefore his service as the Garden City police chief, Marshal…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693004/fletc-celebrates-55-year-anniversary"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…the  Federal courts. Our Nation's probation officers and staff do deeply  difficult and too-often unheralded work that plays a critical role in  the functioning of our criminal justice system, and I am committed to  doing what I can in the U.S. Senate to support them in what they do. I  firmly believe that we owe them a debt of gratitude for their service,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688481/probation-act-of-1925"}, {"senator": "John Carter", "party": "Republican", "sentence": "…tracking abilities and technical  expertise.\n\nAfter leaving the Navy, LT Frick pursued higher education at the  University of Texas at San Antonio, earning a degree in Criminal  Justice with a minor in Sociology. He continued his dedication to  public service by beginning his civilian career with the Texas  Department of Public Safety (DPS).\n\nAt DPS,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689331/saluting-the-service-of-lieutenant-brian-m-frick"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…included criminal investigator, patrol supervisor,  SWAT/sniper team lead, SWAT/police sniper instructor, and military  police officer basic instructor. Dave also taught criminal justice for  Central Texas College while stationed in Okinawa, Japan.\n\nDave's life is one truly defined by his service. His commitment to  our community, to our great State, and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698763/recognizing-david-mcmahon"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…implementing a successful DUI curriculum  for local law enforcement personnel. This training program was so  successful that it was later expanded to the South Carolina Criminal  Justice Academy and the Commission on Prosecution Coordination.\n\nMac continued his career in South Carolina serving as the in-house  Counsel for the Georgetown County government.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…our justified pride in intellectual accomplishment, we must never  forget the jungle is always there waiting to take us over.''\n\nHe observed that the liberal belief that criminal justice is solely  for rehabilitation instead of incapacitation and deterrence is rooted  in ``a belief that there was nothing permanent or absolute about any  man's nature .…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}]