[{"senator": "Sean Casten", "party": "Democrat", "sentence": "…billion in their bank account. The Trump family will  earn about $30 million off this transaction, and Mr. Zhao is now asking  for a pardon.\n\nThese bills will make all of those crimes easier, and if we build it,  crime will come.\n\nWhen the crime happens, when the President gets richer, Mr. Speaker,  when your bank fails, when your deposits are wiped out,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693618/crypto-used-by-criminals-and-corrupt-politicians"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…the  criminal activities of Jeffrey Epstein and all who enabled, all who  knew and did nothing, and all who participated in some of the worst  sexual abuse and trafficking crimes our country has experienced.\n\nThis will expose the rich, the powerful, and the self-entitled who  were involved in these crimes and who did it for the worst possible  reason,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696954/release-of-epstein-files"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…of us live in your districts. We look to you to       represent us. We deserve for you to represent us.\n\nWe implore you to stop protecting those who enabled       Epstein's crimes and instead stand firm in protecting the       women and children he harmed. Stand up against abuse of       power. Take action to end the silence and speculation       surrounding…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695788/a-letter-from-survivors-of-jeffrey-epstein-and-ghislaine-maxwell"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…when he pardoned so many of the individuals convicted after January 6.\n\nAt least 13 individuals who have been pardoned by President Trump  have gone on to commit additional crimes, including sexual assault  against a minor and a fatal DUI.\n\nInstead of promoting accountability and rehabilitation, when  possible, in our justice system, shouldn't the President…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698990/condemning-the-january-6-pardons"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…vicious abuse, including those responsible for  enabling it, ignoring it, bankrolling it, and covering it up.\n\nWe join them today in rejecting any more dangerous lies about the  crimes they suffered. No, child sex abuse is not a hoax. It is a crime.  Human trafficking is not a hoax. It is a crime.\n\nThese crimes are a curse on children and young people across…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696807/epstein-files-transparency-act"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…ever imagine that you would be  in a party that stands on the side of dictators or on the side of a  country who has killed journalists, with an authoritarian accused of  war crimes, and a man who assassinates his political opponents?\n\nAren't you embarrassed by what you have become?\n\nIt is revolting to watch my colleagues side with Russia because Trump…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687904/putins-merciless-war"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…opposite from  this administration. We have seen career FBI agents, people who have  risked their lives for this country, forced out of their positions  simply for investigating crimes committed in the January 6  insurrection. These were professionals following the law, performing  their sworn duties, and yet their service was treated as disloyalty.  Careers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…be held to  account.\n\nMr. Speaker, I am happy to yield to the gentleman if he would join  with me in publicly condemning the pardon of all those who committed  such heinous crimes and so much violence here on the Capitol on January  6.\n\nI can tell you one thing, Mr. Speaker, Governor Newsom is not going to  pardon those who looted stores or committed…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…backtracked on.\n\nThis bill is bipartisan, and it is the only legislation on Epstein  that has the force of law. It has the votes to pass. The survivors of  Epstein's and Maxwell's crimes spoke today at the Capitol demanding  this very bill get passed. Republican leaders need to stop standing in  the way, and now is their chance.\n\nMr. McGOVERN. Mr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…most consequential tool  Congress to has protect our Nation from a president or other public  official who has betrayed their oath, abused their power, and committed  high crimes and misdemeanors against the American people. Impeachment  necessitates a deliberate process of investigation and a thorough  documentation of crimes committed  against the…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698091/concerns-with-h-res-939"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…child  exploitation. The Cyber Tip Line has received many more reports of  sextortion of minors in recent years, amounting to tens of thousands of  potential victims. These crimes have deadly consequences.\n\nNCMEC has identified 36 teens who took their own lives after being  subjected to harsh and incessant harassment from callous perpetrators  of sextortion.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698862/combating-online-predators-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…Bluebonnet.  Nearly 700 of them, almost two-thirds, were designated by ICE itself as  a low threat. Let me repeat: Hundreds of people with no violent  history, no record of serious crimes, targeted solely because of the  color of their skin, were denied their constitutional rights and then  locked away in a detention center.\n\nI met with several detained individuals.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695521/visit-to-bluebonnet-detention-facility"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…unfit. They have ordered dozens of illegal strikes on  alleged drug boats in the Caribbean without congressional approval.  This week, we have learned they likely committed war crimes by ordering  a second strike targeting and killing survivors.\n\nAt the same time, President Trump is pardoning criminals like Juan  Orlando Hernandez, the former President of…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697535/venezuela-boat-strikes"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…are  some of the most prosecuted laws in our country every single year. This  bill would add ridiculous mandatory minimum sentences, potentially  going up to life, onto the crimes of unlawful entry and reentry.\n\nMr. Speaker, this makes no sense on multiple levels. If the  administration is seeking to deport ``the worst of the worst,'' why put  them into…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695359/stop-illegal-entry-act-of-2025"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…address sexual assault and sexual harassment.\n\nOur coasties deserve better, and this legislation provides oversight  and the tools needed for the Coast Guard to prevent these crimes,  protect victims, and hold perpetrators accountable.\n\nMoreover, I am proud that this bill includes several provisions that  I sponsored regarding U.S. merchant mariners. This…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694192/coast-guard-authorization-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Columbia criminal code.\n\nIt is clear to Members of the committee and the public that D.C.'s  soft-on-crime policies have failed to keep D.C. residents and visitors  safe.\n\nThe DC CRIMES Act overturns targeted portions of the D.C. Council's  Youth Rehabilitation Act by amending the definition of a ``youth  offender'' from a person under the age of 25 to under…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695558/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Count the Crimes to Cut       Act''.       SEC. 2. REPORT ON FEDERAL CRIMINAL OFFENSES.\n\n(a) Definitions.--In this section--\n\n(1) the term ``criminal regulatory offense'' means a       Federal…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697203/count-the-crimes-to-cut-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Kamala Harris' San Francisco.\n\nAs a result, you are seeing law enforcement throughout California  that now has a new ability to restore order and arrest people who  commit crimes. We are starting to see real improvements across the  State that we have not seen in a very long time.\n\nFive, when it comes to high-speed rail, the biggest public  infrastructure…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…rule take direct aim at those failures and  restore accountability where the D.C. council has refused to act.\n\nThe rule also provides for consideration of H.R. 4922, the D.C.  Crimes Act of 2025. This legislation reasserts congressional oversight  over the District by prohibiting the D.C. council from further pursuing  its progressive, soft-on-crime sentencing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…to best question  Cohen, and Cohen was himself at that time a convicted felon from 2018.\n\nSo now that Republicans are exposing Democrat ties to Jeffrey Epstein  and his vile crimes, the other side of the aisle has flipped. They  apparently no longer want transparency or accountability.\n\nWhy?\n\nIt is because they don't want the truth. They want to weaponize…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696888/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…land.\n\nYet, we find ourselves in a position as conservatives where our  warnings of the past echo upon a nearly empty Chamber as we discuss the  horrors of the day and the crimes that have been committed upon the  citizens we are sworn to serve that need not have been committed. This  is because of the culture that we have allowed to spread across our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…well as my Republican colleagues on the House  Oversight Committee, want to know what really happened. We want to know  what went on and who was involved in these unspeakable crimes. We want  justice for the survivors. That is why we are doing this investigation.\n\nThe House Oversight Committee obtained over 30,000 pages of documents  from the estate. Unlike…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697128/irrefutable-evidence"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…that got raised is  Minnesota. She talked about a couple of immigrants who have been  arrested. We don't have any problem about enforcement and arresting  people who commit crimes. In fact, we have had Democratic Presidents do  that. Obama deported more people than Trump has, but he went after  people with criminal records.\n\nMr. Speaker, 80 percent of…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "Mr. KNOTT. Mr. Speaker, I have been very supportive of this effort,  specifically to bring justice to the victims of this horrific series of  crimes. However, I have worked behind the scenes to raise concerns with  this petition as it is currently drafted.\n\nSpecifically, I believe that there is a grave risk of harming…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696815/epstein-files-transparency-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…time.\n\nCheck fraud is a major challenge in this country, and it has grown  exponentially over the past several years. In fact, in 2022, the  Treasury Department's Financial Crimes Enforcement Network reported  over 680,000 instances of check fraud, doubling the previous year's  total. In such an environment, it is unacceptable that at this moment  the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689291/recovery-of-stolen-checks-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…illegal aliens from  being turned over to ICE for deportation. Instead, they released them  back into our communities, where many have gone on to commit even more  heinous crimes.\n\nRecently, when Federal officers served a criminal warrant on a  southern California marijuana farm, activists staged a riot. Officers  liberated 12 minors forced to work…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694126/sorry-not-sorry-for-immigration-enforcement"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…and  think the only people that should be removed from this country after  Joe Biden left about 10 million people in the country illegally are  people who committed serious crimes. That is ridiculous. Of the 10  million people that Joe Biden let in or 8 million people, whatever,  obviously it is up to ICE to remove as many as possible and get back to…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698892/confusion-over-who-should-be-removed-from-this-country"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, I have consistently called for  the maximum possible level of transparency when it comes to the heinous  crimes of Jeffrey Epstein. That is why I have consistently said that I  am inclined to vote for this bill, and it is why I will be doing so  today.\n\nThe victims deserve the truth.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696819/epstein-files-transparency-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…None.............  ....................                                   of America Act of                                   2025, as amended. H.R. 2159......................  Count the Crimes    Increase by Less    None.............  Includes                                   to Cut Act. as      Than S500K.                            insignificant costs…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697267/expanding-wksi-eligibility-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…Mr. Speaker, 78 percent of Somali immigrants in Minnesota alone  receive welfare benefits, even after being in the United States for 10  years or longer. Somali men commit crimes at rates significantly higher  than Americans, and only about half of Somali immigrants can speak  English very well. Again, that is even after being in our country for  over…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699749/somalia-immigration-moratorium"}]