[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…whole idea, in my mind, is a  veiled attempt to repeal the expanded coverage that we saw for Medicaid  under the Affordable Care Act. Why is that important?\n\nWell, it is critically important because Medicaid has been the  cornerstone of, in the Affordable Care Act, expanding care to working  families that could not find an affordable insurance policy. Medicaid…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…to talk about how the Affordable Care Act expanded insurance to  millions of Americans, how Medicaid expansion expanded insurance to  millions of Americans, and how critically important that health  insurance coverage is to a full-term birth with a nonfatal outcome for  mother and child.\n\nIn the middle of the week, with several other mothers of preemies,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…manmade disasters when interagency support is  requested.\n\nDOD's ability to respond rapidly with extensive manpower,  transportation, and communication capabilities is critically important  in a time of crisis.\n\nWhen we assist in filling in these capability gaps with our partners,  we help contain the crises and limit threats to regional stability by…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…traditionally hard-to-reach  populations. Students, in particular those working through their AHECs,  are more likely to remain in the communities where they trained, making  it critically important to establish training opportunities in rural  and underserved areas.\n\nThe need to strengthen the healthcare workforce continues. According  to new data from the Association…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689246/national-ahec-week"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…indigenous environmental leader Berta Caceres and members of  cooperatives in the Aguan Valley, where land rights defenders continue  to be targeted with violence. It is critically important that Honduras'  next President reaffirms the government's commitment to such a  commission and strives to make it a reality.\n\nIt is in the interest of the United States…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696472/honduras"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…normalize that doctors and nurses in the United States have had to  become expert in managing war wounds. The toll it takes on them is  real. This event reminds us of how critically important our level 1  trauma centers are in our communities. They are lifesaving, and these  hospital workers are our heroes. I am immeasurably grateful.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694875/recognizing-the-brave-hospital-workers-to-the-annunciation-school-shooting"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…disastrous Iraq  War, I believe that a war to enact regime change in Venezuela would be  a catastrophic decision. That is why these two war powers resolutions  are so critically important,\n\nPresident Trump and his administration are out of control. The  Constitution grants Congress the power to declare war and authorize  military action. Because Congress…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698418/supporting-of-h-con-res-61-and-h-con-res-64"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…we work hand in hand to serve  our children. Next week, the supporters of Head Start from across  Metropolitan Atlanta will gather to wish a happy birthday to this  critically important Federal program.\n\nMr. Speaker, 60 years ago, President Lyndon Baines Johnson spoke from  the Rose Garden to announce the opening of 2,000 child development  centers…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691246/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…of       Columbia. We stand in support of the JNC's current role and       configuration, and we look forward to continuing to serve our       city in discharging our critically important       responsibilities.            Respectfully Submitted,\n\nFor the Commission:\n\nHon. Marie C. Johns, PPC-Leftwich, Washington, DC.\n\nBenjamin F. Wilson, Esq., Washington,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…participation was a permissible use of leave under the Family and  Medical Leave Act (FMLA). Like other chronic and rare disease patient  populations, clinical trial access is critically important for patients  with sarcoidosis, as there is no cure and there is a lack of treatment  options. When requesting time off to participate in clinical trials,  some patients…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689983/recognizing-the-month-of-april-as-sarcoidosis-awareness-month"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…the Wild West to continue.\n\nThis will protect consumers and ensure that the Trump coin and others  are overseen, with protection and oversight from the CFTC. It is  critically important for protecting consumers and protecting our  country.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693833/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…fiscal year 2025  enacted level for entrepreneurial development programs at the Small  Business Administration. The ranking member mentioned that program, but  it is critically important to our communities and to the small business  community.\n\nThis bill also increases funding for election security grants by $30  million. I created that program, along…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699056/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…President, it feels good. It feels good to see the  Senate actually passing legislation. It is rare. It doesn't happen a  lot. With a measure of this importance, it is critically important that  we come together, both political parties.\n\nI want to thank Congresswoman Ocasio-Cortez for her leadership on  this issue and her bravery on this issue throughout…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…neighbors and support services, who  offered on-the-scene support to our emergency responders and who  continue to support those impacted.\n\nMr. Speaker, mental health is critically important. I want to stress  how many people have been impacted by this tragedy and how important it  is that we connect folks to resources and help.\n\nFinally, I thank all the…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688368/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…must be able to live safely and fully  rebuild their lives after disaster strikes. I urge my colleagues on  both sides of the aisle to support this legislation. It is critically  important for our families.                 Ending Corporate Greed Through Price Gouging\n\nMs. TLAIB. Mr. Speaker, families in our communities are facing an  affordability crisis.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694896/providing-recovery-for-flood-victims"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…need to build and scale businesses. Access to capital is  not just a coastal issue. It is a national economic necessity.\n\nThis capital divide is why the DEAL Act is so critically important.  This bill is a targeted, forward-looking effort to modernize outdated  rules and channel investment to where it is needed most.\n\nThe DEAL Act fundamentally strengthens…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697190/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…Riley,  with Forbes Field, the 190th Air Refueling Wing, and other important  military assets.\n\nI will highlight just a couple of provisions in this bill that are so  critically important to the people that I represent.\n\nObviously, with the continued focus on servicemember and family  quality of life, the 3.8 percent pay raise is vitally important to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695108/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…with the Federal Government to proactively identify and patch  vulnerabilities in information systems before a cyberattack takes  place.\n\nMr. Speaker, we all know how critically important it is, particularly  with systems that are older than some of us in this room, that these  vulnerability disclosure policies require these third parties to notify  the…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688359/federal-contractor-cybersecurity-vulnerability-reduction-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…prices at the pump  might cancel a family vacation, then you should care about reversing  ill-advised lockups of our energy and mineral resources.\n\nEnergy production is critically important to the Western way of life,  sustaining small rural communities and generating much-needed economic  activity. Passing this CRA will save an estimated 12,000 jobs in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…District home.\n\nMr. Speaker, I thank Representative Donalds for sponsoring this  important legislation and applaud Chairman Comer for his steadfast  leadership on this critically important issue.\n\nMr. Speaker, I urge all of my colleagues to join me in supporting  H.R. 4922.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695563/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…strong national defense. We  bolster our national defense in this resolution.\n\nWhy does President Trump call it one big, beautiful bill? It is  because it does a lot of critically important things all in one  resolution that helps get this country back on a strong footing.\n\nWhat else it does is it produces incredibly needed savings, Mr.  Speaker, savings…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…today is whether or not this body is going to pass,  to enact, to approve H.R. 2243, the LEOSA Reform Act. That is the sole  question in front of us.\n\nThat measure is critically important to the safety of many law  enforcement officers retired to many law enforcement officers off duty.  The bad guys don't stop looking for them just because the cop is…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691241/leosa-reform-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…environmental, labor and safety standards.\n\nH.R. 4090 enhances U.S. economic competitiveness and takes       direct aim at our strategic vulnerabilities. This bill is a       critically important step forward to ensure America can       responsibly and efficiently develop its vast domestic mineral       resources. We urge your support for H.R. 4090.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…rouler.''\n\nMr. Speaker, I thank my friend from Wisconsin for yielding, and I  thank Chip Roy for bringing the SAVE America Act to the House floor.\n\nThis is a bill that is critically important to one of the most  precious franchises in America, and that is the sacred right to vote,  the right that so many gave their lives to preserve, to allow to pass  on…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700016/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…institutions, you may not be able to appreciate  this. But, folks, this is real. The Federal Reserve is the gold  standard for central banks, and its independence is critically  important. It is critically important for us continuing to have the  gold standard for the economy, the gold standard for the rule of law.\n\nWe cannot allow some junior U.S. attorney--assistant…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…introduced that during the first Trump administration the first time,  and then we had it, obviously, during the Biden administration. I want  to revisit that. It is critically important.\n\nI hope that the AUMF repeal for 2002 that was in the NDAA in the  Senate will be allowed to stay in the NDAA as it is coming back over to  the House. We shouldn't…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697203/count-the-crimes-to-cut-act"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…me the  time.\n\nMr. Speaker, as we debate the rule providing for consideration of  amendments to this year's National Defense Authorization Act, I rise to  highlight a critically important issue from my district and to offer an  amendment that would solve the problem.\n\nMr. Speaker, I represent a vast district in southern California.  Among the five military…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695111/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…jobs may not seem like a big deal to people from the  big cities, but I can assure my colleagues the jobs and economic  benefits provided by this small business are critically important to  this rural community.\n\nThis important conveyance will provide much-needed economic growth  and jobs for people in Wabeno and Forest County. It has strong local…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694030/wabeno-economic-development-act"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…all of those individuals  who work in them and rely on them for their livelihoods.\n\nWe talk a lot about the tax implications. That is not my focus this  evening. It is critically important. We have to extend the small  business and middle-class tax relief so that those businesses can  continue to operate and continue to employ the people we represent.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690784/big-beautiful-bill"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…inadequate, and, in some cases, were never  meant to facilitate medical services. One facility was literally a  former morgue.\n\nMr. Speaker, this legislation enables something critically important,  the ability to deliver modern mental health care in a space designed  for healing and recovery.\n\nIn Alaska, we face real challenges. People dealing with serious  mental…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698112/southcentral-foundation-land-transfer-act-of-2025"}]