[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…come. And we've put that philosophy to work,       correcting deficiencies of past policies and advancing long-      overdue initiatives.\n\nLet me give you some facts that our critics never seem to       remember. When we took office in 1980, we faced a dusty shelf       of reports which pointed out our predecessors had been so       busy spending money…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…is bigger than economics. This is about freedom.  Take a look around our country. We have military patrols in American  cities, political investigations of the President's critics, mass  detentions without due process, Federal agents hidden behind masks,  museums ordered to rewrite history, the government bullying private  companies and universities,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694808/northeast-ohioans-are-getting-squeezed"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Trump.\n\n``Trump argues that levying tariffs on imports will give him leverage  for trade deals and ultimately compel companies to ramp up production  in the United States. Critics say the strategy will raise costs for  consumers and destabilize the economy while leaving businesses too  uncertain about the future to make plans.''\n\nHere, let me just share…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Alexandria Ocasio-Cortez", "party": "Democrat", "sentence": "…the name of Charlie Kirk.\n\nPresident Trump and the FCC are now cynically threatening to shut  down ABC and any outlets that gives airtime to the administration's  political critics.\n\nThis is a disgusting attack on the American people and the very First  Amendment rights that define us as a country. It is also the ABC  corporation's responsibility to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695806/censured-but-not-silenced"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Award will join a crowded trophy case that  contains an American Cinematheque Award and a British Academy Film  Award, both for his costume design in ``Wicked.'' He also won Critics  Choice and Costume Designers Guild Awards for his work on the film.\n\nWhile this is Paul's first win at the Oscars, he was also nominated  for costume design in the 2022 film…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688615/recognizing-paul-tazewell"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the consent of the ceding       State. The Supreme Court, however, did not bar West       Virginia's admission; to the contrary, it later tacitly       approved of it.\n\nSome critics of the D.C. Admission Act have suggested that       Maryland's consent might be required under the foregoing       provision of the Admissions Clause. This objection mistakenly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…of a larger global struggle.\n\nFrom Eastern Europe to Latin American and Southeast Asia, the pattern  is the same: When authoritarian leaders feel threatened, they silence  critics, shut down independent groups and dismantle the checks meant to  hold them accountable. And the regimes that do this are the same ones  that threaten regional stability and…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697939/international-human-rights-day"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…something less       satisfying than winning, even when we must give a little to       get a little, even when our efforts managed just 3 yards in a       cloud of dust, while critics on both sides denounced us for       timidity, for our failure to triumph.\n\nI hope we can again rely on humility, on our need to       cooperate, on our dependence on each…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…discontinuation of  the punitive executive orders.\n\nAdditionally, Donald John Trump has engaged in a pattern of  unconstitutional, unlawful, and corrupt retaliation against critics and  political opponents, a flagrant violation of constitutional rights  protected by the First Amendment.\n\nHe has weaponized the Department of Justice and other agencies…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…veterans services  organization communities of the United States. Yet, year after year,  this bill has stalled, and detractors have worked to deny a simple  vote.\n\nNow, in public--critics have avoided taking a public position on the  bill, and they have given lipservice to veterans and advocates  requesting their support. What their real reasons are, I can't…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…inalienable rights, but we have a President who routinely attacks the  right to due process and freedom of speech, who has sought to use the  heavy hand of government to banish critics from the airwaves.\n\nWe declared independence, in the words of Jefferson, because we  didn't wish to be ruled by a King who ``cut off our trade'' and imposed  ``taxes on us…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698503/9999"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…democratic  institutions around the world.\n\nNED exposes Russian propaganda, counters Chinese Communist Party  censorship, circumvents the Iranian regime's efforts to silence  critics, and highlights corruption and drug trafficking in Venezuela.  And it does all of that for a fraction of a penny on the dollar.\n\nLet's be perfectly clear. Letting authoritarians…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699435/consolidated-appropriations-act-2026"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…watching. They are making alliances while we  toss aside allies like Canada and Europe to satisfy the inconceivable  love this President has for Vladimir Putin.\n\nPutin poisons his critics. That is who our new best friend is.\n\nI am new to this Chamber, but hear me, Mr. Speaker: Consequences will  be tragic for those who love freedom worldwide if we don't return…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688170/americas-standing-in-the-world"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…entrench his position,       promoting at least two of his sons, Saddam and Khalid, to       senior military positions and a third, Belqasim, as his top       political adviser. Critics accuse of him emulating Qaddafi in       his dynastic tendencies and strongman persona that       overshadows Government of National Stability Prime Minister       Osama Hammad.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the consent of the ceding       State. The Supreme Court, however, did not bar West       Virginia's admission; to the contrary, it later tacitly       approved of it.\n\nSome critics of the D.C. Admission Act have suggested that       Maryland's consent might be required under the foregoing       provision of the Admissions Clause. This objection mistakenly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…whistleblowers. That is an historic disgrace that will age very poorly  for these authors, their editors, and the New York Times at large.\n\nThe January 18 article also argues that my critics say these  whistleblowers won't face reprisal because Trump is in office. Reprisal  isn't a condition precedent to be a whistleblower. And how dare the  Times make any insinuation…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…other way around. That means questioning contracts,  finding and cutting waste, and making sure that when the government  spends a dollar of your money, it delivers value.\n\nCritics argue that some government contracts canceled by DOGE haven't  led to immediate savings. Isn't canceling wasteful government spending  before it can be renewed a step in the…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688492/demanding-transparency-efficiency-and-accountability-from-our-government-is-not-extreme"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…There are petty, tin-pot  dictators, authoritarians, and strongmen around the world who will  watch this video and be encouraged and think this is the way to silence  their critics.\n\nI can't image a Member of this Chamber who knows Alex Padilla, who  has had the blessing of sitting with him in moments when he is asked  questions or engaged in discourse,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692447/alex-padilla"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…open directories on their  websites. However, the DETERRENT Act does have a commonsense privacy  protection included.\n\nThe American public deserves transparency, and I urge critics of the  bill to ask why relationships, including those with our worst enemies  and our adversaries, should continue to lie in the shadows.\n\nMr. WALBERG. Mr. Chair, I yield…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…continue to demand the kind of price  transparency that they deserve. President Trump, Vice President Vance,  and Secretary Kennedy will also continue to fight with us.\n\nIf critics have solutions to make our bill better, come to the table,  present your ideas, and work with us.\n\nAlso, I want to thank the chairman of the Finance Committee. He is a  friend.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694205/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…bill into law. But we did. To all  those detractors and Debbie Downers, it looked like this pessimism was  completely unwarranted.\n\nNow that the Republicans have proven their critics wrong by  accomplishing what they insisted had to be done in order to avoid a tax  increase on millions of Americans, our colleagues across the aisle do  what they do best,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…necessary to avoid  a shutdown. That point is that the shutdown is damaging to us in many  ways to our Nation. It is broadly damaging to us because it allows  those who are critics and those who are adversaries to realize that we  are not as capable of functioning as we should be so that even our  allies wonder what is going on in the United States.…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696174/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…and       the administration will raise interest rates.''\n\n--Semafor article, 1/12/26\n\nSenator Cynthia Lummis:\n\n``Senator Cynthia Lummis, one of Powell's more strident       critics usually, on Monday said the Justice Department's use       of a criminal statute looked like a ``heavy lift'' and that       she did not see any criminal intent.''\n\n--Reuters…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}]