[{"senator": "Lucy McBath", "party": "Democrat", "sentence": "…public safety grant funding that the Department of  Justice chose to abruptly terminate. Some of that canceled funding went  to law enforcement training; support and other critical resources; and,  more specifically, to addressing the health, safety, and wellness of  law enforcement.\n\nAs I have here, President Trump's 2026 budget would have devastating  impacts…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…their permit applications, even  if they know that their operations result in the introduction of these  pollutants.\n\nIn Southeastern Virginia, one of our region's most critical resources  is the Chesapeake Bay. The Bay provides our local economy with many  opportunities in recreation, business, education, and tourism.  Throughout the watershed, the Bay…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698148/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…managers paying  a lower tax rate than regular income earners like schoolteachers or  firefighters. It would cut taxes for the top 5 percent of taxpayers  while reducing critical resources for the poorest households, setting  off what would be the largest upward transfer of wealth in American  history.\n\nTwo, Trump's bill guts Medicaid and likely Medicare,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…which we considered yesterday,  H.R. 1069, if passed, would force school districts already facing  shortages of teachers, counselors, and support staff to divert critical  time and resources from instruction to completing bureaucratic  paperwork. This is the very definition of an unfunded mandate. It  imposes obligations on 15,000 school systems without…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697533/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…responders, the  first line of defense, the people that go in and risk their lives at a  time when it is most dangerous. They can't do it alone, and FEMA  provides critical training, resources, and supplementation.\n\nFEMA is designed to have an immediate response within a minimum of 15  hours. However, under President Trump and his canceling of FEMA,  defunding…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693655/tragic-storms-in-texas"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…other veterans receive the respect that they  deserve.\n\nAs the founder of the Hearst Community Organization, she has fought  for jobs and public spaces and to secure critical resources to help  people lead better lives. Her dedication reflects the resilience we  honor this month.\n\nMr. Speaker, Joann's unwavering service has left a lasting impact and…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688288/recognizing-joann-williams"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "Ms. BUDZINSKI. Mr. Chair, I rise in strong opposition to this  legislation because it strips away critical resources from projects  that directly benefit my district.\n\nOne example is the investment of $32 million awarded to the Kraft  Heinz facility in Champaign, Illinois. This was…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694953/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Care and Development Fund, and the Social Services  Block Grant program. This move threatens over $3.4 billion in annual  funds that New York depends upon to provide critical resources,  including childcare, public assistance, domestic violence services,  homeless shelters, and emergency payments for families and children.\n\nThis action only serves to…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699265/recognizing-the-scarsdale-forum"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…afterschool programs. And again  with the ``Big Bad Bill'' that our Republican colleagues just passed,  President Trump signed into law a bill that gutted funding for critical  resources like Medicaid and SNAP, ripping healthcare and food  assistance from millions of Americans, all to cover the cost for their  massive tax cut for billionaires.\n\nAnd,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…related to toxic exposures and the implementation of the PACT Act, to  continue providing education benefits to veterans, and to help secure  VA home loans. All of these critical resources will better ensure that  our Nation's veterans receive the care and benefits they have earned  through their service.\n\nThis bill also provides necessary funding for the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694129/9999"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…the House and the Senate  to pass this legislation so that President Trump can end this mandate  and save our American auto industry.                    Harvesting Critical Mineral Resources\n\nMr. JOYCE of Pennsylvania. Madam Speaker, for years, my colleagues  and I in the House and Senate have been sounding the alarm on China's  control of the critical…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690194/repealing-green-new-deal-policies"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…the bad-actor loophole, then what does being an advocate  actually mean?\n\nThis package funds a significant portion of the Federal revenue, from  Agencies that provide critical resources to our farmers to law  enforcement, military, and our veterans, just to name a few.\n\nWe need the appropriations process to function. Congress needs to do  its job and…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694557/9999"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…economic growth and raised real wages. This resolution also provides  instructions to reverse Biden's assault on domestic energy, rein in  reckless spending, and deliver critical resources to the Trump  administration so we can secure our border and strengthen our national  security.\n\nFinally, I want to address the fear-mongering among our Democrat  colleagues.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688042/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…history, when we  advanced this broader initiative to make Medicaid more sustainable for  all Americans and take Medicaid back to its original purpose, when we  invested in critical resources in our military--at a time when the  world is not becoming less dangerous; it is becoming more dangerous-- when we beefed up border security, we also thought it right…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693387/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…community commitment.  Chambers of commerce are foundational institutIons within our  communities. They promote economic vitality, advocate for local  businesses, and offer critical resources such as training, marketing,  and networking. The Greater Hernando County Chamber of Commerce  embodies these principles and has served as a vital engine of  prosperity…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695644/recognizing-the-greater-hernando-county-chamber-of-commerce"}, {"senator": "John James", "party": "Republican", "sentence": "…2025. The bipartisan Road to Recovery Act  reauthorizes lifesaving resources vital to addressing opioid addiction  and substance abuse across the country.\n\nIt provides critical resources for SAMHSA's National Helpline, a  free, confidential, 24/7, 365-day-a-year treatment referral and  information service for individuals and families facing mental and/or…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691886/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Designation of ACECs  that remove lands from operation of the public land laws is a de facto  withdrawal and an insult to Congress's express intent in ANILCA,  locking up critical resources that our Nation needs to counter our  dependency on hostile foreign powers.\n\nDoyon, the largest Alaska Native Corporation stakeholder in the  Central Yukon Planning Area,…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…provides a clear regulatory framework for the  issuance of payment stablecoins in the U.S.\n\nH.R. 4016, the Department of Defense Appropriations Act of 2026,  provides critical resources to strengthen military readiness, support  servicemembers and their families, invest in next-generation defense  capabilities, and ensure that the United States can meet…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…ensuring clean, reliable water for families across  Central Iowa.\n\nSince joining Des Moines Water Works in 1990, Ted has been a trusted  steward of one of Iowa's most critical resources. He helped oversee  major infrastructure improvements, expanded watershed protection  programs, and worked with partners across the region to strengthen  collaboration…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694988/recognizing-the-retirement-of-ted-corrigan-after-35-years-of-public-service"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…other  foreign adversaries and build resilient, secure, domestic energy and  critical mineral supply chains?\n\nOur country is blessed with an abundance of energy and critical  mineral resources that are a linchpin to our economy. They are a  linchpin to our national security and a linchpin to the new and  emerging energy technologies that we are trying…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699994/securing-americas-critical-minerals-supply-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…Lindsay Erickson, and T.J. Lowdermilk.\n\nThis legislation that is Commerce, Justice, Science Appropriations  Subcommittee work product strikes a careful balance, funding critical  resources while also protecting limited taxpayer dollars. The spending  that we always worry about being too much is addressed in this  legislation to make sure that we are on…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Rose", "party": "Republican", "sentence": "…This  calculated betrayal was not only a staggering act of theft but a cruel  assault on the very families who sacrifice the most for our Nation's  freedom. By draining critical resources, she robbed military children  of the opportunities and security promised through 4-H.\n\nThe American people deserve answers, and they deserve to know how  such a monumental…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695237/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Pipeline Act, introduced by Representative  Titus.\n\nSouthern Nevada is one of the fastest growing regions in the country,  and with growth comes increased demand for critical resources like  drinking water.\n\nRight now, nearly 40 percent of the Las Vegas Valley's water is  carried through a single pipeline that was built in the 1990s. That is  a huge…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698162/sloan-canyon-conservation-and-lateral-pipeline-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…invest in our Nation's future  and ensure students with disabilities have access to a high-quality  education. It is the right thing to do.\n\nFull funding will provide critical resources to schools, enabling  students with disabilities to receive services and support that they  need. It will reduce financial strain on States and local districts,  preventing…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689683/supporting-our-nations-children-with-disabilities"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…we must renew and  strengthen our commitment to rural hospitals by ensuring fair  reimbursement, strengthening telehealth and infrastructure, and  preserving access to critical resources like the 340B drug program, a  key revenue stream for rural hospitals.\n\nRural hospitals must not only survive but thrive. We need to keep  that because it is not about…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696877/national-rural-health-day"}]