[{"senator": "Lou Correa", "party": "Democrat", "sentence": "…actors attempt to exploit our  sensitive information. This measure strengthens DHS' ability to prevent  such threats and protects our national security.\n\nThis bill is a critical step in ensuring DHS upholds strong policies  and procedures to secure research and development efforts.\n\nMr. Speaker, I encourage my colleagues to join me in supporting H.R.…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688735/research-security-and-accountability-in-dhs-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…stood outside with  those strong, resilient women with every ounce of their intellect  there, sharing the stories of what it meant to be a Rosie.\n\nThis bill will take us one critical step closer to ensuring that our  Rosies receive the recognition that they deserve.\n\nIn 2022, Congress passed bipartisan legislation authorizing the  establishment of a memorial…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697725/world-war-ii-womens-memorial-location-act"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…colleagues to  support it.\n\nMr. Speaker, I am excited about the strong bipartisan support that  H.R. 1155, the Recovery of Stolen Checks Act, has received. The bill  will take a critical step toward combating financial fraud and  protecting hardworking Americans from falling victim to check theft.\n\nEach year, countless Americans are targeted by criminals who…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689292/recovery-of-stolen-checks-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…not all of the Tribe's  villages were included within the reserved area.\n\nH.R. 504 would correct this oversight by incorporating Osceola Camp  into the reserved area, a critical step toward honoring Tribal  sovereignty, addressing ongoing governance concerns and environmental  challenges.\n\nThis bill underscores the importance of righting historical…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693409/miccosukee-reserved-area-amendments-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…to take full advantage of those benefits. I look forward to  working with my colleagues to improve AGOA over the next 3 years, but  extending the legislation is a first critical step.\n\nMadam Speaker, I ask my colleagues to vote for this program.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698904/agoa-extension-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…future disruptions.  Leaving our manufacturers and suppliers vulnerable creates fragile  supply chains that threaten both our economic and national security.  This bill is a critical step toward preventing debilitating shortages.\n\nMr. Speaker, we must invest, rebuild, and protect our industrial base  from threats to innovation and competitiveness. For too…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690189/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Democrat on the House Financial Services Committee, it  has been my mission to fight to end this homelessness and housing  crisis. The Housing for the 21st Century Act is a critical first step  in that mission.\n\nPassed in Committee with overwhelming bipartisan support, H.R. 6644  sets the stage for building and preserving more affordable homes in our  neighborhood.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699799/housing-for-the-21st-century-act"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…noncompliance with the Program.\n\nBy unlocking new opportunities and funding for permanent land  conservation, the ``Forest Legacy Management Flexibility Act'' takes a  critical step towards protecting our country's natural resources and  forests for future generations. My colleagues and I are honored to  reintroduce this legislation to preserve America's…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689872/reintroduction-of-the-forest-legacy-management-flexibility-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…dignity, and the right to self- determination, not starvation.\n\nOregonians have been clear: The United States has a moral obligation  to use its power to end this tragedy. A critical step is demanding the  U.N. Relief and Works Agency is immediately reinstated in Gaza for  large-scale aid delivery.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694108/ongoing-massacre-in-gaza"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…to stop Trump's reckless  assault on the Federal Government and our democracy. While I believe  many of Donald Trump's actions merit impeachment, I believe that the  critical first step needs to be taken by this body as soon as possible.\n\nAs I said before, I don't expect it to happen because MAGA  Republicans have completely abdicated their constitutional…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692929/holding-power-accountable"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…vocational rehabilitation  counselor. That is at least 2 months of missed income, missed classes,  and missed opportunity. That is unacceptable.\n\nThe FAST VETS Act is a critical first step to addressing the backlog.  It establishes clearer standards and prioritizes outcome-focused  planning to support more veterans successfully and efficiently moving…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695413/focused-assistance-and-skills-training-for-veterans-employment-and-transition-success-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Accountability in the Federal Workforce\n\nMr. CLINE. Mr. Speaker, yesterday I joined Senator Mike Lee of Utah  in introducing the No Union Time on the  Taxpayer's Dime Act, a critical step toward restoring accountability in  the Federal workforce. This bill will end the abuse of official time  which allows Federal employees to engage in union activities while…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689724/congratulating-glenvar-high-school-boys-swim-team"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…to deal with VA red tape and these  bureaucratic mistakes.\n\nThis commonsense, bipartisan legislation honors the legacy of World  War II Veteran Ernest Peltz and takes a critical step toward improving  the VA's effectiveness and accountability.\n\nWhat was amazing about this process, while mourning the loss of their  father, Charles Peltz shared with me…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699466/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…transparency, such as requiring written  justification requirements for certain documents that are redacted,  unless they fall under certain sensitive categories.\n\nThis is a critical step forward in providing transparency into the  Epstein files and will give the public all the necessary information.\n\nThis vote will show the American people we are committed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…protect our border, defend our Nation, and serve the American  people.\n\nHouse Republicans promised to root out waste, fraud, and abuse. H.R.  4 keeps that promise and takes a critical step forward toward a leaner,  more accountable government. I urge my colleagues to support it.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692312/recognizing-new-freedom-farm-and-lois-mcgill"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…I rise in support of H.J. Res. 104, which nullifies the  Bureau of Land Management's restrictive Miles City Field Office  Resource Management Plan.\n\nThis resolution is a critical step toward restoring American energy  dominance, a cornerstone of President Trump's agenda to secure our  Nation's economic and energy future.\n\nThe BLM's rule stifles resource…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694890/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…under the SBA's 7(a) and 504 loan  programs to $10 million. I hope it will quickly move through the Senate  and to President Trump's desk.\n\nMadam Speaker, H.R. 5788 marks a critical step toward identifying and  mitigating risks early, strengthening the long-term viability and  affordability of the 504 loan program and ensuring continued support  for American…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699188/504-program-risk-oversight-act"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…Homeland Security should not be procuring batteries  from a geopolitical adversary.\n\nH.R. 1166, the Decoupling from Foreign Adversarial Battery Dependence  Act, is a critical first step in addressing this issue. Modeled after  previous provisions included in the FY 2024 NDAA, my legislation builds  off of these efforts and prohibits the Department of…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688683/decoupling-from-foreign-adversarial-battery-dependence-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…opportunity for American  growth and innovation, and deprives our economy of their incredible  contributions.\n\nThe ThinkDIFFERENTLY About Disability Employment Act takes a critical  step towards breaking down these barriers. This bill directs the Small  Business Administration and the National Council on Disability to  collaborate in providing resources…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691778/thinkdifferently-about-disability-employment-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…counter these threats.\n\nOur top priorities should always be to defend Western values, promote  American interests, and hold bad actors accountable. This legislation  is a critical step in confronting the CCP's abuse of the financial  system head-on.\n\nMr. Speaker, I thank the gentleman from New Jersey (Mr. Gottheimer)  for co-leading this important effort…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694119/china-financial-threat-mitigation-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "Mr. GRAVES. Mr. Chairman, I thank the chairman for yielding me time.\n\nMr. Chairman, I rise today in support of the House's fiscal year 2025  budget resolution, which is a critical step needed to unlock a  reconciliation bill that is going to help secure our border and  revitalize our military. It is going to unleash American energy  independence and extend…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688038/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…listened to the testimony of Ray Cullen, who lost his son Zach to  fentanyl poisoning. Nobody should have to experience this pain.\n\nEarlier this year, the House took a critical step to get illicit  fentanyl off our streets in passing the HALT Fentanyl Act, which was  led by my friend, Congressman Morgan Griffith.\n\nI am proud today to lead the reauthorization…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…our Nation's healthcare system needs reform to lower costs for patients  and ensure stability for providers.\n\nThe Lower Health Care Premiums for All Americans Act is a critical  step forward in curbing rising premiums, expanding choice, and  improving transparency. The legislation includes provisions to improve  affordability, particularly for small…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698389/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…gentleman from  Michigan.\n\nMr. WALBERG.  As a Member coming from the  Wolverine State, I congratulate him on Saturday's victory.\n\nMr. Speaker, H.R. 1005, the CLASS Act, is a critical step in limiting  foreign influence in our classrooms. Too often, foreign funding comes  with strings attached--maybe in every case--especially when those  dollars come from…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697409/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "Mr. ROUZER. Mr. Speaker, I thank the gentleman for yielding.\n\nMr. Speaker, H.R. 2390, the Maritime Supply Chain Security Act, takes  a critical step toward strengthening our port infrastructure and  national security by expanding the eligible use of the port  infrastructure development program to include the replacement…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692198/maritime-supply-chain-security-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…to the workers and the  families who keep this country running: seniors, tipped workers, and  those putting in overtime to get ahead.\n\nMr. Speaker, this bill also takes a critical step to protect and  strengthen Medicaid, a vital program for millions of Americans.\n\nLet me be very clear about something: This isn't anything radical. We  are restoring the…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693239/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}]