[{"senator": "Al Green", "party": "Democrat", "sentence": "…tonight.  If he had only said the other things, I probably would have, as many  others are doing, just let it go, but sometimes, you can cross a line  of no return. The President crossed that line with these words. The  President then posted 16 Truth Social posts, including one that  advocated for hanging Democrats. Now, that is the line.\n\nMr. President, what…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…to lifesaving care. SNAP made sure  her kids didn't go to bed hungry. These programs aren't ``handouts,''  she says. ``They are lifelines.''\n\nNow, because her income barely crossed the threshold, she has lost  SNAP. ``It doesn't mean we can suddenly afford groceries,'' she says.  ``It just means we sacrifice even more.''\n\nIf we cut Medicaid and SNAP,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691491/gop-tax-scam-hurts-women-and-families"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…Grandview community.  Introduced to public service at an early age as an Eagle Scout, Jim  dedicated the rest of his life to serving the City of Grandview and  caring for anyone he crossed paths with. Jim showed endless love for  his community, and the impact he had will be remembered forever.\n\nBorn on October 3, 1945, in Kansas City, Missouri, Jim spent his…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696936/recognizing-the-life-and-memory-of-james-jim-neil-crain"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "Mr. PADILLA. Mr. President, I, first of all, thank my colleague from  the State of Rhode Island and echo his sentiment and his message that  Senate Republicans have crossed the line this evening. They have chosen  to overrule the Parliamentarian, thrown out some rules, rewritten some  rules, established new precedents for how this body operates,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…taxes.\n\nWell, last night, late last night in the House of Representatives-- while you were probably watching ice skating in the Olympics--because  three brave Republicans crossed over and joined all of the Democrats,  we are going to have that debate.\n\nWe are going to have that vote because what is central to people's  lives right now is their pocketbooks.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, launching a criminal investigation to  coerce the Federal Reserve is a dangerous crossing of the Rubicon--even  for Donald Trump, who has crossed many Rubicons already, to his  detriment and to the country's detriment.\n\nAmerica's economic stability depends on impartial, stable monetary  policy. Our central bank must…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…that is where the rest of the world  was gathering--to discuss the climate crisis. In the facility where we  were, the kind of main intersection where the two big aisleways crossed  was occupied by China, at one of the key corners, with a huge  delegation, a very big pavilion, lots of activity and crowding, and all  of the different countries that were…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…parents? I can't understand the logic of it.\n\nAt a time of skyrocketing healthcare costs--which our colleagues will  do nothing about except perhaps a handful of them who have crossed over  to join us today in a discharge petition--at a time of skyrocketing  healthcare costs, grocery prices, and housing, not to mention the  recent news of escalating unemployment…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698345/protect-childrens-innocence-act"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…to say: No, we should  not do this, Mr. President. Back down. Back off. You are wrong.\n\nWill someone here have the backbone to tell the President of the  United States: You crossed the line. Stop it.\n\nI am so disappointed, so disappointed. And as a Latino U.S. Senator,  for this to happen to another Hispanic here--there are several of us  who are Hispanics…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692552/alex-padilla"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…wrap services around people who might be at risk of gun  violence or to stop that cycle of violence once the first shooting  happens.\n\nSo we passed this legislation, and we crossed our fingers. We said:  Let's hope that we are right and that these changes in gun laws and  these investments we are making in our communities will make a  difference.\n\nWell,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…and yet, the Biden  administration and the Obama administration did deport violent people  out of the United States. Yes, they did.\n\nSo what is different here is that we have crossed a line. We have  crossed a line, and we have allowed ICE to go here and prey on U.S.  citizens and basically, in this case, use this power of force. And my  only question…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699419/9999"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…Sunday where a triumphant march in pursuit of equality and  justice for all was met with brutality and violence.\n\nAs I rise today, I rise thinking about the late John Lewis who  crossed the Edmund Pettus Bridge in Selma, arm-in-arm with 600, 700  activists and driven by a conviction to secure the right to vote. I  rise thinking about how 60 years later, we…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688732/9999"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…thirsty souls of those who perished and those who were thirsty from the  August heat.\n\nI feel a deep obligation and responsibility to carry this memory  forward. I remember as I crossed the bridge thinking to myself how I  was personally connected by family to this historical event, that it  was not something abstract. It was a moment that who I was, my…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694115/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…coins-- doubloons, silver dollars, and denari--that tell the story of  civilization and economic progress itself sat largely unseen in vaults  in Manhattan, New York. These coins crossed oceans, witnessed empires  rise and fall, and marked the turning points of human history, and they  rested largely unseen.\n\nIn New York, this priceless collection had few…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…behalf of.\n\nThere are some who are saying they don't recognize this America, and  I want to ring the bell today for all who are watching, for all who are  listening. We have now crossed a line.\n\nThis is a dangerous day in the history of our country. When a Senator  who was in a Federal building, where he had a right to be, to do an  oversight responsibility…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692441/alex-padilla"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…that sink in. This is an  urgent reminder that national security starts with border security.\n\nUnder Joe Biden and the Democrats, more than 1,500 illegal immigrants  from Iran crossed our southern border, and 729 of them were released  into our country by Joe Biden. And that might just be the tip of the  iceberg because, remember, under Joe Biden and the…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693098/immigration"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…holding almost $900 billion in cash, which they typically operate with  about $800 billion because of the in and out, but you start to realize,  at the current borrowing rate, we crossed $1 trillion this fiscal year  before Christmas.\n\nIt is not Republican or Democratic. It is demographics and interest,  but that isn't a lot of fun because our political consultants…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…alone, this crisis contributed to  the deaths of 70,000 Americans--in just one year, 2023--a number that  only worsened the following year, when the amount of fentanyl that  crossed our border with Canada was actually enough to kill 9.5 million  people, given that potential.\n\nGiven this context, it is no surprise that between 2024 and 2025,  under President…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699963/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…2007 during  her service to the DOJ, which my friend has brought up? Was there any  interactions?\n\nThese are the questions we have. The good lady from the Virgin  Islands has crossed the threshold of reasonable suspicion and,  therefore, she should be investigated by Ethics, by DOJ, and I would  recommend by the Oversight and Judiciary Committees. Meanwhile,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696892/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…11th Congressional District excel, but it was  Manheim Township senior Adam Kingston who took home the gold. Kingston  maintained the lead for the entire 3,200-meter race and crossed the  finish line with a time of 8:51:25, a Lancaster-Lebanon League record.\n\nKingston's state title finishes a storied career at Manheim Township.  He was also a part of Manheim…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691936/congratulating-adam-kingston-gold-medal-runner"}, {"senator": "James Risch", "party": "Republican", "sentence": "…previous pauses in humanitarian aid convoys to  resupply their attacks at the expense of the Palestinian people, to  include looting at gunpoint the majority of the trucks that crossed  into Gaza.\n\nThis is pure evil. They show pictures of women and children starving.  Those women and children are starving. They are not being starved by  Israel; they are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695665/cloture-motion"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…community.\n\nOn October 7, 2022, the world was shocked at the atrocities carried  out by Hamas terrorists against Israel and the Jewish community. Nearly  3,000 Hamas fighters crossed into Israel by land, air, and sea, killing  around 1,200 people and taking more than 250 Israeli and foreign  hostages.\n\nOctober 7 will forever be a turning point in history.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "James Risch", "party": "Republican", "sentence": "…attack on Israel       since the 1973 Yom Kippur War, firing thousands of rockets,       striking civilians and locations as far as Tel Aviv and       Jerusalem. Hamas gunmen crossed into Israel, entering towns       and communities as far as 15 miles from Gaza, slaughtering       men, women, and children. More than 230 hostages were taken       and dragged…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…Doug LaMalfa.\n\nDoug's sudden passing this week leaves a void not only in this  Chamber but in the hearts of all who knew him. To a person, a testament  from everyone who has crossed his path would be this: What a really  good man.\n\nAs a Member of the Western Caucus, I witnessed firsthand Doug's  fierce advocacy for farmers, ranchers, and hardworking families…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698718/9999"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…unnoticed, sneaking over the goal line  during a dramatic scramble at the net. Warroad came away with the puck,  but junior forward Zoe Heimer, who made the shot, knew the puck had  crossed the goal line, prompting a video review that ultimately ruled  in favor of the Wildcats.\n\nThe top-seeded Dodge County team has been nothing but impressive all  season, finishing…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690120/recognizing-the-2025-class-1a-minnesota-state-girls-hockey-champions-the-dodge-county-wildcats"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…on the 105 mm Howitzer, Mr. Moddie  set sail for England to prepare for deployment to the Western Front.\n\nOn the morning of November 30, 1944, Mr. Moddie and his battalion  crossed the English Channel to Le Havre, France, where they awaited  orders to move up the Seine River into Germany to take part in what  would become the Battle of the Bulge--the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695299/recognizing-mr-john-moddie-on-his-100th-birthday-and-for-his-service-with-the-590th-field-artillery"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…now. We know contracts are undertaken  with all of our school districts now. We know that the lawyers on staff  have means by which to make sure that the appropriate t's are crossed  and i's are dotted. They can follow the law. We must do that.\n\nAdvocacy groups, such as Defending Education, have done tremendous  work to ensure we know about the CCP's…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697438/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…Services for  awarding shockingly large amounts of grants and dollars to nonprofits  focused on aiding illegal immigrants, amounting to as high as 20  million people who illegally crossed into our country during Biden's  term in office.\n\nTaxpayer-funded awards paid for illegal aliens' housing, healthcare,  education, even music lessons, therapy. You name it,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…imprisonment or parole       or other supervised release as the result of such conviction       if such individual, in the commission of such an offense,       used a passport or crossed an international border.\n\n(b) Revocation.--The Secretary of State may revoke a       passport previously issued to any individual described in       subsection (a).…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…frozen Mississippi River by ferry and wagon to  escape persecution. Only the sickest and poorest remained behind, and  even they were finally forced out by mob action. All crossed Iowa to  Nebraska, just north of Omaha, their winter quarters on the Missouri  River.\n\nWhy do I bring up these sad memories from long ago?\n\nUtah still celebrates the day when…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694022/july-24th-utahs-state-holiday"}]