[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Tommy, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Tommy's hard work, determination, and perseverance at  Three Creeks…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691920/recognizing-tommy-seiler"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Alyssa, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Alyssa's hard work, determination, and perseverance  at Three Creeks…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691840/recognizing-alyssa-sayers"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Alexander, develop crucial skills and  a work ethic that will guide them for the rest of their lives. This  award is a testament to Alexander's hard work, determination, and  perseverance at Jefferson…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690160/recognizing-alexander-aro-cavillo"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…lithium-ion batteries would       protect consumers from the dangers of these inferior       batteries.\n\nAs lithium-ion battery powered devices become more common,       it is crucial that the safety and wellbeing of those we serve       is preserved. Passing the Setting Consumer Standards for       Lithium-Ion Batteries Act would do just that. I request…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…investigation, who have called for changes of  leadership. I agree with that. That is all really important.\n\nBut, colleagues, that is not going to be enough to stop this. This is  a crucial moment in our country, not just for Minnesota but for our  entire country, and our answer to the question of what we do in the  face of this illegality, this brutality--our…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Michael, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Michael's hard work, determination, and perseverance  at Arvada High…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689468/recognizing-michael-racinowski"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Jordan, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Jordan's hard work, determination, and perseverance  at Jefferson…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691099/recognizing-jordan-reil"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Dayanara, develop crucial skills and  a work ethic that will guide them for the rest of their lives. This  award is a testament to Dayanara's hard work, determination, and  perseverance at Jefferson…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691002/recognizing-dayanara-tiscareno-escalera"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…suffering, our joint commitment to defend freedom  above all else prevails.\n\nThis moment for Ukraine--Russia and Ukraine--is a key moment in  history. It is our generation's crucial test of freedom or subjugation.  No succor can be allowed to a murderous dictatorship, no matter how  many of Russia's rich oligarchs seek to plunder and steal from the  sacred…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…cutting-edge technology, and expertise to create  the most cost-effective solutions for customers. They manufacture from  iconel, brass, steel, plastic, and copper. Manufacturing is crucial to  the global economy, and E.J. Basler Co. delivers high-quality solutions  across industries, working with the best of agriculture, plumbing,  automotive, industrial, defense,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692550/recognizing-ej-basler-co"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Danovin, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Danovin's hard work, determination, and perseverance  at Arvada West…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689693/recognizing-danovin-barscocchini"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Dulce, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Dulce's hard work, determination, and perseverance at  Jefferson Jr./Sr.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691114/recognizing-dulce-villegas-menez"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…floods  are often the most destructive. Again, it can lead to toxic mold if not  mitigated.\n\nMr. Speaker, as flooding becomes more frequent due to the climate  crisis, it is crucial that we take action to require FEMA to provide  flood victims with the full resources that they need to rebuild their  lives.\n\nI still remember the senior in Inkster, Michigan.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694896/providing-recovery-for-flood-victims"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Veronica, develop crucial skills and  a work ethic that will guide them for the rest of their lives. This  award is a testament to Veronica's hard work, determination, and  perseverance at Arvada High…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689438/recognizing-veronica-quezado"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Elijah, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Elijah's hard work, determination, and perseverance  at Mandalay Middle…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691283/recognizing-elijah-stimpfl"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…All men and women       have the right to liberty, self-determination and self-      governance. The individual's responsibility of work,       education, and industry are crucial elements of self-      governance in society and the preservation of human dignity.\n\nThe rights of a free people are protected and preserved       through honorable, virtuous,…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688744/declaration-of-mothers-a-proclamation-and-pledge-for-the-preservation-of-freedom-and-virtue"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…living;\n\n(6) as digital information becomes increasingly important       to the United States economy and the development of new       technologies and services that will be crucial to the       country's competitiveness in the 21st century global economy,       barriers including data localization and infringement of       intellectual property rights…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692697/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…that protect American  citizens. That is what Americans overwhelmingly voted for in this past  election, and the work has only just begun.\n\nLast week, House Republicans took a crucial first step to unlock the  process to advance President Trump's full legislative agenda. This  Republican majority will not stop fighting until the President's agenda  is in…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688493/america-is-back"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…read the title of the bill.\n\nMr. WESTERMAN.  261.\n\nMr. Speaker, I rise in strong support of H.R. 261 sponsored by  Congressman Buddy Carter of Georgia.\n\nUndersea cables play a crucial role in the global economy. These  cables are roughly 1 to 2 inches in diameter. Yet they crisscross the  globe and carry approximately 95 percent of global internet traffic,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…amendments made by this Act.\n\nMr. Speaker, I rise in full support of H.R. 818, the SPUR Act, led by  my colleagues Representatives Stauber, Cisneros, and Perez.\n\nThe SPUR Act is crucial in assessing the Federal Government's  progress in bringing in new companies and expanding the industrial  base.\n\nUnderstanding the number of new small businesses engaged…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687942/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Small Business Committee, one of my top priorities  is expanding access to capital for small businesses. The Small Business  Investment Company, or the SBIC, program plays a crucial role in this  effort by attracting private equity investments to help small  businesses grow, create jobs, and strengthen our economy.\n\nSBIC has been an invaluable tool for…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687921/investing-in-main-street-act-of-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…FISCHBACH. Mr. Speaker, I rise to congratulate Mary Gislason on  43 years of service to the people of Lyon County.\n\nAs a dispatcher for the sheriff's office, Mary provided crucial  support, connecting those in need with emergency responders. Mary's  colleagues praised her ability to remain calm despite the severity and  stress of the job.\n\nAfter 43…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689397/congratulating-mary-gislason"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Andrea has been a champion of historic  preservation, tirelessly advocating for the restoration and  conservation of our town's most treasured landmarks. She has played a  crucial role in securing grants and funding for preservation projects,  working closely with local government and historical societies to  ensure that our community's history remains…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690145/recognizing-andrea-read"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…competitive in the global race to return humans to the Moon and  then send crewed missions on to Mars.\n\nWithout key partnerships like this, we would be unable to take the  crucial steps in energy production and propulsion technologies  necessary to extend our reach beyond Earth. I thank Representative  Begich and Representative Whitesides for their…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688985/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…into these groups, and that number  continues to grow, but they were having difficulty preparing for  prosecution because of gaps in our law.\n\nI applaud the FBI for taking crucial steps to both raise awareness of  this issue and hold predators accountable. However, more tools are  needed from Congress to ensure that these heinous individuals are  prosecuted.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698880/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…mentioned, overwhelmingly voted to restore these rights to the Lumbee  Tribe, but there wasn't time for the bill to clear the Senate. Today is  our opportunity to get this crucial issue finally across the finish  line. A vote today for the Lumbee people will fix a historic injustice,  and I urge support of this amendment.\n\nMr. ROUZER. Mr. Chair, I yield…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…growth.\n\nWhether they are off to a trade school, community college, a 4-year  university, or heading straight into the workforce, their contributions  to our communities are crucial, and their voices are needed\n\nThey are the next generation of leaders, entrepreneurs, and  innovators who will make our State and country a better place.\n\nI especially want…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691604/als-awareness-month"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. CRANK. Mr. Speaker, the Studying NEPA's Impact on Projects Act  will provide Congress with crucial information on NEPA litigation. It  will also provide transparency to help ensure that agencies comply with  the Fiscal Responsibility Act's NEPA deadlines and page limits.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697711/studying-nepas-impact-on-projects-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…birthday of James Madison, who not only is a  former President, but the acclaimed ``Father of the Constitution.''\n\nOn its 20th anniversary, Sunshine Week continues to be a crucial  reminder of the need for transparency and open government. To control a  government as big as ours, it takes a lot of very bright light shining  on every Agency. As Justice…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688777/sunshine-week"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…HPH Hospice services Hernando, Citrus, and  Pasco Counties. In 2022, Sue joined the HPH Hospice Foundation as a  founding member of the Women of Giving (WOG). She played a crucial role  on the Steering Committee, helping to define the WOG's operating  structure, roles, mission, and vision. Together, the members aimed to  create a significant pool of…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691906/recognizing-sue-simone"}]