[{"senator": "Judy Chu", "party": "Democrat", "sentence": "Rather than feed into the President's cruelty, we are standing up for  the communities we were elected to represent."}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "I refuse to accept Republicans governing in the currency of cruelty."}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "The cruelty is the point."}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "You call it what it is: cruelty."}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "Both of these men should still be here, and it breaks my heart that  their lives were cut so short from this disgusting act of cruelty."}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "It is sad that many Members of Congress have  rolled over and enabled this cruelty that is now happening in our  country."}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "The  cruelty is the point."}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "It  is about cruelty."}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "They see the cruelty behind  these choices, and they are not fooled."}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Speaker, more than any other day I have been in  Congress, the cruelty of the Trump administration and the Republican  majority is on display."}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "I see only chaos, fear, and cruelty."}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Cruelty is not an answer."}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "This is the depths of Hamas' cruelty."}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "I have never seen such cruelty contained in a budget in all my years  here."}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "I like to  describe it not as shameful, lawless, and reckless, which it is all  those things, but it is also the cruelty of how it is being done."}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "The perpetrator's rap  sheet includes arrests for homicide, assault, cruelty toward children,  domestic violence, and damaged property."}, {"senator": "Chip Roy", "party": "Republican", "sentence": "We have a criminal illegal alien from Vietnam who has been convicted  25 times for crimes including possession of a controlled substance;  second-degree robbery; cruelty toward the elderly; arson property;  taking vehicle without consent; and theft."}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "The result is severe psychological coercion and abuse--children  forced into self-mutilation, cruelty to animals, or even suicide, all  at the direction of anonymous criminals who often operate across  borders and behind ever-changing online identities."}, {"senator": "Brian Jack", "party": "Republican", "sentence": "Likewise, law enforcement in Minnesota arrested a criminal illegal  alien from Mexico previously arrested for child cruelty and battery."}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "This February, their murdered bodies were treated as trophies,  and later we learned in a final act of cruelty that Shiri's body had  been substituted for another."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "This cruelty also prevented families from  carrying out proper religious burial rights--a fundamental act of  dignity and respect for the dead in Jewish tradition."}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "A criminal illegal alien from Mexico previously arrested for child  cruelty and battery was also picked up by ICE."}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Maybe we have people around here that permanent poverty--that level  of cruelty--is what is built into their political manifesto."}, {"senator": "David Schweikert", "party": "Republican", "sentence": "That is the cruelty of what the last  administration did."}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "America must continue  to lead with strength and morality on the world stage and refuse to  fund these brutal tactics and cruelty."}]