[{"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…SNAP is our Nation's most effective antihunger initiative. The  devastating Republican cuts threaten children and families in  California and across America who are scared and crying out for help.\n\nOne single mom, Melissa, from California who lives in a district  represented by one of our Republican colleagues shared that if not for  SNAP, her family of…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691483/gop-tax-scam-hurts-women-and-families"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…leadership, and what this administration has wrought on the American  people.\n\nWe serve in this body to be responsive to the American people. They  are clamoring, and they are crying out for help. We can help them with  passing five bills that meet their needs, and we can help them by  gaining control and focusing our ire and our anger over an agency that…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…no stopping what comes next because the administration has  made it clear that Venezuela is the opening salvo. Will it be Cuba next  or Colombia or Mexico or Greenland, for crying out loud?\n\nThis is the moment when we need to stand up and exercise our powers  as part of the government that is closest to the people to make it  clear that no President…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698678/venezuela"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Their immune systems collapse, leaving  them defenseless to disease.\n\nMr. Speaker, if you go into a clinic where children are suffering  from malnutrition, you won't hear them crying because they don't have  the strength. The silence is all you will hear.\n\nWhen it comes to nutrition, the first 1,000 days of a child's life  are critical for development for…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690379/edesia-nutrition-saves-malnourished-children"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…This is despite the pleas of Americans  protesting Donald Trump and Republicans' plan to steal their healthcare  and let kids go hungry and despite the overwhelming majority crying out  for everyday Americans over the whims of billionaires.\n\nClearly, Republicans don't care about the facts or figures. Maybe  they will listen to my constituent Al. Al is…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689908/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…well:\n\nAll of the tax policy that we are talking about is not paid       for.\n\nMr. Speaker, all of the pearl-clutching that went on leading to the  election and all of the crying and screaming about the national debt  all of a sudden doesn't matter? We are going to put, at a minimum, $4.6  trillion onto the national debt because of this.\n\nWhat Republicans…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…shop with his wife. William was a  lead plaintiff in a lawsuit against Home Depot and local police for  abuse. ICE retaliated.\n\nWe all saw the Cicero case: children were left crying on the side of  an industrial road after the parents were taken away by ICE. That is  state-sanctioned cruelty against children, the President's specialty.\n\nDHS insists they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695742/ice-and-dhs-lost-credibility"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…sisters who are being  targeted and abducted, taken from their homes, torn away from their  babies, and disappeared on their way to church, work, and school.\n\nThere are children crying in their teachers' arms, families  separated, and communities traumatized that if they have not already  been kidnapped, they are fearful that they will be.\n\nChildren crying…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692413/protecting-our-immigrant-communities"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…Louis Job  Corps Center last week, they saw what happens when cruelty becomes  policy. They saw students being escorted off campus, bags in hand,  dreams on hold; grandparents crying because their grandkids had finally  found something that gave them a shot, and now it is gone. In St.  Louis, that was over 200 students who were impacted.\n\nJob Corps is exactly…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692061/st-louis-job-corps-center"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…could not afford health insurance. They had no other  option. They had nowhere to go. You just would end up without health  insurance.\n\nI have constituents coming to me now crying because their insurance  is going from $500 a month to $1,500 a month. That is an increase of  $1,000 a month. Who could afford that? No one in the middle class.\n\nAt the end…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696742/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…for lives to be shattered, and for  communities to keep on living in fear.\n\nAs a mother who lost her son to gun violence, let me be perfectly  clear: The American people are crying out for the basic right to live  safe from unnecessary gun violence. Americans want to send their  children to school or to the mall without wondering if they will ever  come…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690394/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…resolution would nullify the  FCC's rule that allows schools and libraries participating to join Wi- Fi hotspots to students.\n\nI have to ask, Really? Are schools and teachers crying out to repeal  this rule? Really? No, they are not. How does this proposal make any  sense for them or for families? for the parents? for the community? It  makes no sense.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690726/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…bailing out rich Wall Street investors who invested in  Argentina debt.\n\nThe American people are begging us to do something about the  skyrocketing cost of living. They are crying out for help. But Donald  Trump can't hear them over the sound of the bulldozers that are  demolishing a chunk of the White House to build his brandnew ballroom,  a $250 million…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696350/trump-administration"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…deployed, kids coming home in caskets, and taxpayers paying for endless  quagmires that never end, and the same people here on the floor telling  us that we are premature or crying wolf are suddenly nowhere to be  found.\n\nThat is the truth, Mr. Speaker. Wars are easy to start, but they are  hard as hell to stop.\n\nThis resolution ought to pass no matter…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699359/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…pastors was a field director for ICE. The mob  cursed, threatened, and terrorized not just the pastor but the young  children in the congregation, screaming in the faces of crying children  that their parents were Nazis who were going to burn in Hell. They  blocked the stairs to the childcare area so that the parents couldn't  reach their kids, and as…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…leading on this issue  on behalf of the people they represent and all Americans.\n\nEveryone knows the Washington bureaucracy doesn't always move  quickly, even when Americans are crying out for help after a natural  disaster.\n\nThis bill allows for the postponing of tax filing deadlines for  Americans living in a State-declared disaster area that has yet to…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689383/filing-relief-for-natural-disasters-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…restrictions including shots that  weren't really tested or proven. Now we find out that the data, there  is a lot of concern about mRNA, in particular.\n\nI talked to nurses who were crying in our office, but they felt like  they couldn't risk losing their job. They chose to get shots that they  were concerned about. The coercive power of the access to earning…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…receive  comfort from Revelation 21:4 and the promise that: ``He will wipe away  every tear from their eyes, and death shall be no more, neither shall  there be mourning, nor crying, nor pain anymore, for the former things  have passed away.''\n\nWe thank Doug for his friendship, and we will carry on with the work  that he started. He will be missed.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698726/9999"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…outrage when the Biden administration allowed millions of  undocumented illegals into our country? Where was your outrage when my  own constituents, the Corcoran family, were crying over the body of  their child who was killed at the hands of an illegal? Where were you  when Laken Riley and many other Americans were slaughtered by illegal  aliens who were…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690313/abrego-garcia"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…So-and-so, we believe  it was a drug overdose. The toxicology test will confirm, but we  believe it was a drug overdose.\n\nThen, all holy you-know-what breaks out in the house, from crying  tears to frustration at the individual who delivered the worst news in  their lifetime. They never forget that police officer, what he or she  looked like, the demeanor he…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691938/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}]