[{"senator": "Sean Casten", "party": "Democrat", "sentence": "…attack. Fentanyl traffickers use it to  get paid. All, 100 percent, of ransomware attacks get paid in crypto.\n\nThat is a really good argument for legislation, and if the crypto  industry did not want to hang out with criminals, then they would have  welcomed good legislation. These bills are not that.\n\nThe CLARITY Act would exempt any platform that is…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693618/crypto-used-by-criminals-and-corrupt-politicians"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…supply and demand show that prices spike.\n\nSo if you want to know what the real emergency is, the real emergency  is that the Trump administration has sold out to the crypto industry;  it has sold out to the fossil fuel industry. It denies climate change;  it pretends it is a hoax. Literally, the President has said that in,  like, words. And that climate…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…today to voice support for  the CLARITY Act. While there is still work to be done, it is an  important step in providing crucial and clear regulatory framework to  the crypto industry.\n\nLet's break it down. Today, one in six U.S. adults, 17 percent of the  population, are invested in or use cryptocurrency. That is 55 million  Americans. There is more…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…unharmed because the worst aspect of this bill is that Republicans  have repeatedly refused to include a single amendment preventing a  Federal taxpayer bailout of the crypto industry.\n\nThat is what this bill does.\n\nAdditionally, this bill includes zero provisions to prevent the  President, who has a $620-million conflict of interest, from continuing…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693784/digital-asset-market-clarity-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…term. Once the  President figured out how to personally make this part of his  investment portfolio, his tune changed.\n\nThis is how President Trump is using the unregulated crypto industry  to enrich himself and his family. Three days before he took office,  President Trump launched his meme coin, a novelty item similar to  baseball cards or Beanie Babies.…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692590/genius-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…center.\n\nMy bill would foster innovation, while properly addressing the  concerns I have long held about safeguarding our Nation's consumers  from scams that inundated the crypto industry. Our bill also addressed  national security concerns that adversaries and criminal organizations  could use stablecoins for their very harmful purposes.\n\nWhile we are…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Federal Reserve.\n\nNow, Mr. Speaker, let me tell you a bit about what these three bills  would do. H.R. 3633, which Republicans are calling the CLARITY Act,  would carve the crypto industry out from current securities laws and  regulations. This would continue to expose consumers to harmful crypto  practices. Additionally, the CLARITY Act would not only enable…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694254/9999"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…costs, our elders are targeted by financial scams, and investors are  trying to recover from volatile markets. Republicans are ignoring all  of that to prioritize the crypto industry's wish list.\n\nTo be clear, the people deserve crypto legislation that is fair,  transparent, and accountable, not a bill that opens the floodgates to  conflicts of interest…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693786/digital-asset-market-clarity-act-of-2025"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…Unfortunately, the facts surrounding the development of CBDC have  been obscured by disinformation, conspiracy theories, and extreme  political ideology. Republicans and the crypto industry have made  unfounded claims that a CBDC will be used as a surveillance tool by the  Federal Government.\n\nLet's be clear about what a CBDC is. It is a publicly issued digital…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693737/anti-cbdc-surveillance-state-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "Mr. SHERMAN. Mr. Speaker, I worked hard in school, but the grade I am  proudest of is to be the first Member of this House to get an ``F''  from the crypto industry.\n\nArticle I, Section 8, of the U.S. Constitution says that it is the  Federal Government and Congress who should coin money and determine the  value thereof. However,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693738/anti-cbdc-surveillance-state-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…up.\n\nSince January of this year, President Trump and his family have  launched or are planning to launch six different crypto ventures.  Congressional Republicans and the crypto industry will state that these  conflicts of interest take away from the discussion on other parts of  the bill. They claim that this bill is good for consumers and  investors.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…without any transparency, just by  tokenizing their security.\n\nLet's be clear. Putting a security on the blockchain doesn't make  investors safe. It might make money for the crypto industry. Mr.  Speaker, I know you all like that. It might make it possible for the  companies to temporarily raise more money from dumb investors because  they don't get that…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693785/digital-asset-market-clarity-act-of-2025"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "Mr. SHERMAN. Mr. Speaker, I worked hard in school, but the grade I am  proudest of is getting the first F ever issued by the crypto industry.\n\nThis rule prohibits you from considering two amendments that had  total support from Democrats and total rejection from Republicans in  the Financial Services Committee.…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693548/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…crypto assets. However, today's bills  are not the answer to that problem.\n\nThe CLARITY and GENIUS Acts are bad legislation. They are industry- written bills that give the crypto industry everything it wants at the  expense of retail investors, consumers, and the overall health of our  financial system. These bills are products of the D.C. swamp that so…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Anti-CBDC Surveillance State  Act are all critical bills that will help make America the crypto  capital of the world. These bills provide simplified rules of the road  for the crypto industry, which so desperately needs these provisions to  flourish. Specifically, they create federal standards for stablecoins,  provide clear definitions for different digital…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693546/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}]