[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…to listen to what people are asking for and address their  concerns in a real way, and our government in the United States isn't  helping. In fact, we make the lives of the Cuban people worse, a lot  worse.\n\nI have visited Cuba many times as a Member of Congress. I have met  with Cubans in their homes and have talked to them in their own  communities.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692909/do-not-forget-the-crisis-in-cuba"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…intimidation and threats. In south Florida, immigration isn't an  abstract political issue for us. It is personal. Our region is home to  vibrant Jamaican, Haitian, Venezuelan, Cuban, and Central-American  communities. They are nurses, doctors, pastors, teachers, small  business owners, and caregivers.\n\nThe reason our economies thrive is because of our…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692239/ice-raids-in-california"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…rise today in honor of Hispanic American  Heritage Month to recognize an extraordinary artist, educator, and  community leader from Rochester, New York, Jason Barber.\n\nAs a Cuban-American artist and educator, Jason Barber has devoted his  creative journey to exploring the intersection of memory and place,  weaving together Rochester's histories with…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695841/recognizing-jason-barber"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…jets, an aircraft carrier, and more than 15,000  troops to the Caribbean is merely a counterdrug mission. This is the  largest U.S. military buildup in the region since the Cuban Missile  Crisis.\n\nIf this were really about drugs, why are the United States forces  seizing oil tankers? The stated mission, the scale of buildup, and the  actions taken simply…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…would make a big  difference.\n\nPresident John F. Kennedy, a Navy man and the only President ever  awarded the Purple Heart, understood exactly what to do when faced with  the Cuban Missile Crisis perpetrated by Communist Russia one-half  century ago. He blockaded the region.\n\nThis country has the strongest defense ever known to humankind. We  can protect…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "French Hill", "party": "Republican", "sentence": "…is something that  the sponsor of the resolution, Congresswoman Salazar of Florida, has  focused on combating for her entire career.\n\nCongresswoman Salazar is the daughter of Cuban exiles and was born in  Miami's Little Havana. Representative Salazar has led the charge  against socialist policies.\n\nThis resolution today is just one example of her commitment…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697143/denouncing-the-horrors-of-socialism"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Europe come to America and succeed wildly again and again.  Statistically, these groups are doing better than the native born, be  it the Muslims, Hmong, Chinese, Filipino, Cuban, Nigerian, what have  you.\n\nI think we have to remember that it is the welfare structure which is  right now creating huge incentives not to raise children in a nuclear  family.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…was wisely counseled to flee Venezuela. If he had run,  where would he have run? He would have run straight to Moscow. For  decades, Russia has been a friend to the murderous Cuban regime. And  now, as the Supreme Leader in Iran considers his options, where might  he go for refuge? The only place he could go is Moscow. So that is the  company Vladimir…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699095/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…interests and  citizens. The operation only saw 200 troops, and they were inside  Venezuela, on Venezuela's soil, for less than 2 hours. Those troops  engaged with some unfortunate Cuban guards, who are no longer with us,  for 27 minutes. That is what this was made up of. It was incredibly  brief, targeted, and very successful.\n\nThe War Powers Act requires…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699089/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…steps toward confronting, for example, the  regime in Cuba and includes limitations on funding for countries and  organizations that participate in the human trafficking of Cuban  medical professionals while directing the Secretary of State to revoke  visas for officials of countries involved in this grotesque human  trafficking.\n\nMr. Chairman, a smart…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699051/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…against an ideology that has destroyed millions and millions of  families--many of those families I serve in District 27, the heart of  the city of Miami, the heart of the Cuban exile community and now the  Venezuelan community--and murdered more than 100 million lives besides  crushing hundreds of thousands of other families and individuals.\n\nUnfortunately,…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697160/denouncing-the-horrors-of-socialism"}]