[{"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, when we say that the Republican Party has  turned into a cult, this is what we mean. Our Republican colleagues are  pushing a bill that would throw their constituents under the bus, a  bill that flies in the face of everything they claim…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693238/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…stop being a reckless rubberstamp for  Donald Trump's extreme agenda, to stand up to him every now and then as  part of a separate and coequal branch of government.\n\nStop the cult-like behavior, Mr. Speaker. It is hurting your very  constituents.\n\nWe have an opportunity, if we vote down this rule, to actually take  up for consideration the resolution…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699898/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…fireworks, flags, and cameras,  not for this country, but for himself. He says to close your ears,  close your eyes, and vote for this bill. Honestly, it sounds more like  a cult than a Congress to me.\n\nSome Republicans promised their voters no cuts to Medicaid and no new  debt. Now, they are flipping faster than pancakes at a campaign  breakfast. The…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…and billionaires in  our elections, it is ahistorical. In fact, this has not historically  been a particularly partisan issue except for the last 25 years.\n\nThere is a giant, cult-like poster of Donald Trump on the Department  of Labor that I drive by every day in and out of the Capitol. It is  super creepy, the idea that we have Mao- and Stalin-like…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699117/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…to oppose this bill that allows  health insurance premiums for 22 million American families to skyrocket  and raises healthcare costs for everyone. Trump and his Republican cult  of followers in Congress have unleashed a shameful crisis of cruelty  and corruption on the American people.\n\nFirst, they slash Medicaid by a trillion dollars, kicked 15 million…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696690/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Department of Education. That is to  steal money from public schools and funnel it into private ones that  don't care about teaching our kids, only indoctrinating them into the  cult of Trump.\n\nMr. Speaker, make no mistake. These attacks on the Department of  Education are deeply, deeply unpopular in every corner of the country.  In fact, two-thirds of Americans…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…1969 coup against the monarchy and later adopted the titles       of ``brotherly leader'' and ``King of Kings'' of Africa, had       for decades molded a seemingly invincible cult of personality       bolstered by grand infrastructure projects and iron-fisted       suppression of dissent until widespread unrest swelled around       the Arab Spring movement.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…for the ride.\n\nStephen Miller, a top administration official, is on TV talking about  Donald Trump like he is Kim Jong-un. It is creepy.\n\nThe majority says they are not in a cult. Now is their chance to  prove it.\n\nTrump is doing literally the exact opposite of what he promised to do  in his campaign. Instead of having the courage to say something, 99…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…would be up in arms. We would be  having investigations and subpoenas, and it would be a national  scandal. Yet, we are hearing nothing from Republicans because they are  in a cult.\n\nI will say what they won't: None of this is normal. This is not a  joke. This is not something Republicans can  shrug off or turn away from. This President is threatening…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…deeply  embarrassing. I know my Republican colleagues are smart people. They  are not dumb, so I have to think that they share this embarrassment,  unless they are members of a cult, a cult of personality based around a  dear leader who they are required to obey or risk retribution, and upon  whom they bestow endless compliments and praise in order to seek…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…and  exercise practices and exceptional good health make their organs highly  desirable.\n\nThe Chinese Communist Party has declared the Falun Gong practitioners  to be an evil cult fit for butchering.\n\nMr. Speaker, over the years I have chaired several hearings on this  barbaric abuse, and 2 years ago, on March 27, the House passed my bill,  the Stop Forced…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Energy, or the EERE.\n\nThis amendment is offered because we simply cannot continue to fund  the destruction--and that is what it is--of the U.S. energy grid to  satisfy a climate cult.\n\nThe FY 2024 minibus gave this office $3.5 billion. While the  underlying bill cuts funding down to $1.9 billion, we need to defund it  entirely. Why are we fooling around…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…kill anyone who is not  a Muslim. Think about that.\n\nThe media has called me a racist for calling this out. Radical Islam  isn't a race; it is a political ideology, and it is a cult. No, I am  not a racist, and I clearly--people back in Alabama agree with me. I  was proud to see hundreds of Alabamians show up to protest at the  zoning meeting where the…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}]