[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…is a  wholesale attack on clean energy under the guise of reliability.  Americans can see through the nonsense here to the truth, and that is  that Republicans are waging a culture war against wind and solar.  American families are footing the bill with higher monthly utility  bills.\n\nFor a moment, I want to try to take Republicans at their word, that…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…I thank all  of the educators and staff who work tirelessly to build an environment  that provides a quality education to hundreds of students and helps  preserve the rich culture of Native peoples from across North America.  I thank them for their work of creating the next generation of Native  American leaders.", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696915/recognizing-native-american-heritage-month"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…thank the gentleman for giving me the opportunity to highlight how  Citizens United has impacted not just the political landscape and  indeed this room but also our Nation, our culture, and certainly our  economy.\n\nWith the floodgates opened by the Supreme Court in 2010, corporations  and billionaires can now make unlimited independent expenditures. As a…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699234/restoring-election-integrity"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Citizens United decision.\n\nHouse Democrats will ensure this package reflects the pressing reform  interests of Americans from coast to coast, Americans who demand an end  to the culture of corruption endemic in Washington.\n\nWhile Citizens United did not create every problem in our politics,  it has undeniably enhanced the power of the wealthiest few at the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699248/citizens-united-16th-anniversary"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…rates among men are significantly higher than women, yet the  mental health infrastructure fails to acknowledge the interventions  that resonate with men. As you heard, the culture for many, many years  has told men: You don't need mental health attention. Suck it up.\n\nThat is probably true for a lot of health issues, and he would not  like to hear me…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692205/raising-awareness-about-mens-health"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…why many of us are  very sensitive to efforts to attack things like diversity and efforts  to attack things like equity and inclusion, because we know that we  come from a culture and from a people who had to deal with adversity,  inequity, and purposeful exclusion for centuries; when all we wanted  was a level playing field; when all we wanted was…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…yielding.  I rise in opposition to this bill, which will only hurt the retirement  savings of millions of Americans.\n\nOur Republican colleagues are once again prioritizing culture wars  over working people and threatening the retirement savings of nurses,  teachers, police officers, and healthcare workers, who are just trying  to save for their future…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699159/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…diverse leadership. The respect he commanded showed that       authority flows from character and capability, not color or       gender.\n\nThe transformation of military culture is far from       perfection, but Gregg showed us how to advance it--through       impeccable service, unwavering determination, and a       commitment to bringing others…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688378/recognizing-virginias-fourth-district-black-history-month-essay-contest-1st-place-high-school-winner-tanvi-palavalas"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…authorization from Congress as well and  let the representatives of the people decide as our Constitution  states.\n\nFourth, this bill continues to embrace the Trump administration's  culture war attacks on Diversity, Equity, Inclusion and Accessibility  programs that undermine recruitment, retention and unit cohesion.  Americans have watched President Trump turn…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Vice President and the  President himself.\n\nThis brazen denial of rights and facts is in the water at DHS  headquarters, and it is increasingly clear that this has become the  culture of ICE and Customs and Border Protection.\n\nThat is why I am standing here this week to say clearly: not another  dime for this kind of lawless immigration regime. We will…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699422/9999"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…educators out of 20,000 across Orange County  to be selected as Orange County Teacher of the Year.\n\nTracy is known for her outstanding ability to build a positive  classroom culture and to find creative ways to engage her students.  Tracy goes above and beyond outside of the classroom, as well. She  mentors teacher candidates and serves as a lead math…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690842/teacher-appreciation-week"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…North  America. Each artifact is a catalyst for cultural discovery, and often  a chance to highlight lesser-known Hungarian artists. For those with an  affinity for art and culture like me, frequenting the heritage center  is truly an incredible experience.\n\nSince its founding, the foundation's museum has welcomed over 80,000  visitors. There have been…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689612/9999"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…support and close collaboration on this  bill.\n\nToday, pilots and air traffic controllers who seek mental health care  are unfairly penalized by a system that perpetuates a culture of  silence. Current regulations mandate that if they seek care, then they  are immediately grounded for a minimum of 6 months, and then they are  still faced with delays,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695007/mental-health-in-aviation-act-of-2025"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…West Las Vegas, which became the heart of the city's  Black community during segregation.\n\nBlack-owned businesses and venues along the Black Strip on Jackson  Avenue allowed culture to thrive . . .\n\n. . . while entrepreneurship and homeownership helped local community  members begin to accumulate wealth.\n\nAnd breakthroughs, like the Sands Hotel allowing…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688004/black-history-month"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…will, several other experienced, respected, trusted public health  experts resigned from the CDC in protest. Some are now also sharing  alarming allegations of the widespread culture of conspiracy and  incompetence and willful ignorance of science that is now defining  R.F.K.'s leadership. Just this week, 1,000--1,000--HHS workers demanded  he resign because…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694964/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Ministries relies heavily on her to keep  Volunteer Services running smoothly, not just during the holidays but  all year round. She embodies the four key values of Metro's culture,  including: Character, Chemistry, Competency, and Calling.\n\nIt is clear Ellen Tantillo has made a profoundly positive impact on  our community, and I am grateful for her…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690680/recognizing-ellen-tantillo"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…process that       incorporated meaningful consultation with our community,       recognizing the connection between economic self-      determination, our community and our culture.\n\nRestoring the 2020 program ROD and overturning the 2024 ROD       as a rule is consistent with the FY 2025 reconciliation bill,       which requires four lease sales over…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Unfortunately, in recent  years, it has been for worse.\n\nAn ethos of censorship took hold first in American universities  before spreading to tech companies throughout our broader culture and  into the government itself.\n\nOf course we saw most vividly on university campuses the absolutely  appalling scenes of anti-Semitism that sadly also became part of our…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689035/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…we have received word from the Acting Chairman and CEO of USADF  a request that we defund this entity because, as he put it, it is trash  and, as he put it, it is a corrupt culture of waste, fraud, and abuse.  So when the Acting Chairman and CEO of an entity that is getting all  this public funding--all these millions of dollars--says defund it  because…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699442/consolidated-appropriations-act-2026"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…dollars of Chinese funds have flowed into America's K-12  classrooms where students are subject to Chinese Communist Party  propaganda under the guise of Chinese language and culture programming.\n\nIn fact, a recent Parents Defending Education investigation found  that 143 schools across 34 States hosted a Confucius classroom or  otherwise had ties to the…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…proclamation for ``Jewish Heritage Week'', and in that       proclamation, President Carter spoke about the bountiful       contributions made by the Jewish people to the culture and       history of the United States;\n\nWhereas Congress has played a central role in recognizing       ``Jewish American Heritage Month'' since the House of       Representatives…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…genuine care for the well-being and development of the  students. His efforts ensure that the program runs smoothly and  effectively, providing a positive influence on the school culture. In  addition to his work with the Eagle Eyes Program, Mr. Ross is an  invaluable member of the School Advisory Council. His contributions to  the council are marked by thoughtful…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691992/recognizing-robert-ross"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…including fines and loss of Federal  funding. It also ensures transparency in private university endowments,  preventing foreign adversaries from quietly shaping campuses' culture  and academic research behind closed doors.\n\nThe American people want to know when foreign countries, including  our adversaries, are active on our college campuses. That…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689028/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Riverside District.\n\nThis year, it was ranked as one of the top holiday markets in the  entire country by USA Today, drawing visitors from all over and  spotlighting the rich culture and community spirit of Savannah.\n\nThe market transforms historic River Street into a festive  destination filled with local vendors, holiday entertainment, seasonal  food…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698573/recognizing-the-savannah-christmas-market"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…readiness challenges in the Department, including a specific  focus on the Joint Strike Fighter and amphibious ship readiness  concerns.\n\nThis bill reestablishes safety as a culture and seeks to partially  correct the mistakes that led up to the Black Hawk collision with a  commercial airliner here at DCA earlier this year.\n\nThis bill seeks to foundationally…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695145/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…head coach in the Football  Championship Subdivision, or FCS.\n\nThis national honor reflects Coach Cahill's leadership in building  Lehigh football and restoring a championship culture. Under his  guidance, the Mountain Hawks captured back-to-back Patriot League  titles, earned consecutive FCS playoff appearances, and completed an  undefeated regular season.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699907/recognizing-joshua-hobson"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…about 50 years  ago.\n\nInstead, in our society, we have all the helping professions, the  guidance counselors, the psychologists, and the psychiatrists, as well  as our pop culture icons from California, out there pushing our poor  young people into the idea that it is cool to be transgender.\n\nIn fact, recently, it has come out that the number of kids…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698356/protect-childrens-innocence-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…experiences.\n\nHis passion for California's Gold Country, the 49er Gold Rush, and  Wild West history has created traditions that are now woven into the  very fabric of Union Hill's culture. Students of Mr. Albano receive a  living, breathing understanding of history and our Nation's story.\n\nBeyond his dynamic and innovative teaching style, Mr. Albano is a  beloved…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…happening  right now, right before our very eyes. The enemy is now inside the  gates.\n\nThere are plenty of Muslims that come here, love this country,  assimilate into American culture, and they have a duty to join in the  fight and speak out against the mainstream media and elected officials  who are empowering radical Islam to take a foothold in the United…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…their limits, to build mental and physical  toughness in an era when both are in short supply.\n\nToo many kids today are struggling--with stress, with isolation, and  with a culture that pushes them toward passivity instead of purpose.  Meanwhile, Washington drags its feet. But these businesses aren't  waiting for permission--they're taking action. And…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690045/recognizing-gateway-parks-and-barn-elite-training"}]