[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…can clearly see,  President Trump's new tariffs have become a massive tax hike on  consumers--a tax on the food we eat, a tax on the clothes we wear, the  cars we drive, every cup of coffee we have in the morning.\n\nThese rising costs are not just hurting consumers, actually; they are  hurting American businesses and our workforce too. We are already…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize New Terrain  Brewing Company of Golden, Colorado, for winning a Gold Medal from the  World Beer Cup, designating their Suntrip brew as a world-class beer.\n\nThe World Beer Cup, otherwise known as the ``Olympics of Beer,''  evaluates beers from around the world and recognizes…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694718/recognizing-new-terrain-brewing-company"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…SWAT Team successfully apprehended the suspected shooter.\n\nMr. Speaker, on October 9, before many of us had left the comfort of  our homes or checked our emails or even had a cup of coffee, Sergeant  Dollinger, Officer Knam, Officer Foltz, and firefighter-paramedic  Bosler accomplished an incredible feat of bravery and heroism,  reminding us how important…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697308/champions-of-the-week-north-canton-first-responders"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…second highest number of Federal workers.\n\nWhy are the Republicans going to cut that?\n\nMr. Speaker, might I remind you that we have the Olympics coming, we  have the FIFA World Cup coming, we have the All-Star Game, and Super  Bowl coming, and we are still producing movies and TV. We are helping  people with their passports and their visas. If Republicans…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…up, and to fight back for  Black America and for all of America.\n\nIt is what my father did and what my mother did, even during a time  when diners charged him more money for a cup of coffee than the White  man sitting next to him.\n\nI can remember, as a child living in Chicago, Illinois, going into a  local Walgreens. I remember standing there with my…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687898/black-history-month"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…are staggering. They are stunning. But they fail to  capture  the human costs, the impact on everyday people who look out the window  in the morning as they have their first cup of coffee or see their  children at night for dinner as they come home and wonder what will  happen in the event of a healthcare emergency--not even an emergency.  What will…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694385/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…who are able to work, work. They earn so  little they still qualify for the benefit.\n\nBy the way, the benefit is on average of about $2 per person per  meal. You can't buy a cup of coffee in the United States Capitol  Complex for $2.\n\nThen what my friends don't talk about is how this is shifting some of  the cost burdens on to States. All of a sudden…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…of all these difficulties, Henry's has persevered. For a  century now, Henry's has remained a place where people from all walks  of life can gather over hearty food and a hot cup of coffee. The values  that characterize Henry's--community, kindness, and acceptance--are  Vermont values, and our state would not be the same without Henry's  sitting in the…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694323/recognizing-henrys-diner"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Elevation Beer  Company of Poncha Springs, Colorado, for winning a Bronze Medal from  the World Beer Cup for their Coconut Oil Man brew.\n\nThe World Beer Cup, otherwise known as the ``Olympics of Beer,''  evaluates beers from around the world and recognizes the top brewers  and…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694717/recognizing-elevation-beer-company"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…benefits, or they are going to  have to cut people off their nutrition benefits.\n\nThe SNAP benefit, on average, is about $2 per person per meal. That  is it. You can't buy a damn cup of coffee in the Capitol with that. My  Republican friends are obsessed with trying to throw people off of this  benefit. I have no idea why.\n\nMost of the people on the benefit…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…make sure that those basic services--because nothing  I talked about was not basic--are not cut.\n\nI am trying to find out why we have a President who is chair of both  the World Cup and the Olympics. These are events that will be happening  in my district and in my State. The World Cup festivities will be  happening in cities across this State. How can…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…look at the test scores. Over the last  year, the price of beef has gone up at the grocery store by 20 percent.  That is an F. Today, Americans pay 40 percent more for a single cup of  coffee on their way to work than they did last year. That is an F.  People are paying more in electricity bills while Donald Trump has cut  domestic energy jobs. That is…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697816/affordability"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…investments for continuing Amtrak service  along the Northeast Corridor and national network by providing $2.4  billion.\n\nThe bill also includes $100 million for the 2026 World Cup and $94  million for the 2028 Olympics to help transit agencies manage local  transportation in support of games across the country.\n\nMadam Speaker, this year's Transportation-Housing…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699579/consolidated-appropriations-act-2026"}, {"senator": "Juan Vargas", "party": "Democrat", "sentence": "…Center, the San Diego Zoo, the USD  School of Law, and the San Diego History Center.\n\nNotably, Tom was commodore of the San Diego Yacht Club during its  defense of America's Cup in 1994.\n\nTom's service to the San Diego Zoo is especially meaningful as his  father served as the zoo's board chairman in the 1960s.\n\nDespite his many achievements, Tom considers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695799/recognizing-tom-fetter"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…ecosystems.  If this graphic doesn't convince my colleagues that we don't want these  suckers in the Great Lakes, I am not sure what will.\n\nKind of like a giant leech, their suction-cup mouth clamps onto  native fish species to feed on them. One sea lamprey can kill up to 40  pounds of Great Lakes fish over a 12- to 18-month feeding period, and  that is just…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698193/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…racing. Love drives  for Richard Childress Racing out of Welcome, North Carolina, a team  known for its historic caliber of elite racers, from Dale Earnhardt  claiming six NASCAR Cup Series championships and two Daytona 500s, to  Austin Dillon bringing home a third Daytona 500 victory in 2018. RCR  racing continues to represent the pride of North Carolina…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696515/recognizing-jesse-love-jr"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "Mrs. MOODY. Mr. President, today I rise to announce a resolution  commending and congratulating the Florida Panthers on winning the 2025  Stanley Cup Final.\n\nLast month, our State--the great State of Florida--along with loyal  fans nationwide, came together to cheer on the Florida Panthers as they  fought hard to secure a…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694088/commending-and-congratulating-the-florida-panthers-on-winning-the-2025-stanley-cup-final"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…about honoring the lives  we lost by doing everything possible to prevent and mitigate future  attacks. With major events on the horizon, including America250, the  FIFA World Cup, and the Los Angeles Olympics, we must ensure every  necessary security measure is in place to protect the millions of  visitors and attendees these events will bring.\n\nMadam…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696770/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Those college kids on that Friday had no idea of the impact they were  going to have across this great Nation. Those men went on to do great  things. Some went on to win Stanley Cup championships, such as Kenny  Morrow; my hero, Neal Broten, from Roseau, Minnesota; my hero, Mark  Pavelich, from Eveleth, Minnesota; and my other hero, Phil Verchota,  from…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695441/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…was up near $4 a gallon?\n\nTheir policies determined that when they ran all facets of the  government. Now, they have this revisionist history, and they want to  talk about a cup of coffee.\n\nThe tariff negotiations that President Trump has used have created  new deals and new markets for our products around the globe. It is  making a more competitive…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…cheering them on.\n\nThis is an exciting new effort. There is so much going on with soccer  in Spokane and across the country with the launch of our USL team and  the coming World Cup. I am so proud that this has taken place.\n\nMr. Speaker, I would like to give a special shout-out to the team's  manager, Anna McCoy, who is doing a wonderful job in her new…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695809/recognizing-spokane-impact"}, {"senator": "John Thune", "party": "Republican", "sentence": "…the National Fire Academy in Maryland, are closed.  Roughly 45,000 Americans who are in training at one of these centers  can't go to class right now.\n\nWe are hosting the World Cup in a few months, and some security  training for that event is on hold right now because of the shutdown.\n\nCivilian Coast Guard employees won't get a full paycheck at the end…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700181/state-of-the-union-address"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…every Californian and every  American of decency, regardless of party affiliation, to speak out  against the abject corruption that our Governor is attempting.\n\nRecognizing Tevis Cup Winners Heather and Jeremy Reynolds\n\nMr. KILEY of California. Mr. Speaker, I rise today to recognize  Heather and Jeremy Reynolds, the first- and second-place winners of the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694130/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Speaker, please join me in celebrating this remarkable group, the  Central Falcons softball team, and their unforgettable championship  run.            recognizing president's cup winner christendom college\n\nMr. CLINE. Mr. Speaker, today, I rise to honor Christendom College,  which has, once again, shown that excellence on the field can go hand  in hand…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693527/congratulating-central-high-school-womens-softball-team"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…I am honored to represent in the United  States Congress.\n\nOn February 9, the National Football Foundation named Stephenville  High School the national winner of the Hatchell Cup award. This is the  highest academic team honor in high school football, and the Yellow  Jackets were awarded this distinction with an outstanding 4.0 team GPA.\n\nOur community…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700201/stephenville-high-school-awarded-national-football-foundation-hatchell-cup"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…her daily walks and gathering flowers from the  community gardens to create beautiful floral arrangements for her  suite. A woman of few words, Helen loves sipping a good, hot cup of tea  while reminiscing on her past. Helen's ideal way to spend her birthday  exemplifies her ability to find joy in life's simplest blessings-- attending a quiet luncheon…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694743/recognizing-helen-birkheads-100th-birthday"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…tell  CBO how to do the scoring.\n\nMr. Speaker, I want to make an apology to everyone because this one  will  go a little longer than normal. Yes, I know. Everyone can grab a cup of  coffee or something. Hopefully, the Sergeant at Arms--we are apparently  not allowed to drink coffee on the floor. Whatever happens, don't get  caught, right?\n\nMr. Speaker,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…and 1984 Walla Walla High girls' teams remain the only State  basketball champions in Wa-Hi history. Yet, for more than four decades,  the 1984 champions have had no victory cup to mark their achievement.\n\nWhat began as a casual conversation last spring has turned into the  long-awaited correction of that injustice. This Saturday, after 42  years, the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699649/recognizing-1984-walla-walla-high-school-girls-basketball-team"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…gangs move these people every day.\n\nIt starts with community awareness. You have to be willing to  recognize the problem. You have to be willing to watch. We have the  FIFA World Cup and we have the Super Bowl coming up. This will swarm  our country even more so than now with this issue.\n\nI have talked to school board members. I have talked to parents. I…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699002/human-trafficking-awareness-month"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…together. Some notable achievements of the  UASC Tryzub include in 1856 the Club's Majors' Division soccer team  reached the national championship game for the coveted US Amateur Cup.  A year later the UASC Tryzub organized a professional soccer franchise;  the Philadelphia Ukrainian Nationals, which generated many professional  championships onto the City…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696205/recognizing-the-ukrainian-american-sport-center-tryzubs-75th-anniversary"}]