[{"senator": "John Garamendi", "party": "Democrat", "sentence": "…choose to designate accredited, nonprofit land trusts  to hold conservation easements purchased with federal funding under the  U.S. Forest Service's Forest Legacy Program. Current law requires that  only the federal or state governments can hold conservation easements  purchased under the Forest Legacy Program.\n\nAllowing States participating in the federal…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689872/reintroduction-of-the-forest-legacy-management-flexibility-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…Representative Flood from the great State of Nebraska.\n\nOur bill will unlock capital for entrepreneurs and small business  owners who have been left out for far too long.\n\nCurrent law allows only millionaires to invest in the markets that  fuel small businesses, shutting out countless Americans, especially  women, veterans, and people of color, based…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693886/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…are subject to penalties for attempting to register  to vote, and you are subject to felonies and deportation if you do vote  and are not an American citizen. That is the current law.\n\nI also remind my friend, the gentleman from California (Mr.  McClintock), that an estimated 135,000 women in his district have a  different name on their birth certificate…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…necessity.\n\nThe ability for airports to store this equipment on property is  essential to safe and efficient flight operations. Unfortunately, as my  colleague has mentioned, current law only allows airports to use their  AIP funding, the Airport Improvement Program funding, toward aircraft  deicing equipment and structures but not the storage facilities…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695008/facility-for-runway-operations-and-safe-transportation-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…in  reconciliation.\n\nSo, colleagues, two big issues are here. Are you really going to  invoke, for a bill that causes over $3 trillion in debt over 10 years  compared to current law--are you really going to invoke, for a  reconciliation bill that, for the first time, continues that ``Red  Sea'' in years 11 through 30--11 years, 30 years out, extending…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…police to use tactics that the  community does not want. D.C. residents should be empowered to decide  when to authorize their police to use dangerous tactics.\n\nUnder current D.C. law, pursuits are allowed if a fleeing suspect has  committed a violent crime, for example, or poses an imminent threat to  public safety and if the pursuit can be done in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695640/district-of-columbia-policing-protection-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…legislation supports this       interpretation.\n\nEven if this self-enforcement argument were to be accepted,       however, Congress could easily address it by replacing the       current law mandating that the Capital area's electors vote       in accordance with the outcome of the popular vote in the       District with a new legislative mandate that the Capital…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…around the  country, this legislation will render deportable people who never drove  drunk at all without any opportunity for judicial discretion or waiver.  Under current immigration law, undocumented people are already both  inadmissible and deportable. Furthermore, conviction for serious DUIs  already render even lawful permanent residents who have…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693082/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…from       the rate used to compute overtime compensation for eligible       workers. This would result in workers receiving less overtime       than they are owed under current law, which would in turn       incentivize employers to impose longer workweeks on already       over-worked employees. Further, workers who face longer       workweeks as a…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…postponed tax deadline for disaster zones. Additionally, this bill  solves the problem of misaligned deadlines and confusing collection  notices after a natural disaster.\n\nSince current law requires the IRS to send a notice and demand for  payment of tax within 60 days of processing a tax filing, individuals  in disaster zones who file early but wait to pay…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689313/disaster-related-extension-of-deadlines-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…to federal law by adding the Mayor of the  District of Columbia to the list of named principals for whom the  President shall order the U.S. flag be flown at half-staff. Current law  states that the President shall make this order ``upon the death of  principal figures of the United States Government and the Governor of a  State, territory, or possession,…", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692567/introduction-of-a-bill-to-permit-the-flag-of-the-united-states-to-be-flown-at-half-staff-in-the-event-of-the-death-of-a-mayor-of-the-district-of-columbia"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Act. Unfortunately, it doesn't  solve anything. It doesn't provide any additional child or elder care.\n\nWhat it does is take money out of people's pockets because, under  current law, employers must pay hourly workers time and a half for  hours worked over 40 hours in a week. That overtime rate is based on a  worker's regular rate of pay, which includes…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699005/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…definition of tipped employee in a manner that  would allow employers to undercut wages.\n\nAnybody in the service industry knows that tips vary from shift to  shift. Under the current law, the definition of tipped employee  accounts for those realities by stipulating that an employee must  customarily and regularly--customarily and regularly--receive more…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698969/tipped-employee-protection-act"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…between $2.7 million and $7 million per  every 20 miles each year. While there is a 2-year exception for the  newly designated Chumash Heritage National Marine Sanctuary, current  law requires operators and installers of deep-sea fiber-optic cables to  obtain a permit from NOAA and pay fair market fees for use of these  areas.\n\nI and many others here…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699957/undersea-cable-protection-act-of-2025"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…nothing to  help law enforcement access tasers. The fact is, this bill recklessly  and needlessly weakens both the National Firearms Act and the Gun  Control Act.\n\nUnder current law, tasers are not regulated by the National Firearms  Act. That is the law that regulates especially dangerous devices like  machine guns and sawed-off shotguns.\n\nUnder current…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…priority for our Subcommittee on Crime and Federal Government  Surveillance.\n\nA recent decision by the Seventh Circuit in United States v. Howard  exposed a dangerous gap in current law. Both of the previous speakers  have spoken to that, but that really is the crux of this. The court  overturned a conviction for producing child sexual abuse material  because…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698897/child-predators-accountability-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…What is perhaps most unfortunate is that many of the worst offenders  in this specific category return to the United States after being  deported due to gaps in the current immigration law.\n\nAs a former U.S. prosecutor, I saw how deportation alone is  insufficient to deter the committed illegal immigrant criminal. I have  investigated, tried, and convicted…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…have caused  students to turn to highly caffeinated sugary drinks rather than  healthy whole milk and other dairy products that are crucial to a  child's development.\n\nUnder current law, schools are only permitted to offer fat-free or  low-fat milk. The Whole Milk for Healthy Kids Act of 2025 will allow  schools to offer students a variety of healthy choices…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698187/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…amend the tax code to apply the ``mailbox rule'' to electronic  submissions of payments and documents to the Internal Revenue Service.\n\nAs the chairman articulated, under current law, if a taxpayer  physically mails a payment or tax return to the IRS that is postmarked  on the due date, that payment or tax return is considered timely even  if it is received…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689375/electronic-filing-and-payment-fairness-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…as specialized projectiles intended to deescalate  confrontations, have helped officers reduce injuries for themselves and  for the public. Yet the lack of clarity in the current law has made  procurement difficult and compliance confusing.\n\nH.R. 2189 fixes that, establishing clear, commonsense definitions and  regulatory pathways so that our law enforcement…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699900/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…research integrity, or our future generations.\n\nStudents, parents, and taxpayers have a right to know the financial  ties of these universities.\n\nThe DETERRENT Act strengthens current law by raising the reporting  standards and providing a real enforcement mechanism if schools try to  hide their dealings with foreign countries.\n\nI urge all of my colleagues…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…of her son who fell victim to sextortion and later  took his life.\n\nEach of these precious lives was taken too soon, and today, we honor  and remember them. Yet, under current law, law enforcement is not fully  equipped with the tools necessary to prosecute those who push children  into these acts. Sextortion falls outside of the CSAM statute, forcing…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698861/combating-online-predators-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…version of the  big, beautiful bill sometime in the next couple of weeks, we look at  this. It is not something that costs nothing. It is currently costing  us even under current law about $13.8 billion a year in tax credits  which are going to these well-connected developers.\n\nI think one thing that will also tell us that they are well-connected  is…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…of American innovation, but there is a  problem. After going public, these same companies can get hit with  extra paperwork if they try to grow through acquisitions.\n\nThe current law undermines the incentives that the JOBS Act set up,  so we look to change it with H.R. 3343. The bill fixes the problem and  keeps the rule simple and consistent so that…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693854/greenlighting-growth-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…proposed rule reflects a sea change to       management of the NPR-A as it was originally intended. The       rule is unnecessary, overly burdensome, fails to comply with       current law. For the reasons that follow, at a minimum, this       proposed rule should not be adopted.\n\nWho We Are: The RDC is a statewide, not for profit, trade       association…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…aerial systems,  such as the ones planning to be assembled under the Army's SkyFoundry  Initiative, which is also absolutely critical for our Nation's future  defense.\n\nUnder current law, these valuable lithium deposits are locked up on  Federal lands, preventing their usage. The MERICA Act would amend the  Mineral Leasing Act for Acquired Lands by adding…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698230/application-of-mineral-leasing-act-for-acquired-lands-to-hardrock-minerals"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…31 percent of all crash deaths in this  country. On average, drunk driving killed roughly 11,000 people in the  United States every year between 2012 and 2022. Yet, current  immigration law does not make aliens inadmissible or removable if they  drive drunk and recklessly break our laws.\n\nMy colleagues across the aisle will undoubtedly argue that this…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693084/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…criminalizing the coercion or enticement of a minor to engage in self- harm, animal crushing, or other abusive or degrading conduct.\n\nThis legislation closes dangerous gaps in current law and sends an  unmistakable message: Compelling a child to destroy themselves or to  harm others is child abuse. It is criminal, and it will be prosecuted.\n\nMadam Speaker,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698877/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Act introduced by my Ways and Means colleagues, Representatives  Randy Feenstra and Brendan Boyle. This bill would make a relatively  straightforward but needed update to current law to promote State-level  recruitment of foster care families.\n\nThousands of loving parents open their homes every year to offer care  and support for children in need. By…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688405/recruiting-families-using-data-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…the other side of the aisle who want  noncitizens to vote in our elections. In fact, we could just look at  our Nation's Capital, which allows noncitizens to vote under current  law in municipal elections.\n\nI am of the view that U.S. elections should be for U.S. citizens only  and that we should be proving that citizenship at the point in time  that…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}]