[{"senator": "Haley Stevens", "party": "Democrat", "sentence": "Ms. STEVENS. Mr. Speaker, tonight I rise with my Democratic  colleagues, frankly, to call out the dangerous and draconian  antiscience agendas of this current administration. Since day one, this  administration has unleashed chaos on our national scientific  enterprise, undermining our Nation's competitiveness, our health  safety, and the…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691394/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…invested $161.8 billion in  biomedical research in the U.S. This was allowed because of the basic  research done at NIH and NCI.\n\nDespite these numerous benefits, the current administration and many  of my Republican colleagues are proposing to cut the NIH's budget by 40  percent and NCI's budget by 37 percent. That would be a grave mistake  for individual…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692894/investing-in-biomedical-research"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…the importance  of Federal Agencies having qualified leadership, regardless of which  party is in charge. In several cases, I have voted in favor of  reporting the current administration's nominees out of committee and to  confirm them on the Senate floor, notwithstanding the political and  policy differences that we may have. But the Senate's constitutional…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691866/nominations-for-the-us-environmental-protection-agency"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…immigrants  are getting loans they are not supposed to. In the one case Republicans  like to cite, not prove, that has been provided, it is highly likely  that DOGE and the current administration are confusing the rules that  were in place at the time with the stricter 100 percent ownership  requirement they imposed later.\n\nThat is what this bill is really doing.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…A new CNN national poll shows that the majority of Americans believe  Congress is not doing enough to check this  President's actions. Nearly one-half say that the current  administration is weakening our democracy, our economy, and our global  standing. This bill really is Exhibit A.\n\nWe are not just renaming a gulf. We are drowning public trust in…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690937/gulf-of-america-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…misinformation, purging of experts and destruction of       scientific institutions, and destruction of critical       infrastructure.\n\nWe are seeing that the current administration's agenda is       misinformation and confusion. Federal healthcare and public       health institutions are facing unprecedented censorship and       harassment. Bans…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688410/a-serious-and-profound-moment"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…a role in creating this wonderful  museum.''\n\nThese are the words of George W. Bush.\n\nI thank Mr. Bush for having helped erect that magnificent museum now  that the current administration is trying to take out its materials.\n\nEarlier today, I wished Mr. Hegseth, our Secretary of Defense, could  have shown the honor and the decency to come into the Capitol…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…migration finally started to       feel grounded. Families began to imagine stability.       Children began to feel safer because their caregivers felt       safer. The current administration's actions surrounding       TPS are now reopening wounds that never fully healed.\n\nThe possibility of TPS being taken away has had a       devastating emotional impact…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…intended it to do, and that is to provide opportunity for people in  this Nation. That is what my friend, Congressman Deluzio, is all about.\n\nOne thing about this current administration is clear. They are doing  nothing about the cost-of-living crisis in  this Nation, which is getting worse. President Trump said he will fight  for the working class,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689082/economic-populism"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…to establish Juneteenth as a federal holiday  through the Juneteenth National Independence Day Act, the very history  that this day honors is now under attack by the current administration.  While we mark Juneteenth with prayers and proclamations, we must also  confront a harsh and unsettling truth: the significance of this day and  African American history…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692688/commemoration-of-juneteenth-amid-the-erosion-of-black-history"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…president should do--it  said that on page 319 of Project 2025.\n\nThe irony is not lost on me that we are here to discuss the ``state  of American education'' while the current Administration is actively  discussing how to dismantle the main federal agency responsible for  ensuring safe, quality education for all students. According to polls,  the majority…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…augment what we just heard from my Democratic  colleagues, who gave example after example of the crazy, uncoordinated  attack on Americans that we are now seeing from the current  administration.\n\nAs we hear those stories of the reality of the programs that are not  moving forward, the reversal of critical programs to protect  individuals and their healthcare,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…stores that distribute and support TikTok are  subject to severe penalties: up to $5,000 per user and that could  amount to billions of dollars in damages. And while the current  administration has signaled that they won't enforce the law, the  statute of limitations for that liability is 5 years, meaning future  administrations could apply those penalties…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692683/tiktok"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…have responsibility to       investigate alleged violations of civil rights laws.       Directing pregnant students to an institution that has       been gutted by the current Administration is little more       than lip service.\n\nThere is an alternate path forward. We applaud the       bipartisan legislation put forward by Representatives Lucy       McBath,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…as well as the demand for them.\n\nThere is still work to be done, including getting this bill across  the finish line and restoring vital funding that was cut by the current  administration for treatment and recovery.\n\nI will continue fighting to ensure that our communities have the  support that they need to save lives and confront addiction head-on.", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692340/calling-for-permanent-scheduling-for-fentanyl-analogues"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…also know that Iran is continuing to enrich uranium and  manufacture long-range missiles which together pose an unprecedented  threat to regional stability.\n\nAs the current administration works to achieve the total  dismantlement of Iran's nuclear program, it is critical that we give  them the tools that they need in order to enforce their policy of…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690689/solidify-iran-sanctions-act-of-2025"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…appropriations bill, let me  tell you what it will do. It will bolster our economic strength. It  will bolster our economic strength, which suffered the last 4 years,  under the current administration. It will create jobs. It will create  jobs that are much needed by Americans.\n\nMr. WEBER of Texas. Mr. Chair, this is going to create jobs, not just  for Texas but…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694854/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…prevent this administration or future  administrations from putting a similar resource management plan in  place without it coming back to Congress, then maybe the current  administration and Secretary Burgum can write a new resource management  plan that actually makes sense, that actually takes into account  America's need for energy, and that actually…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…over.\n\nAnd yet, we still have an entire military blockade of a country, and  that is not a war. This is a real question.\n\nSo we have been given a legal opinion by the current administration,  and we had one of their assistant attorneys general come and explain to  us why this is not a war. You have to realize this is an important part  of the debate because,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699091/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…is the wrong message to send to VA employees and to the veterans  who rely on the VA for lifesaving healthcare.\n\nNow, I applaud both parties in this Congress and the current  administration for taking the right steps and working together to pass  this bill and begin the work of restoring that trust.\n\nThis is commonsense legislation that ensures the VA…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…from a free market  economy.\n\nFinally, I hope the press corps pays attention to the huge number of  non-uniformed employees in the Department of Defense and what the  current administration is doing about it.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…codify the changes in catch and release, codify the permanent and  continued development of the wall, all the tools necessary to stop the  flow at the border that the current administration has put into action.  We should demand it. We should change the law so that no future Biden  and Mayorkas can endanger the American people.\n\nDoes the gentleman from…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…2008.\n\nMr. Ciscomani's bill will correct the Biden-Harris administration's  disservice to survivors and would ensure survivors have a seat at the  table again.\n\nThe current administration supports this bill and is therefore as  committed as I am to ensuring that the needs of the veterans' surviving  families are prioritized by the VA.\n\nNow, I am proud…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689687/prioritizing-veterans-survivors-act"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…2,000 eligible veterans, only 41  applications have been certified, and only 18 veterans have received  their conveyances.\n\nFortunately, executive orders issued by the current administration  have reinstated Federal land withdrawals that were previously revoked.  This bill will give these veterans time to participate in the program,  with ample land for…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693425/land-conveyances-for-alaska-native-vietnam-veterans"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Biden administration agreed, and they  actually increased that amount to $25 million. Neither the first Trump  administration, nor the Biden administration, nor the current  administration recognized Maduro as the legitimate leader of Venezuela.\n\nNow, we are not alone in that view. Many of our allies around the  world have taken the same position, hold…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698571/venezuela"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…Alaska Native veterans, only 41 applications have been certified, and  only 18 veterans have received their conveyances.\n\nFortunately, executive orders issued by the current administration  have reinstated Federal land withdrawals previously revoked, returning  lands to the State of Alaska and unlocking lands that had been closed.  This expansion of available…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693473/alaska-native-vietnam-era-veterans-land-allotment-extension-act-of-2025"}]