[{"senator": "Al Green", "party": "Democrat", "sentence": "…over 300 million  people to war without consulting with the Congress of the United States  of America.\n\nI do this because, if I do not, this authoritarian President that we  currently have will continue to assume power. He has already instigated  an assault on the citadel of democracy, the Capitol of the United  States of America. He went so far as to…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692829/government-of-the-people-by-the-people-and-for-the-people"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…various  officials, again, countries that are violating crimes against humanity.\n\nAgain, it is really important. My amendment basically allows us to  include countries that are currently under investigation or their  leaders have been convicted or have an arrest warrant out for the fact  that they have committed violation of international human rights laws.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689027/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…neighbors.\n\nMaternal mortality in rural areas is nearly double that of urban  areas, and more than 200 rural hospitals have closed their doors since  2005. Over 450 more are currently at risk of shutting their doors.\n\nThis isn't hypothetical. It is happening right now. Let's be clear:  When these providers and hospitals close their doors, everyone in those…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691418/gop-tax-scam-hurts-everyone"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…Congress  and a functioning appropriations process is to our separation of  powers, our checks and balances, and, therefore, to our very democracy.\n\nThe Federal Government is currently shut down because Republicans who  control the House, the Senate, and the White House are hell-bent on  raising healthcare costs for the American people. In fact, 22 million…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696335/trump-administration"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…AMVETS stems from her proud  lineage of service--her father, a World War II Army Veteran, and her  husband, Roger, a U.S. Navy Veteran--and is further honored by two  nephews currently serving in the U.S. Marine Corps; and\n\nWhereas, with 48 years of experience in the field of dentistry, Cindy  continues to serve her community even in retirement, offering…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690126/proclamation-for-national-amvets-auxiliary-president-cindy-rice"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Virginia--20 projects.\n\nHere is one in Appalachia, VA: a project that would be implemented by  the Virginia Department of Energy, which is part of the Virginia State  government. We currently have a Republican Governor. This is an  allocation of grant funds to the Youngkin administration's Virginia  Department of Energy so they can do carbon capture and storage.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…bomb changed his life forever. It took us  3 years as a country to recognize his sacrifice.\n\nSince his return, Mr. Fisher has continued to give back to our  community. He currently serves as a mentor at the veterans court system  in Redford Township, helping fellow veterans navigate their own paths  and helping them heal.\n\nHe is a devoted husband to…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693028/surveillance-pricing-in-grocery-stores"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…treatments has put vulnerable patients' health at risk,  leading to serious adverse events, including blindness, bloodstream  infections, paralysis, and tumor growth.\n\nThere are currently few meaningful repercussions in the human cell  and tissue products industry. This bill would change that by providing  the Food and Drug Administration with additional enforcement…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692766/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…alone. Existing nuclear arms  control treaties are either no longer adhered to by Russia or the  United States or they are close to expiring, and there are no  negotiations currently underway or even envisioned on a new generation  of international limits on nuclear weapons.\n\nMy colleague from Massachusetts Senator Markey and several others  here have…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…program and  provide Congress with their results. Tailored to the 504/CDC program's  unique features, the report will provide Congress with many of the same  data points it currently provides on the 7(a) program, but the bill  also requires several new data points to improve our stewardship of the  program.\n\nWhile loan defaults aren't currently a concern…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699187/504-program-risk-oversight-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Academies  District of Columbia Equality Act, which would give the District of  Columbia the same number of appointments and nominations to the U.S.  service academies as states. Currently, each member of the House and  each senator is allocated five appointments to each service academy-- the U.S. Military Academy, the U.S. Naval Academy and the U.S. Air  Force…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696573/introduction-of-the-service-academies-district-of-columbia-equality-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…courage, and distinction deserve our Nation's  enduring gratitude. That  is why I have always been committed to supporting all those who have  fought for our Nation's freedom.\n\nCurrently, many disabled veterans are unable to access housing  programs for veterans because of how income is defined. The more severe  a disability is, the more disability benefits…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690059/by-mr-padilla-for-himsmcelf-mr-cormick-mr-gallego-mrsthank-senators-gallego-cormick-and-britt-for-introducing-this"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…the next 20 years.\n\nAlthough his funding is still delayed, Dr. Patapoutian chose to stay  here because of the world-class research ecosystem in the United States  that is currently being eroded and under attack.\n\nThese stories show the risks we take when we cut funding that  supports critical scientific advancement. China is far outpacing us in  the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695749/funding-cuts-to-science"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…education. They are a Minnesota staple with  other locations in Bloomington, Eagan, Brooklyn Park, Mankato, St.  Cloud, and Moorhead.\n\nRasmussen University serves more than 3,000 currently enrolled  Minnesotans and has proudly graduated over 28,000 students from across  the state.\n\nI congratulate Rasmussen University and I look forward to their  continued success.", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694738/recognizing-rasmussen-university-for-their-125th-anniversary"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…minutes amid heavy rainfall,  sweeping away homes, debris, and people. The flooding claimed the lives  of three people already, including two children. Rescue missions are  currently underway. The same area was also ravaged by a wildfire just  last year. Our first responders are working around the clock to protect  their neighbors and ensure help arrives…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693299/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…maintain a strategic energy advantage over our  adversaries.\n\nWe can be sure of one thing: The people who benefit from America not  harnessing our abundant natural resources are currently sitting in  Beijing, China, where they are building new coal-fired power plants at  the rate of one per week. In this global energy race, we cannot afford  to lose.\n\nUnleashing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…their  affiliates, or do we want to make a decisive stand to stop some of the  most advanced technologies from being used against us in every facet of  our lives?\n\nLoopholes currently available in U.S. export control allow the CCP  and others to gain a competitive advantage over American companies,  especially when it comes to cloud services for technologies…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698859/remote-access-security-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…memorial in their hometown.\n\nMr. Speaker, 3 years ago, Dominique raised over $77,000 to construct  a memorial for veterans. Since then, he has enlisted in the U.S. Army  and is currently completing his basic training.\n\nIn less than a year, his younger brother, Ahren, who also intends to  join the military after high school, raised $40,000 to expand on the…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691916/congratulating-nathan-lund-on-receiving-minnesotas-agriculture-in-the-classroom-2025-outstanding-teacher-of-the-year-award"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "…lower  energy costs by speeding up energy projects through much-needed reforms  to the permitting of interstate natural gas pipelines.\n\nThe development of interstate pipelines currently faces significant  regulatory and statutory hurdles. In fact, in 2024, we produced less  than half the pipeline miles we built just 5 years ago.\n\nOur regulatory and statutory…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698064/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Soldiers, his fellow veterans, and his country.\n\nIn addition to his distinguished military career, he earned a  Bachelor's in Business Administration in Program Management and is  currently pursuing a Master of Business Administration. He currently  serves as Adjutant for the Disabled American Veterans Chapter No. 4, as  well as the Adjutant for the American…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696275/recognizing-sergeant-first-class-alyn-michael-macleod-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…doing it at the medium-sized  producers.\n\nThe Yokohama plant that employs a lot of people in my district, in my  hometown of Salem, Virginia, could be affected long term, but currently  it affects Danville. Now, that is about 16 miles from the edge of my  district. In my area, because it is a rural area, lots of people drive  more than 16 or 17 or 18 miles,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Program  Director of Tactical Intelligence Systems for Raytheon. In this role,  Mark oversaw hundreds of millions of dollars in annual sales and  government contracting. He currently works as a Senior Advisor for BCE  Consulting, in which he focuses on enhancing our operational  capabilities to defend against cyber and unmanned threats. In addition  to…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696968/recognizing-congressional-patriot-award-recipient-mark-kipphut"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…success.\n\nHDTs are necessary for the construction and the maintenance of supply  routes, airfields, helipads, and logistical facilities in both combat  and noncombat zones.\n\nCurrently, our military is forced to rely on an outdated and an  unreliable fleet of trucks. Upgrading these vehicles will provide our  servicemembers with up-to-date safety features…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693691/department-of-defense-appropriations-act-2026"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…that are in tough communities, to better fund special  education needs, and to make sure that we are still fulfilling all of  the FAFSA and student loan requirements that we currently do.\n\nMr. Speaker, let's give this an option. If we are having such bad  outcomes holistically, why not take a look and try to do something  differently. We can't just keep…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…``post-traumatic stress  disorder'' into ``post-traumatic growth.'' Take the experience, work  through it in such a way that you grow from it. Think about all the men  and women who currently serve, only about 10 percent have been  diagnosed with PTSD. That is of all who served.\n\nFor those who served in combat zones, the rate of PTSD can reach up  to 20 percent.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692714/recognizing-national-post-traumatic-growth-day"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…There is a big yellow bar over here with  flames on top. It shows almost a trillion dollars of additional deficit  that the Senate bill would add if the policies they are currently  debating in the Senate are adhered to. That means they got rid of a lot  of our savings, and they made certain tax cuts more permanent. They  extended them. I support making…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…necessary aggregates it needs to produce concrete in about the next 2  years.\n\nThis bill will keep this important business in operation and, with  it, the 17 hardworking people it currently employs.\n\nWabeno is a small town with a population of just over 1,100 people.  Mr. Speaker, 17 jobs may not seem like a big deal to people from the  big cities, but I can…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694030/wabeno-economic-development-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…rules, new waiver programs, new provider  networks, and long wait lists.\n\nThe Care for Military Kids Act would ensure that any dependent of an  Active-Duty servicemember - currently receiving long-term care services  through a State administered Medicaid plan, will remain eligible should  their family be stationed outside the State, ensuring our  servicemembers…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699300/advocating-for-military-families"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…GRIFFITH. Mr. Speaker, parliamentary inquiry.\n\nMr. GRIFFITH. When debating this resolution, H.J. Res. 35, is it  appropriate to discuss superfluous matters to the matter at hand  currently on the floor?\n\nMr. GRIFFITH. Thank you, Mr. Speaker.\n\nMr. GRIFFITH. Mr. Speaker, let me be clear: I meant no offense and no  criticism. As the gentleman from the other side…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Director, who shall--\n\n``(A) report directly to the Chairman; and\n\n``(B) be appointed by the Chairman, in consultation with       the Commission, from among individuals--\n\n``(i) currently employed by the Commission or from outside       of the Commission; and\n\n``(ii) having experience in advocating for the interests of       senior investors.\n\n``(3) Staffing.--The…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693935/national-senior-investor-initiative-act-of-2025"}]