[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…uniquely vulnerable community.\n\nBeyond just addressing the use of emerging AI technology at the VA,  H.R. 3854, as amended, also seeks to bolster the VA's data collection.  Currently, the VA does not collect cause-of-death data on veterans.  This is problematic, and it creates a challenge when assessing trends  in veteran deaths.\n\nThe collection of cause-of-death…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695486/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…initiative in 2007 as a pilot program to assist the New York City metro  area in detecting and preventing nuclear or radiological threats. The  program has since expanded and currently provides 14 municipal  governments nationwide, including the city of New Orleans, with  detection equipment, training, exercise support, operational and  technological expertise,…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688698/securing-the-cities-improvement-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…member of the Appropriations subcommittee  overseeing funding for this space.\n\nI rise today, with my colleagues, out of grave concern for the future  of our democracy.\n\nI currently serve as the ranking member of the Senate Rules and  Administration Committee. I also, as many of you know, am the former  secretary of state for the State of California.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…DOE and SBA Research Act.  This legislation would allow SBA and the Department of Energy to enter  into an MOU to formalize the research and development activities that  are currently underway.\n\nThe Department of Energy has 17 national labs that play a crucial  role in fostering innovation and driving small business growth. The  labs form partnerships…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687906/doe-and-sba-research-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…provides job training, education, employment accommodations, and the  resources to build a meaningful career. However, too often, that  support comes too late. In Portland, it currently takes more than 65  days for a veteran to be connected with a vocational rehabilitation  counselor. That is at least 2 months of missed income, missed classes,  and missed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695413/focused-assistance-and-skills-training-for-veterans-employment-and-transition-success-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…medical/dental insurance policy which I purchased through       Access Health CT. Due to our household income, we qualify for       tax credits. Even with these tax credits, I am currently       paying close to $700/month for our insurance. I know that I       cannot afford a monthly premium upwards of $1000!\n\nIt is a well-known fact that health insurance premiums…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696732/continuing-appropriations-and-extensions-act-2026"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…my  colleague, Congressman Pat Ryan, opposing plans by ICE to establish a  facility in New York's Hudson Valley in the town of Chester, Orange  County.\n\nThe proposed site, currently an empty warehouse formerly used by Pep  Boys, is opposed by Republicans and Democrats of that area, including  Republican County Executive Steve Neuhaus, a U.S. Naval Reserve…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699213/in-opposition-to-ice-facility-in-hudson-valley"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…will become even more pronounced. Already,       nearly half of US nursing homes report they've had to limit       admissions because of staffing shortages and only 19%       currently meet the minimum staffing levels that the Centers       for Medicare & Medicaid Services have mandated these       facilities achieve by 2029. I myself have encountered…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…of D.C. Under the National Capital  Revitalization and Self-Government Improvement Act of 1997, individuals  serving sentences for D.C. Code felonies are in BOP custody.\n\nCurrently, more than 2,000 D.C. residents are serving sentences for  D.C. Code felonies, and they are in BOP facilities across the United  States. While Congress will not provide funding…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690140/introduction-of-the-improving-reentry-for-district-of-columbia-residents-in-the-bureau-of-prisons-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…buildings outside the central area, but NCPC has only advisory  authority in those areas. The central area is defined by the concurrent  action of NCPC and the D.C. Council and currently consists of the  Downtown and Shaw Urban Renewal Areas.\n\nUnder presidential executive orders (EOs) and federal law, CFA has  review authority for D.C.-owned parks and buildings,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696109/introduction-of-a-bill-to-provide-for-interim-appropriations-for-the-national-capital-planning-commission-and-the-commission-of-fine-arts-with-respect-to-any-fiscal-year-for-which-appropriations-are-not-otherwise-provided-for-the-commissions"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…hasn't been  done since Richard Nixon was President of the United States.\n\nWe also want to make sure that no one receives a below-poverty-level  check from Social Security. Currently, more than 5 million of our  fellow Americans--most, Madam Speaker, you will find interesting, are  women--primarily because they were the caregivers and providers at home…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694818/saving-social-security"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…interest of private profit.\n\nLet's be real, we have all seen it here, even over the last several  weeks, as Members of this body have traded stocks while working on  policies currently before Congress, possible insider trading in the  midst of the President's trade wars. A President and a Speaker who both  declared, it is a good time to buy while Members…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691225/stock-trading-ban-for-members-of-congress"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…us have preexisting conditions. If the Republicans get  their way and remove the subsidies, my very basic catastrophe plan- style HMO will literally increase tenfold. I am currently spending 39  percent of my income on healthcare, including the subsidized ACA  policy. Removing subsidies will ultimately lead me to financial  bankruptcy.\n\nThere are more…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697215/medical-bills-are-too-high"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…world's leading hunger monitor, published a report on  Tuesday, and I have that report here. Let me hold it up. This report,  it says:\n\nThe worst-case scenario of famine is [currently] playing       out in the Gaza strip.\n\n``The worst case.'' The World Food Programme reports that hunger in  Gaza has reached ``astonishing levels of desperation, [and] a…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694437/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…National Taxpayer Advocate, and I hope that this  bipartisan effort will extend to dealing with the threat of data  privacy that the Treasury and Internal Revenue Service currently are  experiencing.\n\nMr. DAVIS of Illinois. Mr. Speaker, H.R. 997 is a commonsense,  bipartisan piece of legislation and is the product of a recommendation  made by the Taxpayer…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689380/national-taxpayer-advocate-enhancement-act-of-2025"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "Mr. CRANE. Mr. Speaker, I rise today to speak in favor of my bill,  the Apache County and Navajo County Conveyance Act of 2025.\n\nThis legislation would transfer Federal land currently under the  purview of the U.S. Forest Service to Navajo and Apache Counties.\n\nFor more than a decade, the communities of Pinedale and Alpine have  struggled to find appropriate…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691143/apache-county-and-navajo-county-conveyance-act-of-2025"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…common negotiating  position centered on several key principles. Here are the key points:  Ukraine should not be forced to give up the sovereign territory it  deserves and it currently controls. Also, Putin should not achieve  through negotiation what he has not managed to achieve on the  battlefield, and there have been great disappointments to Putin on…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699095/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Beyond her professional career, Lisa's dedication to civic engagement  has been extraordinary. She has been a volunteer with the Bowie County  Republican Party for 35 years, currently serving as Precinct Chair and  Volunteer Coordinator, inspiring and organizing others to participate  in the democratic process. Her community outreach extends beyond the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696870/recognizing-congressional-patriot-award-recipient-lisa-singleton"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…headlines, we recognize there is a lot to talk about with healthcare,  particularly this week. I want to touch on a few aspects.\n\nTo be abundantly clear, Republicans are currently dealing with the  aftermath of what has been a decade or so of failure. The Democrats put  in place an unaffordable and fraudulent healthcare system.\n\nFor years, Democrats…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "John Rose", "party": "Republican", "sentence": "…trigger leads.\n\nMr. Speaker, H.R. 2808, the Homebuyers Privacy Protection Act will  literally impact each and every consumer that applies for a mortgage in  this country.\n\nCurrently, credit bureaus are notified when a consumer applies for  mortgage financing. That information, which is referred to as a trigger  lead, is then often sold by the credit…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692803/homebuyers-privacy-protection-act"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…highly technical environment and being trained to follow the rules  and being able to absorb all of the knowledge necessary to be an  exceptional pilot.\n\nMr. Speaker, there currently are impediments for VR&E benefits being  used in vocational flight training. These benefits are intended, as  currently written, to be used in programs that are degree granting.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699488/veterans-readiness-and-employment-improvement-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…achieving our goals of energy independence, creating jobs,       bolstering defense, bringing manufacturing home, and reducing       our reliance on foreign sources.\n\nCurrently, critical minerals come from countries with the       loosest, most egregious environmental and labor standards in       the world--countries like Argentina, Chile, China,…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699454/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Jeanne White has made through her work with K-9  Partners for Patriots. After retiring from a successful career, Jeanne  completed a two-year apprentice trainer program. She currently serves  as Director of K9 Acquisition and a Certified Dog Trainer with more  than 20 years' experience at K-9 Partners for Patriots. Jeanne's  dedication to matching Veterans…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690843/recognizing-jeanne-white"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…Contracts With Foreign Adversaries Act, which requires a college or  university to be transparent about the reason they might want to  contract with one of the four countries currently designated by our  government as a ``country of concern.''\n\nIt is true that there could be an academic purpose for a partnership  with a country like China, North Korea,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…by 2032.\n\nAmerica's education sector must ensure that we meet this growing  demand head-on. Many STEM jobs require data comprehension to inform  decisionmaking, but we are currently not providing a strong foundation  for that skill in our schools.\n\nH.R. 730 would modernize our mathematics curriculum by providing  competitive, merit-based grants to support…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…Lab, almost 2,600  gigawatts of generation projects are sitting in interconnection queues  across the country. That is more than double the amount of the existing  generation currently on the grid. The median wait time for projects has  now stretched to 5 years.\n\nWith demand growth accelerating and retirements mounting in Ohio and  across the country, we…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695755/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…County, Florida, for their  outstanding achievement in earning an ``A'' rating from the Florida  Department of Education for the 2024-2025 school year.\n\nLake County Schools currently operates 49 schools, serving students  from pre-kindergarten through grade 12, with approximately 48,285  students and 2,696 teachers. This marks the first time since 2008…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694185/recognizing-lake-county-schools-on-earning-an-a-rating-from-the-florida-department-of-education"}, {"senator": "Troy Nehls", "party": "Republican", "sentence": "…opinion, these heroes are our Nation's most sacred treasure, and  it is our obligation, as Congress, to do everything in our capacity to  support them and their families.\n\nCurrently, each Medal of Honor recipient receives a special pension  that totals roughly $1,500 per month, or $18,000 annually. The last  update to the special pension for Medal of…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688215/medal-of-honor-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…stubborn things. There are some things that we all can  agree on. The Boundary Waters Canoe Area is a wonderful place, but the  Boundary Waters Canoe Area has been protected, is currently protected,  and will be protected even after this CRA is passed.\n\nThe Congresses that came long before us made sure this was the case,  long before the Obama administration…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…going to have to bail out the car companies? Are we going to  bail out everybody that is going to be hurt by these tariffs?\n\nIt is not a good idea.\n\nThe administration is currently considering a bailout for farmers.  The idea that the American taxpayer will have to bail out an industry  to dull the pain of tariffs is not a novel one. We have seen this…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}]