[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…employees who made aviation history,  in Minnesota, to the tens of thousands of Delta's current employees-- many of whom belong to a union--pilots, flight attendants, customer  service agents, and the skilled technicians, engineers, and mechanics  who ensure Delta flights are safe and enjoyable--this centennial  reflects a shared story of vision, resilience,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695050/recognizing-delta-air-lines-100th-anniversary"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…been placing more barriers for veterans to  receive care in the VA and through community care are simply untrue.  Since 2019, the VA has made enormous improvements in customer service  and has become more welcoming to veterans through historic outreach.\n\nIf we listen to veterans, as I do every weekend because I go home  every weekend, what I hear is…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689835/9999"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…cannot predict AI's trajectory, so new risk could come up as it evolves  and adds capabilities.\n\nWe have all seen reports of GenAI gone wrong, with episodes ranging  from customer service chatbots at car dealerships offering to sell  pickup trucks for $1 to general purpose chatbots advising small  businesses to break the law.\n\nIn other words, a small business…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699205/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…to  create efficiencies, to do things that can make programs run better.  Heck, when I was mayor, we were able to lower expenditures, create more  efficiency, have more customer service. There are ways to do that.\n\nBut no, this is folks coming with an ax to cut your healthcare or  your neighbor's healthcare or your elder's healthcare.\n\nIt is not a government…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…that are under consideration today, this bill does not  fix the crisis that this Trump administration has inflicted on Social  Security when it comes to data privacy and customer service. Thumb  drives went into our central data computers by DOGE employees, people  who had not been confirmed by any Senate or anything else, and our  Social Security information…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697187/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…for other services       such as getting their Social Security card replaced. There       [are] some days where people are waiting for 8 hours just to       talk to a customer service representative or they don't even       get the call back and have to call again the next day to have       an issue resolved--that's if they have the time [to call] the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690633/nomination-of-frank-bisignano"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…salary.\n\nMr. Speaker, having been a contract employee and having done all of  that before I came here, I am so grateful every time I come across an  individual in the customer service industry who has really done a good  job. Paying them tips is the least that we can do to make sure that  they are honored for their service.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698963/tipped-employee-protection-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…highest level of greed, where billionaires rob from hard-working  Americans to augment their wealth.\n\nBy slashing staff, closing 6 out of 10 regional offices, cutting  customer service operations, restricting phone service assistance, and  spreading falsehoods about the Social Security Administration (SSA),  Trump and Musk jeopardize Americans' earned…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690131/opposition-to-president-trumps-and-elon-musks-theft-of-social-security-to-pay-for-handouts-to-billionaires"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…guidance, and other materials-- including benefit statements--both printed and online versions.\n\nAccording to the Center on Budget and Policy Priorities, Social  Security's customer service budget has dropped by 23 percent since  fiscal year 2010 after adjusting for inflation. Over the same period,  SSA is serving 17 million more Social Security beneficiaries,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697776/claiming-age-clarity-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…artificial intelligence. I commend Mr. Alford and Ms. Scholten  for working together on this bipartisan legislation.\n\nAI has the potential to boost productivity, enhance customer service,  and save costs. While it is becoming increasingly common for small  businesses to use AI to streamline their operations, many still do not  know how to access it responsibly.…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699178/ai-for-main-street-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…board members and the CEO. They all had to go.\n\nYet, this is what happens when you allow big, big banks to keep  merging. They are too big to manage, and they give up on customer  service that branch banking is all about. I bring that to the Speaker's  attention so that I could make my colleagues on the other side of the  aisle remember what happened with…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…Public Aid, which later  became the Illinois Department of Human Services. Mrs. Pough worked for  the Department for nearly 47 years and was known for providing stellar  customer service and professional assistance to the clients she served.  In fact, Mrs. Pough's dedication to her profession led her to learn to  speak Spanish in order to better serve…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699343/recognizing-mrs-essie-pough"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Republican plans to  dismantle Social Security offices across the country. They are deeply  concerned about reports that this administration is going to end phone  line customer service for senior citizens who are relying on Social  Security. They are pretty concerned about a Secretary of Defense who  apparently is sending out war plans on unencrypted…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, 74 million Americans depend on Social  Security, but because of the Trump administration's actions, customer  service has completely collapsed. The agency faces 6 million backlogged  cases, 12 million delayed field-office transactions, and some of the  worst wait times in history.\n\nWhy…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698683/social-security-customer-service"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…savings and investment plan for  federal employees.\n\nIn 2022, the FRTIB launched a new recordkeeping system with the goal  of modernizing TSP's recordkeeping, improving customer service and  bolstering cybersecurity. There were widespread problems with the new  system, including account access, account balances, missing or  incomplete information in accounts…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691138/introduction-of-the-federal-retirement-thrift-investment-board-inspector-general-act-of-2025"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…Democratic colleagues' concern that this  legislation and allowing for healthy mergers to happen in the banking  sector would somehow diminish financial services or that customer  service would somehow be lost, it is actually the opposite.\n\nWhen you have healthy mergers among, especially, community banks or a  small regional bank acquiring a community…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…beauticians deliver exceptional services,  ensuring every client leaves feeling refreshed and renewed.\n\nBeyond exceptional expertise, Jenya's salon offers impeccable  customer service and attention to detail. The staff is friendly,  professional, and always willing to go the extra mile to meet their  clients' needs. Whether you're looking for a quick…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691903/recognizing-beauty-moods-one-year-anniversary"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…defrauded by a member of an online dating       service, which may be provided through a link to another web       page or disclosure.\n\n(E) Contact information to reach the customer service       department of the online dating service provider.\n\n(3) Manner and timing.--\n\n(A) Manner.--A fraud ban notification under paragraph (1)       shall be--\n\n(i) clear…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692730/romance-scam-prevention-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…and addressing unused Federal  space and buildings. Crucially, it also protects Americans from a  supercharged IRS by cutting enforcement and redirecting resources to  customer service. This is especially important as we approach tax- filing season and implement the working families tax cut, allowing  families to keep more of what they earn.\n\nJust as…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…undermines her ability to  provide insight, ensure fair treatment of taxpayers, and responsibly  work with the IRS caseworkers.\n\nAmerican taxpayers expect and deserve the best customer service and  case outcomes when filing their Federal taxes.\n\nHowever, this outdated restriction on the National Taxpayer Advocate  prevents her from hiring the team she needs…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689379/national-taxpayer-advocate-enhancement-act-of-2025"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…unwavering dedication  helped our office serve the people of Indiana's Second District at the  highest level. Hoosiers who visited the Capitol often commented on her  customer-service-driven approach.\n\nOver the past 2\\1/2\\ years, I have come to rely on Mariah not only as  a trusted colleague but as a friend. Her work ethic, professionalism,  and commitment…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693053/commending-michael-kraan"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…has been  committed to working closely with their clients to help them make  important and informed decisions relating to their protection and  future. They prioritize customer service and are committed to treating  their customers like family.\n\nHebard Insurance continues to be a staple in Placer County and  surrounding communities. In addition to providing…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…that artificial       intelligence can reliably and effectively perform, including       whether artificial intelligence can improve operations,       productivity, or customer service; and\n\n``(10) how to determine whether an artificial intelligence       tool adequately fills a need and is worth adopting.\n\n``(c) Accuracy and Maintenance.--\n\n``(1) In…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699206/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…locations  to expand its services to include diabetic and asthma care, blood  pressure monitoring, compounding, and a gift shop. The pharmacy is  known for its commitment to customer service and community focus.\n\nOverall, Mr. Chapman is remembered for his generous spirit, wry sense  of humor, keen insight, and love of all things mechanical. In fact, one  of…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693467/recognizing-ben-chapman"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Department, be it available electronically       or in any other format.\n\n``(6) Assessing and advising the Secretary on the status       and opportunities for improvement of the customer service       efforts of the Department.\n\n``(d) Reports.--(1) Each year, the Chief Veterans       Experience Officer shall submit to the Secretary a summary of       the data…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…``section 4305'' and       inserting ``section 4306''.\n\nMr. Speaker, the American public relies on Federal supervisors to  lead a workforce that provides high-quality customer service and  faithful execution of the law.\n\nThese expectations and standards require a level of professionalism  that can be improved by strengthening relevant education offerings…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698216/federal-supervisor-education-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…never lost that small business  mindset. That mentality, grounded in what we call the WIT principle,  Whatever It Takes, is built on hard work, results, teamwork, and  customer service. It continues to guide my work here in Congress.\n\nMr. Speaker, that work, on behalf of small businesses, starts with  regulatory relief. Small businesses don't have compliance…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690760/national-small-business-week"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…pay for groceries; they  need to pay for prescriptions. Democrats don't seem to worry about  that. Oh, they say they can wait.\n\nBecause a Democrat shutdown means that customer service applications  to the Social Security Administration--well, they will be delayed.\n\nNow, many military families also live paycheck to paycheck. They are  going to face a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695529/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…years  to the United States Postal Service, beginning her career as a mail  carrier in Flower Mound. Demonstrating a commitment to professional  growth, she completed the Customer Service Associate Supervisor Program  in 2019 and went on to serve in supervisory and leadership roles across  multiple Texas stations, including as OIC Postmaster.\n\nIn 2022,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695488/recognizing-the-contributions-of-trellis-maddalena"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…and helps taxpayers not only understand the mistake but also  allows a challenge if they see fit.\n\nFiling taxes is already burdensome and time consuming. We can improve  customer service by promoting open and transparent communication  between the IRS and the taxpayer when a tax error is identified.\n\nMr. Speaker, I will continue to work to simplify our…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689360/internal-revenue-service-math-and-taxpayer-help-act"}]