[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…funds, according to Georgetown Prof. Arthur       Wilmarth, which renders ``priority'' little relief in       actuality. Related to this, the bill includes inadequate       custodial rules. The GENIUS Act declares that stablecoins are       property of the investor and must be segregated from sponsor       funds. But this doesn't direct the bankruptcy…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…was also arrested and  accused in connection with the same alleged incident.\n\nOnly a small percentage of Palestinian children in the military  courts are released on bail. Custodial pre-trial--and often pre- charge--detention is the norm. Almost all prosecutions of children in  military courts are resolved with plea agreements, which are the  fastest…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697313/palestine"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…vital contributions  of custodians in creating safe and healthy spaces for students to  learn. They wanted to show appreciation for the hard work and steadfast  commitment of custodial staff to their school communities.\n\nBy 1998, custodian appreciation efforts had expanded beyond  expressions of gratitude to raise awareness about the critical role  custodians…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697118/recognizing-national-custodian-appreciation-day"}, {"senator": "French Hill", "party": "Republican", "sentence": "…(a) In General.--Section 29 of the Federal Deposit       Insurance Act (12 U.S.C. 1831f) is amended by adding at the       end the following:\n\n``(j) Limited Exception for Custodial Deposits.--\n\n``(1) In general.--Custodial deposits of an eligible       institution shall not be considered to be funds obtained,       directly or indirectly, by or through…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…and risks of DeFi.\n\nThrough the CLARITY Act, Congress is making an unambiguous statement  that DeFi is different, and it should be treated differently from the  centralized custodial intermediaries. Protecting this emerging  technology is an essential purpose of the CLARITY Act.\n\nMr. THOMPSON of Pennsylvania. Mr. Speaker, I thank the gentleman who  just…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693788/digital-asset-market-clarity-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…California than anywhere.\n\nSecond, they adopted sanctuary policies that prevent ICE from being  able to conduct immigration operations in the safest and most orderly  fashion in a custodial setting.\n\nThree, they massively have funded radical groups that are now going  out and providing coordinates to people throughout L.A. for where ICE  operations are taking…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692164/protests-in-los-angeles-california"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…Federal Bureau of       Investigation and United States Attorneys' Offices, that       relate to:\n\n(1) Jeffrey Epstein including all investigations,       prosecutions, or custodial matters.\n\n(2) Ghislaine Maxwell.\n\n(3) Flight logs or travel records, including but not       limited to manifests, itineraries, pilot records, and customs       or immigration…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696818/epstein-files-transparency-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…California have chosen to enact sanctuary  policies that explicitly forbid ICE from taking custody of these  dangerous individuals in the safest and least disruptive setting, in a  custodial setting, that is, in jails. That is the explicit purpose of  our sanctuary laws.\n\nDespite these facts, as these operations were being carried out in a  standard and targeted…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "John Thune", "party": "Republican", "sentence": "…getting us to where we are today; to the Cloakroom  staff; to every Senate staffer on both sides of the aisle, who has  spent 41 days coming into work without pay; to the custodial staff,  who, again without pay, have kept this building and the Senate office  buildings livable; to all institutional staff, without whom this place  would not run; to the…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696667/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…dangerous,  wanted individuals as some sort of act of defiance, thereby forcing  immigration authorities to go into communities rather than have an  orderly transfer in a custodial setting.\n\nI want to read a quote on this topic. It reads as follows: ``I do not  consider it in the service of public safety to release an individual  into the community…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699574/consolidated-appropriations-act-2026"}]