[{"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…stick, and made it even uglier with 17 million Americans going without  health insurance; a 17 percent increase in electric rates; and the  largest nutritional assistance cut in American history, leaving  Americans hungry.\n\nThe independent Committee for a Responsible Federal Budget condemns  this as exploding our debt, spiking it to new record highs, and…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693175/one-big-beautiful-bill-act"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…amount, and what the Republicans  decided to do to generate savings, to find savings, is to cut  nutritional assistance. Why? Because they needed to pay for the biggest  tax cut in American history for the wealthiest people and corporations  that has ever existed. It would be one thing if people were getting 75  bucks a day for food. It would be one thing…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…of people are,  and for good reason. Make no mistake, if you rip healthcare away from  millions of Americans, people will die.\n\nRight now, this is the largest Medicaid cut in American history. In  fact, a headline today summarizing the Congressional Budget Office  score on this bill said: ``Wealthy gain, low-income people lose from  GOP megabill.''…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691580/big-bad-bill-is-cruel"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…are had about where to spend and where to cut. This House majority has  been given marching orders, and the marching orders are to cut as much  as possible and to cut until the American people bleed. The only folks  who will be able to afford Band-Aids to prevent them from bleeding to  death will be the richest of the rich.\n\nEveryone else, you will…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…building an affordable economy that  lowers costs and makes life better for the American people and the  Republican budget proposal that would enact the largest Medicaid cut in  American history in order to pass massive tax breaks for Republicans'  billionaire donors like Elon Musk.\n\nMr. Speaker, I am ready to yield. I am ready to debate one-on-one on…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689902/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…making matters worse by pushing legislation that will  only drive up monthly power bills even further. It is quite the  departure from President Trump's campaign promise to cut American power  bills in half. He said that during the course of the campaign that in  the first year he would cut power bills in half. Instead, they keep  climbing.\n\nRight now,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…paycheck. Mr. Speaker, 60 percent of our residents  in our country live paycheck to paycheck.\n\nJust so we are clear, the $880 billion cut to Medicaid is the largest  Medicaid cut in American history. There are 72 million people who rely  on Medicaid for healthcare in our Nation, including 40 percent of  people in Speaker Johnson's own district.\n\nMr. Speaker,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689783/defending-social-services-and-programs"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…because of  that.\n\nNow, those 300,000 Virginians face the prospect of losing their  health insurance because of actions Congress took in July with the  largest Medicaid cut in American history. In our rural areas, six  hospitals in Virginia are at risk of closing because of those Medicaid  cuts, one in my district that is a healthcare safety net. The…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…crisis, but instead, they are  going to make things worse.\n\nRepublicans are about to hand billionaires like Elon Musk $5.3  trillion in tax cuts, the biggest billionaire tax cut in American  history. To pay for it, Republicans are cutting health insurance for  families; ripping away food from kids, seniors, and veterans; and  cutting public education, all…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689901/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…In some ways, I guess the American people can be thankful. This week,  what Republicans were going to try to do was visit upon the American  people the largest Medicaid cut in American history. Mr. Speaker,  because Republicans were on the run, they were forced to take that  hearing down. That battle is not over.\n\nIn the absence of their ability to actually…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690933/gulf-of-america-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…STANSBURY. Mr. Speaker, a few days ago Donald Trump unveiled his  so-called skinny budget for fiscal year 2026. This budget is only  skinny on the cuts that it would cut for the American people, $163  billion for vital programs that serve our communities, Tribal programs,  housing, healthcare, opioid reduction, and addiction recovery programs.\n\nThis…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690663/skinny-budget-for-2026"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…folks who are  hardest hit with high food prices, rent prices, and gas prices and are  now, finally, getting relief, let alone families who are enjoying the  largest tax cut in American history with this package, it is smart  policy to reward those families that make America work every single day  and to recognize that sometimes the government has left…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692334/election-promises-made-promises-kept"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…provide some information relative to my colleague's previous comments.\n\nRepublicans just passed working families tax cuts, which gave  American families the largest tax cut in American history. Under the  bill, the typical family will get up to $10,900 in additional take-home  pay. Households earning less than $100,000 will get a 12 percent tax  cut…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699316/pregnant-students-rights-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…eliminating waste, fraud, and abuse.\n\nMr. Speaker, I can't deny that a crowd favorite is calling it the  working families tax cut bill because it delivers the largest tax cut  in American history. It puts money back in the pockets of people who  need it most: people who rely on tips and overtime and people living on  Social Security. It lifts burdens off…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695114/launching-golden-age-of-america"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Beautiful Bill's Economic Relief\n\nMr. MANN. Mr. Speaker, I am proud of the work our Republican  majorities are putting in to deliver American families the largest tax  cut in American history. This process hasn't been easy by any means,  but it is worth every single debate we are having to get it over the  finish line. If we fail to get this bill passed…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…the One Big Beautiful Bill Act is the  best chance in a generation to pass critical reforms that the American  people voted for:\n\nIt delivers tax relief, the largest tax cut in American history,  meaning an extra $5,000 in Americans' pockets with double-digit percent  decrease to their tax bills.\n\nIt makes the Trump tax cuts permanent, preventing the…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…the State of Washington.\n\nNot long ago, right here in this Chamber, I joined my House  Republican colleagues to pass the Working Families Tax Cut Act, the  largest tax cut in American history.\n\nWhen we voted for this, we also voted for a new rural healthcare  fund, and $181 million of this rural healthcare fund will go to  transforming Washington State.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698645/tax-relief-for-working-families"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…provisions of the One Big  Beautiful Bill Act.\n\nSimply put, the District of Columbia Council doesn't want its  citizens to benefit from the largest working families tax cut in  American history.\n\nSpecifically, the District of Columbia Council wants to deny its  citizens the ability to enjoy the increased standard deduction. The  District of Columbia Council…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…secure our border; and that President is  Donald Trump.\n\nAt the same time, President Trump rebuilt an economy that works for  all Americans. Congress passed the largest tax cut in American history,  delivering relief directly to families and workers. No taxes on tips,  overtime, and Social Security, but in my district, I will share two  perfect examples…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…delivering on that mandate, and Congress is helping him to  advance this agenda.\n\nJust a few days ago here in this Chamber, House Republicans voted to  deliver the largest tax cut in American history. We made long-overdue  investments in our Nation's border security by funding the completion  of the border wall, investing in modern technologies to assist in…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692073/condemning-anti-semitism"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…First. That means a Federal Government that gets  out of the way and allows hardworking people to succeed.\n\nRepublicans put America first when we passed the largest tax cut in  American history. We delivered no tax on tips, no tax on overtime, and  tax relief for seniors by lowering taxes on Social Security benefits,  because the key to affordability…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699063/how-republicans-have-delivered-for-americans"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…cutting less than 1 percent from that  whole entire program.\n\nWe are not saying that you have to cut AIDS. Perhaps let me tell you  what other programs that we could cut for the American people. You are  saying that people are going to die because you want to cut the  funding. We are not saying that.\n\nHow about we do this? How about we cut $3 million…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…Chairman Smith for yielding.\n\nMr. Speaker, President Trump's One Big Beautiful Bill Act will  dramatically grow our economy and reduce our deficit. It is the largest  tax cut in American history for families, farmers, workers, and small  businesses.\n\nThis bill will help our Main Street businesses grow, invest, and  hire, and it will increase the exemption…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693183/one-big-beautiful-bill-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Madam Speaker, with the One Big Beautiful Bill  Act, we delivered on President Trump's domestic agenda and provided the  largest tax cut in American history. That is because, as Republicans,  we believe this money belongs to hardworking Americans, not to  Washington bureaucrats.\n\nI couldn't be prouder of this Conference…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694797/promises-made-promises-kept"}, {"senator": "Jim Banks", "party": "Republican", "sentence": "…Trump championed it in his State of the Union  speech, Republicans stood in agreement and Democrats sat on their  hands.\n\nThe President talked about passing the largest tax cut in American  history for working class families, like yours and mine, a tax cut that  is significant.\n\nIn Indiana right now, by the way, early tax returns for Hoosiers, a  10.9-percent…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700296/state-of-the-union-address"}]