[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "So the people that make a bundle out of knocking down clean energy  are the fossil fuel people who cut that deal for hundreds of millions  of dollars to Trump's campaign in return for him clobbering their  rivals by making it difficult to develop clean energy projects.", "title": "Terminating the National Emergency Declared with Respect to Energy", "date": "2025-10-08"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "That is why we need to pass the Count the Crimes to Cut Act of 2025,  which would mandate the creation of a comprehensive inventory, as we  have expressed, of all Federal criminal, statutory, and regulatory  offenses.", "title": "Count the Crimes to Cut Act", "date": "2025-12-01"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "What we do know is that the White House  has been trying to absorb this historically independent agency and has  given DOGE the green light to cut USPS staff and gut services.", "title": "Closure of Quartz Hill Post Office", "date": "2025-06-26"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Because  Donald Trump and his obeisant Republicans cut out the cheapest way to  get new power and new electrons on the grid--solar energy.", "title": "Nominations", "date": "2025-12-17"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "It will also have the  effect of stifling innovation, weakening Americans' ability to lead by  staying on the cutting edge of technology.", "title": "Democratic Proposals", "date": "2025-02-26"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "Speaker, Donald Trump promised that he would cut  prices.", "title": "No Funding for Ice", "date": "2026-02-03"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "The President promised he was going to cut Americans' power bills in  half, but since he took office last year, electric bills are up by 13  percent across the country, and they are much higher in some places.", "title": "Saving Homeowners From Overregulation with Exceptional Rinsing Act", "date": "2026-01-07"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "We just passed a tax cut for the very wealthiest Americans  this last summer, and people don't understand why.", "title": "Restoring Election Integrity", "date": "2026-01-21"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "It ended up cutting $1 trillion from  the Medicaid Program.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "He is working for us if we make over $4 million and are about  to pocket a new tax cut of $300,000.", "title": "Working People Pay the Price", "date": "2025-11-17"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "He was  giving Xi Jinping stuff that he didn't even ask for the minute he was  worried that somehow we were going to get cut off from his critical  minerals.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Environmental Protection Agency Relating to ``Air Plan Approval; South Dakota;", "date": "2026-01-07"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "World Relief said this:\n\nPresident Trump [has] said he will defend persecuted       Christians.", "title": "Rescissions Act of 2025", "date": "2025-07-15"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Chairman, I will focus on the cuts to shore protection.", "title": "Energy and Water Development and Related Agencies Appropriations Act, 2026", "date": null}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "A Republican President following a Democratic  President and, once again, a budget that would explode the deficit and  national debt, just like clockwork, with their tax cuts for  corporations and the top 1 percent.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "We must invest in, not cut,  educational research, and we need to promote, rather than politicize,  family, parental, and community engagement.", "title": "Trump Administration Dismantling Department of Education", "date": "2025-12-02"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "Speaker, I am proud of the work our Republican  majorities are putting in to deliver American families the largest tax  cut in American history.", "title": "Peace Through Strength", "date": "2025-06-25"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "I vote to  cut spending on everything--I think we spend way too much--but I am not  for cutting the salaries of people who have a contract and who are  doing their work.", "title": "Directing the Removal of United States Armed Forces From Hostilities Within or Against Venezuela That Have Not Been Authorized By Congress--", "date": "2025-11-06"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "People who earn tips or overtime, as  well as those who earn Social Security get a big tax cut.", "title": "Providing for Consideration of Senate Amendment to H.R. One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "The 2022 Integrated Activity Plan cut off access, to cut off leasing,  to cut off development in our petroleum reserve.", "title": "Terminating the National Emergency Declared to Impose Duties on Articles Imported From Canada", "date": "2025-10-29"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "That  means 7 years from now, if you are on Social Security, if we follow the  law as it is today and Congress continues to fail to act, you get a 24  percent cut.", "title": "United States' Fiscal Situation", "date": "2026-02-04"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "We passed a comprehensive economic plan called the working families  tax cut law.", "title": "Nominations", "date": "2025-12-17"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "Do you want to cut down on overregulation?", "title": "Small Business Regulatory Reduction Act of 2025", "date": "2025-12-02"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "Includes                                   to Cut Act.", "title": "Expanding Wksi Eligibility Act", "date": "2025-12-01"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "2159, the Count the  Crimes to Cut Act, led by my friend, Chip Roy from Texas,  Representative McBath, who is the ranking member on our Subcommittee of  Crime and Federal Government Surveillance, and supported by Members of  both parties who understand that freedom collapses when the law becomes  unknowable.", "title": "Count the Crimes to Cut Act", "date": "2025-12-01"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "142, legislation to reverse a District of Columbia law that bars  the citizens of our Nation's Capital from seeing the benefits of the  working families tax cuts enacted by Republicans and signed into law by  President Trump on July 4.", "title": "Disapproving the Action of the District of Columbia Council in Approving the D.C. Income and Franchise Tax Conformity and Revision Temporary Amendment Act of 2025", "date": "2026-02-04"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "The One Big Beautiful Bill Act is a historic win for our country,  unleashing American energy, promoting innovation, protecting our  Federal healthcare programs for our most vulnerable citizens, and  delivering historic tax cuts for families.", "title": "Promises Made, Promises Kept", "date": null}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "He is cut from the same cloth as terrorists all over the world and  terrorists down through history.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "Speaker, there is a lot of noise coming from the  other side claiming that House Republicans are cutting Medicaid with  our commonsense work requirements.", "title": "Medicaid Should Serve the Truly Needy", "date": "2025-06-25"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "3015 also reinforces President Trump's April 8, 2025, executive  order to reinvigorate America's clean coal industry recognizing that  coal must remain part of our future if we want to ensure future  prosperity, meet rising electricity demands, and lower costs for  families.", "title": "Providing for Consideration of H.R. DC Criminal Reforms to Immediately Make Everyone Safe Act; Providing for Consideration of H.R. District of Columbia Policing Protection Act; Providing for Consideration of H.R. Lowering Age At Which A Minor May Be Tried As Adult for Certain Criminal Offenses in District of Columbia; Providing for Consideration of H.R. District of Columbia Judicial Nominations Reform Act; Providing for Consideration of H.R. Guaranteeing Reliability Through the Interconnection of Dispatchable Power Act; Providing for Consideration of H.R. National Coal Council Reestablishment Act; Providing for Consideration of H.R. Promoting Cross-Border Energy Infrastructure Act; and for Other Purposes", "date": null}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "One of the myths that is out there, over and over I hear on this  floor every day, is that somehow this is a big tax cut for the rich.", "title": "Election Promises Made, Promises Kept", "date": "2025-06-11"}]