[{"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "That is what Donald Trump said: ``You're rich as hell.'' ``We're  going to give you tax cuts.'' This is on the backs of working Americans  because voting ``yes'' for this resolution is voting for a minimum of  $880 billion in cuts to Medicaid.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "It will reverse Republican cuts to  Medicaid, remove redtape, and prevent the closures of rural hospitals-- something I think we all agree on.", "title": "-9999", "date": "2025-07-30"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Because in order to meet the targets that were  outlined over in the House, the Congressional Budget Office, which has  long been nonpartisan--used by Democrats and Republicans in Congress-- has made it clear that this would have to involve cuts to Medicaid.", "title": "H. Con. Res. 14", "date": "2025-04-03"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "Speaker, I rise today to oppose the cruel budget cuts  on Medicaid and NIH.", "title": "Introducing Legislation on Drug Pricing", "date": "2025-05-14"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "So why in the world are congressional Republicans teeing up these  massive cuts to Medicaid in their budget?", "title": "Addressing Unworkable Funding Reductions in the Federal Budget", "date": "2025-04-07"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "Today, I met with an organization and individuals from it,  MomsRising, where families from Washington State and all over the  country came to protest the cuts to Medicaid and SNAP.", "title": "One Big Beautiful Bill", "date": "2025-06-25"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "Speaker, I rise today to express my profound  opposition to the callous cuts to Medicaid included in the House  majority's reconciliation legislation.", "title": "Opposing Medicaid Cuts", "date": "2025-06-03"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "In Twisp, Washington, a small, rural town that Trump won last  November, hundreds of residents gather every Saturday to protest cuts  to Medicaid and SNAP.", "title": "Why I Came to Congress", "date": null}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "We are  talking about nutrition and taking away SNAP benefits from families and  so much more, because the budget they voted for called for $880 billion  in cuts to Medicaid and $230 billion in cuts to SNAP.", "title": "Trump's First 100 Days", "date": "2025-05-05"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Republicans made devastating healthcare cuts to Medicaid and the  Children's Health Insurance Program.", "title": "Ensuring Funding for Communities", "date": null}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "The nonpartisan  Congressional Budget Office said that the proposed GOP budget would  require cuts to the Medicaid people rely on.", "title": "H. Con. Res. 14", "date": "2025-04-03"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Speaker, Republicans are advancing, as we all know, a budget that  includes $880 billion in cuts to Medicaid to pay for tax breaks for  billionaires.", "title": "Defending Social Services and Programs", "date": "2025-04-08"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "In fact, some of my Republican  colleagues, led by Congressman Tony Gonzales, wrote in a letter to  Speaker Johnson that the proposed cuts to Medicaid within this budget  would have serious consequences, particularly in rural and  Hispanic communities where hospitals and nursing homes are already  struggling to keep their doors open.", "title": "Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Consumer Gas-Fired Instantaneous Water Heaters''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Waste Emissions Charge for Petroleum and Natural Gas Systems: Procedures for Facilitating Compliance, Including Netting and Exemptions''; and Providing for Consideration of H. Con. Res. Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-02-25"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "I have visited with hospitals, community health centers, physicians,  and many more who have raised their deep concerns about the impending  cuts in Medicaid.", "title": "Continuing Appropriations and Extensions Act, 2026", "date": null}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "They want to make  the biggest cuts to Medicaid ever.", "title": "Business Before the Senate", "date": "2025-04-28"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "While I have been  fighting to protect Medicaid benefits for Californians, the Governor's  irresponsible actions are now threatening deep cuts for Medicaid in  California.", "title": "Protecting Medicaid Benefits in California", "date": "2025-05-13"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Speaker, as the President has said numerous times,  there will be no cuts to Medicaid.", "title": "Providing for Consideration of Senate Amendment to H.R. One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "It is Republican cuts to  Medicaid.", "title": "Providing for Consideration of H.R. Improving Law Enforcement Officer Safety and Wellness Through Data Act; Providing for Consideration of H.R. Leosa Reform Act; and Providing for Consideration of H.R. Federal Law Enforcement Officer Service Weapon Purchase Act of 2025", "date": "2025-05-14"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "Speaker, as I sat here and listened to that panoply of  speeches or motions over the last few seconds, I was reminded of the  fact that when we say there should be no cuts to Medicaid, we are  saying there should be no  cuts to illegal immigrants who are getting Medicaid.", "title": "Providing for Consideration of Senate Amendment to H.R. One Big Beautiful Bill Act", "date": "2025-07-02"}]