[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…make that video available.\n\nAs we all know, on January 3, this campaign reached a climax. U.S.  forces conducted airstrikes to neutralize anti-aircraft systems,  carried out cyber operations to shut down power in Caracas, and  executed a helicopter assault  on the Presidential compound to seize Maduro and his wife. The tactical  success of this mission…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…rating and 15 years of service was  terminated.\n\nWe know that a VA researcher working on treatments for substance use  disorders among veterans was terminated.\n\nWe know that the cyber security lead for the VA website--the digital  hub that connects veterans with their benefits and holds sensitive,  personal data--was terminated.\n\nThese kinds of impacts--and…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…over the Pentagon without explanation, many of them clearly  highly qualified people: C.Q. Brown, Chairman of the Joint Chiefs of  Staff; General Haugh, who was the head of the Cyber Command and NSA  Combined Command.\n\nThese are very talented people. Was that based on merit? There is no  merit involved in that. That is about loyalty to Donald Trump. Laura…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…operations that investigate drug  cartels and drug traffickers, from missions that identify and disrupt  foreign terrorist plots, and from actions that protect our families  from cyber attacks to do it. But he is.\n\nAnd instead of supporting and expanding proven violent crime  prevention strategies, he is wasting millions of taxpayer dollars to  terrorize…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696180/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Instead, he now waits for Trump to break apart our own security blanket  so he can pick liberty's shield off one by one.\n\nThirdly, the Trump administration has weakened our cyber defense.  U.S. top intelligence officers recently released the annual threat  assessment, which states the following: ``Russia's advanced cyber  capabilities, its repeated…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…that  while they swear fealty to law enforcement. It just makes no sense.\n\nThey want to cut $491 million from the Cybersecurity and  Infrastructure Security Agency, making our cyber and physical  infrastructure far more vulnerable to attack by foreign bad actors like  Vladimir Putin and President Xi and Kim Jong-un. I know there are some  people in high…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…election officials and judges with access to the tabulation  process must pass a Colorado Bureau of Investigation background check.  Colorado has spent years implementing top-tier cyber security measures  and audits to prevent hackers from interfering with our electoral  process.\n\nWe have one of the most secure election systems of any State in the  country,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690528/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Committee, agreed on, and I know Senator Padilla  is carrying on that torch; that we must, in our local election offices,  keep pace with new technology; that we must combat cyber security  threats.\n\nI think about Chris Krebs, someone who I respect very much, who was  in charge of the Division of the government that makes sure elections  are protected…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690545/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…should be an obvious and grave  threat to our national security.\n\nUnfettered sale of LNG to countries like China and Russia would power  their data centers, AI systems, and cyber missions, all by using  American energy.\n\nThis legislation, importantly, is a departure from how we regulate  all other energy sources. Sources like oil and coal, we have laws…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697082/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…Call No. 286, H.R. 1608--The Department of Homeland  Security Vehicular Terrorism Prevention and Mitigation Act of 2025;\n\nYea on Roll Call No. 287, H.R. 2659--The Strengthening Cyber  Resilience Against State-Sponsored Threats Act; and\n\nYea on Roll Call No. 288, Table H. Res. 878--Disapproving the  behavior of Representative Jesus G. ``Chuy'' Garcia of…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696780/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…wrong. We live in a global world--if anything, an  increasingly shrinking world. Borders and oceans no longer protect us  against many of the threats we face today, including cyber threats and  the changing nature of warfare. The idea that protecting our immediate  surroundings will keep the American people safe is a dated, 19th  century idea that long…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698621/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…House wants.\n\nImagine the consequences if our intelligence community is forced to  spend its time chasing down conspiracy theories instead of monitoring  terrorist networks, cyber threats, or foreign adversaries. Imagine if  analysts stop flagging real dangers because they fear political  retaliation. Imagine if experienced officers walk away from service…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…despite the political violence at home and rising  tensions abroad, the Trump administration has taken an ax to CISA. As  we know, that is the Agency that works to curb emerging cyber security  threats. And that threat, those threats, are a threat to the election  integrity that is so essential to the well-being of our democracy.\n\nThe Executive order makes…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…of the Cybersecurity and Infrastructure  Security Agency, which helps protect American schools, hospitals,  businesses, and critical infrastructure from costly and damaging cyber  attacks. GAO's examinations of Department of Homeland Security  intelligence and counterterrorism programs helped protect the Nation,  strengthen civil liberties, and implement…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698469/recognizing-the-service-of-us-comptroller-general-gene-l-dodaro"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 906, the Foreign Adversary  Communications Transparency Act. At the end of last year, we learned  that Salt Typhoon, a cyber espionage operation backed by the Chinese  Communist Party, infiltrated several American telecommunications  networks to gain access to detailed information on former Vice…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690266/foreign-adversary-communications-transparency-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…mitigate risk to risk mitigation       plans;\n\n(7) require that any information technology acquisition       plan and any strategic plan contains information needed to       manage cyber risks;\n\n(8) require that a traceability analysis is performed and       documented;\n\n(9) require that security-related subject matter experts       are involved in selection…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697273/sba-it-modernization-reporting-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…includes funding for TSA. Those of us who travel back and  forth to our home States every weekend are well aware of the work of  TSA in keeping us safe. It includes funding for cyber security and  physical infrastructure protection. And important to the States of the  Presiding Officer and the State of Maine, it includes funding for the  U.S. Coast Guard.…", "date": "2026-01-26", "source_url": "https://justfacts.votesmart.org/public-statement/1699384/appropriations"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…former county executive in Tennessee, I saw firsthand how  limited budgets, aging systems, and staffing constraints can leave  local governments struggling to keep up with modern cyber threats.\n\nMany smaller jurisdictions only operate with a handful of IT staff  and, in some cases, with none at all. Yet, they are expected to defend  against the same nation-state…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696789/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…authorities more  easily available for prototyping, and by cutting red tape through  eliminating duplicative cost reporting requirements.\n\nAs the chairman of the Subcommittee on Cyber, Information  Technologies, and Innovation, we have worked tirelessly to deliver the  best and most cutting-edge technology to our servicemembers. To that  end, this bill authorizes…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697795/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…range of student  interests.\n\nIn tune with the needs of the country and the interests of the  students, President White has thrown her full support behind a new  commitment to Cyber Studies. Both degreed and certificate level  programs are growing at Sam Houston and the school is working with the  CIA, FBI, DHS and other agencies to create a pathway to…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691515/recognizing-dr-alisa-white-president-of-sam-houston-state-university"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…to work on this issue.\n\nAs these Big Tech companies are using our kids as a profit center,  they are also exposing them to all sorts of adverse content and to so  many harms: Cyber bullying--talk to any principal or teacher in any  school, and they will tell you, in today's world, the bullying never  stops. It never stops. Kids can't go home and get away…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Bill Hagerty", "party": "Republican", "sentence": "…personnel,  our allies, and our interests through its Revolutionary Guard, through  Hezbollah and Hamas and Houthi terrorists, and through its missile  programs and multiple cyber attacks. For decades, the Iranian regime  has cynically violated international agreements to overtly and covertly  pursue the capabilities necessary to make nuclear weapons…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693130/motion-to-discharge-sj-res-59"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…countries of  concern to be using the best American technology remotely to do that.  Nor do we want them to train AI models to enable weapons of mass  destruction, automated cyber attacks, or systems that evade human  oversight. Another final example would be accessing tools designed for  offensive cyber operations.\n\nUnder this bill, if a Chinese firm…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698858/remote-access-security-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "Ms. LEE of Florida. Madam Speaker, I rise today in support of H.R.  2659, the Strengthening Cyber Resilience Against State-Sponsored  Threats Act.\n\nI thank Congressman Ogles for his leadership on this legislation and  for his commitment to enhancing the security of our…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696758/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…expression: jaw-jaw  is better than war-war.\n\nIt is because of our great power that our rivals seek to end the  American way of life through direct or gray zone war attacks or by  cyber or economic destruction, and we certainly should routinely jaw- jaw with those great powers about our possible shared objectives and  deep concerns.\n\nHowever, in the instance…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695367/greater-sanction-pressure-on-russia"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…serious disruption to       normal operations or capacity in a supply chain; and\n\n(B) includes--\n\n(i) a natural disaster;\n\n(ii) a pandemic;\n\n(iii) a biological threat;\n\n(iv) a cyber attack;\n\n(v) a geopolitical conflict;\n\n(vi) a terrorist or geopolitical attack;\n\n(vii) a trade disruption caused by--\n\n(I) a country described in paragraph (2)(B); or\n\n(II)…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…of H.R. 1766, the NTIA Policy and  Cybersecurity Coordination Act, led by the gentleman from California's  23rd District and the gentlewoman from Virginia's Fourth District.\n\nCyber threats, whether originating from state actors, criminal  organizations, or malicious hackers, pose significant risks to our  national security, economy, and the privacy of…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693497/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…technology,       tokens, and tokenization, including to ensure the security of       critical infrastructure; and\n\n(ii) enhance the resiliency of Federal systems against       cyber threats to blockchain technology or other distributed       ledger technology, applications built on blockchain       technology or other distributed ledger technology, tokens,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692733/deploying-american-blockchains-act-of-2025"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…funding bill over the finish line soon.\n\nIt is essential that we get this bill passed for FEMA funding, for  our TSA agents, for our Coast Guard officers, and for our Nation's  cyber security. That is all part of this bill. In fact, I think it is  about 80, 85 percent of this bill. But first and foremost, funding the  Federal Government is Congress' most…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699921/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…Management Agency, why are the folks that work at TSA, why  are the Coast Guard members, why are the folks that handle weapons of  mass destruction, why are the folks that handle cyber security for our  Nation--why are we not paying them while we are having this political  fight?\n\nThis may be good political drama, but for the quarter-million Federal  employees…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700299/government-funding"}]