[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…For the life of me, I don't understand how they can do that  while they swear fealty to law enforcement. It just makes no sense.\n\nThey want to cut $491 million from the Cybersecurity and  Infrastructure Security Agency, making our cyber and physical  infrastructure far more vulnerable to attack by foreign bad actors like  Vladimir Putin and President…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Transportation  Security officers' perspective who screen millions of passengers a day,  to Federal air marshals providing in-flight security, to canine  handlers, inspectors, and cybersecurity experts, all helping to secure  our air transportation system.\n\nIn recent weeks, life has only become harder for this workforce, as  probationary employees have been fired…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688740/tsa-commuting-fairness-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "Mr. WYDEN. Mr. President, for several years now, I have urged the  release of an unclassified report by independent cybersecurity experts  that is titled ``U.S. Telecommunications Insecurity 2022.''\n\nCongress and the American people deserve to be able to read this  report. And I may be the only Senator…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694259/telecom-cybersecurity-transparency-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "Mr. WYDEN. Mr. President, I must object to the Senate proceeding to  the nomination of Sean Plankey of Pennsylvania, to be Director of the  Cybersecurity and Infrastructure Security Agency (CISA), Department of  Homeland Security.\n\nSince July 2022, I have repeatedly urged CISA to release an  important, unclassified report…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689978/nomination-of-sean-plankey"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…federal employees.\n\nIn 2022, the FRTIB launched a new recordkeeping system with the goal  of modernizing TSP's recordkeeping, improving customer service and  bolstering cybersecurity. There were widespread problems with the new  system, including account access, account balances, missing or  incomplete information in accounts and hours-long wait times…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691138/introduction-of-the-federal-retirement-thrift-investment-board-inspector-general-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…``additional powers that don't exist right now'' and  act ``without Congress'' to ``mandate that States'' adopt her  preferred, radical election rules.\n\nIn addition, the Cybersecurity and Infrastructure Security Agency,  known as CISA, a critical Agency within DHS that works with State and  local officials to protect the security of our elections, has…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…knowing this to be true,  Trump has taken steps to tear down our cyber capabilities in a  comprehensive manner. Why?\n\nSince taking office, Elon Musk and DOGE have decimated cybersecurity,  CISA, our premier cybersecurity agency, with personnel cuts and stop  work orders.\n\nWhy would anyone do that?\n\nIn March, President Trump and Defense Secretary Pete Hegseth…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…leaders, and American surveillance information.\n\nIt is imperative that American interests are at the table as new  wireless standards are crafted, including those that have cybersecurity  and national security implications.\n\nI thank Representatives Dingell, Clarke, Kean, and Walberg for their  bipartisan work on this bill.\n\nMr. Speaker, I urge my colleagues…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693507/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…and a well-lived life. He  was a pillar of every community and organization that he was a part of.\n\nHe began his career as a network engineer before transitioning into  cybersecurity. Over the past 20 years at Visa, he rose to become  director of cybersecurity, where he not only was a respected leader but  a beloved manager and colleague known for his…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689774/congratulating-chief-keith-johnson-on-his-retirement"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…collaborative manner with representatives from private industry,  government, and other key stakeholders. The Council is also now co- chaired by a representative from the Cybersecurity and Infrastructure  Security Agency to help foster collaboration between our Nation's  leading cybersecurity experts across the government.\n\nHowever, given the important…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693434/communications-security-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Prize in Physics for their  groundbreaking research in quantum computing. Their work will advance  evolving technologies in everything from drug discovery to agriculture  to cybersecurity and beyond. As UC President James Miliken has said,  their work has truly ``opened the door to the next generation of  quantum technologies.''\n\nFinally, Professor Omar…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696912/recognizing-californias-2025-nobel-laureates"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…Musk's AI systems in violation of all laws;  it is also a major national security concern. Bad actors will now have  a much easier time siphoning off U.S. data due to the cybersecurity  vulnerabilities that Elon Musk has created.\n\nEarlier this morning, the Oversight Committee held a hearing on how  artificial intelligence has been integrated into the…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Ms. McCLELLAN. Mr. Speaker, I rise today in strong support of H.R.  1766, the NTIA Policy and Cybersecurity Coordination Act, which I was  pleased to introduce with the gentleman from California (Mr.  Obernolte).\n\nMr. Speaker, this important bipartisan legislation would cement…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693498/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…increasingly rely on these vendors, helping them  access technology to compete, the least we can do is ensure that there  is good oversight to address vulnerabilities like cybersecurity  threats.\n\nTurning to this bill, H.R. 3682, let's step back and remember why we  have a Financial Stability Oversight Council in the first place.  Congress established…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699825/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…by requiring the Secretary of  Commerce, acting through the Assistant Secretary of Commerce for  Communications and Information, to study the national security risks  and cybersecurity vulnerabilities in American homes posed by routers  and modems manufactured or sold by entities with ties to our foreign  adversary countries. The Secretary must also deliver…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690157/removing-our-unsecure-technologies-to-ensure-reliability-and-security-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…``ROUTERS Act''.       SEC. 2. STUDY OF RISKS POSED BY CERTAIN ROUTERS AND MODEMS.\n\n(a) In General.--The Secretary shall conduct a study of the       national security risks and cybersecurity vulnerabilities       posed by consumer routers, modems, and devices that combine a       modem and router that are designed, developed, manufactured,       or supplied…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690158/removing-our-unsecure-technologies-to-ensure-reliability-and-security-act"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…lost their lives to  opioid overdoses. That is why this bill is so important to reauthorize.  I thank my friend and the chairman for including my bill, the 9-8-8  Lifeline Cybersecurity Responsibility Act in this bill. I hope everyone  in the Chamber is aware of the 9-8-8 lifeline and the vital services  that it provides. It provides 24/7 crisis mental…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691879/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…capabilities. This includes $1.785  billion in total resources for nuclear energy technology, $720 million  in investments for fossil energy production, and $190 million to  improve cybersecurity and grid resilience.\n\nUnleashing American energy dominance means truly building our  production and infrastructure to meet the modern demands, not just  coming up with…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698759/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…major transformation because the AI revolution is not just coming. It  is already here.\n\nWhether it is managing inventory, scheduling workers, marketing  products, improving cybersecurity, or streamlining paperwork,  artificial intelligence is rapidly becoming how business gets done in  America.\n\nIf small businesses do not have the tools and guidance to…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699180/ai-for-main-street-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Safety Act (15 U.S.C. 2055), consult with the following:\n\n(A) Technologists, data scientists, and experts in       artificial intelligence and machine learning.\n\n(B) Cybersecurity experts.\n\n(C) Members of the retail industry.\n\n(D) Consumer product manufacturers.\n\n(E) Consumer product safety organizations.\n\n(F) Any other person the Commission considers…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693414/consumer-safety-technology-act"}, {"senator": "John Rutherford", "party": "Republican", "sentence": "…our communities.\n\nMr. Speaker, this bill gives TSA the resources to keep the flying  public safe while getting rid of wasteful programs like VIPR.\n\nIt supports CISA, the Cybersecurity and Infrastructure Security  Agency, which is securing vital infrastructure from adversaries like  China.\n\nIt also provides FEMA with the resources it needs to support…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699353/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Congress technical assistance upon       request to ensure effective use of the authorization portal       and Artificial Intelligence systems for oversight purposes.\n\n(3) Cybersecurity and compliance considerations.--The       authorization portal shall be designed to promote vendor       neutral interoperability, reduce redundancy, and ensure       compliance…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…means of communications, are sufficient to support the timely       provision of liquidity, including in times of financial       stress;\n\n``(iii) the effectiveness of cybersecurity measures       implemented with respect to discount window operations;\n\n``(iv) the effectiveness of communications between Federal       reserve banks, financial institutions,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699861/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…foundations of the American Dream  for people and job creators nationwide.\n\nIt also advances needed government efficiencies by cutting waste,  modernizing technology and cybersecurity, and addressing unused Federal  space and buildings. Crucially, it also protects Americans from a  supercharged IRS by cutting enforcement and redirecting resources to…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…spectrum management, administration of broadband grants, internet  governance, representing the United States in international  telecommunication forums, and developing cybersecurity policy.\n\nAs the chairman has mentioned, Congress has not reauthorized NTIA  since 1992, before many of these responsibilities existed or were  relevant. This legislation…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690256/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…Task Force.--Not later than 120 days after       the date of the enactment of this Act, the Secretary of       Homeland Security, acting through the Director of the       Cybersecurity and Infrastructure Security Agency (CISA) of       the Department of Homeland Security, in consultation with the       Attorney General, the Director of the Federal Bureau…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…Protecting Information by Local Leaders for Agency Resilience Act,  known as the PILLAR Act.\n\nThis legislation is about strengthening the first line of defense in  our Nation's cybersecurity. While we often focus on Federal networks  and high-profile national systems, the reality is that many of the  services Americans depend on every single day are run by…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696789/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…industry-led standards-setting bodies that are setting       standards for such technology;\n\n(C) any limitations of such technology (including any       supply chain or cybersecurity limitations) identified by       industry-led standards-setting bodies that are setting       standards for such technology; and\n\n(D) how to best work with entities across…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690229/future-uses-of-technology-upholding-reliable-and-enhanced-networks-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Artificial intelligence.\n\n(ii) Automated vehicles and unmanned delivery systems.\n\n(iii) Blockchain and other distributed ledger, data       storage, data management, and cybersecurity technologies.\n\n(iv) Quantum computing and quantum sensing.\n\n(v) Additive manufacturing.\n\n(vi) Advanced manufacturing and the Internet of Things.\n\n(vii) Nano technology.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…the Communications  Security Act, led by the gentleman from Pennsylvania's 13th District  and the gentleman from New Jersey's Eighth District.\n\nThe bill strengthens the cybersecurity of critical telecommunications  infrastructure by permanently establishing a Federal Communications  Commission advisory council to increase the security, reliability,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693435/communications-security-act"}]