[{"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today issued the following statement following President Trump's announcement on new guidelines to implement the $19 billion Coronavirus Food Assistance Program (CFAP) for farmers and ranchers impacted by the ongoing coronavirus pandemic."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "Senator Steve Daines today announced that he was able to successfully secure stronger provisions and critical funding for tribal communities in the Coronavirus Economic Recovery Package."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today introduced the Coronavirus Worker Relief Act."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today announced that the U.S."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today issued the following statement after President Trump signed a bipartisan deal into law that provides $480 billion in additional relief for the Paycheck Protection Program (PPP) and the Economic Injury Disaster Loan Program (EIDL) for small businesses, testing and hospitals in light of the Coronavirus pandemic."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today voted for two critical pro-life bills, the Pain Capable Unborn Child Protection Act and the Born-Alive Abortion Survivors Protection Act."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today announced that $3,457,033 will be directed to the Montana Board of Crime Control and $47,182 to Lewis and Clark County to help law enforcement respond to a potential increase of crime that may occur following the Coronavirus outbreak."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today announced that $3,325,357 will be directed to Montana through the Community Development Block Grant (CDBG) program to support housing needs and infrastructure development for Montana communities during the coronavirus outbreak\n\n\"This critical funding is about strengthening Montana's infrastructure and building our communities during the coronavirus pandemic,\" Daines said."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today released the following video statement after President Donald Trump's State of the Union (SOTU) Address."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today introduced legislation to require private health insurance plans to cover treatments or vaccines for the novel coronavirus, or COVID-19, with no cost sharing."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today announced that the U.S."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today announced the Trump administration will be expanding access to Medicare telehealth services during the coronavirus outbreak."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today secured a boost of over $480 billion in funding for testing, hospitals, the Paycheck Protection Program (PPP) and the Economic Injury Disaster Loan Program (EIDL) to provide more relief for Montana small businesses, workers, families and healthcare professionals in light of the Coronavirus pandemic."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today announced the United States Department of Agriculture (USDA) will be providing all timber sale contract holders with a two-year extension."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today announced that the U.S."}]