[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Americans have watched President Trump turn the Defense Department into  an ideological battleground for imposing a right-wing ideology that  politicizes personnel policy and damages the readiness of all our  service members. While this conferenced version of the NDAA does not  include all the culture war related provisions from House version, it  does…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…chapter) in any district court of the United States that has       jurisdiction to hear a criminal prosecution arising out of       the same conduct or occurrence and may recover damages and       reasonable attorneys fees.\n\n``(b)(1) Any civil action filed under subsection (a) shall       be stayed during the pendency of any criminal action arising       out…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699879/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…productivity; over 3,500 heart  attacks; thousands of cases of respiratory illness; and, yes, over  8,000 deaths. Dirty diesel will cost Americans over $90 billion in  health damages. Republicans are fighting for resolutions that are  hurting people's health and putting lives at risk.\n\nMadam Speaker, I urge my colleagues to oppose this resolution, and…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690432/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…are  acting in the best interests of the country, not the best interests of  their own personal finances. When Members of Congress are  able to trade off of our position, it damages the integrity of this  institution and of our entire democracy.\n\nAs Members of Congress, we have access to all sorts of information  that the average member of the public…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691216/stock-trading-ban-for-members-of-congress"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…2024, doing about a billion dollars' worth of damage.\n\nAnd by the end of last year, every county in Vermont, all 14  counties, were hit by flooding. That billion dollars in damages  affected homes; it affected businesses; it affected farms.\n\nWe had 6,000 tons of debris that was removed, 77 State bridges and 63  State roads were closed; 704 miles of rail…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…and  individuals to fight back when they are harmed by the executive  branch's unlawful impoundment of funds. By giving Americans a right of  action to seek injunctions or damages, POCCA gives the ICA and Article  I of our Constitution real teeth. By waiving qualified immunity, it  would make Elon Musk and any other administration officials who  willfully…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691336/pocca"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…of Huntington's Disease so we can work to improve prevention and care  of affected folks at the federal level.\n\nHuntington's disease is a rare genetic disorder that slowly damages  the brain over time. It leads to a progressive loss of control over  movements, thoughts, and emotions. There is currently no cure. However,  there is hope. Because of ongoing…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691197/recognizing-may-as-huntingtons-disease-awareness-month"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…funds necessary to defend our Nation and to protect the safety and  well-being of our men and women in uniform. However, I must oppose this  bill which abandons our allies, damages our military readiness, and  promotes divisive policies that undermine morale.\n\nI come from a defense-dependent State. I understand the importance of  the investments we make…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693648/department-of-defense-appropriations-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…this legislation  is critical, because this legislation says that if they are guilty of  such reckless misconduct, they can be sued for it and held civilly  liable for the damages.\n\nImagine losing control of your own likeness and identity. Imagine  that happening to you when you are in high school. Imagine how  powerless victims feel when they cannot…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…risk.\n\nUnder the law, app stores that distribute and support TikTok are  subject to severe penalties: up to $5,000 per user and that could  amount to billions of dollars in damages. And while the current  administration has signaled that they won't enforce the law, the  statute of limitations for that liability is 5 years, meaning future  administrations…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692683/tiktok"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…hurricanes, sea  level rise, or wildfires. So the actual number is obviously worse.\n\nAs to those uncounted extreme weather effects, First Street reports  that natural disaster damages have risen more than tenfold since the  1980s and now cost the global economy over $200 billion per year.  NOAA's 5-year average of billion-dollar disasters in the period…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…would also  make D.C. eligible in the same manner as states are eligible for a  transportation program that would support the replacement and removal  of infrastructure that damages the ecosystems of the Anacostia and  Potomac rivers. D.C. residents pay the same federal taxes as residents  of the states and therefore D.C. is almost always treated as a…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698538/introduction-of-the-district-of-columbia-transportation-funding-equality-act"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…and her family.\n\nRachel has reached out to me and asked that I join her in raising  awareness for this disease. Huntington's disease is a rare genetic  disorder that slowly damages the brain over time. There is currently no  cure. However, there is hope, thanks to Medicaid research advancements  and investments.\n\nRachel recently reached out to me and…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691303/recognizing-huntingtons-disease-awareness-month"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…quantify. Mr. Speaker, 174 Capitol Police  officers were injured while protecting this sacred place, and 5  officers lost their lives. The Capitol itself sustained $30 million in  damages. In total, that day cost American taxpayers $2.7 billion, Mr.  Speaker. Think of that.\n\nWhile the insurrectionists did not succeed that day, they did cause  even bigger damage…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698520/solemnly-recognizing-the-5th-anniversary-of-january-6"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…liable,  becomes legally responsible, and citizens can seek redress against that  individual. They have legal recourse in court. They have a day in  court. They can seek monetary damages and a court order that stops the  violation. It is used all the time in the United States of America  against State or local police or law enforcement that break the law and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…consumers and waste our resources.''\n\nTo those who still have a fond memory of Ronald Reagan on my side,  Ronald Reagan said:\n\nProtectionism costs consumers billions of dollars, damages       the overall economy, and destroys jobs.\n\nRonald Reagan's vision for America can be seen in our trading  relationships with Canada. In 1986, President Reagan said:\n\nOur…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…entered into an agreement with       the Community Reclaimer under which the State shall assume       all responsibility with respect to the project for any costs       or damages resulting from any action or inaction on the part       of the Community Reclaimer in carrying out the project,       except for costs or damages resulting from gross negligence…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691092/community-reclamation-partnerships-act-of-2025"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…the       Secretary may expend funds that have been appropriated or       otherwise made available for the operating expenses of the       Department to pay claims for money damages against the United       States, in accordance with the first paragraph of section       2672 of title 28, United States Code, which arise in a       foreign country in connection…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696951/combatting-international-drug-trafficking-and-human-smuggling-partnership-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…of title 31,       United States Code, are not available for deposit to the       Fund; and\n\n``(ii) amounts necessary to reimburse the United States       Government for the damages which the Government sustains from       acts described in subsection (a) of section 3729 of title 31,       United States Code, are not available for deposit to the…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698841/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…LAPD officers were  injured.\n\nLocal and State leadership clearly could not contain the chaos. The  riots have cost at least $30 million to pay overtime and repair  property damages to city buildings. This doesn't include the small  businesses and other private entities whose businesses fell victim to  the destruction.\n\nWe also know that the riots were…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693138/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Supreme Court--saying Trump's actions are  likely illegal, unconstitutional, and must be paused to avoid  irreparable harm to the American people.\n\nWhile Trump defies the law and damages our economy, what are House  Republicans doing? This week and into the next couple, Republicans are  plotting to rip healthcare away from millions of Americans to fund tax…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Department of  Justice that is pursuing political enemies.\n\nThe measure was never meant to enrich Senators. It has always been  true, under our rules, that Members wouldn't keep damages they recover  under this measure.\n\nI would hope that we can work together to pass a resolution to  reflect what has always been true and what I have been saying all  along,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697049/unanimous-consent-requests"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…political  statement so they can't be deported.\n\nIt creates a private right of action so that Americans who are harmed  by a removable alien in a sanctuary city can sue for damages.\n\nIt bans student visas in sanctuary jurisdictions. You do not get to  continue profiting off of importing foreign students if you won't even  deport the dangerous illegal…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…David's father was in law enforcement for a  number of years, and when 9/11 occurred, guess who was first to  volunteer his time to risk his health to go help clean up the damages  of 9/11?\n\nOn behalf of the American people, I extend my deepest appreciation  for his tireless efforts and exemplary service. May his leadership and  dedication continue…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689427/recognizing-david-camhi"}]