[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…and utilize the  military again, you come to Congress and ask for a vote.\n\nThat is not just our prerogative. It is our responsibility. It is in  the Constitution. That is our damn job. If you don't want to do it, do  something else. Yet it is our responsibility.\n\nIn terms of the gentleman's interpretation of the War Powers  Resolution, I will simply suggest…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699359/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…enrollment deadlines have already passed. Parents have sat at  their kitchen tables and realized that between rent, groceries,  childcare, and Trump's tariffs driving up the cost of damn near  everything, health insurance is something they could no longer afford.\n\nInstead of a plan on healthcare, last night in the Rules Committee, I  heard one Republican excuse…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…providing lifesaving medical care. Even for Republicans, this  bill is extreme.\n\nAre we really attempting to lock up parents and doctors?\n\nYour kids' medical care is none of their damn business.\n\nWe should call their obsession with being in your kids'  pediatrician's office and what treatment they are getting in a  pediatrician's office what it is. It is creepy.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698348/protect-childrens-innocence-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…Independents, and people who don't care about  politics--hate it so much that the bill that they put the word  ``beautiful'' in, they can't say the name anymore because it is so damn  toxic because it takes most of the resources from working people and  gives it to the billionaires and megacorporations. Now, months later,  they still want to tout the bill,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699681/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…another boat rose to his feet and declared,       ``I am the sheriff of the county of Kent''--\n\nThat would be Kent County, RI--\n\n``I am the sheriff of the county of Kent, God damn you. I       have a warrant to apprehend you, God damn you. So surrender,       God damn you.''\n\nThe officer drew his sword and repeated his warning. Some       of the sailors…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "Ms. SCANLON. Mr. Speaker, I spent the weekend listening to my  constituents, and it damn near broke me.\n\nI heard from seniors worried about Musk's attacks on Social Security  and Medicaid, small businesses confronting bankruptcy from Trump's  tariffs, and parents…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689829/standing-up-for-americans"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…we are  going to get yelled at from the left; you are going to get yelled at  from the right; and we can't withstand that so we just have got to go  through with it. It is a damn shame.\n\nMaybe this exercise builds a little muscle memory for at least  exploring how to have a bipartisan negotiation. Maybe there is some  silver lining to this. Maybe there…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695313/cloture-motion"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…The survivors' painful stories brought many to tears last week. Their  pain made us cry, but we cannot stop at tears. We owe them the justice  they asked us for.\n\nRelease the damn files.\n\nMr. Speaker, if we are going to discuss what should be disclosed with  these Epstein files, all the more reason to bring this bill forward. We  can amend it in Rules…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…premiums are  doubling and tripling. We heard from people who don't understand why  you guys moved at the speed of light to give tax breaks to billionaires  but won't lift a damn finger to extend the tax credits that help ensure  people's health insurance premiums don't skyrocket.\n\nThis CR, this dirty CR, which does nothing to solve the healthcare  crisis,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…without food. This is a human rights issue. We  live in the richest country on Earth for God's sake. Not a single kid  in this country should go to bed hungry, not a single damn one,  especially not when Republicans are giving millionaires and  billionaires a big, fat tax break.\n\nMr. Speaker, what is wrong with my Republican colleagues? In this  bill,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Donald Trump on  the campaign trail spent all of their time saying that costs were going  to go down on day one.\n\nMr. Speaker, costs haven't gone down. Republicans haven't done a damn  thing to lower the high cost of living. Costs haven't gone down in this  country. Costs have gone up. Inflation is on the way up. Housing costs  are out of control. Grocery…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696738/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…standing up and ranting like  lunatics? It was Republicans.\n\nGo back and look at the videos. It was embarrassing. Nothing was done  about that.\n\nI am the ranking member of the damn Rules Committee, and I have a  question. Why are the rules only applied to Democratic Members?\n\nAre Republicans ready to censure their own Members for wearing  campaign hats…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688503/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…pretty  significant. There is the impact on their physical development. There  is the impact on their mental development. And, of course, if you are  hungry, you can't learn a damn thing in school--so three ways of really  hurting America's children, millions of American children.\n\nCongress together, Democrats and Republicans, said this should never  happen.…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…People can't access the most basic healthcare in this  country right now. That is Trump's economy.\n\nAs we take stock of where this economy stands today, I think it is  pretty damn clear why Donald Trump went bankrupt six times. He is  literally bankrupting this country and the hardworking people that are  its backbone. The livelihoods of our communities…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695608/devastating-harm-caused-by-trump-administration"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…this town, particularly when it comes to lowering the high  cost of living in the United States of America. Republicans continue to  do nothing about that. They are not doing a damn thing to make life  more affordable for the American people.\n\nThat is one of many reasons why we continue to be opposed to this  reckless legislation that Republicans bring…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693714/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…world's capital to finance what we have  been borrowing internally and now we have to pay it back.\n\nBe prepared. These aren't surprises. We all know it, but no one reads  the damn documents. It is math, and it turns out telling the truth-- remember our story here that fact-based discussions on the floor no  longer get us elected. No one listens to them.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…yet to start any war in either administration. His fight every day is  protect the American homeland, protect the people of the United States  of America, and he has done a damn good job.\n\nMr. MAST. The President never explained it to me. Maybe he was just  trying to make room for Maduro and his wife.\n\nLet me answer some of the questions that my colleagues…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…going to tell our  friends in local government whether to increase housing starts or  decrease, and we are sure not going to tell them how to do it. They  don't have to do a damn thing if they don't want to. But if they do  increase housing starts, they are going to get extra money from the  Federal Government, and if they don't, they are going to get…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…disinflation. That is  to get their incomes up through tax reform, through regulatory reform,  through designing a healthcare delivery system that looks like somebody  designed the damn thing on purpose. And that is what we ought to be  working on. If we--I don't have control of the floor. If I had control  of the floor, I would be here every single day introducing…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697423/the-economy"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…years of  interest, you know, because of the interest window, this costs $111  billion.\n\nUnderstand what the left is telling you. They are basically saying  they don't give a damn about healthcare. It is financing. If we wanted  to change the price of healthcare, we would actually be looking at the  innovations that are going on and start to legalize…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…my chest. I hate it when I make a  mistake. Mr. Speaker, have you ever had that moment when you say  something as you are walking down to your next meeting and you go: oh,  damn it?\n\nLast week, I was walking through a series of different numbers, and  one of them was a proposal, or a discussion coming out of the White  House. It was about taking the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…The FBI agent in Minneapolis who received a voicemail promising to  kill him, his wife, and his daughter, stating ``I am coming for you. .  . . [Y]ou, your wife, and your dead damn effing daughter are dead,''  after his personal information was stolen from a government vehicle  last month.\n\nThe numerous ICE officers whose wives have received calls telling…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…2000s, I  think that would add another $3 trillion, $4 trillion over 10 years of  just interest. The theater around here is about telling stories. It is  emoting the emotion, but damn it, does anyone own a calculator?\n\nMr. Speaker, what was it, 10 days ago, 2 weeks ago, Moody's  downgraded the United States and part of the point--because I know we  all read…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the American ethos  now? The Americans' ethic is that we are going to make our kids and  grandkids poorer because we want stuff? This is what we have become  because we are so damn afraid to do things that are hard around here?\n\nLook, I am going to do this slightly out of order. Ten weeks ago,  when we were doing the One Big Beautiful Bill Act, part of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…No, because they are going to run television ads beating the  crap out of us because we tried to figure out a way to save it. The  perversity of this place. They don't give a damn about someone's  future, their poverty. It is about winning the next election and  raising money on it.\n\nWe have got to tell the truth also what is going on in our country.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…services, tell me  how I am to pay for it.\n\nThere is a path where I can make this math--I can't pay it off. I can  stabilize it and make this another American century, but, damn it, how  do I do it in a body that is just terrified of telling the truth about  math or just basic economics?\n\nThis is the reality. This is our latest report. In 2033, 20.3…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}]