[{"senator": "Angie Craig", "party": "Democrat", "sentence": "…the WNBA didn't protect the game. They manipulated it. They  chose a winner.\n\nHere is the truth: Minnesota didn't lose game five. The WNBA took it  from them, and I will be damned if I ever put on a New York Liberty  jersey.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693881/taking-on-wnba"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…some among us, the  perfidious lust for unbridled power and the imposition of cruelty in  its quest know no bounds and are bereft of human decency. And the rule  of law be damned.''\n\nWhat a condemnation of what is going on in Minneapolis and Chicago  and other States.\n\nIt might be hard to imagine, but, one day, the Trump Presidency will  end. The statute…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699485/department-of-homeland-security"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…mega-donor or a loyal MAGA mouthpiece, you do not  matter to this Republican majority. What is happening here isn't just  irresponsible. Mr. Speaker, it is immoral, and it is a damned disgrace.\n\nMr. McGOVERN. Will the gentlewoman yield?\n\nMr. McGOVERN. Mr. Speaker, I don't like Elon Musk.\n\nMr. Speaker, I think the idea that quoting somebody means that you…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…service of  the fossil fuel industry, which has the world's biggest conflict of  interest and a history of lying and of dark-money political influence,  is going to look pretty damned bad.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…violence because we cannot and we will not allow ICE  to tear our country apart. We refuse to allow this administration to  terrorize this country, and that is why I will be damned if we give one  more dollar to that rogue organization, Mr. Speaker. That is why I will  vote ``no,'' and that is why we must defund ICE.", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699193/defund-ice"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…going to require an all-of-the-above approach based on  technological neutrality. Instead, Republicans are focused on giveaways  to billionaires--Americans' bank accounts be damned.\n\nIt is as clear as our beautiful Crater Lake at home that all the talk  from Trump and Republicans about American energy dominance never was  going to be a reality. It was…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696128/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…billionaires. It is grotesque.\n\nMr. Speaker, I urge a ``no'' vote on the previous question. I urge a  ``no'' vote on the rule. If the rule passes, I urge ``no'' votes on all  these damned bills, and I yield back the balance of my time.\n\nMr. McGOVERN. Mr. Speaker, on that I demand the yeas and nays.\n\nThe yeas and nays were ordered.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…who have spoken out against the rich and powerful men who  abused them?\n\nWhy fight a bipartisan discharge petition from   Thomas Massie and Ro  Khanna to release all of the damned files, not just the ones that the  Trump's DOJ allows to be released?\n\nWhy not speak out against the cushy deal that Ghislaine Maxwell just  got from Deputy Attorney General…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695359/stop-illegal-entry-act-of-2025"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…defiance of a unanimous Supreme Court decision to bring him back, the  Trump administration is unapologetic in its efforts to target  immigrants, the Constitution, and the law be damned.\n\nNow, in addition to being unconstitutional, this wastes a great deal  of tax dollars because they are detaining masses of people in these  large sweeps, only to have to release…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693662/weaponization-of-ice"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "Mr. GOMEZ. Mr. Speaker, it is about damned time that this bill is  actually going to get a vote. Here is why. The Republicans in the  summer passed their One Big Beautiful Bill Act, which I am glad they  are not trying…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698802/breaking-the-gridlock-act"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…are witnessing it stretch from DC to the Caribbean Sea as  Trump is, once again, unilaterally--and unconstitutionally--using our  troops however he sees fit, rule of law be damned.\n\nTo put what he has done another way, the President has ordered  repeated military strikes against civilians without congressional  oversight, and he has claimed that such…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…consequences of this unauthorized and unlawful military strike. Nicolas  Maduro, a brutal tyrant, was removed from power. The Trump  administration replaced Maduro with his own damned vice president. Is  that the big victory that my friends think we should be celebrating?  Meet the new boss. Same as the old boss.\n\nThey left in power the same illegitimate…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699359/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…tanked the market nearly 20 percent and  put the entire American economy on the line so that countries would  give him a phone call? Is that what this is all about? Give me a damned  break.\n\nRightwing pundits are going to act like pausing the tariffs was some  kind of stroke of genius, that recouping only one-third of our market  losses is somehow a brilliant…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…every day for work.\n\nYesterday, House Republicans wanted to forcibly remove me from a  committee for calling out this administration's grift, but they don't  have a single damned thing to say when it comes to protecting  healthcare for children and seniors.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688241/republican-hypocrisy-and-gop-budget-plan"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…why Congress established  these Agencies, what they do, or the positive impact they are having on  the lives of millions of people. To Musk and his DOGE agents, the law  be damned. Congress be damned. The American people be damned. The world  be damned.\n\nThe precedent being set by these illegal actions is a lasting threat  to the American people, to…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…issue when it says that everyone who loves and practices       falsehood is classified with the sexually immoral, murderers       and idolators as being among those who will be damned. Of       course some people occasionally tell white lies in deference       to the feelings of those they love, but then people who are       always strictly truthful are…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694761/recognizing-campbell-the-nature-of-truth-odessa-american"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…Senator of Los Angeles and the State of  California--being roughly mishandled and say: Huh, too bad. At least it  wasn't me.\n\nIf we answer this moment with silence, we will be damned, and our  children and the world will say: They didn't really mean it.\n\nThe members of my family who served in the U.S. military knew that  signing on that line meant being…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692447/alex-padilla"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…a major enforcement surge across the State of Florida.  ICE is focusing on rings of criminality, and they will pursue them  wherever they might be, political correctness be damned. Americans are  better off under this approach.\n\nMs. FOXX. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, this majority continues…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699072/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…sense of the run time  here?\n\nMr. SCHWEIKERT. If we are all blessed, I won't use it all.\n\nMr. Speaker, have you ever had a moment where the first words in your  head are: I am damned if I do and damned if I don't, but is there a  chance?\n\nFor a decade, I have been coming behind this very microphone and  walking through demographics, debt, and the deficit…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…that I have.  That is not a world that is safe for America. That is not a world that  is safe for America.\n\nI don't want America to be the world's policeman, but I will be  damned if I want Xi Jinping or Vladimir Putin or the Ayatollah in Iran  to be the world's policemen either.\n\nThis military base is key. So I am asking you, Prime Minister  Starmer--I…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699482/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…no EPA, no FDA. Everything that is discretionary is gone.  Today, my math is that several hundred billion dollars of mandatory  spending have to be gone. We are borrowing so damned much money now  that we have to borrow money just to cover our Medicare obligations.\n\nDo we understand? What if I came to you tomorrow and said that I can  end most of the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}]