[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Kim, Don Bacon, Vince Fong, Jeff Hurd, Thomas H. Kean,  Jr., Nick LaLota, John James, Ryan Mackenzie, Rob Bresnahan,  Mariannette J. Miller-Meeks, Earl L. ``Buddy'' Carter,   Dan Newhouse,  Erin Houchin, and David P. Joyce all write in support of a clean energy  economy.\n\nAs House Democrats, we support--we know that there is an all-of-the- above approach…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…panelists on the consequences of the cuts are represented                                   below\n\nAtul Gawande, former Assistant Administrator for Global       Health, USAID\n\nDan Schwarz, Vice President, Management Sciences for Health\n\nNicolas Enrich, former Acting Assistant Administrator for       Global Health, USAID           usaid programs are cost-effectiveness…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…maybe  meet with the Dingells.\n\nIt was winter, and we knew Mr. Dingell's health was failing or shaky.  It started to fail, and we were supporting Mrs. Dingell as a  delegation. Dan Kildee of Flint was our dean then, and we rallied to  show our love and our support. Tragically, we lost Mr. Dingell on an  early February day.\n\nMr. Speaker, it was really quite…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…never  wavering as a marine.\n\nHappy birthday, U.S. Marine Corps.\n\nSemper Fidelis.\n\nI am happy now to yield to my colleague and friend from Alaska and  fellow marine, U.S. Senator Dan Sullivan.\n\nMr. BLUMENTHAL. Mr. President, I thank my colleague from Alaska for  those very powerful words from himself and the Commandant.\n\nAs he has remarked, this Marine Corps…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696623/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…Recruiting Families Using Data Act.\n\nThis legislation is a good example of Congress doing the work our  constituents sent us here to do. Last Congress, my former colleague,  Dan Kildee, worked closely with Representative Feenstra to introduce  this bipartisan bill, which is based on solid research and the  fundamental principle that if we want to know…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688406/recruiting-families-using-data-act-of-2025"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Springfield District\n\nMale Athlete: Simon Fischer, Baseball, Central Springfield       Little League; Female Athlete: Valeria Morales, Soccer,       Braddock Road Youth Club; Coach Dan Walsh, Baseball, Central       Springfield Little League, Parent: Kwame James, Basketball,       Cross-Training Athletes into Believers.                                Sully…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697100/recognizing-the-recipients-of-the-2025-stephen-a-mclaughlin-fairfax-county-champions-of-character-awards"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…she has led with passion, humility, and inclusiveness. She began her  journey at TBK by nurturing young minds--teaching a class of four-year- olds--and later, with her husband Dan, advising the youth group for  five years. Her sustained commitment and deep sense of purpose led her  to the board in 2010 and eventually to her current leadership role.\n\nA…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691572/recognizing-monica-gurell"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…New York Times, Nov. 20, 2025]     After 167 Years in New York, a Priceless Coin Collection Heads to                                   Toledo                               (By Dan Barry)\n\nOn the 11th floor of a downtown Manhattan building, just       around the corner from the Holland Tunnel, sits one of the       world's finest collections of coins.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…used to crack her and me up by calling her  Bassomatic. That was the nickname. His staffers back here are far too  young to remember the ``Saturday Night Live'' skit in which Dan Aykroyd  puts a bass in a blender and makes this gross smoothie and drinks it.  It was funny, and that is the kind of thing that Doug would pull up  spontaneously and crack…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698736/9999"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…roundtables that bring together  educators, law enforcement, teenagers, health professionals, and more.  At every single one of these roundtables, Midwest HIDTA Executive  Director Dan Neill has sat and listened to the tragic stories of loss  and the challenges faced by our communities.\n\nHaving spent a career in drug and law enforcement, Mr. Neill connects…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693340/recognizing-the-crucial-work-of-the-high-intensity-drug-trafficking-area-program"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…having violated the  Hatch Act.\n\nAs a refresher, Kellyanne Conway promoted Ivanka Trump's clothing  line in the last Trump administration. Stephanie Grisham, Nikki Haley,  and Dan Scavino engaged in political activity on their government  social media accounts. Former Secretary of Agriculture Sonny Perdue  unlawfully promoted President Trump's 2020 reelection…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…have worked to secure resources and change Federal  policies to help the healers at Haymarket Center fulfill their mission.\n\nI want to thank Haymarket Center's current CEO Dr. Dan Lustig for his  work in ensuring Haymarket continues to live up to Father Mac's vision.  Dr. Lustig's leadership has kept Haymarket at the forefront of  addiction treatment…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694580/recognizing-50-years-of-haymarket-center"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…that  are built into article I of the U.S. Constitution. That is the job  which we must do, and that is what the American people expect from us.\n\nMr. President, I want to thank Dan Ohlstein for all of the great  service which he has given to our country.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698823/9999"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…avanzan con recortes devastadores a programas federales  como Medicaid.\n\nEl activismo de Angelica nos recuemrda cuanto contribuyen nuestros  inmigrantes a nuestras comunidades y dan forma al cambio que saben que  necesitamos.\n\nA nombre del tercer distrito del Congreso de Illinois, es un gran  honor para mi felicitar a Angelica Garcia Santos por su activismo,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688474/womens-history-month"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…happened to the Appropriations Committee?\n\nNow, Senator Hatfield was a Republican, and he had been chair of the  Appropriations Committee. And he said: I worked so closely with Dan  Inouye of Hawaii, and I worked so closely with Patty Murray of  Washington. What has happened to that collaboration?\n\nThat was several years ago. But as we have watched, over…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "Mr. NUNN of Iowa. Mr. Speaker, I rise today to recognize Mr. Dan  Houston on the occasion of his retirement and to honor his more than 40  years of service at Principal Financial Group. From his first role in  the retirement division to serving…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695028/recognizing-the-service-and-leadership-of-dan-houston"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Representatives,                                  Washington, DC, December 10, 2025.      Hon. Pam Bondi,      Attorney General, Department of Justice,      Washington, DC.      Hon. Dan Driscoll,      Acting Director, Bureau of Alcohol, Tobacco, Firearms and           Explosives, Washington, DC.      Hon. Robert Leider,      Chief Counsel, Bureau of Alcohol,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…pursuant to paragraph (1).\n\nMr. BOST.  423.\n\nMr. Speaker, I rise today in support of S. 423, introduced by my  colleague and fellow marine from across the Capitol, Senator Dan  Sullivan from Alaska.\n\nS. 423 would require the Secretary of the VA to provide quarterly  briefings to Congress on the budget execution and any projected budget  shortfalls.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…G. Axelson, Petty Officer Danny Dietz, Chief  Petty Officer Jacques Fontan, Staff Sergeant Shamus O. Goare, Chief  Warrant Officer Corey Goodnature, Senior Chief Petty Officer Dan Healy,  Sergeant Kip Jacoby, Lieutenant Commander Erik Kristensen, Petty  Officer 1st Class Jeffrey Lucas, Lieutenant Michael McGreevy, Sergeant  First Class Marcus Muralles;…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692903/recognizing-the-20th-anniversary-of-operation-red-wings"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…and the  moments shared.\n\nFor many, this hotel is far more than a place to eat or sleep. It is  a community gathering place. It is their own Cheers, as longtime staff  member Dan Collar described. It is a place where locals and visitors  alike return year after year, bound by a shared experience of  belonging.\n\nThe Waterville Hotel serves as a gateway…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693585/congratulating-the-waterville-hotel"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "Mr. FEENSTRA. Mr. Speaker, I rise today to congratulate my friend and  fellow Iowan, Dan Houston, on his retirement from Principal Financial  Group after 41 years of service.\n\nFrom starting his first job with Principal in 1984 to eventually  becoming chairman, president,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694878/congratulating-dan-houston"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…something that I think has been  largely overlooked, and that is the lowering of the taxes on interest  on car loans for American-made cars.\n\nI recently had the chance to visit with Dan McGee. This is Dan right  here. He is the general manager of M.J. McGuire Auto Dealership and  also a farmer in Rugby, North Dakota.\n\nWith the One Big Beautiful Bill Act now…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694792/promises-made-promises-kept"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Alaskan of the Week. There are so many.  We have talked about hundreds over the course of many years here on the  Senate floor.\n\nJay was born in Fairbanks in 1964. His father Dan moved to Fairbanks  from Brooklyn, NY, in 1948. And as Jay says: There has been a Ramras in  Interior Alaska going on 80 years.\n\nAnd Jay's entrepreneurial resume, which is legendary…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…were never small in his eyes.  He was humble, generous, a loyal friend, and liked by everyone he met.\n\nI am going to miss Doug's big grin, as he always greeted me as  Lieutenant Dan. Joan and I are going to truly miss Doug. We send our  deepest condolences to his wife, Jill, and their four kids during this  incredibly difficult time. I thank and ask all…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698741/9999"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Speaker, I thank Senators Tim Sheehy and Martin Heinrich for  introducing this important legislation which passed the Senate  unanimously in April.\n\nI also thank Representative   Dan Newhouse for introducing the House  companion bill and leading the charge in this Chamber. I encourage my  colleagues to once again support S. 160.\n\nMr. COMER. Mr. Speaker,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691858/aerial-firefighting-enhancement-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Re Support for S.J. Res. 80/H.J. Res. 124.       Hon. Senator Lisa Murkowski,      Washington, DC.      Hon. Congressman Nick Begich,      Washington, DC.      Hon. Senator Dan Sullivan,      Washington, DC.\n\nDear Senator Murkowski, Senator Sullivan, and Congressman       Begich: The Resource Development Council for Alaska (RDC)       writes in support…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Ms. FOXX. Mr. Speaker, I rise to recognize an exemplary North  Carolinian who was just confirmed by the United States Senate as the  next Secretary of the Army, Dan Driscoll.\n\nDan grew up in Boone, North Carolina, and graduated from Watauga High  School. He then went on to graduate from UNC-Chapel Hill and then Yale  Law School. He has…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688244/recognizing-dan-driscoll"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Mr. BEAN of Florida. Mr. Speaker, we all know that when you are the  best of all time, you belong in the hall of fame, like Dan Marino, Don  Shula, and Jacksonville's own Tony Boselli.\n\nNow there is another Floridian, Mr. Speaker, who has rightfully  earned her place in the Florida Veterans Hall of Fame.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688147/recognizing-florida-lieutenant-governor-jennifer-carroll"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…2020, Jake came to the United  States of House of Representatives as Policy Advisor and Counsel to  Congressman David McKinley (WV-01) before becoming General Counsel to  Senator Dan Sullivan of Alaska. Through these roles, Jake proved his  expertise in energy and environmental policy. As Chairman of the House  Committee on Energy and Commerce, I was pleased…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689859/recognizing-jake-tyner"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…TELEVISION; Herridge,       Catherine: Catherine Herridge Reports; Herring, Charles: ONE       AMERICA; Hess, Ione: CNN; Hewitt, Kayla: WAMU; Hickman,       Stacy: FOX NEWS; Highland, Dan: HEARST TELEVISION INC;       Hijioka, Haruka: NIPPON TV NETWORK; Hill, Charles: NBC NEWS;       Hill, Dallas: FOX NEWS; Hill, Jarred: CBS NEWS; Hillyard,       Vaughn: NBC…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}]