[{"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…was once used to imprison Japanese  Americans, to detain and fast track deportations, with zero due process  rights.\n\nWhile this administration insists it is targeting dangerous  criminals, we know that more than 73 percent of those in ICE custody  have no criminal convictions at all.\n\nThis administration is also intentionally dismantling legal pathways…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697462/fighting-dhs-immigration-raids"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…what they are going to do on immigration.  According to a CBS poll, a majority of Americans believe that the Trump  administration is not prioritizing the removal of dangerous criminals  and public safety threats, and nearly 60 percent disapprove of how the  Trump administration is using immigration detention facilities.\n\nThis is not surprising in the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695359/stop-illegal-entry-act-of-2025"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…they were told,  following the legal pathways, and they are being taken into unmarked  cars and fast-tracked for deportation.\n\nLet's be clear: This isn't about catching dangerous criminals. It was  never about catching dangerous criminals.\n\nThese are moms, dads, students, grandparents, workers, people who are  trying to get through the legal process the…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693019/ice-turns-courthouses-into-traps"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…to  identify themselves, aggressively, sometimes violently, targeting day  laborers, busboys, farmworkers, and some of the hardest-working people  in this country. Not dangerous criminals, but the people who pick the  food we eat and clean the tables we sit at.\n\nThese raids are terrorizing communities and sowing fear in public  spaces across America:…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693156/one-big-beautiful-bill-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…but in 2019 the first Trump administration handed a  contract to a private prison company to convert it into an ICE  detention center. Today, instead of prioritizing dangerous criminals,  those who commit rape, murder, or trafficking drugs, people who pose  real threats to our communities, ICE is filling this facility with  people who have done absolutely…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695521/visit-to-bluebonnet-detention-facility"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…policy is  about comes from a Department of Homeland Security report itself. What  it says is that 14 percent--only 14 percent--of the people who have  been deported are dangerous criminals.\n\nAnd the Trump administration is as good as its word. From day one,  with Stephen Miller, it has announced its intention to conduct mass  deportation in the United…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700023/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…are just going to deport  criminals.\n\nIt then evolved into disappearing people without hearings and  claiming that the people they were disappearing were criminals,  dangerous criminals, members of the Tren de Aragua gang.\n\nThey admitted that there were mistakes made, but now we are seeing  actual children who are citizens being spirited out of the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…more that my friends, classmates, and neighbors did not have to either.  Thanks for your time.''\n\nMr. Speaker, this administration said they were going to go after  dangerous criminals and drug dealers, but what they are doing instead  with this disastrous mass deportation effort is creating fear and  stress across the country including among young…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689733/challenges-facing-our-students"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…Federal immigration agencies  information about when or where someone will be released.''\n\nThis is ludicrous. In other words, D.C. will make it harder for ICE  to detain dangerous criminals and otherwise impede their ability to do  their jobs.\n\nMr. Speaker, you can't make this stuff up. While my colleagues  continue to double down on their America-last…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…bill is a no-brainer. Even in a  polarized time, Democrats should be able to join Republicans to  unanimously support such reasonable legislation. After all, deporting  dangerous criminals is a rational, normal, and coherent step that this  House should take. Unfortunately, I am skeptical that we will see much  agreement from my Democratic colleagues on…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693084/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…groups that are now going  out and providing coordinates to people throughout L.A. for where ICE  operations are taking place.\n\nFour, they have actually released a lot of dangerous criminals from  our jails through early release policies so there are plenty of people  out there who are willing to stir up trouble.\n\nFive, they are adding fuel to the fire--literal…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692164/protests-in-los-angeles-california"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…disregard Federal immigration  law out of our American communities.\n\nIt is vital that law enforcement officers and Border Patrol officers  have the tools they need to hold dangerous criminals accountable and  safeguard our communities, and this legislation does just that.\n\nPresident Trump has delivered on his promise to secure the border,  and this legislation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695364/stop-illegal-entry-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…supported it, and encouraged it are now attacking President  Trump for daring to undo the damage, reverse the open borders and  secure them, and then try to remove the dangerous criminals who are  walking the streets of the United States because of the radical  progressives and their open-border policies.\n\nI know my friend from Louisiana has a lifetime…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…Madam Speaker, I yield myself such time as I may consume.\n\nI will say that my friend from Maryland mentioned robbery, rape, and  murder. This bill's goal is to apprehend dangerous criminals before  they rob, rape, or murder Americans.\n\nSecondly, and most importantly, referencing a farmworker, if they are  here illegally and they do not commit a felony,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…President  Biden, Border Patrol was averaging more than 1,000 arrests a day.\n\nPresident Trump has promised to secure our border and make our  communities safer by removing dangerous criminals from our streets.  Just 3 months into his term, the results of these policies truly speak  for themselves: Promises made, promises kept.\n\nHonoring the Life of Lieutenant…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689611/supporting-reversal-of-california-ev-mandate"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…but a large number of radical billionaires that are  funding organizations dedicated to putting into office DAs and judges  who put criminals on the street, who allow dangerous criminals to walk  among us in our communities, on trains in Charlotte, North Carolina,  where a young woman from Ukraine was butchered by someone who had been  in and out of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…entering our country  illegally. It means we must ensure dangerous individuals do not enter  our country, even through legal means, and it certainly means we must  remove dangerous criminals that are in the country today.\n\nAs the Trump administration recently warned, ``mass migration poses  an existential threat to Western civilization.''\n\nSo what do the…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697341/trump-administration"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Republican House and a Republican Senate are  backing them.\n\nLocal law enforcement are being backed instead of having leftist  judges who are dismissing the crimes and putting dangerous criminals on  the streets. When Joe Biden commutes sentences and puts dangerous  criminals on the streets, the American people know who is actually  standing up for law enforcement.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Columbia, and for other purposes,  and ask for its immediate consideration.\n\nThe Clerk read the title of the bill.\n\nMr. COMER.\n\nMr. Speaker, cashless bail allows dangerous and violent criminals on  our streets. For far too long, dangerous criminals have been allowed to  roam the streets of Washington, D.C., posing a threat to the general  public. Progressive,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696981/district-of-columbia-cash-bail-reform-act-of-2025"}]