[{"senator": "James Walkinshaw", "party": "Democrat", "sentence": "Speaker, for years, we have watched dangerous  conspiracies like Pizzagate and QAnon shape our political landscape.", "title": "Epstein Files Transparency Act", "date": "2025-11-18"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "The first 100 days of this administration have been about policies  that are delusional, diabolical, destructive, and dangerous.", "title": "Trump's First 100 Days", "date": "2025-05-05"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "Here, the simplest explanation for this unprecedented  increase in outsourced care is a broader goal to dismantle the VA  system itself, aligning with Project 2025's dangerous objective to  privatize veterans' healthcare.", "title": "Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2026", "date": "2025-06-25"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "Now, let's look at what this decidedly unreasonable, outrageous, and  dangerous plan would do.", "title": "Establishing the Congressional Budget for the United States Government for Fiscal Year 2025 and Setting Forth the Appropriate Budgetary Levels for Fiscal Years 2026 Through 2034", "date": "2025-04-03"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "At the heart of this dangerous misinformation campaign are people  like the Secretary of Health and Human Services, R.F.K., Jr., who has  built a career by spreading lies about vaccines and spreading rhetoric  that has been debunked time and time again by doctors and scientists.", "title": "National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "He is offering pardons for millions  of dollars to his friends and letting dangerous individuals back on to  the streets.", "title": "Restoring Election Integrity", "date": "2026-01-21"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "They are often the size  of, literally, a quarter of the head of a pin, and the reason that they  are so dangerous is that they are inhaled to the very deepest parts of  our lungs, where they do the most damage.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Internal Revenue Service Relating to ``Gross Proceeds Reporting By Brokers That Regularly Provide Services Effectuating Digital Asset Sales''", "date": "2025-03-26"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "I do agree with one Republican, Representative Warren Davidson, who  does believe in freedom and has described Trump's deal with Palantir as  dangerous and has said when you start combining all these data points  on individuals into one database, it really essentially creates a  digital ID, and it is a power that history says will eventually be  abused.", "title": "Providing for Consideration of H.R. DC Criminal Reforms to Immediately Make Everyone Safe Act; Providing for Consideration of H.R. District of Columbia Policing Protection Act; Providing for Consideration of H.R. Lowering Age At Which A Minor May Be Tried As Adult for Certain Criminal Offenses in District of Columbia; Providing for Consideration of H.R. District of Columbia Judicial Nominations Reform Act; Providing for Consideration of H.R. Guaranteeing Reliability Through the Interconnection of Dispatchable Power Act; Providing for Consideration of H.R. National Coal Council Reestablishment Act; Providing for Consideration of H.R. Promoting Cross-Border Energy Infrastructure Act; and for Other Purposes", "date": null}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "In 2010, he earned a Bronze Star with Combat V after running through  dangerous territory to reach a fellow Marine who had been struck by an  IED.", "title": "Recognizing Sergeant Major Troy Black", "date": null}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "It is a dangerous retreat  from our role in the world.", "title": "Relating to Consideration of the Senate Amendment to H.R. Rescissions Act of 2025", "date": "2025-07-17"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "This rhetoric from elected officials is beyond dangerous and incites  even more violence.", "title": "Minnesota Lawmakers Shooting", "date": "2025-06-16"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Protecting Drivers From Dangerous Electric Vehicle Battery Fires\n\nMr.", "title": "Recognizing National Blood Donor Month", "date": "2026-01-08"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "If the President needs to block some dangerous product, he still can.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Internal Revenue Service Relating to ``Gross Proceeds Reporting By Brokers That Regularly Provide Services Effectuating Digital Asset Sales''--", "date": "2025-03-04"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Madam Speaker, the harrowing videos and stories out of  Texas earlier this month are another reminder of how unpredictable and  dangerous weather has become.", "title": "Fema Cuts and Hurricane Season", "date": "2025-07-22"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "This bipartisan legislation would close that dangerous loophole  once and for all.", "title": "Stock Trading Ban for Members of Congress", "date": "2025-05-14"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "Peter's long career in federal law enforcement has taken him across  the country, where he faced some of the world's most dangerous, and  hardened criminals.", "title": "Recognizing St. Paul, Minnesota Immigration and Customs Enforcement Field Office Director Peter Berg", "date": "2025-06-23"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "That portrayal  is both inaccurate, and it is dangerous.", "title": "-9999", "date": null}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "If  Washington can override State expertise here, it sets a dangerous  precedent for every energy-producing State in the U.S.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``North Dakota Field Office Record of Decision and Approved Resource Management Plan''", "date": null}, {"senator": "Jason Smith", "party": "Republican", "sentence": "We know, however, now, that mifepristone is extremely dangerous to  women.", "title": "Breaking the Gridlock Act", "date": "2026-01-08"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "They are going  after narcoterrorist organizations such as Tren de Aragua, Cartel de  los Soles, Clan del Golfo, and MS-13, just to mention some of these  dangerous cartels that kidnap and maim and poison our youth.", "title": "Resolution, to Remove United States Armed Forces From Hostilities with Presidentially Designated Terrorist Organizations in the Western Hemisphere", "date": "2025-12-17"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "Until that happens, the dangerous precedent of unlimited war- making power will continue to be abused by Presidents of both parties.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Environmental Protection Agency Relating to ``Air Plan Approval; South Dakota;", "date": "2026-01-07"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Is it time for us as Members of Congress to talk about something  which is often dangerous because when you are taking on a system that  has trillions of dollars flowing through it, you have to understand  that there will be ads in my district that are going to beat the ever- living crap out of me.", "title": "Truth Telling with Math and Facts", "date": "2025-05-20"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "We collectively support the use of the Congressional Review       Act to overturn the mineral withdrawal currently under       consideration in Congress, as it is an essential step forward       in unlocking the resources that our nation needs to reduce       our dangerous reliance on China and other adversarial       nations.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to Public Land Order No. 7917 for Withdrawal of Federal Lands; Cook, Lake, and Saint Louis Counties, Mn", "date": "2026-01-21"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "There  is nothing better for our long-term national security than democratic  transitions within those anti-American dangerous regimes around the  globe, and NED is a pivotal part of that, which is why, with great  admiration and respect to the sponsor of this amendment, I must ask for  a ``no'' vote.", "title": "Financial Services and General Government and National Security, Department of State, and Related Programs Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "If you cannot hold your  government accountable for violating your rights or potentially  violating your rights, you have a very dangerous government.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "In addition to threatening public safety, these dangerous imported  cylinders take market share from the gas cylinder manufacturers in the  United States.", "title": "Compressed Gas Cylinder Safety and Oversight Improvements Act of 2025", "date": "2025-06-09"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "The CCP is engaged in a persistent strategic campaign to influence  every corner of American life, and one of their most dangerous efforts  is to target our education system.", "title": "Dhs Restrictions on Confucius Institutes and Chinese Entities of Concern Act", "date": "2025-05-07"}, {"senator": "John Joyce", "party": "Republican", "sentence": "Components of the NDAA will bring an end to the dangerous, leftwing  ideologies that have been incorporated into our military.", "title": "President Trump's Peace Through Strength Agenda", "date": null}, {"senator": "David Schweikert", "party": "Republican", "sentence": "It is a really dangerous game we are playing.", "title": "Debt, Deficits, and Demographics", "date": "2026-01-21"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "Speaker, is if anyone in  the suspect motor vehicle was afforded an opportunity to comply with an  order to surrender any suspected dangerous weapons.", "title": "District of Columbia Policing Protection Act", "date": null}]