[{"senator": "Laura Gillen", "party": "Democrat", "sentence": "…Medicaid cuts in the  budget bill will have devastating impacts on our healthcare system and  on millions of Americans who depend on it.\n\nI am committed to fighting against these dangerous attempts to attack  Long Islanders' healthcare.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692748/medicaid-is-a-lifeline"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…have a hard time  convincing ourselves, in fact, that the Iranians haven't already done  it.\n\nPretending like Iran does not have a credible threat and has no  leverage is a dangerous and ignorant position for our government to be  taking and one of the scariest things about the many threats that we  face right now.\n\nThose who don't know should go look…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…the size of the two largest nuclear arsenals in the world. At  the same time, we are seeing headlines about strikes on Iran's nuclear  facilities.\n\nThese actions revive a dangerous question: Can we stop the spread of  nuclear weapons through military force? I believe the answer is no. We  cannot destroy knowledge with a bomb. We cannot erase a nuclear…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694115/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…operating in my district in  Reedley, California. Local officials uncovered a clandestine operation  storing biological materials, laboratory equipment, medical waste, and  dangerous, dangerous pathogens like malaria, like COVID, like HIV.  There were thousands of laboratory mice in unsafe conditions.\n\nAll of this was inside a warehouse located near residential…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699754/stopping-unregulated-biological-laboratories"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, launching a criminal investigation to  coerce the Federal Reserve is a dangerous crossing of the Rubicon--even  for Donald Trump, who has crossed many Rubicons already, to his  detriment and to the country's detriment.\n\nAmerica's economic stability depends…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…June 10, 2025.      Re Vote ``No'' on H.R. 2096 Protecting Our Nation's Capital           Emergency Act Which Would Allow Dangerous Officers Who           Have Been Terminated for Criminal Conduct or Police           Misconduct to Remain Employed as D.C. Metropolitan Police           Officers Endangering…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…into a jail or prison. This means nothing is  preventing ICE from picking up individuals when they are released from  custody.\n\nBut instead of prioritizing picking up the dangerous, violent  criminals they talk so much about, what is ICE doing instead? They are  out roving streets in communities across the country and arresting  people based on the…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…options in such trade dealings with       foreign governments. Unfortunately, some in the Congress are       trying to do exactly that. I'll keep you informed on this       dangerous legislation, because it's just another form of       protectionism and I may need your help to stop it. Remember,       America's jobs and growth are at stake.\n\nUntil next…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696451/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…You have to start  over with those. The decision he made to shut down these clinical  trials will push back the ability to have cures for some of the most  debilitating and dangerous diseases facing humanity today.\n\nCuts to hospitals is another one. Now, closures of rural and urban  hospitals in many instances are going to be a result of the Medicaid…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…from the UN  Register of Conventional Arms, which provides transparency on arms  transfers and helps to deter the traffic in illicit weapons. But it is  as illogical as it is dangerous.\n\nAnd if you believe that it is wrong to support an organization that  provides lifesaving, voluntary family planning information and services  in countries where impoverished…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699129/us-withdrawal-from-united-nations-organizations-and-programs"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…entire region.\n\nListen to this carefully. The State Department--our State  Department--has put out a notice that Americans should not travel to  Afghanistan because it is too dangerous. So why, why are we facing the  situation where this Trump administration is going to eliminate  temporary protected status for the Afghans in the United States,  including…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693450/temporary-protected-status"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…resolution's sponsor wanted to pursue a CRA, he should have inquired  then.\n\nIf this CRA succeeds, it won't just open the Boundary Waters to  pollution but would set a terrible and dangerous precedent for Congress  to roll back protections for any of our treasured public lands with  little oversight or notice, just because Republicans have decided they  would…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…weakness that plays directly into Putin's hands.\n\nTurning our backs on NATO allies would embolden dictators and further  undermine American credibility. Walking away would send a dangerous  signal to Putin and Xi Jinping. We cannot strip away resources from  allies confronting Russian aggression or leave a vacuum for our enemies  to exploit.\n\nInstead, we must…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695228/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…means to serve and why the Marine Corps' legacy matters not just in  history books but in the daily defense of  our democracy and our ideals. The world has never been more dangerous  and more in need of that service.\n\nAs we look to the next 250 years of the greatest Nation in the  history of the world, let's ensure that our policies, our resources,…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696623/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…functions. It also requires the Federal Trade  Commission to study blockchain technologies and tokens.\n\nThe CPSC and the FTC do important work to protect all Americans from  dangerous products, including emerging technologies. While this bill  will help assist in those efforts, it is no replacement for strong,  independent, and bipartisan agencies or proper…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693412/consumer-safety-technology-act"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…France, matching or exceeding the  losses of much larger allies with far greater resources.\n\nSo despite its small military, Denmark has deployed forces to some of  the most dangerous, kinetic combat zones, particularly Helmand  Province, fighting alongside UK units at the height of the insurgency.  Danish forces accepted frontline combat roles--some lost…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…request, proceeding to the  vote on the Chairman of the Joint Chiefs of Staff would give the  President the advice and counsel that our Commander in Chief needs  during a very dangerous time.\n\nThat said, I made the unanimous consent request with mixed feelings  because, frankly, there are two regulations--pernicious, onerous,  needless regulations--by the…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690110/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the community is that the city of  Los Angeles and the State of California have chosen to enact sanctuary  policies that explicitly forbid ICE from taking custody of these  dangerous individuals in the safest and least disruptive setting, in a  custodial setting, that is, in jails. That is the explicit purpose of  our sanctuary laws.\n\nDespite these facts,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…examples  from my home State, and there are countless more heartbreaking stories  from across the country.\n\nIt is clear that the current penalties are not enough to deter this  dangerous cycle of illegal reentry. The safety and security of our  citizens must never be compromised by those who abuse our system and  exploit our borders.\n\nH.R. 3486 protects American…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695360/stop-illegal-entry-act-of-2025"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…happy, and Europe could have used  some help with their energy demand.\n\nNot only was this decision completely unnecessary, but it was also  economically and strategically dangerous. Under both Democratic and  Republican administrations, DOE has consistently found that U.S. LNG  exports serve the public interest, contributing positive economic  benefits…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697085/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…than  through elections. Meaningful checks and balances require the  President's party to stand up and resist unconstitutional usurpations  of power. Until that happens, the dangerous precedent of unlimited war- making power will continue to be abused by Presidents of both parties.\n\nI recommend a ``yes'' vote on this resolution.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…Washington have suggested that the Pentagon is sitting on spectrum  bands that could be better used for commercial wireless. That portrayal  is both inaccurate, and it is dangerous. The reality is these  frequencies are not idle. They are the backbone of America's missile  defense and intelligence systems. And we should not be allowing Federal  Agencies…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695027/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…through and the ground cannot  drain the water properly a void may form underground. From that point  on, it is often simply a waiting game until the ground gives out and a  dangerous sinkhole develops.\n\nThis bill would require the Director of the United States Geological  Survey to establish a program that examines the short- and long-term  causes of…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693479/sinkhole-mapping-act-of-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Mr. Speaker, I thank the chairman for yielding.\n\nMr. Speaker, I rise in support of the NDAA, which is designed to  strengthen Federal authorities in detecting and mitigating dangerous  drone activities.\n\nUnmanned aircraft systems, while offering significant potential for  innovation, also present a clear and present risk to the public. This  issue is especially…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697812/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…wilderness for  years to come. While that might benefit us politically, it is sad for  my country. I am sad as an American to see the defense of these crazy,  divisive, and dangerous ideological programs that my taxpayers in west  Texas are spending their hard-earned money for.\n\nMr. Speaker, I encourage and urge my colleagues on both sides to  support…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693716/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…of our EMS  professionals, those who go above and beyond the call of duty. Julie  was nominated by her peers for her heroism during a severe car  accident, volunteering in dangerous icy conditions to help save the  lives of multiple trauma victims. Thanks to her quick thinking and  courageous actions, every victim survived.\n\nJulie's service is a shining…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697377/recognizing-pella-marching-dutch"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…encouraging tools that  help de-escalate conflict and reduce the chances of serious injury or  loss of life.\n\nAcross the country, law enforcement officers are asked to resolve  dangerous situations every day with the least amount of harm as  possible. Less-than-lethal devices, like tasers and similar  technologies, exist for that exact purpose.\n\nRight now,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700032/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…I can't  believe somebody's instinct with this crazy, suicidal empathy would be  to protect an illegal immigrant gang member who could very easily and  has--there are some dangerous people--murdered a family member and  terrorized a community. They would rather tip them off than to have  them deported. These are the facts.\n\nSo what should we do?\n\nHere…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…Tails'' was coined. The red markings that  distinguished the Tuskegee Airmen included red bands on the noses of  their P-51s.\n\nSome of the bomber crews who flew some of the most dangerous missions  during World War II called them the ``Red Tail Angels.''\n\nIn combat during the war, they flew over 15,000 sorties, escorting  bombers and engaging enemy fighters.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696983/tuskegee-airmen-moment-of-silence"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…objecting given that we just laid out very cogent, strong  reasons that we need to move forward on confirming the Chairman of the  Joint Chiefs of Staff right now. It is a very dangerous world. Why  would we wait? I am curious on what the minority leader says.\n\nMr. SULLIVAN. This Senator yields the floor to answer that inquiry  that I asked about.\n\nMr. SULLIVAN.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}]