[{"senator": "Robert Garcia", "party": "Democrat", "sentence": "…people who have died in police  car chases were innocent bystanders. That should alarm every single one  of us.\n\nAcross the country, Republican-led States have recognized the dangers  of high-speed cases. States like Texas, Florida, and Tennessee have all  implemented tighter standards to limit pursuits of violent criminals or  imminent threats. They know…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695640/district-of-columbia-policing-protection-act"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…officers wake up each  day, put on their badge, and answer the call. They do it for us, for  our loved ones, and for our communities.\n\nThis week serves as a solemn reminder of the dangers that our  officers face daily. Without law enforcement, we would not enjoy the  security we often take for granted. With courage and with bravery, our  officers run toward…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691183/national-police-week"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…the ability to detect and respond to chemical,  biological, radiological, and nuclear threats.\n\nWithout initiatives like this legislation, the STC, efforts to combat  these dangers could be significantly hindered or even discontinued,  putting the safety and security of our communities, taxpayers, and  citizens at risk.\n\nPassage of this legislation is…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688696/securing-the-cities-improvement-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…principles. You have in a  common cause fought and triumphed together. The independence and  liberty you possess are the work of joint councils and joint efforts-- of common dangers, sufferings, and successes.\n\nBut these considerations, however powerfully they address themselves  to your sensibility, are greatly outweighed by those which apply more  immediately…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…passed the original  Insurrection Act.\n\nToday, in the 119th Congress, the problems that law enforcement was  designed to address simply are no longer commensurate with the dangers  it is creating now. And I will note that I introduced the Insurrection  Act of 2024 before the current administration took office. In fact, a  Democrat was President at the…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…a townhall with hundreds of my constituents who  are researchers and graduate students in science, technology,  engineering, and math. During the townhall, I discussed the dangers of  this administration's agenda for public health, national security, and  global competitiveness, and they asked that I tell you some of their  stories.\n\nOne researcher…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695749/funding-cuts-to-science"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…to endure extraordinary hardship. Corruption, devastating       hurricanes, political instability, and widespread civil       unrest have only deepened the crisis. The dangers that once       justified TPS have not disappeared, they have intensified.       Meanwhile, the lives of Haitian TPS holders have become       inseparable from our own. They…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…the new norm, it  is important, on this International Day Against Nuclear Tests, to  highlight the successful steps taken by the United States and  Kazakhstan to mitigate the dangers of nuclear weapons, institute global  nonproliferation regimes, and adhere to international norms around  nuclear testing.", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694764/marking-the-15th-annual-international-day-against-nuclear-tests"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…witnesses.\n\nRepublican witness Jaime Puerta, a courageous parent who lost his  child to an overdose, testified:\n\nIt is imperative that we educate our children on the       dangers of any kind of drug use due to the lethality that can       come with any kind of experimentation or self-medication . .       . we must have specific fentanyl education introduced…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "Mr. KIM. Mr. President, I have no words to describe just the  absurdity of this moment and the dangers to our country and our Union.  For us to be able to stand here on the floor of the Senate in this  Chamber that many such important decisions have been made in, a place  of…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692477/alex-padilla"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…They  don't even know what the effect will be. They don't even care. Just  cut, cut, cut. Cut meteorologists who warn our people, our citizens,  our farmers, our businesses of dangers that might come? Cut them? They  are not waste.\n\nTheir recklessness is hurting rescue efforts. It has hurt the  existing ones, and it is going to hurt more in the future,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693517/central-texas-floods"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…the House Select Committee on the Strategic  Competition Between the United States and the Chinese Communist Party.  On that committee, we have heard over and over about the dangers of  Chinese industrial dominance. They want to just kind of sweep up all  natural resources across the globe for their economic and military  advantage.\n\nWhy would Republicans…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…that anyone investing in these products fully  understand the risks involved, just as prospective drivers must pass a  written test displaying they understand the rules and dangers of the  road before they are given access to a car.\n\nThis bill puts that commonsense principle into practice by creating  an SEC-administered test investors can take if they…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693889/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…working men and women on  the Outer Continental Shelf.\n\nMarine archaeological surveys are not just a nice idea. They actually  are safeguards that protect workers from hidden dangers lurking beneath  the waves. These surveys can detect unexploded ordnance, UXOs, which  are military ammunition, that has never detonated.\n\nThere is actually a lot of that…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…people about what this operation will cost or what success will look  like. This is a profound constitutional failure, and it must be  corrected.\n\nI hope I am wrong about these dangers ahead. I hope this  administration is right, and the transition in Venezuela proceeds  smoothly. I hope that the Venezuelan people embrace this outcome and  see their lives…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Mr. Speaker, I will say that I have been shocked at some of the  debate today that we hear from a daughter of  Korea, two daughters from Cuba, who have seen firsthand the dangers,  the fear, the atrocities, the restraint, the constraint, the end of  freedom that they experienced and their families experienced  personally.\n\nIn my young life, I worked…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697143/denouncing-the-horrors-of-socialism"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…thank my honorable friend from Arizona  whose crusade against the debt is a  true public service. He has spent countless hours in here educating the  American people on the dangers of the debt for our country, and we  should all be grateful. I thank him for this time.\n\nI also thank the folks here in the well who are working diligently to  always take…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "French Hill", "party": "Republican", "sentence": "…citizens, the benign influence of  good laws under a free government--the ever favorite object of my  heart, and the happy reward, as I trust, of our mutual cares, labors,  and dangers.''\n\nMr. Speaker, I thank my colleagues,  Mike Kennedy of Utah,  Don Beyer  of Virginia, and Ben Cline of Virginia, for joining me in this renewal  of tradition in this, our…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700272/president-washingtons-farewell-address"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…principles. You have in a common cause  fought and triumphed together. The independence and liberty you possess  are the work of joint councils and joint efforts--of common dangers,  sufferings, and successes.\n\nMr. KENNEDY of Utah. Mr. Speaker, it goes on to say: ``It is  substantially true that virtue or morality is a necessary spring of  popular government.…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700269/president-washingtons-farewell-address"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…duty to remember.\n\nMr. Speaker, on National Vietnam War Veterans Day and every day, we,  the people of the United States, with a grateful heart salute those who  endured great dangers at the hands of the enemy and lost in service to  our Nation.", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689202/saluting-vietnam-veterans"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…opened the doors for our biggest  foreign adversary to exploit breakthroughs for Chinese strategic  advantage.\n\nThis bill protects our institutions of higher education from the  dangers of the CCP by prohibiting American universities that receive  Department of Homeland Security funding from continuing relationships  with Chinese entities of concern.\n\nToday,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690825/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…ways to try to shrink the  size of our government and rightsize bloated Federal programs.\n\nThey have spent a lot of time and energy catastrophizing about all  the supposed dangers of the One Big Beautiful Bill--one of the most  important achievements of this administration and Congress so far. The  truth about the One Big Beautiful Bill is that it prevented…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695530/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Rose", "party": "Republican", "sentence": "…view. They wasted no time  exploring ways to set up a surveillance state digital currency managed  and micromanaged by the Federal Government.\n\nPresident Trump understands the dangers of more government and more  surveillance. It is why he issued an executive order prohibiting a  CBDC. The vote before the House would make that ban permanent, and I  urge…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693729/anti-cbdc-surveillance-state-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…following the Spanish-American War. Small groups of  Veterans returning from campaigns in Cuba and the Philippine Islands  formed local communities composed of those who shared the dangers faced  while in combat. Eventually, these small, localized societies found  each other, culminating in the creation of the American Veterans of  Foreign Service (the predecessor…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696860/recognizing-the-80th-birthday-of-the-veterans-of-foreign-wars-ottawa-post-3134"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…respected mentor and instructor, shaping the next generation of law  enforcement professionals. His commitment to training ensures that  officers are not only ready for the dangers they face but are also  guided by the highest ethical standards as they serve their  communities.\n\nThrough all his professional accomplishments, Mr. Camhi holds one  thing…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689427/recognizing-david-camhi"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…how many personnel  at their child's school are being compensated by foreign sources or any  donation of foreign transactions between the school and a foreign  entity.\n\nThe dangers of foreign influence in American K-12 schools cannot be  overstated. They threaten our national security, compromise our  geopolitical interests, and erode our academic freedom.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…babies and their mothers.\n\nToday, I am reintroducing one of those efforts. The SAVE Moms and  Babies Act would protect vulnerable women and their preborn children  from the real dangers of chemical abortions.\n\nThe chemical abortion regimen is falsely advertised to be safer than  Tylenol. Tragically, many women have learned otherwise. Nearly 11  percent experience…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699389/rounds-mr-wicker-mr-lankford-mr-mcconnell-ms-lummis"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…babies and their mothers.\n\nToday, I am reintroducing one of those efforts. The SAVE Moms and  Babies Act would protect vulnerable women and their preborn children  from the real dangers of chemical abortions.\n\nThe chemical abortion regimen is falsely advertised to be safer than  Tylenol. Tragically, many women have learned otherwise. Nearly 11  percent experience…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699386/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…highlighting that.\n\nMr. Speaker, I thank my other colleagues for being here to discuss  the goings-on for this week. We have heard so much about the  reconciliation process and the dangers of not getting this done. There  is a real threat.\n\nWe are working under unique circumstances because there is a time  limit set for the end of this year that, if we don't…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690787/big-beautiful-bill"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…their families for their sacrifice and their service.\n\nThese police officers risk their lives every day to protect our  communities, and they do this despite the obstacles and dangers that we  all know that they face. Police officers rush into harm's way out of  duty and devotion to their sacred oath: ``To Protect and Serve.''\n\nThe families of law enforcement…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691031/expressing-support-for-local-law-enforcement-officers"}]