[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…decision came down, 16 years  ago, new technologies have emerged that only make the need for reform  more pressing. AI videos are making their way into political ads,  giving dark money groups a new and cheaper tool with which to influence  politicians and mislead the public.\n\nThat is why I lead bipartisan bills to ban the use of AI to create  deceptive…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699114/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…finance reform. We could have  ended Citizens United or done something about the fact that  corporations and billionaires can flood our elections with unlimited  amounts of dark money, essentially trying to change the outcome and to  elect pawns and puppets to help them do what they want.\n\nWhen the seventh bill came to the House floor on Washington, D.C.,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699681/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…voters. After  it, they became about courting billionaires.\n\nAs of 2025, there are 2,502 super-PACs. For the 2024 election, they  have taken in over $5 billion, much of it dark money, much of it  undisclosed, and much of it designed to drown out the voices of  everyday Americans.\n\nLet's be clear: This isn't free speech. This is legalized corruption.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699235/restoring-election-integrity"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…amendment to overturn this misguided decision. I  am proud to champion commonsense reforms like the Freedom to Vote Act  and--God--the DISCLOSE Act, which would ensure that the dark money  pouring into our elections, the cancerous resources unleashed by the  wealthiest of the wealthy--that at least they could not pour that money  in and then hide their identity.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699090/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…then all this foolishness done on this floor in the service of  the fossil fuel industry, which has the world's biggest conflict of  interest and a history of lying and of dark-money political influence,  is going to look pretty damned bad.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…of the  American people and return it to them.\n\nThe first thing we have to do is fix our democracy and politics,  returning power back to the people. This includes banning dark money,  reversing Citizens United, and ending voter suppression and eliminating  partisan gerrymandering once and for all. It also includes government  reforms to actually get…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699242/restoring-election-integrity"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…important limits on political  spending by corporations and billionaires. We said it at the time, and  it has come true: The decision has unleashed unprecedented spending by  dark money groups on our elections. Now campaigns are often defined not  by a candidate's record or their ideas but, rather, by their access to  dark money.\n\nThe wealthiest individuals…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…It changed how this place, the U.S. Senate, works. The  loudest voices in Washington became billionaires and not everyday  Americans.\n\nIt led to the rise of super PACs and dark money groups. These groups  come out of nowhere, and they spend millions and millions of dollars  attacking one candidate or cause or supporting another. They organize  around…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699113/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Brown, middle- and  low-income folks are drowned out by the volumes of ads a million  dollars can buy.\n\nSince the Citizens United decision, outside spending by super-PACs  and dark money groups has exploded at every single level of government.\n\nThe Trump administration and Republicans in Congress are a clear  example. We know that to make Trump and their…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699241/restoring-election-integrity"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…chairman and ranking member  of the Senate Judiciary Committee, that I am just not progressive  enough; I am not doing enough.\n\nThis influence group here in Washington is a dark money operation. We  don't know where their money is coming from. They are the reformers,  this dark money operation.\n\nWe now have, currently, a debate going on on the floor about…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…simply  treated as if they don't exist because of a different monetization--the  monetization of our politics defending a $700 billion annual subsidy,  powered by unlimited dark money spending. The fossil fuel industry and  its vast array of front groups have used the power of money in politics  to strangle this discussion.\n\nIn our new American petrostate,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…posed by Citizens United in  2010, it is now clear, beyond any doubt, that the decision was an  abject failure for the country. We have to overturn Citizens United,  get dark money out of politics, and make sure our government is  accountable to voters and not donors.\n\nTo my colleagues here in the House, we don't need to end campaign  spending for Members…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…groups  whose job is to fool the American public, propagate climate denial  fraud about what is really going on, and in some cases actually work on  the political side to put dark money into our politics to corrupt  America's response to this known danger. This web of denial, of fraud,  of corruption costs American lives, and it costs Americans money, too.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…disgraceful  decision by the Republican appointees of the Supreme Court 16 years  ago.\n\nThis decision opened the floodgates of our politics to billions and  billions of dollars in dark money, and those billions and billions in  dark money have distorted our political process in ways that are  obvious and evident to everybody who works in this building. Some are…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699104/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…represented in the face of  moneyed interests set on their destruction.\n\nI invite you today to vote ``no'' on this performative, bad- intentioned resolution, and join me in getting dark money out of  politics, protecting and expanding voting rights in America, and  fighting for authentic representation of all our communities. Vote  ``no.''", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696784/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…colleagues will vote for this measure, then we will see justice  triumph over politics. Truth will triumph over deception and  obfuscation. Transparency will triumph over dark money. Partisanship  will fall away to bipartisanship, and grass-roots, the people, will  reclaim the people's House with this vote.\n\nIt is going to be a victory for survivors;…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696903/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…unfortunately, rare. Our  government shut down because of partisan obstruction, and even the few  instances of bipartisanship in our committee have been condemned by  leftist, dark money groups, such as Demand Justice. The situation is  bad for our country and really bad for the American people.\n\nPutting high-quality judicial nominees on the bench to serve…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696138/national-defense-authorization-act-for-fiscal-year-2026"}]