[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…transparency, they are doing this after  taking USAID's website down with all its previously publicly available  reports and data. Congress, the media, and the public are in the dark  about what they are doing.\n\nWe don't know which congressional spending directives they are  violating when they say they have terminated $1 billion in programs. It  could impact…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…perpetrator was  ever brought to justice, and reports, commissions, and other inquiries  on the massacre received absolutely no action.\n\nThe Saka Nakodar massacre continues to be a dark day for Sikhs in  Punjab but also for Sikhs right here in America.\n\nThat is why I recognize the Saka Nakodar massacre and the justice  that awaits not just for the four students…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699986/housing-is-a-human-right"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…approvals are  moving too quickly. In Ohio, the crooked PUCO and Ohio's Legislature  have granted giant tax breaks to data centers, while local township  officials remain in the dark about details. That is not fair.\n\nOhioans know what secrecy and inside deals bring. FirstEnergy  scandals led to indictments, prison terms, and even suicides. Ohio  Statehouse…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697372/rushing-to-build-ai-data-centers"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Guard is also  the sole operator of icebreakers in our polar regions, and they are our  primary force charged with the stopping of pirate fishing from China,  Russia, and other dark fishing fleets that are stealing American  fishing jobs. The issues in the Arctic are real, and we have  highlighted them many times, and this bill will help address that.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688520/coast-guard-authorization-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…is the system for ordinary  Americans.\n\nBut then there is the system for the powerful that every single  Republican in this Chamber keeps voting to defend. It is called the  dark money system. There is no cap on the amount that can be donated.  There is no public disclosure to the American people.\n\nThe Supreme Court created this dual system, saying:…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…using his power over the Department of Justice to shut  down ActBlue like the authoritarian dictator that he is trying to be.\n\nUnder rulings by the Supreme Court, it is big dark money donors who  now dominate elections, and they donate heavily in favor of  Republicans. Instead of putting some restrictions on those dark money  donors, he wants to make…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…amendment to overturn this misguided decision. I  am proud to champion commonsense reforms like the Freedom to Vote Act  and--God--the DISCLOSE Act, which would ensure that the dark money  pouring into our elections, the cancerous resources unleashed by the  wealthiest of the wealthy--that at least they could not pour that money  in and then hide their…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699090/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…prayers on behalf of the  people of Ukraine, which provide hope and strength to the Ukrainian  people as they defend their nation. His support for Ukraine provides a  light in the dark to Ukraine's many faithful Orthodox Christians amidst  one of the most trying periods in Ukrainian history.\n\nAs the 270th successor to the Apostle Andrew, His All-Holiness has…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695442/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…in two major areas.\n\nFirst, it fails because it has no KYC--know your customer-- requirements for self-hosted wallets. It allows anonymous trading on  DeFi exchanges and the dark web, which means there is no way to prevent  wash trading, front running, corruption, ransomware, extortion and  kidnapping payoffs, and all the parade of horribles that unregulated…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693779/digital-asset-market-clarity-act-of-2025"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…September 2? Why is the administration hiding  it behind closed doors, sharing it with only a small handful of  Members, and leaving the rest of Congress and the country in the dark?  What is it about the killing of these two survivors that the  administration is unwilling to let the people see?\n\nThe legality of the entire campaign of striking these boats…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698422/unanimous-consent-requests-the-calendar"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Senate to  testify in committee under oath and answer for their reckless conduct.  We must hold the line against any Federal Reserve nominee from Donald  Trump so long as this dark cloud hangs over the Fed.\n\nIf Senate Republicans are truly worried about the Fed's independence,  if they are worried about what chaos at the Fed means for rising  housing costs,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…in cages and purposely separated them from their parents as an  immigration policy, and what you are seeing in Minneapolis today, that  through line is Stephen Miller and his dark vision of America.\n\nI do not understand this person. I do not understand how he could be  educated in this country and then spew these dark visions of who we are  as a people.…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…percent of those  are diagnosed by the age of 30.\n\nMany are missed. Many are the young people whom we see standing on  the street corner talking to themselves, shadowboxing in the dark,  appearing to have a conversation with someone, appearing angry at one  moment and jovial the next. They are sleeping under the overpasses with  everything they own in a grocery…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…important economic revenue to these communities. They have brought in  tours from all across the country to see the darkest skies in the  country in what is an International Dark Skies Sanctuary and one of the  most breathtaking trails that one can experience in our Nation's first  wilderness.\n\nRegardless, SRS is incredibly important to help ensure that…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…STANSBURY. Mr. Speaker, you guys are so weak that you won't even  vote to release the files. It is 11:20 p.m. in the middle of the night,  and once again, you are trying to jam your dark agenda through Congress  in the dark of night.\n\nIt makes me wonder: Have you even read this bill? I mean, really,  because this bill rescinds $9 billion for international aid,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693707/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…economy and preserved a proud  heritage that strengthens our State and our country.\n\nToday, this House has an opportunity to finally deliver justice for  the ``People of the Dark Water'' of North Carolina. I strongly urge my  colleagues to vote ``yes.''", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695243/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…homes and neighborhoods;  downing power lines; harming businesses; in some cases, taking lives.\n\nJust since the start of 2025, at least eight Americans in these four  States in dark red have died as a result of storms hitting their  communities. In the last 3 months, 37 States have experienced flooding.\n\nThese are the States that are in red. It goes all…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…bulletins, circulars, letters, and more, which  Wayne Crews, a fellow in regulatory studies at the Competitive  Enterprise Institute, has more properly referred to as regulatory dark  matter.\n\nOnly rules that are adopted pursuant to the APA actually carry the  force of law. Yet, in practice, agencies seek to skew the intent of  congressional law and impose…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697347/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…unfortunately, rare. Our  government shut down because of partisan obstruction, and even the few  instances of bipartisanship in our committee have been condemned by  leftist, dark money groups, such as Demand Justice. The situation is  bad for our country and really bad for the American people.\n\nPutting high-quality judicial nominees on the bench to serve…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696138/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Navajo families who have lived without power for  generations. Their efforts brought light, safety, and hope to  communities long overlooked, allowing children to study after dark,  families to preserve food, and elders to live with greater comfort.  Despite daunting challenges and limited equipment, the WREC team  completed a demanding project in just…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692515/recognizing-cody-thomas"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…know that getting the  correct information to the right people at the right time is key. This  bill will ensure disaster survivors in rural communities are not left  in the dark when they need help the most.\n\nI urge all my colleagues to vote for H.R. 804, and I reserve the  balance of my time.\n\nMr. WILLIAMS of Texas. Mr. Speaker, I have no further speakers,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687929/rural-small-business-resilience-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…government agency, advises       the Governor on promoting economic, cultural and educational       ties with Israel. Israel's 77th anniversary takes place in       the long and dark shadow of the transforming events of       October 7, 2023, continuing to impact the survival and       meaning of the Jewish state from within and without. All       those…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690665/israel-at-77"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…High contrast.--The term ``high contrast'' means, with       respect to the symbol or label notice, that such symbol or       label notice--\n\n(A) is either light on a solid dark background or dark on a       solid light background; and\n\n(B) has a contrast percentage of at least 70 percent       between such symbol or label notice and the background,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692751/wastewater-infrastructure-pollution-prevention-and-environmental-safety-act"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…AI streamlines workflows, has made breakthroughs in  the medical field, and can dramatically increase the speed at which  Americans are able to do work. We have also seen the dark side of AI  through biased and discriminatory algorithms and deepfake videos.\n\nThis bill recognizes the danger that AI can pose when employed by  terrorists who seek to harm…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696919/generative-ai-terrorism-risk-assessment-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…adopt orphans within their own country. Children  having a safe and loving home is always a good thing. But my point of  contention is that China left American families in the dark and didn't  engage in good faith. American families were not given the same  opportunity as families from other countries to be united with their  children. Real commitments…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692787/intercountry-adoptions"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…what we are doing is  frivolous. Mr. Speaker, this is far from frivolous. We in Congress are  taking back our authority from unnamed, unaccountable bureaucrats who,  in the dark of night, write unnecessary rules and regulations that  burden the American people and drive up the cost of business and drive  up the cost of products.\n\nIt is important for…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…problem; it is a one- nation problem. All 50 States have National Flood Insurance Program  policyholders. The darker the color, the more likely the flooding.  Missouri is in a dark color. New York State--minimal coastline--is in a  dark color. Pennsylvania is in a dark color.\n\nThis is called river ring flooding, where you have a river and it  comes down…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691629/risk-rating"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…especially  burdens small businesses who often lack the resources to hire  compliance experts. The problem is so bad that agency guidance  documents are known as regulatory dark matter.\n\nFor a brief time, the first Trump administration was able to bring  helpful and needed sunshine to the situation. Following the GOOD Act's  passage by the House during…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688391/guidance-out-of-darkness-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Navajo families who have lived without power for  generations. Their efforts brought light, safety, and hope to  communities long overlooked, allowing children to study after dark,  families to preserve food, and elders to live with greater comfort.  Despite daunting challenges and limited equipment, the WREC team  completed a demanding project in just…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692424/recognizing-john-blaho"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…they don't need a maze of red tape. They need  intervention, a professional to see them, to listen, and to act.\n\nMy bill is about making sure families don't get left in the dark. It  is about giving communities better tools to recognize when something is  wrong and the confidence to respond before it is too late.\n\nNo one should have to fight the system…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}]