[{"senator": "Kathy Castor", "party": "Democrat", "sentence": "…effectively unavailable nearly one-half of the time that it is needed.\n\nAs noted by the North American Electric Reliability Corporation,  large voltage-sensitive loads like data centers require flexible,  responsible grid solutions, not slow-ramping generators that can take  up to 12 or more hours to come online. Coal plants are inherently  inflexible,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695767/national-coal-council-reestablishment-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Democrat, will do what we can  to ensure the Department continues.\n\nNow to the issue at hand. As reflected in the latest National  Assessment of Educational Progress (NAEP) data, schools are struggling  to make up for lost time in the classroom following the COVID-19  pandemic. Achievement gaps, which existed before the pandemic, have  widened. According…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…MAGAZINER. Mr. Speaker, I rise today for the 27th time to call on  the Trump administration to restore funding for lifesaving food aid for  malnourished children.\n\nAccording to data compiled by Boston University, more than 70,000  children--children--have died this year because the Trump  administration has frozen food aid that had been delivered by this…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693466/lives-lost-due-to-us-ending-food-aid"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…currently on the books, the fact is, we  still don't know.\n\nThe Count the Crimes to Cut Act, which I am very proud to cosponsor,  is a necessary first step toward comprehensive, data-driven reform that  truly works.\n\nBy finally establishing a complete inventory of these offenses, we  can effectively evaluate how they are enforced, understand the intent…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697206/count-the-crimes-to-cut-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…problems with this  bill.\n\nIt would make it harder for men and women in uniform serving overseas  to vote, and it would compromise--this Executive order--sensitive,  personal data, giving Elon Musk access to private information about  citizens, contained in voter files in every State.\n\nInstead of creating barriers to the ballot box, we should be  protecting…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690545/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…fishing in the Great Lakes is at least $5  billion. The industry supports an estimated 75,000 jobs across the  region.\n\nResearch into the Great Lakes fishery provides us with the data and  information necessary to manage fish populations, conduct habitat  maintenance, roll out educational programs, and more.\n\nFor the last 5 years, this program has provided…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698193/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…and shipped off to countries  many have never known.\n\nThe Trump administration would have you believe that they are  pursuing hardened criminals. Yet, according to ICE's own data, 85  percent of the people detained in Massachusetts, my home State, have no  criminal record.\n\nRogue, masked Federal agents are violating people's civil rights,  glorified…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697461/fighting-dhs-immigration-raids"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…journalists and critics for speaking out.\n\n5. Creation of an unlawful office. He gave Elon Musk unconstitutional  control over government agencies and American people's personal data.\n\n6. Bribery and corruption. Trump dismissed criminal cases and  accepted foreign payments for personal gain.\n\n7. Tyrannical overreach. His actions reveal a dangerous attempt…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690991/the-truth-still-matters"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…decisions directly impact American households through  inflation, the labor market, savings, and household costs. It is  imperative that these decisions be driven by economic data and  evidence, not partisan pressure.\n\nI ask my colleagues to stand up and use their voices to defend an  independent Fed.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699024/recognizing-jerome-powell"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…because nearly one-half of those savings don't exist.  The receipts didn't add up.\n\nTwo, more than 20 employees resigned from DOGE, refusing to  ``jeopardize Americans' sensitive data, or dismantle critical public  services.''\n\nThree, one of Musk's companies secured a lucrative FAA contract,  laying bare his blatant conflicts of interest. Somehow, I doubt…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688144/recognizing-resilience-resistance-and-relentless-struggle-lessons-of-black-history"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…they are causing.\n\nAnd while they say they favor transparency, they are doing this after  taking USAID's website down with all its previously publicly available  reports and data. Congress, the media, and the public are in the dark  about what they are doing.\n\nWe don't know which congressional spending directives they are  violating when they say they…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…taxpayers. Think about it.\n\nU.S. energy prices are rising and even doubling across Ohio, our  Buckeye State, and many other localities across our country due to the  rise of data centers. Meanwhile, this administration is cutting off  funds for modern energy systems. Wouldn't such a rebate not only be  sensible but welcome and impactful for America's…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…tell us  the same thing: Workforce shortages are slowing down projects, driving  up costs, and ultimately are a major contributor to higher prices for  working families.\n\nThe data is clear: Nearly 10,000 electricians retire each year, while  only about 7,000 new entrants come in each year, according to the  Bureau of Labor Statistics.\n\nGoldman Sachs has…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697895/electric-supply-chain-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…shameful that companies  like Kroger are price-gouging our residents with surveillance pricing.\n\nAs you can see here, companies are already collecting a tremendous  amount of data and private information about our residents to create  custom profiles about them. Now, with electronic labels and facial  recognition technology, this information is being…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693028/surveillance-pricing-in-grocery-stores"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…grid-enhancing technologies, and other solutions.\n\nThis is an incoherent energy policy from the Trump administration.  You say you want more power. We need more power. We have AI data  centers, but let's kill the offshore wind projects. Let's create  barriers to getting sources of energy onto the grid that are ready to  come onto the grid, and let's make…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695752/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…technologically, in an increasingly digital world.\n\nBlockchain technology is not a passing trend. It is a foundational  innovation that is reshaping how we think about security, identity,  data integrity, and commerce. From supply chains and finance to  healthcare and identity management, blockchain is transforming the way  our systems function.\n\nMr. Speaker, we are…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692731/deploying-american-blockchains-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…for  offensive cyber operations.\n\nUnder this bill, if a Chinese firm would like to rent access to a  cluster of advanced chips already subject to U.S. control in an  overseas data center, the Department of Commerce can require a license  if determined that remote access is a risk to U.S. national security.\n\nPut simply, if the U.S. has the authority to…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698858/remote-access-security-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…That is not what Medicare Advantage was designed  to do. It was designed to actually provide a package of delivery to  make you healthier.\n\nI am going to show a little bit of data on a talent-based immigration  system. Over the previous weeks, I have come here before and shown that  we have a demographic crisis. We have a shortage of young people.\n\nThink…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…the most common       facility types in the United States and in other countries,       with consideration for field validation of such retrofits.\n\n``(9) Best practices for data standardization and data       sharing tools and technologies, in coordination with relevant       Federal agencies.\n\n``(10) Fundamental research in chemistry and materials…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…across the country. These bankruptcy  judges ensure that bankruptcy cases are quickly and efficiently  administered. While bankruptcy filings in recent years have slowed,  early data suggests that bankruptcy filings will likely increase in the  coming years. Maintaining these temporary bankruptcy judgeships for the  next 5 years will ensure that the bankruptcy…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698845/bankruptcy-administration-improvement-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…recommendations for       improving the oversight and administration of the Crime       Victims Fund; and\n\n(6) the methodology used to conduct the audit to include--\n\n(A) the data sources relied upon;\n\n(B) any limitations realized during the audit; and\n\n(C) the criteria applied in evaluating the long-term       stability of the Crime Victims Fund.\n\nMr.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698841/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…especially  the disabled. Today, that lifeline is being strained by illegal  immigration and open-door policies.\n\nWhile Democrats and sanctuary States deny the problem, the data is  clear. Let's be clear that every dollar spent on illegal immigration is  a dollar taken from a senior, a veteran, a child, and a family  struggling to pay the bills.\n\nFor…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…electric propulsion, radioisotope power       systems, thermoelectric generators, advanced nuclear fuels,       and heater units.\n\n(B) Modeling and simulation, machine learning, data       assimilation, large scale data analytics, and predictive       analysis in order to optimize algorithms for mission-related       purposes.\n\n(C) Fundamental high energy…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688985/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…ground support equipment,       operational flight test support, communications equipment,       spare and repair parts, personnel training, publications and       technical data, U.S. Government and contractor technical and       logistics support services, and other related elements of       logistics support. The total estimated case value was $1.2…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692321/arms-sales-notification"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…help those whom we serve, it enriches our  own lives. Studies show that service fosters personal growth, reduces  stress, and even enhances our overall well-being. Beyond the data, we  know firsthand that giving back fills our hearts with meaning and our  communities with hope.\n\nMr. Speaker, as we observe National Volunteer Month, I encourage each  of…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689399/national-volunteer-month"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…agencies must act quickly when dealing with a cyberattack.  The sooner a Federal agency knows that it may have a problem, the  sooner it can take steps to protect its systems and data, including the  personal data of millions of Americans.\n\nIt is reasonable to require Federal contractors to play a proactive  role in addressing vulnerabilities in Federal information…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688358/federal-contractor-cybersecurity-vulnerability-reduction-act-of-2025"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…Delaware, our major export destination and the nation  from which we import the most.\n\nAnd yet, because of an emergency at our border, which I think is  wholly unjustified by the data of how little fentanyl actually comes  into our country across the northern border, President Trump is moving  ahead with slapping tariffs on Canada.\n\nTonight, you have a chance,…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689488/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…enforcing U.S. export  controls. As export controls have become more vital to our national  security, the importance of congressional oversight has only increased.  The licensing data for how BIS is administering export controls can be  difficult for Congress to gain access to for oversight purposes.\n\nLast Congress, the Foreign Affairs Committee worked persistently…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690696/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…why my RED TAPE Act is critical. My bill  ensures that Agencies can no longer manipulate a cost-benefit analysis  to push their own agenda. It requires Agencies to prioritize data- driven, measurable economic benefits, not vague ideological  justifications.\n\nWhile some Federal employees complain about the new directives from  the Trump administration,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688158/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "French Hill", "party": "Republican", "sentence": "…to establish a pilot program under which it       could license private firms to conduct small financial       transactions with sanctioned entities in order to collect       data and intelligence on those entities. Those transactions       might otherwise be prohibited because some parties to the       transactions are subject to sanctions. The bill…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693944/ofac-licensure-for-investigators-act"}]