[{"senator": "Brian Schatz", "party": "Democrat", "sentence": "…needed to convert natural  gas into electrons--there is a huge backlog of them.\n\nSo we have an industrial renaissance happening in certain States, and  we have all of this AI data center load coming up, and we have your  normal American economy stuff happening. There are not enough electrons  on the grid.\n\nWhat happens when there is not enough of something?…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699020/energy-costs"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…expanding dramatically, and utilities are investing  billions of dollars in transmission upgrades.\n\nFor example, in PJM, $4.3 billion in transmission costs associated  with data center growth were passed to ratepayers. An additional $7.3  billion in increased generation costs were recorded.\n\nWithout guardrails, households and small businesses are subsidizing…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700230/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…a way to take current coal technologies and make them cleaner  and more useful--canceled; enhancing energy resilience--canceled;  hydrogen deployment--canceled; reducing data center load impacts-- canceled; methane reduction--canceled; other projects to do carbon  capture and storage--canceled.\n\nThe President has canceled 20 projects just in Virginia,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…highest rates  in the Nation with some of the most unreliable services.\n\nDo you like clean water coming out of your taps at affordable prices?  So do I. You better hope a data center doesn't get built near you.\n\nDo you like breathing clean air and being outdoors? I do. Organize  like hell to keep these extremely loud data centers and their emissions…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697553/protecting-michigan-communities-from-data-centers"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…going up big time, and  they are going up for deliberate reasons.\n\nThe one deliberate reason has to do with the AI, crypto, tech bros  data centers problem.\n\nAs you know, the data center crypto people gave a lot of money to  Donald Trump. They are big political donors. They are getting pretty  much everything they want from this administration. In return,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…It puts an end to price gouging because  utilities shouldn't profit while you are struggling.\n\nIt makes sure that places like data centers cover their own costs,  and if a data center opens in your area, that doesn't mean that the  costs are pushed onto your household. It gives a voice to the American  people and makes sure they are consulted when new…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700229/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…State and many other Western  States. We are proud to power the Nation and to support a President who  supports us.\n\nWith the rise of artificial intelligence and a thriving data center  industry, our Nation will need all the energy it can get. I was out in  California during October and went to AI companies--large, medium, and  small--and they all told…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…see that retiring  power plants outpacing new generation is a problem.\n\nThis is especially concerning for my district and central Ohio, which  has become a national hub for data center construction. These new  facilities are at the heart of powering the AI revolution, but we must  now figure out how we can power them while ensuring our constituents  have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695755/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…economy through the use of a       trans-Atlantic submarine fiber optic cable described in       subsection (a);\n\n(7) the value, cost, and feasibility of establishing a data       center and high-security cloud services facility, with       independent power generation, in the United States Virgin       Islands for communications of the United States…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692701/assessment-of-trans-atlantic-submarine-fiber-optic-cable"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…this country that is being driven even more by AI and  data centers with unimaginable amounts of energy required for these  facilities.\n\nI heard about the announcement of a data center that would require  the amount of electricity to run the city of Denver five times over in  a year. One data center needs that much energy.\n\nWe see electric prices increase…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…offensive cyber operations.\n\nUnder this bill, if a Chinese firm would like to rent access to a  cluster of advanced chips already subject to U.S. control in an  overseas data center, the Department of Commerce can require a license  if determined that remote access is a risk to U.S. national security.\n\nPut simply, if the U.S. has the authority to prohibit…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698858/remote-access-security-act"}]