[{"senator": "Sarah McBride", "party": "Democrat", "sentence": "…just three teachers in the entire  Nation to receive the American Civic Education Teacher Award.\n\nIn her classroom, Ms. Parks is teaching young minds more than just  facts and dates, but the strength and power of our democracy. This  honor recognizes educators who spark curiosity about the Constitution,  government, and civic life.\n\nAt Milford High School,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696940/recognizing-shae-parks"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…100th season.\n\nAs the second oldest continually operating community theater in the  State of New York and a part of the Little Theatre Movement in America,  their rich history dates back to 1925, with their opening performance  at the Historic German House in Rochester, New York.\n\nToday, the group performs throughout our city, providing  opportunities…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689016/congratulating-rochester-community-players"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…letter by July 7, 2025, and advise  me of the State's intention to bring its current redistricting plan  into compliance with the U.S. Constitution.''\n\nLet's focus on these dates for just a second. The date of July 7, the  date of the letter, and the request for the response is the same date.  It can be said maybe this was a mistake and they meant to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…90 percent of Democratic amendments have been rejected.  A big chunk of Republican amendments have been rejected. I am sorry  that Republicans' rank and file are such cheap dates when it comes to  legislating, but they cave all the time and they vote for these crappy  rules that are totally closed, so that is a bunch of bullshit. Let's be  honest. That…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Archbishop of the 2000-year-old Church founded by the Apostle Andrew.  He holds the historic title of Archbishop of Constantinople-New Rome  and Ecumenical Patriarch, a position that dates back to the sixth  century. A citizen of Turkey, he studied in Imvros, Istanbul, Rome,  Switzerland, Munich, and Athens, where he earned his doctorate in Canon  Law and helped…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695368/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…of leaving, but I can't go back to Haiti. Can you please help       me find another country to go to? I don't know if I will be       able to sell my home before the due dates. I don't know what       to do for my son. Please help me.''\n\nAnother constituent asked our office, ``Do you think I       should remove my money from the bank?''\n\nThese are…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…commission set out to collect sensitive, private voter information from  every State, demanding that States hand over not just the names of  every voter on the voter rolls but their dates of birth, their voting  history, their Social Security information, and more.\n\nIt was a blatant power grab, long before Elon Musk started tapping  into Federal servers, by…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…interests in approximately 8.43 acres administered by the  Bureau of Land Management in Sacramento.\n\nDevelopment at this site is currently hindered by reversionary  interest that dates back to the 19th century. The original conveyance  of this land from the Federal Government stipulated that it must be  used for specific stated purposes or ownership would…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691118/reversionary-interest-conveyance-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…cash-bail jurisdictions in       the country. Ninety-two percent of people released pretrial       in D.C. remain arrest-free before trial, 87% appear for their       court dates, and 86% complete the pretrial period without any       compliance violation.\n\nH.R. 5214 would replace D.C.'s current risk and safety       based system with a cash bail system…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696949/opposition-letter-led-by-the-american-civil-liberties-union-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Administration has said that Elon Musk  and his DOGE gang copied a mainframe database containing the personal  information of hundreds of millions of Americans, including names,  birth dates, addresses, and more. In fact, if you step back, DOGE has  pilfered information from every Federal Agency, and we are in a  situation where I believe Trump is prepared to weaponize…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696343/trump-administration"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…be these families across the Midwest, and the Trump  administration looks to force the old, uneconomical fossil fuel plants  to continue operating past their plan retirement dates nationwide. We  estimate that this looks like the cost to the consumer could reach $3  billion a year by 2028.\n\nPeople can't afford that, and they don't deserve that. Don't…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695767/national-coal-council-reestablishment-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Federal or State law, other       than State offenses for which an essential element is the       alien's immigration status, for which the alien was convicted       on different dates for each of the 3 offenses and imprisoned       for an aggregate of 90 days or more;\n\n(D) the alien--\n\n(i) has been admitted to an institution of higher       education;\n\n(ii)…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…able to follow through with a  host of different items for this building that was built in 1760,  involving the community and activities at that site: celebration of  historic dates, fairs and festivals, and important seminars.\n\nThis month, in concert with the Village of Port Chester and  Westchester's Revolution 250, the society cosponsors An Evening…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698776/recognizing-national-blood-donor-month"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "Mr. SCHMITT. Mr. President, this November marks two very special  dates for our great country. Our Nation comes together every November  11th to celebrate Veterans Day, in recognition of the exemplary and  selfless work put forth by those who have…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698198/recognizing-veterans-day"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…was  used back in 1926. This bill puts strict design parameters around the  new $2.50 coin  to continue that tradition. The only changes that will be made are to  update the dates to reflect and celebrate another century that has  passed since this coin was put into circulation 100 years ago.\n\nAs America marks its 250th anniversary this year, the coin…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699869/for-americas-250th-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…fiscal year  actually got slightly better, but we also rolled some of the borrowing  into the next day, which hit a new fiscal year. It happens all the  time. You have strike dates of when you can actually pay certain bills,  Mr. Speaker, but this one isn't in question. Last year, for every  dollar of tax receipts we took in--this is customs duties. This…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…participant's       profession at a Department facility with the highest need, as       determined by the Secretary, by not later than 90 days after       the later of the following dates:\n\n``(A) The date on which the participant completes the       course in the Scholarship Program.\n\n``(B) The date on which participant obtains all required       licensure,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695434/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…They will not wait. Veterans will not be forgotten. We are going to  drain the VA swamp one regulation at a time.\n\nOur bill also requires an annual report to Congress on hire dates and  placement rates. Transparency generates performance.\n\nWe are not just addressing the issue today. We are ensuring  bureaucrats cannot hide and escape tomorrow.\n\nTo those…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695432/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Convention Corporation, he successfully bid for and  coordinated American Legion conventions for fourteen consecutive years.  In this role, he also secured future convention dates in Sault Sainte  Marie, ensuring the continued success of these important gatherings.\n\nHis commitment extends beyond organizational leadership. As Commander  of Post 44, Mr.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694083/recognizing-raymond-e-carlson-as-the-2025-upper-peninsula-veteran-of-the-year"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…31 are somehow  now by legislative decree not days.\n\nNow, I had actually voted against this very same provision in  November when the only thing that was different were the dates. As a  matter of fact, there were enough votes to stop that rule from taking  effect when we originally voted on it in November, but then there was a  huddle among House leadership…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…like Denmark, which is  investing billions of dollars in its own capabilities in the region.\n\nAmerica's recognition of Denmark's political and economic interests  in Greenland dates all the way back to World War I. The Danes have been  close partners in the Arctic since World War II, and brave Danish  soldiers fought and died in America's wars in Afghanistan…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  National Milk Day, which we celebrated yesterday.\n\nNational Milk Day dates back to January 11, 1878, to commemorate when  milk was first delivered in glass bottles.\n\nMillions of Americans drink milk. It is a delicious and refreshing  beverage that…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698847/national-milk-day"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…this one simple  question: When an Agency says it is a rule, is it a rule? It has been  every other time until this time.\n\nWe clarified that one question. It didn't change the dates of the  Congressional Review Act. It didn't change the process. It answered one  question that, apparently, was in dispute that was never in dispute  before but now appeared…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691634/congressional-review-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…of  universities across the U.S. for its commitment to serving our  servicemembers, veterans, and their families.\n\nUND's leadership reflects a long tradition of service that dates back  to its founding. This gold recognition marks a proud milestone,  especially with more than 2,000 military-affiliated students enrolled  this year.\n\nFrom peer-to-peer…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697044/recognizing-university-of-north-dakota-upon-earning-gold-award"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…past 150 years. The hard  work and spirit shown by generations of village residents have made  Tontogany an outstanding example of American ingenuity.\n\nTontogany's long history dates back to the first settlers to settle  in the area, Samuel and Eliza Hamilton. The village's name comes from  the Ottawa Native American Chief Tondoganie. When it was officially…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694722/recognizing-the-village-of-tontoganys-sesquicentennial"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…eight-acre  property in Sacramento recently discovered a reversionary interest on  their land, which a railroad company originally conveyed. The  reversionary interest, which dates back to the days of the  transcontinental railroad in the 19th century, requires the land to  revert to ownership by the United States since it is no longer used for  railroad…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691119/reversionary-interest-conveyance-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Georgia. Mr. Speaker, I rise here today to recognize  the monuments being dedicated to the ancient Scottish Rite Valley of  Savannah, Georgia.\n\nThe birth of the Scottish Rite dates back to 1801 when the Supreme  Court of the 33rd Degree for the United States of America and the first  Supreme Council in the world was established.\n\nThe Scottish Rite of…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699709/retirement-of-judge-ronnie-fender"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…political gains using the  American people as collateral.\n\nIt is worth reiterating. Democrats funded temporary Band-Aids to  cover up unaffordable care. They set the expiration dates. They chose  to fund liberal priorities instead of making them permanent.\n\nWhile Democrats continue to fearmonger, I want to shed light on what  Republicans are doing to fix…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}]