[{"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…Archbishop of the 2000-year-old Church founded by the  Apostle Andrew. His formal office is Archbishop of Constantinople-New  Rome, and Ecumenical Patriarch, a historic title dating to the sixth  century.\n\nThe role of the Ecumenical Patriarch as the primary spiritual leader  of the Orthodox Christian world and transnational figure of global  significance…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695051/recognizing-his-all-holiness-bartholomew"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…MA, and I am       here in strong opposition to the termination of TPS for       Haitians.\n\nHaitians have a long and proud history of commitment to the       United States, dating back to the Chasseurs--Haitian soldiers       who fought alongside U.S. forces during the Revolutionary       War. Since then, more than one million Haitians have made…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Review Act that it represents.\n\nAs you have heard today, the Boundary Waters Canoe Area Wilderness is  an American treasure with a strong, nonpartisan history of protection,  dating back to 1909 through treaties with Canada and to 1964 with the  Wilderness Act, which passed with overwhelming bipartisan support back  when we had great conservation champions…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…grew up in California. I have lived there since I was 11 years old.  I saw the smog days, and I knew the haze that had come to define our  cities and skies for a generation dating back to the first automobile  boom of the post-war era. I remember all the smog alerts, days you were  warned not to go outside.\n\nIt is no surprise that that smog at the time…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…about what the Trump  administration is doing on Afghanistan because they won't tell us. The  State Department has ignored multiple bipartisan requests from this  committee, dating back to February, for more information about the  deals it is making with the Taliban and the Haqqani Network. Despite  the fact that the Republican-led Congress enacted a…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692739/no-tax-dollars-for-terrorists-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…when you  count both passengers and cargo traffic. After the government reopened,  I went to O'Hare, and I met with the air traffic controllers. I have  known them for years, dating back to the first government shutdown  during President Trump's first administration.\n\nThere are roughly 10,500 air traffic controllers nationwide in  America. We need 14,000.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697201/air-traffic-controllers"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…of Erin Kolodjeski,  Laurie Mignone, Ed Etzkorn, and Jenn Miller. A most big thank you to  our subcommittee chair, Mario Diaz-Balart. We have known each other for  decades, dating back to our time in the State legislature. I am  grateful for his fine leadership and friendship.\n\nMr. Chair, this bill reflects what I believe most Americans want from  their…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. Speaker, I rise to speak in support of H.R. 2481, the Romance  Scam Prevention Act.\n\nAs more consumers report using online dating services, it is  important that they are made aware of potential harms. This bill  ensures that when an online dating service bans a user for fraud, it  notifies all the other…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692728/romance-scam-prevention-act"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…Archbishop of the 2000-year-old Church founded by the  Apostle Andrew. His formal office is Archbishop of Constantinople-New  Rome and Ecumenical Patriarch, a historic title dating to the sixth  century. The Ecumenical Patriarch received his elementary and secondary  education in Imvros and Istanbul. After completing undergraduate  studies at the historic…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…systems. And for  people who live in rural, as well as urban areas, your clinics and your  hospitals are shut down. Why? Because the Republicans have been after a  challenge dating back to the 1960s when the Medicare program was put in  place to eliminate the government's operations there.\n\nThere is still time to avoid this crisis, and today, this House,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698666/protecting-healthcare-for-millions-of-americans"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…legislation would redesignate the Salem Maritime National Historic  Site in Salem, Massachusetts, as the Salem Maritime National Historical  Park.\n\nKnown for its rich history dating back to the colonial era, this area  was the first historic site to be included in the National Park System  in 1938. Today, the historical park includes 12 historic structures,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691015/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…otherwise, for U.S. military  intervention in Greenland. Greenland has been not only a partner but a  faithful partner. They have been an ally and a friend to the United  States, dating back to World War II. At that time, it played a pivotal  role in the Allied victory.\n\nTo this day, they continue to be that staunch ally. As I mentioned,  they have been hosting…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Pennsylvania. Mr. Speaker, I rise today to recognize  Centre Safe which celebrates 50 years of providing confidential and  professional services for victims and survivors of domestic, dating,  and sexual violence.\n\nCentre Safe began as a grassroots effort in 1975 as the Centre County  Women's Resource Center. Since then, it has grown from a one-room  operation…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693919/recognizing-centre-safe"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…and they did so in  an effort to intimidate, to smear, and to discredit brave and patriotic  whistleblowers. This has now become a pattern of conduct by the New  York Times, dating back to articles starting in 2023.\n\nOn January 30, 2025, Alan Feuer and Adam Goldman mischaracterized my  and Senator Johnson's Arctic Frost disclosures by saying ``messages…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…The match is       remembered as a ``miracle'' as collegiate ice hockey players       defied expectations in defeating a Soviet team that won 4       consecutive gold medals dating back to 1964.\n\n(5) Team USA defeated Finland 4-2 in its final game to win       the gold medal, its first gold medal since 1960 in men's ice       hockey.\n\n(6) Herb Brooks,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695439/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…adjacent to the Alpine Community  Cemetery, preventing the need for members of the community to be laid  to rest in a distant cemetery.\n\nThese communities have storied histories dating back to the pioneers,  and they deserve to lay their loved ones to rest in a place that means  so much to them.\n\nMy primary objective as a public official is to remain principled…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691143/apache-county-and-navajo-county-conveyance-act-of-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…viewers. The match       is remembered as a ``miracle'' as collegiate hockey players       defied expectations in defeating a Soviet team that won 4       consecutive gold medals dating back to 1964.\n\n(5) Team USA defeated Finland 4-1 in its final game to win       the gold medal, its first gold medal since 1960 in men's       hockey.\n\n(6) Herb Brooks, the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690279/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…demand. More than 100  children are currently on the waiting list due to space constraints in  the existing facility.\n\nUnfortunately, lingering Federal interest in the property dating back  to the city's involvement in the Federal Lands to Parks Program decades  ago has impeded progress on an exciting renovation project for the  local Boys & Girls Club.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697652/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "David Valadao", "party": "Republican", "sentence": "Mr. VALADAO. Mr. Speaker, I rise to urge support for my bill, the  Romance Scam Prevention Act. Every year, millions of Americans from all  ages and backgrounds use dating apps and websites to make connections.\n\nFor many, online dating has made it easier to build relationships.  Unfortunately, there are countless stories of criminals using these…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692729/romance-scam-prevention-act"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…they  moved his young family to Southern California. There, he worked for  local dairymen and eventually entered the dairy business himself-- continuing the family tradition dating back to the 1600s.\n\nIn 1994, George Atsma began his own dairy legacy when he started  building his own herd in Tipton, California. A few years later, he  purchased property…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698674/recognizing-the-atsma-family"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…years. Since 1972, that is what we have  done: print a hardbound version of CONAN every 10 years and a  paperbound supplement every 2 years.\n\nCONAN obviously has a rich history, dating back over two centuries.  Nothing about H.R. 1234 erases or changes this history.\n\nThe Constitution provides the framework for our government, and  understanding that framework…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689324/repeal-requirement-for-congressional-research-service-to-prepare-annotated-constitution-and-supplements-in-hardbound-version"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…he found  out that 1 million mothers were spared the agony of post-abortion pain,  and 1 million children were alive and well, growing up, going to  school, playing sports, dating, marrying, and having kids of their own.\n\nToday, that number is estimated at over 2.6 million children not  aborted, all because abortion subsidies have been prohibited by…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…life since the war ended--a life guided by faith,  full of achievements and friendships, and, as the Bible says, years.\n\nThere have been many great generations of Americans dating back to  our founding, and I trust there will be many more. The patriotism and  humility of one inspires the next. So let's continue to cherish and  honor our ``greatest generation''…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695668/cloture-motion"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Guard Academy, including chaplains, with respect to sexual       harassment and sexual violence prevention, response, and       recovery.\n\n(6) Measures to promote awareness of dating violence.\n\n(7) A delineation of the relationship between--\n\n(A) cadet advocacy groups organized for the prevention of,       response to, and recovery from sexual harassment…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…over 103,000 Americans on the national organ transplant  waiting  list. We should have confidence that our organ transplant system is  efficient and fair. Sadly, my oversight dating way back to 2005 has  uncovered decades of corruption and mismanagement in this donation  system. It has left vulnerable patients to die on waiting lists while  unused organs…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690102/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}]