[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…timely care  from an EMS team can be the difference between life and death.\n\nSince 2014, Evergreen Fire/Rescue (EFR) has been honored with this  award four times. EFR Chief Dave Montesi attributes the team's success  to their experienced paramedics, most of whom have more than 20 years  of experience in the field. Evergreen's rural geography presents…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694726/recognizing-evergreen-firerescue"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…PAPPAS. Mr. Speaker, I rise today to honor the career of David  Caron as he retires after over eight years of service as Town  Administrator of Derry. Throughout his tenure, Dave has been a  tremendous public servant in his role, overseeing all the day-to-day  operations of Derry Town Departments.\n\nDave has managed numerous projects to improve the lives…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691563/recognizing-the-retirement-of-david-caron"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…needs a civics lesson that the rest of us received as kids watching  Saturday morning cartoons with our mouths full of Corn Flakes.\n\nToday, I am proud to join Representatives  Dave Min and Eugene  Vindman and 30 cosponsors in introducing the Protect Our Constitution  and Communities Act. It is just a bill on Capitol Hill, but it offers  an opportunity…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691336/pocca"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, today, I rise to recognize Akron Fire  Department Lieutenant Dave Ewers, retired Akron Firefighter Mark  Harper, and Lynx EMS worker Dominic Bagnoli as Ohio's 13th  Congressional District champions of the week.\n\nLate last year, a man went…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699148/champions-of-the-week-dave-ewers-mark-harper-dominic-bagnoli"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…Congressional District. Their  dedication to promoting democracy is to be commended. I recognize  Sharon Billings, Caitlin Cahill, Keith Engel, Aditi Ginuga, Anne  Leland, Cathy Olson, Dave Olson, Paula Ramaley, Cole Roepke, Adaline  Shinkle, Brad Shinkle, Diane Sjolander, and Anita Smithson.\n\nThe people of Minnesota's Third Congressional District are fortunate…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689743/recognizing-constituents-of-minnesotas-third-congressional-district-for-their-work-in-promoting-democracy"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…on tips  permanent and to close loopholes that are in this one big, ugly bill  were dismissed out of hand.\n\nAmendments introduced by Ranking Member Huffman, Andrea Salinas,   Dave Min, Emily Randall, and others protecting public lands were  dismissed out of hand.\n\nAmendments on energy introduced by Members like Luz Rivas were  dismissed out of hand.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…congratulate Ms. Dully on this honor. I have no doubt  that she will represent our State well in the National Teacher of the  Year award program.                          Recognizing Dave Chenevert\n\nMr. MAGAZINER. Mr. Speaker, I rise today in honor of Dave Chenevert,  who is retiring after 14 years as executive director of the Rhode  Island Manufacturers Association…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697432/recognizing-sarah-dully-rhode-island-teacher-of-the-year"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…remains at the center of our Nation's growth,  especially as we enter a competitive race with China to dominate  artificial intelligence.\n\nLast week, President Trump and Senator Dave McCormick hosted an  inaugural Pennsylvania Energy and Innovation Summit in Pittsburgh to  highlight how Pennsylvania will lead in the AI revolution. During the  summit, President…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693885/unleashing-american-energy"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…this bill onto the floor today.\n\nFinally, I thank the players of the ``Miracle On Ice'' team: Bill  Baker from Grand Rapids, Minnesota; Neal Broten from Roseau, Minnesota;  Dave Christian from Warroad, Minnesota; Steve Christoff from Richfield,  Minnesota; Jim Craig from North Easton, Massachusetts; Michael Eruzione  from Winthrop, Massachusetts; John…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690280/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "Mr. FINSTAD. Mr. Speaker, I rise today to recognize Sheriff Dave  Lange, who is retiring this month after a nearly 40-year career in law  enforcement, including 29 years with the Nicollet County Sheriff's  Department.\n\nA proud son of southern…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698459/recognizing-sheriff-dave-lange"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…Jalkanen, Lauren Johnson, Katie  Karam, Greg Lilly, Eric Lofgren, Katie Magnus, Jonathan Moore, Katie  Stanton, Sophie Schloegel, Mike Tokar, Eric Trager, Adam Trull, Mike  Urena, Dave Vasquez, Christina Sandstedt--who has been give privileges  of the floor this very day--Julia Wood, Terry Miller, Emily Yetter, Dan  Hillenbrand, Beth Spivey, Brendan Gavin,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698257/nominations"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…and in the public sector. After  graduating from Millersville University, Mr. Butler worked as Manheim  Township's Director of Zoning and Planning, Director of Planning at  Dave Miller/Associates, and Assistant Township Manager in East Donegal  Township. In 2009, he was promoted to Township Manager, where he has  served East Donegal since.\n\nDuring his…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687958/congratulating-jeffrey-butler-on-his-retirement"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Pennsylvania. Mr. Speaker, I rise today to recognize the  great work being done at Letterkenny Army Depot in Chambersburg,  Pennsylvania.\n\nRecently, on a visit there with Senator Dave McCormick and Depot  Commander Colonel Lewis, I was able to see firsthand how the Army depot  works every day to support our warfighters.\n\nSince assuming command in July, Colonel…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697690/letterkenny-army-depot-plays-important-role"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…in the field, I  congratulate Mary on a well-deserved retirement. I wish her the best as  she begins the next chapter of her life.                              Congratulating Dave Preisler\n\nMrs. FISCHBACH. Mr. Speaker, I rise to congratulate Mr. Dave Preisler  on receiving the Minnesota Pork Board's Distinguished Service Award.\n\nFrom a childhood in 4-H…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689397/congratulating-mary-gislason"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "Mr. STRONG. Mr. Speaker, I rise today to honor a remarkable citizen,  Mr. David Cook of Huntsville, Alabama, on his well-deserved retirement  from Torch Technologies. Dave Cook's distinguished career is a powerful  testament to the American dream, and a lifetime dedicated to the  service and protection of our Nation.\n\nDave began his service to…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697622/congratulating-mr-david-cook-of-huntsville-alabama-on-his-retirement"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…investigation can be put to rest quickly along with       the remainder of Jerome Powell's term. We need to restore       confidence in the Fed.''\n\n--NOTUS article, 1/12/26\n\nSenator Dave McCormick:\n\n``I believe strongly in an independent Federal Reserve,''       he said. ``I also agree with President Trump that Chairman       Powell has been slow to cut interest…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…appeared to be motivated by the defendants'  desire to make money and to keep their jobs and was not an effort to  influence the election, so said the Pennsylvania Attorney General Dave  Sunday. It really doesn't matter what the motivation is. What matters  is the result--fraudulent voter registrations.\n\nBack in 2008, there was an organization called ACORN.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699945/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…farming at two years old from his father, John Sola. As a high  school student, he rented his first twenty acres of land as part of a  Future Farmers of America (FFA) project, and Dave Linder from Linder  Equipment financed his first tractor and disc. He later served as FFA  president during his senior year and earned his FFA State Farmer  Degree. Mr. Sola…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697013/recognizing-vincent-sola"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…heartbeat of our rural  communities. Her dedication reminds us all of the difference one person  can make when they lead with heart and faith.                           Honoring Dave Blanchard\n\nMrs. FISCHBACH. Mr. Speaker, I rise today to recognize an outstanding  educator and mentor, Dave Blanchard, who was recently honored by the  Prairie Conference for…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699884/congratulating-ellen-lampton"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…of our closest allies in  the Pacific and is a strategic partner in our efforts to account for  missing servicemembers.\n\nOn this occasion, I would also like to thank Captain Dave Carey for  his special keynote address. Capt. Carey is a distinguished American  patriot and aviator who served as a U.S. Navy pilot in Vietnam. After  enduring nearly six years…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688919/recognizing-the-service-of-our-vietnam-veterans"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…fully qualified appointment to the U.S. Merchant  Marine Academy in Kings Point, New York.\n\nShe is the daughter of Amanda and Lucas Shipe and the granddaughter  of Kathie and Dave Olinger, as well as Patty and Larry Shipe.\n\nBryony is a senior at Commonwealth Charter Academy and is an  excellent example of a well-rounded student and active community  member.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691782/congratulating-lucas-gaston"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Walberg and  former Chairwoman Virginia Foxx; my co-lead, Congresswoman Kim Schrier,  who is a pediatrician; my Senate companion co-leads, Senators Roger  Marshall, Peter Welch, Dave McCormick, and John Fetterman; my staff in  my personal office and on the House Agriculture Committee, who have  worked tirelessly to advance this bill every step of the way,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698178/whole-milk-for-healthy-kids-act-of-2025"}]