[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…oftentimes have to commute an hour and a half.\n\nThe person who was guarding us--I was in the Gallery of the House of  Representatives--had an hour and a half commute each day--to and from  work. He had two young kids. And the last thing in the world he wanted  to do was to have to use his firearm in order to protect us. But it was  clear he was going to do…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698518/anniversary-of-january-6"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…mega-corporations, and they want your  children and your grandparents to pay for it. This isn't just about  politics. It is an attack on everybody who has to clock in and out  every day for work.\n\nYesterday, House Republicans wanted to forcibly remove me from a  committee for calling out this administration's grift, but they don't  have a single damned thing to…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688241/republican-hypocrisy-and-gop-budget-plan"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…killing thousands of       Americans each year. We need new treatments provided by       indirect costs to find these cures.\n\nIndirect costs, actually, directly funded my day-to-day       work, providing funds for building maintenance staff,       university shared resources, such as electron microscopes,       and common laboratory supplies, such as liquid…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…encyclopedic knowledge of parliamentary procedure.\n\nI thank Ray for his 13 years of extraordinary service. He is the  model of what it means to be a public servant, waking up every day to  work for the American people. We wish him all the best in his next  chapter.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699262/farewell-ray-salazar"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…a  gateway to the Nation's Capital, as well as the backbone that connects  East Coast passenger rail lines to the north and south. People rely on  Union Station every day to get to work and to visit the Nation's  Capital.\n\nDespite the vital role Union Station plays in the Nation's Capital,  it has not undergone major renovation since the 1980s. The USEP…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689966/introduction-of-the-union-station-redevelopment-corporation-funding-eligibility-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…at Lou Mitchell's.\n\nDonna Fenton is my personal friend, my wife's as well, and she is the  maitre d' at the breakfast restaurant. She is 94 years old. She never  misses a day of work. She is a wonderful person, a diehard Cubs fan who  wears earrings with the Cubs logo on them. I have taken her to games  over at Wrigley Field, and she, even at her age,…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…from New York (Mr.  Kennedy) for his comments.\n\nMr. Speaker, I have the opportunity and honor to serve with the  gentleman on the Committee on Veterans' Affairs. Every day, I see the  work that he does to uphold the work that is necessary to protect the  benefits of our veterans. I am so grateful for the ways that the  gentleman continues to show up for…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…unfortunately, when I was a younger man. The rules that are set up  are there to protect those who had the least ability to protect  themselves.\n\nA fair day's pay for a hard day's work. This is not a slogan. It is a  principle of who we are in this country. It is those values that hold  this country together.\n\nThis bill is pushing corporations to create…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698957/flexibility-for-workers-education-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…in person. What if a person lives in a rural  community and has to drive 100 miles round trip just to get to the  clerk's office?\n\nWhat if they can't afford to take the day off from work just to  register to vote?\n\nWho gets punished?\n\nThey are students, seniors, Americans with disabilities, and working  parents who just can't leave a shift early to stand…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…Americans.\n\nFaced with this impossible scenario, Mekhiya said that she may try to  work even more hours to make ends meet, but there are simply not enough  hours in the day to work much more than she already does.\n\nWe have the chance here in Congress to ease the immense burden being  carried by Mekhiya and the tens of millions more seeing a spike in…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698667/protecting-healthcare-for-millions-of-americans"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…regularly--customarily and regularly--receive more than  $30 a month in tips.\n\nYet, the bill we are considering today would allow employers to  measure a worker's tips over just a single day of work. Employers could  manipulate schedules and purposely choose to count days where workers  get more tips in order to pay them less.\n\nIn 15 States, that means even more workers…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698969/tipped-employee-protection-act"}, {"senator": "Greg Casar", "party": "Democrat", "sentence": "…bended knees and begging big corporations  for better treatment. We did it by unifying working people around some  central ideas that Americans deserve good pay for a full day's work and  that taxpayer dollars are meant for the common good, not for corporate  welfare.\n\nThose ideas brought workers together to win historic wage increases  and better benefits…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689085/economic-populism"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "Mr. ESTES. Mr. Speaker, I rise today to honor a friend and fellow  fiscal hawk on her last day of work, my district director, Debbie  Luper.\n\nHow can I possibly frame up the service and political activities of  Debbie Luper in one short floor speech? Her presence in Kansas…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690554/recognizing-debbie-lupers-tenure-as-district-director-for-the-fourth-district-of-kansas"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…prosecution where he was sentenced, Mr. Speaker, to 13 months. My  understanding is, he did 11 months and at the easiest time that could  be done. He walked every day during the day on the work-release  program.\n\nThat sweetheart deal, let me say, should be looked at. Now, to my  horror, who has come to light that should be looked at, what was their  involvement?…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696892/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "John Thune", "party": "Republican", "sentence": "…well,  saving farmers and ranchers from massive compliance costs.\n\nAnd we are even doing our part to keep the pheasant population in our  State strong. I come here every day to work for South Dakota, and we  have done a lot this year that South Dakotans can be happy about.\n\nBut it is not just my State. Republicans' agenda is supporting  Americans in…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698212/senate-accomplishments"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…to purpose-driven leadership, rooted in his  commitment to J&J's Credo, has greatly enriched Johnson & Johnson.\n\nHis commitment to improving healthcare goes beyond his day-to-day  work. Calvin serves on the Foundation Board of Overseers for the  Children's Hospital of Philadelphia, represents Johnson & Johnson on  the Healthcare Leadership Council as…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697247/congratulating-calvin-w-schmidt-on-his-service-to-johnson-johnson"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…have been exploited and expanded  beyond their initial intent, causing the cost of these programs to  skyrocket exponentially. If taxpaying Americans can get up every day  and go to work, why shouldn't we ask the same thing of those who  benefit from that generosity.\n\nOur bill requires able-bodied adults without kids too young for  school to work or…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692073/condemning-anti-semitism"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…better in a free market economy.\n\nI think people like being free better. When you talk about  testimonials in the old Soviet Union, Mr. Speaker, and probably to this  day because the work ethic hasn't changed enough, you run into a lot of  very unhappy people because they are stuck in an economic system in  which they have to work for the government.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…had enough. They posted this. These are several hundred  employees from the Minnesota Department of Human Services who  administered this program, who just get up every day and go to work and  do their job and want to help people. This is what they posted on  social media. I am quoting now:\n\nGovernor Tim Walz is 100% responsible for massive fraud in…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…led Upper Peninsula State  Bank with steadfast commitment to both customer service and community  engagement. His passion for serving his community extends beyond his  day-to-day work, as reflected in his advocacy for the industry at both  the state and federal levels. In addition to his role as President and  CEO, he serves as a Michigan Federal Delegate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695770/recognizing-mr-david-williams-for-receiving-the-best-community-banking-award-for-2025"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…Alaska remain at  the cutting edge of technology. Whether it is weather forecasting,  global communications, or national defense, our reliance on space  assets grows every day. The work done in Alaska ensures that America  remains a leader in this critical domain.\n\nMr. Speaker, space is the next great frontier, and America cannot  afford to fall behind.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687923/space-dominance"}]