[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…described as a decentralized  finance, or DeFi company.\n\nOn January 17, 2 days before the Presidential inauguration, President  Donald Trump launched his Trump memecoin. Days later, Melania Trump  launched her memecoin.\n\nOn March 25, 2025, World Liberty Financial launched a dollar-pegged  stablecoin just 1 week before the House Financial Services Committee…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…unilateral military  strike against Iran and notified the majority of Congress and the  American people, essentially, by tweet, using a social media post on  Truth Social.\n\nDays later, the world is in chaos because we have a President who is  acting unilaterally. Authoritarianism is on the rise across the planet,  and a region has been destabilized by…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692793/we-say-no"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…as a  receptionist. This President promised. He said, on day one, that he was  going to reduce the cost to American families and improve their quality  of life. Only, 100 days later, Americans have only seen reductions in  the stock market, in their 401(k)s, and a lowered respect for the  Constitution. What we have seen continue to rise, instead, are…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…sisters, and brothers  looked out across a vast ocean as Saigon was falling behind them. Among  them was Helen, my constituent, who watched as her aunt boarded a boat,  and days later she would also follow the path of Vietnamese refugees on  to San Jose in my district, which proudly boasts the largest population  of ethnically Vietnamese people of any…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690516/living-up-to-the-promise-of-america"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…no alternative delivery system. A       woman who had come with severe pneumonia had to be turned       away because the facility was shut down. And she died three       days later from pneumonia. Dr. Atul Gawande, former Assistant       Administrator for Global Health, USAID                 Malaria Deaths Are Increasing Unnecessarily\n\n``U.S. global…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…Denise and Aaron Quinn,  drugged and bound them, and kidnapped Denise. Muller then took Denise  to a cabin near Lake Tahoe where he sexually assaulted her and released  her 3 days later down in southern California.\n\nOf course, Aaron immediately called the authorities, but the Vallejo  Police Department was unable to solve the crime. This is after they  interrogated…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689139/recognizing-seaside-police-department-chief-nick-borges"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…White House denied it. They said it didn't happen. I said it  did. They said I am lying--to the point where two of my Republican  Senate colleagues went on television several days later and said that I  lied when I said the President made those statements.\n\nWell, yesterday at his rally in Pennsylvania, President Trump  admitted that he had used the slur…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697820/donald-trump"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…there was no money  to do so.\n\nHealthcare premiums have soared, and millions of Americans will lose  their healthcare coverage because they simply can't afford it.\n\nJust 3 days later, the President found money, a lot of money, to pay  for a very extensive and expensive military raid to capture the  President of Venezuela. This regime change and the nation…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698585/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…We got to  November 21, the last appeal day, no notice of appeal was filed. The  matter was settled; work could continue; and everybody was already back  at work.\n\nThirty days later, the 22nd of December, a new stop work order was  dropped by the Trump administration with no explanation.\n\nSo the first stop work attempt by the Trump administration had…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…onto the streets of select American cities. They pull up on people,  jump out with assault weapons, force them into unmarked cars, and  disappear them. Their families learn days later that their loved one  has been shipped off to a foreign gulag without presenting evidence to  a judge that they should be removed.\n\nTrump has done this to legal permanent…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692929/holding-power-accountable"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…assigned me an essay to write. The essay was simply to share  what I wanted to do after graduation, which was 3 months away.\n\nWhen I wrote the essay, she came to me several days later and told me  that she had read my essay and was very disappointed in what I wrote. I  thought she had problems with the style, or maybe I didn't get the  subjects and verbs…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…It is the Republicans, with their ``Big  Ugly Bill.''\n\nTrump returned to office promising to lower costs on day one--yet  another lie. It is not happening. More than 250 days later, Americans  are facing the fallout from this regime's reckless economic policies,  including the disastrous tariffs that are decimating small businesses.\n\nSo instead of actually…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696175/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…States stood in front of the American  people and said that he conducted an unauthorized military invasion of  Venezuela to save American lives from drugs, but then a few days later  told us it was actually about the oil?\n\nWell, if we needed any confirmation that it was not about the drugs  and not about saving American lives, look no further than the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699066/venezuela"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…in the seats over there who was a cancer survivor. He had  him stand up. He gave him a badge from, I think it was, Secret Service  and celebrated his survival. Just a few days later, the Trump  administration terminated research for pediatric cancer.\n\nWe have to find a way to make sure we don't lose the competition with  China. I just mentioned medical…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695606/devastating-harm-caused-by-trump-administration"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…because I  had health insurance, and I knew the health insurance would cover it.  If I didn't have health insurance, I probably would have had to wait  for that burn clinic 3 days later, and his second-degree burn probably  would have gotten infected.\n\nWe took the ambulance ride, and we got to the hospital. After that  and a week in the burn unit, the total…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…shocked the  world, defeating the Soviets in a stunning upset.\n\nIt wasn't just a hockey game. It was a symbolic victory for  democracy, resilience, and national pride.\n\nJust days later, they claimed Olympic gold for the United States.\n\nThese 20 young men reminded a shaken Nation that its greatest moments  weren't in the past. They were still within reach.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695439/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…school women's  and national women's 1-mile record for those under 20 years old of 4  minutes 23.5 seconds, only 0.04 seconds over the women's collegiate  mile record. Just 3 days later, she broke her own national high school  2-mile record by 17 seconds. She has also set national records for high  school women in the 2K, 3K, and 5K.\n\nForbes magazine recently…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692882/congratulating-jane-hedengren"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Waiver.--The President may waive the application of       sanctions under this subsection with respect to a foreign       person for renewable periods not to exceed 180 days if, not       later than 15 days before the date on which such waiver is to       take effect, the President submits to the appropriate       committees of Congress a written determination…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…to 633 in the bill. I even told her to simply read the  bill and not believe some of the statements she read in the media or  the scary texts that were coming out.\n\nA few days later, I heard back from her. She said: You were right. It  is in the bill. My son will still be protected.\n\nThat was a really happy day for me because people were seeing the…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693529/read-the-bill"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…On September 8, 2001, the USS Enterprise departed the Arabian Gulf,  bound for home with a scheduled port call in South Africa for the first  time in about 40 years. Just days later, while still south of the  Arabian Peninsula, those aboard the USS Enterprise watched in horror as  the tragedy of 9/11 unfolded.\n\nIn that moment, Commander Fecht's calm,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Bexar County Magistrate's Office--Bexar County is where San  Antonio is--issued a protective order against Poulos with instructions  not to contact the family members. Three days later and less than 24  hours before the January 22 shooting of seven San Antonio cops, Poulos  violated his protective order by visiting a prohibited residence and  threatening…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…second consecutive national  championship, dominating the field and finishing 46 points ahead of  their closest competitors. Their impressive victory continued just two  days later, as they claimed first place in the NJCAA Half Marathon  National Championship, a historic feat for SLCC and a significant  milestone in women's athletics at the college.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690034/recognizing-the-slcc-cross-country-team"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…at him, forcing his ladder to tip and causing him  to fall. Michael suffered a severe spinal cord injury, and despite  efforts to save him, he tragically passed away a few days later.\n\nHis passing affected his family profoundly and reverberated  throughout the communities he touched.\n\nMichael was renowned for his kindness, generosity, and selflessness,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692746/awning-safety-act-of-2025"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…ROD,  over Glen Canyon Dam's long-term experimental management plan  supplemental EIS this past summer. It was signed on July 5, 2024, with  implementation beginning just 3 days later on July 8. Pretty doggone  quick.\n\nThe ROD calls for higher flows at the dam to combat the presence of  predatory smallmouth bass which threaten the federally protected…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691059/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…clinical practice of such participant's       profession at a Department facility with the highest need, as       determined by the Secretary, by not later than 90 days after       the later of the following dates:\n\n``(A) The date on which the participant completes the       course in the Scholarship Program.\n\n``(B) The date on which participant obtains…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695434/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…blue  jersey with ``USA'' on the front.\n\nTen days before that game, Madam Speaker, they had an exhibition  game, and they were blown out at Madison Square Garden. Yet, a few days  later, Herb Brooks had them ready. They were conditioned. They were  ready. They played as a team. Movies were made about it.\n\nGrowing up in Duluth, I had the privilege of watching…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690280/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…unimaginable. The hostages have been subjected to inhumane conditions,  deprived of their basic human rights, and used as pawns in the cruel  game of manipulation.\n\nNow more than 500 days later, Hamas is still holding dozens of  hostages captive, including five Americans. Of the  five Americans in Hamas's captivity, four have been confirmed to have  been murdered.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688469/hamas"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Mexico mentioned the government shutdown. I  would like to remind the gentlewoman from New Mexico that she voted to  shut the government down. Then, she had an opportunity 43 days later to  reopen the government, and she voted against reopening the government.  That is something that I think she must have mistakenly omitted from  her remarks.\n\nAgain, we…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696981/district-of-columbia-cash-bail-reform-act-of-2025"}]