[{"senator": "George Whitesides", "party": "Democrat", "sentence": "Mr. WHITESIDES. Mr. Speaker, my name is George Whitesides, and I  represent California's 27th Congressional District.\n\nJust 3 days after I was sworn in to Congress to serve my first term  this year, wildfires broke out across southern California, forcing  200,000 people to evacuate, burning over 57,000…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689808/cuts-to-forest-service-endanger-millions"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "Mr. NEGUSE. Mr. Speaker, 2 days ago a heinous and horrific act of  terror took place in the district that I represent in Boulder,  Colorado.\n\nAs families gathered on the idyllic Pearl Street Mall, a group…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691842/in-memory-of-recent-gun-violence-victims"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "Ms. SEWELL. Mr. Speaker, I rise today in strong opposition to this  bill.\n\nIn a matter of days, roughly 130,000 people in my home State of  Alabama will lose their healthcare coverage because Republicans in this  body refuse to extend the ACA tax credits. Millions of…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698384/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…healthcare costs down or are they going to sabotage our healthcare  system and send premiums through the roof? That is what is at stake  when the Senate votes tomorrow.\n\nWe have 21 days until January 1. After that, people's healthcare  bills will start going through the roof--double, triple, even more.  People will not be able to afford their healthcare. Millions…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697877/healthcare"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…congressional  leadership reached historic new lows in their inability to work in a  bipartisan fashion to meet the needs of the people who we were elected  to serve.\n\nFor 43 days, Speaker Johnson refused to come to the table and extend  the healthcare subsidies which will prevent premiums from skyrocketing  for the millions of Americans who get their…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697215/medical-bills-are-too-high"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…virtually nothing to show for American workers.  Donald Trump has changed his mind, once again, on his tariffs, with a  new ``deal'' with China to pause most tariffs for 90 days.\n\nSadly, it looks like China has, once again, gotten the better of  Donald Trump. They hardly had to give up a thing.\n\nIt is another example of Donald Trump's chaos. Trump has…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690986/tariffs"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…administrations. Yet, now that  President Trump is in office, this bill exists to help the President do  whatever he wants, even if it is unconstitutional.\n\nI get asked a lot these days about what is going to happen when this  President ignores the courts. Wouldn't we have a constitutional crisis  on our hands?\n\nMr. Speaker, this bill makes it easier for the…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689723/no-rogue-rulings-act-of-2025"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…small inconveniences. They shape every decision  families make about what they can afford. As people question whether  they can cover the basics, it affects how they plan their days, care  for one another, and participate in their communities. Something as  simple as sitting down together for a meal or planning a gathering can  become harder to manage.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696852/higher-costs-of-everyday-life"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…There  is one bill in this package that the overwhelming majority of our side  thinks should not be in the bill, but I remind my colleagues that bill  is funded for the next 10 days or 6 legislative days. During that  period of time, we intend to raise very substantial concerns about the  operations that are being carried out not only in Minneapolis but…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699570/consolidated-appropriations-act-2026"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…turkey processing  plant is. It is an incredible community.\n\nHere is a teenager in Willmar who is stopped by ICE. She is beaten.  She gets a concussion, and she is detained for 2 days, and she is a  U.S. citizen.\n\nSo imagine--it is hard to imagine this. But imagine you are in your  neighborhood, and there are those roving vans of Federal agents. They  have…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…understanding comes from a deep personal  philosophy, one taught to him by his mother, who gave him his unique  name, Mykul. He lives by the creed that the two most important days in  life are the day you are born and the day you find out your ``why''.  Officer Thomas found his ``why'' in uplifting others, and he lived it  every day at the gate.\n\nHis…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693669/recognizing-officer-mykul-thomas"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…this administration has done, but  what the majority in this body has failed to do: Hold Trump accountable  as the coequal branch of government that we are.\n\nIt has been 50 days since the people of Arizona's Seventh  Congressional District elected me to represent them; 50  days that over 800,000 Arizonans have been left without access to the  basic…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696711/welcoming-the-honorable-adelita-s-grijalva-to-the-house-of-representatives"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…line the pockets of people like Elon Musk.\n\nThis ruthless Republican budget will rip away healthcare from low- income and working families and children and take us back to the days  when if you got sick, you either went without treatment or went  bankrupt.\n\nIt could rip away resources from local schools and prevent children,  especially students with disabilities,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688036/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…normalizing the  threat of Nazism and White supremacy.\n\nThis policy has all the markings of a dog whistle. It is a ``stand  back and stand by'' in the form of an office memo. Not 4 days ago, 15  Jews were slaughtered in cold blood--a beautiful picture of a little  10-year-old girl celebrating the first night of Hanukkah--and a day  later, the Trump administration…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…equipment procured using       funds made available in this section in this or prior Acts:       Provided further, That the Secretary of Defense shall, not       less than 15 days prior to obligating funds made available in       this section, notify the congressional defense committees in       writing of the details of any such obligation: Provided…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693693/department-of-defense-appropriations-act-2026"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…of him. I am  incredibly thankful that he stuck it out because this entire body has  benefited from his public service and his expertise.\n\nJack has come a long way from his days as an intern. He went on to  serve as my legislative director in my congressional office. For the  last 6\\1/2\\ years, he has been with me at the T&I Committee, first as  deputy…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…approval. This is something that  is unacceptable, and my legislation seeks to change that.\n\nThe bill directs the Secretary of the Interior to approve a State's  SWAP within 180 days, once the Secretary determines the SWAP complies  with the requirements of the Pittman-Robertson Wildlife Restoration  Act. If the Department of the Interior fails to authorize…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697625/make-state-wildlife-action-plans-efficient-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…for the American  people. As we return to Washington, we are more determined than ever to  continue our work to enact commonsense policies that benefit all  Americans.\n\nIn the days, weeks, and months ahead, I can assure my colleagues more  stories of the benefits of the One Big Beautiful Bill Act will be  heard. The fear-mongering from the Democrats is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694791/promises-made-promises-kept"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…Instructions\n\nMr. Coons moves to recommit the bill H.R. 4 to the       Committee on Appropriations of the Senate with instructions       to report the same back to the Senate in 3 days, not counting       any day on which the Senate is not in session, with changes       that--\n\n(1) are within the jurisdiction of such committee; and\n\n(2) would prohibit the…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693657/hr-4"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…to deliver a message that under this President and  under the Congress that is here and under this leadership, we will  never allow Iran to have those nuclear weapons.\n\nThe days ahead will be scary because Iran has said that they will  respond. They should make no mistake: They mess with America at their  own peril.\n\nThe last thing I will say is this,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692703/thanking-president-trump-for-saving-the-world"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…reflects the values we hold dear in South  Carolina. I am grateful to Governor McMaster for standing firmly behind  them on this important mission.\n\nMr. Speaker, in the coming days, I will be introducing legislation to  ensure our guardsmen are better protected and supported, both during  deployments like this and beyond.\n\nGod bless our military. South…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…ranking member of my committee, the Appropriations  Committee, in the House.\n\nWe have had a lot of folks who have worked hard. We may have some  disagreements in the coming days. We probably will. I would be  surprised if we don't. But I know if we work hard, we can work through  them and get to a successful conclusion.\n\nMy friend, for instance, mentioned…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…remarkable milestone: the 250th  birthday of the United States Army. For 2\\1/2\\ centuries, the Army has  stood as a pillar of strength, sacrifice, and service. From the  earliest days of our Nation's founding to today's complex challenges,  Army soldiers have defended our freedoms, upheld our values, and  protected the American people with unwavering courage.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692323/taking-an-important-step-for-rural-america"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…Western North Carolina truly  special. It is exemplified by neighbors showing up in times of crisis,  ready to lend a helping hand and stand together during the darkest of  days. The Clay County Sheriff's Office deployed officers and resources  to Haywood, Buncombe, Avery, and Mitchell counties, providing critical  manpower and support to these Helene-affected…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693201/recognizing-the-sheriffs-office-and-emergency-medical-services-of-clay-county"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…support to both the firefighters and the  community.\n\nTogether with her husband Victor, she helped establish and run the  famous Fish and Chips at the Annual Wendelville Field Days and has  contributed to countless social and fundraising activities that sustain  the Wendelville Volunteer Fire Company. Her dedication has ensured that  the Ladies Auxiliary…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699525/recognizing-doreen-neilson"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…just off  base, misleading, and false.\n\nWarren Buffett has paid a record amount in taxes. I think that is  worth noting. That has been in the press very widely in the last few  days.\n\nThis budget framework delivers on House Republicans' and the  President's promise to minimize tax burdens for Americans across the  income spectrum, promote security in our…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688061/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Control  Act requires that Congress receive prior notification of certain  proposed arms sales as defined by that statute. Upon such notification,  the Congress has 30 calendar days during which the sale may be  reviewed. The provision stipulates that, in the Senate, the  notification of proposed sales shall be sent to the chairman of the  Senate Foreign…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699550/arms-sales-notification"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…is  located in an idyllic location, nestled at the base of the majestic  snowcapped mountains of the Wasatch Front.\n\nIts rich history is highlighted by the iconic Strawberry Days  celebration, which began in 1921 and remains the longest-running city  celebration in Utah. Each year, families gather to celebrate the city's  agricultural heritage with strawberries…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695307/recognizing-pleasant-grove-utah"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…migration, and H-1B visas to flood our  country with people who don't believe in it and have no intention of  assimilating into it.\n\nA new Muslim community in Texas, not even a few days old, with a  150,000-square-foot Muslim community center, was opened in Houston,  called EPIC City. It is in Plano, outside of Dallas-Fort Worth and it  has raised all sorts…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Control  Act requires that Congress receive prior notification of certain  proposed arms sales as defined by that statute. Upon such notification,  the Congress has 30 calendar days during which the sale may be  reviewed. The provision stipulates that, in the Senate, the  notification of proposed sales shall be sent to the chairman of the  Senate Foreign…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696897/arms-sales-notification"}]