[{"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…OMB is picking and choosing how appropriations laws are  implemented, they are right to be concerned.\n\nThis meeting has filled me with a renewed sense of optimism for the  days ahead, for it is clear that these young women and men are not  waiting for the future to arrive. They are shaping it. They labor to  build a society that is more just, more inclusive,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695393/recognizing-more-action-for-students-organization"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…in just the past 12 months.\n\nMy thoughts are with his wife, family, his many good friends, and  colleagues. I hope his memory brings comfort and strength in the  difficult days ahead.\n\nOfficer Facio's ultimate sacrifice, his courage, and his selflessness  will never be forgotten.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692251/mourning-loss-of-officer-gabriel-facio"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…for the country. We  look forward to continuing this discussion. And would the Senator  yield?\n\nMr. WYDEN. Would the Senator be willing to continue this discussion  in the days ahead? Because I think this has been extraordinary. It has  begun to lay out the implications of what this is really all about in  terms of authoritarianism. It is important for…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696341/trump-administration"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…they travel, to protect Americans now and in the future as we  address the issues of climate change and the enormous challenges, much  more will be said about that in the days ahead. It definitely should  be.\n\nMr. Speaker, I rise today to deal with a positive message. It is a  positive message that compares how Democrats would address the  challenges…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…Deluzio) for bringing us together today.\n\nOur antitrust laws are alive and well, but they could use an update,  and I look forward to working with everyone here today and in the days  ahead to make that dream a reality because it is core to the American  Dream.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689083/economic-populism"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…the President  seeks to cut funding, he must do so through proper channels: by coming  to Congress and requesting a lawful change.\n\nLet's be sure to remember that in the days ahead.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695661/healthcare-subsidies-and-rescissions"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…give  and take that has produced something that the vast majority of us can  and will vote for today.\n\nThis is eight bills into this process. We have a big job in the few  days ahead of us till the end of the month, but I share my friend the  ranking member's confidence that we can get that job done and that we  can be back here and find a way to put…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…deliver a message that under this President and  under the Congress that is here and under this leadership, we will  never allow Iran to have those nuclear weapons.\n\nThe days ahead will be scary because Iran has said that they will  respond. They should make no mistake: They mess with America at their  own peril.\n\nThe last thing I will say is this,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692703/thanking-president-trump-for-saving-the-world"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…your own money and remove the  red tape so you can thrive. We are blessed to live in the greatest  country in the history of mankind every single day. America's brightest  days are ahead of us, and I am grateful to have a Commander in Chief  who believes in the spirit and promise of America. He is a leader who  is working to make sure this beautiful country…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699279/highlighting-republican-successes-in-2025"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…take that  very seriously on this side of the aisle.\n\nIn just a few moments, we will remind the world why the American  experiment still endures today and why its best days are still ahead of  us.\n\nMr. Speaker, with the One Big Beautiful Bill Act we are going to make  this country stronger, safer, and more prosperous than ever before, and  every American…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…recovery of the  handful who were injured, and I think it is a proud day for the United  States.\n\nIt was a challenging decision, I am sure, to make, and there will be  many hard days ahead as Venezuela has to correct its course of actions.  And under President Rodriguez, hopefully, with the levers that are  available to the Trump administration and our friends…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…and to be able to serve our schools.\n\nThose are the role models that we need in a new generation. Those are  the folks that we look forward to seeing what they do in the days  ahead.\n\nAs fun as it is to me, students that are gathering this year are the  children of the first generation that gathered 35 years ago to start a  movement to be able to pray.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695773/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…their opportunities to find better insurance to be able to take  care of their healthcare.\n\nLet's increase competition, and let's increase options for  individuals in the days ahead; but in the short term, let's at least  get immediate assistance to those folks who need the help right now by  giving dollars to those individuals, not by sending cash to…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…let us remember Sarah Beckstrom's courage. Let us stand  with Andrew Wolfe as he fights to recover. Let us hold their families  close in our hearts during these difficult days ahead.\n\nMay God bless the Beckstrom and Wolfe families. May He watch over our  National Guard, and may He bring comfort and healing to all who are  hurting.\n\nMr. Speaker, may Specialist…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697294/national-guard-shooting"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…Court is the one who checks the executive branch,  not each district court around the country. It is the Supreme Court. We  need to be able get back to that process in the days ahead. That needs  to be done.\n\nSo I am looking forward to seeing Senator Grassley's legislation  actually move.", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691654/nationwide-injunctions"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…proposal. Stand up for the Constitution as  it has been implemented for over 250 years. And all of us pray for the  Iranian people and for our friends in Israel that better days are  ahead. And these better days only come with sacrifice.\n\nAnd as I speak, people in Iran are sacrificing because they just want  to live free.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693122/motion-to-discharge-sj-res-59"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…of you. He has a plan for me. He has a plan for every  member of my family, and He has a plan for every person who is watching  here today.\n\nI believe that His plan in the days ahead is that we do everything in  our power to deliver on the promise that the voters asked us to do in  November, and that is to Make America Great Again.", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689443/together-we-will-make-america-great-again"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…there, and I am  grateful to be able to see the chaos going down and the morale and the  enforcement going significantly up. That gap in the fence will be  closed in the days ahead. And as one of many requests the Border Patrol  has: just help us have a deterrent in this area so that we can better  patrol and be able to chase folks down that are violating…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "…condolences to his family, including his  wife and children. While Doug will be missed here, I can only imagine  how he will be missed at home. We will be praying for them in the days  ahead.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698713/9999"}]