[{"senator": "George Latimer", "party": "Democrat", "sentence": "…leadership of Abby Connett, in a new center designed  for their use, Dobbs Ferry Seniors serves hundreds of seniors annually  with a daily nutrition program at lunchtime 5 days a week and  activities and programs to engage seniors of all ages.\n\nThere are fitness classes daily, from tai chi and dance to chair yoga  and mental fitness programs; my favorite,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699710/saluting-scarsdale"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…are listening not  just with your ears but with your hearts.\n\nJavier Santana is 32 years old. He is a DACA recipient. He is deaf.  And he has been working at a carwash 6 days a week for the last 5  years.\n\nImmigration officials confiscated his identification. They  confiscated his cell phone. They proceeded to handcuff him, put his  hands behind his…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694421/daca"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…to the brink.\n\nI recently toured the Philadelphia International Airport and met  directly with controllers managing the skies above Delaware. They are  working 10-hour days, 6 days a week, making split-second decisions to  monitor thousands of lives at once. The pressure is relentless, and the  margin for mistakes is zero.\n\nOn top of all of this stress,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690741/united-states-postal-service-is-not-just-a-convenience"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…Shelley in Lake Holcombe, WI, who reached out to me  about her 17-year-old daughter Chloe. Chloe was diagnosed with leukemia  last October. Chloe receives chemotherapy 5 days a week, and her  parents drive her almost an hour each way to Eau Claire, WI, so that  she can get the treatments that she needs. Without Medicaid, the cost  of Chloe's treatment…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689511/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, the first 100 days. Well, this week,  President Trump marks 100 days as President. It has been 100 days of  hell for American families, for our economy, and for our democracy. The  start of Donald Trump's…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690262/trump-administration-first-100-days"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…appointments       was a skilled and compassionate person. Most of all, this man       respected and showed love for my dad. He lived an honest       life, worked 24 hours a day, 7 days a week--and performed a       job that was desperately needed. This man who kept my father       alive was an immigrant with temporary status.\n\nRemoving temporary status from people…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…countless children like him. Please do not allow that to       happen.\n\nMr. President, I can't tell you the number of parents I have met who  have spent 24 hours a day, 7 days a week in care of their own children  but who are able to do it because of the small payment that is made by  Medicaid. What are these parents supposed to do if this is cut? How…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…traffic  controllers who manage that airport is to work 6 days out of 7, 10  hours each day. So in one of the most stressful possible jobs in  America, they are working 6 days a week, 10 hours a day. The stress is  overwhelming.\n\nI told them that, with the closure of the government behind us, we  have to do something, and I hope we agree on a bipartisan…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697201/air-traffic-controllers"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…lets people know that loneliness and mental health affects  all of us.\n\nMr. Speaker, I also take this time to share the 988 lifeline that is  available 24 hours a day, 7 days a week. Help is available for everyone  who needs it.\n\nThis piece will be hanging in my Washington, D.C., office.\n\nMr. Speaker, in first place, from PUC Lakeview Charter High School…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692266/congratulating-californias-29th-districts-congressional-art-competition-winners"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…parents. I hear you. I hear you.\n\nCarole:\n\nMy son Jason is 41 and autistic. He has severe behavioral       issues. Medicaid has enabled my son to attend a day program 3       days a week. The program bills Medicaid for his       participation. We would not have the financial resources to       pay for my son's day program. Medicaid helps us to have our…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "…realize the snowflake thing was a problem.\n\nMr. Speaker, I don't know that anyone should lecture us on working.  The American people work harder than us. We are here only 3 days a  week. I mean, you want to talk about working, you guys are not even  showing up for your townhalls, so I don't know that you should be  lecturing us about working.", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689406/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…alcohol or go to a strip club in the physical world, why do we allow  them to be exposed to harms in the virtual space? They are exposed to  these same harms 24 hours a day, 7 days a week, 365 days a year.\n\nParents know that there are just as many dangers lurking online and  sometimes even more than there are in the real world, which is why 86  percent of…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…allow the  brothers to contact their mother, and he didn't enroll them in school.  Instead, the brothers lived in a trailer without heating or cooling.  The brothers worked 7 days a week until 10 p.m. and lived on one meal a  day. The brothers' sponsor also reportedly withheld the wages that the  brothers earned so that smuggling fees to get into this country…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699108/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…is  quick to offer a helping hand to anybody who needs one. John has been  volunteering with the Pasco Sheriff's Office since 2021. He usually  volunteers at least three days a week, as well as most special events  that the CSU is asked to help out with. John is relied upon throughout  the year to train new CSU members. During the year 2024, John provided…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690801/recognizing-john-wajdowicz"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…have 45,000 members combined. The Gulf  Cartel has 50,000 members. MS-13 has another 30,000. They are coming  across the Gulf constantly. Mr. Speaker, 365 days a year, 7 days a  week, they are coming to the United States of America with their  violence. That is the definition of ``imminent.''\n\nThese drug cartels are highly organized and militarized.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…so.\n\nMargaret and Art had three children: Robert, Ann, and Perry. After  the war, they owned and operated a drug store in Nampa, Idaho. Since  the drug store was open six days a week, there was no vacation time.  After three years they sold the drug store, and took a vacation for six  months in Corpus Christi, Texas. The family lived in a 16 ft travel…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690129/recognizing-the-108th-birthday-of-margaret-elizabeth-mortensen"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…times of need. The Ohio  Department of Mental Health and Addiction provides resources and  readily available services with their Ohio CareLine available 24 hours  a day and 7 days a week to offer emotional support. By simply dialing  988, anyone in our Nation can access the national mental health  hotline, which offers free and confidential support from…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691424/increasing-mental-health-services"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…noon on       Tuesdays (or 2 p.m. if no legislative business was conducted       on the preceding Monday); noon on Wednesdays and Thursdays;       and 9 a.m. on all other days of the week.\n\nThe resolution was agreed to.\n\nA motion to reconsider was laid on the table.", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698545/providing-for-the-hour-of-meeting-of-the-house"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…some money he won playing craps  on the Queen Elizabeth on his way home. All of his children worked in  his butcher shop growing up. Later, I remember seeing my dad work 7  days a week on the midnight shift to put food on the table and a roof  over our heads. He worked hard and lived honestly. And, just one  generation later, look where we are.\n\nWhat a…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…throughout tax filing season. Donna  volunteers her time as a tax preparer, working one on one with  families, at 3 of 5 Hernando preparation sites, equaling a total of 5  days a week since February (logging over 135 TD). This doesn't include  her endless hours assisting the organization with event prep,  administrative services, and partnership planning.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692146/recognizing-donna-telesco"}]