[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Speaker, I rise today to oppose this terrible bill  that is a bad deal for Ohio, the residents of Ohio's 13th Congressional  District, and the people of the United States of America.", "title": "Providing for Consideration of Senate Amendment to H.R. One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "But, frankly,  we  had plenty of time to get a deal in the last 2 weeks, and the lack of  seriousness from the White House and from Republicans, not getting  language until last night, has put us in the position we are in today.", "title": "-9999", "date": "2026-02-12"}, {"senator": "Al Green", "party": "Democrat", "sentence": "I am going to fight to end anti-Semitism,  but on CNN, ``anti-Semitism'' is a word that you can use to address the  anti-Semite and to deal with those persons who are perpetrating and  perpetuating anti-Semitism, but you can't use ``racism'' on CNN.", "title": "Dark Days", "date": null}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Speaker, I rise today to recognize the Deal First  Aid Squad as they celebrate their 75th Anniversary this year.", "title": "Recognizing the 75th Anniversary of the Deal First Aid Squad", "date": "2025-08-05"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "As a smart first step, he and Putin can strike a deal to respect New  START's central limits and set the stage for a more comprehensive  nuclear arms control framework agreement.", "title": "Risk of Conflict with Nuclear Weapons", "date": "2025-07-23"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "We are witnessing the wholesale  commercialization of America's natural inheritance, one sweetheart deal  at a time.", "title": "Undersea Cable Protection Act of 2025", "date": "2026-02-11"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "And there is probably a  good deal of public investment in the career of that person with the  return being that person is going to be doing research on trying to  cure diseases.", "title": "Department of Health and Human Services", "date": "2025-02-27"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "A lot of them  retired because they took the DOGE buyout deal, the Deferred  Resignation Program, where people were given a buyout if they resigned  by October.", "title": "Restoring Retirement Processing for Federal Workers", "date": "2026-02-03"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "We have a  great deal of work to do to improve the system for everyone and to  reduce disparities, but we must start by following what we often call  the Hippocratic oath to first do no harm.", "title": "Health Disparities in Minority Communities", "date": "2025-04-28"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "It is not just this ``palace in the sky.'' The Qatari Government has  signed a $5.5 billion deal with the Trump Organization to build a  luxury golf resort in Qatar, complete with Trump-branded beach side  villas and an 18-hole golf course.", "title": "-9999", "date": "2025-05-13"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "I think having a single person to deal with at the Social Security  office is common sense, and it will enable a victim to unravel their  problems a lot sooner.", "title": "Improving Social Security's Service to Victims of Identity Theft Act", "date": "2025-12-01"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "At its core, this is just another unfunded mandate, where you have to  train 15,000 superintendents and unlimited numbers of principals so  they will know what a foreign entity of concern is and how to deal with  it with this new legislation.", "title": "Transparency in Reporting of Adversarial Contributions to Education Act", "date": "2025-12-03"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "In late 2018 and 2019, President  Trump forced us into a shutdown of part of the government--the part of  government dealing with the Department of Justice and other justice- related Agencies--over border wall funding.", "title": "En Bloc Nominations", "date": "2025-10-01"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "Air travel with children is a nightmare, and I am just talking for  the nonparents who have to deal with them at an airport.", "title": "Bottles and Breastfeeding Equipment Screening Enhancement Act", "date": "2025-11-17"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "But you know, in imposing these tariffs we were just trying       to deal with a particular problem, not begin a trade war.", "title": "Terminating the National Emergency Declared to Impose Duties on Articles Imported From Canada", "date": "2025-10-29"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school athlete  from Ohio's Fifth Congressional District.", "title": "Special Recognition of Anna Roessner for Winning the Division III State Track and Field Title for the 100 Meter Dash", "date": "2025-07-10"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "The Republicans want to deal with that.", "title": "Increasing Medicaid Funding", "date": "2025-05-07"}, {"senator": "David Taylor", "party": "Republican", "sentence": "They are frustrated that they have to stretch their  dollar as far as it can go just to keep a roof over their heads, afford  to buy the basics, and deal with higher utility bills to keep their  water and power on.", "title": "Providing for Consideration of H.R. Saving Homeowners From Overregulation with Exceptional Rinsing Act; Providing for Consideration of H.R. Affordable Housing Over Mandating Efficiency Standards Act; and Providing for Consideration of H.R. Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-07"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "I think one of the  difficult problems he has dealt with is we just got done with a  President who did all he could to ignore our immigration laws.", "title": "Diversity, Equity, and Inclusion", "date": "2025-04-07"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Between the two, we deal with all of government spending.", "title": "Destruction of the Nuclear Family", "date": "2025-02-27"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "It should go without saying, but how we talk to our friends and  allies matters a great deal, and our approach to Greenland and then, by  extension, to Denmark is severely lacking right now.", "title": "-9999", "date": "2026-01-08"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "However, in 2021, at the behest of leftwing organizations, the Biden  administration disregarded this history and disbanded the council,  replacing it with an advisory body charged with fulfilling the left's  Green New Deal agenda.", "title": "Providing for Consideration of H.R. DC Criminal Reforms to Immediately Make Everyone Safe Act; Providing for Consideration of H.R. District of Columbia Policing Protection Act; Providing for Consideration of H.R. Lowering Age At Which A Minor May Be Tried As Adult for Certain Criminal Offenses in District of Columbia; Providing for Consideration of H.R. District of Columbia Judicial Nominations Reform Act; Providing for Consideration of H.R. Guaranteeing Reliability Through the Interconnection of Dispatchable Power Act; Providing for Consideration of H.R. National Coal Council Reestablishment Act; Providing for Consideration of H.R. Promoting Cross-Border Energy Infrastructure Act; and for Other Purposes", "date": null}, {"senator": "David Schweikert", "party": "Republican", "sentence": "We have to deal with the reality that, in less than 3 years, over half  of everything that this Congress will spend--so over half of everything  that the Federal Government will spend--will go to people who are 65  and up.", "title": "Growing the Gdp", "date": "2026-01-13"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "Their  reckless regulatory agenda prioritized Green New Deal virtue signaling  over good fiscal stewardship and the interests of the American people  by exposing manufacturers and other stakeholders in our industries to  regulatory uncertainty and forcing American families to shoulder the  burden.", "title": "Terminating the National Emergency Declared to Impose Global Tariffs", "date": "2025-04-30"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "It has, actually, always  been the most important issue that voters and my constituents in Texas  and Americans, generally, have felt was important because, of course,  it deals with their quality of life and their standard of living.", "title": "Nominations", "date": "2025-12-17"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "That is a really big  deal to get America out there on the world stage.", "title": "Disinterment of Remains of Fernando V. Cota From Fort Sam Houston National Cemetery, Texas", "date": "2025-12-10"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "So even when Congress passes a budget, they seem to immediately  renege on the deal they just passed.", "title": "Setting Forth the Congressional Budget for the United States Government for Fiscal Year 2026 and Setting Forth the Appropriate Budgetary Levels", "date": null}, {"senator": "James Lankford", "party": "Republican", "sentence": "It is a big deal to them, as well it  should be for any American.", "title": "-9999", "date": "2025-12-10"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Now, once again, it is falling on the Senate to do the real  policymaking, but I am heartened that they seem to be close to a deal  that roughly mirrors the compromise bipartisan bill that I have offered  with the gentleman from California (Mr.", "title": "Breaking the Gridlock Act", "date": "2026-01-08"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "He cut  a deal with union bosses after the November election and just before  leaving the agency to run for chair of the Democratic National  Committee.", "title": "Protect America's Workforce Act", "date": "2025-12-11"}]