[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, I rise today to oppose this terrible bill  that is a bad deal for Ohio, the residents of Ohio's 13th Congressional  District, and the people of the United States of America.\n\nWhen I was first elected, I told the people of Ohio's 13th…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693216/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…law, and this  Department of Homeland Security is not obeying the law.\n\nSo I am hopeful that these discussions will continue. But, frankly,  we  had plenty of time to get a deal in the last 2 weeks, and the lack of  seriousness from the White House and from Republicans, not getting  language until last night, has put us in the position we are in today.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700057/9999"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…I think we  have to end anti-Semitism. I am going to fight to end anti-Semitism,  but on CNN, ``anti-Semitism'' is a word that you can use to address the  anti-Semite and to deal with those persons who are perpetrating and  perpetuating anti-Semitism, but you can't use ``racism'' on CNN.\n\n``Racism'' is an incitive word. CNN would have us end anti-Semitism…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. PALLONE. Mr. Speaker, I rise today to recognize the Deal First  Aid Squad as they celebrate their 75th Anniversary this year.\n\nIn 1950, residents of the Borough of Deal, New Jersey founded the  Deal First Aid Squad to provide emergency…", "date": "2025-08-05", "source_url": "https://justfacts.votesmart.org/public-statement/1694713/recognizing-the-75th-anniversary-of-the-deal-first-aid-squad"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…decisionmaking--in fact, we are the decisionmakers,  according to the Constitution--those tariffs should be struck down. We  should go back to basics, which is that when we deal with tax policy,  it is the power of Congress that prevails in terms of making those  kinds of decisions.\n\nThe harm that has been done to the economy, the middle class, and…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696749/congress-must-take-action-on-tariffs"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…market rate for access to these places.\n\nThis sets a terrible precedent. We are witnessing the wholesale  commercialization of America's natural inheritance, one sweetheart deal  at a time. Today, it is cables and sanctuaries. Tomorrow, it will be  mining in a national monument. Next week, it will be drilling in  national seashores. Where does this…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…collectors  calling up: Where's the money? We don't have to allow this to happen.  We don't, and we shouldn't.\n\nAnd I just want to emphasize, it is not a Republican, Democratic  deal; it is a mutual responsibility that this U.S. Senator has to the  people of this country in your State and in my State.\n\nSo I urge us to get a solution. And I talked about West…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…that make a difference in people's lives, in the  education of their kids and their health and their safety, of looking  at substance abuse and opioid addiction and how we can deal with that,  transportation, rent assistance, homeless assistance, maternal  mortality, childcare, and Head Start.\n\nThere are two paths that we face today. One: If we pass the…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…millions of Americans will cause undue  friction in our healthcare system and only serve to divide us.\n\nMr. Speaker, our healthcare system is by no means perfect. We have a  great deal of work to do to improve the system for everyone and to  reduce disparities, but we must start by following what we often call  the Hippocratic oath to first do no harm. Do…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690244/health-disparities-in-minority-communities"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…exchange for immigration policy concessions.'' He  called Mr. Bove's position ``fundamentally incompatible with the basic  promise of equal justice under law''--a quid pro quo deal. But Mr. Bove  said it was fine.\n\nEven more disgracefully, he said a court cannot review, at all, a  dismissal of this kind. This attitude toward the law alone should  disqualify…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…Service to Victims of Identity Theft Act, and of course, this passed  the Ways and Means Committee with overwhelming bipartisan support.\n\nI think having a single person to deal with at the Social Security  office is common sense, and it will enable a victim to unravel their  problems a lot sooner.\n\nI just want to make note of the fact that, like some…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697187/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…another unfunded mandate, where you have to  train 15,000 superintendents and unlimited numbers of principals so  they will know what a foreign entity of concern is and how to deal with  it with this new legislation. It burdens our already overstretched  schools with new reporting requirements, new paperwork, and new  bureaucratic hurdles, all without…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697440/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…matters, beholden to their MAGA isolationist base.\n\nThis partnership is too important to be sacrificed by Trump's ego and  Republican complicity. Trump must reverse course, make a deal, and fix  the damage that he has caused. He needs to get his act together on  behalf of this country and our relationship with India.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695025/trump-must-reverse-course"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…support of the Bottles  and Breastfeeding Equipment Screening Enhancement Act.\n\nAir travel with children is a nightmare, and I am just talking for  the nonparents who have to deal with them at an airport. For parents,  it is hell. It is like an Olympic sport. It is like going through a  gauntlet dragging little kids who just want to be attached to tablets…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696792/bottles-and-breastfeeding-equipment-screening-enhancement-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…agreements. As I've       often said: Our commitment to free trade is also a commitment       to fair trade.\n\nBut you know, in imposing these tariffs we were just trying       to deal with a particular problem, not begin a trade war. So,       next week I'll be giving Prime Minister Nakasone this same       message: We want to continue to work cooperatively…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696451/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…Mr. President, I rise today in support of the SAVE  America Act. I have heard a lot of hysteria, hyperbole, and, sadly,  falsehoods about this bill, which have created a good deal of  confusion. Frankly, a lot of the issues have become muddled. I think we  have lost sight of what we are really debating in this Chamber. So  today I would like to dispel…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…have to produce more  electricity. There was a war on baseload electricity, an absolute war.  These people did not know if they were going to survive this war. Here  is the deal: If you don't provide more baseload, your price is going to  go up. We have to grow baseload in this country. The only way to reduce  energy prices is competition and more energy.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695690/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…Some of this, to be sure, might recognize the naming of a post office  or it might recognize--I don't know--``National Sofa Care Month,'' if  there is such a thing. Others deal with discrete, local issues--issues  that, while important to a select few people who live around, for  example, a particular piece of land owned by the Federal Government and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…regulations pushed out of Agencies, was a disaster for  American families, businesses, and industries across our Nation. Their  reckless regulatory agenda prioritized Green New Deal virtue signaling  over good fiscal stewardship and the interests of the American people  by exposing manufacturers and other stakeholders in our industries to  regulatory uncertainty…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690525/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…American people and prey on  their fears, the last gasp of a broken status quo.\n\nFor our part, we put our trust in the American people. We appeal to  their aspirations, and we deal in facts, not fear.\n\nThere are the false claims they make that this only helps the so- called 1 percent, the top 1 percent, the superrich, when actually it  locks in the largest…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693192/one-big-beautiful-bill-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…the ``thousand-yard  stare,'' a certain emptiness we would see in others that indicated an  increased level of stress.\n\nThat was then. How did we, especially in the military, deal with  whether it would be battle fatigue, shell shock, or the thousand-yard  stare? Back in World War I and World War II, there was this thing  called the troopship. When, let's…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692714/recognizing-national-post-traumatic-growth-day"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Republicans were calling for relief  for the American people in the last Congress?\n\nThey said that we were following the wishes of only President Trump.  They followed the Green New Deal playbook to a t, and that is what we  are here to debate today are these important rollbacks of the Green New  Deal agenda.\n\nWe sat idly by and watched our country get invaded…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…affiliation, and  we sued some of these companies and held them accountable. When I left  office, we had recovered about $340 million, $350 million for my State  of Kansas to deal with drug treatment from Purdue Pharma and other  companies that had peddled addiction for profit.\n\nIt doesn't sound like a lot of money in this Chamber, but to put it  in context,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691880/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…each member of the Committee.                            Rule 3. Subcommittees\n\nCreation of subcommittees shall be by majority vote of the       Committee. Subcommittees shall deal with such legislation and       oversight of programs and policies as the Committee may       direct. The subcommittees shall be governed by the Rules of       the Committee…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school athlete  from Ohio's Fifth Congressional District. Nathan Bright, a senior at  North Ridgeville…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693333/special-recognition-of-nathan-bright-for-winning-the-division-i-state-track-and-field-title-for-high-jump"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…this Islamic school withdrew their proposal.\n\nThis is an example of what it is going to take to defeat this  poisonous ideology. This is an example of what we do not want to deal  with. It is going to take all of us red-blooded Americans coming  together and saying enough is enough.\n\nEurope has lost the war of immigration. It is no longer recognizable.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…beautiful pictures of Molly growing up with those kids from when she  was young to just last August at the convention.\n\nLisa McGovern dedicated herself to helping families deal with cancer  at Prevent Cancer Foundation. Lisa knows directly what it is like to  see that terrible disease impact a young and promising life and how it,  therefore, impacts…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…themselves more with appeasement than with protecting American  interests.\n\nPresident Trump took a different approach. For months, President  Trump has urged Iran to make a deal. He has been clear. There is no  world where Iran, whose leadership chants ``Death to Israel, death to  America'' will be allowed to obtain a nuclear weapon ever. This is not…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school athlete  from Ohio's Fifth Congressional District. Rania Brown, a senior at Avon  High School,…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693391/special-recognition-of-rania-brown-for-winning-the-division-i-state-track-and-field-title-for-the-discus-throw"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…it then be a little bit late to vote on initiating a war?\n\nSee, this is an enormous debate. This is an important debate, and  this should not be sluffed over as, Oh, no big deal. The war is already  over.\n\nWell, we actually don't even know if the war is already over. We are  under a blockade. The current administration has said they will send  troops…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699091/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]