[{"senator": "George Latimer", "party": "Democrat", "sentence": "…foreign policy that puts ideology ahead of humanity. The  administration has made it clear that it will not send out aid until  countries vote in a certain way or make trade deals.\n\nThe Trump administration claims it is putting America first, but  these policies put America last. When we offer food aid, we are not  just fighting hunger, we are building…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693656/foreign-food-aid-incinerated"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…nation that has a keen interest in U.S. policy;  the President acquiring a plane in plain violation of the emolument  clause; soliciting private donors for ballrooms; real estate deals in  the Gulf; the rampant conflicts of interest with crypto money coming in  from the Gulf to the First Family; the use of government power and  position for corruption and…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696336/trump-administration"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…need to research aviator cancers. I am hopeful that  we can work in lockstep on behalf of our veterans as we continue to  advocate for every one of them. For example, this bill deals  principally with fixed-wing aviators. I am hopeful that we will  similarly rally around legislation for rotary-wing aircraft pilots.\n\nI am genuinely hopeful that, upon completing…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693895/aces-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…for 2025. We have  many persons who have signed up to cosponsor, but it is still not too  late for additional persons to sign up.\n\nThe theme is African Americans and labor. It deals with African  Americans and labor in America. It will trace the history of labor from  enslavement through current times.\n\nThe second resolution is one that I am very proud…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…of the iceberg  because what else does the leader of the free world have to do all day?  I mean, he could try to end wars in the Middle East. He  could try to negotiate peace deals in Europe. Oh, wait, no. Actually,  he is cutting funding for NATO. Sorry, I forgot about that. In fact, he  just spent his entire day attacking his aggrieved lover.\n\nDonald…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692039/consequences-of-doge"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…submission. We have only applied this exception to rules that       primarily focus on the internal operations of an agency.\n\nHere, the withdrawal of the Reporting Requirements deals       with how regulated entities present information regarding fee       collection to NCUA as part of the Call Report process. NCUA       will no longer collect this information…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…permanent.\n\nJournalists report that the President says the tariffs are permanent.\n\nAn hour later, Trump says: I never said they are permanent. They are  not permanent. I am cutting deals.\n\nThey write that he is cutting deals.\n\nAn hour later, they are suspended--no more tariffs.\n\nWhen the truth changes constantly, it is hard to believe that there  is anything…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…justify for any other  reason, other than because he wants to get funding to support a tax cut  for the wealthiest Americans.\n\nYet the President is talking about wanting to cut deals with Russia  for economic development. I don't see the logic in going half way  around the world to deal with a dictator--a murderous dictator, by the  way--like Vladimir Putin.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Legislature  have granted giant tax breaks to data centers, while local township  officials remain in the dark about details. That is not fair.\n\nOhioans know what secrecy and inside deals bring. FirstEnergy  scandals led to indictments, prison terms, and even suicides. Ohio  Statehouse corruption rewards big business and harms the public. The  American people…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697372/rushing-to-build-ai-data-centers"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…America is about.\n\nIn truth, though, the news of the Qatari Air Force is just one tip of  the iceberg. For months, Qatar and other Gulf State nationals have  spent billions on deals with the Trump organizations to buy the  President.\n\nDonald Trump is using his office to enrich himself and his family.  This isn't a question. This is a fact with incredible…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690971/qatar"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…never seen before. If you       want to see fraud, look into the contractual promises we have       made and then broken, forcing our partners into debt for       relying on the deals we made with them. If you want to see       abuse, look at how the administration has prioritized       payments for the few firms that have the ear of senior       officials.''…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…this wrong-for-decades neoliberal disaster of unlimited and  free trade. I think it has been a failure of government across the  board. We should push back on these lousy trade deals. We trade. We  trade with our friends, and we trade with others, but we do it on fair  terms.\n\nWhat is not fair is seeing American workers undercut by governments  like Communist…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…violations of the Hatch Act by the  Donald Trump Presidency, not just this time in this term, but also in  the first term.\n\nWe saw how they abused the office for real estate deals outside of  government. We saw how foreign governments flowed and sent money to his  family when they left the White House. Donald Trump, today, by the use  of the meme coin…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690819/gross-violations-of-law-by-trump-administration"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…more ugly, cruel, and  completely avoidable consequences you'll find.\n\nIt weakens our public school system and makes higher education more  expensive.\n\nIt gives sweetheart tax deals to dirty fossil fuel companies and  makes it cheaper for them to extract gas and coal from our public  lands.\n\nIt attacks our federal investments in clean energy, which will…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693153/one-big-beautiful-bill-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…These files also include financial transactions between Epstein and  Trump. There are discussions of financial affairs, potential money  laundering, including in real estate deals. There was also an admission  by Jeffrey Epstein himself that he was facing a mandatory minimum of 10  years in Federal prison, yet the DOJ failed to prosecute him. There are…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696853/standing-with-truth-and-justice"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…demonstrated medical value.\n\nLet me be clear. This bill will have no impact whatsoever on a  physician's ability to administer fentanyl in medical settings. The  HALT Fentanyl Act deals specifically with analogues, not medicinal  fentanyl.\n\nWe must address this bipartisan issue immediately and not allow this  temporary extension to expire in September.\n\nOnce…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…look forward to working with  President Trump and the U.S. Department of Agriculture as we continue  to support the American farmer by bringing down costs, securing new  trade deals, and prioritizing American crop production.    Honoring Franklin County Board of Commissioners and Agricultural Land                             Preservation Board\n\nMr. JOYCE…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698173/lowering-healthcare-costs-for-all-americans"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…on as greater  flexibility and greater options on plans do nothing but help people.\n\nThere is an issue that I have worked on with several of the folks in  this room, and that deals with pharmacy benefit managers. We have got  to be able to actually land this. We all know of the rising costs of  pharmaceuticals that are out there. We all experience that,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…designees and provides one motion to  recommit.\n\nFinally, the rule provides that House Resolution 23 and House  Resolution 164 are laid on the table.\n\nMr. Speaker, this rule deals with several issues. The underlying  legislation included is essential. One of the bills included in this  rule is H.R. 1526 led by the Representative from California (Mr.…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…today, one of  which is the amendment that I am bringing forward right now. That  amendment is dealing with what we call general government. It is that  portion of funding that deals with a number of areas including our  judges and how judges are funded.\n\nOne of the issues we have been addressing is the extent to which the  President, who is elected to…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699058/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…face-to-face, and  arrest the world's worst criminals, or we don't.\n\nMr. Speaker, President Trump has reset our standing in the global  market after decades of failed and unfair trade deals put the American  economy last.\n\nSwift and decisive action has brought scores of countries to the  negotiating table and numerous new trade deals including with the U.K.,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699311/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…concerned about the  veterans, I ask him and his side of the aisle why my Democratic  colleagues haven't introduced a solution to aid veterans and still make  sure that it actually deals with the veterans' problems, not just all  of a sudden spends not only more money than they have to fix their  problem, but creating a problem for other veterans because Democrats…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689695/montgomery-gi-bill-selected-reserves-tuition-fairness-act-of-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…that is what President  Trump is committed to. For far too long, administrations in Washington,  D.C., have created red lines that were crossed without consequence,  agreed to deals with Iran that the regime disregarded, and concerned  themselves more with appeasement than with protecting American  interests.\n\nPresident Trump took a different approach.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…White House is in Republican hands. That is  because it was part of the mandate given by the American people to  reset the global trade order and to renegotiate unfair trade deals that  have happened over decades. Both Republican and Democratic  administrations alike took advantage of the American worker, chased our  jobs overseas, and ruined our supply…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…thought. I am going to  quote from a book called ``The Tragedy of American Compassion,'' by  Marvin Olasky. It is now a 30-year-old book.\n\nIt is an interesting book in that it deals with what we have today  called welfare. At the time that was all privatized. I am going to  quote from the Society for the Prevention of Pauperism of the City of  New York…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693754/dont-give-away-charity-too-easily"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…controlled by the chair and ranking minority member  of the Committee on Small Business or their respective designees, and  provides each one a motion to recommit.\n\nThis rule deals with several critical issues. There are three bills  that all came out of the Education and Workforce Committee that would  combat efforts by the Chinese Communist Party who…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…reduce commodity prices and push up the  cost of production, our farmers are having a hard time right now, as  you well know.\n\nAs the administration works to secure better trade deals for our  Nation, it is critical that we don't allow China to use our farmers as  a pressure point in those negotiations. That is why I have been  working--along with others--with…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696017/9999"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Rosa DeLauro, for their leadership.\n\nMr. Speaker, for too long, Washington has governed by crisis:  shutdown threats, continuing resolutions, these omnibus bills, and  backroom deals that the American people never asked for.\n\nMr. Speaker, this bill proves that those days are coming to an end.  The Commerce, Justice, Science; Energy and Water Development;…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698747/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…proceedings.\n\n(5) Entities (corporate, nonprofit, academic, or       governmental) with known or alleged ties to Epstein's       trafficking or financial networks.\n\n(6) Any immunity deals, non-prosecution agreements, plea       bargains, or sealed settlements involving Epstein or his       associates.\n\n(7) Internal DOJ communications, including emails, memos,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696818/epstein-files-transparency-act"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…Senate companion, and, Mr. Speaker, it is a bipartisan Senate  companion. I want to mention the sponsors: Senator Rick Scott, Senator  Joni Ernst, and Senator Alex Padilla.\n\nIt deals with a lot of issues that we have already heard about, but  it is important to note that those are not small issues for those  communities. They are problematic issues.\n\nWe…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693863/establishing-new-zip-codes"}]