[{"senator": "Al Green", "party": "Democrat", "sentence": "…war without conferring with the Congress of the United  States of America.\n\nThis is why I stand. This is what I will do, and I do it in the name  of my country that I love dearly.", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692829/government-of-the-people-by-the-people-and-for-the-people"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…with dignity and respect, and she knew how to listen and lead,  As a public servant and as Speaker of the House, she left Minnesota  better than she found it. I will miss her dearly.\n\nAs we mourn the loss of Melissa and Mark, our hearts are with their  children, Sophie and Colin, and their entire family.\n\nWe wish Senator John Hoffman and his wife Yvette…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693118/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…President, like  many others of both parties, has ignored that requirement and, I think,  at his own peril. They are engaging us in a long-term conflict which  could cost us dearly, and they are not engaging the American people in  the discussion and rationale of our ultimate goals in the region.\n\nThis briefing this morning was a good one. Senator Tim…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698599/venezuela"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…incentive is that to people who make a lot of money and  who try to avoid taxation? The little guy has to pick up the tab. Mr.  Chair, that cut will cost the American people dearly by making it  easier for millionaires, billionaires, and corporations to avoid paying  the taxes they owe under existing law.\n\nNevertheless, this bill is better than it would…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699056/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…are with the families of these students. May  the souls of Arely, Jacqueline, Natalia, Cynthia, and Manny rest in  peace. Our community will never forget them. We miss them dearly. We  thank them for the time they spent with us.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690780/five-santa-ana-students-taken-too-soon"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Rutledge, his son, Timothy Thomas; his granddaughter,  Clemitruis Hartley, and his niece and devoted caregiver, Decliffia  Coleman and a host of other relatives who loved him dearly.\n\nOn a personal note, Cliff was my longtime friend and supporter for  over 50 years. He was also my brother in the bond of Kappa Alpha Psi  Fraternity, Inc. His wise counsel…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688153/in-memory-of-clifford-odell-rutledge"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Leaving the halt work order in place is hurting working families and  electric ratepayers.\n\nLawsuits have been filed, and the U.S. Government and taxpayers are  going to pay dearly for this uncalled for about-face on a project that  the government approved 2 years ago.\n\nThe better path is to quickly lift the order, meet face-to-face with  the developer…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695066/halt-work-orders"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…beloved wife of 62 years, Linda; his children, Debbie,  Patti, Robert, and Julie; 13 grandchildren; 10 great-grandchildren; and  countless other family and friends who loved him dearly, I join to  celebrate a life of purpose and courage well-lived. May his example  forever inspire all those who knew him.\n\nI thank the Speaker for allowing me to enter his life…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…just how fiscally reckless and ill-conceived the Senate bill  is. They should reject it. Republicans' obeisance to Donald Trump's  increasingly unpopular agenda will cost them dearly in the future.", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689616/taxes"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Speaker, this is corruption, plain and simple.\n\nIt is the prioritization of personal profit over the national  security interests of our country, the country we all love so dearly.\n\nIt is wrong. It is immoral, and my colleagues on the other side of  the aisle say nothing. Worse, some of them defend this conduct,  notwithstanding that they know it is…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699746/it-is-time-for-the-corruption-to-end"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…Falls represents.\n\nBill Pascrell deserves this legacy. He was a legacy. He had a great  sense of humor, and when he walked in, everyone knew he was in the  room. We miss him dearly here, and his name belongs in this place not  only in the official record, but in the very landscape of the community  that he loved.\n\nMs. HOYLE of Oregon.  Pou).\n\nMs. HOYLE…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691126/redesignation-of-paterson-great-falls-nhp-facilities"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…President Donald Trump, in his  speech to the joint session of Congress last week, said he would, ``Get  police officers nationwide the support, protection, and respect they so  dearly deserve.'' He said those words in a chamber that was protected  by the very officers who were violently assaulted on January 6 by the  rioters who he egged on and later pardoned.…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688828/january-6-pardons"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…aunts--including Carole (and husband Clayton), Clarice,  Yvonne, and Sylvia; cousins Juan, Jose, Thomas, and countless others;  and a wide community of close friends who will dearly miss him.\n\nCorey touched countless lives with his kindness, faith, and joyful  spirit. He leaves behind a legacy of love that will be remembered by  all who knew him.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697070/recognizing-the-life-of-corey-lee-sidney"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…these students are in our prayers. May the souls of  Arely, Arlene, Jaqueline, Natalia, and Manny rest in peace. Our  community will never forget them, and we will miss them dearly.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690664/in-memory-of-santa-ana-car-accident-victims"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…distinction for 34 years.\n\nThe Trump administration has left America's cyber gates unlocked at a  time when cyberattacks are rapidly on the rise. Putin will make our  Nation pay dearly for that set of serious errors.\n\nFourthly, Trump administration policies threaten U.S. global economic  standing. Through American ingenuity and hard work, the likes of wish…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…his thoughts on them.\n\nHe was a strong conservative. He was warm, kind, and principled. In  my mind, he was exactly the kind of leader that Americans want. He is  going to be dearly missed. I feel robbed that I didn't get to work with  him more, and I will keep him and his family in my prayers.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698669/protecting-healthcare-for-millions-of-americans"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…of the people he represented. For that  commitment, his kindness, his optimism and faith, and his sense of  humor, I and all of my many Republican colleagues will miss Doug  dearly. He was in every sense a giant among us.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698734/9999"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Port Authority.\n\nCarrol was a man who showed up, not just when it was easy but when it  was needed. He believed in faith, integrity, and perseverance. He loved  his family dearly. For 42 years, he stood side by side with his beloved  wife, Judy, raising their sons, Garrett and Greg. They also cherished  their granddaughter, Diana Del.\n\nTo his church…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694060/may-beam-continue-to-light-the-way"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…was revered and respected across party lines. As a Rockland  County clerk, he revolutionized the office, making it more accessible  and efficient for the community that he so dearly loved.\n\nPaul's work extended beyond his official duties, touching lives  through his involvement with numerous civic organizations, including:  Jawonio, People to People, and…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697700/paul-piperato-post-office-building"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…Juli and Hort would  later serve on the board of directors.\n\nOn a personal note, Juli Spitzer was truly one of a kind with a  personality as big as all outdoors.\n\nShe will be dearly missed by her husband, Hort; her friends; her  community; and all who knew her.\n\nWe take comfort in knowing that her legacy will be remembered for  generations by Wyomingites.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687885/recognizing-the-legacy-of-juli-spitzer"}, {"senator": "John Rose", "party": "Republican", "sentence": "…avid competitors. I will miss that as well. Long  before I served with him on the Ag Committee, I came to consider him a  very worthy opponent, and I will miss those days very dearly as I move  forward.\n\nI will close by extending my condolences to his family, including his  wife and children. While Doug will be missed here, I can only imagine  how he will…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698713/9999"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…remarkable legacy she leaves behind.\n\nMay we all strive to embody the same compassion and commitment to  lifting others up that Krista demonstrated throughout her life. She  will be dearly missed.", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688958/recognizing-the-life-of-krista-wynne-moore"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Florida. Madam Speaker, I thank the chairman for the  time.\n\nMadam Speaker, if there is one group of Americans who definitely  shouldn't be receiving Federal payments, it is the dearly departed.  There is a famous line in the movie ``The Sixth Sense'' where the star  says: ``I see dead people.'' Our Treasury Department doesn't see dead  people. They just…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698919/ending-improper-payments-to-deceased-people-act"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…live on through the countless lives he touched and the workers he  proudly fought for. He was a great friend, an honest broker, and a true  New Yorker. I will miss my friend dearly, and may he be at peace.                        Honoring John ``Spo'' Esposito\n\nMr. LAWLER. Mr. Speaker, I rise today to honor the life of John  ``Spo'' Esposito, a remarkable…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698769/recognizing-jim-monaghan"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…States, to  defending our country, and in service of the Lord almighty.\n\nI will keep to fighting to live free, and I will remember Diana  through those actions. I will miss her dearly, as will many of my staff  who counted her as a mentor.\n\nWhen I think of the people who have devoted their life to the cause  and they come and they go and they pass, I am…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…used that  long life that he was given to accomplish so much more. His life of  courage, sacrifice, and compassion served as an inspiration to all who  knew him, and he is dearly, dearly missed.\n\nMy prayers and concerns and care are with his children Janet, Doug,  and Brian, his many grandchildren, great-grandchildren, and great- great-grandchildren--the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…reality.  Even though the images are fake, the consequences are very, very real.\n\nEven though, as I said, the images do not belong to them, those girls  are paying for them dearly with shame, humiliation, and the unbearable  suffering when you are 14, 15 years old. Up until now, there was no  recourse. Just imagine waking up one morning to find yourself…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690181/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…hard-earned classroom experience directly shaped  our education policy work, giving us a clearer understanding of how  Federal decisions truly affect teachers and students.\n\nWhile we dearly miss Mrs. Black in our Cannon office, I am grateful  that she returned to the place where her impact is greatest and most  needed which is in the classroom.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697562/recognizing-albert-einstein-distinguished-educator-fellow-veena-black"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…with Jesus Christ took him through his last  difficult journey with the strength and confidence that he could trust  his Lord with the outcome of his life. We will miss him dearly but look  forward to the day we will be reunited in Heaven.\n\nBruce will be remembered for his great sense of humor and his  generous heart. He was a faithful son, wonderful…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}]