[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…recognize a heart attack or stroke and provide high- quality care. In these high-pressure cardiac situations, timely care  from an EMS team can be the difference between life and death.\n\nSince 2014, Evergreen Fire/Rescue (EFR) has been honored with this  award four times. EFR Chief Dave Montesi attributes the team's success  to their experienced paramedics,…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694726/recognizing-evergreen-firerescue"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…didn't merit collective  punishment. It didn't merit ethnic cleansing, and it didn't merit  genocide. Those are crimes against humanity.\n\nToday, dear friends, I will mourn the death of Mr. Kirk and all of  the persons who have died in their places of worship, killed at the  hands of assassins, all of the children who have died in schools. It is  about…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…and shelter and other humanitarian aid from reaching Gaza.\n\nThe results of that siege have been and are unbearable for the  families there. Babies and children are starving to death right now-- right now--in Gaza.\n\nI have behind me the picture of an infant girl in Gaza who starved to  death this past week. Her parents could not get the lactose-free  formula…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691093/senate-resolution-224-calling-for-the-urgent-delivery-of-humanitarian-aid-to-address-the-needs-of-civilians-in-gaza"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…bill creates or if you are worried about  stripping 17 million Americans of healthcare access, I tell you that  now is your moment.\n\n``A coward dies a thousand times before his death, but the valiant  taste of death but once.'' That is a quote from Shakespeare.\n\nVote your constituents. Vote your conscience. This is how you will be  remembered.\n\nBetter to…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693187/one-big-beautiful-bill-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…those instances that we as Members of Congress  work to fix those problems on behalf of those who elected us to this  body.\n\nThat is the case with the Peltz family. Upon the death of Mr. Ernest  Peltz, VA failed to pay the benefits he earned when his death occurred  shortly after the benefits were awarded. This resulted in his family  having to navigate…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699468/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…with spina bifida, a lifelong disability. He says: For many of us,  these cuts are not abstract numbers. They are the difference between  stability and crisis, between life and death. I am healthy today  because Medicaid stood by me. I am thriving because I have had  consistent, reliable access to the care I need.\n\nMedicaid makes independence possible.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690849/keep-your-hands-off-medicaid"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…able to use their positions of power to  get rich from defense contractors while voting to pass more funding for  war. Our elected officials should not be able to profit off of death.\n\nThe American people deserve Representatives who vote in the best  interests of our families. We are elected to serve the public, not to  serve stock portfolios or campaign…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695276/taxing-excessive-ceo-pay"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…between whether a family eats, pays their  rent, or sees a doctor.\n\nMr. Speaker, 2.8 million rural Americans will lose coverage. For  them, this is not politics. This is life or death.\n\nHealthcare should never depend on your ZIP Code. This clean extension  of the ACA tax credits will save lives.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698588/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…be  allowed to stand--We won't have a Country anymore!!! An example MUST BE  SET. President DJT.'' In another, he wrote of the lawmakers:  ``SEDITIOUS BEHAVIOR, punishable by DEATH!''  Dangerously and unconstitutionally, he reposted a third party's post:  ``HANG THEM GEORGE WASHINGTON WOULD!!''\n\nPresident Trump's call for the execution of lawmakers is…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697872/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…marching orders are to cut as much  as possible and to cut until the American people bleed. The only folks  who will be able to afford Band-Aids to prevent them from bleeding to  death will be the richest of the rich.\n\nEveryone else, you will have to fend for yourself. In each of these  committees in which we sit, on which we sit, we are debating cuts that…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…fewer groceries, fewer essentials, and fewer visits with  family.\n\nMr. Speaker, I get it. Some in this Chamber want to make this about  politics. The reality is this is life and death. It is life and death  for the 15 million Americans who are at risk of losing healthcare,  while Republicans found the time and the money to give tax cuts to  billionaires…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698785/breaking-the-gridlock-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…ALS, paired with our devastating lack of clarity about its causes, is a  metaphorical perfect storm of grief.\n\nThe Trivits family dreams of a future where ALS is no longer a death  sentence, and I share that dream and echo their resolve.\n\nEvan and Angela are a shining light in our community and are  emblematic of the values that Delaware is built on.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695077/recognizing-trivits-family"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…and flash flood warnings. Look no further than the absolutely  devastating news out of Texas. Access to high-quality information can  truly be the difference between life and death. Access to local news  from reporters and sources that community members trust is more  important than ever.\n\nStripping away this funding would also endanger local news that…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693591/rescissions-act-of-2025"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…while the bill       stipulates that ``less-than-lethal projectile devices . . .       must be designed and intended to be used in a manner that is       not likely to cause death or serious bodily injury,'' the       bill fails to prohibit or even acknowledge the inevitable       modification of ``less-than-lethal projectile devices'' into       entirely-lethal…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…been for that footage, which was recorded  and released by that local police department, the public would not have  had access to the circumstances surrounding Mr. Ghaisar's death.  Moreover, the footage revealed concerns about the Park Police's pursuit  and engagement policies.\n\nBody and dashboard cameras for federal law enforcement officers are  particularly…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694762/introduction-of-the-federal-police-camera-and-accountability-act-of-2025"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…disbanding all agencies in charge of censorship and  inquisition, and seeking justice for massacred political prisoners,  prohibition of torture, and the abolishment of the death penalty.\n\nFour of the 10-point plan, separation of religion and state, and  freedom of religions and faiths.\n\nFive, complete gender equality in the realms of political, social,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…make decisions in a  matter of seconds or less to pursue criminals and to enforce the law.\n\nIt is dangerous work. It is dangerous for the officer. It can result  in injury or death for the criminal. It can result in injury or death  for innocent Americans, but let us never forget that the interaction  was initiated by the criminal. Mr. Speaker, enforcing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695643/district-of-columbia-policing-protection-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…equipment, and excluding technical data.\n\nMr. Speaker, I rise in strong support of Representative Barr's Stop  Chinese Fentanyl Act of 2025.\n\nFentanyl is the leading cause of death for Americans aged 18 to 45.  It is killing over 70,000 Americans a year, and it is flooding into our  communities with deadly force.\n\nWe know where it is coming from. The…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694826/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…Justice for America's Veterans and Survivors  Act, in this package.\n\nMy legislation improves how the Department of Veterans Affairs  collects and reports data on the causes of death among veterans with a  particular emphasis on accurately identifying when suicide is a primary  or contributing factor.\n\nThe mental health crisis among America's veterans has…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695483/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…the period and inserting a       semicolon; and\n\n(C) by adding at the end the following:\n\n``(3) the entitlement of the member and of the survivors of       the member to all death benefits under subchapter II of       chapter 75 of title 10;\n\n``(4) the provision of all travel and transportation       allowances to family members of a deceased member…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…family man, cherished husband to Jill, and loving father to their  children, Annaliese, Olivia, Abbey, Seamus, Emma; his sons-in-law; and  his grandchildren.\n\nMichael's untimely death underscores the importance of ensuring the  safety of household products like awnings, and by passing this  legislation today, we can prevent further tragedies.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692746/awning-safety-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…payments.\n\nInsurers collect subsidies for deceased individuals through       unauthorized plan switches.\n\n58,000 SSNs receiving subsidies matched Social Security       death records.\n\nAt least 7,000 were dead before coverage even began,       insinuating identities were used by fraudsters.\n\n$94 million in taxpayer-funded subsidies were sent to…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698438/uncovering-widespread-fraud-in-obamacare"}, {"senator": "French Hill", "party": "Republican", "sentence": "…freed billions from hunger  and poverty around the globe.\n\nAnyone with even a basic knowledge of history knows that government- enforced collectivism always ends in poverty, death, and despair.\n\nMr. Speaker, look at Cuba, where the warmth of communism has left  people with no rights, no freedom, and driving cars from the 1940s and  1950s; or Xinjiang,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698914/warmth-of-collectivism"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…sponsored violence, and sewn chaos far beyond their borders. Their all- consuming obsession is the obliteration of America's principal ally in  the Middle East, and they have avowed death to America itself.\n\nIt is, therefore, deeply disturbing to see the reflexive partisan  reactions by certain Members of Congress. Either they believe Iran  should obtain a nuclear…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692744/iranian-regime-is-worlds-foremost-sponsor-of-terror"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…final       consumer product safety standard for fixed and freestanding       retractable awnings within the jurisdiction of the Commission       to protect against the risk of death or serious injury       related to the hazards associated with such awnings,       including the risk of death or serious injury related to the       awning unexpectedly opening…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692747/awning-safety-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…have cartels operating in our backyard.  They are kidnapping Americans, extorting families, trafficking women  and children, and flooding our towns with fentanyl to maximize death  and addiction on American soil.\n\nSomeone tell me that I am wrong. I don't hear anything. Just look at  the images next to me. It is not photoshopped. None of this is new.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…One Big Beautiful Bill Act gave a lifeline to the agricultural  community by updating reference prices, expanding crop insurance, and  saving millions of family farms from the death tax. The relief was long  overdue. We are grateful, but the work doesn't stop there.\n\nIt is past time for Congress to pass a fiscally conservative 5-year  farm bill, including…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693761/getting-animal-health-research-right-in-farm-bill"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…spending  package is a provision that will shut down the hemp industry across the  United States. My amendment would strip the provision designed to  regulate the hemp industry to death.\n\nThe bill as it now stands overrides the regulatory frameworks of  several States, cancels the collective decisions of hemp consumers, and  destroys the livelihoods of hemp…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696661/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…deepest commendation.\n\nOur alliance with the Philippines is rooted in shared sacrifice.  During World War II, U.S. and Filipino prisoners of war endured the  horrors of the Bataan Death March, and, together, we fought to liberate  the islands from Japanese occupation.\n\nGeneral MacArthur's famous return symbolized the unbreakable bond  between our peoples.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…they can  focus on investing and hiring more workers.\n\nMr. Chair, 2 million family-owned farms need certainty that they  won't be forced to sell their farm to pay an increased death tax. They  need to know right now if they should be contacting an estate planner  for the massive tax hike that is coming.\n\nParents need certainty that their guaranteed deduction…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688028/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}]