[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…convince the masses that its victims deserved their fate?\n\nCatching an ICE agent in a bad mood should not warrant capital  punishment. Being undocumented should not be a death sentence.\n\nHear me when I say that ICE is a rogue entity incapable of doing its  duty and incapable of re-earning the public trust that it has betrayed.  It is an existential danger…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699655/horrific-ice-abuses"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…restrictions on future employment, firearm ownership, and other rights.\n\nNow, if I or anyone of you should indicate in some way that the  President ought to somehow receive a death sentence, or if I or one of  you should indicate that the President ought to be hanged, I guarantee  you this President would have you arrested. I guarantee you, you would  be incarcerated.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…parties for 20 years.\n\nAs a volunteer who stood on the front lines of the AIDS epidemic, I  witnessed firsthand and remember when an HIV diagnosis was tantamount  to a death sentence. However, because of programs like PEPFAR, this is  no longer so.\n\nIn fact, since its launch in 2003, PEPFAR has saved 26 million lives  and enabled 8 million babies to…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692564/rescission-package"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…in prostate cancer outcomes, we must  ensure at-risk populations have access to prevention, early detection,  and treatment options.\n\nThis disease does not have to be a death sentence, and this disparity  isn't written in stone. We have the tools to close that gap.\n\nTogether, we can increase awareness through campaigns like Prostate  Cancer Awareness…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695816/recognizing-prostate-cancer-awareness-month"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…of it in 2014.\n\nThis supports the thought that screening programs may be detecting  what otherwise might be a silent disease. If caught in time, it doesn't  have to be a death sentence.\n\nBlack and African-American men are much more likely to develop  prostate cancer. One in six Black men will develop prostate cancer in  their lifetime compared to eight…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…premium increase in history, which will make  healthcare unattainable for so many Americans.\n\nWhen healthcare becomes unattainable, it turns treatable illnesses  into a death sentence. Americans will be forced to figure out their  healthcare. For people with high blood pressure, diabetes, or heart  disease, figuring it out means going without medication…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698415/we-must-extend-aca-tax-credits"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…second reaction was: Thank goodness you took that long and you did  an honest and accurate appraisal of what the effects are.\n\nHere is the bottom line: Dobbs has been a death sentence--literally,  a death sentence--for countless women, and it has been a condemnation  to financial disaster for many more.\n\nThis study shows, inextricably, the link between…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692840/9999"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…to cut $400 million from PEPFAR, a paragon of American  leadership that has saved the lives of 26 million mothers and fathers,  sons and daughters. Instead of facing a death sentence, people  supported by PEPFAR are raising families, building their communities,  and helping their communities grow and develop.\n\nThis is a bill that puts America last.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…rise to share the impacts of Republicans'  big, bad bill.\n\nI don't want us to forget that healthcare is a matter of life and  death, and the proposed Medicaid cuts are a death sentence for people  like Jessica, who lives in my district.\n\nJessica fled an abusive relationship when she was 25. Then she found  out she was pregnant. Only through Medicaid,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691495/gop-tax-scam-hurts-women-and-families"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…household  names, their lives are no less valuable, and we cannot forget them just  because we didn't see it happen.\n\nBeing detained in an ICE facility should not equal a death sentence.\n\nI recently conducted an oversight visit in Tacoma, and I met with  four of my detained constituents. One detainee had lost over 12 pounds  since November. He achieved…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699660/horrific-ice-abuses"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…by  President George W. Bush and has saved more than 26 million lives,  while slowing the spread of HIV/AIDS around the world. Cutting these  kinds of funds is another death sentence for children and women who  depend upon lifesaving medication that costs us just pennies.\n\nIt cuts $1.3 billion from humanitarian assistance, while over 300  million people…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692526/rescissions-act-of-2025"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…heavily on  Medicaid reimbursements.\n\nWe all know we have sick care in our country, and Medicaid is the  only Band-aid right now to keep it all together. This bill is a death  sentence, and over 50,000 people will die as a result of it.\n\nMadam Speaker, you will see. Republicans gave away trillions of  dollars to the richest people on the planet and are…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694018/budget-betrayal"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…paired with our devastating lack of clarity about its causes, is a  metaphorical perfect storm of grief.\n\nThe Trivits family dreams of a future where ALS is no longer a death  sentence, and I share that dream and echo their resolve.\n\nEvan and Angela are a shining light in our community and are  emblematic of the values that Delaware is built on. They…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695077/recognizing-trivits-family"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…sabotage doesn't just hurt the economy, it endangers lives.  Sidelining renewables and clean storage that keep the lights and air  conditioning on during heat waves is a death sentence. Experts warn  that heat wave-induced blackouts could kill 13,000 people. This bill  doesn't just cripple our grid; it puts lives at risk.\n\nThis bill will exacerbate devastating…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…our national public lands.  It is an absolute disgrace.\n\nWe are a technological giant. To give up on our ability to be able to  make these vehicles more efficient is a death sentence for the most  precious and vulnerable areas in our Nation. It is completely and  totally irresponsible, immoral, and it is going to wind up with scarred  oilfields all…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697516/hj-res-131"}, {"senator": "Markwayne Mullin", "party": "Republican", "sentence": "…cancer like this, we have been going to  Rochester for over a year, and we are doing some experimentative stuff  with him too. We got an opportunity--because it is not a death  sentence. What he has isn't a death sentence. But we have had to go  through this and continue to go through this. So it is even more  personal to me now.\n\nIn July of 2020, Mikaela…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698335/9999"}]