[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…should give  deference to the President, which I find absurd because what it means  is these standards that were crafted in legislation here--I am sure  broadly and intensely debated--and said no, it has to be a rebellion or  it has to be on the verge of a rebellion and the understanding of what  that would look like--and to say it is a rebellion just…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…Speaker, I thank the gentleman for yielding.\n\nMr. Speaker, I rise today in support of this War Powers Resolution.\n\nTwenty-three years ago, I stood on this same floor as Congress  debated an Authorization for Use of Military Force in Iraq.\n\nThe Bush administration relied on bad intelligence and outright lies  to march America into a disastrous foreign intervention…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698448/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…even the person who sits in the Oval Office. That is  why they wrote the Constitution, placing the responsibility for that  here where it can be wrestled with; where it can be debated; where  different perspectives can be brought to bear; where experts can be  interviewed; and all can be taken into account in making such an  important decision for our Nation.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693126/motion-to-discharge-sj-res-59"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…Speaker, I thank the gentlewoman for yielding.\n\nMr. Speaker, I rise in strong opposition to the so-called GENIUS Act.\n\nMr. Speaker, this bill has never even been considered or debated by  the House Financial Services Committee or the Agriculture Committee,  the committees of jurisdiction, which is the usual practice in this  body. I guess this is what passes…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693842/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…part of a birthday book for his 50th  birthday in 2003. The letter is signed at the bottom ``Donald.'' It  features a drawing of a woman's body with very suggestive text.\n\nI debated putting that letter up. There is a chart of it in the door  behind me. But it has already been made public. The public has seen it.  I find it a profoundly offensive letter.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…administration just canceled $107 million in investment for three major  projects aimed at modernizing U.S. manufacturing production and  distribution. All of those projects were debated and passed last year  in both Chambers of Congress under regular order. They were the result  of compromise within the Budget and Appropriation Committees, as well  as the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695604/devastating-harm-caused-by-trump-administration"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, the House of Representatives debated  the Common-Sense Law Enforcement and Accountability Now in DC Act of  2025 (H.R. 5107) and the District of Columbia Cash Bail Reform Act of  2025 (H.R. 5214). I include in…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…the legislature.\n\nThe War Powers Resolution exists for moments like this. It ensures  that before we send American forces into hostilities, the people's  representatives have debated and voted on that decision. It ensures  accountability. It ensures legitimacy.\n\nIf we allow these unauthorized operations to continue unchecked, we  will have surrendered…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…running Venezuela as he  is about running the United States.\n\nFinally, I will just say, if the Energy Department bill does make it  to the floor of the Senate--it is being debated this week in the  House--I will offer an amendment to that bill to prohibit the  requisition of Venezuelan oil for the purposes of nation building.\n\nThat will, of course,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…to resolve this.\n\nI put forward a somewhat different version of the world from my  colleague from Oklahoma and said: Let's do a block of time where  multiple people can be debated simultaneously. That alone speeds things  up by six to eight times because it is not 2 hours or 120 minutes per  nominee. Let's create a motion where we go directly to that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695308/cloture-motion"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…mistake. We should not be allowing for a  procedural trick to be played here that is unprecedented in the history  of the Senate, to then have the underlying issue be really not debated  the way it should in terms of the consequences for our Nation and for  the planet in terms of the greenhouse gases, additionally, that are  going to go up that will endanger…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…investors either, nor is there the same ability  of the SEC or the State securities regulators to police these markets.\n\nWhen the accredited investor framework was first being debated,  accredited investors were thought to be those who possess an intimate  understanding and knowledge of the risks inherent in investing in  private securities. These risks…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692775/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…floor today is in fact the way I feel about  what this section of the Constitution means.\n\nIn one of the previous debates with the War Powers Resolution, War  Powers Act being debated on the floor, Senator Kaine reminded us of  that historic moment when the Founding Fathers decided to write this  Constitution, which we have all sworn to uphold and defend.…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696557/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…the rising costs of energy are not abstract  numbers. High costs force impossible choices between cooling their  homes or risking heat-related illnesses.\n\nThese bills being debated here today directly affect their health,  safety, and financial stability because they raise costs.\n\nMore specifically, H.R. 1949, the Unlocking our Domestic LNG  Potential…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697083/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…issued a written finding a  year ago that Revolution's turbines ``would not have adverse impacts to  DOD missions.''\n\nMr. Speaker, you may recall, last September, the House debated an  amendment to the 2026 National Defense Authorization Act, where there  was an attempt to create a statutory bar to offshore wind based on  national security reasons. The…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698954/china-is-not-scamming-europe-and-united-states-on-wind-power"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Representative Brandon Gill for leading this  legislation. I urge all of my colleagues to support this bill, and I  reserve the balance of my time.\n\nMr. COMER. Mr. Speaker, we have debated these bills in a sincere  effort to work with the President of the United States to lower crime  in D.C. We have heard nothing from the Democrats other than there is no  crime…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695595/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…declared.\n\nHowever that case might turn out, I do believe that it is in the  national interest for important matters of economic and national  security policy to be considered and debated by the House of  Representatives. That is what we are here for. The view of our  leadership that such matters should not even be allowed to be debated  on this floor was,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…gaining  unchecked power over how Americans  conduct their financial lives. It ensures that if any form of digital  currency is ever created by the Federal Reserve, it must be debated,  authorized, and legislated by Congress instead of unilaterally  developed by unelected bureaucrats operating behind closed doors.\n\nThe potential consequences are too significant…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…year.\n\nAll of those were lies, and now those who continue to support the  unaffordable care act are misleading Americans about its current  situation.\n\nWhen the law was first debated, Democrats insisted that only 50  million Americans couldn't afford health insurance. That was exposed as  a lie. Many Americans proved simply to be forgoing insurance in…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698305/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…hear Members on the  other side say that the Republicans created this healthcare crisis.\n\nGuess what. It was the Democrats who wrote the Affordable Care Act  that is being debated on the floor right now. They are upset because,  as of December 31, it reverted back to the Affordable Care Act, which  they have championed, what they passed, not Republicans,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…with Epstein  and certainly nothing scandalous. We did find two sitting Democrat  Members of Congress had communication with Epstein.\n\nFirst, it has been highly reported and debated about Congresswoman  Stacey Plaskett texting during an Oversight Committee hearing with  Jeffrey Epstein, while trying to conspire with him to hurt or embarrass  Donald Trump.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697128/irrefutable-evidence"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…this year has barely started, President Trump has lost no  time in defining the year with his usual strength and decisiveness.\n\nYou know, back in the Federalist Papers, they debated what the Office  of President should look like. And one of the things they talked about  is the need for an energetic President and head of the executive  branch. And, I must…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…because I think this is  a big debate, our relationship with China, how we view it, how he views  it, how others view it, how President Trump views it, and it needs to  be debated.\n\nThat is what I want to do the next couple of minutes, talk about the  Freidman piece and, in my view, why it is so naive and misses so many  things and, particularly, gives…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…limited inherent  power to react to an attack. For example, he can order up defensive  measures or hot pursuit of an enemy or retaliatory strikes. That is the  distinction they debated when they substituted ``declare war'' instead  of ``make war'' among Congress' enumerated powers.\n\nThe supporters of this resolution are correct. Congress has to  initiate…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698449/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "French Hill", "party": "Republican", "sentence": "…firmly held belief that only by enacting  payment stablecoin legislation and, Mr. Speaker, I repeat, and  comprehensive market structure reform in this Congress, like we just  debated a few minutes ago, the  CLARITY Act, only by passing both will this Congress fully usher in the  era of digital finance and ensure that consumers are protected whenever  they…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693834/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…arguments here and the debates we will have here, often to save  money, which are wonderful, we will have borrowed more money during the  debate than whatever the item being debated would have ever saved,  because: How do you talk about the drivers of debt?\n\nThe other thing we also have to deal with is when we get our policies  wrong, when we make the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…dubiously named  as the Inflation Reduction Act, which did not reduce inflation, just  like the Affordable Care Act did not make healthcare affordable.\n\nWhen ObamaCare was crafted, debated, and passed, Democrats refused to  work with Republicans to make it a bipartisan law.\n\nSo this failed experiment in ObamaCare that is now proposing 18  percent premium increases…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…vigorously. That is what the political process is about.  That is what democracy is about. However, we need to have some shared  foundation upon which those differences can be debated. When you have  this rolling redistricting, Mr. Speaker, this redistricting war that we  are seeing right now, it erodes that foundation, and it makes it much  more difficult…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the world debt markets that we are creditworthy, that we are being  disciplined, that we are doing things--just that differential is more  money than everything that is being debated here.\n\nWhen just 1 point of interest, 1 point differential here, is over $3  trillion, that would solve a lot of this debate, wouldn't it? We can  actually get those types…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…at the Rules Committee markup last night. Once again, the budget  is the first step in the process, not the last. Many of these  amendments will have the opportunity to be debated thoughtfully and ad  nauseam, I have no doubt, in the authorizing committees.\n\nThe Democrats are speaking fear, not facts. Saying something that is  false over and over again…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}]