[{"senator": "Eric Sorensen", "party": "Democrat", "sentence": "…Association's Outstanding Public  Transportation System Award. Beyond these honors, Mr. Nelson built a  system that strengthens the community every day.\n\nI thank Jeff Nelson for his decades of leadership, creativity, and  commitment to the Quad Cities, and I extend my best wishes to him in  retirement.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694971/recognizing-jeff-nelson-on-his-retirement"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…working on the development of treatments to fentanyl overdose or  other medically beneficial FRSs. The HALT Fentanyl Act also imposes  harmful mandatory minimum sentences. Decades of research shows that  mandatory minimum laws that focus solely on supply reduction and  incarceration are not effective in slowing the flow of illicit drugs  into our country…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692633/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…outstanding  contributions of the physicians at Dallas Endoscopy Center (DEC) to the  health and well-being of the residents of Texas' 30th Congressional  District. For almost two decades, these dedicated healthcare  professionals have profoundly impacted our community through their  commitment to providing exceptional, cost-effective outpatient surgical  services,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695923/recognizing-the-physicians-at-dallas-endoscopy-center"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…years because the fight isn't over.\n\nThis week, I stood with powerful women in Congress to introduce a  resolution that removes our final barrier: the arbitrary deadline set  decades ago. If it passes, the ERA becomes the 28th Amendment.\n\nWe must pass this resolution. We must remove all barriers to women  because our rights don't have deadlines. Our rights…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689199/fighting-to-guarantee-equal-rights-for-all-women-under-the-constitution"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…Singleton\n\nMr. CISNEROS. Mr. Speaker, I rise today to recognize an extraordinary  military servicemember now serving our public schools.\n\nMr. Kenneth Singleton has dedicated decades of service to our  community. From serving in the U.S. Army and completing several tours,  including in Iraq, Afghanistan, and Saudi Arabia, his commitment to  service earned…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696998/small-business-saturday"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…sight.  Our allies are preparing for a possible military conflict with the  United States. Let me repeat that again.\n\nOur closest allies, our partners in freedom and peace for decades,  are reinforcing their territory because the President of the United  States has plunged us into the greatest transatlantic crisis in a  generation.\n\nAre we supposed to be…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Madam Speaker, I rise today to honor the life and  legacy of David DePetrillo, a tireless champion for Rhode Island.\n\nFor over three decades as our State's tourism director, David made it  his mission to showcase the best of Rhode Island, including our  historic landmarks, small businesses, and stunning coastlines.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688521/9999"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…northwestern  Ohio and every life touched by those she trained, thank you to Heidi  Hess. What a great American she is.\n\nI thank her for giving her heart and skills to others for decades. I  wish her joy, good health, and satisfaction in her well-earned  retirement. I and our citizenry are so proud and thankful for you.", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698529/recognizing-heidi-hess"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…this is investigated by States, by commissions,  and by prosecutors, the result is the same: no widespread voter fraud  conspiracy. There have been billions of votes cast over decades and a  teeny tiny percentage of fraud. That is not a crisis, and it certainly  is not a justification to rewrite the rules of democracy. But that is  what is happening with…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "Mrs. RAMIREZ. Mr. Speaker, I rise today to celebrate longtime Chicago  leader, organizer, and my dear friend, Amisha Patel, for her nearly  three decades of civic engagement and community organizing.\n\nFrom leading environmental justice efforts at just 19 years of age to  organizing Chicago care workers with SEIU Local 73, Amisha…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690325/national-fair-housing-month-amisha-patel"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…angry is what little has changed since the tipped wage  was frozen. Rent, food, gas, and childcare have all exploded, but  tipped workers are still stuck with a base wage from decades ago. That  is wrong.\n\nHowever, the bigger problem is the system was never built to work.  The law says that your employer has to make up the difference if your  tips don't…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698948/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…Recognizing the obstacles that female entrepreneurs faced  when entering and competing in the Federal marketplace, Congress  identified this goal as an uphill battle. Three decades later, we can  see how much of an understatement that was and how much more work has  to be done.\n\nEmpowering female entrepreneurs has long been a top priority of mine.  In…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691797/wosb-accountability-act"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…scientists,  titans of business, educators, doctors, and artists. Our community has  nurtured leaders in all walks of life, turning adversity into  opportunity in just five short decades.\n\nMany of these people are children of refugees or refugees themselves,  and they represent just a few of the countless contributions that  Vietnamese Americans continue to…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690347/recognizing-black-april"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…throughout his  career. As a young council member, he began a lifetime of service  rooted in a deep love for his people and a reverence for their  ancestral homeland. Over the decades, he grew into a statesman whose  leadership reached far beyond Towaoc, inspiring both Tribal and non- Tribal leaders alike all across this Nation.\n\nAs chairman, he helped…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696559/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…retirement and career of Stacey Mortensen, whose visionary leadership  has transformed public transportation across the Central Valley and  Northern California.\n\nFor more than three decades, Stacey has championed investments in  passenger rail that have connected communities, expanded opportunity,  and laid the groundwork for a more sustainable future. As Executive…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696403/recognizing-the-retirement-and-career-of-stacey-mortensen"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…term in the  U.S. Senate, beginning in 1981. It is a privilege to represent Iowans  and my home State here in the greatest deliberative body in the world.\n\nFor more than four decades and counting, I have joined my colleagues  here in this Chamber to debate public policy, shed light on wrongdoing,  and celebrate historic milestones. I have cast votes on…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691703/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…They were all born while Amy worked for me, and it has  been a great joy to watch them grow up.\n\nI ask my colleagues to join me in thanking and honoring Amy Sorensen  for her decades of outstanding public service to the people of Idaho  and this great Nation.", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694716/recognizing-amy-sorensen-as-she-prepares-for-retirement"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…Chief Butler has been a police officer since 2008 and became the  Independence Chief of Police in 2021. Meanwhile, Chief Kinney has  served the city of Medina for over two decades, becoming chief of  police in 2017.\n\nMr. Speaker, I commend Chief Butler and Chief Kinney for their  leadership in both Ohio's Seventh District and the whole State of Ohio.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697742/congratulating-the-independence-police-department"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…infrastructure, especially on the West  Coast, where permitting delays and overlapping approvals have made it  effectively impossible to lay new cables in certain areas for decades.  The chairman just described what we are talking about here.\n\nThese projects weren't stopped because they failed environmental  review. They were stopped because of bureaucracy.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699956/undersea-cable-protection-act-of-2025"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…eligible for services  or a vote in the local elections.\n\nProviding North Tustin with a unique ZIP Code will create certainty  for residents who have called North Tustin home for decades and provide  clarity for tax purposes to surrounding areas, and USPS.\n\nI thank Representative Boebert and the House Oversight and Government  Reform Committee for working…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693903/single-unique-zip-codes-for-certain-communities"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…freedom and  understand the profound cost at which it is preserved.\n\nFollowing his military service, Captain Blair continued to exemplify  these same values in civilian life. For decades, he has been a devoted  member of the Marion County community, respected for his humility,  integrity, and steadfast patriotism. Even in his later years, Captain  Blair has…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697045/recognizing-captain-floyd-blair"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…planet, including the  world's largest copper-nickel deposit.\n\nThe Federal Government routinely granted and renewed mineral leases  to these deposits beginning in the 1960s. Decades of planning,  exploration, investment, and environmental reviews have gone into the  region, and with good reason.\n\nThe minerals in the Duluth Complex include copper, nickel,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…Party, and is in  the House, it is the Honorable Congresswoman Maxine Waters. And I would  love for you to support this resolution specifically because, Madam  Waters, for decades, you traveled to Cuba dozens of times to visit  Fidel Castro personally, whom you considered your friend.\n\nCongresswoman Waters was in Havana, and she saw the destruction…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697160/denouncing-the-horrors-of-socialism"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…the Powder River Basin coal,  which accounts for so much of American energy and could generate even  more if Washington, D.C., had not waged a war on coal for the last  three decades.\n\nIn short, it is policies such as no new coal leasing contained in  this Buffalo RMPA that reduce affordability, which my colleagues on the  other side of the aisle will…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696878/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…to recognize Ken Stewart.\n\nKen is a proud resident of Ohio's Second Congressional District and a  former firefighter with the Batavia Fire Department. Ken spent over  four decades with the department, working his way up from lieutenant to  chief.\n\nThis past summer, at the age of 85, Ken participated in the 2025  World Police and Fire Games, an Olympic…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697115/recognizing-ken-stewart"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…permanent church home. Generations of families, like  the Campbells, the Haynies, the Richeys, the Olivers, and many more  have sustained and enriched the life of St. Mary's across decades,  ensuring its continued presence as a spiritual cornerstone of the  Lampasas community.\n\nToday, St. Mary's remains a thriving parish, carrying forward its  mission with more…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696051/recognizing-the-150th-anniversary-of-st-marys-episcopal-church-in-lampasas-texas"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…even the modest initial  segment from Bakersfield to Merced is going to miss its 2033 deadline.  Even if the train were to magically come into existence today, it would  be decades-old technology.\n\nIt is time to end this embarrassment for our State once and for all  and use our transportation dollars in ways that will actually benefit  the quality of…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691937/high-speed-rail-in-california"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…their paths and ranks differed, all shared a common purpose,  to defend our freedoms and protect the values that define the United  States of America.\n\nTheir careers reflect decades of sacrifice and discipline. They  represent the strength and resilience of our Armed Forces and the  patriotism of those who serve out of a deep sense of duty.\n\nSome among…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694579/recognizing-floridas-eighth-congressional-district-veterans"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…priority, ensuring each  child completed college and pursued careers in nursing, teaching, and  law.\n\nThe Kennedys made Poplar Bluff their permanent home in 1950. For two  decades Kathy raised her children while serving as a devoted wife and  mother and as an active leader in her church and community. She was a  charter member of Fellowship General…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696672/recognizing-anna-kathleen-cummins-kennedy"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…and Eva  Schuyler Danforth, Jerry devoted his life to service--first to his  country, and then to his people. He served honorably in the United  States Navy for over three decades, retiring in 1994 with the esteemed  rank of Force Master Chief, Naval Surface Force, U.S. Atlantic Fleet.  He was a veteran of both the Vietnam War and Desert Storm, embodying…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692114/recognizing-gerald-jerry-danforth"}]