[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…refuse to stand up for their constituents,  they diminish their power and Congress' and damage the country's  democratic future.\n\nAt the same time, Trump has undone Congress' decades-long ethics  rules and enforcement laws. In doing so, he has removed many of the  institutions and watchdogs that would serve as a check on his own self- profiteering.\n\nHe has…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…take years of  collaboration.\n\nMr. Chairman, that should be fostered and not dismantled by this and  future Congresses, which is why I urge my colleagues to support this  decades-long partnership by voting ``no'' on this bill.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698039/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…over 100,000  miles of lines can currently benefit from these technologies.\n\nImportantly, these technologies have minimal land use impacts, can be  installed without the decades-long permitting timelines required for  new lines, and increase the resiliency of the grid against wildfires  helping keep districts like mine safe from the growing threats of…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697895/electric-supply-chain-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…now she'd fight to save and       teach, And she traveled `round the planet, bringing hope       within her reach. On three hundred days of travel, every year       for decades long, Speaking, begging, preaching, pleading,       singing out her urgent song:\n\n``Every person makes a difference, every action matters       true, And the future of our planet,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696844/the-ballad-of-jane-goodall"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…This is especially true, given the Trump administration's naive,  waffling actions regarding Taiwan's status. It is important that this  body continue to stand up for our decades-long relationship as allies  and trading partners.\n\nThis bill is a sensible measure to warn China that the United States  is poised to act should it escalate its aggression toward…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699847/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…lives. Every single person alive today  owes something to that progress.\n\nYet, last week RFK, Jr. and his panel of antiscience, cherry-picked  cronies recommended ending the decades-long practice of immediately  vaccinating all newborns against Hepatitis B.\n\nThis will lead to more disease, cancer, and preventable deaths. It  will increase healthcare costs.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697767/vaccines-are-a-great-invention"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…elected to the Naismith Memorial Basketball Hall of Fame as a recipient  of the 2025 Curt Gowdy Media Award. Her induction into the Hall of Fame  stands as a testament to her decades-long commitment to advancing  women's sports journalism and her influential voice within the world of  basketball.\n\nA trailblazer in her field, Michelle Smith-McDonald became…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689730/9999"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Supreme Court, and Congress. I  also wish to recognize both the DACOR Bacon House Foundation and the  Diplomatic and Consular Officers, Retired (DACOR) organization for  their decades-long efforts to preserve this unique gem located in the  heart of our Nation's Capital.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692065/recognizing-the-dacor-bacon-house-bicentennial-day"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…the very important role that the continent of  Africa plays.\n\nTo be clear, AGOA is not just a priority for the Congressional Black  Caucus, although it is. It has been a decades-long bipartisan priority,  and it stands as a proud example of America's commitment to deepening  trust, stability, and shared prosperity with our AGOA allies.\n\nI strongly support…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…and stealing  their property that they should have had in their own bodies and in  their own lives.\n\nThe resolution is completely disoriented. It plainly feeds into the  decades-long Republican obsession with labeling the great programmatic  achievements of American democracy as socialism, including Medicare,  Medicaid, Social Security, public education,…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697148/denouncing-the-horrors-of-socialism"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…is, obviously,  dealing with the workforce--making sure that we have access to medical  care, housing, and behavioral health and to deal with what we know in  2023 was a decades long, uncovered, sexual assault and sexual violence  coverup in the Coast Guard.\n\nOperation Fouled Anchor identified 62 substantiated incidents of  rape, sexual assault, and…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688520/coast-guard-authorization-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…problems with that argument:\n\nFirst, these are children. Children do not belong in military  detention or military courts, and the fact that they are caught in the  middle of a decades-long conflict doesn't change that. A child does not  become an armed combatant deserving of prosecution and punishment in  the military justice system because of throwing a stone…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697313/palestine"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…moment. That is why we do what we do. It  is our own personal experience.\n\nIn the early eighties, my parents made a modest living. Neither of  them, even at the tail end of decades-long careers, ever made more than  $50,000. They made a modest living.\n\nIn the early eighties in Crown Heights, a rough neighborhood in  central Brooklyn, they bought their first…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the President sought $1 billion in  campaign donations from major oil and gas interests. He should reflect  on our Nation learning a hard, painful lesson from our decades-long  presence in long conflicts that dragged on. Tutoring other governments  to make them work is a deep, dangerous, and expensive hole that is  being dug by this administration. The…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…both Vice President and President. In April of 2001, Manier was first  elected as Mayor of Washington in a competitive election with four  other candidates.\n\nThroughout his decades long tenure as Mayor, Gary accomplished many  projects on behalf of the city of Washington. These include, but are  not limited to, the opening of the Five Points Community Center,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689608/commending-mayor-gary-manier-for-24-years-of-service-to-central-illinois"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…strong  faith in God. They are good friends who value education, hard work, and  community.\n\nI am proud to stand with the Lumbee and urge this body to vote today  to end a decades-long wrong.\n\nMr. ROUZER. Mr. Chair, I yield back the balance of my time.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…China and  all autocratic nations that lust after new territory and want it to  justify their own provocations. Again, it is not necessary. It is not  necessary given the decades-long, still-strong partnership that we have  with Greenland--again, a country that is willing to work with us  diplomatically, militarily, and otherwise.\n\nI am proud of the Alaskans…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…bipartisan work in  this institution is at risk.\n\nI ask my colleagues: How would you feel if a project like this in  your district that was passed unanimously and fulfilled a decades-long  promise was vetoed anyway? That is what these rural communities are  facing.\n\nMr. Speaker, my constituents are watching, and your constituents are  watching, to see whether…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698701/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…sources of revenue, which was a really  bad idea. That is why Trump pulled out.\n\nHere is the reporting over the period here:\n\nHamas-Iran alliance: Captured documents expose decades-long       terror funding.\n\nWhen Israel began to liberate Gaza from Hamas and drive out Hamas  terrorists, they found a treasure trove of documents showing the  history between…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Pennsylvania dairymen know just how  important food additives are for the safety of our food supply.  However, the FDA's approval process for these additives has resulted in  a decades-long approval process that stifles innovation and leaves  American farmers falling behind their international competitors.\n\nI am proud to join a bipartisan group of Members on…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688957/president-trump-bringing-back-investments"}]