[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Americans, including 80,000 Washingtonians,  who are not going to be able to have affordable insurance by the end of  this year. They will have to make a decision in November and December,  but we already know from projections, 80,000 of them will make a  decision because they just simply can't afford it.\n\nBack to those numbers that were on the chart earlier:…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695964/en-bloc-nominations"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…today to recognize the public service  of Rev. Dr. Della J. Owens-Barber in advance of her fourth anniversary  banquet as Senior Pastor at the Saint James Christian Church on  December 7, 2025. Rev. Dr. Owens-Barber is a dedicated pastor, scholar,  community leader, and advocate for spiritual and social transformation.  Over the past decade, she has played…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697322/recognizing-the-dedicated-public-service-of-reverend-dr-della-j-owens-barber"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…1966, the  CYO allowed St. Augustine and Xavier Prep to compete in its tournament,  and the Knights of Columbus ceased running its annual track and field  meet.\n\nOn Friday, December 12, 1975, in Strawberry Stadium. located on the  campus of Southeastern Louisiana in Hammond, Louisiana, the Saint  Augustine High School Purple Knights achieved their first…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695287/recognizing-the-50th-anniversary-of-an-historic-athletic-achievement-in-the-history-of-the-louisiana-high-school-athletic-association-lhsaa"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…weeks to go, and then they have to send the check in to get the  coverage for January 1. So the Republicans have waited until 2 weeks  left to go.\n\nIn Massachusetts, it is December 23. That is the last day, and people  have to send in the check to cover. It is 2 days before Christmas. Can  you imagine 22 million families all trying to figure out how…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…retiring after more than 20 years  of dedicated service on the Blakely City Council. An event to celebrate  his extraordinary career in public service will be held on Tuesday,  December 16, 2025, at the Al Hutchins Community Center in Blakely,  Georgia.\n\nCouncilman Hutchins has devoted 25 years and 4 months to public  service in our region, including more…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698107/recognizing-the-honorable-al-hutchins"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…many nearly identical  stories from pilots, students studying to be pilots, and air traffic  controllers, their coworkers, and their families.\n\nAs many have mentioned, in December 2023, the FAA finally recognized  the need to reform those current policies and established a committee  to identify barriers to mental health care for aviators to present…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695007/mental-health-in-aviation-act-of-2025"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…country, about our own government. This is  alarming when an app is the top news source of Americans under the age  of 30. Let me give some examples of these practices.\n\nIn December 2023, Rutgers University found that TikTok's algorithm  disproportionately amplified anti-Israel and, by extension, anti- Semitic content compared with other social media…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692683/tiktok"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…administration?  Well, under the Biden administration, Ghislaine Maxwell was prosecuted  for conspiring to sexually abuse and traffic girls in 2020. In 2021,  she was convicted, in December of 2021, after a month-long trial in  Judge Nathan's courtroom. In 2022, Maxwell was sentenced to 20 years in  prison under the Biden administration for sex trafficking and…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696807/epstein-files-transparency-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…from Trump's tariffs and a weakening economy,  Republicans have refused to extend the Affordable Care Act premium tax  credits for working class families, which will expire December 31,  2025. I include in the Record a note from a constituent named Shemeka  who captures how devastating the loss of the enhanced tax credits will  be for her family.\n\n``I…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698417/healthcare-is-real"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…religions with Christians, Muslims, and Jews. On today  of all days, I note his efforts to combat international terrorism,  helping lead the effort to the Brussels Declaration in December 2001  calling on leaders of all religions to condemn violence and forswear  the use of religious justification for terrorism and mistreatment.\n\nHis All-Holiness is also a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695345/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, the Jewish Business Network, JBM, will be  recognizing a group of outstanding business leaders at their breakfast  in Tarrytown tomorrow, Tuesday, December 16.\n\nThe individuals saluted have made a positive impact on the business  community in the region of Westchester County and surrounding counties.\n\nThose to be honored include:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698121/recognizing-jewish-business-network-awardees"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…also a leading  participant in charitable giving around town. They were a pioneer of 19  Days of Norwich, an annual holiday drive where businesses donate a  portion of their December sales to the local food shelf. During the  rest of the year, they put on numerous fundraisers--selling creemees,  pizza, and wine tastings, all to benefit local nonprofits.…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694332/recognizing-dan-whits-general-store"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…able to pay  for it. We will continue to raise these stories because too many people  are depending on Congress to act. Their lives literally depend on it.\n\nHopefully before December 31, we will find the political will to  extend these tax credits. If we don't, we better come up with a  solution to ensure that Americans all across this country can access…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…one, should  already be law. They were already agreed to last year as part of a  bipartisan, bicameral legislative package that was set to be passed and  signed into law in December before Elon Musk intervened and killed the  agreement.\n\nThat package included important provisions that would have lowered  costs for hardworking Americans, but instead of…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690270/american-music-tourism-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…both racism and misogyny to       become the highest-ranking Black woman in the military during       WWII.\n\nCharity Adams-Early was born in Kittrell, North Carolina on       December 5, 1918, two years before women's suffrage, where       segregation and racial prejudice were social norms. She often       faced challenges that tested her resilience, but…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688375/recognizing-virginias-fourth-district-black-history-month-essay-contest-1st-place-middle-school-winner-augustus-rezba-patel"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…resolution disapproving the action of the District of  Columbia Council in approving the D.C. Income and Franchise Tax  Conformity and Revision Temporary Amendment Act of 2025.\n\nOn December 20, 2025, the District of Columbia Council enacted,  without the Mayor's support, legislation to decouple areas from the  Federal tax code and deny District residents and…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Energy and Natural Resources Committee, as well  as the cloakroom teams, to make sure we were able to be successful  today.\n\nThe Senate passed all four of these measures last December, so we  have seen them once. Now we have seen them twice. But the House ran out  of time at the end of the last Congress to take them up, so we are  where we are. But now…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692655/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…EFFECTS ON DIRECT SPENDING AND REVENUES OF LEGISLATION CONSIDERED UNDER SUSPENSION OF THE RULES IN THE HOUSE OF                                     REPRESENTATIVES WEEK OF DECEMBER 1, 2025 ----------------------------------------------------------------------------------------------------------------…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697191/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "Mr. EZELL. Mr. Speaker, I rise today to recognize a distinguished  public servant from Hancock County, Mississippi, Brian ``Hooty'' Adam,  who will retire on December 21, 2025, after more than four decades of  serving his community.\n\nHooty began his career in 1985 as a firefighter, answering the call  when his neighbors needed him most.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696876/recognizing-brian-hooty-adam"}, {"senator": "Mike Kelly, Jr.", "party": "Republican", "sentence": "…service to the  veteran community of Crawford County and the Commonwealth of  Pennsylvania.\n\nPhil Davis proudly served in the United States Army from January 21,  1970, to December 3, 1971. He deployed to Vietnam from January to  October 1971, serving his country during one of the most challenging  periods in our Nation's history.\n\nOn November 28, 1988,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697105/recognizing-phil-and-laurie-davis-as-a-community-champion-in-pennsylvania-16"}, {"senator": "James Risch", "party": "Republican", "sentence": "…notification relates to enhancements or upgrades from the       level of sensitivity of technology or capability described in       the Section 36(b)(1) AECA certification 22-71 of December 6,       2022.            Sincerely,                                                 Michael F. Miller,                                                          Director.…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694372/arms-sales-notification"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…2025.\n\nSponsored by Representative Begich, this legislation would extend the  Alaska Native Vietnam era veterans land allotment program for an  additional 5 years, to end on December 29, 2030.\n\nAlaska Natives have long experienced land-related hardships.  Recognizing this, Congress passed the Alaska Native Claims Settlement  Act in 1971 to settle the aboriginal…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693474/alaska-native-vietnam-era-veterans-land-allotment-extension-act-of-2025"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…Federal  Communications Commission designated Huawei as a national security  threat, and it banned the sale of its telecommunications equipment here  in our country. This past December, Congress also secured the remaining  funding to enable smaller rural communications companies to rip that  risky Chinese-made equipment out of their networks.\n\nIn 2022, the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690666/fact-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…President, now I hope we can move to the next bill  that, to be honest, should be even easier because the bill I am going  to try to pass right now passed the U.S. Senate in December,  unanimously. It already passed, so this should be a no-brainer. I hope  my Senate colleague from California is on the floor here ready to give  this bill his full endorsement…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696137/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…kept in  touch, wanting to donate her time with us in ``blue skies'' as well.  She completed the agency's stringent 3-day VITA (Volunteer Income Tax  Assistance) training in December and became IRS certified to assist  low-to-moderate income families throughout tax filing season. Donna  volunteers her time as a tax preparer, working one on one with  families,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692146/recognizing-donna-telesco"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Lieutenant Colonel Boyd ``Buzz''  Wagner.\n\nBuzz completed his flight training in 1938 before he was assigned to  the Philippines. When Japanese forces attacked the Philippines in  December of 1941, Buzz quickly shot down five Japanese planes, making  him the first ace pilot of World War II.\n\nBy April of the following year, Buzz was credited with eight air-to-…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689611/supporting-reversal-of-california-ev-mandate"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…submitted by       the Department of Energy relating to ``Energy Conservation       Program: Energy Conservation Standards for Walk-In Coolers       and Walk-In Freezers.'' The December 23, 2024 rule adopts       amended energy conservation standards for walk-in coolers and       walk-in freezers impacting commercial vendors who store food,       beverages,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689262/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Speaker, I rise today in support of Representative Matsui's bill,  the Reversionary Interest Conveyance Act. This legislation previously  passed the House by voice vote last December.\n\nThis bill resolves the stubborn property law issue afflicting a small  parcel of land in California. The current owners of an eight-acre  property in Sacramento recently…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691119/reversionary-interest-conveyance-act"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…distinguished Tribal leader, a decorated  Navy veteran, and a beloved husband, father, and grandfather, who  passed away on the morning of June 1, 2025, at the age of 78.\n\nBorn on December 24, 1946, in Oneida, Wisconsin, to Leslie and Eva  Schuyler Danforth, Jerry devoted his life to service--first to his  country, and then to his people. He served honorably…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692114/recognizing-gerald-jerry-danforth"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Township, Blair County,  Pennsylvania, on the designation of their farm as a Century Farm by the  Pennsylvania Department of Agriculture.\n\nJames Black purchased the farm in December 1920 at a cost of $28 per  acre for 140 acres. He raised chickens on the farm.\n\nFamily ownership was passed down through the years to Samuel Black,  who transitioned the operation…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696753/improving-domestic-energy-market"}]