[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…increase. A family of  four making about $64,000 a year is going to pay 920 percent more for  healthcare premiums. Obviously, that is going to mean they have to  decide whether they are going to go without or somehow, some way, try  to find a way to pay that, which they really won't be able to do.\n\nLet me give some starters to make it very concrete about…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…cut, but what it is doing to me is forcing me to either cut services or  raise taxes at the State or at the local level.\n\nCongress has 22 days for Republicans to decide whether we are going  to have a government shutdown because they have made clear from day one  that they are in charge. They have made clear from day one that the  President can just…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…courts. He has  disrespected the orders of the court. When the courts have said to him:  Even if you differ with our orders, you have to appeal these orders.  You cannot decide that you are going to proceed notwithstanding the  court's failure to implement the orders that you think should be  implemented.\n\nThis President has decided that judges should be impeached…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692296/and-still-i-rise-denouncing-the-presidents-authoritar-ianism-and-recognizing-the-impeachment-warriors"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…remember when y'all wouldn't  sign the discharge petition. All of a sudden, everybody wanted to vote  for this, but you wouldn't sign the discharge petition.\n\nUntil we decide that we are going to go after the actual rapists and  pedophiles, miss me with your moral high ground.\n\nFolks who also took money from somebody named Jeffrey Epstein, as I  had my team…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696889/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Justice Department to punish people who are perceived to  be, in his mind, persons who have harmed him in some way by simply  prosecuting him.\n\nNow, look, if we can all decide that we are going to indict the  prosecutors in our cases, then we are not going to have a rule of law  in this country. What happens to the rule of law if everyday people,  like you…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…its number that is packed with people from District Nine.\n\nAnother way to look at it, to simplify, if you have two pies, and you  take a slice out of one pie and you decide you are going to add it to  another pie, but only take two slices from the other, and then you  combine them to create three pieces of pie, there would be two pieces  from the Ninth…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…later today, I will bring these Articles of  Impeachment to the floor, and I will call for a vote. I believe that  the hour of decision is upon us, and we all have to decide: Are we  going to go down and choose the path of democracy, or will we allow  ourselves to choose the low road of autocracy?\n\nI believe that this country has come too far to allow…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692829/government-of-the-people-by-the-people-and-for-the-people"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Speaker, Republicans have to decide if they are going  to protect pedophiles or seek justice for survivors of sex trafficking  and abuse.\n\nI sat across from survivors--some of them were as young as 13 and 14  at the time--and…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696833/epstein-remarks"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…you  the necessary strength to bring peace about.\n\nYou may have calm, but you won't have peace, and you won't have the  kind of peace that will be lasting if you just decide you are going to  stop the killing. Stopping killing does not bring about peace. It just  brings about an absence of a certain amount of tension.\n\nDr. King reminded us that if you…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…healthcare coverage next year, and the same  thing is going to be true in 49 other States in our country and in the  District of Columbia.\n\nThey are going to have to decide if they are going to keep their  coverage at all, and for those who do keep it, it is going to  skyrocket. And we don't know yet the final number of how many people  are trading their…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…something that I condone now. I condemned what  happened then. My mind has not changed. The people who will suffer will  still suffer.\n\nMr. Speaker, why would I now decide that I am going to bless, if you  will, condone, a CR that continues what happened, when my Republican  colleagues did what they thought was right, I assumed, and passed the  legislation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695807/censured-but-not-silenced"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…on the table for all of her seven kids. She is  living on the edge--what a horrible story to hear.\n\nCan you imagine those beautiful redheaded kids? And they have to  decide who is going to get the eggs, who is going to get the  vegetables, because she doesn't have enough money, and SNAP doesn't  give her the food she needs to feed her family.\n\nSo here…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698199/new-york"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…turns out the morality if we would help our brothers be  healthier--but we have to do it through the farm bill. We have to do it  through nutrition support. We have to decide we are going to have  access to glutides and other things. Are we going to use technology,  the wearables and the other things? I have one of those data rings on.\n\nWhat would happen…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "John Thune", "party": "Republican", "sentence": "…having it controlled by the insurance companies. Now, you still  get your insurance in the Marketplace, but now you would have more  dollars at your discretion to decide how you are going to use them.  Instead of taking a silver plan in the ObamaCare exchange, you might  take a bronze plan. A bronze plan would mean you are paying less for  it, sometimes…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Our manufacturers, unlike some  of these other industries, have to compete against companies abroad.\n\nMr. Speaker, when these big multinational corporations have to decide  if they are going to set up shop in Germany or Korea or Brazil or India  or wherever, we want it to be favorable taxwise to set up shop in the  United States. Therefore, I do believe…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…wants to sell directly to consumers, bless them. If a co-op wants to  get together with your Medicaid system, the hospital system, or  insurance company and they decide that we are going to manufacture our  own and we are going to do it cheaper than the government-subsidized  price, then bless them.\n\nThere are ways to crash the price of healthcare.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…use of  nationwide injunctions. His legislation is called the Judicial Relief  Clarification Act. It makes it very simple. It is an important piece of  legislation to decide how we are going to handle cases like this. It is  very simple: Courts decide the cases in front of them. That had been  the practice up until the early 1960s. We need to get it to…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691654/nationwide-injunctions"}]