[{"senator": "Haley Stevens", "party": "Democrat", "sentence": "…a man  named Steve Rattner in the halls of President Barack Obama's transition  office. I am nearly convinced, Mr. Speaker, that as he heard my thick  Midwestern accent, he decided to bring me on as his Chief of Staff  needing someone from Michigan who didn't have ethical conflicts with a  managed industrial bankruptcy of General Motors and Chrysler.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…know. I know who you are. I know where you are going. I know what  you  want to do. I have suffered what you would return to if you could. I  know. Yes, I see how you have decided that you, and you alone,  determine what the law is in this country. You, and you alone, will  decide whether a person should be locked up or released, unlike what  the Constitution…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…before leaving town for recess, not the least  of which is passing the 12 funding bills for fiscal year 2026. Having  passed only two bills, it is absurd that Republicans have decided to  pack it up early.\n\nMeanwhile, millions fear what Republican cuts to Medicaid will mean  for their families. Shoppers are tightening their belts because of  record prices…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694074/time-to-deliver-results-for-american-people"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…stand by these foundational principles of our democracy.\n\nRegrettably, Republicans rejected my request. In fact, rather than  post my legislation to stop corruption, they decided to not even post  their legislation.\n\nThen when I asked for a commitment to include a prohibition on owning  crypto by the public officials writing the laws and rules governing…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…a message to Norway's Prime Minister.  I want the President's words in the Record because the American people  deserve to hear them.\n\n``Dear Jonas, considering your country decided not to give me the  Nobel Peace Prize for having stopped eight wars plus, I no longer feel  an obligation to think purely of peace.''\n\nNow, let's listen to that again. Since…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Texas. That could still be  possible. I just hope all are well-trained, and that it is a redline  that you never attack a peaceful protester.\n\nSo far, the Portland protesters decided to engage in joy and whimsy.  They have just frustrated the hell of the Trump team because they want  riots. No, there is the ``pastries and pajamas'' team, and there is the…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…us just to not try at all, not to strive and dream for more,  to stay in a lane that society has set for us.\n\nMr. Speaker, we have so many representations of women who have  decided ``no.'' Like our Vice President says, we just eat ``no'' for  breakfast.\n\nRepresentation matters. The fact that young girls and boys will soon  be able to see the contributions…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689366/womens-history-month"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…health of our Republic  depends on the proper use of our military against foreign adversaries  and threats from abroad.\n\nBut the President of the United States, in effect, has decided that  he will use our National Guard as a police force, supplanting local and  State police. And the damage is done not only to institutions--which  should be supported and…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696345/trump-administration"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…resources, de-escalation tactics, and more to  keep our neighborhoods safe.\n\nCVI strategies are proven, evidence-based solutions to gun violence,  and yet the Trump administration decided they are inefficient.\n\nHouse Republicans are complicit in the Trump agenda to endanger  public safety. In the dead of night, Republicans added a provision to  their budget…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691753/national-gun-violence-awareness-month"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…through  executive action that Congress had created.\n\nAs a reminder, Congress and only Congress, under Article I--this is  something that the Founders in their great wisdom decided was  important, the separation of powers, something we all learn early on.  Apparently, not too many of my colleagues on the other side have  incorporated this message: Congress…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…elected that it was one  of the main reasons that he won. But as soon as the election was over,  he ignored that promise.\n\nInstead of working to lower costs on day one, he has decided to start  the dumbest trade war in U.S. history, which is already increasing  costs for American households and damaging our economy.\n\nSo let's take a step back and talk about…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690534/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…rode down from  Providence--miles down--to where the Gaspee was stranded.\n\nThat is where that incident began. It was those men in those  longboats on that moonlit night who decided they were going to rid  their beloved Narragansett Bay of the wretched and detested Gaspee, so  they ended up shooting the captain of the vessel, Lieutenant  Duddingston.…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…end to some of the truly unacceptable and  partisan retaliation we have seen from the Office of Management and  Budget by telling this administration exactly how Congress has decided  funding must get spent. That is a huge improvement from the status quo  we have with Republicans' yearlong slush fund CR that gave Trump and  Vought way more power to decide…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698874/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…guidance says that only babies whose mothers test positive  for hepatitis B or whose status is unknown should receive the vaccine.\n\nFor every other baby, the committee has decided not to give a  recommendation.\n\nIf acting CDC Director O'Neil approves this recommendation, countless  babies will be at risk of liver disease and other long-lasting health…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697786/attack-on-childrens-health"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…Noem and reminding her that she said  they were going to get the worst of the worst: the murderers, the  rapists, and the sexual offenders.\n\nShe is not doing that. They have decided they are going to get  anybody who is in the country improperly, and that is wrong.\n\nI will write the Trump administration and ask them to take ICE out of  Memphis. It shouldn't…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696772/take-ice-out-of-memphis"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…were 12 nationwide injunctions that were issued.  Then under President Trump, the first term, there were 64 nationwide  injunctions.\n\nMore and more individual district courts decided: I have an opinion,  and I am not going to decide about the case in front of me; I am going  to decide about the entire country.\n\nUnder President Biden, there were 14 nationwide…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691654/nationwide-injunctions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…battle going on here between the Senate and  those of us in the House and those of us on Ways and Means.\n\nA number of our brothers and sisters over in the house of lords have  decided that we have current tax policy from the 2017 TCJA, the tax  reform, which I was on the committee and was one of the people who  helped author that, but they expire at the…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Absolute Definition of Insanity\n\nMr. KILEY of California. Mr. Speaker, yesterday Governor Newsom  introduced his budget proposal in Sacramento and has decided to double  State funding for high-speed rail. This is the absolute definition of  insanity. It has been some 16 years, 17 years since the project was  approved. They have…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691353/governor-newsom-backs-down"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Congressional Patriot Award. Pat has dedicated himself to faithfully  serving our community and country.\n\nAfter receiving over forty Division I scholarship offers, Pat  ultimately decided to play football at the University of Notre Dame as  a member of the Fighting Irish's 1988 National Championship team. He  graduated in 1990 with a bachelor's degree in business…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694136/recognizing-congressional-patriot-award-recipient-pat-terrell"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…families tax cut bill, resulted in immediate investment. A  $2.5 billion investment in Harrodsburg, in Mercer  County, Kentucky, in my district where Apple--making the iPhone-- decided to move jobs out of China to Kentucky. Now, as a result of the  President's leadership and this Republican Congress and the working  families tax cut bill, all the Gorilla…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…rise today to recognize C.J. Jones and  Isaac Corcoran of the Ross County Junior Fair Board.\n\nC.J. and Isaac had a desire to help address hunger needs in their  community and decided to participate in the Fight the Hunger, Stock the  Trailer program, run by Farm Credit Mid-America and Rural 1st.\n\nThis program challenges junior fair boards to collect as…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699469/recognizing-cj-jones-and-isaac-corcoran"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…back to  2014.\n\nThe IBLA receives on average 290 appeals per fiscal year. Of those  cases that are not resolved on jurisdictional or procedural grounds,  only 2 percent are decided in favor of the appellant and against the  agency.\n\nAs instituted, the IBLA is not only falling short of its stated  mission for impartiality, but creating further burdens…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691037/expedited-appeals-review-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…They have  destabilized our hemisphere, creating openings for malign influence  from China, Russia, and Iran. Year after year, they have killed  thousands of Americans.\n\nWe decided long ago that we would not tolerate threats to the  American people from terrorists like al-Qaida and ISIS. We shouldn't  tolerate them from narcoterrorists either.\n\nYesterday,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698238/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…scorn of the entire  world. He is. That is why we are here.\n\nIf my colleagues didn't think this was a concern, they would have  simply made a motion to table, but my colleagues decided to refer it to  committee because they know this is a problem. They know this is not  the kind of conduct you want in a Member of this body.\n\nI think that the gentleman from…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696887/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…themselves. MSNBC proves that every single day.\n\nThink about the statement just made about NPR. Uri Berliner, an  award-winning journalist who worked for NPR for over 20 years, decided  NPR had lost its way and asked a basic question: What is the political  affiliation of the editors for NPR in the Washington, D.C., area? Guess  what he found? Eighty-seven…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692525/rescissions-act-of-2025"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…of him as a  criminal.\n\nBut I find out, on a Sunday night, that we have somebody in the  bowels of the DC District of the U.S. attorney--an assistant U.S.  attorney--who has decided to pursue an investigation and seek an  indictment of prosecution against 2 minutes of testimony in the Banking  hearing that I attended. I not only attended that Banking…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…single women,  we would be better off retracing our steps back to the great society  years of 1965 and 1966 when, in my opinion, the worst President in our  country's history decided to institute these programs and destroy the  family. I am not sure that was the motive. I think perhaps the real  motive was electoral.\n\nOur forefathers, when they put together…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…John is the senior pastor of First Baptist Church of Sarasota and has  been the pastor for many, many years. John committed his life to Christ  in his childhood and ultimately decided to pursue a career in the  ministry.\n\nHe is a proud graduate of Mercy University and Southwestern Baptist  Theological Seminary, where he earned his master of divinity degree…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691358/welcoming-dr-john-cross"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…fought to bankroll with another 450 billion taxpayer  dollars.\n\nTo test the program's safeguards against fraud, the GAO said: We are  going to conduct an experiment. So they decided to make up 24  fictitious applications, and they did these quite sloppily. They made  up names, addresses, information. They left out some required  information on these 24…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699102/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the Chief Executive is carrying out the laws  to remove dangerous individuals from the United States of America.  Then, an activist district judge in the District of Columbia decided  that, in his view, he had to step in. He had to step in to try to  assert his jurisdiction where it did not belong to try to stop the  President of the United States from…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689708/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}]