[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…the team as a civilian without missing a beat. A veteran of six  inaugurations, her meticulous attention to detail improved all our  plans, and her calm professionalism and decisive leadership preserved  essential elements of the ceremonies while still ensuring the  President-elect was sworn in on time. Stefanie Muchow from Leader  Thune's office provided…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…funding verification and  nonproliferation, and a role in insisting that arms control remains a  core pillar of the U.S. national security policy.\n\nThe next few years will be decisive, and decisions that we make or  fail to make will shape whether the world moves toward stability or  toward, once again, unconstrained nuclear arms races.\n\nI look forward…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…earned the respect and esteem of  many. In the wake of her departure, I know her numerous contributions  will not be forgotten. I am confident that her fine character and  decisive leadership will be sorely missed.\n\nAgain, I thank Lisa Gissendaner for her distinguished career serving  our community and congratulate her for being this week's 13th  Congressional…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691972/recognizing-lisa-gissendaner"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…face real consequences.\n\nMr. Speaker, check fraud is a growing problem, but today, we, in a  bipartisan way, in the Ways and Means Committee are finally taking  commonsense, decisive action. This bill passed unanimously out of our  committee, and I look forward to it passing unanimously out of this  House. It is, once again, an opportunity for Republicans…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689292/recovery-of-stolen-checks-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…to  veterans in our region.\n\nMr. Speaker, 128 private rooms are organized into households and  neighborhoods around a central community center. The site actually  played a decisive role during World War II in intercepting enemy  communications, including the message that helped pave the way for the  D-Day invasion of Normandy.\n\nIt is fitting that a place…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698917/korean-american-day"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…bipartisan delegation to  Honduras when he was President. We refused to meet with him because he  is/was a thug.\n\nThis is not a minor case. This is not a close call. This was a  decisive conviction for crimes that have devastated American families  and fueled violence and instability abroad. Yet, President Trump chose  to use one of the most powerful powers…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697367/shameful-hernandez-pardon"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…Division 9 championship.\n\nIn a hard-fought match, the Lady Eagles fell behind two sets to one  before rallying back with determination and grit to take the lead. They  forced a decisive fifth set, battling point-for-point until the score  was tied 12-12. Senior Zaira Garcia then delivered back-to-back kills,  sealing the championship for South El Monte.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697339/congratulations-to-the-lady-eagles-volleyball-team"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…Crossroads Highway       Products, LLC; Dane Shulman Associates, LLC; Daniel Kramer,       Kramer Trial Lawyers APC; Debski Law; Decision Point Strategy       Group, LLC; Decisive Discovery; Del Camino Jesuit Border       Ministries; Demand Justice; Democracy Forward Foundation;       Derrick Law Group; Diehl & Weger, AAL, ALC; Dignidad;       Disability…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689713/no-rogue-rulings-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…part of the process. I  commend them. But, sadly, three votes on the other side of the aisle  wasn't enough. We needed one more.\n\nAnd who swooped in to cast his vote--the decisive vote? Vice  President Vance. He showed up at the last minute and cast a tie- breaking vote in the Senate to push the bill across the finish line.\n\nA few short years ago, then-Vice…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693251/one-big-beautiful-bill-act"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Orleans and in recognition of  ever-present and evolving threats, I urge my colleagues to support the  Securing the Cities Improvement Act.\n\nLet's honor the victims by taking decisive action to protect our  Nation from future atrocities and future acts of cowardice. We are  America. We stand firm in our protection.\n\nMr. Speaker, I encourage my colleagues…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688698/securing-the-cities-improvement-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…all while supporting strong public schools.\n\nFor his outstanding devotion, he earned the respect and esteem of  many students and educators alike. While his character and decisive  leadership will be sorely missed, I am confident that his numerous  contributions will serve as an inspiration for everyone in the wake of  his departure.\n\nCongratulations…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690330/recognizing-superintendent-jeff-wendorf"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…least 19 deaths. These devices, often essential for low-cost       and sustainable transportation, should not pose a danger to       users or communities. This bill takes a decisive and       necessary step by requiring the U.S. Consumer Product Safety       Commission (CPSC) to establish a, enforceable safety standard       for rechargeable lithium-ion…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Speaker, I thank the President of  the United States, Donald J. Trump--I know it pains my colleagues to  say that, ``President of the United States Donald J. Trump''--for his  decisive action. I thank him for calling both sides out on the cease- fire.\n\nI point out to my colleagues on the other side of the aisle that, as  of right now, the cease-fire is holding,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…pinned down, he maneuvered into harm's way, drawing the  suspect's attention and likely saving Lieutenant Moyer's life.\n\nThese are not routine acts of bravery. They are rare, decisive  moments that speak to the highest ideals of law enforcement. Their  courage, humility, and service remind us what public safety truly  means.\n\nI am grateful to Lieutenant…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695077/recognizing-trivits-family"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…significant responsibility in perpetuating  the demand for these species, which drives destructive practices in  coral reef ecosystems worldwide.\n\nWe have an opportunity to take decisive action. My Saving NEMO Act  would prohibit the importation into the United States of protected reef  species taken through unsustainable or destructive practices. Going  beyond…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688918/saving-nemo-act"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…tens of thousands of dollars, adding up  to billions and billions of dollars that are going to be borne by these  businesses.\n\nI am grateful President Trump has taken the decisive action to halt  these rules by having the Department of Energy postpone the effective  date of these standards, providing breathing room for businesses.  However, more work…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689262/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…do a little bit  more walking and get outside a little bit more as well.\n\nAgain, I will finish up and say I am ecstatic that the Trump  administration has taken this bold, decisive action and is breaking  with decades of failed thinking. We are finally putting America on a  realistic path to a healthier living that puts eating real food at the  center.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…regime  has denied them on the ground. They need us to restore economic  sanctions, as the President is doing against the regime in a renewed  boycott of Iran.\n\nMr. Speaker, decisive turning points in history do not come often.  When history commands, we must answer. That answer will follow us far  into the future.\n\nThis time and in this hour, let the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…then has significantly declined.\n\nThe prevalence of fentanyl-related substances and continued  trafficking of dangerous narcotics across our southern border requires  strong, decisive action from our Congress.\n\nAccording to the DEA, there were more than 36 million fentanyl pills  and nearly 4,000 pounds of fentanyl powder seized in 2025. This  represents…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692347/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…United  States and our allies in the region.\n\nA nuclear-armed Iran is a threat to our servicemembers in the region  and a threat to the entire Western world. President Trump's decisive  action this weekend stomped out the threat of an unstable nuclear  power. For that, the world is grateful for his leadership.\n\nIt is now time for the Iranian regime to negotiate…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692792/operation-midnight-hammer-success"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…workers and suburban women and urban voters.  They came out in record numbers to join the Republican Party and the  America First agenda with President Trump.\n\nThat election was decisive. It was a bellwether. It was a time for  choosing, and I will tell you what, the American people chose  overwhelmingly. They chose the Republican Party. The reason they did…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…operating in and around the Caribbean Sea. That really says it all, and  not much more needs to be said, but I do have a few comments on this.\n\nPresident Trump has taken decisive action to protect thousands of  Americans from lethal narcotics. He has kept drugs off the streets,  kept children alive, and eliminated narcoterrorists who have been  profiting…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696565/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…commerce. And the Islamic Republic kept marching toward a  nuclear weapon. And in response, Israel took the next logical step to  restore deterrence.\n\nOnce again, innovative and decisive strikes destroyed Iran's air  defenses and imposed immediate--immediate--costs on Tehran. Leaders  across Israel's politics stood united behind the daring operations.\n\nAh,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692870/9999"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…in the future? Do we want to create a dystopian world and make everyday  Americans subservient to the Chinese Communist Party and their  affiliates, or do we want to make a decisive stand to stop some of the  most advanced technologies from being used against us in every facet of  our lives?\n\nLoopholes currently available in U.S. export control allow…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698859/remote-access-security-act"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…Texas age verification  law. Whether they apply strict scrutiny or a lower form of judicial  review, it is abundantly clear that the SCREEN Act is the answer.\n\nWe must take decisive action to protect our children from the scourge  of pornography. I urge the House and Senate to act swiftly in passing  the SCREEN Act so that President Trump can sign it…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688197/blocking-and-filtering-software-is-ineffective"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…to recognize the  pivotal role this site played in our Nation's war for independence.\n\nThe Battles of Saratoga were the most significant turning points and  one of the most decisive American battles of the Revolution. British  General Burgoyne tried to seize control of the strategically important  Hudson River Valley, but his campaign ended in defeat…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691016/strengthening-americas-turning-point-act"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…and  national security, and in some cases, impose a significant financial  burden on our economy. It is absolutely essential that the Department  of Homeland Security take decisive action to address these complex  threats both at home and abroad.\n\nThis is why I have reintroduced H.R. 708, the SHIELD Against CCP Act.  This legislation requires DHS to…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688749/strategic-homeland-intelligence-and-enforcement-legislation-to-defend-against-the-ccp-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…discussed relative to trade:  trade barriers, tariffs, currency manipulation, and nonmonetary  tariffs. These will mean wins for the American worker.\n\nPresident Trump is taking decisive action, pausing tariffs for 90  days, except for China, as nations have come to the table.\n\nAs I have made clear multiple times now, when it comes to the pause  on the National…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…for their  mistakes.\n\nWhile some States look the other way, my home State of Mississippi  has tried to rein in this abuse in the trucking industry. Mississippi  has taken decisive action and, in just the last 3 months alone, has  identified 85 illegal drivers and referred them to Immigration and  Customs Enforcement.\n\nThe State of Mississippi does not…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697478/commercial-drivers-license-system"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…in her mind  during this traumatic experience, she responded: Jesus.\n\nMr. Speaker, I ask my colleagues to join me in honoring this  remarkable young woman. Because of her decisive actions, her mother is  alive today and doing much better.\n\nI also want to recognize and thank Brenda Dawes for her service to  our community. Because of her calm guidance…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699061/recognizing-josie-pethan-and-brenda-dawes"}]