[{"senator": "Gary Peters", "party": "Democrat", "sentence": "…prioritize their bottom line, and the  needs of students and families will be second.\n\nIf confirmed as Secretary of Education, the quality of our American  education will certainly decline, and our children will ultimately  suffer the consequences.\n\nI would urge my colleagues to vote no on Mrs. McMahon's nomination.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688249/nomination-of-linda-mcmahon"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…me say a word about Venezuela. In 2018, I had the opportunity to  visit Venezuela--a once prosperous, albeit imperfect democracy,  suffering terrible economic and political decline under the disgraceful  and failed leadership of Nicolas Maduro.\n\nI told then-President Maduro that if he rigged any upcoming  elections, Venezuelans would be even more isolated…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696557/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…chaos bring global trade to a halt. The Port of Long Beach is expecting  similar declines.\n\nTake a minute to think about the magnitude of that drop in cargo  volume. That decline, at the end of the day, will mean empty shelves  and higher prices.\n\nThe over $300 billion in cargo coming through what we know as the San  Pedro Bay port complex is tied…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…my goal was  to strengthen our voice, expand our reach, and build a solid foundation  for the future.'' He has certainly done that, stabilizing the industry  after years of decline, with more than 1,500 manufacturing companies in  Rhode Island now employing over 41,000 people.\n\nMr. Speaker, I thank Dave for his many years of service to Rhode  Island.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697432/recognizing-sarah-dully-rhode-island-teacher-of-the-year"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…being driven by the uncertainty.\n\nThere is a chaos penalty on the economy. When you are not sure what  is going to happen, you slow your investments, and that is why you see  a decline in manufacturing.\n\nThe Trump new sales tax, again, as proof from Reuters, ``Trump  tariffs would harm all involved, U.S. trade partners say.''\n\nThis is not just something…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…more barriers  and more uncertainty. If it is to become law, it is going to hurt the  very small businesses which it will be trying to help.\n\nSection 1071 the borrower can decline after the loan. The lender  cannot get information from a trade group.\n\nMr. Speaker, I include in the Record two letters in opposition to the  bill, one from the Small Business…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…and  these investments we are making in our communities will make a  difference.\n\nWell, what happened after we passed that law was absolutely stunning:  the biggest 2-year decline in gun violence in the history of recorded  statistics in the United States of America. That is extraordinary. That  is extraordinary. I am not going to sit here and claim…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…construction-start requirements for wind and       solar PV projects.\n\n``With the pushing forward of deadlines, renewable capacity       additions are now projected to peak in 2027, then decline in       2028 and remain stable through 2030,'' the agency said.       ``After this period, renewable power growth will rely largely       on state-driven renewable portfolio…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…performance, and the largest expansion of veterans' benefits  ever, by way of the PACT Act.\n\nRather than hold President Trump and Secretary Collins accountable  for the ongoing decline at VA over the last several months, my  colleagues pushed a baseless investigation, a clear distraction meant  to deflect from the damage being done under their watch.\n\nNevertheless,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693968/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…couple of years, we have made  significant progress in addressing the opioid overdose crisis. Last  year, the Centers for Disease Control and Prevention announced a 24  percent decline in drug overdose deaths for the 12 months ending in  September of 2024, compared to the previous year. This is encouraging  news, but I am deeply concerned that the Trump…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…chaos across the  economy, and rates go up.\n\nThat is what financial institutions do in times of uncertainty. They  rachet rates up to avoid a pitfall of some kind of downward decline  that chaos often brings. It becomes more expensive for people to  borrow. It makes it harder to own a home. It makes it harder to build  more homes. It raises car payments…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…species face heightened risks of extinction.\n\nState Wildlife Action Plans are essential to proactively conserving  fish and wildlife, rather than waiting for populations to decline to a  point where they need Endangered Species Act protections. These plans  provide a comprehensive assessment of the status of States' wildlife  populations, key habitats,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697623/make-state-wildlife-action-plans-efficient-act-of-2025"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…must invest, rebuild, and protect our industrial base  from threats to innovation and competitiveness. For too long, poorly  negotiated trade deals, job outsourcing, and the decline of  unionization have hollowed out our industrial base, leaving  manufacturers and suppliers vulnerable. We have a responsibility to  rebuild American manufacturing and protect…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690189/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…in that:\n\nUsing the powers of his high office, Donald John Trump abused trade  powers by imposing unjustifiable and unreasonable tariffs on foreign  nations, causing a sharp decline in the United States economy and the  economies of countries around the world, and declaring the false  existence of a national security emergency to justify his actions.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…invasive species in western North America, compete       with northern and California spotted owls, and this       competition ``is a primary cause of the rapid and ongoing       decline of northern spotted owl populations'' and poses a       similar risk to California spotted owls as barred owl       populations expand southward.\n\nThe Barred Owl Management…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693338/us-government-accountability-office-legal-opinion"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…are ready for real results from Washington.\n\nThis is about more than fixing broken policies. It is about turning  the page on the last 4 years of dysfunction, division, and decline and  writing a new chapter where government once again serves the people,  where families can afford to grow, small businesses can afford to hire,  and rural communities can…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…County.\n\nThis property has sat vacant for years, and the Forest Service has no  plans for its use. In the meantime, the building has been damaged by  weather and continues to decline structurally. Every year, it stays  vacant, resulting in higher repair costs and increased liability for  the Federal Government and taxpayers. Instead of watching this asset…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698160/conveyance-of-specified-forest-service-property-to-perry-county-arkansas"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…Mr. Speaker, I rise in support of the rule and the three bills it  provides consideration for.\n\nSince 2020 respect for law enforcement around our country has been on  the decline, and we have seen the effects this has had in our  communities.\n\nWe all know the best way to stop a bad guy with a gun is a good guy  with a gun. In Chicago, criminals do…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691170/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…does not want them to know it.\n\nThe PROTECT Act gives schools a clear choice: Federal funds or CCP  funds, but not both. In the wake of years of learning loss and  education decline, schools should focus on student achievement, not  spreading foreign propaganda. Under the Trump administration's  leadership, we are restoring focus to the education system,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697532/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…good news: It actually worked. It worked.\n\nIt is not just a theory. Within 5 years of passing the law, welfare's  caseloads declined close to 50 percent--the first significant decline  since World War II. Employment and earnings increased among low-income  individuals, with employment among single mothers increasing from 50 to  100 percent 7 years after…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…send a clear message: We stand for affordable energy, good- paying jobs, and an America that leads, not one that follows bad  policies straight into higher costs and economic decline.\n\nI thank Senators Kennedy and Hyde-Smith for their leadership in the  Senate, and I thank Chairman Westerman for advocating to get this  resolution introduced on the floor.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688631/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…Secure Rural Schools Act first  passed in 2000, 10 years after the listing of the owl. This law, and  the funding it provides, was designed to partially offset the massive  decline in Federal timber revenue. It provides a modest amount of  funding for critical services, including: infrastructure maintenance,  search and rescue, fire prevention, and,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697659/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…as a way station for  elected officials, becoming an integral part of the region's political  and civic fabric.\n\nThrough wars, Prohibition, economic strangulation, and the decline of  rail, The Waterville Hotel pressed on. Under the stewardship of  generations, most notably under Jess and William Smith from 1933 to  1945, it reinvented itself, evolving…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693585/congratulating-the-waterville-hotel"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…the Promoting New Bank Formation Act,  which allows for a phase-in of capital requirements for new banks to  make it easier for de novo charters. We have seen a dearth and a  decline in de novo charters. The more community-based lenders, the  better. The more community banks that are formed in this country, the  more competition and choice, the more access…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…are management. But I know this, first, if we will ever  get to do that, I will ask our Democratic friends to join with us. They  may or may not. I don't know. But if they decline to join with us, then  through reconciliation, which is how we passed the One Big Beautiful  Bill, we can pass these measures to increase wages for the American  people with…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697423/the-economy"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the  Central Valley. I will read a quote from the science director who was  involved from the San Francisco Baykeepers when the listing was  finalized:\n\n``Preventing further decline and extinction of longfin smelt will  require reducing California's diversion of fresh water from the Bay's  watershed to supply unsustainable industrial agriculture. . .…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690599/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…confront this massive crime crisis. Since then, violent crime has  dropped by 30 percent. Even D.C.'s Democrat Mayor Muriel Bowser has  acknowledged fewer homicides and a sharp decline in carjackings since  President Trump's intervention.\n\nRepealing the antipolice policies enacted by the procriminal D.C.  Council will further strengthen President Trump's…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696932/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…says:  ``Overdraft fee caps hinder financial inclusion. When constrained by  fee caps, banks reduce overdraft coverage and deposit supply, causing  more returned checks and a decline in account ownership among low- income households.''\n\nMr. Speaker, I happen to know that because I have represented some of  the poorest counties in the State of Michigan…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689844/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…debt service than on defense will not stay great for very long.''\n\nWe must act now if America is to, once again, be a rising nation, but  we are currently on a path toward decline. If we continue down this  unsustainable path, American families will be forced to deal with even  higher inflation, confiscatory tax rates, rising interest, and a weak  economy.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…stages is over 99 percent. Today,  there are more than 3.3 million prostate cancer survivors.\n\nHowever, Prostate Cancer incidence is increasing in the U.S.--after a  period of decline, driven primarily by a rise in advanced-stage and  distant-stage diagnoses--posing serious threats to the health of men in  our Nation. The 5-year survival rate for advanced…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695861/recognizing-september-as-national-prostate-cancer-awareness-month"}]