[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…including curriculum, staffing, and budgeting. In fact, it is against  the law for the Federal Government to set curriculum.\n\nDonald Trump also makes a bogus argument that declining test scores  justify abolishing the Department, but test scores don't make the case  for slashing Federal investment in education. On the contrary, they  show us where we…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689037/majority-of-americans-support-department-of-education"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…the skyrocketing prices or because the insurers won't insure them  because it is too dangerous. And guess what that does. Where does that  land? That lands in home values declining.\n\nThis is not just me saying this. The chief economist for Freddie  Mac--the huge mortgage company--predicts that climate risk makes  homeowners insurance unavailable.\n\nWhen…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…oligarch control of Twitter or  now X; or we see in organizations that are buying up stations like  Sinclair and using its vast power for the purpose of censorship.\n\nNext, in a declining democracy, in a budding autocracy, we see the  demonization of vulnerable communities. And what could be more visible  in America today than the demonization of immigrant…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696336/trump-administration"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…are going to have higher  interest rates on their credit cards and their mortgages. It means we  are going to have to pay more on our debt.\n\nAt the same time, the dollar is declining and prices are going up,  meaning it is going to be harder to afford groceries.\n\nMr. Speaker, these are the most self-destructive, wealth-destroying  policies any administration…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689980/modernizing-our-economic-theories"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…badges, choosing to stand up for  their First Amendment rights rather than bowing to the whims of the  Secretary of Defense. It means universities are refusing to play ball,  declining the offer. It means Americans use the power of their purses  to say you will not silence someone like Jimmy Kimmel and he was  reinstated.\n\nBut it doesn't stop there. It…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…on investment for Elon Musk because his wealth has gone up  $100 billion with a b since he took office.\n\nDespite all the disasters we have seen, and despite the massively  declining sales of Tesla, his net wealth has gone way the hell up. That  is because he uniquely, even as other spending gets cut--willy-nilly  because a 21-year-old coder named Big…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…lot for everyone.\n\nBut, again, we remember why we fight here; that while I am giving  this speech, I am worried about the care my father is getting. My  father's health is declining rapidly. Every single one of us knows what  it is like to have a loved one struggling when it comes to their care.  I know everyone knows that experience of saying we would…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695926/government-funding"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…strong economy, which was  growing for 3 years at a very solid pace, is now contracting.\n\nIt is not only the contraction of the economy, it is chaos in the  stock market; it is declining consumer confidence; it is projections of  recession by Federal Reserve districts and major economists.\n\nAll of this is happening because Donald Trump has pursued a three-…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…tariffs have been a massive tax on the American people,  costing an average household $1,000 per household just in the last  year. These tariffs have led to slower job growth, a declining  manufacturing industry, and less investment. They have hurt our farmers  and increased food costs.\n\nThese tariffs have inflicted real damage on our relationship with  Canada.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699973/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…vacancies. How can the VA possibly recruit talented, skilled,  dedicated employees when they know they will be fired at any moment?\n\nWe know that a lot of the people leaving or declining jobs at the VA  because of this chaos are, in fact, the professionals who deliver  medical care--like doctors and nurses--to veterans. These positions are  already facing…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693321/9999"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…letting out  radioactive contaminants into the air and the groundwater supply. These  are problems we are still dealing with today. Radioactivity levels in  the water are declining over time, but elements such as plutonium and  uranium are likely to pose risks for thousands of years.\n\nYou may remember in 2020, the first Trump administration called for…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696970/nuclear-testing-opposition"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…caribou, salmon, and sheep species  that Alaska Native and rural communities depend on for food and  cultural traditions.\n\nThe existing RMP sets strong protections in response to declining  populations of these important species. It created 3.6 million acres of  areas of critical environmental concern.\n\nI will also mention here that the one voice we haven't…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694899/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…enhanced COVID  credits in December. None of the reasons we rejected this measure then  have changed. Perpetuating a fraudulent, failed system without reforms  is not a solution. Declining to offer consumers more choice and control  over their healthcare is not a solution. Handing insurers an additional  $80 billion of taxpayer money is not a solution.\n\nBoth…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699099/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…weeks ago, I launched a community inquiry. Thousands of my  constituents and my neighbors and friends who have been hurt by Optum  have responded detailing horrific stories of declining healthcare  quality, erroneous billing, and we are continuing to gather this  evidence, the voices of the people, the American people, and to  ultimately hold this big corporation…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689084/economic-populism"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…swaths of Federal  forest land have received a share of Federal timber harvest revenue on  Federal land. Unfortunately, reduced timber revenue since the 1990s, as  a result of declining rates of timber harvesting, litigation, and  misguided environmental regulations, has drastically affected county  revenue, creating very real economic impacts in its wake.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697657/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…eliminate the Federal  cost of maintaining an idle, deteriorating building. By transferring  the site, we stop wasting resources and empower local leaders to  transform a declining Federal property into a hub for education,  conservation, and youth programs.\n\nH.R. 3187 is a commonsense solution. It cuts costs, eliminates waste,  and supports youth engagement…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698160/conveyance-of-specified-forest-service-property-to-perry-county-arkansas"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…(ROD) for six       approved resource management plan amendments (2015 ROD).       According to BLM, the 2015 ROD reflected a broad and       unprecedented effort to address declining ecosystems in the       region and concerns about a potentially endangered species.       The 2015 ROD included the Buffalo Field Office Approved       Resource Management…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695880/government-accountability-office-opinion-letter"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…that too  often prevail at our capital.                        Calling for Education Reforms\n\nMr. KILEY of California. Mr. Speaker, for years, I have been warning  about the declining education outcomes that exist across our country,  but in particular, in my State of California. We just received a  jarring reminder of just how bleak things have gotten.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…encouraging that stewardship.\n\nSince many communities throughout the United States, including  Pennsylvania's 15th Congressional District, are located within national  forest lands, declining timber harvests can lead to chronic  underfunding of local schools, emergency services, and other projects  that rely on a strong tax base. As a result, Congress made a commitment…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697653/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the last 12 months, it is like $71,000 a second.\n\nSo you have this massive debt, and then a population that is flat,  and where we are going right now, it actually could be declining over  the next decade. Not by a lot.\n\nTell me how I make the economy grow. How do I make sure your pension  is there? How do I make sure your access to healthcare is there?…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…middle of this where I said specifically $8.7  billion in annual appropriations in 2025, which was $1.5 billion more  than they requested. This is not underfunded. This is not declining.  This is actually more than appropriate to keep those parks open.\n\nThey had a manning issue, which was brought on by themselves, by not  manning when they had the appropriate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694870/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…founding in 1960.\n\nFor over six decades, the Mojave Water Agency has safeguarded one of  our region's most precious resources: water. Formed by local voters in  response to declining groundwater levels, the Agency has grown into one  of the most respected and visionary water management organizations in  our state.\n\nAs one of California's original State…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694201/recognizing-the-mojave-water-agency-on-the-occasion-of-its-65th-anniversary"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…counties in my district and across the country. It was enacted in the  year 2000, and it compensates counties with large amounts of national  forest land for lost revenue due to declining Federal timber sales. The  funds support local schools, roads, and essential public services.\n\nCongress reauthorized the program through fiscal year 2023, but, as I  mentioned,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…to bring it to market. Yet,  burdensome Federal regulations discourage investment, keeping Alaska's  energy potential locked away.\n\nMeanwhile, Cook Inlet gas supplies are declining, threatening  Alaskans in south central Alaska with higher heating and electricity  costs. If we want long-term energy security, we must develop our  resources.\n\nMr. Speaker,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688188/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…much more religious  person than a political person. I think that is lost on a lot of  people, lost on a lot of political commentators.\n\nI think particularly in this era of declining church attendance, a  time when so many young people are raised in families that don't even  go to church, I think his speaking about Christianity and his faith and  the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695392/charlie-kirks-religious-message"}, {"senator": "John James", "party": "Republican", "sentence": "…Michigan we do not want to  be dictated by Sacramento. There are about 49 other States that would  agree.\n\nGavin Newsom may be content with being the number one State for  declining population, losing nearly 1.2 million Californians from 2020  to 2023. Mr. Speaker, I assure you that I am not. This Biden-era waiver  allows California to ram its comply-or-die,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690473/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}]