[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…couple of hours about this Senate  joint resolution--a privileged motion pending before the Senate that I  filed, together with Senator Heinrich, to terminate a Presidential  declaration of an energy emergency that he issued on his first day in  office.\n\nThe President took a number of actions on his first day in office,  and obviously the one that got the…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…decades for it.\n\nRepealing them, that would be economic self-sabotage. Here is the  thing: Republicans are pushing this repeal, and they are also backing  Donald Trump's declaration of a so-called energy emergency. If we are  in an energy emergency, why would we gut the industries that are  expanding supplies, cutting costs, and creating stability?…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692414/rescissions-package-corporation-for-public-broadcasting"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…across religions with Christians, Muslims, and Jews. On today  of all days, I note his efforts to combat international terrorism,  helping lead the effort to the Brussels Declaration in December 2001  calling on leaders of all religions to condemn violence and forswear  the use of religious justification for terrorism and mistreatment.\n\nHis All-Holiness…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695345/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…Victims Fund threatens red states as  well as blue states alike, urban centers and also rural communities  equally. Passage of the Crime Victims Fund Stabilization Act is a  declaration of our own common values.\n\nThis bill says that our commitment to this Nation's victims is not  just a line in a budget subject to prosecutorial trends.\n\nI would like to…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698840/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…accolade is that he is the  only person to have signed formally all three foundational documents  separating our new Nation from the British monarchy.\n\nThe Treaty of Paris, the Declaration of Independence, and the Bill of  Rights, together known as the Charters of Freedom, boast the signatures  of some of our Nation's most revered figures. Mr. Franklin's signature…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688221/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Resolution, or is it a hypothetical future?''\n\nCongressman   Tom McClintock said: ``If the President launched an  unprovoked attack on Venezuela . . . without congressional declaration,  we should have this debate. Until then, I think Democrats would do well  not to cry wolf on such an important matter.''\n\nEven Susie Wiles, the President's own Chief of…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699359/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Administration established the       Safe and Beautiful Emergency Operations Center to coordinate       public safety and beautification efforts as the presidential       emergency declaration ends. This structure ensures that DC       will remain proactive--bringing together local and federal       partners to sustain momentum on reducing crime and improving…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…keeping  American-made competition off of the grid. These are Trump energy taxes  on the American people.\n\nSo let's shine a spotlight on this fossil fuel gaslighting. Trump's  declaration is the energy emergency. Trump's declaration is the energy  emergency. He is stopping the future from arriving. He is stopping this  generation from deriving the benefits…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696132/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…economy of Venezuela.\n\nThat campaign has now culminated in a military raid on Caracas, the  capture of Nicolas Maduro and his wife, and President Trump's  extraordinary declaration that the United States will ``run'' Venezuela  and seize control of its oil reserves.\n\nLet me be very clear about something, at the outset: Nicolas Maduro  is a brutal dictator…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…a war once declared  by a debate and vote by the people's elected body then gets handed to  the President, who as Commander in Chief is responsible for executing  on that declaration.\n\nThe Framers of the Constitution did understand one thing about the  President's power, which is the President as Commander in Chief should  defend the Nation. The President…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "Mr. WHITEHOUSE. Mr. President, I am here in support of Senator  Kaine's effort to get this body to take a public view on President  Trump's mad declaration that we have a border emergency with Canada  happening right now.\n\nI can tell you that if I go home to Rhode Island and ask people what  the emergency is in their lives,…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689472/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…President and  congressional Republicans decided to sign their so-called Big Beautiful  Bill, and in so doing, they retreated from the values that our Founders  etched in the Declaration, ``that all Men are created equal,'' not just  the wealthy and well-connected.\n\nAmericans across this Nation overwhelmingly oppose this bill--and for  good reason. You see,…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693251/one-big-beautiful-bill-act"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…own.\n\nAdditionally, there may be serious natural disasters that affect  taxpayers' ability to file but don't ever get declared as a Federal  disaster. That is because such a declaration is subject to a very  specific process under the Stafford Act. If a disaster does not exceed  a State's capacity to respond without the help of FEMA, the President  can't…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689384/filing-relief-for-natural-disasters-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Administration established the       Safe and Beautiful Emergency Operations Center to coordinate       public safety and beautification efforts as the presidential       emergency declaration ends. This structure ensures that DC       will remain proactive--bringing together local and federal       partners to sustain momentum on reducing crime and improving…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…these disparities is at risk.\n\nMr. Speaker, this is not politics. This is not theoretical debates  over the role of the Federal Government. This is people are dying, and  our Declaration of Independence that we will celebrate the 250th  anniversary of next year says that: All men--and I would add women--are  endowed by their creator with certain inalienable…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…Lady Abigail Adams, and  their family for their leadership in shaping the early course of this  Nation.\n\nAs we look to celebrate the 250th anniversary of the signing of the  Declaration of Independence, this bill celebrates a family pivotal to  the foundation of this country. The United States would not be where it  is today without multiple generations…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697630/adams-memorial-great-american-heroes-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…This Act may be cited as the ``$2.50 for America's 250th       Act''.       SEC. 2. FINDINGS.\n\nCongress finds the following:\n\n(1) The 250th anniversary of the signing of the Declaration       of Independence was a turning point in the history of the       United States and the world that warrants national       recognition.\n\n(2) The 68th Congress celebrated…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699867/for-americas-250th-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…country across the northern border, President Trump is moving  ahead with slapping tariffs on Canada.\n\nTonight, you have a chance, I say to my colleagues, to vote to undo  the declaration of an emergency on our northern border. You can vote to  undo the  harm to businesses, to small families, to retirement accounts. Don't  look at your 401(k) if you don't…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689488/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "John Thune", "party": "Republican", "sentence": "…fentanyl crisis in America, we  need to address the entirety of the crisis. We are not going to solve  the problem by going after just part of it. Ending this emergency  declaration will tell the cartels that they should shift their focus to  the northern border.\n\nSo I urge my colleagues to oppose this resolution and ensure that  President Trump has…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689477/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Defined.--In this section,       the term `Abraham Accords country' means a country identified       by the Department of State as having signed the Abraham       Accords Declaration.\n\n``(e) National Security.--Nothing in this section shall be       construed to require any action inconsistent with a national       security recommendation provided by…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…productivity and the pay of existing workers, and adding new jobs to  make that equipment.\n\nBy opening America's vast energy resources, domestic production is  about to rev up, a declaration of American energy independence that  will echo throughout the entire economy, then add the completion of the  border wall and the removal of millions of illegal aliens…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693629/democrats-big-mistake"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Congress has also spoken on the power of the President in the War  Powers Act. Now, we have heard a lot on the floor today about how  important the Founding Fathers thought declaration of war was. They  were absolutely right. It is just as right today as it was then. There  is a lot of difference between then and now. Then we had oceans  protecting us…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693132/motion-to-discharge-sj-res-59"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…humanities or an element of the arts. In our account, we also provided  funds for America250. We recognize the importance of the 250th  anniversary of the signing of the Declaration of Independence and the  founding of our Nation. We want this to be an anniversary that really  brings us together, that celebrates the best of our Nation and reminds  us…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "Mrs. MILLER of Illinois. Mr. Speaker, I include in the Record the  declaration below on behalf of Moms for America.\n\nAs the mothers, chief architects of the homes of America,       and molders of the future of our nation, we declare that the…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688744/declaration-of-mothers-a-proclamation-and-pledge-for-the-preservation-of-freedom-and-virtue"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…requirement to register to vote is an idea so basic, so assumed, and so  inherent to a functioning republic that opposition to it would offend  every man who signed his name to our Declaration of Independence.\n\nI have good news for the American people. No longer will our  elections be governed by a check box if we do our jobs in this House  Chamber and our colleagues…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699673/united-states-fiscal-situation"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…Christians and  Jews in accordance with the Koran. Several hardline clerics have even  issued fatwas for the assassination of President Trump and Prime  Minister Netanyahu.\n\nThe Declaration of Independence states: ``We hold these truths to be  self-evident, that all men are created equal.'' That is not so in  Islam. According to sharia, the testimony of a non-Muslim…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697017/sharia-is-dangerous"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…failed to adequately respond, prompting the administration to use  leverage to bring them to the table. Now Democrats are on the House  floor attempting to end the President's declaration, which would  undermine efforts to prevent fentanyl-related deaths. It would be very  unwise to tie the President's hands and remove this critical tool  during an ongoing…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699970/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…war or give explicit authorization  before the President can act.\n\nArticle II is clear. The President is the Commander in Chief, and the  Constitution has never required a declaration of war for every use of  force, national security or law enforcement operation against criminal  actors who threaten the United States.\n\nPresident Clinton acted in Kosovo.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698883/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…our Nation's founding.\n\nThroughout our history, Americans from all walks of life have shaped  our story, including, and most importantly, the 56 colonists who signed  the Declaration of Independence. These men--if it were happening today,  there would be women in that group. These men reflected profiles in  courage, pledging their lives, their fortunes,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698577/250th-anniversary-of-the-declaration-of-independence"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Commonwealth of Pennsylvania.\n\nThis year's Farm Show theme, ``Growing a Nation,'' is particularly  fitting as we celebrate 250 years since our Founding Fathers signed the  Declaration of Independence.\n\nFor generations, American farmers have not only fed this country,  they have helped to feed the world, and they have done so by  continuously adapting…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699123/pennsylvania-farm-show-recap"}]