[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…equal learning opportunities at local schools.\n\nOn behalf of the people of Colorado's 7th Congressional District, it  is my honor to thank Representative Bird for her dedication to serving  her community. I wish Shannon and her family all the best on their next  endeavor.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698814/recognizing-colorado-state-representative-shannon-bird"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…the community he served so well.\n\nOn behalf of the people of Colorado's 7th Congressional District, it  is my honor to thank President Buchanan for his hard work and  dedication to serving his country and his community.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695840/recognizing-morgan-jay-buchanan"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…transformational advocate for the people of Skagit County.\n\nMr. Speaker, it is an honor to commend Commissioner Janicki for her  outstanding leadership and vision, dedication to serving her community,  and the enduring legacy she has helped to cultivate. I ask my  colleagues to join me in expressing our deepest gratitude for her  service.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698557/recognizing-lisa-janicki"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…eating, and  foot health. Most notably, the JDF was recognized as a Top-Rated  Nonprofit by Great Nonprofits, a prestigious recognition that reflects  their unwavering dedication to serving our community.\n\nI want to thank all the board members and volunteers that play a  crucial role in making sure our communities have access to these  necessary resources.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699890/recognizing-the-jenkins-donelson-foundation-for-10-years-of-service"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…in-State tuition is granted regardless of their residency.\n\nThis bill will expand educational opportunities by providing them  with more affordable education options. Their dedication to serving our  country deserves nothing less.\n\nWe passed this bill last Congress, but, unfortunately, the Senate did  not consider it in time. I hope we finish this work in this…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689694/montgomery-gi-bill-selected-reserves-tuition-fairness-act-of-2025"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…behalf of Michigan's 3rd Congressional District, congratulations  to those at the Kent District Library's Talking Book & Braille Center  who continue to maintain a strong dedication to serving readers with  disabilities. This Center has touched the lives of over 750 children  and adults across our state. Today and every day, we thank this  institution for…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694075/recognizing-the-kent-district-librarys-talking-book-braille-center"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…successful logging company for over 25 years while also owning and  managing a country store, bait shop, grocery store, and restaurant. His  diverse ventures showcased his dedication to serving the community.\n\nIt has been said that ``Service is the rent that we pay for the space  that we occupy here on this earth.'' ``CP'' paid his rent and he paid  it well.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691304/in-memory-of-the-honorable-curtis-parham-cp-redding-sr"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…established to meet the need for  electricity among citizens in the rural areas of Northwest Alabama.  Since its founding in 1941, Tombigbee has demonstrated an unwavering  dedication to serving its community and strengthening the area it  surrounds. Over the decades, the cooperative has provided safe and  provide safe and reliable electric power and fiber-to-the-home…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696050/recognizing-the-tombigbee-electric-cooperatives-achievements"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Distinguished  Public Service Award, the Governor's Recognition Award, and the State  of Texas' Certificate of Appreciation. I am pleased to commend Carmen  for her dedication to serving and representing the City of Celina with  distinction, and I wish her continued success for many years to come.\n\nIt is an honor to bestow Cannen with the Patriot Award…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690747/recognizing-congressional-patriot-award-recipient-carmen-roberts"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…today to honor and recognize the  life of Walt Hartnett, a devoted Army Veteran, tireless advocate, and  passionate supporter of Veterans' rights. Walt's unwavering dedication  to serving his fellow Veterans and his community left an indelible mark  on all those who had the privilege of working with him.\n\nWalt's military career spanned a total of 12…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692464/recognizing-the-life-and-service-of-united-states-army-veteran-walt-hartnett"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…us were in Washington or in our  districts meeting with constituents, advancing local priorities, and  staying fully engaged with our constituents and our work.\n\nOur dedication to serving the American people didn't pause during the  shutdown, whether in D.C. or back at home, which, for the record, I was  in both places and many, many of my Republican…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…of Jebco Consulting, where his expertise in electro-mechanical  engineering has been widely respected. Yet, despite his professional  success, his true legacy is his dedication to serving his community.\n\nJim's contributions to Cass City are immeasurable. As a mentor in the  Boy Scouts, he has guided generations of young men toward the rank of  Eagle…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689609/recognizing-james-e-baker-ii-as-cass-citys-2025-citizen-of-the-year"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…as he begins the next chapter of his life as a midshipman and student  athlete in Annapolis.\n\nMr. Speaker, it was an honor to nominate these young students. Their  dedication to serving our country is inspirational. I look forward to  seeing their successes in the years to come.\n\nMr. Speaker, I thank them all again for their commitment to our  Nation.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691782/congratulating-lucas-gaston"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Speaker, today we honor the men and women who have worn the  uniform of the National Guard, past and present. We salute their  sacrifice, their courage, and unwavering dedication to serving the  American people through war and peace, disaster and recovery, and every  moment in between.\n\nHappy birthday to the National Guard.", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698094/9999"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…the State, local,  and Federal levels have consulted with Debbie or sought her advice at  some point in her career.\n\nMany Kansans know Debbie and have appreciated her dedication to  serving the people of the Fourth District of Kansas. She is a pillar in  Kansas politics and has been repeatedly recognized for her service,  most recently receiving the Spirit…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690554/recognizing-debbie-lupers-tenure-as-district-director-for-the-fourth-district-of-kansas"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…generations to come. It is a true honor to represent exemplary teachers  like Mr. Albano in the United States House of Representatives.\n\nTherefore, in honor of his dedication to serving his students and  community with passion, humility, and excellence, it is my privilege to  recognize Mr. Dominic Albano in celebration of National Teacher  Appreciation…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…community. He planned emergency  services events, such as cancer treatment fundraisers, and was a  central figure in special occasions throughout Lititz Borough.\n\nHis dedication to serving the community extends beyond the Lititz  Borough Police Department, as he served with the Boy Scouts for more  than 30 years.\n\nOnce again, I want to thank Chief Nye…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689982/congratulating-chief-kerry-nye-on-his-retirement"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…event alongside his daughter on Father's Day, making them  the first father and daughter champion duo on that special occasion. I  am pleased to recognize Punk for his dedication to serving our  community and being an upstanding leader to those around him.\n\nIt is an honor to bestow Punk with the Patriot Award for his  exceptional service to the people…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690761/recognizing-congressional-patriot-award-recipient-punk-carter"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…insurance education,  counseling, and assistance to people with Medicare and their families  and caregivers.\n\nSince 2013, Jerry has demonstrated his commitment and dedication to  serving seniors through the SHINE Program. Jerry has provided more than  2,000 hours volunteering since 2013. He continues to educate seniors  and people with disabilities…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690791/recognizing-jerry-phillips"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…U.S. military to  create coded messages the Japanese couldn't decipher. Being a part of  this initiative highlights Richard's high aptitude in languages and his  deep dedication to serving our country.\n\nRichard was also a part of the radio deception that led to the 1942  Battle of Midway. In this operation, codebreakers successfully  deciphered Japanese…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693382/recognizing-united-states-marine-sgt-richard-loughran-as-july-2025-veteran-of-the-month"}]