[{"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…and friends alive.\n\nThese men were essential workers, working the dangerous jobs that  build and strengthen our State's infrastructure. It is in their loving  memory that we dedicate our own efforts to rebuilding the Key Bridge.\n\nWhen the bridge collapsed on that early morning, people across the  globe immediately predicted our economy would crash. One…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689022/9999"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…cure for  Alzheimer's and cancer and diabetes and Parkinson's and every other  disease.\n\nYou are saying to all the young, brilliant people in the country who  are going to dedicate their lives to finding the cures for those  diseases: Don't go there. There is no guarantee you are going to have a  job next year or the year after or the year after. Again,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…the challenges our officers face and help us to understand the  additional support that they need to remain physically and mentally  safe.\n\nFederal law enforcement officers dedicate themselves to protecting  our Nation, to protecting our communities, and it is our responsibility  in this body to ensure that they receive the protection that they  deserve.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…nursing home, where I provided care to elderly Americans.       Through this experience, I realized how many workers in the       caregiving field are immigrants who dedicate themselves to       serving others.\n\nI later worked in an adult day care setting, assisting       veterans diagnosed with schizophrenia and ensuring they       received compassionate,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…alone.\n\nThat is why I recently joined 20 of my colleagues in sending a letter  to Treasury Secretary Bessent and Homeland Security Secretary Noem  urging both Departments to dedicate resources to planning for the  Supreme Court's decision. Proper planning is needed around an  information campaign for small businesses on how to navigate the tariff  protest…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698342/president-trumps-tariff-policies"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…filled throughout her prestigious career. Part of what makes the U.S.  military the greatest in the world is that servicemembers, like Major  General Kotulich, voluntarily dedicate their lives to serve and  sacrifice for this country.\n\nI also want to thank her wife, Penelope Smith, and two daughters,  Rachel and Devan, for their unwavering support. I…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692707/recognizing-deputy-chief-of-army-reserve-major-general-deborah-deb-kotulich-on-her-retirement-from-the-us-army-reserve"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…the way, cut my Medicaid, groceries, and  SNAP benefits because what I really want is for this person who was  never elected to get an upgrade on a plane. Make sure that you dedicate  $50 million of taxpayer dollars so that she can have a brand-new plane  so that she can cosplay wherever the hell she is going.''\n\nI have never heard that. I hear the gentleman.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "Mr. LEVIN. Mr. Speaker, I rise to recognize Mel Vernon as my November  2025 Constituent of the Month.\n\nMel Vernon is an example of what it looks like to dedicate ourselves  to community engagement and cultural preservation. For more than 15  years, he has worked with teachers and educators across Southern  California to ensure the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699866/recognizing-mel-vernon-as-november-2025-constituent-of-the-month"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…young  people can achieve. It is not easy to earn the prestigious rank of  Eagle Scout--one must persevere through years of hard work, demonstrate  strong leadership, and dedicate countless hours of service to others.\n\nThe Scout Motto is ``Be Prepared'' and becoming an Eagle Scout is one  of the best ways for a young person to prepare for a life of…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697395/recognizing-the-eleven-newest-eagle-scouts-from-troop-407"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…SEWELL. Mr. Speaker, I rise in observance of today, November 20,  as World Pancreatic Cancer Day.\n\nIt is a time to shine light on the devastating impact of this disease  and dedicate ourselves to improving prevention, early detection, and  treatment.\n\nPancreatic cancer is the third leading cause of cancer-related deaths  in the United States and is on…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697076/observing-world-pancreatic-cancer-day"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…of public service, I decided not to seek a  fifth term, and I am proud to have served with integrity and respect.\n\nI turn 70 next spring, and I decided that it was time to dedicate  more of my time to the people who have sacrificed the most so that I  could serve: my wife of almost 50 years, my children, my grandchildren,  and the family that steadied…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696777/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…1964, investigating thousands of allegations of  discrimination each year which deny African Americans, in particular,  of an opportunity.\n\nMr. Speaker, I acknowledge and dedicate this poem to our great  leader, the President of the United States, in honor of Maya Angelou,  whose birthday was April 4. I dedicate to them a message from her from  the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689641/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…servants, and I  hope they will join us, in the spirit of this legislation, to do more  to support and protect all of our Federal first responders.\n\nThese public servants dedicate their lives to serving the American  people. The administration has created chaos and confusion that adds to  the difficulty of their jobs through Federal hiring freezes,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693929/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…being held up  so far this year. Two billion dollars isn't just lost opportunity, but  it discourages researchers from staying on the job, breaks their will  to continue to dedicate their lives to finding cures for things that  we, in America, view as dangerous.\n\nPresident Trump has canceled hundreds of NIH-supported grants and  clinical trials and placed…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690656/national-institutes-of-health"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…IV, before it is too late.\n\nMembers of the Committee on Veterans' Affairs have often spoken of  the incredible legacy of the Nation's military aviators, true experts  who dedicate their lives to serving and protecting our country. We also  heard heartbreaking stories of what happens when they come home, often  looking healthy, only to be blindsided…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693895/aces-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…through their time,  compassion, and leadership.\n\nTheir dedicated work today leaves an indelible mark on tomorrow, so  let me encourage you to press onward as you selflessly dedicate your  time to serving your community.", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696430/recognizing-high-impact-movement"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…the men and women in blue for their sacrifice and selfless  service and honor, at the same time, the fallen officers.\n\nEvery day, men and women selflessly and courageously dedicate their  lives to keeping America safe and sound. They uphold our public safety  and devote themselves to the pursuit of justice. Their devotion merits  our admiration, and…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690982/national-police-week"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…The victims of this horrible attack were not just politicians. They  were neighbors, parents, sons, and daughters. They believed in this  Nation and their State enough to dedicate their lives to representing  their constituents' interests and the pursuit of positive change.\n\nI am confident that my colleagues share this sentiment and can agree  that…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692859/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "…hardworking young people.\n\nThis bill will ensure the Congressional Award program continues to  challenge young Americans like Caroline, Amaria, Connor, and Fred to  set goals and dedicate themselves to their community and to their own  success and self-improvement.\n\nThere are over 48,000 Americans enrolled in this program throughout  the country in every single…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698221/congressional-award-program-reauthorization-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Public Works Week, which takes place from May 18-24, 2025, and  to offer a special greeting to the City of Anniston Public Works  Department.\n\nOur public works professionals dedicate their time and talent to  maintaining the infrastructure and facilities essential to public  health and our quality of life. In Anniston, that work is carried out  under the…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691676/recognizing-the-national-public-works-week-may-2025-and-the-city-of-annistons-public-works-department"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Whether it is a local sheriff in Minnesota, a wildland firefighter in  California, or a Tribal police officer in Missouri, our law enforcement  officers and firefighters dedicate themselves to the safety and well- being of others, often under incredibly difficult and dangerous  circumstances. This legislation gives something back to those who give…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693931/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…fill the requirements. That solicitation lays  out what the agency wants to buy, how it will evaluate the bids, and  when responses are due.\n\nIn good faith, small businesses dedicate precious time, money, and  resources, sometimes thousands of dollars, to just submit these  proposals. Too often, they are met with silence, confusion, or outright  cancelation…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691762/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Jane Saldana  of Waco, Texas, with a Congressional Veteran Commendation. Nola Saldana  is a proud United States Navy veteran, who served nearly 10 years and  continues to dedicate her life to supporting veterans and her  community. A full-blooded Maidu Indian raised in poverty on a  reservation in Susanville, California, she grew up with strong values…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696264/recognizing-nola-jane-saldana-with-a-congressional-veteran-commendation"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…the 55th Wing, the ``Fightin' Fifty-Fifth'', headquartered at Offutt  Air Force Base in Nebraska. This Air Force organization is home to the  thousands of men and women who dedicate their lives to providing global  vigilance as a vital part of America's national defense. I am proud to  count myself as a member of the Fightin' Fifty-Fifth, having served…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689070/recognizing-the-55th-wing-85th-birthday"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Mr. Speaker, I rise today with a heavy heart not  just to speak but to mourn, to honor, and to demand that we never grow  numb to the unimaginable loss suffered by those who dedicate their  lives to protecting ours.\n\nEvery day, nearly 1 million volunteer and career firefighters across  our country suit up, knowing they may not return home. They run toward…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693542/congratulating-larry-haskell-on-his-retirement"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…Klan. In 1876, he was among the 268 members of  the legendary regiment who fell at the Battle of the Little Bighorn.\n\nIn recent years, the townspeople have worked together to dedicate the  Lance Corporal Scott B. Paul Memorial Park in honor of the young marine  who fell  in 1992 during the Gulf War. A section of the beautiful park, the Sgt.  Richard Parker…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699397/225th-anniversary-of-the-town-of-strong"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…co-chair of the Congressional Service Organization Caucus, it is a  privilege to celebrate National Volunteer Month, recognizing and  honoring the millions of individuals who dedicate their time and  talents to making our communities stronger, more resilient, and more  compassionate.\n\nWhen we give our time and our efforts to others, we foster a sense of…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689399/national-volunteer-month"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…defined his military  career. In August 2025, he concluded more than 35 years of combined  military and civilian service to our Nation.\n\nMaster Sergeant King now plans to dedicate his time to supporting  fellow veterans and strengthening the bonds of community that have  guided his life of service. His journey reflects not only a lifetime of  personal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695000/recognizing-united-states-army-master-sergeant-tommy-j-king-as-september-2025-veteran-of-the-month"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…unites the vast majority of Americans. Transgender males should not be  competing in girls' athletic events. It is not just unfair. It is a  betrayal of the young women who dedicate themselves to excellence  through hard work and training.\n\nLike many others, I welcomed President Trump's executive order  earlier this year, keeping men out of women's sports,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692397/recognizing-lauren-matthew-of-west-valley-high-school-state-champion"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Public Works Week, which takes place from May 18-24, 2025, and  to offer a special greeting to the City of Oxford Public Works  Department.\n\nOur public works professionals dedicate their time and talent to  maintaining the infrastructure and facilities essential to public  health and our quality of life. In Oxford, that work is carried out  under the…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691680/recognizing-the-national-public-works-week-may-and-the-city-of-oxfords-public-works-department"}]