[{"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…service and  to support future health and environmental initiatives across Illinois.  I am proud to recognize the Chicago Indo-US Lions Club and thank them  for their dedication to service and for fostering connections that help  Illinois communities thrive.", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698522/recognizing-the-chicago-indo-us-lions-club-for-its-outstanding-service-to-communities-across-illinois"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…and Colorado  Army National Guard. As a soldier, an officer, and a devoted husband,  Officer Dunn was a servant in every aspect of his life. His legacy of  kindness, dedication, and service to our community and our country will  not be forgotten.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to thank the Golden…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692010/recognizing-the-golden-police-department"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…retiring with the rank of colonel.  His deep commitment to veterans' issues continued through his work with  the University's Veterans Alliance, demonstrating his enduring  dedication to service.\n\nI have known Peter since the start of my career and have always  admired his insightful and strategic approach to complex legislative  matters. His numerous contributions…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690121/recognizing-peter-robinsons-retirement"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…valiantly served during World War II in the U.S. Army with the  93rd Cavalry Reconnaissance Squadron in the Central European Campaign  and the Battle of Rhineland, and his dedication to service continued  long after his active military duty. Upon graduating from Seattle  University, Bill pursued a career as an accountant at Boeing and then  as a life and health…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691351/recognizing-william-bill-leonard-chin-former-cathay-post-no-186-commander-and-world-war-ii-veteran"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…neighbors in  the 12th Congressional District. We worked over 3 years to present  Matthew Fisher, a remarkable resident of my district, with the Purple  Heart for his dedication and service to our country.\n\nMatthew Fisher was born in Livonia and is a proud graduate of  Stevenson High School. In 2004, Matthew answered the call to serve  others by becoming…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693028/surveillance-pricing-in-grocery-stores"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…today to honor my  constituent, Michael Nolan, who dedicated 48 years of his life to serve  our country at the Social Security Administration.\n\nHe is a great example of dedication and service to his fellow  Americans.\n\nMike Nolan wanted to be a Catholic priest, but he left the seminary  system in 1975. When he heard of an agency that would help the aged…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695094/recognizing-clarendon-hills-little-league-team"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Secret Santa  programs, and scholarships. She preserves gospel music through Quartet  Unstoppable and advocates for the elderly through Patience for  Patients, LLC. Her dedication to service and community makes her a  deserving recipient of the Media and Communications Champion Award.", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690568/virginias-fourth-district-women-in-excellence-awards"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "Mr. CROW. Mr. Speaker, I rise today to recognize and commend Corey  Rose for her fifteen years of unwavering dedication and service through  her Wishes & Heroes Benefit Concert. This event has not only been a  beacon of hope but a critical fundraiser for two outstanding  organizations: the Colorado…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692442/recognizing-and-commending-the-service-of-corey-rose"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…oath to protect.''\n\nThat is the sentiment I know many of us in this Chamber share.  Federal workers, like that veteran, swore an oath to protect this  country. Their dedication and service have been unwavering. We owe them  the same commitment in return. I am grateful for the way we have come  together across party lines to ensure the rights of working…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697870/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…and he is an active participant  in the Cadet Explorers program.\n\nMr. Speaker, I ask my colleagues in Congress to join me in thanking  Sergeant Olav Chaney for his dedication and his service to the Pikes  Peak region, to Colorado, and to America.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691305/recognizing-sergeant-olav-chaney"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Alabama's Third Congressional District. She will be greatly missed.\n\nMr. Speaker, please join me in recognizing Beverly for her retirement  and thanking her for her dedication and service to our great State of  Alabama. I congratulate Beverly.", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688459/recognizing-the-retirement-of-beverly-denise-buckhannan-graben"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Elizabeth, his  children, grandchildren, and all who were touched by his wisdom and  kindness. May his memory be a blessing, and may we all strive to live  with the same dedication to service that Justice Koontz so fully  embodied.              Restoring Accountability in the Federal Workforce\n\nMr. CLINE. Mr. Speaker, yesterday I joined Senator Mike Lee…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689724/congratulating-glenvar-high-school-boys-swim-team"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…of myself, my staff, and the people of the Thirteenth  Congressional District of Texas, I extend my sincere appreciation to  Jeff Billman for his years of hard work, dedication, and service to the  state of Texas and our great Nation.", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690377/recognizing-the-career-of-jeffery-ronald-billman"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…outstanding  young leader in our community, Kacee Gray, who has been named the Cass  City Junior Citizen of the Year for 2025. Kacee exemplifies the values  of hard work, dedication, and service, making a profound and lasting  impact on Cass City and beyond.\n\nA soon-to-be graduate, Kacee plans to attend Alma College to pursue a  Bachelor's Degree in Business,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689670/recognizing-kacee-gray-as-cass-citys-2025-junior-citizen-of-the-year"}, {"senator": "John Carter", "party": "Republican", "sentence": "…writing  assistance, job placement, and skill-building opportunities, helping  them smoothly transition into private and governmental sectors.\n\nMSgt Bygum's unwavering dedication and service to his Nation  exemplify why he deserves this honor. I commend his remarkable  contributions and extend my best wishes for his continued success as a  steadfast advocate…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689326/saluting-the-service-of-master-sergeant-duane-c-bygum-jr"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…this year, I commend  these students for choosing to defend these values foundational to our  national identity.\n\nI am truly grateful to see that such patriotism and dedication to  service thrives in the next generation.\n\nThese nine individuals have already demonstrated excellence, and I  know  they will continue to make our country and State proud.", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699143/military-academy-nominations"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…role, he  transitioned to the Hatboro facility, where he would remain for the  rest of his career, steadfastly delivering mail and upholding the  principles of dedication, diligence, and service.\n\nComing from a family with a deep-rooted tradition in the Postal  Service, Joseph was honored to follow in the footsteps of his father,  Joseph, and his two…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688925/recognizing-joseph-bongarzones-retirement-with-the-united-states-postal-service-after-37-years"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "Mr. LANGWORTHY. Mr. Speaker, I rise today to recognize the  extraordinary dedication and service of Shawn Christman, who has  devoted 25 years to serving the Town of Pendleton and the Wendelville  Volunteer Fire Company. Over the course of his career, Shawn has…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699581/recognizing-shawn-christman"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Bluegrass businesses.\n\nMr. Forcht's role has allowed for the enhancement and visionary  leadership of Forcht Bank to celebrate this 40th anniversary signifying  exceptional dedication and service to Kentucky communities.\n\nI consider Terry Forcht a close friend, and I appreciate all that he  has done for all the communities in Kentucky and all the charitable…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688348/draining-the-swamp-in-order-to-put-america-first"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "Mr. GOLDMAN of Texas. Mr. Speaker, I rise today to honor Mr. Jeffrey  L. DeWitt on his retirement from the Fort Worth Fire Department after  37 years of dedication and service to the City of Fort Worth. Founded  152 years ago, the Fort Worth Fire Department is a nationally  recognized agency with a rich history of serving and protecting the…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689725/9999"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…raising triplets--one son and two daughters--who are now 33  years old. He is also a proud grandfather to two grandchildren,  instilling in them the same values of dedication and service that have  guided his own life.\n\nRobert Anthony Longo's story is one of duty, perseverance, and  selfless service. His contributions to the United States Air Force…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689738/recognizing-robert-longo-as-april-2025-veteran-of-the-month"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…compassion, and selfless service. Whether it was through her role on  the student council, her leadership on the Westlake High School varsity  cheer team, or her dedication to the Service Club, Gia led by example,  always putting others before herself and inspiring those around her.\n\nEven while facing the most difficult of challenges, Gia's heart of…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689204/gia-deborah-gentile-leaves-behind-a-legacy-of-kindness"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Speaker, today I rise to recognize and honor Camilla  ``Cam'' Williams for her extraordinary dedication, service, and  unwavering commitment to the Republican Party and to our shared  conservative values.\n\nFor well over a decade, Cam has been a faithful Republican precinct  delegate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695818/recognizing-ms-camilla-cam-williams-for-her-dedicated-service-to-the-republican-party"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…completed his career as commanding  officer of VX-9, the Navy's premier test and evaluation squadron.\n\nHis career was a testament to his love of flying, his unwavering  dedication to service, and his profound impact on all who worked with  him.\n\nHis sense of adventure, intellectual curiosity, and deep care for his  fellow servicemembers will forever be…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}]