[{"senator": "Laura Gillen", "party": "Democrat", "sentence": "Ms. GILLEN. Mr. Speaker, I rise to demand that Congress restore the  full State and local tax deduction which would cut taxes for Nassau  County residents.\n\nOn Long Island, we pay some of the highest taxes in the country, and  we send far more to Washington than we get back.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691111/bring-back-full-salt-deductibility"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…SUOZZI. Mr. Speaker, I thank the gentleman for yielding, and I  thank him for bringing attention to this important issue.\n\nI am going to talk about the State and local tax deduction in some  detail, but first let me just say generally that what we are talking  about is so important. We have so many of our friends on the other side  of the aisle who are…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690627/republican-tax-cuts"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "Ms. GILLEN. Mr. Speaker, today, I rise to address the unfair double  taxation that my constituents are facing due to the State and local tax  deduction cap.\n\nHardworking families across Long Island and across our State and many  other States already face some of the highest tax burdens in the  Nation. For 8 years, they have…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690752/eliminate-the-salt-cap"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…delegation,  Elise Stefanik,  Andrew Garbarino, Nick LaLota, and Mike Lawler. These  are just facts right now. It was big talk about standing up to protect  the State and local tax deduction.\n\nLet's make sure we set the record straight here as to what happened  to the State and local tax deduction, which impacts millions of  hardworking American taxpayers all…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…and someone who has been working on it ever since  they did it, trying to work with people on both sides of the aisle to  figure out how to resolve the State and local tax deduction is my  colleague,  Tom Suozzi from New York. He is a great Member and a member  of the Ways and Means Committee.\n\nMr. THOMPSON of California. Mr. Speaker, I thank the gentleman…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…opposes would prevent a 25 percent tax hike  for most people in my district where the average income is $70,000, not  billionaires, $70,000.\n\nIt also increases the standard deduction. It increases the child tax  credit. It helps small businesses through the 199A deduction. This is a  solid tax bill. We looked at what we can do to help the average citizen…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…engine of Americans' prosperity. The  Working Families Tax Cuts law helps small businesses all across  America.\n\nThe law makes permanent the 20 percent small business tax deduction.  Every Democrat voted against that. Republicans are focused on helping  small businesses grow.\n\nSo American workers are the clear winners in what we have done with  the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699081/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…newborn child, to invest in their future, and parents  get a bigger child tax credit: $2,200 more per child. Seniors are going  to keep more as well. There is a new $6,000 deduction on Social  Security income. Clearly, the Presiding Officer has heard it, and I  have heard it at home as well: Farmers, ranchers, and small business  owners are getting relief…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…more of their hard-earned money. It increases the child tax credit,  which helps offset some of the costs of raising a family. It extends  and expands the 199A business tax deduction, which will help  incentivize investment across the country and spur economic growth. Our  bill is the most proworker, profamily legislation Congress has seen in  a generation.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691527/one-big-beautiful-bill"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…manager of M.J. McGuire Auto Dealership and  also a farmer in Rugby, North Dakota.\n\nWith the One Big Beautiful Bill Act now law, Americans can take  advantage of a new interest deduction when purchasing an American-made  vehicle. This provision can really help small-town car dealers like  M.J. McGuire.\n\nFor a family buying a $50,000 vehicle, Dan explained…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694792/promises-made-promises-kept"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…help the middle class.\n\nThe minority voted against no tax on tips, against no tax on  overtime,  against doubling the child tax credit, and against doubling the  standard deduction, all things that put serious money back into the  pockets of my constituents.\n\nNow, to my colleague, $1,800, $2,000, $2,500 might not seem like a  lot to him, but it might…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…where this is targeted  toward giving the billionaires some type of tax relief.\n\nProbably the largest portion of this tax reconciliation bill is what  is called the standard deduction. The standard deduction is taken  advantage of by over 90 percent of Americans. This is what simplifies  our tax code. When you show up to do your taxes for that year, you…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…giveaway to blue  State tax jurisdictions in State and local taxes. My friends in this  Conference who represent big tax States like New York and California  want a bigger deduction for their State taxes. Why the hell should I  subsidize their stupid decisions in their States for their expensive  taxes? Why should my constituents have to do that?\n\nWhy…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…season is  officially underway, and this year, 91 percent of all taxpayers will  experience an easier and more simplified filing process.\n\nWe locked in the doubled standard deduction, and not only at the rate  that Republicans established in 2017. We actually boosted it for this  new approach. It is now considered permanent policy, meaning that  families…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699706/historic-tax-relief-for-families"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…when Democrats  had the White House, House, and Senate. None of them were because  Democrats recognized deep down that doubling the child tax credit,  doubling the standard deduction, encouraging increased wage growth  without the inflation that came from the American Rescue Plan, which we  saw the Democrats enact in 2021, all of that positive economic…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…to accomplish a lot of really key important  progrowth elements: no tax on tips or overtime, an increased child tax  credit, tax relief for seniors, an increased standard deduction  targeted entirely at the middle- and lower-income Americans, investment  in rural America. These are just a few of the reasons Americans will  see significant increases…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699064/how-republicans-have-delivered-for-americans"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…hike of 22 percent,  $1,700 would be the extra expense for families of four, 26 million  small businesses would lose their comparable tax break through the 20  percent 199A deduction, child tax credit would be cut in half for 40  million families, the standard deduction for 91 percent of all  Americans would be cut in half.\n\nMr. Speaker, as we unlock…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Trump administration, Republicans  passed the Tax Cuts and Jobs Act, legislation that cut Americans' tax  rates, doubled the child tax credit, and nearly doubled the standard  deduction. But without action from Congress, a substantial part of the  Tax Cuts and Jobs Act would have expired this year, and that would have  meant a huge tax hike for hard-working…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693279/one-big-beautiful-bill-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…executive, and they both gave me the same story. They are  both conservative people. They said they were shocked that there were  Republicans who want to increase the tax deduction for State and local  taxes because what does that incentivize? It doesn't incentivize more  children. It doesn't incentivize more research and development. It  doesn't incentivize…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…is something they  ought to be run down for, so I hope they pay a little more attention.\n\nThe next thing I would like to point out is what the Republicans do  with the SALT deduction. There are a variety of changes in the tax code  that we could make that would affect people's behavior. Because tax  rates are so high, any change in the tax code affects…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692064/monitoring-big-beautiful-bill-provisions"}]