[{"senator": "Kim Schrier", "party": "Democrat", "sentence": "…doctors behind bars for up to 10 years for  providing medically appropriate care for children, and it doesn't even  stop there. It could put parents behind bars for making, after deep  consideration, and in many cases, anguish, the decision that they deem  best for their own child.\n\nThis bill will instill fear in doctors and patients and rob parents  of their…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698357/protect-childrens-innocence-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…funding had been  assured are from well-respected Ohio  companies: Libbey Glass, Owens-Illinois Glass, and Kraft Heinz.\n\nLet's talk about Libbey. This historic company holds deep roots in my  hometown of Toledo, long known as the Glass City. Glass requires lots  of energy. The firm has been working for years to maintain  competitiveness in a terrible…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691905/department-of-energy-project-cancelations"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Businesswoman of the Year--Monika Mueller: Monika's journey to  becoming Chief Strategy Officer is a true testament to her visionary  leadership, relentless innovation, and deep commitment to empowering  others. Over the past several years, she transformed multiple  departments, drove major revenue growth, expanded international  operations, and championed…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690568/virginias-fourth-district-women-in-excellence-awards"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…of fasting, I want to recognize the beautiful  Muslim community in Michigan's 12th Congressional District and around  the world. Eid Mubarak.\n\nThis Ramadan has been a time of deep spiritual reflection and an  opportunity to be in community with each other, but it also has been a  painful time for so many Muslim families around the world.\n\nI remind my…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689402/eid-mubarak"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…under Mr. Dodaro's 15-year term at the helm, GAO has saved the  American taxpayer more than $1.2 trillion. The Committee on Homeland  Security and I have relied on Mr. Dodaro's deep experience and  knowledge of Federal programs and operations to shape the Department of  Homeland Security and protect civil rights and civil liberties in the  post-9/11 era.…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698469/recognizing-the-service-of-us-comptroller-general-gene-l-dodaro"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Biomedical Research Buildings.\n\nBeyond his professional contributions, Peter served for 30 years in  the New York Army National Guard, retiring with the rank of colonel.  His deep commitment to veterans' issues continued through his work with  the University's Veterans Alliance, demonstrating his enduring  dedication to service.\n\nI have known Peter since…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690121/recognizing-peter-robinsons-retirement"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…believe we need a leader at the Department of Education  who actually believes in the mission of the Department of Education. We  need a Secretary of Education with a really deep understanding of how  to use this crucial position to strengthen educational opportunities  and outcomes for every student in this country. We need a Secretary of  Education…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688363/nomination-of-linda-mcmahon"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…mentoring a  teammate  through a difficult challenge or calmly navigating high-stakes  competitions, he knew when to guide or be a reassuring presence.\n\nAbove all, he was a man of deep principles and kindness.\n\nMr. Speaker, I and so many in my community are sending prayers to his  family and friends and all who had the privilege to know him.\n\nMay he rest in…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691338/in-memory-of-nihaal-grandhi"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…their commitment to end  Veteran homelessness in Minnesota. This project is only one example of  the way their work and collaboration can change lives. I want to extend  my deep appreciation to Hennepin County, the Minnesota Department of  Veterans Affairs, and the many community organizations that helped make  this project possible.\n\nAt a time when…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694978/recognizing-the-minnesota-assistance-council-for-veterans"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…shopping, and brought warmth and laughter to family gatherings,  particularly during friendly card games that brought her loved ones  together.\n\nHer life was characterized by her deep care for others, and she will  be deeply missed by all who had the privilege of knowing her. I would  also like to extend the family's gratitude to the Advanced Heart and  Lung…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687993/recognizing-sharon-lavonne-harris-rischer"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…Prime Ministers, Cabinet Ministers, Members of Parliament,  and Members of the Royal Family to Washington and across the United  States. His meticulous attention to detail and deep understanding of  both British and American political landscapes ensured that these  engagements were not only successful but also meaningful, advancing  dialogue and cooperation…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698086/recognizing-nick-alton"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…from the other side of the aisle on their knees and in  handcuffs, we would see outrage.\n\nThis is not about left or right; this is about right or wrong. And  today, we saw a deep, grave wrong heaped upon not just this body but,  as Alex Padilla wrote so eloquently, upon the ideals. Because if you  could do this to a U.S. Senator, then you can do it to…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692454/alex-padilla"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…providing us  with greater security than we could have alone.\n\nAnd we share a border. But the border is a symbol of a bond that our  people have in common, a friendship that goes deep, a heritage and a  culture that we respect. These bonds will be betrayed by a reckless  trade policy the administration is pursuing that threatens to derail  that valuable--in…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689487/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…existing one by endorsing Moscow and Beijing's  alternative.\n\nThese moves also have costs at home. At his press conference over the  weekend, President Trump demonstrated a deep lack of understanding that  there is always a cost to our actions. There is the cost for our  servicemembers--more than 15,000, at last reports--currently positioned  in the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698621/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today to honor and remember  Donald Leroy ``Cool'' Kuehl, a proud United States Army World War II  Veteran, whose life was defined by service, courage, and deep love of  country.\n\nBorn in 1925 in Long Beach, California, Don answered our Nation's  call during one of the most consequential moments in history. He served  as a radio operator,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699857/in-memory-of-donald-l-kuehl"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…Speaker, Bill Matthys represents the very best of servant  leadership. His life is a testimony to the impact one person can make  through quiet faithfulness, love for family, and a deep-rooted  commitment to community.\n\nMay God continue to bless him, his family, and all those he serves.", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690584/recognizing-the-retirement-of-bill-matthys"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…since its first day of  classes. Over the past century, Solebury School has remained steadfast  in its founding ideals such as personal attention, intellectual  curiosity, and a deep respect for individuality. The school's faculty,  students, and alumni continue to embody these values, carrying forward  the founders' dream of education that not only prepares…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696356/recognizing-the-100th-anniversary-of-solebury-school"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…to  use our active faith to lead by example and invest in our communities,  not just with words, but with action.\n\nThis is what makes east Texas strong: faith, service, and a deep love  for God and for others. I am proud to honor this effort today and to  recognize all those who give their time to love their neighbor.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693760/love-thy-city-initiative"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…better.''\n\nHere is the evidence. The email speaks for itself. The only stone- cold liar in this debate is Hakeem Jeffries.\n\nMadam Speaker, I ask Mr. Minority Leader to take a deep breath, chill  out, stop lying, stop with the juvenile name calling, and own up to the  fact that his campaign solicited campaign cash from Jeffrey Epstein.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697128/irrefutable-evidence"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…Business Week, a time to recognize the hardworking men and women  who are the engines of our economy.\n\nAs a former small business owner myself, I know the long hours,  risks, and deep sense of responsibility that come with signing both  sides of a paycheck. Small businesses are more than storefronts. They  are job creators, community anchors, and the heart…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690917/recognizing-hard-workers-driving-our-economy"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…are calling the worst conditions in track history this year.\n\nThis wasn't just a race. It was a test of endurance, resilience, and  unwavering determination. In the face of deep ruts, relentless mud, and  brutal terrain, Mr. Plessinger, ``The Cowboy,'' displayed not only  exceptional athleticism but also the kind of mental toughness that  defines true…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689821/congratulating-supercross-rider-aaron-plessinger"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…support via a robust public works department, access to  clean water and sanitation utilities, and vibrant recreational and  library services. These offerings reflect the city's deep commitment to  enhancing quality of life for its residents.\n\nFruitland Park's natural beauty, small-town charm, and strong civic  infrastructure make it a desirable location…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693999/recognizing-the-100th-anniversary-of-the-city-of-fruitland-park-florida"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…relationships evolved into lifelong  friendships that will endure in her memory.\n\nBeyond her professional accomplishments, Krista was known for her  kindness, generosity, and deep love for all living creatures. She was  an avid animal lover, and her compassion extended far beyond her own  pets. Krista carried an emergency kit in her car, always prepared…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688958/recognizing-the-life-of-krista-wynne-moore"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…of Alfred Thomas Lewerenz of Rainbow Springs, Florida,  who passed away on September 16, 2025, at the age of 89.\n\nMr. Lewerenz lived a life marked by service, leadership, and deep  devotion to his family and community. In 1952, he enlisted in the  Florida Army National Guard, beginning a distinguished 33-year military  career that saw him rise from Private…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697024/recognizing-alfred-thomas-lewerenz"}, {"senator": "John Rose", "party": "Republican", "sentence": "…ROSE. Mr. Speaker, President Trump signed a funding bill into law  yesterday that did more than just end a partial government shutdown. It  corrected a serious wrong.\n\nBuried deep inside the funding bill that the Senate passed and sent  to us last November was a hidden provision that never should have seen  the light of day. It was quietly inserted without…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699753/repeal-of-senate-payday-provision"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…to paint somebody a racist, you know,  when it comes to the Democrats.\n\nSo January 6 had nothing to do with racism. Let's be clear what  happened that day. Democrats and the Deep State hate Donald Trump so  much that they helped orchestrate a coup against our government. It has  been looked at, vilified; and the information that we found today is  just…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698541/9999"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Rescue Squad and  Bensalem Rescue Squad. Two years later, he joined the Bucks County  Department of Communications as a Police, Fire, and EMS dispatcher,  demonstrating his deep commitment to public safety.\n\nIn 1987, Lieutenant Moffett transitioned to a career in law  enforcement as a Deputy Sheriff with the Bucks County's Sheriff's  Department. Then,…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694744/recognizing-buckingham-township-police-department-lieutenant-william-moffetts-35-years-of-service"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…volunteers. In just three years, she has donated more than 3,650 hours  of her time to Gulfside Hospice.\n\nInspired by her mother, a longtime hospice volunteer, Joan has always  felt a deep connection to those in hospice care. Facing her own health  challenges, including chronic pain and limited mobility, only deepened  her empathy. Now retired from a successful…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690776/recognizing-joan-moore"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…tireless dedication, lives were transformed and bonds  were forged between heroes and horses. As the farm prepares to close on  July 31, we reflect not with sorrow but with deep gratitude. The legacy  of New Freedom Farm will live on in the hearts it healed and the  community it united.\n\nMr. Speaker, I thank Lois for her vision, compassion, and unwavering…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692312/recognizing-new-freedom-farm-and-lois-mcgill"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…family. They  arrived in America with no connections, no government handouts, no  safety net to rely on, and worked their way forward step by step. With  them, they brought a deep respect for the values of faith, family, and  hard work.\n\nWhen the Katergaris family took ownership of the Wagon Wheel in 1978,  the road ahead was challenging. Their restaurant…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696937/recognizing-the-katergaris-family"}]