[{"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…strengthening regional cooperation,  and expanding opportunities for trade, investment, and connectivity.  The recent summit in Washington underscored the mutual benefits of  deeper cooperation between the United States and Central Asia from  enhancing supply chain resilience and diversifying access to critical  minerals, to fostering people-to-people…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696589/welcoming-the-positive-outcomes-of-the-c51-summit-and-us-central-asia-partnership"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…generations of students. His efforts have created a community rooted in  respect and unity.\n\nMr. Kim's passion for youth development and multicultural outreach  has helped foster deeper understanding across communities, and his role  in bringing the 23rd Annual Korean American National Sports Festival to  North Texas underscores his commitment to cultural…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692616/regognizing-jaehyung-kim"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…around 2020 elections.\n\nNow, each of these individual actions of anti-election assault is  serious and significant, but each action needs to be seen together as  something deeper and broader. It is the sum and substance of  totalitarianism--not at some distant point in the future, not a vague  storm cloud on the horizon, but the destruction of democracy…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…hatchet and get to work.\n\nThe irony is that while Trump and Musk talk about eliminating the  Department of Education, they are trying to involve the Federal  Government even deeper into the schools than ever before. They talk  about how schools and parents know best, and then they threaten schools  if they don't do what they say. Apparently, Mrs. McMahon…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688363/nomination-of-linda-mcmahon"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…direct the  President to develop a comprehensive plan for negotiating free trade  agreements with Pacific Island countries that express interest, laying  the groundwork for deeper, long-term economic integration. Finally, my  bill would create a dedicated trade facilitation and capacity-building  program for the Pacific Islands to help partner governments…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697950/supporting-the-prosper-in-the-pacific-act"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…hearing and then claim the government bears no responsibility  should terrify every one of us.\n\nThese cases are the most glaring examples, but the assault on due  process runs deeper. This is not just about how we treat immigrants. It  is about whether any of us can count on being treated fairly when  accused of something. It is about whether there are…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690420/put-hardworking-american-families-first"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…of dollars in U.S. wealth was just lost this  past week due to chaotic moves on tariffs arbitrarily imposed by the  Trump administration. This week, the hole was being dug deeper as  markets continued to free-fall. There was a partial rollback. Where  will the roller coaster head next week? Nobody really knows.\n\nNone of the tariffs that the President…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…already  struggling to make ends meet as they navigate the President's tariffs  and stubbornly high prices, and are continuing to pay exorbitant APRs  may cause them to fall deeper into economic insecurity. This is why it  is important to extend strong protections against unscrupulous lenders  to all Americans.\n\nThe MLA's successful track record demonstrates…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699782/9999"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…justice is never  advanced without those willing to confront complacency and demand  accountability.\n\nThe Congressional Black Caucus will not be silent while families are  pushed deeper into poverty, while communities of color are targeted by  discriminatory policies, and while the promise of our democracy is  narrowed to serve the few instead of the many.…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699198/building-a-beloved-community"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…into the  past to `40 years of the Hungarian Festival' to commemorate culture and  community. With these resources, local schools, organizations, and  residents can develop a deeper understanding to the folk immigrant  experience. After 70 years, the foundation has stayed true to their  mission: to preserve Hungarian American stories for future generations…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689612/9999"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…relief but deliver  crisis, promise lower costs but drive them up, promise to protect  people then cut their care. But those broken promises will also mean  shattered families, deeper uncertainty, and an America that is sicker  and poorer.\n\nThis is what is happening to Catherine right now. She is on a  fixed income--roughly $45,000 a year--with a house payment…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…would  notice.\n\nHouse Republicans took a bill that was already rotten to the core and  made it even worse to appease the most radical factions of their party.  It will bring deeper, harder, and even faster pain to the American  people.\n\nIt seems the hard right over there wanted even quicker pain. It is  truly jarring to watch House Republicans cheer and…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…community, including  service on the board of Jewish Family Services. Her experience in the  Wexner Heritage Program--a prestigious two-year leadership initiative-- helped her forge deeper bonds across our city and champion unity across  diverse Jewish organizations.\n\nIt is an honor to recognize Monica Gurell during Jewish American  Heritage Month. Her unwavering…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691572/recognizing-monica-gurell"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…the deteriorating democratic  situation in Georgia. It will let the Georgian people know that we  stand by them in their quest for democracy, respect for their rights,  and deeper integration into the Euro-Atlantic community. This also  provides a framework for appropriate cooperation with the Georgian  Government going forward.\n\nMadam Speaker, I am…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690699/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Vought have  made clear they want to continue launching partisan broadsides that  will inflict deep harm on the American people, raising costs,  unleashing chaos, inviting even deeper corruption across the Federal  Government.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693852/appropriations"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…them, and President  Obama also recommended the elimination. With that level of bipartisan  criticism of existing commissions, I don't see why we need to dig  ourselves even deeper with another one, more debt, more projects that  are supposed to be done by others, and no Federal nexus, but here we  go.\n\nI know that people in the building will scoff at…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…Presidents have said Iran can never have a  nuclear weapon. It is a lot of talk but not a lot of action. Over and  over and over again, Iran moved forward, building their bunkers deeper,  building their sites more widespread, putting the world further at  risk.\n\nWhen Donald Trump talks, he doesn't just talk. When he says he is  going to do something, he does…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692703/thanking-president-trump-for-saving-the-world"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…transparency about which companies  holding Federal communication licenses and authorizations also have  influential ties to foreign adversarial governments, and we must look  deeper at who has this access and how many more companies like Huawei  are out there.\n\nCompanies like Huawei must be stopped. We can no longer permit  authoritarian regimes like China…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690666/fact-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…the most ambitious  missions we have ever embarked upon. These boosters are key to  propelling spacecraft, like NASA's Space Launch System, which is set to  carry astronauts deeper into space than ever before, including the  planned missions to the Moon under the Artemis program and eventually  to Mars.\n\nThe combined economic footprint of Utah's space-related…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687925/space-dominance"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…Department of Veterans Affairs  have allowed them to successfully treat over 59 veterans so far this  year.\n\nAs a Navy SEAL veteran, I have friends who have battled wounds that  go deeper than emotion. Advanced imaging now confirms that PTSD is a  neurological brain injury. Hyperbaric oxygen therapy, using pure oxygen  under pressure, heals these injuries directly…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700045/hyperbaric-oxygen-therapy-for-veterans"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…moment for me as a Christian.\n\nI was grateful to have met Prime Minister Netanyahu, Israel's  President Herzog, and our own Ambassador Mike Huckabee. Each visit  afforded a deeper understanding of the enduring bond between our  nations.\n\nOur delegation visited the site of the Nova music festival, where  Hamas terrorists carried out one of the most horrific…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695802/reflecting-on-trip-to-israel"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…Lebanon targeting Hezbollah operatives and arms since       reaching a ceasefire with the group in November following       several weeks of intense fighting, while attacks deeper       inside Lebanon are less common.\n\nThere was no immediate comment from the Lebanese government       about Tuesday's strikes, though the official National News       Agency…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…and no telling how many speeches.\n\nHe could turn out 10,000 words of elegant, sparkling, cogent prose,  seemingly, at a moment's notice while identifying for his readers the  deeper meaning of the day's news. Norman was an original  neoconservative and proud to be so.\n\nThese days, some historically illiterate podcasters and so-called  influencers use the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698421/unanimous-consent-requests-the-calendar"}, {"senator": "John James", "party": "Republican", "sentence": "…cost you hundreds of thousands of dollars.\n\nDo you know why, Mr. Speaker?\n\nIt is because people have choices.\n\nHere is the truth: Every single time Washington gets its mitts deeper  into healthcare, prices go through the roof and care gets worse.\n\nThat is why I introduced the Patients Deserve Price Tags Act. The  Patients Deserve Price Tags Act is pretty…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697860/obamacare-isnt-working"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…to support global industries; large commercial  space stations that can replace the ISS and host research; permanent  human habitation on the Moon laying the foundation for deeper space  travel; and the human exploration and the settlement of Mars, an  achievement that will truly define this century.\n\nThese are not science fiction novels. These are active…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…them by somebody  else. They believed they had a God-given right to shape their future,  and that is precisely what the people of Iran believe today.\n\nThe parallels runs deep, deeper than we sometimes see.\n\nWhen America endured the Great Depression, it was a time of doubt,  fear, and uncertainty. But leaders like Franklin Roosevelt reminded the  American…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Beautiful Bill became  law, the Congressional Budget Office has shed some light on this matter  and I think done a tremendous job of truth-telling, and it is important  to delve deeper into what they have said about this so the American  people can know what the truth is.\n\nCBO estimates that 10 million people will lose coverage due to the  One Big Beautiful…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695530/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…BAUMGARTNER. Mr. Speaker, this week, the President travels to the  Middle East on an important trip. It is a moment of great opportunity  but also serious risk. As the U.S. pursues deeper partnerships across  the gulf, we must remember that American leadership cannot rest on one- off deals or delusions of grand bargains. Our ambitions cannot outpace  reality.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691270/preventing-iran-from-obtaining-nuclear-weapons"}]