[{"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…raised in Vega Baja, Puerto Rico, Bad Bunny is a global  phenomenon. His songs transcend borders, sharing the vibrant culture of  Puerto Rico with millions, while stirring a deep sense of pride and  connection for Latinos across the globe.\n\nHis 2022 album ``Un Verano Sin Ti'' made history as the first  Spanish-language album nominated for the Grammy Award…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692866/recognizing-bad-bunny"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…and fear,  may the example of Sister Cabrini guide us back to fierce,  compassionate, inclusive love.\n\nMay her memory inspire us to build a nation where everyone feels a  deep sense of belonging, where every person's humanity is honored, and  where we truly love our neighbors as ourselves.\n\nMay she inspire us to build an empire, as she says, of hope,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…patrol  zone and swam over 300 yards in dangerous, choppy water to rescue a  woman who had been adrift for 2 hours without a life jacket.\n\nTheir swift response, courage, and deep sense of duty saved a life,  and Delaware is indebted to them.                       Devastating Food Assistance Cuts\n\nMs. McBRIDE. Mr. Speaker, last week, I stood alongside Senators…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693522/thanking-officer-robert-scisco"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "Mr. CLEAVER. Mr. Speaker, I rise today with a deep sense of gratitude  for the opportunity to recognize a great Missourian, Mr. Gerard Joseph  Grimaldi, for his exemplary personal and professional accomplishments  as he begins…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688302/recognizing-mr-gerard-j-grimaldi-on-his-retirement-and-expressing-appreciation-for-a-lifetime-of-dedicated-service-to-our-community"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…TBK by nurturing young minds--teaching a class of four-year- olds--and later, with her husband Dan, advising the youth group for  five years. Her sustained commitment and deep sense of purpose led her  to the board in 2010 and eventually to her current leadership role.\n\nA veteran teacher in the Rochester City School District, Monica has  also volunteered…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691572/recognizing-monica-gurell"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…introduction, Ms. Erica ``Rikki''  Miller, to our country and to the House of Representatives. For nearly  the last decade, Rikki has served with integrity, compassion, and a  deep sense of duty. Whether it was driving a Member as a humble staff  assistant, enhancing the caucus communications, directing  communications on energy policy for a senior Member…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696707/recognizing-the-career-of-erica-rikki-miller-and-her-work-on-behalf-of-michigans-3rd-congressional-district"}, {"senator": "Mike Kelly, Jr.", "party": "Republican", "sentence": "…management of county finances but have also  earned her the respect and admiration of colleagues, local officials,  and community members alike.\n\nMs. Krzysiak's career reflects a deep sense of duty and pride in her  work. Her efforts have directly contributed to the effective operation  of county government and have helped maintain the financial health and…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689885/recognizing-christine-krzysiak-as-a-community-champion-in-pennsylvania-16"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…amazing advocate in helping get this bill over  the line once again. I am proud to stand here today and explain why  this piece of legislation is so important.\n\nI rise with a deep sense of purpose and conviction to advocate for  the passage of H.R. 3095, a commonsense, bipartisan bill that directs  the United States Postal Service to designate a single unique…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Just three years later, he took on leadership roles both  as Recording Secretary and First Lieutenant. Over the years, Alan's  service with the fire company was marked by a deep sense of duty--a  reflection of his strong desire to serve and protect the community he's  always called home.\n\nIn 1994, Alan assumed the role of Roadmaster for Plumstead Township,…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693337/recognizing-alan-bleams-40-years-of-service-with-plumstead-township"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…of experience, Mrs.  Prakash has continuously developed and refined her program to meet the  diverse needs of her students, demonstrating innovation, adaptability,  and a deep sense of care.\n\nServing in a rural community where educational challenges are often  magnified, she has gone above and beyond to ensure that every student  receives personalized…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…Week, a time to recognize the hardworking men and women  who are the engines of our economy.\n\nAs a former small business owner myself, I know the long hours,  risks, and deep sense of responsibility that come with signing both  sides of a paycheck. Small businesses are more than storefronts. They  are job creators, community anchors, and the heart of…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690917/recognizing-hard-workers-driving-our-economy"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…community institution in Clinton, TN. For nearly a century,  Hoskins Drugstore has been a cornerstone of the community, providing  not only essential services but also a deep sense of connection and  tradition.\n\nOn April 4, 2025, Hoskins Drug Store will celebrate 95 years of  service. Founded by R.C. Hoskins in 1930, Hoskins Drug Store quickly  became…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689423/recognizing-hoskins-drug-stores-95th-anniversary"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…investigations and helped to strengthen the bond between State and  local public safety partners. His commitment to protecting families and  upholding the rule of law reflects a deep sense of duty to his  neighbors and fellow Georgians.\n\nThe Support Officer of the Year Award is given to individuals whose  actions have gone above and beyond their normal responsibilities…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698926/recognizing-riverview-hotels-110th-anniversary"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…Financial Group. From his first role in  the retirement division to serving as Chairman, President, and Chief  Executive Officer, Dan has exemplified steady leadership, a deep sense  of responsibility, and a commitment to doing right by others. His  career reflects the integrity and work ethic that define our state.\n\nThroughout his four decades at Principal,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695028/recognizing-the-service-and-leadership-of-dan-houston"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…beautiful lakes.  As we commemorate this centennial milestone, we honor the generations  who have shaped Polk City's legacy as a city built on resilience,  agriculture, and a deep sense of community.\n\nHappy Centennial, Polk City.", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694002/recognizing-the-100th-anniversary-of-the-city-of-polk-city-florida"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…every single  one of them.\n\nThat is the mark of a leader who not only commands respect but  inspires it. He embodied the warrior spirit, the never-quit attitude,  and the deep sense of duty that defines the very best of our Armed  Forces in this country.\n\nToday, I am proud to tell you just one of many stories of Bruce  ``Puppy'' Fecht, and we honor him…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Their careers reflect decades of sacrifice and discipline. They  represent the strength and resilience of our Armed Forces and the  patriotism of those who serve out of a deep sense of duty.\n\nSome among them have borne the scars of war. Others have shaped the  lives of those they led and mentored. All have left a lasting impact on  their units, their…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694579/recognizing-floridas-eighth-congressional-district-veterans"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…historical roots. As we  commemorate this centennial milestone, we honor the generations who  have shaped Coleman's legacy as a city built on resilience,  agriculture, and a deep sense of community.\n\nHappy Centennial to the City of Coleman.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693103/recognizing-the-100th-anniversary-of-the-city-of-coleman-florida"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and talents into the organization speaks  volumes about her love for Brooksville and her desire to see it thrive.  She embodies the spirit of volunteerism, demonstrating a deep sense of  responsibility and pride in her work. Her dedication, hard work, and  commitment to BMS have made an undeniable difference in our community,  and we are deeply grateful…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690272/recognizing-cindy-mahon"}]