[{"senator": "André Carson", "party": "Democrat", "sentence": "…abuse material, and reckless  DUI homicide.\n\nDespite the clear evidence of crimes committed by these individuals-- on January 6, 2021, and after--President Trump continues to defend  insurrectionists but demonize immigrant neighbors who have committed no  violent crimes and are being denied due process. Immigration arrests  under the Trump administration…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698532/recognizing-the-5th-anniversary-of-january-2021"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…say it to you to your face.\n\nHe is entitled to due process of the law. Look, if he is a member of  MS-13 and he has committed a crime, try him, convict him. Nobody wants  to defend members of MS-13, but being a member of a gang does not  deprive one of due process of the law.\n\nIt goes on to indicate here: ``But previously admitted that the  deportation…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…also push forward the Raise the Wage Act to gradually bring  the Federal minimum wage in line with the economic reality of American  workers.\n\nMr. Speaker, Democrats will also defend Social Security, Medicare,  and Medicaid. We will do this with legislation such as Representative    John Larson's Social Security 2100 Act, which will increase benefits  while…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Capitol  Police Sergeant Aquilino Gonell who was nearly crushed to death on  January 6.\n\nSergeant Gonell is an Army veteran from the Iraq war and was  upholding his oath to defend and protect the seat of our Nation's  government. He said he saw violence on that day here at the Capitol far  worse than anything he experienced fighting for America abroad.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…any one man's lust for an expanded control  of land. It is not the Department of War. It is the Department of  Defense. That is how Americans view our role in the world, to defend  ourselves and to defend freedom in a world with dictators and thugs who  would subjugate us all if they could.\n\nGod stop us if we become the thug, if we become the dictatorship…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698929/greenland"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…denounced these actions  as undermining our democratic norms and traditions, and I would like to  highlight one such open letter from former U.S. leaders.\n\nWe swore to support and defend       the Constitution against all enemies, foreign and domestic.       Foreign and domestic. None of us thought the second part of       that phrase would ever come into play--until…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…a  self-proclaimed White nationalist and Islamophobe with a personal  vendetta against U.S. Government officials--and, by the way, no  security clearance, no sworn duty to defend the Constitution--can  dictate who serves in critical intelligence positions and even prevent  Members of this Chamber from conducting basic oversight?\n\nI have to ask again:…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…particular, I want to shout out Jennifer  Chartrand, Jason Gray, and Ed Etzkorn.\n\nThrough this bill, we have the solemn responsibility of appropriating  the funds necessary to defend our Nation and to protect the safety and  well-being of our men and women in uniform. However, I must oppose this  bill which abandons our allies, damages our military readiness,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693648/department-of-defense-appropriations-act-2026"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "Ms. HOYLE of Oregon. Mr. Speaker, I thank the gentleman for yielding.\n\nMr. Speaker, when we took office, we swore an oath to support and  defend the Constitution. It was a promise to the American people that  we would uphold the law, protect their rights, and defend our  democracy.\n\nKilmar Abrego Garcia, who was living…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690511/trump-immigration-policies"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…increases funding for  election security grants by $30 million, providing States and  localities with the resources that they need to shore up our election  infrastructure and defend our democracy against any form of  interference that could deny us the most basic right.\n\nIn addition to our right to vote, this bill protects our right to  counsel codified…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…government will not keep its part of the bargain.\n\nI demand that this government invest in the VA system rather than  seek its demise. The brave men and women who sacrificed to defend our  country deserve better.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699027/scrimping-on-veterans-medical-care-is-un-american"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…citizens that we serve--are going to be put in harm's way.\n\nSo we couldn't have a better advocate than a person who herself made  that decision to stand up for America, to defend our country, put  herself in harm's way, who inspires us every day with her incredibly  positive attitude despite these incredible injuries that none of us-- none of us can…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696567/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…guarantees treatment,  diagnoses, effective healthcare, you don't have your health.\n\nI am here--I wish I could say--to celebrate these vital programs,  but, really, I am here to defend them, to defend them against deep and  damaging cuts made by Senate Republicans and the Trump administration.  Their budget decimates Medicaid benefits. It threatens rural…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694385/9999"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Social Security in the country. Social Security is what brought  American seniors out of poverty and into a distinguished and fair  retirement, and it really matters that we defend it and that Social  Security remain unbroken.\n\nThe threat is pretty clear. The President keeps talking about  imaginary fraud. Why would you talk about imagery fraud in a system…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690667/nomination-of-frank-bisignano"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…as Vice President of  the Missouri AFL-CIO and Business Manager of Laborers Local 264, a  position he held for more than 15 years, let us celebrate the work he  has done to defend workers' rights, raise workplace standards, and  expand union access across numerous industries.\n\nMr. Thomas began his career in the labor movement with Laborers Local  264…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692686/recognizing-reginald-l-thomas-for-his-distinguished-service-to-laborers-local-264-and-the-missouri-afl-cio"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…There is no denying Islam's intent to dominate Western  civilization. Their stated objective is to destroy us from within.\n\nAll who serve in this Congress swore to support and defend the  Constitution of the United States against all enemies, foreign and  domestic. This is a time for choosing. Either we defeat the sharia  advances in America, or government…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697017/sharia-is-dangerous"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…individuals gather  to disrupt the activities of ICE and our Federal officers, and then you  saw these extreme and horrifying acts of violence.\n\nI will be very clear: I will defend in any way that I can the right  to assemble and protest regardless of the content of what the  protesters are advocating. This is foundational. It is fundamental to  the American…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…approach America's 250th birthday, let us honor veterans like John  Gilman not only with medals but through our daily commitment to live up  to the freedom they fought to defend.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696843/focusing-on-results"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Bruce Westerman,                                                          Chairman.\n\nMr. STAUBER. Madam Speaker, I will make a comment that the Republican  Party will always defend the police, not defund them.\n\nMadam Speaker, I yield 6 minutes to the gentleman from California  (Mr. McClintock), the lead sponsor of this bill.\n\nMr. STAUBER. Mr. Speaker,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693931/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…in the way of Allah is our highest hope.''\n\nMeanwhile, Europe has fallen. London and Paris are mere shells of  their former strong selves. You watch veterans who fought to defend the  United Kingdom in World War II. Those still alive tear up and cry,  wondering what it was that they fought for when they watch the radical  extension of Islam into the…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…use in law  enforcement to save lives, not only the officer, not only the subject  or the suspect, but bystanders.\n\nFor my colleagues on the other side of the aisle to try to defend the  philosophy that we don't need those or this piece of legislation that  involves the tax code isn't legit, it is just atrocious.\n\nHere is a list of people that support…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700031/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…obstruction of every single  nominee of a Democrat President can't look that attractive.\n\nOf course, the Democrat leader has made an attempt to attack  Republicans' measure and defend his party's historic obstruction, and  one thing he is fixated on is his claim that Democrats' historic  obstruction is justified because President Trump has put forward  ``historically…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695295/rules-change"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…universities can support  members of our military.\n\nI congratulate President Armacost, Director Angie Carpenter, and the  entire UND community for their dedication to those who defend our  freedoms.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697044/recognizing-university-of-north-dakota-upon-earning-gold-award"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…deploy a unified and focused  strategy on how to appropriately dismantle and remove these threats  from our country.\n\nIt is past time that we return to a posture of strength to defend  America and our citizens. We must clearly and effectively send a  message that the  United States will no longer be a safe harbor for violent foreign  terrorist organizations…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696955/tren-de-aragua-border-security-threat-assessment-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…along with thousands of others across the country,  deserve not only our gratitude but our unwavering support. May God  bless them, their families, and all who protect and defend our  communities.\n\nMr. MOORE of Utah. Mr. Speaker, I thank the gentleman from Florida.\n\nHe took over for a good friend of mine. We  have a very common district. I represent…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…space, and cyberspace. It provides  for next-generation systems and emerging technologies, strengthens our  nuclear deterrent, and supports investments in cyber capabilities to  defend against 21st century threats.\n\nImportantly, this legislation continues bipartisan efforts to improve  military quality of life, including robust funding for servicemember…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…missing in action, those  lost at sea, and the thousands who now rest beneath our flag, having  paid the ultimate price for our freedom.\n\nThese heroes answered the call to defend liberty, knowing it could  cost them their lives. Because of them, we live in a country where  freedom still rings and the American Dream endures.\n\nTheir sacrifice is not just…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691575/recognizing-the-75th-anniversary-of-james-wood-high-school"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…struggling to keep up with modern cyber threats.\n\nMany smaller jurisdictions only operate with a handful of IT staff  and, in some cases, with none at all. Yet, they are expected to defend  against the same nation-state actors that target major corporations and  Federal agencies. That is not a fair fight, and it is not a sustainable  model for national security.…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696789/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…States of America, both  Active-Duty servicemembers and the veterans who have sacrificed for our  freedom.\n\nLisa's belief has always been simple yet powerful: The people who  defend our Nation deserve quality homes, supportive communities, and a  true sense of belonging.\n\nOne of the most outstanding examples of this commitment is at Offutt  Air Force Base…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696802/recognizing-lisa-yanney-roskens"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…what bill we are actually debating  on the floor, that the bill that pertains to law enforcement in  Washington, D.C. It has nothing to do with their quest to continue to  defend the rioters and illegals in California.\n\nMr. COMER. Madam Speaker, I have no further speakers, and I am  prepared to close. I yield myself the balance of my time.\n\nMadam Speaker,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692305/protecting-our-nations-capital-emergency-act"}]