[{"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…to vote ``no.''\n\nMr. AUSTIN SCOTT of Georgia.\n\nI urge my colleagues to vote ``yes'' on the rule and ``yes'' on the  underlying piece of legislation, especially the National Defense  Authorization Act.\n\nMr. Speaker, I want to address a couple of things since, as usual,  the Democrats continue to blame President Trump for everything.\n\nJust as a reminder,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697852/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…racism to  identify it and attack it. You can't because when you do, people know  that you become persona non grata. You can't say: This is racism.\n\nYou are left without the defense of identifying racism when you want  to assault racism. We should be able to assault it. We should be able  to attack it. You can't do it because when you do, the status quo…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…by  these Federal immigration agents.\n\nJust yesterday, an ICE agent shot and killed a woman in Minneapolis.  The video of the shooting is horrific and contradicts the self-defense  narrative that DHS has attempted to spin. Minnesota officials have  rightfully promised a full, fair, and expeditious investigation. DHS  Secretary Kristi Noem has dodged…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698781/operation-midway-blitz"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…requires an urgent       and unified response. As a result, we call for the following:\n\n--Former senior officials, including presidents,       secretaries of state, secretaries of defense, and chiefs of       staff of our military services must jointly and publicly       challenge the administration's dangerous policies and       dismantling of essential institutions.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…as a  Star Mentor to his peers.\n\nToday, Mr. Younger is a respected attorney based in Jackson,  Mississippi. His primary areas of legal practice include medical  malpractice defense, motor vehicle defense, nursing home and long-term  care defense, premises liability, products liability, and workers'  compensation defense.\n\nHis athletic legacy continues…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695590/9999"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…But the more things change, the more they stay the same. Plus ca  change, plus c'est la meme chose.\n\nOn October 29, Trump announced that he is directing the Department of  Defense to resume nuclear testing in a disastrous policy reversal, but  not surprising as this is featured in Project 2025--the policy  blueprint for the Trump Administration. On…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696948/opposition-to-explosive-nuclear-testing"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…her life would look like.\n\nI grew up in a family of public servants, a bipartisan family, a  biracial family, and my dad, who was a civilian employee for the  Department of Defense, had pretty good government employee insurance,  but that insurance wouldn't have covered all of the surgeries,  specialists, and the equipment that Olivia needed to thrive.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688135/republican-budget-betrayal"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…loved and respected for your resilience and for your  breadth. Keep pushing.\n\nMr. Chair, I rise today in opposition to this amendment that would  prohibit the Department of Defense from collecting data on gender  identity.\n\nData is not just numbers. Data is a story and reflection of those  lived realities of real people, and this amendment is to stop…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695230/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…essential  qualifications in his educational background as well as in his  experience.\n\nThe VA's 2025 budget request is for $370 billion. It is second only  to the Department of Defense. It needs someone who not only is loyal to  President Trump--in fact, more than loyalty to President Trump--it  needs someone with the objective qualifications and experience.…", "date": "2025-07-24", "source_url": "https://justfacts.votesmart.org/public-statement/1694219/9999"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…extends the Child Care in Your Home pilot through 2029 and  requires annual reviews of childcare fee assistance.\n\nWe also include protections I championed for our Department of  Defense civilian workforce, barring arbitrary layoffs for DODEA  teachers and childcare staff, and shielding public shipyard employees  from reductions in force or hiring freezes.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697807/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…offering a serene and natural amphitheater that creates a  peaceful place for solemn remembrance.\n\nWith a rich history linking the site to the Native Hawaiian people  and the defense of Honolulu during the Second World War, the cemetery  opened to the public on July 19, 1949, with services for five who lost  their lives in service to our Nation: an unknown…", "date": "2025-12-26", "source_url": "https://justfacts.votesmart.org/public-statement/1698471/introduction-of-hawaii-national-cemetary-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Chair of the Armed Services Committee, took him under his wing  and gave him an education on how to successfully navigate the sprawling  annual task of passing the National Defense Authorization Act. He could  not have learned from a better teacher.\n\nAt Seapower, Phil diligently followed the north star of the  Constitution's mandate in Article One, Section…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699522/9999"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…without a  congressional vote.\n\nLet me answer a couple of questions that colleagues of mine have  asked about the resolution that I filed yesterday.\n\nFirst, what about self-defense? What about if Iran does take action  against the United States, the homeland, or at a U.S. base in the  Middle East or at a U.S. consulate in Erbil in the Kurdish area of…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "Ms. ANSARI. Mr. Speaker, this week I offered four commonsense  amendments, several with bipartisan support, that would have made the  fiscal year 2026 National Defense Authorization Act stronger and more  responsible.\n\nI want to specifically highlight two of these important amendments  for you all in the limited time that I have.\n\nThe first…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695106/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…power. An act of Congress created the Department of Education and only  an act of Congress can dismantle it, and we will fight that.\n\nLast month, I introduced H. Res. 94 in defense of public education.  We have more than 80 colleagues on that resolution. I want everyone to  join us in signing that. Do not let them bulldoze our public education  system.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688596/we-need-the-department-of-education"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "Mr. SULLIVAN. Mr. President, had Kaine amendment No. 3337 to Calendar  No. 115, S. 2296, FY2026 National Defense Authorization Act, NDAA, been  a recorded rollcall vote, I would have voted no.", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696201/vote-explanation"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…important for us to begin to chip away at that national  debt. I have said, time and time again, that we are spending more money  on interest on the national debt than we are on defense, which is an  unsustainable trajectory in a very dangerous world. I have been an  advocate of looking at ways to trim mandatory spending programs, and  the Big Beautiful Bill…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…funding terrorist groups? They  have threatened to kill American officials: President Trump, Brian  Hook, General McKenzie, Robert O'Brien, Mike Pompeo, former Secretary  of Defense Mark Esper. All these people were involved in the Soleimani  attack.\n\nWhy did we go after Soleimani? Because he was the leader of the more  radical elements of their military…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…urgent challenges facing  our Nation today: our growing and unnecessary dependence on other  nations for the critical minerals that drive our economy and sustain  our national defense.\n\nThe United States has never been more reliant on hard rock minerals  than it is today. Copper is the backbone of our electricity grid.  Nickel, cobalt, and lithium go into…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…countries, who are trafficking narcotics, and who have  been engaging in criminal behavior in the United States of America.\n\nWhat do my Democratic colleagues do? They stand up in defense of  criminals, of criminal illegal aliens, and are in constant attack on  the men and women of ICE.\n\nLet's just go through some recent criticisms of the great men and  women…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…on mandatory spending,  the things that are on autopilot.\n\nFor most Members of Congress in their entire career, everything they  vote on is borrowed money. When we vote on defense, when we vote on  nondefense discretionary, the things we do get to vote on, every dime  of it is all borrowed. Last year, about $300 billion or $400 billion of  mandatory,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Speaker, I move to suspend the rules and pass the bill  (S. 160) to amend the Wildfire Suppression Aircraft Transfer Act of  1996 to reauthorize the sale by the Department of Defense of aircraft  and parts for wildfire suppression purposes, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691858/aerial-firefighting-enhancement-act-of-2025"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…training included the Substance Abuse Program Prevention  Course, Digital Multimedia Course, Instructor Training Course, Public  Affairs Course, Combat Lifesaver Course, NBC Defense Course, Joint  Tactical Ground Station Course, Space/Missile Warning Course,  Multichannel Satellite Communication Course, PATRIOT System Maintainer  Course, and Human Resources…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696275/recognizing-sergeant-first-class-alyn-michael-macleod-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…the One Big Beautiful Bill Act, investments  that reaffirm President Trump's commitment to peace through strength.\n\nThis bill delivers $25 billion for the Golden Dome missile defense  system, our answer to hypersonic and NextGen threats from adversaries  like China and Iran.\n\nIt expands our naval fleet, restocks our munitions, modernizes our  nuclear deterrent,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692966/peace-through-strength"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…a single point. Senior captain and  Linville Hill's all-time leading scorer, Stephen Smucker, then sank the  go-ahead basket with under thirty seconds to go. A spectacular defense  from Linville Hill Christian sealed a 55-54 victory. Their state title,  the first in the program's history, crowned a historic 29-3 season.  Coach Mike Schatzmann and the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689659/congratulating-the-linville-hill-christian-school-boys-basketball-state-champions"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "Mr. GRAVES of Missouri. Mr. Speaker, I rise today in support of S.  1071, the National Defense Authorization Act of 2026, which includes  the Coast Guard Authorization Act of 2025, bipartisan legislation to  authorize appropriations for the Coast Guard for fiscal years…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697805/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…government you want me to cut.\n\nThe problem with that math is, when you look at the charts, do you  see what is in blue? That is everything a Member of Congress gets to  vote on, defense and nondefense. Your only problem is that it is 26  percent of the spending.\n\nIf you ask a Member of Congress right now to balance the budget, we  can do it. We can do it.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…using available sources of data,       which may include--\n\n(A) health care and other administrative databases of the       Department of Veterans Affairs, the Department of Defense,       and the individual Services, respectively;\n\n(B) the national death index maintained by the National       Center for Health Statistics of the Centers for Disease…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693894/aces-act-of-2025"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "Mr. DOWNING. Mr. Speaker, I want to take this opportunity to  recognize the importance of the House's passage of the 2026 National  Defense Authorization Act earlier this week.\n\nThe 2026 NDAA codifies critical provisions of President Trump's peace  through strength agenda, including authorizing full funding for…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698101/importance-of-ndaa-passage"}, {"senator": "James Risch", "party": "Republican", "sentence": "…amended, we are forwarding herewith Transmittal No. 25-60,       concerning the Air Force's proposed Letter(s) of Offer and       Acceptance to the Government of Finland for defense articles       and services estimated to cost $1.07 billion. We will issue a       news release to notify the public of this proposed sale upon       delivery of this letter…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695329/arms-sales-notification"}]