[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…DURBIN. Mr. President, I was necessarily absent for rollcall vote  No. 415, motion to invoke cloture on the nomination of Bradley Hansell  to be Under Secretary of Defense for Intelligence and Security. Had I  been present for the vote, I would have voted nay.\n\nI was necessarily absent for rollcall vote No. 416, motion to invoke  cloture on the nomination…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694603/vote-explanation"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…officials--punishing intelligence officials in particular-- for telling the truth only weakens our ability to confront them.\n\nWe have seen the three-star general leading the Defense Intelligence  Agency pushed out after analysts produced a straightforward, evidence- based assessment showing that Iran's nuclear program had not been  obliterated, as President…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Officer, retired; Heather       Hodges, US Ambassador, retired; Elizabeth Hopkins, Senior       Foreign Service Officer, retired; Sharon Houy, Former Chief       of Staff, Defense Intelligence Agency; Jeff Hovenier, US       Ambassador, retired; Vicki Huddleston, US Ambassador,       retired; Robert Hutchings, Former Chairman, National       Intelligence Council;…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…explanation, canceled it,  leaving Members of Congress and the American people in the dark.\n\nThere are now reports of a leaked classified battle damage assessment  from the Defense Intelligence Agency that disputes what the President  and the Secretary of Defense have been telling us. The American people  are left wondering: Are the President and the Secretary…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692935/cancellation-of-iran-classified-briefing"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…waits for Trump to break apart our own security blanket  so he can pick liberty's shield off one by one.\n\nThirdly, the Trump administration has weakened our cyber defense.  U.S. top intelligence officers recently released the annual threat  assessment, which states the following: ``Russia's advanced cyber  capabilities, its repeated success compromising…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…developing the report required under       subsection (a), the Comptroller General may consult with--\n\n(1) the maritime and aviation industries;\n\n(2) the Secretary of Defense;\n\n(3) the intelligence community; and\n\n(4) any relevant--\n\n(A) federally funded research institutions;\n\n(B) nongovernmental organizations; and\n\n(C) institutions of higher education.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…particularly the People's Republic of China.\n\nThrough the Intelligence and Special Operations Subcommittee, we were  able to ensure our Special Operations Forces, the Defense Intelligence  Enterprise, and the Defense Security Cooperation Agency have the tools  required to execute the Department's efforts in strategic competition  and in countering malign…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697804/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…Station Dallas, where he flew the storied F-4  Phantom.\n\nBart was then transferred to the USS Enterprise, where he flew combat  missions in Vietnam. He later served at the Defense Intelligence Agency  and as a commanding officer at Naval Air Station Atlanta before  retiring at the rank of captain in 1994, almost 26 years of service.\n\nBart is not only recognized…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698432/republicans-have-delivered-in-2025"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…portions of this  bill, in conjunction with approximately $2.2 billion in reconciliation  funding, continues to focus on providing our Special Operations Forces,  the Defense Intelligence Enterprise, and the security cooperation  enterprise with the tools required to ensure their capabilities can  support the Department's efforts in strategic competition…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695148/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…heavily in AI, integrating it into its military and economy. America  cannot afford to fall behind.\n\nMy first amendment expands AI pilot programs and logistics, cyber  defense, intelligence, and maintenance. AI is a vital force multiplier,  cutting costs, speeding decisions, and keeping our warfighters ahead.  It also mandates regular reports to Congress…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695229/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…the people of  the United States.\n\nThe subcommittee for which I am responsible in this Congress as the  ranking member is the appropriations for the Department of Defense and  for Intelligence Communities. The chair is Senator McConnell. I have  truly enjoyed working with Senator McConnell on the very complex,  challenging, and urgent issues related to…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699444/appropriations"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…delivered critical components to or       entered into any agreement relating to the sale or delivery       of critical components with any entity operating in the       defense or intelligence sectors of the Government of the       Russian Federation;\n\n(C) has knowingly delivered critical components to or       entered into any agreement relating to the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690679/economic-espionage-prevention-act"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…Intelligence Officer of the Intelligence Community,       coordinate with such officials of the Department of Defense,       as identified by the Under Secretary of Defense for       Intelligence and Security, for any systems used by an       Intelligence Community element of the Department of Defense.\n\nSection 6602 also requires the head of each Intelligence…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698262/explanatory-statement-for-the-intelligence-authorization-act-for-fiscal-year-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…various roles, like chip design, electronic automation, and  manufacturing. DRAM is also a vital asset to America's national  security. Every fighter jet, missile defense system, and intelligence  operation depends upon the reliable, secure, domestically produced  memory technology inspired by Dr. Dennard's original invention.\n\nAs we celebrate National…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691716/recognizing-national-dram-day"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…one final ask. I hope my  colleagues can agree that we have at least one critical nominee today  approved.\n\nLet's consider Bradley Hansell to be Under Secretary of Defense for  Intelligence and Security.\n\nMr. Hansell is a former Green Beret, Senior Director on the National  Security Council staff, and has previously received bipartisan  support. He will…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691405/motion-to-discharge-s-res-195"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…commercial wireless. That portrayal  is both inaccurate, and it is dangerous. The reality is these  frequencies are not idle. They are the backbone of America's missile  defense and intelligence systems. And we should not be allowing Federal  Agencies to sell critical communication channels needed to carry out  the Trump administration's priorities, including…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695027/9999"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…among ourselves and debate as to whether or not we should go  forward with the military operation in question. That would paralyze  this country.\n\nAnd this leak of the defense intelligence assessment tells you  exactly what would happen if they brought this problem over to us to  solve.\n\nSo it has been clear to me that only five times in the history of…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693122/motion-to-discharge-sj-res-59"}]