[{"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Speaker, as we recognize Women's History Month, I  rise, as an OB/GYN, in fierce defense of our Nation's moms and babies.", "title": "Women's History Month", "date": "2025-03-26"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Speaker, on Friday, The Washington Post reported an egregious  abuse of power by the Secretary of Defense.", "title": "Providing for Consideration of H.R. Student Compensation and Opportunity Through Rights and Endorsements Act; Providing for Consideration of H.R. Combating the Lies of Authoritarians in School Systems Act; Providing for Consideration of H.R. Transparency in Reporting of Adversarial Contributions to Education Act; Providing for Consideration of H.R. Promoting Responsible Oversight to Eliminate Communist Teachings for Our Kids Act; Providing for Consideration of H.R. Small Business Regulatory Reduction Act of Providing for Consideration of H.R. Destroying Unnecessary, Misaligned, and Prohibitive Red Tape Act", "date": "2025-12-02"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Putin also wants a veto over defense measures being taken in the  former Warsaw Pact states that want to remain free.", "title": "Liberty Versus Dictatorship", "date": "2025-05-13"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "As a result, we call for the following:\n\n--Former senior officials, including presidents,       secretaries of state, secretaries of defense, and chiefs of       staff of our military services must jointly and publicly       challenge the administration's dangerous policies and       dismantling of essential institutions.", "title": "Recognizing ``Assault on American Diplomacy''", "date": "2025-05-20"}, {"senator": "Al Green", "party": "Democrat", "sentence": "You are left without the defense of identifying racism when you want  to assault racism.", "title": "Bloody Sunday and Voting Rights Act", "date": null}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "According to a May 2021 report from the  Department of Defense, ``credit cards, auto loans, and personal loans  are widely available at risk-based rates under the 36 percent  [military] APR'' and ``[s]ervice members continue to have ample access  to necessary credit.''\n\nMoreover, this legislation would follow the trend in many States  towards greater protections against predatory loans.", "title": "-9999", "date": "2026-02-05"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "The AUKUS agreement accomplishes these ends by providing Australia  with additional submarine training and technology in Pillar I, as well  as knitting together cooperative defense research and development  efforts between Australia, the United States, and the U.K.", "title": "Aukus Reform for Military Optimization and Review Act", "date": null}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "Instead of doing the hard work of diplomacy, we are being asked to  plow billions of taxpayer dollars into a dangerous fantasy: the so- called Golden Dome, a missile defense system.", "title": "Expiration of New Start", "date": "2026-01-14"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "It  is unfortunate that the Department of Defense has failed to provide the  Appropriations Committee with a full account of operational costs in  SOUTHCOM and a projection of what future costs may be incurred.", "title": "Supporting of H. Con. Res. 61 and H. Con. Res. 64", "date": "2025-12-17"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "It is the Department of  Defense.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Then this week he said that: ``If the massive deficit spending  continues, there will only be money for interest payments and nothing  else: no Social Security, no medical, no defense, nothing.''\n\nThis week he said about the big, ugly bill: ``I am sorry, but I just  can't stand  it anymore.", "title": "Which Elon Musk to Believe", "date": "2025-06-06"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "It supported our men and women in uniform  and strengthened our national defense.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "Speaker, today I rise to recognize Gene Fisher,  whose exceptional leadership and tireless advocacy as Co-Chair and  Executive Director of the Regional Defense Partnership have  strengthened Ventura County's defense community, bolstered our regional  economy, and ensured that our military installations remain resilient  and mission-ready.", "title": "Recognizing Gene Fisher and His Dedicated Service to the County of Ventura", "date": "2026-02-20"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "Initially, as he often does, the Secretary of Defense and his office  denied the reporting when it broke last weekend.", "title": "Caribbean Boat Strike", "date": "2025-12-03"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "3838, the Streamlining  Procurement For Effective Execution and Delivery and National Defense  and Authorization Act for Fiscal Year 2026.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "Rand Paul", "party": "Republican", "sentence": "It is impossible to ensure all of these locations have  adequate air and missile defense capabilities.", "title": "Motion to Discharge--S.J. Res. 59", "date": "2025-06-27"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "1071, the National Defense Authorization Act of 2026, which includes  the Coast Guard Authorization Act of 2025, bipartisan legislation to  authorize appropriations for the Coast Guard for fiscal years 2026 and  2027.", "title": "Disinterment of Remains of Fernando V. Cota From Fort Sam Houston National Cemetery, Texas", "date": "2025-12-10"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "With threats from our foreign  adversaries, like China, only continuing to grow, we cannot risk  leaving our defenses weakened.", "title": "Researching Efficient Federal Improvements for Necessary Energy Refining Act", "date": "2025-11-20"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "HUMAN TRAFFICKING DEFENSE.", "title": "Trafficking Survivors Relief Act", "date": "2025-12-01"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "To gain peace through strength, we have invested in America's  national defense.", "title": "Providing An Update to the American People", "date": "2025-12-03"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "My second amendment redirects $2 million of wasteful spending to  increase further funding for counternarcotic support within the  Department of Defense.", "title": "Department of Defense Appropriations Act, 2026", "date": "2025-07-16"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "All the blue, defense and nondefense, is 25, 26 percent of our  spending.", "title": "Stop Bathing in Folklore and Start Bathing in Math", "date": "2025-06-26"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "His military career spanned critical roles in both combat arms  leadership and defense acquisition.", "title": "Congratulating Mr. David Cook of Huntsville, Alabama on His Retirement", "date": "2025-12-09"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "National Medal of Honor Day is an opportunity to pay tribute not only  to their acts of courage but also to the profound sacrifices made in  the defense of our freedoms.", "title": "National Medal of Honor Day", "date": "2025-03-26"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "(Mac) Thornberry National Defense Authorization       Act for Fiscal Year 2021 (47 U.S.C.", "title": "National Telecommunications and Information Administration Reauthorization Act of 2025", "date": "2025-04-28"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "His bravery and dedication were  recognized with numerous commendations, including the National Defense  Service Medal, Good Conduct Medal, Vietnam Service Medal with 5 Bronze  Service Stars and one Silver Star, Vietnam Campaign Medal, Vietnam  Cross of Gallantry, Navy Valorous Service Ribbon, and a Presidential  Unit Citation.", "title": "Recognizing Danny Wallace Smith with A Congressional Veteran Commendation", "date": "2025-10-17"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "The bill delivers strong support for our national defense and  provides $25.4 billion for the National Nuclear Security  Administration, prioritizing the continued modernization of the nuclear  weapons stockpile and the United States Navy nuclear fleet.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-08"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Speaker, the second issue that I will take on is that we passed a  defense authorization bill last week that I think had a serious  problem.", "title": "Breakdown of Traditional Families", "date": null}]