[{"senator": "Mary Scanlon", "party": "Democrat", "sentence": "If we defeat the previous question, I will offer an amendment to the  rule to provide for consideration of H.R.", "title": "Providing for Consideration of H.R. Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year and Providing for Consideration of H.R. Stop Illegal Entry Act of 2025", "date": null}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Speaker, if we defeat the previous question, I will offer an  amendment to the rule to bring up H.R.", "title": "Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Office of the Comptroller of the Currency of the Department of the Treasury Relating to the Review of Applications Under the Bank Merger Act; Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Review of Final Rule Reclassification of Major Sources As Area Sources Under Section 112 of the Clean Air Act''; and Waiving A Requirement of Clause 6(A) of Rule Xiii with Respect to Consideration of Certain Resolutions Reported From the Committee on Rules", "date": "2025-05-20"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "Speaker, if we defeat the previous question on this rule, my  Democratic colleagues and I will offer my bill, the Women's Health  Protection Act, or WHPA.", "title": "Providing for Consideration of H.R. Supporting Pregnant and Parenting Women and Families Act; Providing for Consideration of H.R. Pregnant Students' Rights Act; and Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to Public Land Order No. 7917 for Withdrawal of Federal Lands; Cook, Lake, and Saint Louis Counties, Mn", "date": "2026-01-21"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Speaker, if we defeat the previous question, I am going to offer  an amendment to the rule to bring up H.R.", "title": "Providing for Consideration of H.R. Prohibiting Voting By Noncitizens in District of Columbia Elections; Providing for Consideration of H.R. District of Columbia Federal Immigration Compliance Act of Providing for Consideration of H.R. Protecting Our Nation's Capital Emergency Act; and Providing for Consideration of S. Halt All Lethal Trafficking of Fentanyl Act", "date": "2025-06-10"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Speaker, if we defeat the previous question, I will offer an  amendment to the rule to bring up H.R.", "title": "Providing for Consideration of H.R. Supporting Pregnant and Parenting Women and Families Act; Providing for Consideration of H.R. Pregnant Students' Rights Act; and Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to Public Land Order No. 7917 for Withdrawal of Federal Lands; Cook, Lake, and Saint Louis Counties, Mn", "date": "2026-01-21"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Speaker, if we defeat the previous question, I will offer an  amendment to the rule to provide the consolidation of H.R.", "title": "Providing for Consideration of H.R. Student Compensation and Opportunity Through Rights and Endorsements Act; Providing for Consideration of H.R. Combating the Lies of Authoritarians in School Systems Act; Providing for Consideration of H.R. Transparency in Reporting of Adversarial Contributions to Education Act; Providing for Consideration of H.R. Promoting Responsible Oversight to Eliminate Communist Teachings for Our Kids Act; Providing for Consideration of H.R. Small Business Regulatory Reduction Act of Providing for Consideration of H.R. Destroying Unnecessary, Misaligned, and Prohibitive Red Tape Act", "date": "2025-12-02"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "If we defeat the previous question, we will offer an amendment to the  rule that allows the House to simply consider my amendment concerning  the FBI headquarters.", "title": "Providing for Consideration of H.R. Financial Services and General Government and National Security, Department of State, and Related Programs Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Lauren Underwood", "party": "Democrat", "sentence": "If we defeat the previous question, we  can vote on that extension today, but if Republicans let these tax  credits expire, premiums will soar.", "title": "Providing for Consideration of H.R. Promoting Efficient Review for Modern Infrastructure Today Act; Providing for Consideration of H.R. Increasing Investor Opportunities Act; Providing for Consideration of H.R. Electric Supply Chain Act; Providing for Consideration of H.R. State Planning for Reliability and Affordability Act; Providing for Consideration of H.R. Improving Interagency Coordination for Pipeline Reviews Act; Providing for Consideration of S. Disinterment of Remains of Fernando V. Cota From Fort Sam Houston National Cemetery; and for Other Purposes", "date": "2025-12-10"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Speaker, I urge that we defeat the previous question, and I will  offer an amendment to the rule to immediately bring up to the House  floor H.R.", "title": "Relating to Consideration of the Senate Amendment to H.R. Rescissions Act of 2025", "date": "2025-07-17"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "Speaker, I urge my colleagues to vote to defeat the previous  question.", "title": "Providing for Consideration of Senate Amendment to H. Con. Res. Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Speaker, I am going to urge that we defeat the previous question.", "title": "Providing for Consideration of S. Veterans Accessibility Advisory Committee Act of Providing for Consideration of H.R. Law- Enforcement Innovate to De-Escalate Act; Providing for Consideration of H.R. Undersea Cable Protection Act of and Providing for Consideration of H.R. Securing America's Critical Minerals Supply Act", "date": "2026-02-11"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Speaker, if we defeat the previous question, I will offer an  amendment to the rule to make in order amendment No.", "title": "Providing for Consideration of Senate Amendments to H.R. Consolidated Appropriations Act, Providing for Consideration of H.J. Res. Disapproving the Action of the District of Columbia Council in Approving the D.C. Income and Franchise Tax Conformity and Revision Temporary Amendment Act of and Providing for Consideration of H.R. Critical Mineral Dominance Act", "date": "2026-02-03"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Speaker, if we defeat the previous question, I will offer an  amendment to the rule to provide for consideration of H.R.", "title": "Providing for Consideration of H.R. Lower Health Care Premiums for All Americans Act; Providing for Consideration of H.R. Do No Harm in Medicaid Act; Providing for Consideration of H.R. Protect Children's Innocence Act; and Relating to Consideration of H.R. Standardizing Permitting and Expediting Economic Development Act", "date": "2025-12-17"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "If we defeat the  previous question, I will offer an amendment to the rule to provide for  consideration of H.R.", "title": "Providing for Consideration of H.R. Energy and Water Development and Related Agencies Appropriations Act, Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Miles City Field Office Record of Decision and Approved Resource Management Plan Amendment''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``North Dakota Field Office Record of Decision and Approved Resource Management Plan''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Central Yukon Record of Decision and Approved Resource Management Plan''; and for Other Purposes", "date": null}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Speaker, if we defeat the previous question, I will offer an  amendment to the rule to bring up H.R.", "title": "Providing for Consideration of H.R. Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, Providing for Consideration of H.R. Special Interest Alien Reporting Act of Providing for Consideration of H.R. Jeremy and Angel Seay and Sergeant Brandon Mendoza Protect Our Communities From Duis Act of and Providing for Consideration of H. Res. Condemning the Violent June 2025 Riots in Los Angeles, California", "date": "2025-06-24"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "Speaker, if we defeat the previous question,  I will offer an amendment to the rule to bring up H.R.", "title": "Providing for Consideration of H.R. Protecting Prudent Investment of Retirement Savings Act; Providing for Consideration of H.R. Flexibility for Workers Education Act; Providing for Consideration of H.R. Empowering Employer Child and Elder Care Solutions Act; Providing for Consideration of H.R. Tipped Employee Protection Act; and Providing for Consideration of H.R. Save Local Business Act", "date": "2026-01-13"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "Speaker, if we defeat the previous question, I will offer an  amendment to the rule to bring up H.", "title": "Providing for Consideration of H.R. Improving Law Enforcement Officer Safety and Wellness Through Data Act; Providing for Consideration of H.R. Leosa Reform Act; and Providing for Consideration of H.R. Federal Law Enforcement Officer Service Weapon Purchase Act of 2025", "date": "2025-05-14"}]