[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…which has received at least tens of thousands of views,  includes names, photos, disparaging remarks, and demands for  accountability.\n\nIn January, another pardoned January 6 defendant who pleaded guilty  to assaulting police officers with pepper spray, Ryan Nichols, Sr.,  identified in a Twitter post ``officers in the D.C. Jail who need to be  investigated…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688828/january-6-pardons"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Court, in Batson  v. Kentucky, which was a juror discrimination case based on race, said,  ``The harm from discriminatory jury selection extends beyond that  inflicted on the defendant and the excluded juror to touch the entire  community. Selection procedures that purposefully exclude black persons  from juries undermine public confidence in the fairness…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692690/introduction-of-the-district-of-columbia-local-juror-non-discrimination-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…court in a case before it between 2019 and 2021 in  the Nejad case that criticized Mr. Bove for offering little in the way  of supervision when material was denied to the defendant and the case  had to be dismissed. The extent and scope of that investigation has  never been disclosed. That is just one example of material that we have  a right to see…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…financial  conditions for pretrial release, but both laws permit each. Under both  D.C. and Federal law, pretrial release and detention are based on a  judge's assessment of a defendant's risk of not appearing in court and  danger to the community. In contrast, 18 States, the majority of which  are red States, have a constitutional right to bail, meaning,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696979/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…legal proceedings can be long and drawn out. To  put it bluntly, punishment, not justice, is the goal of the military  courts. The system is stacked unfairly against the child defendant,  whose family is not even allowed to be present during court hearings,  so irrespective of the facts or the reliability of the confession,  pleading guilty in return for…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697313/palestine"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Government Surveillance  Subcommittee for her efforts in always making sure that we put crime  victims first. When we have a crime and there is a prosecution, it is  State v. defendant or people v. defendant, but what is left out of that  is the victim, and she always makes sure that we keep the victims very  much in our sights, in our minds, and in our…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698843/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…dismiss, without prejudice and under  false pretenses, the bribery and fraud charges against New York City  Mayor Eric Adams in an unethical quid pro quo exchange for the  defendant's cooperation with the administration's political priorities,  thus abusing the criminal laws to unconstitutionally commandeer a State  officer and unit of government in…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…foreign commerce, a threat to       distribute--\n\n``(A) a visual depiction of a minor engaging in sexually       explicit conduct, or\n\n``(B) a visual depiction of a person the defendant believes       is a minor engaging in sexually explicit conduct,      with the intent that the minor, or the person the defendant       believes is a minor, create or transmit…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698861/combating-online-predators-act"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…many unlawful aliens, criminals, or  terrorists who have been deported under a law that has been on the  books for more than 225 years, the judge has a right to rule if that  defendant has a legitimate nexus in their court, has a right to rule as  to that plaintiff or any others that come before him that have nexus,  but to rule that the President must…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…violation of subsection (a), no attorney general of a State       may, during the pendency of that action, institute an action       under subparagraph (A) against any defendant named in the       complaint in that action for a violation of subsection (a)       alleged in such complaint.\n\n(E) Venue; service of process.--\n\n(i) Venue.--Any action brought…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690200/hotel-fees-transparency-act-of-2025"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…child sexual abuse material  because the minor--a sleeping, clothed child--was merely present in the  video, not touched, actively involved, or engaged.\n\nIn that case, the defendant filmed himself in sexual conduct near his  9-year-old niece. The court ruled that he did not use her under  existing statute because she was passive. That interpretation…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698897/child-predators-accountability-act"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…given the term in section 103 of the Trafficking Victims       Protection Act of 2000 (22 U.S.C. 7102).\n\n``(b) Duress.--In a prosecution for a covered Federal       offense, a defendant may establish duress by demonstrating       that the defendant was a victim of trafficking at the time at       which the defendant committed the offense.\n\n``(c) Record or…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…constitutional crisis then. In fact, those acts were  celebrated by both sides, and they were upheld by Federal courts.\n\nThe bottom line is that Nicolas Maduro is a criminal defendant  charged by the United States Department of Justice for narcoterrorism  and drug-trafficking offenses, including conspiring to import cocaine  into the United States and…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699365/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…promulgated under       this section, no attorney general of a State may bring an       action under subparagraph (A) during the pendency of that       action against any defendant named in the complaint of the       Commission for any violation of this section or a regulation       promulgated under this section alleged in the complaint.\n\n(D) Rule…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692730/romance-scam-prevention-act"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…before the President takes action. That framework  has governed American foreign policy for more than 50 years.\n\nMaduro is not a legitimate head of state. He is a criminal defendant  under United States law who was charged and indicted in 2020 by the  Department of Justice for drug trafficking and other related crimes.\n\nThere is legal precedent directly…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698883/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…beginning June 1 of the preceding year and ending June 1 of       the current year, which shall identify--\n\n``(A) with respect to each such civil action--\n\n``(i) the defendant lead agency, where applicable, and each       plaintiff; and\n\n``(ii) the court in which the civil action was brought and       any court to which a decision on the civil…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697711/studying-nepas-impact-on-projects-act"}]