[{"senator": "Al Green", "party": "Democrat", "sentence": "If it turns out it is a leftwing person, as defined by people, that  is wrong."}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "The birth of every baby should be a joyful transition defined by  compassion and whatever healthcare is required for the baby and the  mother."}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "Instead of being defined by the discrimination and the doubts of  those around them, they became one of the most successful pursuit  squadrons in our military."}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "It is a matter of finding  cures and drugs that will help people all around the world and that has  defined America for decades."}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Congresswoman Oakar's career was defined by trailblazing leadership,  moral clarity, and a fierce devotion to those who too often lived in  the margins of public policy."}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "2096 would reinstitute, 17 (46 percent) were terminated for       police misconduct defined as `threat to safety' which meant       these officers engaged in conduct that included a risk of       harm to persons through action or inaction, such as physical       and sexual violence, mishandling firearms, or compromising       evidence related to an arrest."}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "Yet, what defined him was his unshakable belief  in the potential of his hometown, a city that helped build America and  the city that he never stopped believing in."}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "Thomas' service is not only defined by awards and titles, but by  the lasting impact of his work."}, {"senator": "Diana DeGette", "party": "Democrat", "sentence": "Jerry's career was defined by an unwavering commitment to defending  the rights of all Coloradoans, no matter their circumstance or  situation."}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "It is defined by its clean  water, including the Puget Sound and hundreds of lakes and thousands of  miles of rivers and streams throughout Washington."}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "Particulate matter, defined as follows:\n\nOne type of particulate matter is the soot seen in vehicle       exhaust."}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "During this time of deep division and heightened partisanship, this  anniversary reminds us of our shared responsibility to uphold the  values of liberty and equality that have defined this Nation for two- and-a-half centuries."}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "Her leadership has been defined by a deep commitment to social  justice, equity, and collaboration."}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "At the same time, I will point out that our definition of  ``accredited investor'' was, I think, wrongfully decided that we should  just focus on whoever is rich, then defined people as rich based on  1983 numbers."}, {"senator": "August Pfluger", "party": "Republican", "sentence": "Together, this congregation embodies the  resilience, stability, and continuity that have defined St."}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "It includes a notice requirement for defined contribution plans that  explains the difference between selecting investments chosen by ERISA  fiduciaries and selecting investments through a brokerage window."}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "It applies only to  allow for disapproval of Federal Agency rules and only during a  prescribed time defined by the statute."}, {"senator": "Jason Smith", "party": "Republican", "sentence": "The very  least we can do is ensure that an entity that exists to fight on behalf  of taxpayers actually has a clearly defined and reinforced independence  from the IRS."}, {"senator": "James Risch", "party": "Republican", "sentence": "President, section 36(b) of the Arms Export Control  Act requires that Congress receive prior notification of certain  proposed arms sales as defined by that statute."}, {"senator": "Bob Latta", "party": "Republican", "sentence": "(c) Commission Defined.--In this section, the term       ``Commission'' means the Federal Communications Commission."}, {"senator": "James Risch", "party": "Republican", "sentence": "President, section 36(b) of the Arms Export Control  Act requires that Congress receive prior notification of certain  proposed arms sales as defined by that statute."}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "(2) The term ``covered contractor'' means a contractor (as       defined in section 7101 of title 41, United States Code)--\n\n(A) whose contract is in an amount the same as or greater       than the simplified acquisition threshold; or\n\n(B) that uses, operates, manages, or maintains a Federal       information system (as defined by section 11331 of title 40,       United Stated Code) on behalf of an agency."}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "1703)       is amended--\n\n(1) by striking ``the Congress'' each place it appears and       inserting ``the appropriate congressional committees''; and\n\n(2) by adding at the end the following:\n\n``(e) Appropriate Congressional Committees Defined.--In       this section, the term `appropriate congressional committees'       has the meaning given that term in section 203(d)(2).''."}, {"senator": "Roger Williams", "party": "Republican", "sentence": "``(d) Limited or Special Purpose Property Defined.--In this       section, the term `limited or special purpose property' has       the meaning given by the Administrator in the guidance titled       `Lender and Development Company Loan Programs' (SOP 50 10 8;       as in effect on June 1, 2025).''."}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "The Katergaris family has created an environment defined by quality,  by consistency, and by genuine hospitality."}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "(6) A description of efforts taken to promote United States       leadership at international standards-setting bodies for       equipment, systems, software, and virtually defined networks       relevant to undersea cables, taking into account the       different processes followed by such bodies."}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "His career was defined not only by his technical skills and unmatched  piloting abilities but also by his leadership."}, {"senator": "Roger Williams", "party": "Republican", "sentence": "``(f) Artificial Intelligence Defined.--In this section,       the term `artificial intelligence' has the meaning given such       term in section 5002 of the William M."}]