[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…also  be agreed to, with all the other provisions that my colleague is asking  for remaining intact, so that we can fund all of police and stop our  President's attempt to defund police departments in blue States.\n\nMr. BOOKER. Yeah, I just--again, I have so much respect for my  colleague that I want to respond to some of the things he said,  because, again,…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "Mr. CASTEN. Mr. Speaker, this week, we will vote on bills to defund  the police, sow the seeds for our next financial crisis, and remove any  remaining fig leaf that we might hide behind when we insist that  Congress is a coequal branch of government.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693618/crypto-used-by-criminals-and-corrupt-politicians"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…global capitalism. Why don't we just let big  balls take a whack at it? What could go wrong?\n\nWhether it is crime in the streets or crime in the suites, we should  not defund the police. We don't defund the men and women in blue, and  we don't defund the Securities and Exchange Commission that oversees  the stock and bond markets.\n\nThe SEC has a budget…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…don't know what  Denver, Colorado, or Burlington, Vermont, did. I know what the United  States Congress does, and we never defunded the police, and we never  tried to defund the police.\n\nOn the other hand, my good friend, I believe, participated in--and if  he didn't, I am happy to stand corrected, but I know a bunch of his  colleagues said they wanted…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…is responsible for serving all 87 counties  throughout Minnesota. For years, Minneapolis has passed several  sanctuary city policies while at one point attempting to defund its own  police department, further jeopardizing public safety.\n\nMy legislation, the Save SBA from Sanctuary Cities Act of 2025, would  require the Small Business Administration to…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691945/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…911 calls, leaving violent crimes skyrocketing in the city of Austin,  because my colleagues on the other side of the aisle were patently  clear about their desire to defund the police and  side with violent mobs in the summer of 2020, when our cities were  burning across the country.\n\nYes, we are standing up for the men and women in blue. Yes, we will…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…know it  is a good bill. In fact, one of the cosponsors won't even come and talk  about it because his majority, Mr. Speaker, doesn't want it. This is  the extension of defund the police. I have had it.\n\nWe need to protect law enforcement. We are the ones who call them  when we are in harm. They come to the fight. They will be there when we  call 911.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700031/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Mr. CRANK. Mr. Speaker, my colleagues on the other side of the aisle  have a choice to make.\n\nThey thought it was cute to defund the police. That didn't work out  for  cities like Portland, Seattle, and St. Louis.\n\nThen they thought it was cute to ignore our border. They allowed  millions to storm America.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692194/los-angeles-protests"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…censorship, of weakness  and wokeness. They even brag about it, as we saw last night in New  York.\n\nYesterday, in New York City, they elected as mayor a socialist who  wants to defund the police, abolish prisons, and give illegal  immigrants free healthcare. That is who the Democrats have chosen as  the mayor of New York City. That is the Democrats' vision of…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…local law  enforcement, Democrats defund them. Five years ago this summer, they  spent the whole summer doing that. That is all you would hear from  Democrats, got to defund the local police. We have been consistent. We  have condemned violence every single time it happened whether it was  January 6 or the summer of 2020. They haven't.\n\nThe summer of 2020,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691031/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…and Wellness Through Data Act, would  require the Attorney General to develop a series of reports related to  violent attacks on law enforcement officers.\n\nThe left's defund the police movement continues to have ripple  effects throughout the country, as violent crime remains high and  criminals have become more brazen in their attacks against police…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}]