[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…are not eligible  for these grant programs. That is not a bipartisan way of going about  it. That is singling out certain States over other States. That is  actually defunding the police departments in certain States for other  States when you say that these States that have gotten many of these  grants in years past can no longer get them. None of us…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…gotcha resolution  and a resolution that actually attempts to unify people around common  values.\n\nMr. RASKIN.\n\nMr. Speaker, my colleague from California talks about defunding the  police. He might want to update his talking points because look who is  defunding the police. President Trump and the  Republicans are defunding the police, and we know that…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…about: lowering food and healthcare  prices, cutting childcare costs, and lowering utility bills.\n\nWhat do socialists stand for? Tax-raising, job-killing policies like  defunding the police, shuttering prisons, massive unfunded spending  increases, and even government-run grocery stores.\n\nIn New York, job-killing comptroller, socialist, and reckless spender…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697158/denouncing-the-horrors-of-socialism"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…is in his second term, not in  his first term. He is a valuable member of our committee.\n\nMr. Speaker, the last gentleman to speak said he never wanted to hear  about defunding the police again, and I agree with him completely.\n\nThe problem is, he is about to hear about it because DOGE is  defunding the police as we speak and, unfortunately, with your…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…prevention programs all over the  country in our communities.\n\nWhat did we hear from our colleagues across the aisle?\n\nDid they stand up to DOGE and object to this defunding of the police?\n\nNo, Mr. Speaker. Our colleagues said absolutely nothing, and I mean  that literally.\n\nDuring the Judiciary Committee markup of the reconciliation bill,  Democrats…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…who were wounded, injured, hospitalized, some of them  permanently disfigured and maimed on that day as well as officers  around the country.\n\nNow, on the point about defunding the police. Look who is defunding  the police: Elon Musk, Donald Trump, and their silent partners in  Congress are defunding the police. They just terminated $500 million  worth…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…us to support  axing Medicaid by $180 billion, even though food stamps reduce rural  poverty. Republicans will cut this program too by $230 billion.\n\nRepublicans are defunding the police by stripping funding from the  Consumer Financial Protection Bureau, and the CFPB is the only Federal  cop on the block to hold Wall Street banks and Big Tech payment…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688020/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…it crystal clear: I back the blue not just during  Police Week, but year round.\n\nI like to say to them when I see them: Thank you for your service,  and I am not for defunding the police.\n\nTo our law enforcement officers nationwide: Thank you for your  sacrifice, your service, and your dedication.", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690982/national-police-week"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…resolution simply condemns acts of violence. We are opposed  to sanctuary policies. We are opposed to putting a target on the back  of our Federal officers, and, frankly, to defunding the police.\n\nIt is not our fault that those who have allowed this violence, who  have promoted sanctuary policies, who have put a target on the back of  our officers, and who have…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…with a straight face that  that is what they want to do when we had one Democrat from New York who  said: I am not in favor of more police; I am actually in favor of  defunding the police. We had another Congresswoman from New York who  said: Defunding police means defunding police. I can go back, and the  Record is replete with examples of my colleagues…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…watched this unfold for years now. The press has smeared and  defamed our police officers, seeking to incite hatred and violence  against them. Fringe academic ideas about defunding police and  shuttering prisons have moved from the classroom, to the courtroom, to  the legislature, and then to codified laws. Riots. Lawsuits. Slashed  budgets. Malicious lies…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696003/unanimous-consent-requests"}]