[{"senator": "Al Green", "party": "Democrat", "sentence": "…one set of articles. There are plenty of other things.\n\nMr. Speaker, I already have articles pending against him that I call  the sword of Damocles for what he has done in defying court orders, in  flouting court orders, and not giving due respect to orders of the  court. This is the President of the United States doing it. This is not  just some other…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…exact words. It uses language  that we are all familiar with: ``high crimes,'' ``misdemeanors,''  ``treason,'' or ``bribery.''\n\nYet, we have an authoritarian President who is defying the courts,  who does not respect the separation of powers. We have an authoritarian  President who would demean and minimize the role of the judiciary and  our system of…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "Mr. HUFFMAN. Mr. Chairman, I thank the gentleman for yielding.\n\nIn just 4 weeks, Donald Trump has sown chaos all over this country.  His administration is defying court orders, firing Federal workers,  freezing vital funding that our constituents depend on, impacting  everything from wildfire preparations to water security, health and…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688067/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…administration has the power to issue 100 percent of  benefits to working families and kids who rely on this program, but the  President and the Department of Agriculture are defying court orders  and refusing to flip the switch on these emergency funds for  circumstances just like this.\n\nIn one moment, the Department of Agriculture says they will send…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…describes sanctuary policies as ``killing  this country.'' I have heard that a few times. And that by enacting  sanctuary policies, leaders in these States are somehow ``openly  defying federal law.''\n\nAgain, wrong. You can have your own opinion, but you can't own the  facts. Far from defying Federal law, courts have actually upheld  sanctuary laws and policies.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…will also cause chaos in the D.C. tax filing season,  which has already begun. Trump's Department of Homeland Security is  doing horrific things across the country. The DOJ is defying the law to  withhold the Epstein files. We are dealing with a cost-of-living crisis  across the country. Instead, today, we are debating to vote to actually  increase child…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699683/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…is  questionable.\n\nThe U.S. Supreme Court, in the case of one of these individuals who  it admits was deported by mistake--and there are many others similarly  situated--is defying an order of the Supreme Court. The U.S. Supreme  Court ruled in a nine-to-nothing ruling that the administration should  facilitate the return of Mr. Kilmar Abrego Garcia.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691406/motion-to-discharge-s-res-195"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…This isn't just morally wrong. It is a violation of the law. Congress  appropriated these funds. This administration is not only defunding  vital community programs. It is defying the will of the American  people.\n\nWith just $1.93 million per year, Delaware libraries are able to  preserve our history, strengthen our workforce, and meet people where…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690588/cutting-lifeline-of-institute-of-museum-and-library-services"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Mr. Speaker, I remind my colleagues that, in this country, under our  Constitution, no one is above the law, not even the President. Our  President, at this very moment, is defying a 9-0 Supreme Court  decision.\n\nTokuda), my  colleague from the Aloha State.\n\nMr. TAKANO. Mr. Speaker, I thank Representative Tokuda for her  comments.\n\nChu), my  fellow colleague…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…them up, indefinite amount of  time.\n\nThere has to be some sense of reality associated with what we do, and  I want to talk about that sense of reality.\n\nThis President is defying court orders, including orders from the  Supreme Court of the United States of America. He is defiant. You heard  him say now in two venues--I am going to speak about them…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…of our  conservative colleagues from Nebraska admitted he did not know the bill  makes it harder for the courts to hold the Trump administration  officials in contempt for defying a court order. Get this: He claims he  would have voted against the bill had he known it was in the bill. I  can't make this stuff up.\n\nAnother conservative Republican colleague…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…like  to hear. Free speech is free speech.\n\nWe will not stand by while they violate the principles that form the  bedrock of our democracy. Right now, this administration is defying a  Supreme Court decision that ordered them to facilitate the return of an  individual who was deported without due process. Alongside others, he  was sent to an inhumane…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690503/trump-immigration-policies"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…Chicago's first Black  mayor and for Barack Obama, Americas first Black President-- achievements she believed she would never witness in her lifetime, but  indeed she did. Defying age, at 94 years old, Mrs. Pough wrote and  recorded her debut song entitled ``Jesus Reigns Forever,'' earning  national spotlight on NBC, CBS and Fox News in 2020.\n\nTill…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699343/recognizing-mrs-essie-pough"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…smashing  windows to arrest old men, separating families in the middle of the  night, and zip tying children.\n\nThey are using immigration hearings and check-ins as setups and  defying court orders, and then our neighbors are being shipped off to  countries where they have never even been. They are being held in  detention centers with unspeakable, inhumane…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697454/fighting-dhs-immigration-raids"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…guarantees due process and equal protection under  the law to everyone in this country, not just citizens. If the  government can silence you, detain you, or deport you while defying  court orders, then none of our rights are safe. If we let this slide,  we are saying the Constitution is optional. It is not.\n\nWhat we are seeing is authoritarianism creeping…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690505/trump-immigration-policies"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…these  votes should be simple and easy.\n\nWith that, I would ask to move forward.\n\nMr. SCHMITT.  It is attempting to  throw a lifeline to these sanctuary cities that are openly defying the  law. In order to receive Federal grant dollars, you can't withhold  information from Federal law enforcement. That is what they are doing.  That is what it means to be…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696003/unanimous-consent-requests"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Control that I chaired late last year, one of our witnesses described  Venezuela as playing a very important role in what they called the  ``axis of evasion,'' a global sanctions-defying network that also  includes Russia, China, Iran, and North Korea.\n\nAnd, of course, Maduro was an important part of that within this  ``axis of evasion'' because he is the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…up.\n\nHer statue now fittingly stands in Emancipation Hall and represents  Utah.\n\nLet's also be reminded of women like Sally Ride who in 1983 became  the first woman in space, defying conventional expectations set for  women while creating opportunities for women to enter STEM fields.\n\nLet us also be reminded of women like Clara Barton who founded the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689363/womens-history-month"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…communities are  facing.\n\nMr. Speaker, my constituents are watching, and your constituents are  watching, to see whether Congress means what it says. This vote is not  about defying a President. It is about defending Congress. It is about  strengthening this institution and standing for the people who trust us  to fight for them.\n\nFor those of us who…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698701/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}]