[{"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…of the day, in this facility we have 32 men being crammed  in each cage, about 4 to 6 cages in each tent. We brought a thermometer  in there and each tent was about 84, 85 degrees, of course, in the hot  Florida sun.\n\nI will always remember walking in that front door and looking at  these gentlemen in there, everyone screaming for help, one guy asking…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693654/internment-camp-in-the-florida-everglades"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Owens-Barber previously led a distinguished career in law  enforcement, higher education, youth development and social justice  leadership.\n\nRev. Dr. Owens-Barber earned advanced degrees in Criminal Justice and  Theological Studies and a Doctor of Ministry. She continues to lead  community service through the North Carolina Council of Churches where  she serves…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697322/recognizing-the-dedicated-public-service-of-reverend-dr-della-j-owens-barber"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…testament to       resilience, perseverance, and dedication, overcoming       adversity as a high school dropout by pursuing higher       education and earning three doctoral degrees from Regent       University, Logos University, and Boston University Graduate       School of Theology, along with four master's degrees, as well       as several executive…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692044/certificate-of-congressional-recognition-proclamation-presented-to-apostle-dr-dana-carson-in-honor-of-40-years-of-ministry"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Naval Research Laboratory.\n\nA Marylander to her bones, Maryam prepared for this remarkable career  at the Free State's world class colleges and universities. She's earned  degrees at the University of Maryland-College Park, Hood College, and  the University of Baltimore School of Law. On behalf of a grateful  Nation and the residents of Maryland's beautiful…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695862/congratulating-ms-maryam-azarion-on-her-retirement-after-more-than-25-years-of-federal-service"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…(2022-present).\n\nFor six decades, the School of Social Work has advanced the  University of Georgia's teaching, research, and service mission. It has  conferred more than 9,000 degrees in social work and nonprofit  management and leadership while strengthening the University of  Georgia's academic excellence by preparing culturally responsive  practitioners…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688815/recognizing-the-60th-anniversary-of-the-university-of-georgia-school-of-social-work"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…country and the democratic process. He  was always both an ardent participant and learned scholar of democracy.  He floated in books. Steve was a lifelong student, earning degrees in  literature, history, business administration, and law. He never stopped  learning.\n\nHe loved baseball. Do not get in his way when there is a baseball  around and basketball,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Ms. McCOLLUM. Mr. Chair, Minnesotans are feeling the heat, literally.  The Twin Cities have experienced 10 days over 90 degrees this summer,  and wildfire smoke has resulted in 18 air quality alerts, nearing the  record of 22 days in 2023. This is not a fluke. It's a sign of a  worsening climate crisis…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695056/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…in 2017 as  part of the Forever GI Bill. However, since creation, we have learned  of cases where improvements to the program would encourage more  veterans to pursue dual degrees, degrees in STEM education, and degrees  in healthcare.\n\nRepresentative Budzinski's legislation would improve the program to  better fit student veteran needs by making two…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695428/edith-nourse-rogers-stem-scholarship-opportunity-act"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…moved to Raleigh as a high  school transfer student in 1978 as the Iranian Revolution was unfolding  in her home country, graduating from North Carolina State University  with degrees in Civil & Agricultural Engineering. Sepi embraced  opportunity, leaving a position at the North Carolina Department of  Transportation in 2001 to found SEPI Engineering and…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689506/recognizing-the-life-and-legacy-of-sepi-saidi"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…Demetrios Arhondonis in 1940, His All-Holiness Bartholomew  completed his undergraduate studies at the historic Theological School  of Halki. He would also pursue graduate degrees in Italy, Switzerland,  Germany, and Greece. Before being ordained to the Diaconate in 1961 and  to the Priesthood in 1969, he was a founding member of the Society of  Canon…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695391/welcoming-the-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…own. They are trying to say: Hey, wait a minute. We  want to work.\n\nThey work hard. The gentleman from Pennsylvania should sit in front  of a glass furnace 8 hours a day in 90 degrees blowing in his face.  That won't happen to people from Harrisburg, largely because they are  more of a middle-class community. They are a State capital. However,  where I…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694952/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "Mr. WHITEHOUSE. Mr. President, the world is undeniably round; water  undeniably freezes at 32 degrees Fahrenheit; and equally undeniably,  the climate is changing, and the changes in the climate are human- caused by fossil fuel emissions. Fossil fuel emissions are the primary…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…to face energy shortages.\n\nThe reason, for instance, Texas, of all places, has not had blackouts  and brownouts is because solar can absorb wind; the Sun is high. It is  108 degrees, and everybody is pumping their air-conditioners. That also  happens to be the point in time and the point of the day when all of  the solar farms are running at full capacity,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…have a number of the original Rosies living in my area. They  have inspired me. They tell me their stories. On a cold Veterans Day  this year, when the wind chill was zero degrees, I stood outside with  those strong, resilient women with every ounce of their intellect  there, sharing the stories of what it meant to be a Rosie.\n\nThis bill will take us…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697725/world-war-ii-womens-memorial-location-act"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…Meritorious Service Medal, the Air Medal, and the Aerial Achievement  Medal. His professional achievements are matched by his academic  accomplishments, having earned advanced degrees in Military Operational  Art and Science as well as National Resource Strategy.\n\nOn September 30, 2025, Colonel Halasi-Kun completed his final flight  in the F-15C Eagle,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698681/recognizing-colonel-david-moon-halasi-kun"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…is a large college town, Mary Beth informed me that 95  percent of her staff are college students, young people simply looking  to earn pocket money while they pursue their degrees.\n\nOn average, Americans could receive up to $1,300 more from no taxes  on their tipped income. Imagine what this means to Mary Beth's  employees. We also discussed no tax…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694787/promises-made-promises-kept"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the gift of persuasion through moral  authority: the principled use of natural virtues unique to them for the  benefit of others. Positional authority: titles, credentials, degrees  give only the opportunity to lead but it is the actions in behalf of  others that can command, inspire and motivate change and moral behavior  in others. A servant leader…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Patrick Harrigan", "party": "Republican", "sentence": "…Freedom and Operation Enduring  Freedom, earning the Bronze Star Medal and Combat Action Badge. A  graduate of the United States Army Sergeants Major Academy with  advanced degrees, he exemplifies unwavering commitment to excellence.  As a legislative liaison, he has expertly bridged the National Guard  and Congress, leveraging his military construction…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693703/recognizing-sergeant-major-harold-m-watts-iii-service-to-the-national-guard-bureau"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…General Farm Dairy, Poultry and Heavy Equipment.\n\nIn 1973, the school's name was changed to the Alabama Technical  College and began offering associate in applied technology degrees. In  1985, the Alabama Technical College merged with Gadsden State Community  College and is now known as the East Broad Campus. It is home to many  of Gadsden State's workforce…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696575/recognizing-the-100th-anniversary-of-gadsden-state-community-college"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…a 3-star chapter, which is the highest ranking an  FFA chapter can receive. Three of their students--Vita Failla, Molly  Gehr, and Carly Railing--also received American FFA Degrees, the  highest honor bestowed to FFA members.\n\nThe Manor FFA excelled during the 98th National FFA Convention &  Expo, which was held from October 24, 2025 to November 1, 2025,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697257/congratulating-the-manor-future-farmers-of-america"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…about 124,000 job openings for accountants  and auditors are projected each year, on average, over the next decade.  At the same time, fewer students are pursuing accounting degrees than  in prior years.\n\nThe Accounting STEM Pursuit Act seeks to improve the accounting  pipeline by expanding K through 12 students' exposure to accounting  programs. As with…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699755/9999"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…VR&E to work well, there must be transparency to  veterans who are using the program.\n\nFinally, this bill would also allow veterans in the VR&E program to  pursue noncollege degrees, like flight training.\n\nMr. Speaker, this bill is a step in the right direction of putting  veterans first at the VA. I thank my friend and colleague,  Representative Van…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699486/veterans-readiness-and-employment-improvement-act-of-2025"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…possible to deliver by backing up all of the  renewables that are on the system.\n\nMr. Speaker, overnight lows this weekend in my State of North Dakota  are forecasted to be 20 degrees below zero. Having heat provided by  natural gas is literally the difference between comfort and chaos, and,  yes, between life and death in States like mine.\n\nIf we want…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698057/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…involvement with the Kern County Cattlewomen, Ms.  Woody began a distinguished career in education. She taught both junior  high and high school English before earning two master's degrees in  Pupil Personnel Services and Marriage, Family, and Child Counseling.  For the final sixteen years of her career, she served as a counselor at  Centennial High School in…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696714/recognizing-april-woody"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…the team--Antonio Franco, Will Gajecki, Rex Giberson,  and Jack Ross--earned silver for their individual performance.\n\nFive Garden Spot FFA alumni also received American FFA Degrees in  2025, the highest honor bestowed to FFA members, and were recognized at  the convention. These individuals were Gracie Albright, Sydney  Albright, Kayla Frey, Jaclyn Martin,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698930/congratulating-the-garden-spot-future-farmers-of-america"}, {"senator": "French Hill", "party": "Republican", "sentence": "…forced  to drop out of school in the eighth grade to take care of her disabled  brother.\n\nDespite this, Mr. Speaker, she earned her associate of science and  associate of arts degrees at the University of Arkansas Community  College at Morrilton in 2014 at age 33. She continued her education,  earning seven more degrees after leaving UACCM, balancing her…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699816/congratulating-robert-arrington"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…got to stop this. We need the legislature to step up and do  it. I plead with people everywhere I can, don't be fearful of all  digital assets. For example, bitcoin is 180 degrees different than  central bank digital currency.\n\nMr. Speaker, do everything you can to stop the government's power  grab with this, or the superficial layer that is really…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…investment decisions.\n\nH.R. 3394 modernizes that definition. It directs the SEC to expand  eligibility to individuals who hold certain professional  certifications, relevant degrees, or job experience, criteria that  actually reflect financial sophistication.\n\nThis change is long overdue. It will unlock capital for small  businesses, broaden investor…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692776/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…that she grew up, raised a family, and built a life  of meaning and service. She graduated from Woodrow Wilson High School  and went on to become a registered nurse, earning degrees from  Philadelphia University and Gwynedd Mercy University. But while her  education equipped her with knowledge, it was her heart that made her a  healer.\n\nFor 56 years,…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688923/recognizing-diane-reitz-a-light-of-service-a-heart-of-strength-and-a-legacy-of-honor"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Leon Ressler is a frequent  contributor to Lancaster Farming, a churchgoer, a political volunteer,  and is himself a farmer in Peach Bottom, Pennsylvania. He holds  bachelor's degrees in agronomy and plant science, and has a master's  degree in environmental pollution control, all of which are from Penn  State.\n\nAs he transitions his focus from Penn State…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692202/congratulating-leon-ressler-on-his-retirement"}]