[{"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…immigrants. These individuals, she  described, were lonely, poorly paid, and isolated. She took those  experiences and paved a life of activism. After graduating with her  master's degree in social work at the University of California--Los  Angeles (UCLA), Alice returned to Kansas City to work in a legal aid  office where she helped young, first-time offenders…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698825/recognizing-the-life-and-memory-of-alice-kitchen"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…Varney, Madera  County's Chief Administrator, for his service and accomplishments as he  retires after four decades of public service.\n\nMr. Varney earned his Master of Science degree in Criminology from  Fresno State and his Bachelor of Science degree in Resource Development  from Michigan State University.\n\nHe went on to serve with the Dallas Police Department…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694999/recognizing-jay-varneys-retirement"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…advanced packaged  semiconductor manufacturing capability.\n\nFanout wafer level packaging technology is a critical leading-edge  advanced packaging technology, providing a high degree of size, weight,  and power performance improvements over traditional packaging  processes. My amendment will allow the DoD to leverage existing public- private-partnerships…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693817/department-of-defense-appropriations-act-2026"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…studying in the Grandview school system before moving onto  William Jewell College where he graduated with his bachelors in 1967.  To further his studies, obtained a master's degree in business  administration from the University of Missouri-Kansas City. In addition  to his education endeavors, Jim served during the Vietnam War in the  U.S. army as First…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696936/recognizing-the-life-and-memory-of-james-jim-neil-crain"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…federal civil service for more than half a century.\n\nGene joined GAO as an entry-level analyst in 1973 after graduating  from Pennsylvania's Lycoming College with a bachelor's degree in  accounting. He went on to lead GAO's Accounting and Information  Management Division, which focused on financial management, computer  technology, and budget issues. He…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698464/commending-the-honorable-gene-dodaro"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…of section 3(b),       subject to paragraphs (2) and (3) of that section;\n\n(B) has not abandoned the alien's residence in the United       States; and\n\n(C)(i) has acquired a degree from an institution of higher       education or has completed at least 2 years, in good       standing, in a program for a bachelor's degree or higher       degree in the…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…physical tasks. But this Minnesotan, who is now 26, has been able to  thrive because he has Medicaid coverage. He got an education. He got a  job. He graduated with a master's degree in public policy. He is paying  taxes. In his words, Medicaid gave him the affordable health coverage  he needed to manage his rare condition.\n\nFor him and millions more, the…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Juan Vargas", "party": "Democrat", "sentence": "…Mural,'' ``No Border  Wall,'' ``Amor Si Se Puede,'' and ``Amigos Car Club,'' and many others.\n\nHe is the recipient of multiple honors, including a Southwestern  College Honorary Degree, inclusion in the Mexican Heritage Foundation's  100 Portraits: Pioneers, Visionaries and Role Models, and recognition  as a San Diego County Library Living Well Legend.\n\nMr.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694876/recognizing-salvador-barajas"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…made you a suspect. Now I talk to people who have no  reason to be in fear, but they are because they see what is happening  and they see who it is happening to with a great degree of regularity.  And because they see it, they are fearful of what can happen to them  and they are fearful that if they are not careful, they can be picked  up, taken away…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "Ms. CRAIG. Mr. Speaker, I rise today to congratulate Linda Larson on  fulfilling her lifelong dream of completing her college education.  Linda graduated with an Associate's Degree with an emphasis on  political science from Inver Hills Community College. She also  graduated as part of Phi Beta Kappa.\n\nLinda grew up on a small farm near Ruthton, Minnesota.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690447/congratulating-linda-larson-on-her-graduation-from-inver-hills-community-college"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…District and to the  United States House of Representatives.\n\nA native of California, Andrew attended California State University,  Northridge, where he graduated cum laude with a degree in Political  Science and International Relations. His early political work included  opposing Proposition 8 in California and later serving as an organizer  on the Obama for…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698824/recognizing-andrew-heineman-and-his-service-to-the-united-states-house-of-representatives"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Technology Program at Jackson High School prepares students to be high- tech automotive technicians, move into advanced training within the  industry, or earn an associate degree in the automotive technology  field.\n\nJoseph's students have a 95 percent job placement rate within six  months of graduation, with many students employed at local auto shops,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695925/recognizing-joseph-drury-conner-as-ohios-13th-congressional-district-champion-of-the-week"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…in the ministry and began  preaching at the age of 14 in his home state of Tennessee. He began his  education at Freed-Hardeman University, where he received a bachelor's  degree in biblical studies. He also holds a Master of Ministry in  Pastoral Counseling from Rawlings School of Divinity and a Doctorate  from Andersonville Theological Seminary.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695372/recognizing-reverend-dr-perrico-j-robinson-sr"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…public health protection measure. It requires facilities  that emit the worst of the worst hazardous air pollutants to monitor,  report, and cut those emissions to the maximum degree of reduction  achievable, even eliminating them entirely if possible.\n\nThe rule also prevents any backsliding by major sources of the seven  most dangerous hazardous air pollutants,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691591/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…affirming life's spiritual  dimension, whether through insight, discovery, or practical works.''\n\nBorn in current day Gokceada, Turkey, His All-Holiness received his  undergraduate degree at the Theological School of Halki and completed  graduate studies at three universities in Italy, Switzerland, and  Germany. He was elected in October 1991 as the 270th Archbishop…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695648/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…and they were happily married for a remarkable 77 years.  Together, they had three daughters and many more grandchildren and  great-grandchildren. Walter earned his doctorate degree from the  University of Colorado and guided the doctoral research of 65 graduate  students at the University of Missouri. For his excellent teaching  abilities and his students'…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690722/recognizing-congressional-patriot-award-recipient-walter-hunter"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…in this  building.\n\nDonald Trump has done a great job of trying to remove the diversity,  equity, and inclusion from our government, including our military. We  have, to a degree, gotten rid of some of the bureaucrats who pushed  this odious ideology in our businesses and our schools.\n\nNevertheless, these bureaucrats everywhere are waiting to gain a…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…States       citizen.\n\n``(4) Clearance.--The applicant shall be eligible for a       secret clearance.\n\n``(5) Education.--The applicant shall be enrolled in a       college degree program at--\n\n``(A) an institution of higher education described in       section 371(a) of the Higher Education Act of 1965 (20 U.S.C.       1067q(a));\n\n``(B) an institution…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…by slower metabolism, reduced kidney function, and  heightened drug sensitivity.\n\nPharmacists, after six to eight years of rigorous training, including  a Doctor of Pharmacy degree, serve as trusted experts in how  medications work, interact, and affect aging bodies.\n\nThrough services like medication therapy management, they review  entire regimens, including…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699709/retirement-of-judge-ronnie-fender"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…rules. Under suspension of the rules, you have got  to have 290 votes to pass it rather than a simple majority of 218  votes. That feature ends up replicating, to a significant degree, the  effect of the cloture standard over here such that it has got to be  bipartisan. So they can't afford to--and therefore don't on bills like  this--favor Republican bills…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…curing disease such as Hepatitis B and  Liver Cancer.\n\nMr. Kroszner began his career at the United States Naval Academy,  where he graduated in 1977 with a Bachelor of Science degree in  mechanical engineering. He spent the next 10 years of his career as an  engineer with the Naval Air Warfare Center in Trenton where he  supported naval aviation fuel related…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696849/recognizing-mr-konrad-kroszners-16-years-with-the-pennsylvania-biotechnology-center-and-baruch-s-blumberg-institute"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…there currently are impediments for VR&E benefits being  used in vocational flight training. These benefits are intended, as  currently written, to be used in programs that are degree granting. As  we all know, earning a college degree has nothing to do necessarily  with learning how to fly an aircraft.\n\nThis bill will improve that section by granting the…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699488/veterans-readiness-and-employment-improvement-act-of-2025"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…president in Loras college's 185-year history,  Collins has left an indelible mark on Iowa's oldest institution of  higher education.\n\nCollins earned his Bachelor of Science degree in Finance from Loras  College in 1984. After graduation, what began as a brief visit to his  alma mater evolved into a lifelong career of service. Starting as an  admissions…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694164/congratulating-loras-college-president-james-collins-on-his-retirement"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Alexis Casner\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, I rise to recognize Alexis  Casner of McVeytown, Pennsylvania, who was recently awarded the  prestigious American FFA degree by the National Future Farmers of  America.\n\nEvery year, less than 1 percent of all FFA members are presented with  this award, which is the highest level of FFA achievement.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698173/lowering-healthcare-costs-for-all-americans"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Speaker, I rise today to honor Molly Brimmer Lolli  for her service to the House Committee on Energy and Commerce.\n\nA graduate of the University of Maryland for both a bachelor's degree  in Political Science and a Juris Doctorate degree, Molly began her  career on Capitol Hill as a Legislative Assistant for Rep. Andy Harris  (MD-01) in 2019, before becoming…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698336/recognizing-molly-brimmer-lolli"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…a profound legacy in service to the State of New York and  our country.\n\nHis wonderful grandson, Mark Fogelson, also served as an intern in my  office.\n\nAfter earning a law degree from Syracuse University and serving in  the United States Army, Tarky returned to New York, dedicating his life  to public service, including 27 years in the New York State…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693663/recognizing-colonel-john-peyton-swain"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…a churchgoer, a political volunteer,  and is himself a farmer in Peach Bottom, Pennsylvania. He holds  bachelor's degrees in agronomy and plant science, and has a master's  degree in environmental pollution control, all of which are from Penn  State.\n\nAs he transitions his focus from Penn State Extension back to his  farm, I thank Leon Ressler for his…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692202/congratulating-leon-ressler-on-his-retirement"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…dedicated patriot, family man, and valued member of his community. Jay  moved to Westfield, New Jersey, in 1951. He graduated from Westfield  High School in 1957 and earned his degree from Siena College in 1961.  Soon after, he completed Officer Basic Training at the U.S. Army Field  Artillery School in Fort Sill, Oklahoma, and was deployed to Korea with…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691577/recognizing-jay-post"}, {"senator": "James Risch", "party": "Republican", "sentence": "…development of a system with similar or advanced       capabilities.\n\n8. A determination has been made that the Czech Republic       can provide substantially the same degree of protection for       the sensitive technology being released as the U.S.       Government. This sale is necessary in furtherance of the U.S.       foreign policy and national…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691198/arms-sales-notification"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…native from Sacramento, California, found himself interested  in American History and Politics, which brought him to the University  of Dallas, where he received his bachelor's degree in history and a  master's degrees in American studies. Following graduation, Jeff moved  to Washington, D.C. and started his career in public service.\n\nThroughout his time…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690377/recognizing-the-career-of-jeffery-ronald-billman"}]