[{"senator": "Al Green", "party": "Democrat", "sentence": "…an election coming up for the  new 18th Congressional District. If it sounds confusing, it is.\n\nOn March 3, there will be an election for the new district, but the  Governor delayed the election for the old district for almost 1 year.  It was just recently that we had the election for the old 18th  Congressional District.\n\nFor this Governor, for your…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…to eliminate\n\nThese are not empty comments. They are real threats. Under this  administration, we are seeing mass firings at Social Security offices,  hours-long wait times, delayed checks, websites crashing, and field  offices closing.\n\nMy district office in Raleigh, North Carolina, has received panicked  calls from seniors whose checks didn't arrive…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691162/threats-to-social-security"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…human impacts include world-class researchers who are looking  into how to predict stroke risk among veterans; enrollment of veterans  into clinical trials for advanced cancer delayed because of the VA's  hiring freeze; openings for new clinics that have been delayed because  the VA can't hire the necessary staff to open their doors; the VA  mental health…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…people who, if they had health insurance, wouldn't  need to be  in the emergency department. We have taken care of patients who didn't  have insurance like Medicaid, so they delayed care or they didn't pick  up a medication because it was too expensive and they didn't have  coverage.\n\nWe have seen these things. Dr. Morrison and I have both seen  complicated…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…prices, ensure our water is safe to drink,  and fund community health centers and teaching health centers. Instead,  Speaker Johnson chose to cave to Elon Musk.\n\nThough it may be delayed, I am pleased to be supporting the passage  today of the American Music Tourism Act. Americans are fortunate to  have a rich musical heritage. Throughout the United States,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690270/american-music-tourism-act-of-2025"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…consequences of the President's decision will be felt in so many  ways. Labs could go dark. Patients could be kicked off of lifesaving  critical trials. New cures could be delayed. Future innovators could  abandon the field.\n\nThe President must stop the senseless attack on the research that  saves money but, most importantly, saves lives.", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688502/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…don't stop getting  sick. They delay preventative care. They skip prescriptions. They end  up in emergency rooms. Emergency rooms become overrun, and care gets  worse and more delayed. Costs rise for everyone, and all outcomes  suffer.\n\nBecause of months of inaction by Donald Trump and congressional  Republicans, those tax credits have expired and will…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698671/protecting-healthcare-for-millions-of-americans"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Health,  new research grants would be frozen, interrupting efforts to treat and  prevent deadly diseases.\n\nInstead of providing funding for rental assistance, payments would be  delayed and families would face the prospect of eviction.\n\nInstead of increasing funding for Head Start, Health and Human  Services would be unable to issue new grants, jeopardizing…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…sister and you live in Neah Bay in the farthest northwest corner of the  lower 48 States, then you have to drive hours and sometimes wait for a  ferry that could be 2 hours delayed in order to get to a specialist in  Seattle to get your kid lifesaving care.\n\nWhat will happen if this budget resolution becomes reality and if $1  trillion is cut from Medicare…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688135/republican-budget-betrayal"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Mr. Speaker, my flight was delayed in getting to D.C. Had  I been present, I would have voted YEA on Roll Call No. 191, H.R. 1709;  YEA on Roll Call No. 192, H.R. 1770; and YEA on Roll Call No. 193, S.  1596.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693445/jocelyn-nungaray-national-wildlife-refuge-act"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "Mrs. TRAHAN. Mr. Speaker, I was unable to attend the first vote  series today due to a delayed flight into Washington, D.C. Had I been  present, I would have voted YEA on Roll Call No. 71, YEA on Roll Call  No. 72, NAY on Roll Call No. 73, and NAY on Roll Call No. 74.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700150/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…On June 19, this Nation will recognize Juneteenth with a  Federal holiday. We will gather in the spirit of remembrance,  resilience, and recommitment to celebrate a day of delayed liberation,  but not undeniable triumph.\n\nOn June 19, 1865, more than 2 years after President Lincoln signed  the Emancipation Proclamation, Union soldiers arrived in Galveston,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692430/2025-juneteenth-major-league-baseball-events-in-birmingham"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…said: ``A continuing resolution, CR, is  bad for our military and weakens our national security. A CR means new  weapons programs cannot get started.'' Shipbuilding will be delayed.  ``A yearlong CR means we are not serious about building a military that  will deter China, Russia, and Iran.''\n\nThe White House may be out of touch with reality when it…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688483/disastrous-implications-of-a-yearlong-cr"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…administration, Donald Trump and  Republican allies have increased the prices of prescription drugs-- including cancer and heart medications, as well as vital antibiotics-- delayed the implementation of a Biden administration rule that barred  medical debt from showing up on credit reports, cut NIH grants, halted  all studies and activities within the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…on Social  Security, but because of the Trump administration's actions, customer  service has completely collapsed. The agency faces 6 million backlogged  cases, 12 million delayed field-office transactions, and some of the  worst wait times in history.\n\nWhy is this happening? It is because the Trump administration pushed  out 7,000 Social Security employees.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698683/social-security-customer-service"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "Mr. STUTZMAN. Mr. Speaker, on Roll Call No. 49 and No. 50, I am not  recorded because I was absent due to delayed travel. Had I been  present, I would have voted YEA on Roll Call No. 49 and YEA on Roll  Call No. 50.", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699471/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…transition to a system that  works.\n\nBut they are playing politics. They are using Federal employees and,  quite honestly, the American public right now, whose flights are being  delayed, whose skies are less safe--they are using public employees and  the American public as pawns in this grotesque display of partisanship.\n\nMy bill is very simple. It is backed…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…best information available to them as they make  decisions about when to start benefits.\n\nToday, we use terms like ``early eligibility age,'' ``full retirement  age,'' and ``delayed retirement credits.'' Those are confusing to  people I talk with about this. Studies show that most beneficiaries  don't fully understand how their claiming decisions will…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697234/claiming-age-clarity-act"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…them our best in return.\n\nMr. Speaker, I urge my colleagues to join me in supporting this  legislation and to act swiftly to make sure that our veterans never see  their care delayed, denied, or diminished because of outdated laws.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695454/protecting-veteran-access-to-telemedicine-services-act-of-2025"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…States like mine.\n\nIf we want affordable and dependable energy in our country, then we  must build the infrastructure that delivers it. However, too often  these projects are delayed or blocked by a Federal permitting process  that is far too inconsistent. When one State can derail an interstate  pipeline, then entire regions pay the price. We have already…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698057/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…example.\n\nDue to unclear review processes and a lack of coordination amongst  government agencies, pipeline infrastructure approvals in this country  have been significantly delayed in many cases, often resulting in  insufficient infrastructure to transport our clean natural gas.\n\nThe result is an electric grid that is less reliable and increased  utility…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698069/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…Congress' most basic responsibility, and it is  also the most important. When Congress fails to do that job, the  consequences reach beyond Washington. The harmful impacts include  delayed services, uncertainties for families and businesses, and eroded  trust in government.\n\nOur recent progress stands in sharp contrast to where we were just a  few years ago.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699921/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Agriculture, Nutrition, and  Forestry.\n\n3377\n\nBe it enacted by the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. DELAYED IMPLEMENTATION OF RULE RELATING TO                     IMPORTATION OF SHEEP AND GOATS AND PRODUCTS                     DERIVED FROM SHEEP AND GOATS.\n\n(a) In General.--During…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697537/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…issue utility and  transportation rights-of-way for Apex, businesses seeking to start  construction or expand operations currently face a complicated  permitting process. The delayed installation of utilities has stalled  the growth of existing businesses in the Apex area. Additionally, the  prolonged permitting process deters new investment and hinders…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691121/apex-area-technical-corrections-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the misguided policies and, frankly,  discriminatory treatment that prevailed during the administration of  President Biden.\n\nSo I thank SpaceX again and welcome home, a long delayed welcome  home, and welcome back to Earth to our astronauts.                     Artificial Intelligence Announcement\n\nMr. KILEY of California. Mr. Speaker, I have the honor…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…Government, we are finally reopening. The result of the  shutdown has been thousands of employee furloughs, major disruptions to  our air travel, servicemembers going without pay, delayed food  assistance for low-income individuals and families, and much, much  more.\n\nMr. Speaker, as a member of the House Committee on Appropriations,  the responsibility of…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696734/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…and natural gas will fill that gap.\n\nUnfortunately, the build-out of interstate natural gas pipeline  infrastructure has faced significant challenges. Approvals are often  delayed due to a lack of coordination, pure inaction, or outright  obstruction by States and relevant Federal agencies.\n\nSection 401 of the Clean Water Act has turned into a procedural…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698073/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…closely integrated--the United States, Canada,  and Mexico--that it will increase the cost of a GM pickup truck about  $10,000.\n\nEven if these tariffs, at the last minute, are delayed, businesses  are hurt by the uncertainty, which continues to increase costs.\n\nPresident Trump plans to follow those tariffs with reciprocal tariffs  on the EU, which includes…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688254/unanimous-consent-request-s-348"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…concerns with the Biden-Harris  SBA over its rollout plan, or lack thereof, former Administrator Guzman  failed to listen, and the results were damaging. Small businesses were  delayed for months, sometimes longer, to get approval from the SBA to  compete for governmental contracts.\n\nTo make matters worse, the SBA allowed small businesses to use the  new…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697273/sba-it-modernization-reporting-act"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…their conveyances. A big part of the reason why  so few of the more than 2,000 eligible Vietnam-era veterans or their  heirs have received those lands is because they were delayed or  outright blocked by the previous administration.\n\nThe previous administration blocked their ability to select and  receive their lands. To hear my colleagues, Mr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694897/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}]