[{"senator": "Alma Adams", "party": "Democrat", "sentence": "…distribution, and gave a direct line for North  Carolinians to speak to their communities.\n\nSlashing public broadcasting funding will limit their ability to  operate during crises and delay critical information to the people who  need it most.\n\nMake no mistake: Without public broadcasting, we would have seen more  lives lost in Helene. We need to protect these…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693723/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…emergency food aid.\n\nSecretary Rubio said that it is going to happen. Elon Musk said that  it is going to happen. It has been 4 months now, and we are still  waiting.\n\nWhat is the delay? Let's get this food aid moving again now. I will  continue to speak on the House floor every day until we do.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692007/cuts-to-public-broadcasting"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…illnesses that impact       our families, friends, and neighbors in every comer of our       nation. Please ensure that any changes to SAMHSA programs do       not disrupt, delay, or reverse our nation's great progress       and commitment to addressing our mental health, suicide, and       substance use crises.            Sincerely,\n\nAmerican Association…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…29-year-old woman was diagnosed  with HIV during her pregnancy. She is a mom of two young kids, 7 and 1  years old. She has struggled with mental illness, depression, and  cognitive delay. Because she lacks daily adherence support for her  lifesaving Valley fever medication, she has been hospitalized three  times due to sepsis related to the condition.\n\nAnother…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698664/protecting-healthcare-for-millions-of-americans"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…277, passage of H. J. Res 88. Had I been present, I would have voted  no. Overturning California's Clean Air Act waivers is a climate setback  of massive proportions that will delay much-needed actions to abate  climate chaos. By expanding the scope of the Congressional Review Act  to accomplish this, the Senate has created a new process to undermine…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692393/vote-explanation"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…functions. When unlimited outside spending can be deployed against a  single vote, it shapes the decisions lawmakers can take. It narrows the  range of feasibility policy. It rewards delay and protects entrenched  interests, often at the expense of the public's priorities.\n\nMeanwhile, Americans face one of the most pressing affordability  crises in decades. Healthcare,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699237/restoring-election-integrity"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…in the blink of an eye. Most Republicans would vote for  it because they know how much the public wants to renew these credits.  So there is no reason under Heaven for us to delay. The House passed  this bill last week by 230 to 196, and 17 Republicans joined Democrats.  That is not a fluke. That is a glaring signal to Republicans that  Americans are…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…advocate will be a direct line of contact  for our veterans and their families, ensuring that they have someone  who can immediately help with any concerns and respond without delay.\n\nIn my home State of New Jersey, 190 veterans tragically lost their  lives because of the COVID outbreak at the veterans homes in Paramus,  New Jersey, and Menlo Park. This…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692953/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…any time, has refused to do so. He called  this a hoax.\n\nWe are here because Speaker   Mike Johnson and President Trump have  gone to extraordinary lengths to try to kill and delay the discharge  petition, including refusing to seat Adelita Grijalva for over 40 days  and threatening House Republicans who signed on.\n\nSeveral of my Republican colleagues…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696816/epstein-files-transparency-act"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…burden being  carried by Mekhiya and the tens of millions more seeing a spike in  healthcare premiums. I urge my colleagues in the Senate to do right by  families and act without delay to lower healthcare and help working  family people breathe a little easier.\n\nMake no mistake, the fight to lower costs is far from over. We have  got to put our foot on the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698667/protecting-healthcare-for-millions-of-americans"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…engagement so the whole rest of the process, as it goes  forward, is accelerated; disciplining the despised-by-me interagency  process mechanism that excuses so much executive branch delay and  indecision. I was actually pretty pleased with the way the process was  going.\n\nOff of Rhode Island, we are developing offshore wind. Our offshore  wind project, Revolution…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…siphon cash assistance meant for food, rent,  and childcare into unregulated crisis pregnancy centers, places that  masquerade as medical clinics. They spread misinformation, delay care,  and shame women who may choose to have an abortion.\n\nMs. LEGER FERNANDEZ. Mr. Speaker, what is worse is their bill blocks  the Federal Government from monitoring States'…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…when Congress has  the will, it can pass legislation with lightning speed. We passed the  Epstein Files Transparency Act through both Chambers in a day. There is  no reason to delay this bill, which I will introduce later today.\n\nI will have more to say later this morning. But for now, I simply  want to thank all the survivors and family members who are…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699879/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…raising grains that go into fuels. Without that  market, they wouldn't exist.\n\nThis is serious business for agricultural America, and instead,  Speaker Johnson has set up another delay, a council set to report back  within another month on next steps.\n\nNext steps on what? We want to make E15 year-round. That is not too  complicated. That may sound like progress…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…rely on government programs to keep them  healthy and safe.\n\nThese aren't hypothetical concerns. These firings will have real- world consequences. Eliminating staff at NIH will delay the development  and approval of lifesaving treatments. Cancer patients will have to  wait longer for promising new treatments as clinical trials still stall  due to staffing…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688252/department-of-health-and-human-services"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Guard, and the Federal Emergency  Management Agency, Agencies that we cannot leave behind. We need to  give these Agencies the security of a full-year funding bill without  delay.\n\nI, once again, thank Senate appropriators for helping us to get to  this point, and I look forward to finishing our 2026 appropriations  work in the coming days.", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699507/government-funding"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Presumption Against Oil & Gas Development Violates the       NPRAA: The proposed rule specifically explains, under section       2361.10, that BLM will now have the authority to delay or       deny, without setting a timetable, on any activities it       determines will have significant adverse effects on surface       resources. This is overly broad and…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…list of  Chinese military companies.\n\nSince the section 1260H list is something that the Secretary of  Defense is instructed to update, it is possible that there is a natural  delay as to when Chinese military companies are designated as foreign  entities of concern for the purposes of this act.\n\nThis amendment provides clarity and ensures that any U.S.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689026/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Speaker, I rise today in very strong support of H.R.  1, President Trump's one big, beautiful bill.\n\nHere we are, despite months of our Democratic colleagues' best  efforts to delay, fearmonger, and mislead the public about this bill,  and we are ready to deliver for the American people.\n\nHere is the thing about fear-mongering. You can only say ``the sky…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693224/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…that, establishing clear, commonsense definitions and  regulatory pathways so that our law enforcement professionals can get  the equipment that they need without unnecessary delay or confusion.  That is not just good policy. That is good public safety sense.\n\nThis legislation represents a balanced approach. It upholds our  commitment to the rule of law,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699900/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…because they were lost in the mail, which is entirely  unacceptable and preventable. It enhances public safety by helping  emergency responders locate those in need without delay, and it ensures  that local governments receive the tax revenue they are rightfully owed  allowing them to invest in schools, roads, and community services.\n\nThe current process…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…navigate complex environmental  reporting requirements, overtime and wage rules that change from one  administration to the next, and lengthy permitting processes that can  delay construction projects for months or even years.\n\nFamily-owned shops face costly data privacy mandates designed for  multinational corporations, while contractors struggle with…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697345/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…2024  Presidential election, this is a real problem in Massachusetts right  now. I would argue that we need to pass this legislation to actually  take action.\n\nThe time for delay is over. I hope we can pass this today. I hope the  Senate will take it up immediately to protect the integrity of our  elections and preserve confidence in our democratic…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699944/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…(Madison, WI);\n\n(S) Mark Wells (St. Clair Shores, MI); and\n\n(T) Phil Verchota (Duluth, MN).\n\n(4) The ``Miracle on Ice'' USA-Soviet Union final round       game aired on tape delay on February 22, 1980, from the Lake       Placid Games and drew 34,200,000 average viewers. The match       is remembered as a ``miracle'' as collegiate hockey players…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690279/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…or State  agency, it can still be forced through an additional duplicate  permitting process with the Office of National Marine Sanctuaries.\n\nThat extra layer adds years of delay, drives up costs, and  discourages investment without providing meaningful environmental  protection. H.R. 261 clarifies that once a project has been lawfully  approved at…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699956/undersea-cable-protection-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…provider shall provide a       fraud ban notification under paragraph (1) not later than 24       hours after the fraud ban is initiated against the banned       member.\n\n(ii) Delay based on judgment of provider.--If, in the       judgment of the online dating service provider, the       circumstances require a fraud ban notification under       paragraph…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692730/romance-scam-prevention-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…things in the mail. It is hard to determine  whether this is an update on the claim that I have filed, a resolution  to that claim, or seeking more information, or is it simply a delay  saying that they don't have a resolution to the claim yet? It can be  very difficult to figure that out, especially if you have multiple  claims within the same packet.\n\nWhen…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689676/clear-communication-for-veterans-claims-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…penetrations. The explosive filling is usually       tritonal, though other compositions have sometimes been used.\n\n6. The FMU-139 joint programmable fuze (JPF) is a multi-      delay, multi-arm, and proximity sensor compatible with       general purpose blast, frag, and hardened-target penetrator       weapons. The JPF settings are cockpit-selectable in…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696967/arms-sales-notification"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…without opposition. There was zero dissent. There was  complete consensus and stakeholder support. It is now time for the  entire House to deliver.\n\nMr. Speaker, every day of delay is another day a veteran waits for  care. It is another day a qualified professional can't serve. It is  another day the system fails those who have served and protected us…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695432/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…any violation of the act.\n\nThe reason for this motion is plain and obvious. It is not a  legitimate attempt to question consideration, but simply a dilatory  tactic to further delay consideration of this historic legislation and  to give the Democrats more time to mislead Americans.\n\nWe must dispense with this question of consideration so we can move…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}]