[{"senator": "Scott Peters", "party": "Democrat", "sentence": "…jurisdiction.  This leaves IBWC solely reliant on annual appropriations or emergency  funding to build and maintain its facilities.\n\nMy office, along with the rest of the San Diego delegation and our  California senators, have worked hard to secure $360 million in  emergency funding to help address chronic issues at the South Bay  International Wastewater Treatment…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692166/international-boundary-and-water-commission-authority"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "Mr. COHEN. Mr. Speaker, I had the opportunity late last month to  spend some time with a delegation of high-level officials from the  leadership of Libya.\n\nSent to Washington by the Libyan Prime Minister, the group presented  solid evidence that a new Libya is in the making.…", "date": "2025-12-05", "source_url": "https://justfacts.votesmart.org/public-statement/1697566/recognizing-the-importance-of-a-new-libya"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…early 1970's moved into their       second decade, the States had largely taken over the job       formerly performed by the Federal Government. With the       successful delegation to the States, EPA, under the       leadership of Bill Ruckelshaus, has been freed to move on to       the challenges of the 1980's--such as cleaning up abandoned       toxic…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…Lacy Clay; the entire Clay family; and the St. Louis community in my  prayers.\n\nMr. Speaker, on behalf of myself, the entire CBC, which he helped  found, and the Missouri delegation, I ask for a moment of silence in  memory of the Honorable William Lacy Clay, Sr.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693815/moment-of-silence-for-congressman-william-clay"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "Mr. SCOTT of Virginia. Mr. Speaker, I rise today as dean of the  Virginia congressional delegation to introduce and welcome to Congress  the newest Representative from the Commonwealth of Virginia, James  Walkinshaw.\n\nJames was born in Northern Virginia, the very region…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695220/welcoming-the-honorable-james-walkinshaw-to-the-house-of-representatives"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "Mr. Speaker, I thank first the entire Minnesota delegation, in  particular Congresswoman Morrison for introducing this important  resolution. This is obviously a very sad time across our country, and  of course our hearts and our…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692858/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "Mr. STANTON. Mr. Speaker, I thank Congressman Gosar, the new dean of  Arizona's State delegation. It has been a minute since we have all been  together on the House floor. I am looking for cobwebs around here.\n\nAs dean, Congressman Gosar replaces the late Congressman…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696709/welcoming-the-honorable-adelita-s-grijalva-to-the-house-of-representatives"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…them.''\n\nSince 1802, Congress has established various types of local  government for D.C. In 1953, the Supreme Court held: `` . . . there is  no constitutional barrier to the delegation by Congress to the District  of Columbia of full legislative power.''\n\nThe local D.C. Legislature, the Council, has 13 members. If D.C.  residents do not like how members…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…for the  climate conference. Of course, the Trump administration has  disgracefully pulled the United States out of the Paris Agreement once  again, and we have no Federal delegation at all.\n\nAs the rest of the world convenes to accept the reality of the  climate crisis and to accept the related reality of coal being the  biggest contributor to carbon…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "Ms. LOFGREN. Mr. Speaker, there is mourning across the aisle and  across the State of California. I chair the California Democratic  delegation, and we are deeply saddened by the loss of Doug LaMalfa. It  was a pleasure to serve with Doug since his election in 2013.\n\nHe was a man who cared so deeply for the communities…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698723/9999"}, {"senator": "Juan Vargas", "party": "Democrat", "sentence": "…Water  Quality Restoration and Protection Act, and helped secure essential  funding for our district. In part because of her tireless advocacy, our  San Diego Congressional delegation has been able to secure millions of  dollars in funding to address cross-border pollution. For instance,  last year Ally worked with staff for the San Diego delegation to…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693025/recognizing-ally-castaneda"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…who identify in whole or in part as Native Hawaiian. Roughly half  continue to reside in their homeland of Hawaii, and I am deeply humbled  to join my Hawaii Congressional delegation colleagues in our kuleana  (responsibility) to represent them and their `ohana (family) everywhere  in Congress.\n\nThe Native Hawaiians, also known as Kanaka Maoli, trace…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695915/recognizing-hawaiian-history-month"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "Mr. BLUMENTHAL. Mr. President, last year, I was privileged to lead a  bipartisan delegation of 20 of our colleagues to Normandy, celebrating  the  80th anniversary of the historic landing there, where American boys-- and they were boys, 17 and 18 years old--stormed…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696181/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…would deliver more than  $10 million in annual tax revenues. That is a big deal for a small  town.\n\nSo for the last few years, local officials and our Massachusetts  Federal delegation has been working hard with the Federal Government to  help turn that idea into a reality.\n\nBut last month, the company suddenly announced they are ending the  project. No…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688155/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…Newark City Council president and went on to succeed his  father in this body.\n\nDonald M. Payne, Sr., was the first African American elected to New  Jersey's congressional delegation, and his son carried that legacy  while blazing his own path.\n\nA leader on the House Committee on Transportation and Infrastructure,  Mr. Payne secured critical investments…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698322/wishing-a-happy-heavenly-birthday-to-the-honorable-donald-payne-jr"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…university to plan strategically to meet the needs of its students, the  community, and industry.\n\nI thank Chairman Westerman and my colleagues of the Utah House and  Senate delegation for joining me in this effort to ensure that the  University of Utah's Research Park can continue to serve as a premier  research incubator.\n\nMr. Speaker, I urge my colleagues…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698134/university-of-utah-research-park-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…and Commerce  to take on a new role as the Communications Director for Congresswoman  Kat Cammack (FL-03). While she will no longer be working for a member  of the Kentucky delegation, I know she will succeed in her new role. I  wish her the best, congratulate her on her new role, and thank Kaley  Stidham for her service to the House Committee on Energy…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691969/recognizing-kaley-stidham"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…the Biden administration imposed this management  plan over not only our objections but the objections of leaders from  across Alaska's North Slope. The third member of our delegation,  Congressman Begich, has introduced H.J. Res. 124, which is identical  and is pending in the House of Representatives.\n\nI think it is important to outline a little bit of…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…creating this pipeline is one of the most crucial steps we can take to  counter China's influence in the Indo-Pacific.\n\nEarlier this year, I led a bipartisan congressional delegation to  Taiwan, Japan, and South Korea. Taiwan has already signed a letter of  intent with the State of Alaska to purchase Alaskan LNG, and both Japan  and South Korea are deeply…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…the statutory  mandate in the Tax Cuts and Jobs Act, and it ignored the voices of the  people who actually live on Alaska's North Slope.\n\nThanks to a request from Alaska's delegation, the Government  Accountability Office issued a legal opinion on August 25 confirming  that this 2024 Record of Decision is a rule under the Congressional  Review Act. That…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696831/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…reserves in the United States.\n\nThey did this despite strong opposition from local counties in  Montana and local elected officials--in fact, the entire Montana  congressional delegation and the Governor of Montana himself, Greg  Gianforte. In fact, Governor Gianforte specifically requested that the  BLM Director withdraw that proposed amendment during the…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696095/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Ms. FOXX. Mr. Speaker, I rise to recognize James Min who will be  departing the people's House after 25 remarkable years of service.\n\nWithin the California delegation, he served in a variety of roles for  three separate Members: Representatives Bill Thomas, Kevin McCarthy,  and Vince Fong.\n\nHis unwavering dedication in service to countless…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688721/recognizing-james-min-after-25-remarkable-years-of-service"}, {"senator": "Greg Murphy", "party": "Republican", "sentence": "…Victims are  still and will continue to process the trauma from that occurrence.\n\nNorth Carolinians are resilient. It has been heartening to see the  entire North Carolina delegation come together and provide support for  those in the western part of the State.\n\nFurthermore, the contributions of first responders, nonprofits, and  concerned private citizens…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689315/disaster-related-extension-of-deadlines-act"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…Westerman, committee  staff, and my colleagues on the Natural Resources Committee for helping  me bring this legislation to the floor today. A special thank you to my  Arizona delegation cosponsors, my good friends, Representatives Biggs  and Schweikert.\n\nMr. Speaker, I once again ask all my colleagues to support my  legislation, H.R. 1043, the La Paz County…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693918/la-paz-county-solar-energy-and-job-creation-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…extremists.\n\nThe Biden administration provided a limited opportunity for public  comment or engagement on this RMP amendment. Wyoming's Governor, a  unified congressional delegation, locally elected officials, Tribes,  and local communities all expressed strong opposition to this plan  amendment. The previous administration ignored them all.\n\nAccording…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…thousands of good jobs, and giving students hands-on  opportunities to learn and grow.\n\nI thank once again Representative Moore, Senator Lee, and the entire  Utah congressional delegation for their work on this important effort.  I urge my colleagues to join me in supporting this bill, and I yield  back the balance of my time.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698135/university-of-utah-research-park-act"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…upon. We have our fair share of that political  disagreement in Minnesota, and we even have it here in the House  Chamber.\n\nI was proud to join every Member of the Minnesota delegation on both  sides of the aisle to call out this act of hatred, and we will continue  to do so together.\n\nMr. FINSTAD. Mr. Speaker, over the past week, I have been reminding…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692856/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…fitting tribute to name the VA clinic after him to  tell the story of his service.\n\nI thank the sponsor of this bill, Representative Smith, as well as  the entire New Jersey delegation for honoring their fellow New Jerseyan  with this tribute.\n\nMr. Speaker, I urge my colleagues to support H.R. 2170, and I reserve  the balance of my time.\n\nMr. SMITH of New…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…investments in public safety, energy  reliability, our public lands and, for those of us in the West, water  conservation and infrastructure.\n\nAs the only member of the Arizona delegation in both the Senate and  the House serving on the Appropriations Committee, I have worked to  make sure this bill delivers real results back home in Arizona's Sixth  Congressional…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698633/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…during extreme weather and peak demand. It  will create jobs, generate millions of dollars in revenue, and provide  for our national security.\n\nI commend the entire Montana delegation, Representatives Downing and  Zinke, and Senators Daines and Sheehy, for their tireless work and  leadership on this issue.\n\nMr. Speaker, I encourage my colleagues to support…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}]