[{"senator": "Judy Chu", "party": "Democrat", "sentence": "…professionals.\n\nAs a result, these women ended up in the hospital, needing emergency  care and surgery to save their lives.\n\nIn Illinois, a woman seeking an abortion was deliberately misled by a  fake clinic. She was subjected to graphic videos and told that having  an abortion would make her infertile and, ultimately, mentally ill.\n\nUltimately, she…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…pieces of legislation we       understand will be considered on the House floor this week.       All three bills would repeal provisions in laws that were       carefully and deliberately enacted by the Council for the       benefit of all District residents.\n\nH.R. 2096 would repeal several efforts by the Council to       ensure that police officers who violate…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…have taken testimony and hearings from all the committees and waited to  report out the rule until whenever final deals were made with their  Members. Yet, Republicans are deliberately choosing to meet at 1  o'clock in the morning on something this consequential.\n\nMr. Speaker, I think the gentleman thinks it is a good idea. The  gentleman says that I will…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…a discussion about how we solve this problem--the  Constitution says so--and the questions raised here.\n\nFor the first time in 250 years, the United States military is  deliberately targeting civilians. They may be awful civilians, I will  grant you that, but they are deliberately targeting civilians. We have  the largest military force ever assembled…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698242/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…anyone's energy  costs. And you know how I know this? Because a true strategy to lower  people's costs would include clean energy sources like wind and solar,  which this order deliberately excludes.\n\nSo what does this Executive order do? It lets big oil and gas  companies off the hook on following our environmental laws and  regulations. And those are the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688155/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Speaker, the Israeli Government has deliberately  blocked food, medicine, and fuel from entering Gaza. The entire  population of Gaza is experiencing famine, and half a million  Palestinians are facing catastrophic levels…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693848/starvation-in-gaza"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…elsewhere in the world. We go and we welcome  them home, and we think that they will have a very deep understanding  that whatever they are instructed to do, they will not deliberately do  provocative things.\n\nThe thing that would really sour the situation--I am putting up a  little picture here that I know you can't see, but it is a picture of  one of…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…pieces of legislation we       understand will be considered on the House floor this week.       All three bills would repeal provisions in laws that were       carefully and deliberately enacted by the Council for the       benefit of all District residents.\n\nH.R. 2096 would repeal several efforts by the Council to       ensure that police officers who violate…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692373/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…lowered premiums for millions of Americans expired because  Republicans chose to let them die. Republicans knew the crisis was  coming; they knew the consequences, and they deliberately blocked  relief from the American people.\n\nAlready because of the callous actions of our Republican colleagues,  ACA enrollment has already dropped by nearly a million and…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…U.S. Federal committee to advise the Forest  Service, we got all of these stakeholders together to implement the  2012 planning rule, and it was the same deal. We did it deliberately.  We did it with all stakeholders at the table. These RMPs are actually  developed with public input from every community, not from one single  stakeholder group. That is…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696880/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…with Donald Trump to let SNAP  expire.\n\nTrump did this once before. In 2019, he funded SNAP during his last  shutdown. Back then, Trump kept SNAP funded. This time, he is  deliberately pulling the plug, even though in September he said he  would fund it and could fund it, independent of any shutdown.\n\nTrump is weaponizing hunger. He is using kids and parents…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696462/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…provisions to  address sexual assault and sexual harassment within the Coast Guard.  These new requirements, directives, and oversight were developed  because the Coast Guard deliberately hid Operation Fouled Anchor and  decades of sexual misconduct within the Coast Guard.\n\nFormer Commandant Admiral Fagan worked hard to repair that lost  confidence that resulted…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694197/coast-guard-authorization-act-of-2025"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…measured by comparing the       budgets of EPA under the previous administration with those       proposed and approved by the Congress under my       administration. But they deliberately ignore that the major       Federal environmental laws are designed to be carried out by       the States in partnership with EPA.\n\nBy the time the clean air, clean water,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…branch in setting foreign  policy.\n\nI have my thoughts on the wisdom of this action. I have stated that I  think it is very dangerous when the President of the United States  deliberately misleads the country about the efficacy of our military  operations overseas or the threats presented to this country. It is  unforgiveable anytime a President doesn't tell…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693125/motion-to-discharge-sj-res-59"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…table, Mr. Trump has appeared so eager to reach  a deal that he has been willing to acquiesce to Russian demands for  essentially nothing in return. Even worse, he has deliberately excluded  Ukraine and Europe from the discussion.\n\nWe have seen this playbook before, most recently in Afghanistan. In  2020, President Trump, eager to achieve a quick deal,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…failure.\n\nIt gets worse. After independent experts uncovered major flaws in the  study used to justify the freeze, the Biden administration doubled  down, and senior officials deliberately hid reports that completely  contradicted their argument.\n\nThe administration knew the truth, and they hid it. They buried it.\n\nMr. Speaker, the American people deserve…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697088/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…the National Enquirer, which publish       nothing but stories that they know to be untrue. That's not       to say we never publish falsehoods, but we don't do it       deliberately. It's that we have good reasons like credible       sources and reliable references to believe that what we write       is true.\n\nIn the case of political candidates, if…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694761/recognizing-campbell-the-nature-of-truth-odessa-american"}, {"senator": "Jim Justice, Jr.", "party": "Republican", "sentence": "…and fentanyl analogues, into correctional facilities       by mail threatens employees, inmates, and the security of       correctional institutions, and the practice of deliberately       lacing opioids to ensure targeted lethality represents a       dramatic emerging concern.\n\n(6) The foregoing factors add tremendous pressures and       workload that…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689519/9999"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…by a suspected Tren de Aragua member.\n\nVoting for this resolution to limit the President absolutely is not  standing with the United States of America. There are people  deliberately targeting Americans, and he is saying the President can do  nothing about it. That is what his vote will say today.\n\nI think the other side should take a look at the chart.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…before March 26,  2025.\n\nAfter Democrats lost the 2024 elections, the Biden administration  hurried to ink multiyear deals that they knew they would never have to  enforce, deliberately tying the hands of their successors and rewarding  union leadership on their way out.\n\nOne example is especially egregious: the Social Security  Administration deal that…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697995/protect-americas-workforce-act"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…it quickly became evident that there were  commonsense changes that would immediately enhance aviation safety.\n\nThe Army helicopter, flying along the Potomac River, had deliberately  chosen not to broadcast its location to other aircraft or to air  traffic control  using the common aviation technology called automatic dependent  surveillance broadcast,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698320/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…foreign countries and then sold  and imported into the United States, PHMSA only inspects those  facilities once every 5 years.\n\nOver time, certain foreign producers have deliberately evaded safety  and regulatory standards to gain a competitive advantage over domestic  producers, potentially jeopardizing public safety in the process.\n\nThis bill ensures…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692180/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…19 with a simple  appropriation that made no policy changes. It merely kept the  government operating at current levels while we finished debating  priorities.\n\nDemocrats deliberately blocked the Senate from acting, demanding $1.5  trillion of new spending as a ransom. Finally, thank God, eight of them  put country ahead of party and voted to end this…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696689/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…on compassion. You are not going to lecture me  on being kind to the poor and the forgotten.\n\nYou are the party who let 15 million illegals in this country,  wantonly and deliberately. You are the party who defended a President  who wasn't mentally competent.\n\nOne of the ladies mentioned that Donald Trump voted from a golf  course. Donald Trump could…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689410/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…illegal aliens in his first 100 days has made one thing  painfully clear: The Biden-Harris administration was never working to  fix our immigration system. They actively and deliberately worked to  undermine it.\n\nThe Center for Immigration Studies found illegal immigrants annually  take--and this is a conservative estimate--nearly $120 billion directly…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "John Thune", "party": "Republican", "sentence": "…the Capital  Jewish Museum in Washington, DC, held by the American Jewish Committee.  From everything we know so far, it is appallingly clear that event  attendees were deliberately targeted. And two young Embassy employees-- tragically, two employees on the verge of getting engaged and starting  a life together--were murdered in the attack.\n\nI am grateful…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691633/capital-jewish-museum-shooting"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…anything about the millions of Americans who got walloped  by Democrats when they shut the government down?\n\nDid we hear an apology from Democrats to the American people for  deliberately misleading them over 40 days?\n\nDid we hear an admission that the only reason they shut down the  government is to cover up for a catastrophic policy failure that they  concocted…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696692/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…price  pressures and provide the right type of energy to fuel American  innovation and the next-generation industries.\n\nUnfortunately, the previous administration sought to deliberately  undermine the financial viability of coal while subsidizing preferred  sources like wind, solar, and batteries.\n\nInstead of regulating one industry and subsidizing another…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…murdered in just this way.\n\nPolice officers are community leaders and public servants who deserve  the respect of the country. Instead, it seems coldblooded killers have  been deliberately targeting our law enforcement heroes, and it is now  more important than ever not to just talk but to act.\n\nI am confident that Congressman Moore's bill will accomplish…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…it is  equally defined by innovation and resilience. A stronger Taiwan means a  stronger United States and vice versa. That is why both our Nations  must continue working deliberately and decisively to deepen  cooperation. The payoff is clear: greater prosperity for our people and  greater stability for the world.\n\nTaiwan has made remarkable progress…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}]