[{"senator": "Patty Murray", "party": "Democrat", "sentence": "…Star is always, what can I do that does the most for folks  back home in Washington State, how can I protect the programs that  hard-working people count on, and how can I deliver real wins that make  families' lives better?\n\nSo to all of my colleagues who share my outrage over how Trump has  trampled over our spending laws and my grave concerns over his…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698874/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…protection of northwest Indiana and our neighborhoods.\n\nMr. Speaker, I look forward to supporting this measure and continuing  to work with the Appropriations Committee to deliver real, meaningful  public safety investments for the people whom I serve.\n\nMr. Speaker, I also thank Rosa DeLauro, our ranking member, and  Chairman Cole for the countless hours…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698753/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Toward Equity Act. These bills will help increase  the supply of housing, bring down costs, and revive the dream of  homeownership for all.\n\nWhile Democrats are fighting to deliver real relief to families  across this country, President Trump, along with co-president Elon Musk  and Secretary Scott Turner, are working to decimate HUD from the inside  out.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…for one  Senator--if they can just get one Senator to come down here on the  floor and object to the passage of this commonsense bill. I hope we can  pass it right now to deliver real relief at the pharmacy counter.\n\nI am now going to yield to my partner in this effort, Senator  Grassley, before I make a motion.\n\nMr. DURBIN. Take a look at the agenda…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694204/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…often stand in their way.\n\nMr. Speaker, I urge my colleagues on both sides of the aisle to  support this bill. Together, we can meet the affordability crisis head  on and deliver real support for our constituents.           Congratulating Loudon County High School's Football Team\n\nMr. SUBRAMANYAM. Mr. Speaker, I rise to congratulate Loudon County  High…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697707/nationwide-shortage-in-professional-fields"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…When we rebuild housing and commercial  corridors, we strengthen communities and restore local pride.\n\nThese are responsible investments that respect taxpayer dollars and  deliver real results for working families. I urge my colleagues to  support this measure.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699321/consolidated-appropriations-act-2026"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…without fear of retaliation when they uncover corruption or  abuse of power.\n\nWe will join Republicans in passing this bill today, but we need to  finally get to work to deliver real change for the American people.\n\nMr. Speaker, HUD plays a vital role in providing safe and affordable  housing to families all across the United States. Families depend…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697210/hud-transparency-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…4,200 employees. These  Secretaries and committees can theorize all they want. I needed  professional, well-trained, and certified nurses, social workers, and  the like to deliver real-world services to real people in the day-to- day management of a large county.\n\nLet's stop the ideological foolishness. Place this proposal to  downgrade careers where it…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697491/bringing-attention-to-anti-education-agenda"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…bringing millions of dollars home for infrastructure, youth  programs, healthcare, behavioral health, and clinics back in New Mexico  because we know that that is how you deliver for real working people.\n\nMr. Speaker, the seasons may change, but we know this cycle is going  to go on. Families in New Mexico and across the Nation are going to  continue to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695608/devastating-harm-caused-by-trump-administration"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…Enacting this package will represent a major milestone and show that  Congress can work together in a bipartisan manner to carry out our  article I responsibilities and deliver real results for the people that  we are honored to represent.\n\nAgain, my thanks to the leadership and to the committee members and,  of course, to our great staff. I urge my…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699433/consolidated-appropriations-act-2026"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…total tax  credit to $2,500. Changes to the tax code, including expanding the  child tax credit, will help save the average family more than $1,300 a  year. It is time to deliver real tax relief for working families that  they so desperately need.\n\nI call on my colleagues in the Senate to protect these provisions and  make sure that working families are…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692096/child-tax-credit"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…work and expands housing supply,  and it helps bring costs down for hardworking Americans.\n\nThat is why I urge my colleagues to support Housing for the 21st  Century Act, deliver real America First solutions for the people we  serve, and enhance regulatory tailoring for those community financial  institutions--cutting red tape; streamlining bank exams…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…that every  taxpayer dollar delivers immeasurable results.\n\nBeyond tackling bloat, inefficiencies, and burdensome regulations,  the administration has partnered with us to deliver real results for  the American people.\n\nToday, congressional Republicans are partnering with them through my  bill, the American Entrepreneurs First Act.\n\nWe have heard this…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692123/american-entrepreneurs-first-act-of-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…back at work. We are back to governing.\n\nThese bills strengthen our military, secure our border, invest in  health and workforce readiness, modernize transportation, and deliver  real savings for taxpayers.\n\nIt is peace through strength. This Homeland bill makes us safer at  home by deporting illegal criminal aliens.\n\nIn the overall bills through our…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699347/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…keep America safe.\n\nThis bill reflects what Americans want: security, prosperity, and  leadership. The Senate needs to act. Let's get this to President  Trump's desk and deliver real results for the American people.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691982/recognizing-southern-virginia-universitys-ncaa-division-iii-mens-volleyball-national-championship-victory"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…this administration the tools they need to  succeed in fulfilling their election mandate.\n\nMr. Speaker, I urge my colleagues to vote ``yes'' on this budget as  we work to deliver real savings for the American people.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688085/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…pauses, forcing Americans who never set foot on a college campus to  cover the costs of elite Ivy League degrees.\n\nHouse Republicans have the chance to right those wrongs and deliver  real results for the American people by passing the One Big Beautiful  Bill Act.\n\nUnder President Trump, our economy is booming, thanks to progrowth  policies that help workers,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693154/one-big-beautiful-bill-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…The Housing for the  21st Century Act includes real bipartisan solutions to expand supply,  lower costs, and, more importantly, give our families more options.\n\nLet's deliver this real solution and return the housing market back  to working for the very people that it should serve, the very people we  do serve in the people's House.\n\nMr. Speaker, I…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Southeast Texas.\n\nFor seven years, Dr. Johnson has led Lamar State College Orange with  passion, determination, and a hands-on approach. He rolled up his  sleeves every day to deliver real results, record-breaking enrollment  and graduation rates, new vocational programs, the opening of a  satellite campus, and the construction of important new academic  buildings.…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694750/recognizing-the-retirement-of-dr-tom-johnson"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…them permanent.\n\nWhile Democrats continue to fearmonger, I want to shed light on what  Republicans are doing to fix the Democrats' affordability crisis, with  policies that deliver real, lasting relief to the American people.  These include eliminating health plan gimmicks like silver loading,  which will lower ACA premiums by 11 percent; increasing transparency…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…gander. However, rules for thee and not  for me is typically the way this works.\n\nWe will do the work of the Rules Committee. We will continue to pass  this legislation and deliver real relief for working families in this  country. We have listened to a lot of rhetoric about millionaires and  billionaires. It sounds like Bernie Sanders is in the Chamber,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}]