[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…the foul  that the majority team committed, and the majority team gets--by vote-- to overrule the referee.\n\nThat is a crummy way to go about doing business in an orderly,  deliberative body like the U.S. Senate, and that is why it happens so  rarely. Overruling the Parliamentarian on a matter is considered going  nuclear--going nuclear--and this is the…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…debate or vote about this  matter that they used a procedural parliamentary trick to turn off the  privilege. I don't think that is worthy of emulation by the ``greatest  deliberative body'' in the world. We shouldn't be afraid to debate or  discuss anything, especially matters of war and peace.\n\nSecond, an argument that the Venezuelan campaign is not…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699109/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…would welcome the long overdue debate on how to address this  challenge.''\n\nBut we are not having a long-overdue debate. We are not bringing  together the world's most deliberative body to focus on how to solve  these problems.\n\nMichael Tuffin, the president and CEO of AHIP, America's Health  Insurance Plans:\n\nMedicaid is indispensable to low-income…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…think you have good judgment, and I think you  are likely to make a careful decision, but war is too big an issue to  leave in the hands of even a completely careful and deliberative of  individual.\n\nThe Framers didn't want to leave war in the hands of George  Washington, for God's sake. They thought Congress should be involved in  it.\n\nI said to President…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…foreign nations,'' and exercising leadership on this front       should be a priority in the context of today's challenging       economic outlook.\n\nBy establishing a more deliberative process for enacting       tariffs, Congress can ensure that appropriate stakeholder       consultation and a methodical assessment of costs precede any       decision to…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696494/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…to the  Committees that somehow apportionment decisions on congressionally  passed and duly enacted appropriations are both legally binding as well  as predecisional and deliberative, and that the requirement to post  such information is unconstitutional, but that is not so. OMB and  Director Vought continue to be deeply confused about the Constitution,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694158/senate-amendment-to-hr-4"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Congress, in all of its infinite mastery of science, has decided to  superimpose itself over the scientists at the Fish and Wildlife Service  who went through a very public and deliberative process to reach this  determination. We are going to now get, I guess, a different scientific  interpretation from the great minds across the aisle.\n\nMr. Speaker, the first…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…anymore. We come to the floor and make a speech. We  may, once a month, have something to vote on the floor.\n\nThis Senate is described as one of the great legislative bodies-- deliberative legislative bodies--in the world. You couldn't prove it by  the history of our schedule over the last several months.\n\nThis week, the Senate Democrats are going to put forward…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…pointing in the same direction. We should  take a different path on the economy before this gets worse. The vote  we will have later today gives the Senate, the greatest deliberative  body in the world, the chance to stand up and say: Let's take a  different path.\n\nI thank my colleagues for their work together on this important  resolution and urge a…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…That is a 98 percent rejection rate. They block 98 out  of every 100 ideas they receive.\n\nWhat does this look like in practice? It looks like a complete  destruction of the deliberative process. Republicans have blocked--get  this--debate on amendments that would protect SNAP and Medicaid for  millions of Americans and debate on amendments to protect access…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…to  stonewall my requests until she left office in January 2025.\n\nCISA has to date refused to release the report by making a claim that  the report is predecisional and deliberative and protected by a so- called ``deliberative process privilege.'' Setting aside that a FOIA  exemption does not apply to disclosures to Congress, based on my  staff's review…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689978/nomination-of-sean-plankey"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…in politics  to strangle this discussion.\n\nIn our new American petrostate, the power of petromoney and our  corrupted petropolitics have turned this supposedly greatest  deliberative body into a tomb of silence about this danger, a mortuary  of democracy.", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…all know why. It is the same reason why every  Republican voted against releasing the Epstein files. It is because  Rules Republicans are scared as hell.\n\nThis is not a deliberative body anymore. Under this Republican  majority, Congress has become a rubber stamp for Donald Trump. This is  all about the ego of the man who lives at 1600 Pennsylvania…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…evasive,  obfuscating. He refused point-blank to answer relevant questions.\n\nOne of my colleagues, Senator Whitehouse, who will be here tonight,  characterized it as the ``deliberative process privilege.'' There is no  deliberative process privilege, and Mr. Bove had no right to refuse to  answer our questions about what he has done in his role during…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…package is our next step toward  completing the full 12 bills.\n\nWhen done the right way, funding the government is not a single vote.  It is a process that requires steady, deliberative progress. I am proud  to say we are doing just that.\n\nToday marks the second time this month that we are bringing  bipartisan, bicameral bills to the floor. We promised…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…emerging financial technologies. It ensures that decisions  with far-reaching economic implications are not made through regulatory  overreach but through transparent and deliberative processes.\n\nH.R. 3633 is not only sound regulatory policy but also essential  economic policy. It will help preserve the United States' leadership in  financial innovation,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…block buy authorization that allows  the Navy to purchase two Ford-class aircraft carriers under the same  contract.\n\nThis bill is the product of a long, thoughtful, and deliberative  process aimed at rapidly arming our American warfighters with the most  innovative and productive technology available. It delivers on this in  an astounding fashion.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697794/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…maintain our dignity as Christians by       avoiding such things.\n\nStone-Campbell Church Movement leader Alexander Campbell       (1788-1866) advocated for a rational and deliberative       understanding of Christianity, firmly rooted in the New       Testament. He opposed both speculative theology and emotional       revivalism, emphasizing a return…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694761/recognizing-campbell-the-nature-of-truth-odessa-american"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…are grounded in a Member-driven process.\n\nAs I stand here today, I think of the genius of our Founding Fathers.  They designed Congress to be an engine of thoughtful and deliberative  policymaking. It wasn't meant to be easy. In fact, difficulty is what  separates serious legislating from political performance.\n\nIn her 250 years, America has never shied…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698749/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…Lumbee had a case that could  withstand the scrutiny of the OFA process, they would go through the  OFA process as set out by law. But as they know, it won't hold up under  a deliberative process. They sought special treatment through the  legislative shortcuts, despite opposition from more than 140 federally  recognized Tribes from across the country that…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697785/ensuring-fairness-and-integrity-in-federal-tribal-recognition"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…through all the  necessary steps.\n\nThis process that has evolved over the last, roughly, two and a half  centuries allows legislation to be examined in a transparent and a  deliberative  way, with input from affected Agencies, from industries, from the  President of the United States and members of his administration, and  Senators on both sides of the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698296/9999"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…come to the floor countless times since my first term in the  U.S. Senate, beginning in 1981. It is a privilege to represent Iowans  and my home State here in the greatest deliberative body in the world.\n\nFor more than four decades and counting, I have joined my colleagues  here in this Chamber to debate public policy, shed light on wrongdoing,  and celebrate…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691703/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…key  investments in biomedical research, schools, and public health.\n\nThanks to the negotiations on a bicameral, bipartisan level, funding  decisions have moved through a deliberative, Member-driven process that  emphasizes transparency, accountability, and timely consideration.\n\nThe Labor-HHS bill before us demonstrates the will of the American  people…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699576/consolidated-appropriations-act-2026"}]