[{"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…near Houston. DHS  claims it was heart failure, but this administration has shown such  contempt for the truth that we can't believe a darn thing they say. His  family is demanding answers, and so are we. I have requested the death  report, but, Mr. Speaker, ICE has yet to respond.\n\nUnder Trump, as noted earlier, 43 people have died in DHS custody or…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699665/horrific-ice-abuses"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…Institute.\n\nFor over 50 years, every major medical breakthrough that has happened  in the treatment of cancer has been linked to our Federal investments.  Americans are not demanding that we cut money to fund cancer research,  Mr. Speaker, I promise you that. They are not calling for these cuts.\n\nOf course, as the irrepressibly cheerful Joni Ernst reminded…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691727/republican-budget-will-make-us-sicker"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…was important enough  to set up a commission to investigate and uncover the truth. The  commission set out to collect sensitive, private voter information from  every State, demanding that States hand over not just the names of  every voter on the voter rolls but their dates of birth, their voting  history, their Social Security information, and more.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…do the job.\n\nWhat is that job? To make sure that we are being their voice and  speaking out for them. And part of that has to be asking questions.  Part of that has to be demanding accountability, has to be getting  information so we can do the best job possible.\n\nIt is unacceptable that a U.S. Senator, in his own home State,  elected by millions of…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692471/alex-padilla"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…and the President knows it. That is why he is  changing the rules in the middle of the game. Need I remind you, 4  years ago, he demanded Georgia find him votes? Now, he is demanding red  States find him more seats in Congress.\n\nAll this for what? So Donald Trump can enrich himself and his  billionaire allies while everyday, hardworking Americans pay…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694808/northeast-ohioans-are-getting-squeezed"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…poorer, Republicans are set to give their  billionaire donors new tax breaks.\n\nProtecting Medicaid is essential to our communities. That is why  House Democrats and I are demanding an up-or-down vote to protect it.\n\nI call on my Republican colleagues to join House Democrats in signing  our discharge petition to protect Medicaid for their constituents…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691188/protect-medicaid"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…Initiative, our Nation's largest and most consequential  women's health study.\n\nMillions of women's lives are at stake. That is why I led my  Democratic Women's Caucus colleagues in demanding that Trump  immediately reverse course. I am relieved to announce that the  administration heeded our call and the heartfelt appeals of our  constituents and restored this…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690578/protecting-womens-health-research"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…O'Neill having earned       his commission through Officer Candidates School, has       distinguished himself through the successful completion of       this rigorous and demanding course of instruction,       demonstrating outstanding physical endurance, tactical       proficiency, and unwavering dedication to the values of the       Marine Corps;…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694090/congratulating-second-lieutenant-jack-c-oneill-on-his-graduation-from-the-basic-school"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…this repeal because they know reducing waste makes business  sense. How is that? Because the customers for our gas around the  world--Korea, South Korea, Japan, the EU--are demanding cleaner gas.\n\nThese companies know that the methane fee demonstrates that our gas  is cleaner. Also, the consumer demand from those customers has led to  the development…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688174/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…groceries for their kids?  They are trying to decide whether they can afford to go to the doctor.\n\nWhile that is happening, in real time, my colleagues are spending  time demanding more work requirements for Medicaid recipients when we  know that almost half of adults on Medicaid are already working. They  act like they are not working. They are working,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691416/gop-tax-scam-hurts-everyone"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…disproportionate and inflexible prison sentences.\n\nThis is why the Judicial Conference itself opposes mandatory  minimums. This is why you don't have judges at the border demanding the  gentleman's legislation. This is why the Brennan Center opposes it.  This is why Right On Crime has opposed mandatory minimums and so on.\n\nStudy after study has shown…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…here to do, which is to lower costs.  That ends today.\n\nEvery Member now has to go on record. Do they stand with the  disastrous trade war or with their constituents who are demanding  relief? It is time we end this so-called national emergency because the  only emergency here is the economic one created by Donald J. Trump's  tariffs.\n\nI urge the adoption…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…article V, the collective defense provision that has kept most of  Europe peaceful for 75 years. He has treated longstanding security  commitments as protection rackets, demanding payment as if our allies  were vassal states rather than partners. And he has done all this while  praising Viktor Orban, Vladimir Putin, Xi Jinping, and other dictators.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700183/state-of-the-union-address"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "Ms. POU. Mr. Speaker, across New Jersey and our country, Americans  are struggling with skyrocketing energy costs and are demanding relief.  Yet, that did not stop the congressional Republicans from repealing the  Energy Efficient Home Improvement Credit, a major mistake that could  not have come at a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694884/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…Belarus, Sudan, and Hungary--a group of countries I never would like us  to be associated with, in voting against the United Nations resolution  condemning Russian aggression and demanding the immediate withdrawal of  Putin's forces from Ukraine.\n\nTo quote my Republican colleague and dear friend, Congressman   Don  Bacon: The Trump administration royally screwed…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…illegal population costs American  taxpayers an estimated $160 billion a year. It flooded classrooms with  non-English-speaking students, packed emergency rooms with illegals  demanding care, and overwhelmed homeless shelters and food banks meant  to help Americans. Worst of all, the most violent and dangerous  criminal gangs in the world accompanied this…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694126/sorry-not-sorry-for-immigration-enforcement"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Pennsylvania.\n\nI talked to Immigration and Customs Enforcement today and asked them,  because there were claims that enforcement officers were chasing people  down the street, demanding their papers, going door to door looking for  people, staking out certain activities, business activities, or  recreational activities to just see who would come in and ask…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…brought accountability by securing  the border, supporting law enforcement, strengthening the rule of law,  shrinking the Federal bureaucracy, cutting wasteful spending, and  demanding accountability for every taxpayer dollar. We are seeing it in  real time. Finally, things are happening.\n\nWe have rebuilt American strength at home and abroad, revitalizing…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…Corps. When he entered  Active Duty, 2 years later, he transitioned to the Infantry.\n\nFrom the outset, General Mingus' trajectory took him through some of  the Army's most demanding assignments. He commanded and served in  positions that required courage, initiative, and an unwavering sense of  duty. Those early assignments prepared him for service in…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699779/9999"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "Mr. LOUDERMILK. Mr. Chair, our Armed Forces face an ever-evolving  landscape of warfare demanding servicemembers who are capable of high  performance under extreme operational stress, yet we face a readiness  crisis. Suicide rates remain high. One in four servicemembers…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693650/department-of-defense-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…children to study after dark,  families to preserve food, and elders to live with greater comfort.  Despite daunting challenges and limited equipment, the WREC team  completed a demanding project in just eight days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life-changing mission.\n\nThe impact of…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692592/recognizing-gary-steele"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…can't seem to get it to sink in, but that is the  underlying math.\n\nWhat should also be scaring people to death, yet the hallways are  full of people coming into our offices demanding more money, the United  States now is like number 12 or 13 on the credit stack, meaning take a  look, Greece today can sell a 10-year bond cheaper than the United  States.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…earned the nickname ``The Rocket City'' because innovation and  national defense are in our DNA.\n\nSpace Command is charged with ensuring America's superiority in the  most demanding, contested domain of the future. To protect the United  States, we need a headquarters located where talent, research, and  mission readiness intersect. With the support…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695727/congratulating-lieutenant-general-robert-a-rasch-jr"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…children to study after dark,  families to preserve food, and elders to live with greater comfort.  Despite daunting challenges and limited equipment, the WREC team  completed a demanding project in just eight days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life- changing mission.\n\nThe impact of…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692514/recognizing-kevin-vaughn"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…policy changes. It merely kept the  government operating at current levels while we finished debating  priorities.\n\nDemocrats deliberately blocked the Senate from acting, demanding $1.5  trillion of new spending as a ransom. Finally, thank God, eight of them  put country ahead of party and voted to end this madness.\n\nHearing the bitter recriminations…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696689/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…corporation  kept raking in more profits and didn't seem to care at all about their  paying customers.\n\nThankfully, under pressure, that blackout has ended, and we are now  demanding Optimum, the telecom, the main perpetrator of this, pay back  the customers who were harmed.\n\nI have also introduced something called the Stop Sports Blackout Act  so if…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689084/economic-populism"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…actually would like to sit here for 1  hour or 2 to regale him with charts, but I have to go do another thing.\n\nMr. Speaker, I am here right now because the American people are  demanding that we, the elected leaders in Washington--that we in the  people's House--that we secure the elections of the United States. They  are tired of wondering whether their…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699673/united-states-fiscal-situation"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…administration, and  96 percent of the Democrats voted for it. Now they can't vote for a  clean resolution. How do you explain that?\n\nUnfortunately, Democratic leadership is demanding more than $1  trillion in new spending just to keep the government open. So instead  of voting for this clean CR, they want more than $1 trillion in new  spending in a CR…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696017/9999"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…resource and infrastructure development.  Our oil fields on Alaska's North Slope offer a world-class example of  what it means to responsibly produce energy in a harsh and demanding  environment. The environmentally conscious way in which Alaskans have  applied cutting-edge technology is second to none, utilizing ice roads  and a winter construction…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…children to study after dark,  families to preserve food, and elders to live with greater comfort.  Despite daunting challenges and limited equipment, the WREC team  completed a demanding project in just eight days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life-changing mission.\n\nThe impact of…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692444/recognizing-stephanie-wilson"}]