[{"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Speaker, there is no demand for this.", "title": "Protecting Education for Children with Disabilities", "date": "2026-01-13"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "At every turn, this body had the opportunity to exercise oversight  and demand accountability, and at every turn, we failed to do so.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "Because the customers for our gas around the  world--Korea, South Korea, Japan, the EU--are demanding cleaner gas.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Waste Emissions Charge for Petroleum and Natural Gas Systems: Procedures for Facilitating Compliance, Including Netting and Exemptions''", "date": "2025-02-26"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "In addition to ongoing efforts to shutter regional offices,       with no detailed or communicated plans as to where those       offices will be relocated or when, SBA has also slashed its       workforce by 43%, further restricting the agency's ability to       meet the growing demands of today's small businesses.", "title": "American Entrepreneurs First Act of 2025", "date": "2025-06-06"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "Since current law requires the IRS to send a notice and demand for  payment of tax within 60 days of processing a tax filing, individuals  in disaster zones who file early but wait to pay often get confusing  notices and demands for payment.", "title": "Disaster Related Extension of Deadlines Act", "date": "2025-03-31"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Speaker, on that I demand the yeas and nays.", "title": "No Rogue Rulings Act of 2025", "date": "2025-04-09"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "The International Energy Agency estimates that mineral demand for  clean energy technology will almost triple by 2030 and quadruple by  2024.", "title": "Securing America's Critical Minerals Supply Act", "date": "2026-02-11"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Let me thank our region's farmers, processors, and growers for bringing  together leaders from the biofuels industry, ag commodity groups, Ohio  Farm Bureau, and refineries to hear directly about the increase in  demand and production for biofuels as a new initiative every day to  increase income for farmers as they lose export markets due to tariffs.", "title": "Northwest Ohio Biofuels Summit", "date": "2025-12-15"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "Speaker, I demand a recorded vote.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Speaker, on that I demand the yeas and nays.", "title": "Providing for Consideration of H.R. Support for Patients and Communities Reauthorization Act of Providing for Consideration of H.R. Save Sba From Sanctuary Cities Act of Providing for Consideration of H.R. American Entrepreneurs First Act of and Providing for Consideration of H.R. Capping Excessive Awarding of Sblc Entrants Act of 2025", "date": "2025-06-04"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Forecasts for electricity demand also seem to be increasing by the  day, and that is why it is critically important that we have  transparency into where the hangups are in the hydropower licensing  process.", "title": "Hydropower Licensing Transparency Act", "date": "2025-07-14"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "It demands that  insurance companies cover most preventative services.", "title": "Providing for Consideration of H.R. Student Compensation and Opportunity Through Rights and Endorsements Act; Providing for Consideration of H.R. Combating the Lies of Authoritarians in School Systems Act; Providing for Consideration of H.R. Transparency in Reporting of Adversarial Contributions to Education Act; Providing for Consideration of H.R. Promoting Responsible Oversight to Eliminate Communist Teachings for Our Kids Act; Providing for Consideration of H.R. Small Business Regulatory Reduction Act of Providing for Consideration of H.R. Destroying Unnecessary, Misaligned, and Prohibitive Red Tape Act", "date": "2025-12-02"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "He served terms on the Haymarket Town Council  and Planning Commission and over 2 years on the County Board of  Supervisors, all focused on empowering his constituents in Prince  William County to demand the best from their elected officials.", "title": "Recognizing the Remarkable Work of Sewa International", "date": "2025-07-21"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "Speaker, on that I demand the yeas and nays.", "title": "Promoting Efficient Review for Modern Infrastructure Today Act", "date": "2025-12-11"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "Speaker, on that I demand the yeas and nays.", "title": "Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Walk-In Coolers and Walk-In Freezers''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Office of Energy Efficiency and Renewable Energy, Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Commercial Refrigerators, Freezers, and Refrigerator-freezers''; Providing for Consideration of H.R. Defending Education Transparency and Ending Rogue Regimes Engaging in Nefarious Transactions Act", "date": "2025-03-25"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "Chair, I demand a recorded vote.", "title": "Amendment No. 1 Offered By Mr. Massie", "date": "2026-01-22"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "Furthermore, customers now demand advanced technological  features, such as mobile and online banking, which require substantial  capital investments.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Office of the Comptroller of the Currency of the Department of the Treasury Relating to the Review of Applications Under the Bank Merger Act", "date": "2025-05-20"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Those are the  very people filling up these hallways, demanding we give them more  money.", "title": "Economic Anxiety", "date": "2025-05-01"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "While natural gas demand is  expected to reach an all-time high, accounting for more than 40 percent  of electric generation in the U.S.", "title": "Improving Interagency Coordination for Pipeline Reviews Act", "date": "2025-12-12"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "Speaker, on that I demand the yeas and  nays.", "title": "Haiti Economic Lift Program Extension Act", "date": "2026-01-12"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "Put simply, we do not have enough homes  to meet the demand.", "title": "Lowering Housing Costs and Advancing Main Street Community Banks", "date": "2026-02-09"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "Madam Speaker, on that I demand the yeas and nays.", "title": "Veterans Readiness and Employment Improvement Act of 2025", "date": "2026-02-02"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "Offenders, often overseas or even juveniles, groom victims and then  weaponize images or AI-generated deepfakes pulled from public photos to  demand payment or further abuse.", "title": "Combating Online Predators Act", "date": "2026-01-12"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Speaker, on that I demand the yeas and nays.", "title": "Providing for Consideration of H.R. 2550 to Nullify the Executive Order Relating to Exclusions From Federal Labor-Management Relations Programs, and for Other Purposes", "date": "2025-12-10"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "(b) If a third of the members present so demand, a recorded       vote will be taken on any question by roll call.", "title": "Joint Committee of Congress on the Library Rules of Procedure", "date": "2025-03-12"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "As the Coast Guard faces increasing demand for its services, the bill  authorizes the service to grow to 55,000 Active-Duty members by 2027  and supports the training, assets, and programs necessary to attract,  retain, and advance the personnel needed to carry out the Coast Guard's  missions.", "title": "Disinterment of Remains of Fernando V. Cota From Fort Sam Houston National Cemetery, Texas", "date": "2025-12-10"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "Speaker, on that I demand the yeas and nays.", "title": "Protecting Prudent Investment of Retirement Savings Act", "date": "2026-01-15"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "3174 is essential to keep pace with demand for capital and bring  jobs back to the U.S.", "title": "Made in America Manufacturing Finance Act", "date": "2025-12-01"}, {"senator": "John Rose", "party": "Republican", "sentence": "By establishing this regulatory clarity, this bill will  drive significant demand for stablecoins.", "title": "Anti-Cbdc Surveillance State Act", "date": "2025-07-17"}]