[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…this is a hard-working lady. I have come to know what  it means to be in your sixties and still working as a busy waitress in  a busy restaurant. It isn't easy, physically demanding. She has had  orthopedic surgeries and other problems occasioned by the fact that it  is just an act of life. At a time when most of us would like to think  we are going…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…affect people's lives and about drawing a clear line between a  political system that serves billionaires and one that serves people.\n\nAmericans see this clearly. They are demanding transparency. They are  demanding accountability. They are demanding a government that answers  to voters, not to the billionaires and not to the special interests.\n\nThat…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699113/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…well-connected, is above the law.\n\nMr. VEASEY. Mr. Speaker, in our America, no one is beyond  accountability. We will not forget. We will not look away. We will not  stop demanding the truth.\n\nWe demand the immediate release of the Epstein files--no more games,  no more lies, and no more protection for predators hiding behind the  rich and powerful.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693547/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…is required of us.\n\nAgain, our hearts go out to the Kirk family and, certainly, the  families of the students at Evergreen High School in Colorado.                         Demanding Answers from DOGE\n\nMr. LARSON of Connecticut. Madam Speaker, I rise this morning because  Democrats have introduced a resolution of inquiry to get the  information  from…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695464/condolences-to-the-family-of-charlie-kirk"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Mr. RASKIN. Mr. Speaker, I thank Mr. McGovern for yielding.\n\nThe American people across the political spectrum are now demanding  the release of the complete Epstein file. This is what President Trump  and Vice President Vance and the whole Trump team was demanding up  until the last couple of weeks…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693713/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…administration needs to keep its word to deliver this food  aid. The money is available so that lives can be saved.\n\nThis is the 2lst time that I have spoken on the House floor demanding  that the Trump administration restore emergency food aid. I will  continue to speak every legislative day until they do it.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692483/funding-for-edesias-plumpynut"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…this repeal because they know reducing waste makes business  sense. How is that? Because the customers for our gas around the  world--Korea, South Korea, Japan, the EU--are demanding cleaner gas.\n\nThese companies know that the methane fee demonstrates that our gas  is cleaner. Also, the consumer demand from those customers has led to  the development…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688174/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…whatever from any  king, prince, or foreign state.''\n\nThat is Donald Trump's new business, to go collect foreign government  emoluments.\n\nI hope my colleagues will join us in demanding that he come to  Congress to ask for permission to keep that $400 million bug-riddled  airplane that he wants to fly around on somebody else's tab. It is  absurd, the lengths…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…Institute.\n\nFor over 50 years, every major medical breakthrough that has happened  in the treatment of cancer has been linked to our Federal investments.  Americans are not demanding that we cut money to fund cancer research,  Mr. Speaker, I promise you that. They are not calling for these cuts.\n\nOf course, as the irrepressibly cheerful Joni Ernst reminded…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691727/republican-budget-will-make-us-sicker"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Chamber want to go back in time, not because the policy failed but  because it succeeded.\n\nImagine if, just after Henry Ford unveiled the Model T, Congress  passed a resolution demanding we double down on bigger, stronger  horses, because that is what this is--a deliberate attempt to deny the  future because it threatens the status of Big Oil.\n\nThe President…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691621/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…The House passed  this bill last week by 230 to 196, and 17 Republicans joined Democrats.  That is not a fluke. That is a glaring signal to Republicans that  Americans are demanding relief.\n\nFifty percent--55 percent of Trump voters want the tax credits  extended, but the Republican Senate is blind, is in a bubble, is not  even understanding the anguish…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…O'Neill having earned       his commission through Officer Candidates School, has       distinguished himself through the successful completion of       this rigorous and demanding course of instruction,       demonstrating outstanding physical endurance, tactical       proficiency, and unwavering dedication to the values of the       Marine Corps;…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694090/congratulating-second-lieutenant-jack-c-oneill-on-his-graduation-from-the-basic-school"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…supporting the release of the  Epstein files. Any effort to block their release is simply continued  coverup for our Nation's elites.\n\nWhile I stand here on the Senate floor demanding answers, House  Republicans have run for the exit, ended their term early, skipping  town early to avoid taking up any more discussion about Epstein and the  files. They…", "date": "2025-07-24", "source_url": "https://justfacts.votesmart.org/public-statement/1694235/9999"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…and the President knows it. That is why he is  changing the rules in the middle of the game. Need I remind you, 4  years ago, he demanded Georgia find him votes? Now, he is demanding red  States find him more seats in Congress.\n\nAll this for what? So Donald Trump can enrich himself and his  billionaire allies while everyday, hardworking Americans pay…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694808/northeast-ohioans-are-getting-squeezed"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…do the job.\n\nWhat is that job? To make sure that we are being their voice and  speaking out for them. And part of that has to be asking questions.  Part of that has to be demanding accountability, has to be getting  information so we can do the best job possible.\n\nIt is unacceptable that a U.S. Senator, in his own home State,  elected by millions of…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692471/alex-padilla"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…policy changes. It merely kept the  government operating at current levels while we finished debating  priorities.\n\nDemocrats deliberately blocked the Senate from acting, demanding $1.5  trillion of new spending as a ransom. Finally, thank God, eight of them  put country ahead of party and voted to end this madness.\n\nHearing the bitter recriminations…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696689/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Pennsylvania.\n\nI talked to Immigration and Customs Enforcement today and asked them,  because there were claims that enforcement officers were chasing people  down the street, demanding their papers, going door to door looking for  people, staking out certain activities, business activities, or  recreational activities to just see who would come in and ask…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…brought accountability by securing  the border, supporting law enforcement, strengthening the rule of law,  shrinking the Federal bureaucracy, cutting wasteful spending, and  demanding accountability for every taxpayer dollar. We are seeing it in  real time. Finally, things are happening.\n\nWe have rebuilt American strength at home and abroad, revitalizing…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…Corps. When he entered  Active Duty, 2 years later, he transitioned to the Infantry.\n\nFrom the outset, General Mingus' trajectory took him through some of  the Army's most demanding assignments. He commanded and served in  positions that required courage, initiative, and an unwavering sense of  duty. Those early assignments prepared him for service in…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699779/9999"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "Mr. LOUDERMILK. Mr. Chair, our Armed Forces face an ever-evolving  landscape of warfare demanding servicemembers who are capable of high  performance under extreme operational stress, yet we face a readiness  crisis. Suicide rates remain high. One in four servicemembers…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693650/department-of-defense-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…children to study after dark,  families to preserve food, and elders to live with greater comfort.  Despite daunting challenges and limited equipment, the WREC team  completed a demanding project in just eight days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life-changing mission.\n\nThe impact of…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692601/recognizing-sean-mckillen"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…took us 240 years to build, we will double in 10 years,  or come close to doubling in 10 years.\n\nDoes this body, the lobbyists in the hallways, the groups in the  hallways demanding more spending, or any of the staffers who might not  have a life so they are watching this really think that the bond  markets aren't going to go: They are doubling U.S.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…earned the nickname ``The Rocket City'' because innovation and  national defense are in our DNA.\n\nSpace Command is charged with ensuring America's superiority in the  most demanding, contested domain of the future. To protect the United  States, we need a headquarters located where talent, research, and  mission readiness intersect. With the support…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695727/congratulating-lieutenant-general-robert-a-rasch-jr"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…children to study after dark,  families to preserve food, and elders to live with greater comfort.  Despite daunting challenges and limited equipment, the WREC team  completed a demanding project in just eight days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life-changing mission.\n\nThe impact of…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692515/recognizing-cody-thomas"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…illegal population costs American  taxpayers an estimated $160 billion a year. It flooded classrooms with  non-English-speaking students, packed emergency rooms with illegals  demanding care, and overwhelmed homeless shelters and food banks meant  to help Americans. Worst of all, the most violent and dangerous  criminal gangs in the world accompanied this…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694126/sorry-not-sorry-for-immigration-enforcement"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…corporation  kept raking in more profits and didn't seem to care at all about their  paying customers.\n\nThankfully, under pressure, that blackout has ended, and we are now  demanding Optimum, the telecom, the main perpetrator of this, pay back  the customers who were harmed.\n\nI have also introduced something called the Stop Sports Blackout Act  so if…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689084/economic-populism"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…of President Trump's top priorities, and  that is to secure our elections and to make sure only citizens vote.  That is not controversial. That is the standard voters are demanding.\n\nLet's do what is right. Let's pass this rule and move the bill  forward.\n\nMr. ROY. Mr. Speaker, I would note that when the gentleman from  Massachusetts tries to dismiss…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…administration, and  96 percent of the Democrats voted for it. Now they can't vote for a  clean resolution. How do you explain that?\n\nUnfortunately, Democratic leadership is demanding more than $1  trillion in new spending just to keep the government open. So instead  of voting for this clean CR, they want more than $1 trillion in new  spending in a CR…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696017/9999"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…resource and infrastructure development.  Our oil fields on Alaska's North Slope offer a world-class example of  what it means to responsibly produce energy in a harsh and demanding  environment. The environmentally conscious way in which Alaskans have  applied cutting-edge technology is second to none, utilizing ice roads  and a winter construction…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…children to study after dark,  families to preserve food, and elders to live with greater comfort.  Despite daunting challenges and limited equipment, the WREC team  completed a demanding project in just eight days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life-changing mission.\n\nThe impact of…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692424/recognizing-john-blaho"}]