[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…restaurant is going to  face premiums she and her husband cannot afford.\n\nTo be sure, what the GAO found is unacceptable. But there are  proposals on the table that Democrats would support to crack down on  malicious brokers who fraudulently enroll customers. No excuse--that  has got to stop. I will be part of it, on a bipartisan basis, if we get  that…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…dollars, not give them $82,000 a year in tax  breaks.\n\nBy the way, the tax breaks for those millionaires and billionaires  are permanent over 10 years. The tax breaks the Democrats support for  working-class families, like no tax on tips, they only want them for 4  years. Democrats have been fighting to get the no tax on tips for 10  years. Republicans…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691530/tax-cuts"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…The vast majority of American people support prohibiting  nonconsensual, sexually explicit, deepfake images, with one survey  finding that 85 percent of Republicans and Democrats support this  measure. That is why I am hopeful it will pass today and be considered  favorably by the House, and that is why, last Congress, the Senate  unanimously passed this…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…over a year ago, the Senate voted for $18 billion in defense  aid to Israel. On the Democratic side, the vote was 47 to 4. On the  Republican side, the vote was 22 to 27. Democrats support defense aid  to Israel.\n\nThis is not a vote to retract a single dollar of that $18 billion in  aid; it is a vote to say that defense aid to Israel, which Democrats  overwhelmingly…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694436/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Mariannette J. Miller-Meeks, Earl L. ``Buddy'' Carter,   Dan Newhouse,  Erin Houchin, and David P. Joyce all write in support of a clean energy  economy.\n\nAs House Democrats, we support--we know that there is an all-of-the- above approach that is underway right now--wind and solar energy and  renewable energy because renewable energy is cheaper energy.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…American families really need.\n\nHere are some of those policies that the congressional Democrats  would bring to the floor if we had four more Members in our Caucus:\n\nDemocrats will support working families. The first thing we will do  to support working families is to expand the child tax credit.\n\nRanking Member Rosa DeLauro's American Family Act will…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…billionaire donors like Elon Musk. The  President himself has made that clear. At the end of the day, that is  what this is all about. How extraordinary is that?\n\nAs Democrats, we support tax cuts for everyday Americans, tax cuts  for small businesses, tax cuts for family farmers, and tax cuts for  those who need relief, not tax cuts for the wealthy,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689902/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…reactors in this country.  They deserve the right to organize.\n\nI do agree. I hope the American public is watching and listening to  our Republican colleagues and our Democrats support our Federal  workers.\n\nTlaib).\n\nMr. GARCIA of California. I yield 1 minute to the gentlewoman from  Michigan (Mrs. Dingell).\n\nMr. Speaker, I will be brief.\n\nCongress…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697981/protect-americas-workforce-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…doctors and patients instead of insurance companies and big regulators.  I support this legislation. I know my Republican colleagues do. The  question really is: Will Democrats support this legislation, or will  they wish to perpetuate the shutting down of government to enrich  insurance companies?", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696681/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…urge my colleagues to support this legislation, and I  reserve the balance of my time\n\nMr. Speaker, it is a shame. Instead of trying to score political  points, the Democrats should support our efforts to address supply  chain vulnerabilities that Communist China actively exploits to the  detriment of these American people that we serve.\n\nMr. Speaker,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699990/securing-americas-critical-minerals-supply-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…back to what we do to honor and respect law enforcement on  this Police Week.\n\nMs. LEGER FERNANDEZ.\n\nWe have heard a lot of claims today, but here is what remains true.  Democrats support law enforcement, not just with words, but with  action, with our votes. We back them with funding, with resources, and,  importantly, with respect.\n\nThat is why, under…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…this. An overwhelming 83 percent of  Americans are in favor of requiring a photo ID to vote. That is not  Republicans. That is all across the spectrum. Over 70 percent of  Democrats support picture ID, 82 percent of Hispanic Americans support  picture ID to vote, and 76 percent of Black Americans support a picture  ID to vote.\n\nIf they still want to lie…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700016/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…are for.\n\nSo he goes on and on about different things in the bill. Let's get  down to the purpose of the bill, and it is to prevent a $4 trillion tax  increase that the Democrats support.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689741/the-economy"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…should be able to responsibly produce what it needs here  at home instead of outsourcing our future to foreign powers.\n\nInstead of trying to score political points, Democrats should support  efforts to close the supply chain vulnerabilities that Communist China  actively exploits to the detriment of the American people.\n\nIf Democrats were serious about…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…radical gender, lunatic ideology. Our women in uniform  shouldn't be forced to suffer indignities to appease the insane  policies of the other side of the aisle, all the Democrats who support  this nonsense.\n\nAllowing delusional men to use women's restrooms, locker rooms, and  changing rooms is an affront to women, and it is reckless.\n\nIn Virginia, a registered…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…enforcement.\n\nLast year, I think all of the Republicans and the vast majority of my  Democratic colleagues supported this very measure. I hope that this  year even more Democrats will support it and that it will be signed  into law because this data is incredibly important to make sure that we  protect our law enforcement officers. This is just a small way…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}]