[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…And now  this.\n\nAll of us have lived as part of a generation since World War II that  was used to seeing our freedoms ever expanding. We saw walls coming  down. We saw new democracies being born. We came to think that somehow  this was inevitable like the laws of nature; that it was the moral arc  of the universe always bending toward justice, only to…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692501/alex-padilla"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…to our own Nation's defense.\n\nWhen we step back, our adversaries, like China, step in to save the  day in the developing world. That is bad for the United States and for  democracies all across the globe.\n\nMr. Speaker, I call on the Trump administration, once again: Restore  lifesaving food aid for children.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695224/restore-lifesaving-food-aid-for-children"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…of the IGs and getting rid of all of the  referees.\n\nIn the book that I really spent the night trying to use as a  framework in order to say, hey, experts have studied how democracies  die--they don't die with people with guns anymore; they die with people  who get elected, and then they follow the authoritarian playbook on how  to basically undo the…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696355/trump-administration"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…take on this client who is antagonistic to me, you  shall not hire this lawyer who is a personal enemy of mine--that is  antithetical to the history of our democracy and all democracies.\n\nJohn Adams, prior to becoming President, took on one of the most  unpopular cases in American history, representing British soldiers who  had participated in the Boston…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696336/trump-administration"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…it comes to  Ukraine and supporting our allies abroad, but their fealty to Vladimir  Putin doesn't mean the United States can resign its role in standing  for Ukraine and democracies around the world.\n\nWashington Republicans need to get it together. My colleagues on the  other side of the aisle control the White House and Congress. If we  have a government…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688483/disastrous-implications-of-a-yearlong-cr"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…mobilization, we could be saved.\n\nBut I didn't breathe a sigh of relief. It was the opposite.\n\nI am deeply worried that we have really spent little time studying  the paths that democracies take when they collapse. Most of the time,  there is not a singular moment when the Executive dramatically seizes  power. There is not normally a brazen attempt to burn…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…delineated.\n\nBut that can't happen unless Congress exercises its oversight  ability.\n\nOK. We have Chapter 8. So we are headed back to the book, and the  book is this book, ``How Democracies Die.'' And with each chapter, I am  trying to give some sense of the chapter but not every element of it.  So I will read some of the pages, maybe scan through some others,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…She told me she  doesn't think it is fair to shift the cost of care to families like  hers to pay for tax cuts to the wealthy.\n\nYou know, that is the incredible thing about democracies: People  write  in, they send emails, they call our offices, they show up at townhall  meetings, and they tell us what they think.\n\nIn this email, she said:\n\nWe need to…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689542/h-con-res-14"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…that is sort of where we are headed right  now, where you are going to have such a concentration of wealth.\n\nThere are countries that have that right now, today, and those  democracies are not functioning democracies. Some of them don't even  call themselves democracies anymore, or don't even try to consider  themselves democracies, where you have the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…massive hole they are blowing in  the deficit with tax giveaways for billionaires. Their so-called fiscal  responsibility comes at the expense of starving children, crumbling  democracies, and public-private partnerships that channel American  innovation to solve the world's toughest challenges.\n\nMr. Speaker, foreign assistance, which has long represented…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…Crockett to  ensure that our community members are not approached or detained by  unidentified Federal agents. Without identification, there is no  accountability. That is how democracies erode, and we will not allow  it.\n\nTrump wants America to believe that his cruelty makes us safer. It  does not. When communities live in fear, they cannot trust law  enforcement.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697452/fighting-dhs-immigration-raids"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…it should.\n\nTrump's strategy rejects leading with democratic values in favor of  making short-term, transactional alliances. It is a complete  abandonment of the idea that democracies should stand together against  authoritarian governments.\n\nAnd while it is foolish and shortsighted, it is also not surprising  to hear Defense Secretary Hegseth recently…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…type of corruption that our country travels the world to  root out. At its core, it is as antidemocratic as it gets. It is the  stuff of dictators and strongmen and not of democracies.\n\nEven worse, he is attacking our basic and fundamental right of due  process. That is the right to have any allegation presented before a  neutral arbiter who makes a final…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…Affairs Subcommittee on South and Central Asia to sound  the  alarm about the deterioration of our strategic partnership with India  at the hands of Donald Trump.\n\nAs two major democracies and economies, U.S.-India cooperation is  essential to advancing our mutual interests and confronting our shared  competitors.\n\nPresident Biden took the relationship to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695025/trump-must-reverse-course"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Montenegro, New Zealand, North Macedonia, Norway, Portugal, Romania,  Slovakia, Spain, and Sweden.\n\nWith this resolution, House Republicans are sending a message to many  proud democracies, including multiple members of the North Atlantic  Treaty Organization (NATO), that we condemn the domestic political  process within their nations. As Ranking Member of…", "date": "2025-11-28", "source_url": "https://justfacts.votesmart.org/public-statement/1697166/denouncing-the-horrors-of-socialism"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…from Iranian domination for  independence, achieving stability with prosperity.\n\nDictators around the world are losing in the war of dictators with  rule of gun invading democracies with rule of law. War criminal Putin  is failing in Ukraine with Ukrainians inspired by President Volodymyr  Zelenskyy.\n\nIn Georgia, the legitimate president, Salome Zourabichvili,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…Carter and former Secretary of State James Baker came out in  support of photo ID requirements more stringent than what Indiana had  at that time. ``Voters in nearly 100 democracies use a photo  identification card without fear of infringement on their rights,'' the  commission stated.\n\nIn regard to voter registration fraud, just last year, six people…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699945/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…once confided to her sister: ``I don't know how it happens, sister,  but I meet with nobody but myself that is always in the right.'' He was  reminding his colleagues that democracies were never designed to make  perfect decisions, only the most acceptable ones to the most people.\n\nMy disappointment in the Senate version before us is vast, but it has…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689900/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…And they are a very different country than the  United States is.\n\nThe world, I think, is very quickly developing into a bipolar  position, where, on the one hand, you have democracies and semi- democracies like the United States, made of up of free people, of  capitalism, of free markets, of entrepreneurs, and of people who very  much value human rights…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690343/9999"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…Secondly, he has not brought Ukraine into Russia's orbit.  Ukraine and its people have overwhelmingly moved philosophically  further from Russia and toward the civilized democracies of this world.\n\nPutin is failing, but he still peddles the lie that Russian victory  is right around the corner. And some American voices are repeating this  misinformation.…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699762/9999"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…shelter and       hospitality to Uyghurs and other minority group members in       exile, as Turkey, Albania, and Germany have done;\n\n(6) urges all countries, especially fellow democracies and       those with sizeable Muslim populations, to condemn and       address the plight of Uyghurs and other minority communities       in the XUAR;\n\n(7) the Government…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}]