[{"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "So Representatives Kelly, Lee, Bass, Pressley and I have a bill to require the CDC to collect and to make public COVID-19 demographic data -- including race and ethnicity."}, {"senator": "Gary C. Peters", "party": "Democrat", "sentence": "He pressed the Trump Administration's Coronavirus Task Force to release comprehensive data about the racial and ethnic impact of the virus and introduced a bill requiring HHS to report demographic data about testing, treatment, and outcomes of the pandemic."}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "Senator Tammy Baldwin today joined Senator Elizabeth Warren (D-MA) in introducing the bicameral Equitable Data Collection and Disclosure on COVID-19 Act, which would require the Department of Health and Human Services (HHS) to collect and report racial and other demographic data on COVID-19 testing, treatment, and fatality rates, and provide a summary of the final statistics and a report to Congress within 60 days after the end of the public health emergency."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "The group also discussed efforts to increase testing capabilities, improve the unemployment insurance program,  increase funding for state and local governments, and combat health disparities by working with hospitals and a range of neighborhood stakeholders in underserved and highly infected areas, including their call to publish demographic data on COVID-19 cases and deaths on the Centers for Disease Control and Prevention's website."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "Department of Health and Human Services (HHS) to begin reporting nationwide demographic data of cases and deaths related to COVID-19 and utilize this data seek solutions for the systemic health care inequalities worsening this pandemic for communities of color."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "-How do you intend to leverage the demographic data elements identified by ONC as critical for data exchange to improve vaccine surveillance?"}, {"senator": "Catherine Cortez Masto", "party": "Democrat", "sentence": "The STEM Opportunities Act boosts the inclusion of underrepresented groups in science, technology, engineering, and mathematics by:\n\n-Requiring more comprehensive demographic data collection on the recipients of federal research awards and on science, technology, engineering, and mathematics (STEM) faculty at U.S."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "It is also unacceptable that data provided by your Administration does not include data from every state, and there are instances where racial and ethnic data failed to be reported even if other types of demographic data were submitted."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Dear Director Carvajal:\n\nWe write to urge the Bureau of Prisons (BOP) to release critical demographic data as our country continues to confront the coronavirus (COVID-19) pandemic."}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "We've already called on the federal government to expand the collection of racial, ethnic, and other demographic data on coronavirus testing and treatment."}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "(D-NJ) chairman of the House Energy and Commerce Committee, released the following statements criticizing the \"report\" the Trump Administration submitted last Friday on testing and demographic data associated with COVID-19 as required by the Paycheck Protection Program and Health Care Enhancement Act."}, {"senator": "Debbie Stabenow", "party": "Democrat", "sentence": "Department of Health and Human Services (HHS) to collect and report racial and other demographic data about the testing, treatment, and outcomes of COVID-19."}, {"senator": "Marco Rubio", "party": "Republican", "sentence": "The first is, some of the demographic data that is being  asked is not on the application."}, {"senator": "Tim Scott", "party": "Republican", "sentence": "Unfortunately, these reports also point to a patchwork of demographic data that will inevitably hinder our ability to comprehensively analyze or assess disparities in order to aid in our response efforts."}]