[{"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…So to the American people, realize that the Democrats you have  elected see you as pawns and leverage and pieces that they can move  around a chessboard.\n\nAs the Senate Democrat leader said at the beginning of the shutdown,  and I quote him:\n\nEvery day gets better for [Democrats].\n\nThey see this as improving their political chances.\n\nOver the last month,…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…law--no tax on overtime--that means a  lot for the miners and the linemen in Wyoming. They are going to be  able to keep $1,400 more this year in their paychecks.\n\nNow, the Democrat leader, Senator Schumer, was just on the floor, and  he talked about firefighters. Well, firefighters work a lot of  overtime. They need to stay on the job. They do that. No…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699081/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Thune", "party": "Republican", "sentence": "…indications are the Democrats are going to  reject the clean, nonpartisan funding extension here before us and  choose to shut the government down.\n\nNow, my friend the Democrat leader and a number of other Democrats  have spoken at length on many occasions about the pain--the pain--that  government shutdowns cause Americans. Since he mentioned it, I…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695921/continuing-appropriations-and-extensions-and-other-matters-act-2026"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…side, but there is frustration.\n\nI will give you my sense of why there is frustration on the Democrat  side. Usually, in this place, when you run for leader--Democrat leader,  Republican leader--and you are in leadership, there is kind of an  unwritten rule that the leader will protect the broader membership and  broader Members--on votes and different…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696006/en-bloc-nominations"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Now, of course, Democrats would like you to believe that they have  engaged in this historic level of obstruction because the President has  put up, in the words of the Democrat leader, ``historically bad  nominees.'' The only problem is a lot of these nominees have gotten  Democrat votes on final passage. So either Democrats are voting for  ``historically…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698260/nominations"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Mr. President, tomorrow, we are going to be voting on the  Democrats' partisan messaging exercise, which is their 3-year extension  of the Biden COVID bonuses.\n\nNow, the Democrat leader came down here yesterday--and he has a  number of times now--and he has taken anybody who is listening here in  the Chamber and elsewhere from around the country on a…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…Louisiana. Mr. Speaker, I thank the gentleman from  Missouri for yielding.\n\nRonald Reagan said one time that no speech should be longer than 20  minutes, and unlike the Democrat leader, I am going to honor my  colleagues' time and be a little more brief than that.\n\nI just want to say something that many of us learned when we were  children. We were taught:…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…appropriations bills is  going to require cooperation from Democrats. This week, we will get a  glimpse of where Democrats are on this issue.\n\nIt was deeply disappointing the Democrat leader threatened to shut  down the government if Republicans dared to pass legislation to trim  just one-tenth of 1 percent of the Federal budget, but I am hopeful  that is…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693870/trump-administration"}, {"senator": "John Thune", "party": "Republican", "sentence": "…and infant  health, to ensure delivery of essential medical care.\n\nBack in June, a few months before Democrats tried to repeal the Rural  Health Transformation fund, the Democrat leader said:\n\nThis little fund to help reimburse rural hospitals is just       a fraud.\n\nHe should tell that to his State, which applied for the program and  received a $212…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698574/rural-health-transformation-program"}, {"senator": "John Thune", "party": "Republican", "sentence": "…what they have sowed this  Congress. The prospect of the blanket obstruction of every single  nominee of a Democrat President can't look that attractive.\n\nOf course, the Democrat leader has made an attempt to attack  Republicans' measure and defend his party's historic obstruction, and  one thing he is fixated on is his claim that Democrats' historic…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695295/rules-change"}]