[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Representatives and Melissa was a young, determined  candidate running in a district that would be difficult for any  Democrat to win--but she clearly shared our Minnesota values and  demonstrated her ability to form a meaningful connection to her  constituents.\n\nShe didn't win that race, or the next one, but six years later, in  2004 I was thrilled when she won a…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693118/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…are facing and  condemns them without making an effort to score political points.\n\nThis is how bipartisan efforts to combat anti-Semitism should work.  Mr. Van Drew has demonstrated that he certainly is willing to do that  and we are certainly grateful that he worked closely across the aisle  to make sure that this is not a partisan issue.\n\nMr. Speaker,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692173/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…state, or tribal government agencies, or private       landowners, to implement barred owl management. Although FWS       will be one entity implementing the Strategy--as demonstrated       by the issuance of the MBTA Permit to the FWS Oregon Fish and       Wildlife Office--FWS contemplates designating other       governmental and non-governmental entities…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693338/us-government-accountability-office-legal-opinion"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…players are in this coverup. One  person is, quite frankly, a person who merits a lot of accolades. He is  a person who ought to be acknowledged for the courage that he has  demonstrated. He is a person who brought this to the attention of the  public. He is a person who had no desire to be a part of this coverup,  but he is only there in that he was the…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Appropriations Committee Rosa DeLauro,  I introduced a new bill called the Appropriations Compliance and  Training Act. Unfortunately, this Administration has repeatedly  demonstrated their lack of understanding and respect for the direction  provided through the Appropriations process.\n\nThe Power of the Purse rests with the Article I branch here in…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693088/introduction-of-the-appropriations-compliance-and-training-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…focusing on  hiring those with sufficient experience to best serve our veterans.\n\nWe can and should look to staff the Board of Veterans' Appeals with  attorneys that have demonstrated expertise in this area, attorneys who  are experienced and who can see beyond quotas and metrics to apply the  law to the maximum benefit of veterans at the heart of the…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699208/veterans-law-judge-experience-act-of-2025"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…73-year member of First African Baptist Church, Mrs.  Booker has held numerous leadership positions, including Deaconess,  Trustee, and Finance Committee Member, where she has demonstrated her  commitment to spiritual growth and community service. Her involvement  in various initiatives showcases her unwavering dedication to improving  the lives of others.…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694759/recognizing-mrs-juanita-carson-booker"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…political       subdivisions and Tribal governments; targeting engagement       efforts at underrepresented communities; giving priority to       projects based in part on a demonstrated record of and plans       to be in compliance with federal labor and employment laws;       and demonstrating that the Eligible Entities have       sufficiently accounted…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698437/us-government-accountability-office-opinion-letter"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…deposits. While cash might seem safe, if held in a bank,       accounts beyond $250,000 would not enjoy FDIC coverage. The       episode of Silicon Valley Bank's failure demonstrated this       vulnerability. Further, the bill relies on sponsor       certification (or attestation) as to the components of the       reserve. Instead, responsible legislation…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…of Igbo  descendants as they navigate life in the diaspora. From cultural  education and youth mentorship to advocacy and charitable outreach,  ICAN DFW has consistently demonstrated what it means to lead with  purpose and pride.\n\nThe Igbo Day Celebration stands as a vibrant reminder of the strength  and beauty of the Igbo spirit. It is a time to reflect…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694153/recognizing-the-igbo-community-association-of-nigeria-dalles-fort-worth"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…climate is changing, and the changes in the climate are human- caused by fossil fuel emissions. Fossil fuel emissions are the primary  cause.\n\nThese are facts, and they are demonstrated by sound science. Not only  is climate change a demonstrated fact recognized by all sound science  on the topic, but human beings have been aware of this scientific fact…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…stop there. This year's partnership schools  reached their highest math performance ever and matched their strongest  literary results.\n\nFollowing the pandemic, students demonstrated 3 consecutive years of  growth in math and 2 consecutive years of growth in reading.\n\nEvery partnership elementary school advanced in literacy, and nearly  all of them advanced…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695654/partnership-for-la-schools"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…United States  Department of Health, Education, and Welfare and as Special Assistant  for Renewable Energy at the United States Department of Energy. Across  every role, he demonstrated a  rare ability to navigate complexity while keeping the public interest  at the forefront.\n\nMr. Cotton later served as New York State's Special Counselor to the  Governor…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699560/recognizing-rick-cotton-for-a-lifetime-of-leadership"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Well,  fearmonger and tell them that a special interest alien from a criminal  organization is operating a cell in their neighborhood.\n\nThe Trump administration has already demonstrated to us that they are  comfortable, under the guise of national security and protection,  abusing every tool and system that we have. The administration has  weaponized every…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693072/special-interest-alien-reporting-act-of-2025"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…installed pollution controls less. When they  were categorized as a major source, they needed to take steps to  drastically reduce their emissions as much as possible, based on  demonstrated, cost-effective technologies.\n\nIn many cases, that resulted in emission levels dropping far below  the major source thresholds, but the Clean Air Act's intent was never…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691592/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…community. A  lifelong resident of Rockwall County, she has dedicated her life to  public service, community development, and civic engagement. Throughout  her career, she has demonstrated a deep commitment to her hometown,  earning the trust and respect of residents across the county.\n\nMs. Nichol's record of civic service is both extensive and  distinguished.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698359/recognizing-the-success-of-janet-nichol"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Van Zandt Medical Center, where he  worked tirelessly to help local veterans receive their benefits.\n\nIn the true spirit of Semper Fidelis, Lieutenant Peck continually  demonstrated his steadfast loyalty to his fellow veterans and  continually worked to help our Nation become that more perfect Union.\n\nAs we remember Lloyd Peck, we also keep in mind…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688957/president-trump-bringing-back-investments"}, {"senator": "French Hill", "party": "Republican", "sentence": "…support. Since then, the CLARITY Act has  only been further refined and strengthened in terms of legal certainty  and consumer protection.\n\nThis bill, Mr. Speaker, as we have demonstrated over that period of  time, would prevent consumer harm like FTX.\n\nMr. Speaker, I support the bill. I urge my colleagues to support the  bill, and I yield back the balance…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693775/digital-asset-market-clarity-act-of-2025"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…personnel have  safeguarded our Nation since its inception, defending our way of life  from Lexington to Normandy.\n\nAnd throughout our history, American servicemembers have demonstrated  tremendous courage and strength, beating back tyranny to the ends of  the earth.\n\nI was glad to sponsor Jack's nomination, and I am confident that his  talents will distinguish…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692771/congratulating-jack-godbee"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…Fowler. Krysta is an individually registered  member of Girl Scouts of Gulf Coast Florida and has exemplified  extraordinary leadership, innovative problem-solving, and a  demonstrated commitment to making a lasting, positive impact, by  earning the most prestigious award in Girl Scouting, the Gold Award.\n\nGold Award Girl Scouts are recognized as trailblazers…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690422/recognizing-krysta-fowler-gold-award"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Magazine's 100 Most Influential Georgians for 2026.\n\nIn just under a year since assuming the role of president and CEO of  Northeast Georgia Health System, Dr. Hanley has demonstrated  exceptional vision and a relentless pursuit of excellence.\n\nDr. Hanley's seamless transition to leadership continues Northeast  Georgia Health System's remarkable growth,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700076/recognizing-dr-matt-hanley"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…impact their  communities and countless families across the country. It is incredible  how in-depth and thorough their work has been. This determined group of  students has demonstrated an incredible wealth of knowledge of our  democratic system, its key challenges, and what is to come in the  future.\n\nMr. Speaker, as policymakers, we would be wise to take…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689362/recognizing-the-accomplishments-of-the-ninth-district-congressional-youth-council"}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "…will spend no  amount of money--there will be no limit to what they would spend to  stop legislation that they don't want from moving on this floor.\n\nIt is time this body demonstrated its independence. It is time to  demonstrate our loyalty to the people who put us here, not the  corporations that write the checks and call the shots and run the TV  ads…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697735/9999"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…William Boller, who is  retiring after more than four decades of legal and judicial service in  Western New York. Since beginning his public career in 1981, Judge  Boller has demonstrated an unwavering commitment to justice,  professionalism, and fair administration of the law.\n\nJudge Boller began his career with the Erie County Department of  Social Services,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699266/recognizing-the-honorable-m-william-boller"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…expertise in electronics by working on cobra helicopter systems and  subsequently advanced from technician to senior management.\n\nBeyond his professional career, Dennis has demonstrated exceptional  dedication to civic and political engagement. He gave back to his  hometown of Maud by serving as a school board member and city  councilman. He served for…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696848/recognizing-congressional-patriot-award-recipient-dennis-lewis"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…of indebtedness and pay more  on interest than we do on our national defense, to the tune of over  $880 billion in interest.\n\nUnfortunately, many Members of Congress have demonstrated a complete  lack of fiscal discipline and will try to spoil a strong bill that  President Trump himself has endorsed.\n\nThis budget resolution enables us to reach over $4.5…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688091/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Unitary with a steel blast fragmentation case designed for       low collateral damage against point targets. The ER GMLRS       maintains the accuracy and effectiveness demonstrated by the       baseline GMLRS out to a maximum range of 150 km (double that       of the baseline GMLRS) while also including a new height of       burst capability.\n\n5. The…", "date": "2025-10-02", "source_url": "https://justfacts.votesmart.org/public-statement/1695978/arms-sales-notification"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…raise from illicit  drug trafficking to then send it to terrorist organizations in the  Middle East and to threaten peace around the world.\n\nI want to say that what we saw demonstrated by the U.S. military,  working in cooperation with the intelligence community and the  Department of Justice and law enforcement personnel, was nothing short  of magnificent.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…research  security a priority by issuing executive orders and Federal research  security guidance for government agencies like DHS to follow.\n\nDespite this, S&T has not demonstrated how it will protect its $461  million worth of R&D projects from unauthorized access.\n\nEvery taxpayer dollar spent on R&D to improve our national security  should be safeguarded…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688737/research-security-and-accountability-in-dhs-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…strong support of Joshua  Dunlap to serve on the U.S. Court of Appeals for the First Circuit.\n\nJosh is an attorney of extraordinary intelligence, extensive  experience, and demonstrated integrity. He is highly respected in the  legal community throughout the State of Maine, and I urge my colleagues  to support his nomination to the First Circuit.\n\nJosh…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696490/terminating-the-national-emergency-declared-to-impose-global-tariffs"}]