[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…fair game now if the majority adopts  this tact. This vote to expand the power of this expedited process  called the Congressional Review Act will be used to target Democratic  and Republican priorities alike.\n\nI moved to Los Angeles in 1985. I remember what it was like to  breathe the air in Los Angeles in the 1980s. I have seen images of what  the air…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691452/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…and we went down to the White House together to meet with the President  in the Oval Office.\n\nThe meeting was historic. It turned out that others had been  invited--Democratic and Republican Senators and Congressmen--to discuss  the issue, and they, frankly, didn't agree with the conclusions which  we brought to the President.\n\nThe President spoke at…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697820/donald-trump"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…The presidential election was not the only race to attract       large sums of money from secret donors in 2024. The main dark       money groups aligned with the Democratic and Republican       Parties in Congress spent more than $432 million, up from       about $346 million during the 2022 midterms and $320 million       during the 2020 cycle. These…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…arrivals to the Commonwealth by making sure       kids are enrolled in school, adults can find work, and       families are healthy.\n\nIn Washington, DC, I've urged Democratic and Republican       Presidents alike--Democrat and Republican Presidents alike--      to support Haiti. To support Haiti and its efforts to build       the nation, to support a…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699707/congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…the people who live in our States.\n\nI am proud to take part in that important process as a member of the  Senate Appropriations Committee. And I am proud that my Democratic and  Republican colleagues in the committee are working hard to advance  commonsense, bipartisan funding bills that will meet the needs of all  of our communities.\n\nBut Donald Trump…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…conclude is  no way to run a government. Quite frankly, for me personally, I don't  want to turn over the power of the Appropriations Committee to any  executive, Democratic or Republican. I believe that the power of the  purse resides within the Congress. The second option is a shutdown,  which, as we know, is the worst of all possible outcomes.\n\nIt…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the overwhelming majority  of Americans, even the majority of Republicans and Trump voters, want  us to do this.\n\nAnd frankly, to Americans back home, it is not a Democratic or a  Republican issue. The only thing they care about is getting those costs  lower. And they want to know who is going to step up and bring premiums  down. Who is going to lower…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…deputies in Minnesota who addressed a deranged,  extreme perpetrator did their job. We applaud them for their brains and  valor.\n\nRestoring some calm to America is not a Democratic or Republican  challenge. It is an American challenge.\n\nI welcome the suggestion of Sophie and Colin Hortman, children of  slain Minnesota State House Speaker Melissa Hortman and…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692983/lowering-the-temperature"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…what is going on.\n\nI think we have all been hearing the rumors here in Washington, the  breakup rumors. In fact, I think many of us, even on this floor on both  the Democratic and the Republican sides, have heard the rumors that  Donald Trump was getting frustrated with Elon, that he wanted to be on  the helicopter all the time, and that he was following…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692039/consequences-of-doge"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…hard-to- reach places around the world. Until recently, this was being shipped  by USAID to war-torn and famine-torn areas all over the world, saving  lives under Democratic and Republican administrations, until the Trump  administration dismantled USAID. As a result, children are starving  around the world.\n\nHere in the United States, the production…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693021/trump-administration-needs-to-honor-its-word-on-food-aid"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…that helped reduce the global nuclear arsenal from  the Cold War highs of more than 70,000 weapons to fewer than 13,000  today. These agreements were supported by Democratic and Republican  administrations alike because they made the United States safer.\n\nUnder New START, the United States does not rely on guesswork, on  satellite imagery alone, or…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Forest Service have never considered  RMPs to be rules that they would submit to Congress. They have just  never done that, and that has long been the case under both Democratic  and Republican Presidents with precedence being set by those  Presidents.\n\nNow that Congress has decided apparently to disapprove of individual  RMPs, what does that mean for every…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…policy, or economy of the United States--an extraordinary and unusual  threat.\n\nBefore President Trump, what kind of emergencies have been triggered  under IEEPA by Democratic and Republican Presidents? The existence and  activities of transnational criminal organizations, malicious cyber- enabled activities that target the United States, human rights…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…in this institution, to not do things as normal, and to begin  to say that the voices I am reading are of Democrats and Republicans.  The voices I am reading are of Democratic and Republican Governors, of  Democratic and Republican heads of hospitals, of Democratic and  Republican heads of medical associations, of Democratic and Republican  constituencies.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…very mean Trump tweet. By its silence, this Republican  white flag surrender caucus is emboldening our adversaries to replace  the world order established by both Democratic and Republican leaders  since World War II.\n\nIf we fail Ukraine, our democratic ally, we fail the rule of law.  Let's unite to resist the appeasement of Putin and seek a victory…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688131/ukraine"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…must say that I do so with mixed feelings.\n\nOn the one hand, we need a Chairman of the Joint Chiefs of Staff  immediately, and there is overwhelming support on the Democratic side  and Republican side for this nomination.\n\nOn the other hand, passage of this confirmation would pretty much end  our week, and that would prevent us from getting a lot of work…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690110/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…protections, and American  leadership to the evolving world of payment stablecoins.\n\nStablecoin legislation has been in the works for over 4 years and has  been called for by Democratic and Republican administrations. The  status quo fails to protect consumers from fraud. That is an untenable  situation in a market growing by the billions.\n\nFor too long, the United…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693840/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…borrowing, the scale of what is going on. The fact  that most of it is driven by our demographics is giving a little bit of  an excuse. Saying that makes it so it is not Democratic or Republican;  it is just math. At Home, I represent the Scottsdale-Phoenix area. I am  trying to figure out what is going on in our brothers and sisters on  the left's heads.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…nothing and accept the premise that no  deal is possible, that the enhanced premium tax credits go away, that  there are no reforms to a failing system, that a Democratic bill and a  Republican bill both fail like so much fails in Congress, and that the  American people are not served--that is one option--or we can roll up  our sleeves and figure out…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…used  some help with their energy demand.\n\nNot only was this decision completely unnecessary, but it was also  economically and strategically dangerous. Under both Democratic and  Republican administrations, DOE has consistently found that U.S. LNG  exports serve the public interest, contributing positive economic  benefits and strengthening energy security…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697085/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…temporary restraining orders immediately appealable, and reset the  separation of powers. In short, I am trying to fix a bipartisan problem  that has been plaguing both Democratic and Republican administrations  alike.                                  ______\n\nBy Mr. THUNE (for himself and Ms. Klobuchar):\n\nS. 1209. A bill to amend the Federal Crop Insurance…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689309/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…her  in the courtroom.\n\nThe American people shouldn't be robbed of exercising their policy  preferences by judicial extremism, and it would apply evenly to future  Democratic and Republican administrations alike.\n\nThe policies being put forth by the Trump administration are novel,  creative, and bold. That is what the American people expected when they…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…are  going to borrow 7.3 percent of the entire economy this fiscal year, the  fiscal year that we are in right now.\n\nWhen you hear the economists both on the Democratic side and the  Republican side running around saying: We should only be borrowing 3  percent, that would mean almost $1.8 trillion of cuts this fiscal year  to get to a 3 percent borrow.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694954/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…through the math. The constituents  look back and say, so you have been lying or the politicians have been  lying to us for decades. The answer is yes, but it is not Democratic.  It is not Republican. Much of the crisis that we are facing is  demographic.\n\nI am not going to explain all of this chart, but I am basically going  to tell you, if you look at the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "Mr. LAWLER. Mr. Speaker, after the 43-day Democratic-led shutdown, I  agreed to sit down with my Democratic and Republican colleagues to  negotiate in good faith to extend the ACA enhanced premium tax credit  with reforms.\n\nWe negotiated a 2-year extension with income limits, with insurance…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698584/providing-for-consideration-of-hr-breaking-the-gridlock-act"}]