[{"senator": "Al Green", "party": "Democrat", "sentence": "…an appropriate thing to  say?\n\nBut I think he believes this. Because he believes it, he imposes it  on us, whether we like it or not. Well, Democrats don't like it, and  Democrats want to do something about it, but Republicans are in the  majority.\n\nIf there is a problem with these great issues of our time, don't lay  them at the feet of Democrats. Democrats…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700250/peaceful-silent-protest"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…Democrats share concerns that Chinese Communist  Party interference with U.S. colleges and universities could lead to a  wide variety of negative outcomes. That said, House Democrats do not  want to see legitimate academic activity between the United States and  China hindered.\n\nThe compromise language recognizes the spirit of the bill--the need  to protect…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690827/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Armed Services Committee.\n\nMr. BEYER. Mr. Chairman, I yield myself such time as I may consume.\n\nLet me just respond to my good friend from Arizona. No, that is not  what Democrats want. We don't want to see taxes go up for average,  middle-class Americans at all. This is what our budget experts say,  based on the budget resolution before us, as my friend…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "Mr. KHANNA. Mr. Speaker, the American people, Republicans,  Independents, and Democrats want the Epstein files released with the  victims' identity protected.\n\nNow most people don't understand how this town works, so I am going  to try to explain this really simply.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693720/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…thanks to loopholes, legal shields, and limited oversight of  polluters.\n\nThird, this bill will end up slowing projects by increasing  regulatory uncertainty and delay. Democrats want to pass bills that  invest in infrastructure and get projects done faster. That is why we  passed the bipartisan infrastructure law. It invested in all types of  infrastructure…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698022/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…and  survivors of domestic abuse to vote. It will make voting more  expensive, in fact forcing American families to pay billions of dollars  just to register to vote.\n\nDemocrats want a country where every American citizen can vote. That  is why we champion bills like the Freedom to Vote Act, the John R.  Lewis Voting Rights Advancement Act, and the…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…it  will cost, but how many people will lose their healthcare and how  quickly they will lose their healthcare.\n\nThose are legitimate questions that, quite frankly, Democrats not  only want to know but Republicans should want to know, as well.\n\nCan I get the gentleman to kind of give us some assurances that we  know the impact? Will he commit to ensuring…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…tax credits so that people do not lose their health insurance and  people do not see their healthcare premiums explode.\n\nMr. Speaker, Republicans keep talking about how Democrats want to  give more money to insurance companies, which is absolutely absurd, and  they all know that. Nothing could be more ridiculous.\n\nLet me correct the record. First of…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…made $990 billion worth of  cuts. We are now just 2 weeks away from a government shutdown.\n\nSpeaker Johnson is, once again, refusing to work across the aisle  with Democrats. Democrats want to prevent exploding health insurance  premiums. They have already started to show up in some people's mail.  That is because the Affordable Care Act subsidies are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695715/ensuring-funding-for-communities"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Democratic priorities. We must pass full-year spending bills that  ensure that lawmakers, not President Trump and Russ Vought, decide how  taxpayer dollars get spent.\n\nDemocrats want to lower the cost of living for all Americans and  deliver critical services and investments to the working class, the  middle class, and the vulnerable. That victory can…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the Republicans want another  thing, a sixth of the Republicans want a third thing, and they can't  agree.\n\nThe contrast is stark: Republicans are divided, and Democrats are  united. We want to extend these credits. It is the right thing to do  for the American people as they stand on the edge of the cliff.\n\nMeanwhile, one of the biggest failures in…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697574/department-of-defense"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…people's inconsistencies when their own  party is in charge. Yet, I can't ignore the irony that the Republican  Party has spent my entire life railing about Big Brother when Democrats  want to put simple things like energy standards on appliances.\n\nFor the last 4 years, the majority has gone on and on about the  weaponization of the Federal Government. My…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692431/ice-surveillance-and-trump"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…screwed. They have shoveled subsidies and  giveaways to greedy CEOs while  families struggle to pay for groceries and rent.\n\nQuite frankly, we don't share the same values. Democrats want a very  different government. We want a government that stands up to corporate  greed, a government that uplifts workers, powers consumers, and fights  on the side of everyday…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…here and making it very clear who we are fighting  for. And it really is Americans across this country, who are seeing  their costs skyrocket across the board. And, as Democrats, we want to  make sure that, yes, they are paid, but they also have the ability to  get their healthcare.\n\nI heard the majority leader just now say they are not going to  operate…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696460/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…to rein in ICE's abuses. We  should be going after ``the worst of the worst,'' as the administration  says, instead of unleashing fear and chaos on everybody else.\n\nWhat Democrats want is exceedingly reasonable. We need to end roving  patrols. That means arrest warrants and ending racial profiling.\n\nSecond, we need real accountability, having ICE abide…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699481/department-of-homeland-security"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…enforcement is facing a  1,300 percent increase in assaults against them, a 3,200 percent  increase in vehicle attacks, and an 8,000 percent increase in death  threats.\n\nIf Democrats want to debate the new Supreme Court interpretations of  reasonable suspicion, let's do it. If they want to debate the very  authorities of ICE stretching back decades over…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699311/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…resolution, and here is the reason why: We have a New York  Times Ipsos poll that tells the story on this. Seventy-nine percent of  the American people, including 67 percent of Democrats, want to make  certain that female sports are for girls and women. Those numbers--67  percent of Democrats, 79 percent of all Americans--say they are with  us.\n\nThey want to…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…fraud, and abuse. We started it  in the One Big Beautiful Bill Act. We are continuing it here, and we  are going to continue it through the appropriations process.\n\nIf Democrats want to vote ``no,'' that is their prerogative. They  have become the party of socialists. Let them vote that way.\n\nWe are going to fight for those hardworking families who…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693719/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…cuts red tape.\n\nUnlike our Democrat friends' plan, our Republican plan actually  lowers premiums by double digits, roughly 11 percent, according to the  data.\n\nAll the Democrats want to do is throw billions more dollars toward  insurance companies. Instead of attempting to lower the premiums of the  individuals who are on the insurance plan that the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…Mr. Speaker, you can try to rewrite history, but it just doesn't  work. Let me just read off the Democratic-run cities that did defund  the police.\n\nHere is the game the Democrats want. All during the summer of 2020,  they were saying: Defund the police. Democratic-run cities all over the  country were doing so.\n\nNow they say: Oh, but because crime went…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691031/expressing-support-for-local-law-enforcement-officers"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…minority leader come to  the floor and talk about our Republican plan for healthcare, and he  called it ``insulting.''\n\nWhat is insulting is that the minority leader and the Democrats want  to send $83 billion of taxpayer money directly from the Treasury of the  United States to health insurance corporations that continue to get  rich off of ObamaCare. That…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…fraud,  and abuse in the unaffordable care act, by way of H.R. 1, lowered  healthcare premiums for enrollees. Imagine that, attacking waste and  fraud lowers costs. Yet, Democrats want to embrace the opposite and  cement a system of inflation.\n\nHere is the kicker, Mr. Speaker: Only 7 percent of Americans enrolled  in an unaffordable care act plan would…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698305/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…healthcare  fund to provide $200 billion in taxpayer-funded benefits for illegals.  It is insanity.\n\nIf we want to look at where this all began, as some on the other  side, Democrats, want to talk about a healthcare crisis, the healthcare  law of the land is what many refer to as ObamaCare. Let's remember the  original name that Democrats gave that bill…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696745/continuing-appropriations-and-extensions-act-2026"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Hyde, who was a famous legislator and House Member from  Illinois. It is something called the Hyde amendment, which says that no  tax dollars can go for abortions, and Democrats want to throw that out  the window.\n\nWell, rather than just point the finger at our Democratic colleagues,  we actually have come up with a better idea, and I am grateful to…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697929/healthcare"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…Speaker, I would like to say that Republicans and Democrats have  similar goals, but that is just not true. We had 4 years to study this.  We had 4 years of evidence on this. Democrats want to kill  hydrocarbons, plain and simple.\n\nRepublicans are moving to lower prices, and anybody who knows this  industry, anybody who has studied this industry, and anybody…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697088/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…ObamaCare fraud controls could result in about one million       more people going uninsured, but most aren't eligible for       subsidies--and some might not even exist.\n\nDemocrats want to boost enrollment in ObamaCare no matter       the cost because they view the subsidized and regulated plans       as a way-station to a single-payer system. Senate Minority…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697906/affordable-care-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…refusing  to open government, and they continue to perform that political  theater. We need to prioritize the reopening of the government and stop  the suffering that the Democrats want to use as leverage.\n\nThe ranking member mentioned the discharge petition, and he is very  proud that it has 218 signatures, but not that long ago today we had a  unanimous…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…them deported. These are the facts.\n\nSo what should we do?\n\nHere is what I think: I think it is actually an opportunity for us to  strengthen our immigration laws. The Democrats want to kneecap ICE. I  have submitted the Protect America Act for debate. It would do four  things:\n\nOne, it would end sanctuary city status for good.\n\nTwo, it would increase…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "John Thune", "party": "Republican", "sentence": "…with bipartisan support. As I said at the time,  this bill joins other efforts to combat the fentanyl crisis that is  taking so many lives in our country.\n\nBut now Democrats seem to want to take a step backward in that fight.  They want to end the emergency that President Trump declared that  addresses the flow of fentanyl across the northern border…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689477/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Democrats remain  the party of painful and punishing regulations. They remain the party  of never-ending dependence on foreign dictators for energy that we have  right here. Democrats want to continue the war on American energy, and  that is why they are going to line up today and oppose what President  Trump is trying to do to bring energy prices down.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688189/energy"}]