[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…military action  is illegal without the consent of Congress.\n\nWith Nicolas Maduro now in the rearview mirror, we must look forward  and craft policies that support a free and democratic future for  Venezuela and policies that return war powers to the United States  Congress, as enshrined in the United States Constitution.\n\nThat is why I and the executive…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698765/venezuela"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…majority had no interest in  accurately portraying the protests in Los Angeles when they wrote H.  Res. 516. Instead, the resolution perpetuates a false narrative about  Democratic elected officials in California. H. Res. 516 states that  local elected officials did not adequately respond to the bad actors  and trouble-doers. These claims are patently…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693150/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…absolutely no political motivation. I have met them. I know them. Close  to 160,000 of them live in the State of Maryland, and many of them have  served for years under both Democratic administrations and Republican  administrations, and they have one dedication, and that is to their  fellow Americans. Our Federal workers keep our food safe. They explore…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…bipartisan basis, to increase and to pass the $4 billion in funding for  the program. And, again, I emphasize, it is not a red State, blue State  deal. It is not a Republican, Democratic deal. It is a person who is in  a home, doesn't have money, and is cold. That is what it is about.\n\nSo I am calling on President Trump and Secretary Kennedy to stop  stalling…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697111/low-income-home-energy-assistance-program"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…with the United States of America. Dictator  Putin doesn't want peace. He wants Ukraine, all of Ukraine, and beyond.\n\nSecondly, the Trump administration has been dividing democratic  alliances.\n\nYesterday, President Trump astoundingly said the European union is  worse than China. He even has said that the European union was created  to ``screw America.''…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…you on the money you have already paid in taxes at the  State and local levels.\n\nThat caused some people's taxes to go up, especially in high-tax  States that happen to be Democratic States, such as in New York, New  Jersey, California, Connecticut, Illinois, Massachusetts, Maryland,  Michigan, Minnesota, Oregon, Pennsylvania, Virginia, Rhode Island,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690627/republican-tax-cuts"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…Democracy, in 1983, as an independent, nonprofit  foundation with a bipartisan board, and since then, it has been the  main way that the United States has helped to strengthen democratic  institutions around the world.\n\nNED exposes Russian propaganda, counters Chinese Communist Party  censorship, circumvents the Iranian regime's efforts to silence  critics,…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699435/consolidated-appropriations-act-2026"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…deputies in Minnesota who addressed a deranged,  extreme perpetrator did their job. We applaud them for their brains and  valor.\n\nRestoring some calm to America is not a Democratic or Republican  challenge. It is an American challenge.\n\nI welcome the suggestion of Sophie and Colin Hortman, children of  slain Minnesota State House Speaker Melissa Hortman…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692983/lowering-the-temperature"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…to care for their children  such as high chairs, cribs, strollers, and car seats. Car seats are not  an optional purchase. They are required by law.\n\nThat is why today my Democratic colleagues and I are calling on the  administration to exempt essential childcare products from these  tariffs. I challenge my colleagues on the other side of the aisle to…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689419/protecting-american-families"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Minority Leader,      Washington, DC.\n\nSpeaker Johnson and Minority Leader Jeffries: We, the       undersigned organizations and individuals committed to public       safety and democratic self-governance, urge you to oppose all       legislative efforts now before Congress that would repeal,       defund, or weaken the District of Columbia's Comprehensive…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696988/opposition-letter-led-by-the-dc-justice-lab-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…President Truman called it a  neighborly act.\n\nThere is no article for if a NATO member attacks another because for  80 years, we have led a peaceful partnership for our shared democratic  ideals. Truman considered the treaty a means to establish freedom from  aggression and from the use of force in the North Atlantic community.  If one ally invaded another,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699067/nato"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…the leadership and initiative to bring this forward. I  also thank my colleagues in the Congressional Black Caucus, as well,  for taking a stand on this issue and the House Democratic Caucus  overall.\n\nThis is the issue that we fought about with respect to the government  shutdown. This is the issue that has not gone away. I suppose the White  House and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…restrained by the law, a government that misuses its power--and  not just its power; its power to use violence unjustly against its  citizenry. That is when we slip away from our democratic ideals, from  our constitutional principles, and slide towards an authoritarian  government that wants to make its people heel before them, kneel before  them.\n\nThat is what…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692454/alex-padilla"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…gentleman: You bet your life I  will be. I am going to be fighting like hell for the people of this  country. I am not going to sit back, and I can say this for the other  Democratic Members and others who will come to this mike: We are not  going to sit back and watch our constituents get screwed over. We are  just not going to do that.\n\nRepublicans…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…until harm is brought to any school district  or teacher or student. This must end. The mission of the Department  must continue. As far as I am concerned and as far as the Democratic  Caucus is concerned, the mission of this Department will continue.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698129/dismantling-the-department-of-education"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "Mr. Speaker, this week, we passed a major milestone when a majority  of the entire House of Representatives signed on as cosponsors of H.  Res. 166, supporting a democratic, secular, and nonnuclear Republic of  Iran.\n\nThis truly bipartisan and broad-based House majority of 224,  consisting of 139 Republicans and 85 Democrats, endorses the general…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…the Hyde amendment, which says that no  tax dollars can go for abortions, and Democrats want to throw that out  the window.\n\nWell, rather than just point the finger at our Democratic colleagues,  we actually have come up with a better idea, and I am grateful to our  colleagues Senator Crapo, who is chairman of the Finance Committee, and  Senator Cassidy,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697929/healthcare"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…about how much nondefense discretionary has gone  up, and it has. We have lied repeatedly when we did sequestration.\n\nPaygo, how many times--paygo, I actually think was a Democratic  proposal from years ago that, if we are going to add new spending  beyond the 5-year window, there needs to be an offset. Members saw a  number of bills that expired just…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…them through the math. The constituents  look back and say, so you have been lying or the politicians have been  lying to us for decades. The answer is yes, but it is not Democratic.  It is not Republican. Much of the crisis that we are facing is  demographic.\n\nI am not going to explain all of this chart, but I am basically going  to tell you, if you…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…get this  government back open. Let's go negotiate our differences, which are  many, but let's do it while not continuing to hold the American people  hostage.\n\nI urge my Democratic colleagues who have voted relentlessly to shut  this government down and impose this suffering on the American people  to stop. Stop imposing the suffering. Let's open the…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696745/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Anna Luna", "party": "Republican", "sentence": "…of citizenship, is being  labeled by people in the Senate and people in this very Chamber as Jim  Crow-era laws.\n\nLet me remind the American people of history. It was the Democratic  Party who championed the Jim Crow-era laws. And this is the farthest  thing from it. In fact, Mr. Speaker, if you are doing that, then you  are insulting over 70 percent…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700010/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the big,  beautiful bill; 14 hours to make America energy dominant, 14 hours to  unleash American resources and American jobs. Those 14 hours were  mainly spent hearing 121 Democratic amendments to undermine that bill.  They wanted to undermine America's energy. They wanted to undermine  America's ability to mine our own products. They wanted to undermine…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…year and the  start of a huge disaster the next 4 years. I sat right over there.  Again, it was my first time on the Senate floor.\n\nOne of the first things I heard from my Democratic colleagues, after  we returned to the floor that same night, after being taken and hidden  out for a few hours, was that this was the worst disaster and was even  worse than…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698541/9999"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…am pleased with all we have been able to accomplish in this one  big, beautiful bill, and now it is time to get it over the finish line.  It is frustrating that some of my Democratic colleagues hate President  Trump so much that they refuse to work with him even when it means  securing a more prosperous future for America. Instead, they have  chosen to…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691527/one-big-beautiful-bill"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…ensure that taxpayer-funded organizations operate within the mission  and guardrails Congress has established.\n\nThe National Endowment for Democracy was created to support  democratic norms overseas, not to engage in domestic political advocacy  or to amplify one side of America's internal debates. That distinction  is essential to its legitimacy.\n\nYet…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699440/consolidated-appropriations-act-2026"}, {"senator": "John Boozman", "party": "Republican", "sentence": "Mr. BOOZMAN. Mr. President, I am pleased to join Senators Collins and  Murray, as well as my Democratic counterpart on the MILCON-VA  Subcommittee Senator Ossoff in presenting the fiscal year 2026 and 2027  for the Department of Veterans' Affairs and the Department of Military…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694207/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…1815, introduced by my friend, Representative Van Orden.\n\nMr. Speaker, if the ranking member is so concerned about the  veterans, I ask him and his side of the aisle why my Democratic  colleagues haven't introduced a solution to aid veterans and still make  sure that it actually deals with the veterans' problems, not just all  of a sudden spends not only…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689695/montgomery-gi-bill-selected-reserves-tuition-fairness-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…want to speak about  a couple of judges that will be before us this week. We will be voting  on a pair of highly qualified circuit court nominations.\n\nDespite the ongoing Democratic government shutdown, the Senate  Judiciary Committee remains hard at work. We are continuing to hold  hearings. We are continuing to advance strong judicial nominees, like…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696500/nominations-of-joshua-d-dunlap-and-eric-chunyee-tung"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "Mr. LAWLER. Mr. Speaker, the reason we know this is a Democratic  shutdown is because of how angry they are that we are about to reopen  the government, period. That is all you need to know.\n\nJerry Nadler said the shutdown is really ``an…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696694/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…Mullin--for their hard work.\n\nI want to thank our House counterparts, particularly Chairman Cole,  who worked night and day with us on getting conference agreements.\n\nAnd our Democratic colleagues who courageously realized that we could  not let this shutdown continue to go on with the harmful consequences  growing worse with each passing day.\n\nI also want…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696664/continuing-appropriations-and-extensions-act-2026"}]