[{"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…bullet. It is men and women in this body  standing up together and saying that enough is enough. That is because  these lives are not just Black, not just White, not just Democrat, not  just Independent, and not just Republican. They are Americans. They are  our children, our seniors, and our neighbors. They are our friends, and  they are our colleagues.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691752/national-gun-violence-awareness-month"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…rescissions, and because of  this potential government shutdown.\n\nI don't know about you, but when I am in trouble, I don't call  somebody and say, hey, are you a Republican or a Democrat? I just call  and say: Can you help me?\n\nMy dad has got health issues right now. I was on the phone. I wasn't  saying: Hey, who did you vote for? I said: Hey, can you help my…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…one of their headlines said--I think it was actually  more than a single-year period, but $50 billion of fraud. Are we  allowed to work on that? Is that Republican or Democrat, or is it just  time to find a better way to actually think about these things?\n\nThat is maybe what we just opened up, assuming that my own leadership  and my own committee chairman…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Joint Economic Committee--and it was a hard  report to write--a couple years ago wrote a major study saying: What  does obesity cost America?\n\nThat is not Republican or Democrat. It is just what we are. It means,  every time you say that, Mr. Speaker, did you make all the people who  make money off certain foods, off of certain healthcare, and other  things,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…olds we have today. Next year,  the number of 18 year olds goes down, the year after that it goes down,  and the year after that it goes down.\n\nIs that Republican or Democrat or is it just demographics? It is a  little hard to campaign on that. It is a little hard to attack the  other side, but the fact of the matter is, if we all read our data, we  don't…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…is almost no cycle where magically prices start to come  down. The way you deal with this is economic growth, wage growth.\n\nIs prosperity moral? Is it Republican or Democrat? It is just the  right thing to have a society where people's lives get better every  day.\n\nThis is just a board I have used before, but it is just to make a  point for anyone that…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…people. Then, the  government unions have to try to light things on fire, so disharmony.\n\nWe have five major databases in the Federal Government. Is it  Republican or Democrat to just build a world where those databases  would talk to each other? If there is potential of $100 billion a year  in misallocations and fraud and these things, and you could…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…wouldn't it? Someone would actually have to sit down and read  the stuff with a calculator.\n\nWe have a crisis. Having a society that is getting older is not  Republican or Democrat; it is just what we are. It is math.\n\nLook, if we are not willing to tell the truth, we can continue to use  our campaigns--all right. I will take a slight non sequitur.\n\nWe are…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…years.  It turns out they gave us $1.84 trillion as a preliminary guess.  Hopefully, in the next couple of weeks, we will get an official score.\n\nIs this Republican or Democrat? It is just fixing the waste, fraud,  and misalignment in the program.\n\nLook, I fully expect within minutes I will have attack ads in my home  district beating the crap out of me,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…functionally stable. Then the next year you start to actually fall in  your numbers of working-aged people in the population. It is  demographics. It is not Republican or Democrat, it is just math.\n\nOne more chart of this, and then I am going to give you the one that  scares me the most. This is Social Security and disability benefits.  Here we functionally…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…and we use technology.\n\nI am wearing one of these Oura rings. We are doing experiments in our  office with other wearables trying to build data. Is that Republican or  Democrat? It is just data. I don't know why we haven't been able to  build a love connection here or a policy connection or whatever the  hell we are supposed to call it between the left…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…same number of 18 year  olds today as we had 20 years ago, but we have double the number of 65  and up. It is just what we are. Don't get mad. It is not Republican or  Democrat. It is just demographics and understanding when our brothers  and sisters move into their earned benefit years, what it costs.\n\nThe fact of the matter is, this Congress refuses…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}]