[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…administration's  disregard for our Nation's spending laws and Congress' power of the  purse has harmed every corner of our country. Children in elementary  schools have been denied resources they need to succeed. Farmers in  rural communities have been left to fend for themselves. Communities  have been robbed of resources to keep people safe.\n\nRuss Vought…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…environments that support them on their educational journeys.       Unfortunately, pregnant and parenting students are routinely       stigmatized, discriminated against, and denied the resources,       accommodations, and support they need to thrive in their       educational institutions. Many pregnant students risk their       health or the health of…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…cuts will mean life-altering changes for  families across America and will lead to nursing homes being closed,  doctors refusing to care for patients, healthcare claims being denied,  and more debt and increased costs on the backs of families who are  already struggling to make ends meet.\n\nI will ask this question to my Republican colleagues: Are you ready…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688235/democratic-proposals"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Japanese Americans.\n\nUncle Mon's story is just one of nearly 18,000 Japanese-American  soldiers who embodied the motto Go for Broke. They risked everything  for a country that had denied them so much because they believed in the  promise of America.\n\nYet, that promise is fragile. The Trump administration erased the  story of the 442nd from the Army's website…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690036/protecting-the-promise-of-america"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…you have to swear under  oath that that statement is true.\n\nHe did that, but at the same time, he had been bragging about  attacking these officers. Later, he came out and denied responsibility  for what he had done. In fact, he said Officer Tate had attacked him.\n\nThe judge in that case was appointed by Donald J. Trump. He heard all  the evidence,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698549/january-6-attack"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…loss; as  they pieced their lives back together; and as they began helping their  5-year-old cope with the grief and loss of his precious mother.\n\nYet, the State of Georgia denied Adriana her bodily autonomy and  dignity in death. In the days and weeks that followed, her family found  themselves in a desperate battle with Emory Hospital.\n\nThe hospital…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692035/adriana-smith"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…contact her family to arrange  care for her son and make sure that he keeps receiving the medical  treatment that he desperately needs.\n\nYet, Trump's police said: No. They denied this basic right. They  would not let her call her family, nor her lawyer. As a result, her son  no longer has access to his lifesaving cancer treatment.\n\nIt is a confounding…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…past failures to educate students with disabilities. I  am old enough to remember a time when students with special needs were  educated in the basement of schools or outright denied entry. Before  IDEA, millions of children with disabilities were denied an education  and often refused admission to schools or even programs.\n\nToday, children with disabilities…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…lofty vision that we knew was  right.\n\nWe remedied slavery, ending it in 1865 with the 13th Amendment. We  passed the 15th Amendment to ensure the right to vote shall not be  denied by race or color or previous servitude. And  then, some 50 years later--it took 50 additional years before the right  to vote was guaranteed to women in the United States of…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690536/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…so-called separate but equal schools.\n\nIn Brown v. Board of Education, the court said: ``It is doubtful that  any child may reasonably be expected to succeed in life if he is denied  the opportunity of an education. Such an opportunity . . . is a right  which must be made available to all on equal terms.''\n\nThe court then concluded that segregation of…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698125/dismantling-the-department-of-education"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…the Congress.\n\nMr. Speaker, Donald Trump has been a failure. Where he fails, we are  here. We will fight. We will fight for fairness, justice, and the  promise that has been denied far too many Americans for far too long.\n\nMay we continue down this righteous road today to fight and to march  on for all the battles that lie ahead.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690634/trumps-first-100-days"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…color of your skin determined the  weight of your ballot or your opportunity to have a ballot in your  hand. We won't go back to a time when power was hoarded by the few and  denied to the many. We are marching forward with ballots, not bullets;  love, not fear; and with hope, not hate.\n\nWhen you suppress the vote, you suppress the American Dream. You…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…uniform  and paid the ultimate price are able to be laid to rest honoring their  religious heritage. Unfortunately, due to the fog of war, hundreds of  Jewish servicemembers were denied that last opportunity.\n\nThis bill is an important step to allow for the research necessary to  correct these errors and ensure there are resources for that work. This  will…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695467/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…floods are  devastating the lives of our residents in southeast Michigan and across  the Nation.\n\nThe dangers don't stop when the flooding ends. Too many of our  families are denied FEMA assistance because current rules and policies  don't cover repairs and reconstruction for most basements where floods  are the most destructive.\n\nWithout Federal assistance,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694123/disastrous-floods"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…school. Peaceful  citizens are being pepper-sprayed and shot in cold blood for daring to  speak up.\n\nWhen Members of Congress try to conduct oversight, we are blocked. We  are denied access. We are told to look the other way.\n\nThis is not law enforcement.\n\nThis is not accountability.\n\nThat is not who we are as a country.\n\nThis bill writes a check for an…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699345/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…there for  us when we were young and scared, when we had very limited resources,  but, unfortunately, if my Democrat colleagues had their way, our  healthcare would have been denied.\n\nWhy deny the Sallyann Yakym's of the world access to the care that  they need? Why deny people like my daughter, Elle, the care to make  sure that they are okay?\n\nI wish…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699232/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…the American people don't buy it.\n\nListen, for the past 40 days, Democrats have inflicted needless pain  on hardworking Americans. They stranded millions of travelers. They  denied food assistance for hungry families. How did they do that? When  you vote ``no'' to continue funding, that means you deny food stamps  for hungry families. No means no, you…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696724/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…want to be sure we look at what this  does to girls who are trying to compete. This is why this issue is so  popular.\n\nHere are the stats. There were 93 times when a girl was denied an  individual or relay championship because of these two male athletes who  were competing as females--93 times. A girl who had trained, who had  worked out, who sought to…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…overthrow  their oppressors and restore the blessings of liberty to themselves and  their posterity.\n\nThey need the direct satellite access to the internet that the regime  has denied them on the ground. They need us to restore economic  sanctions, as the President is doing against the regime in a renewed  boycott of Iran.\n\nMr. Speaker, decisive turning…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…Program by 5 years, ensuring  eligible veterans can claim the land that they were promised.\n\nFor decades, thousands of Alaska Native veterans who served in  Vietnam were unfairly denied the ability to apply for land allotments  due to their service overseas. While Congress took steps to correct  this injustice, the executive branch until recently has been…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693473/alaska-native-vietnam-era-veterans-land-allotment-extension-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…deliberation of Congress to ensure that we get it right. It certainly  deserves some House input into the legislation.\n\nI am extremely disappointed that the House has been denied any  opportunity to express its will on such a consequential piece of  legislation. I am going to say it again: There has been no House input.  I fear this will set a terrible…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…estimated  resource value of $26 billion.\n\nCurrently, there is no way to access these minerals. To do so, we  need to construct Ambler Road. Last year, the Biden administration  denied a permit for Ambler Road, effectively preventing Alaskans from  developing their own resources.\n\nPassing this CRA is the first step in allowing Alaska to acquire  these lands…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "French Hill", "party": "Republican", "sentence": "…established.\n\n``(i) Nonparticipation and Housing Assistance.--\n\n``(1) In general.--A family that elects not to participate       in the pilot program may not be delayed or denied assistance       under section 8 or 9 for reason of such election.\n\n``(2) No termination.--Housing assistance may not be       terminated as a consequence of participating,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…amendment to include  the Lumbee Fairness Act in the bill before us today, providing the  Lumbee Tribe of North Carolina the full Federal recognition they have  been unfairly denied for decades.\n\nThroughout recorded history, the Lumbee Tribe, comprised of nearly  60,000 members, has called southeastern North Carolina home. Despite  their long history and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…process.\n\nThis resolution is a step toward balance and the rule of law. It is a  step toward the mineral abundance that the American people deserve and  that Washington has denied them for too long.\n\nI thank the gentleman from Minnesota (Mr. Stauber) for introducing  this resolution and for his tireless work on behalf of his  constituents.\n\nMr. Speaker,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…firm is willing to represent, you can suppress  dissent.\n\nSome of our Nation's most reputable and accomplished firms--Perkins  Coie, Jenner & Block, WilmerHale--investigated, denied access, sued for  representing the President's opponent in the 2016 election, for  representing a major philanthropist, George Soros, for representing  those who would advocate…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…charges, then that State or local official can go to jail.\n\nYou have an obligation under Federal law to turn these people over.  Sanctuary States and cities--25,000 ICE detainers denied. Twenty-five  thousand people that should be deported have not been turned over to  the Federal Government because of these 12 States and these 200  sanctuary cities. Let's…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…Whereas one private first class cited as having been involved in one  of the listed achievements on Representative Cory Mills' Army Form 638  recommending him for a Bronze Star denied that Representative Cory  Mills provided him any aid and also denied that his injuries were life- threatening;\n\nWhereas one sergeant cited as having been involved in one of…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697012/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…Court ultimately found       craigslist not liable based on a Section 230 defense.    Mother Whose 11-year-old Son Was an Alleged Victim of Sexual Battery                   Denied Relief After a Four-Year Fight\n\nFollowing an alleged sexual assault of legal guardian's 11-      year-old son and two other minor males in 1994, Richard Lee       Russell was…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…explained Plaskett's communication with Epstein as simply responding to  a constituent, Hakeem Jeffries had a very different response when asked  about it by the media. He denied its existence. Hakeem Jeffries said  Comer is a stone-cold liar. Then he reverted to calling me names for  the second week in a row.\n\nLet's read it to make sure. It is to Jeffrey…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697128/irrefutable-evidence"}]