[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…emergency food rations because the funding  was stopped. We don't know how many thousands of girls can no longer go  to school in countries where they are traditionally denied access to  education because the funding was frozen. We don't know how many  organizations working to stop sex trafficking, child labor, and gang  violence are no longer functioning…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…plane to be imprisoned out of the country.\n\nBasic fairness and due process rights that involve also the President  intimidating law firms with threats that they will be denied access to  security clearances or even to go on to governmental property, and  intimidation and threatening our universities, supposedly in the name  of anti-Semitism--nobody…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…days' notice.\n\nI visited an ICE facility in Tacoma, Washington. I did provide that 7  days' notice, even though I was not legally required to do so, and yet  I was still denied access to meet with my constituents due to so-called  scheduling issues.\n\nThis is not transparency. This is an attempt to control access,  suppress oversight, and manipulate the…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699128/ice-operations"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…school. Peaceful  citizens are being pepper-sprayed and shot in cold blood for daring to  speak up.\n\nWhen Members of Congress try to conduct oversight, we are blocked. We  are denied access. We are told to look the other way.\n\nThis is not law enforcement.\n\nThis is not accountability.\n\nThat is not who we are as a country.\n\nThis bill writes a check for an agency…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699345/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…enter the facility to conduct an  oversight visit and speak with some of those being detained.\n\nWhat I saw was people held in deplorable conditions, many of them  being denied access to clean clothes for 10 days. Immigrant detention  is a multimillion-dollar industry with some private prison groups now  aiming to cash in on the funding included in the…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692930/holding-power-accountable"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…doesn't live up to its name.       Some small businesses that are majority owned by Americans       have foreign investors, and under this bill those businesses       would be denied access to critical Small Business       Administration resources. What's more, this legislation       ignores the fact that immigrant communities are a vital hub       of entrepreneurial…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Act, already prohibit  organ transplant centers from discriminating based solely on  disability. However, there are still cases where people with  disabilities have been denied access to organ transplants. This is  often because of misperceptions about how a disability impacts the  medical likelihood of transplant success or unfounded assumptions  regarding…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692716/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…of the top opposition leaders.\n\nNow, Trump has not started jailing journalists, but the pace of  harassment in the first 60 days of his second term is alarming.\n\nHe has denied access to government buildings, including the White  House, to journalists who don't use preapproved language from the White  House. He is preferencing credentials to partisan…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…cheaper, less strain on the system.  Healthier people are more productive citizens. When a person doesn't  take their medicine because they can't afford it, when a person is  denied access to healthcare, they ultimately show up in an emergency  room, and it clogs and strains the system. It is a heck of a lot easier  to prevent it than it is to cure it.\n\nI…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…chemo for cancer  treatment would lose his Medicaid because of the cuts that are being  proposed here just 3 years before he becomes Medicare eligible.\n\nIf families are denied access to Medicaid without the finances to  cover care, what will happen to them? If your family is lucky and you  have never had an ill relative, you are lucky because there…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…that all kids, no matter  who they are or where they live, have access to education.\n\nBefore the Department of Education, millions of children all across  this country were denied access to schools and educational  opportunities. Federal programs were duplicative and wasteful, and  States regularly violated the basic civil rights of students.\n\nIf our colleagues…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697300/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…think it is all of us, not the Democrats versus the  Republicans--is wanting to have a healthcare system that is going to be  there when people need it, that people are not denied access to  healthcare because they are poor kids, that they are not denied access  to nursing home care because they have run out of their lifesavings.\n\nWe want to make certain…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689539/h-con-res-14"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…showing how Mr. Bove suggested--indeed, urged--that lawful court orders  be disobeyed; that the Department of Justice ought to tell the courts  to eff themselves.\n\nWe were denied access to an Office of Professional Responsibility  investigation bearing on this nomination: an OPR inquiry into the  failure of the team supervised by Mr. Bove to divulge to…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…including permanent residents and  asylum seekers, arrest them, and either detain them indefinitely or  forcibly deport them. Lawyers representing the subjects have been  denied access to their clients as well as access to the warrants and  other official documents. Judicial orders have been blatantly ignored  and courts denied access to potentially evidentiary…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691184/letter-to-secretary-noem-and-secretary-rubio"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…enacted, we did not have these kinds of Federal  protections for students with disabilities. As a result, there was no  way to ensure that students with disabilities were not denied access to  education or were not neglected in our schools. As noted by my  colleague from Maryland, many of these students didn't even get to go  to school. They didn't have IDEA.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697008/9999"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Congress has the opportunity to help ensure that individuals with  disabilities are treated fairly within the organ transplant system. No  one, Mr. Speaker--no one--should be denied access to an organ  transplant just because they have a disability.\n\nThat is why I am proud to support this bill, which will make sure  that all Americans, no matter their disability…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692718/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…is willing to represent, you can suppress  dissent.\n\nSome of our Nation's most reputable and accomplished firms--Perkins  Coie, Jenner & Block, WilmerHale--investigated, denied access, sued for  representing the President's opponent in the 2016 election, for  representing a major philanthropist, George Soros, for representing  those who would advocate…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…electronics, it is more important than ever to protect our outdoors  so that our constituents can touch grass instead of a computer screen.\n\nIn short, citizens should never be denied access to the very parks  that they fund.\n\nMr. McCORMICK. Mr. Chair, in order to address my peers' concerns, I  will restate in the middle of this where I said specifically $8.7…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694870/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…opportunities for millions of students with  disabilities, helping them reach their full potential.\n\nUnfortunately, before 1975, students with disabilities had long been  denied access to public education, but IDEA transformed the public  school experience for students with disabilities and their families.\n\nMr. Speaker, we have an obligation to our students…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697493/9999"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…thanks to the commitment of  American's cable and satellite providers who voluntarily fund C-SPAN as  a nonprofit service.\n\nLet's be clear. Millions of Americans are being denied access to this  vital coverage because major TV streaming platforms like YouTube TV and  Hulu + Live TV refuse to carry C-SPAN. At a time when trust in  government is more important…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689056/recognizing-the-46th-anniversary-of-c-span"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…centers from  discriminating on the basis of disability, there is limited enforcement  and a lack of Federal guidance to ensure patients are protected.\n\nNo one should be denied access to an organ transplant just because  they have a disability. H.R. 1520 clarifies that individuals with  disabilities shall not be denied an organ transplant or related…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692719/charlotte-woodward-organ-transplant-discrimination-prevention-act"}]