[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…staff and Senators, President Trump said:\n\nWhy do we want all these people from shithole countries       coming here?\n\nNow at the time when that was revealed, the President denied it, said  he had not used that phrase. But we know that that was a lie because,  recently, at rallies he has been acknowledging that he used that  phrase, and he still uses…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…brought  students, workers, and countries together, as effectively, they could  have, to learn and to trade on a level playing field. As a result-- American children have been denied good educations, and American  workers have been denied good jobs.\n\nYet rather than working together to seek constructive solutions, the  Trump Administration has used these…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…firsthand the  importance of high-quality, culturally competent healthcare and HIV  prevention services. His experience has motivated him to build a world  where no one is denied quality healthcare services because of their  background, citizenship status, identity, or circumstance.\n\nFor almost two decades, from Chicago to Boston, this young man has…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697836/commending-omar-martinez-gonzalez"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…on a plane to be imprisoned out of the country.\n\nBasic fairness and due process rights that involve also the President  intimidating law firms with threats that they will be denied access to  security clearances or even to go on to governmental property, and  intimidation and threatening our universities, supposedly in the name  of anti-Semitism--nobody…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…them statehood, voting representation in Congress and full home  rule. D.C. servicemembers have helped secure voting rights for people  around the world, yet have always been denied those same rights when  they returned home. D.C. residents, who pay the same federal taxes as  residents of states, deserve the same opportunity as residents of  states to…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696573/introduction-of-the-service-academies-district-of-columbia-equality-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…frantically  trying to locate their loved ones who have been hauled away to  detention centers, for-profit makeshift prisons, prisons where meals  are inedible and medical care is denied, prisons where women are denied  cancer treatment and endure miscarriages while their screams are  ignored.\n\nMr. Speaker, this situation is desperate and it is not the result…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697132/immigrant-neighbors"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Senate's despicable decision last week to sneak in a self-serving  provision into the bill that was used to reopen the government.\n\nWhile 42 million Americans on SNAP were denied their benefits, Senate  leadership added a payout provision to eight Senate Republicans whose  phone records were subpoenaed in the January 6 Capitol riot  investigation by…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696864/calling-for-quick-action"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…protocol.\n\nMr. Speaker, I merely point out Republican hypocrisy which we deal  with every single day, and we want to have a vote on extending the tax  credits, but Republicans denied that in the Rules Committee.\n\nRepublicans could be bringing up a bill to make the enhanced premium  tax credits permanent, but they are not. Instead, what they did is they…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…the very wealthy.\n\nMr. Speaker, 83 percent of the tax breaks go to 1 percent of  Americans. What do these Medicaid cuts mean? It means the closure of  hospitals and seniors denied coverage in long-term care.\n\nElon Musk talks about reducing deficits, but this bill would add $2.8  trillion to the deficit, taking it to $24.9 trillion.\n\nHere is what is going…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688273/medicaid-cuts-mean-hospital-closures"}, {"senator": "Greg Casar", "party": "Democrat", "sentence": "…Whereas, one private first class cited as having been involved in one  of the listed achievements on Representative Cory Mills' Army Form 638  recommending him for a Bronze Star denied that Representative Cory  Mills provided him any aid and also denied that his injuries were life- threatening.\n\nWhereas, one sergeant cited as having been involved in one of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695580/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…convictions, like  traffic violations.\n\nPeople are detained in horrific conditions. Facilities are  overcrowded, and people are sleeping on the ground next to toilets.  Folks are denied medical care. If the private prison companies running  the facilities provide any protein in meals, it is often undercooked  and, yes, sometimes bloody. Dinner is often served…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697449/fighting-dhs-immigration-raids"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…crowd of peaceful  civilians and reporters. Even a child was injured by shrapnel.\n\nUpon seeing these violent tactics, I demanded to speak to the person  in charge, but I was denied.\n\nAs the elected Representative of the Central Coast, I have a duty to  respond to my constituents and demand accountability for ICE's actions  that day.\n\nSadly, this has not…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697456/fighting-dhs-immigration-raids"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…how can we make sure that things like this never, ever,  ever happen again.\n\nWhat we know, unfortunately, is that partisan politics had a role.  Republicans have historically denied the ongoing effects of climate  change and what is happening in our country.\n\nOver the last decade, we have had more and more intense storms,  unexpected, throughout the entire…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693655/tragic-storms-in-texas"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…who are in the process of applying for the waiver  and who are looking to Colorado as an example.\n\nThis would mean hundreds of millions of dollars of treatment we would  be denied. The first year alone, we treated 58,000 people with the care  that they needed in Colorado. This is 5 years with implementation. It  is the reason why we now have a 35 percent…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691883/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…imposed on Texas women that some here want to impose  on all 50 States and all women in our country.\n\nI think the death certificates for so many other women who have been  denied treatment for pregnancy complications should really read the  truth, which is ``Cause of Death: Republican abortion ban.''\n\nFor every American whose life is threatened by Republican…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699233/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…with the Defense Intelligence  Enterprise and the Defense Security Cooperation Agency's efforts will  continue to be our strategic hedge against an increasingly contested  and denied battle space by peer adversary capabilities and malign  influence. We will enable leaders to make informed decisions in an  increasingly complex world, enhancing the U.S. military's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695148/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…the American people don't buy it.\n\nListen, for the past 40 days, Democrats have inflicted needless pain  on hardworking Americans. They stranded millions of travelers. They  denied food assistance for hungry families. How did they do that? When  you vote ``no'' to continue funding, that means you deny food stamps  for hungry families. No means no, you…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696724/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…want to be sure we look at what this  does to girls who are trying to compete. This is why this issue is so  popular.\n\nHere are the stats. There were 93 times when a girl was denied an  individual or relay championship because of these two male athletes who  were competing as females--93 times. A girl who had trained, who had  worked out, who sought to…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…electronics, it is more important than ever to protect our outdoors  so that our constituents can touch grass instead of a computer screen.\n\nIn short, citizens should never be denied access to the very parks  that they fund.\n\nMr. McCORMICK. Mr. Chair, in order to address my peers' concerns, I  will restate in the middle of this where I said specifically…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694870/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…5 years, ensuring that  eligible veterans can claim the land that they were promised.\n\nFor decades, thousands of Alaska Native veterans who served in  Vietnam were unfairly denied the ability to apply for land allotments  due to their service overseas. While Congress took steps to correct  this injustice, the executive branch, until recently, has been…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693425/land-conveyances-for-alaska-native-vietnam-veterans"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…problem, Mr. Speaker.\n\nPresident Trump wants to continue to give our Border Patrol agents  the tools they need to do their job effectively. Why the previous  administration denied them these tools we can all debate, but the  voters of this country made a decision in November. They said: We don't  want our Border Patrol agents to be at a disadvantage…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…process.\n\nThis resolution is a step toward balance and the rule of law. It is a  step toward the mineral abundance that the American people deserve and  that Washington has denied them for too long.\n\nI thank the gentleman from Minnesota (Mr. Stauber) for introducing  this resolution and for his tireless work on behalf of his  constituents.\n\nMr. Speaker,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "French Hill", "party": "Republican", "sentence": "…important.\n\nOverdraft protection is an optional service that financial  institutions provide to help consumers avoid having purchases declined.  Instead of the transaction being denied, the bank or credit union  charges a flat fee to cover the check on behalf of that consumer. It  lets that purchase proceed. It lets that payment to a utility company  proceed.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…amendment to include  the Lumbee Fairness Act in the bill before us today, providing the  Lumbee Tribe of North Carolina the full Federal recognition they have  been unfairly denied for decades.\n\nThroughout recorded history, the Lumbee Tribe, comprised of nearly  60,000 members, has called southeastern North Carolina home. Despite  their long history and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…estimated  resource value of $26 billion.\n\nCurrently, there is no way to access these minerals. To do so, we  need to construct Ambler Road. Last year, the Biden administration  denied a permit for Ambler Road, effectively preventing Alaskans from  developing their own resources.\n\nPassing this CRA is the first step in allowing Alaska to acquire  these lands…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…firm is willing to represent, you can suppress  dissent.\n\nSome of our Nation's most reputable and accomplished firms--Perkins  Coie, Jenner & Block, WilmerHale--investigated, denied access, sued for  representing the President's opponent in the 2016 election, for  representing a major philanthropist, George Soros, for representing  those who would advocate…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…the report--\n\n(A) the number of veterans who requested such an extension;\n\n(B) the number of such requests that were approved; and\n\n(C) the number of such requests that were denied.       SEC. 5. EXTENSION OF CERTAIN LIMITS ON PAYMENTS OF PENSION.\n\nSection 5503(d)(7) of title 38, United States Code, is       amended by striking ``January 31, 2033'' and…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699486/veterans-readiness-and-employment-improvement-act-of-2025"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…Whereas one private first class cited as having been involved in one  of the listed achievements on Representative Cory Mills' Army Form 638  recommending him for a Bronze Star denied that Representative Cory  Mills provided him any aid and also denied that his injuries were life- threatening;\n\nWhereas one sergeant cited as having been involved in one of…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697012/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Biden administration can be  removed.\n\nIn addition to the criminals, there are roughly 1\\1/2\\ million people  who have pursued some relief in the form of asylum but have been denied  any sort of relief from immigration laws and who have been ordered  removed from the country but have simply stayed in the United States  and defied being repatriated. Well,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…direct testimony from  a mother who had to battle with the Social Security Administration when  her 1-month-old child's Social Security number was compromised, and she  was denied a new number.\n\nThis bill, the Social Security Child Protection Act of 2025,  sponsored by Representative Smucker, will help families when their  child's Social Security number…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697263/social-security-child-protection-act-of-2025"}]