[{"senator": "Gwen Moore", "party": "Democrat", "sentence": "…me walk through it.\n\nAm I right about this, that the administration has tried to illegally  move the IDEA office and funding from the Department of Education to  the Department of Health and Human Services?\n\nI yield to the gentlewoman for a colloquy.\n\nMs. MOORE of Wisconsin. In the middle of the shutdown, was it true  that the Trump administration tried…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698944/protecting-education-for-children-with-disabilities"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…we are taking this step to clarify and build upon  existing civil rights protections for people with disabilities.  However, I am concerned that ongoing cuts at the Department of Health  and Human Services will limit the effectiveness of this bill.\n\nH.R. 1520 instructs the Office of Civil Rights to enforce the  discrimination protections included in…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692716/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…remain silent as President Trump's callous  willingness to risk the safety of all Americans continues by his  planning to eliminate the CPSC and fold its mission into the Department  of Health and Human Services, which itself will have a dramatically  smaller workforce and narrower mission.\n\nEliminating the existing CPSC or stripping it of the independent…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…all students. That is why the Trump administration's  actions to gut staffing at the Department of Education and move the  Office of Special Education programs to the Department of Health and  Human Services is so devastating. HHS does not have the structure, nor  the staff, to administer the $15 billion a year that this office is  responsible for.\n\nThe…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698936/protecting-education-for-children-with-disabilities"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…dedicated her time and expertise to various community development  efforts, including serving on the Economic Development Committee of  Crystal Lake, the McHenry County Department of Health, and the Gavers  Community Cancer Foundation.\n\nMr. Speaker, I am proud to represent Rhienna McClain, whose  exceptional contributions have made a lasting impact on McHenry…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690883/recognizing-rhienna-mcclain-for-receiving-the-athena-international-leadership-award"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…committed to strengthening Americans' access       to mental health and substance use disorder care. We are       incredibly disheartened by the proposal from the U.S.       Department of Health and Human Services (HHS) to eliminate       the Substance Abuse and Mental Health Services Administration       (SAMHSA) as we know it, as well as drastically reduce…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…research in its tracks, and  indiscriminately and illegally freezing funding from going out the door  to academic and research institutions across the country.\n\nAcross the Department of Health and Human Services, Trump and Elon  Musk have fired more than 5,000 public servants. We are talking about  scientists, doctors, researchers, and so many others who are…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688264/national-institutes-of-health"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…extended to VA and non-VA prescribers alike since the COVID-19  pandemic.\n\nThe current waiver, which has been extended by the Drug Enforcement  Administration and the Department of Health and Human Services, is set  to expire in December of 2025. This legislation will make permanent VA  prescribers' authority to prescribe controlled substances via  telehealth,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695455/protecting-veteran-access-to-telemedicine-services-act-of-2025"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…home of the  Research Triangle Park, to share the story of a Federal scientist, in  their own words, who was fired by President Trump and Elon Musk.\n\nI worked for the Department of Health and Human Services. I       was responsible for leading technical oversight over the       Organ Procurement and Transplantation Network in order to       ensure patient…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688136/fired-by-president-trump"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…included many good ideas from both sides of the aisle.\n\nAs we continue to hear that Elon Musk and his band of hackers are  rampaging through Federal agencies, including the Department of Health  and Human Services, firing policy experts, falsely accusing Americans  of fraud, freezing and terminating investments that were directed by  Congress, I hope we can…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688406/recruiting-families-using-data-act-of-2025"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…workers were fired, 572 accepted  voluntary separation packages, and 63 probationary workers were  terminated. Programs for students with disabilities were moved to the  Department of Health and Human Services where 20,000 public servants  were cut in January.\n\nThere are approximately 7.5 million special needs kids in this  country protected by IDEA in the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689920/department-of-education"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…families with adoption.\n\nAfter returning to North Carolina, Phyllis first worked at the Wake  County Department of Social Services before moving to the North  Carolina Department of Health and Human Services, where she was  promoted to Program Coordinator of Community Child Protection Teams  across the state. In this role, she traveled to all 100 of our…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689503/recognizing-the-life-and-legacy-of-phyllis-fulton"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Republicans  are supporting these programs, and it is simply not true.\n\nMr. Chair, I have in front of me the ``Fiscal Year 2026 Budget in  Brief'' that came from the Department of Health and Human Services.\n\nOn page 35 to 36 of the document, it says: ``The budget eliminates  the following programs to align investments with the administration's  priorities.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "Mr. WYDEN. Mr. President, last week, the Senate passed legislation to  fund the Department of Health and Human Services and other Agencies,  including a section reflecting bipartisan, bicameral negotiations on  healthcare policies in the jurisdiction of the Finance…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699474/hospital-at-home-program"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Federal employees are still  being fired, RIF'd, and harassed by this administration.\n\nLast week, I heard from a constituent who received a termination  letter from the Department of Health and Human Services just hours  before it went into effect with no access to their equipment, no  offboarding information, and no details about their severance. This…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694177/demanding-answers"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…with  incentives in the form of open-ended access to your tax dollars.\n\nEarlier this year, reports surfaced from the watchdog group, Open The  Books, exposing Biden's Department of Health and Human Services for  awarding shockingly large amounts of grants and dollars to nonprofits  focused on aiding illegal immigrants, amounting to as high as 20  million…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…date of enactment of this Act, the Secretary of Veterans       Affairs, in consultation with the Director of the Centers for       Disease Control and Prevention of the Department of Health       and Human Services, shall commence an epidemiological study       on the prevalence of cholangiocarcinoma in covered veterans       of the Vietnam era, using data…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689625/vietnam-veterans-liver-fluke-cancer-study-act"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…discriminated against in organ transplant eligibility. It gives  families a mechanism for timely intervention, time that oftentimes  families just don't have, through the Department of Health and Human  Services, when medical decisions are clouded by bias rather than  compassion and science.\n\nI am proud to work once again with my colleague and friend  Congresswoman…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692717/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…After serving two Chairs and three Subcommittee Chairmen, Seth will  soon depart Capitol Hill and move to Louisiana to serve as the Policy  Director for the Louisiana Department of Health. I wish him the best,  congratulate him on his new role, and thank Seth Gold for his service  to the House Committee on Energy and United States Congress.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696705/recognizing-seth-gold"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…Mississippi Emergency Management Agency, Mississippi  Department of Public Safety, the Mississippi Department of  Transportation headed by Brad White, Mississippi State Department of  Health, and Mississippi Forestry Commission. FEMA has also been on the  ground, providing $3.75 million in rapid emergency funding from  generators to tree removal and other…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699701/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…described in       this paragraph are the Department of Agriculture, the       Department of Commerce, the Department of Education, the       Department of Energy, the Department of Health and Human       Services, the Department of Homeland Security, the Department       of Housing and Urban Development, the Department of the       Interior, the Department…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697203/count-the-crimes-to-cut-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…have purchased health insurance plans       through the marketplaces established under PPACA. The Centers       for Medicare & Medicaid Services (CMS), within the Department       of Health and Human Services (HHS), is responsible for       maintaining the federal Marketplace and overseeing state-      based marketplaces. Under PPACA, states may elect…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…bone grafts.\n\nOne of these patients was Shandra Eisenga, who tragically passed away  on August 10, 2023, from tuberculosis, or TB.\n\nThis bipartisan bill requires the Department of Health and Human  Services to conduct public awareness campaigns to assist in preventing  TB outbreaks caused by contaminated human cell and tissue product  donations.\n\nShandra's…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692767/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…alleged that is  being done.\n\nFrom groundbreaking biomedical advancements through the NIH to  critical healthcare coverage for America's most vulnerable patients,  the Department of Health and Human Services oversees many of the  Federal Government's most essential functions. But far too often, these  programs fall short of their well-intended purpose.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691446/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…support of my legislation,  H.R. 6945, the Supporting Pregnant and Parenting Women and Families  Act.\n\nFor too long, previous Democrat administrations have weaponized the  Department of Health and Human Services against pregnancy resource  centers by attempting to cut off their Temporary Assistance for Needy  Families, or TANF, funding. This bill puts a definitive…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699227/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…States are required, as a condition of receiving  funding, to have a plan in place to recruit foster and adoptive  families, but we know, based on an analysis by the Department of Health  and Human Services, that many States continue to face challenges.\n\nThis bill would build on existing law by calling on States receiving  Federal funding to develop…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688405/recruiting-families-using-data-act-of-2025"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…departments and  agencies for the remainder of fiscal year 2026:\n\nPresident Trump's Department of Defense, President Trump's Department  of Labor, President Trump's Department of Health and Human Services,  President Trump's Department of Education, President Trump's Department  of Transportation, President Trump's Department of Housing and Urban  Development,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Homeland Security;\n\n(4) the Department of Transportation;\n\n(5) the Department of Energy;\n\n(6) the Department of Agriculture;\n\n(7) the Department of the Interior;\n\n(8) the Department of Health and Human Services;\n\n(9) the Office of the Director of National Intelligence;       and\n\n(10) the Small Business Administration.\n\n(d) Designations.--The Assistant Secretary…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…waived. This flexibility  allowed VA doctors and specialists to reach veterans where they are  through secure, effective telemedicine. The Department of Justice and  the Department of Health and Human Services have continued to extend  this waiver. Yet, without further action, it will expire at the end of  this year.\n\nMy bill would permanently extend the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695454/protecting-veteran-access-to-telemedicine-services-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Distribution.--Any amounts collected under this       subsection shall--\n\n``(A) be credited to the currently applicable       appropriation, account, or fund of the Department of Health       and Human Services as discretionary offsetting collections;       and\n\n``(B) be available, only to the extent and in the amounts       provided in advance in appropriations…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}]