[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…actions are stalling  clean-energy projects and eliminating high-wage jobs.\n\nThe Trump administration is also attacking workforce development for  clean energy. In May, the Department of Labor shut down Job Corps,  closing the doors of the Hubert H. Humphrey Job Corps Center in St.  Paul. For 44 years, Job Corps provided job training, education and  housing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695056/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…none of which is legal.\n\nWill his ego stop staining this city by putting his name and his  picture all over banners contemporaneous or similar to Teddy Roosevelt  at the Department of Labor and others?", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697480/united-states-institute-of-peace"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…the Department of Education is the only  Department equipped to be charged with the education of all students,  including students with disabilities, not HHS, not the Department of  Labor, not the Department of Justice.\n\nCreating more hoops for schools to jump through and shattering known  systems and protocol will, at the end of the day, hurt the students…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698936/protecting-education-for-children-with-disabilities"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "Mr. SCOTT of Virginia. Mr. Speaker, I thank the gentlewoman for  yielding, and I thank her for organizing this Special Order so we can  discuss the actions of the Department of Labor.\n\nRight now, the Trump administration and congressional Republicans are  starting to implement an aggressive deregulatory agenda that harms  workers. Trump's deregulatory…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695574/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…labor and we value safety.\n\nAs a Federal legislator, I am committed to building on the progress  and am very concerned about proposals to cut back the ability of the  Department of Labor to implement Federal workplace protections. As a  member of the House Appropriations Committee, I will make every effort  to ensure that OSHA and the National Labor…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691010/federal-workplace-protections"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…thousands of  Federal employees. They have attempted to fire hundreds of thousands of  Federal employees, including those at the Consumer Financial Protection  Bureau, the Department of Labor, and other critical agencies.\n\nWe have seen this firing be so haphazard that they have had to hire  some of them back, including the decision to fire all the National…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…been vital in funding such  disaster recovery work and providing job training, temporary  employment, and career services to wildfire survivors.\n\nI am grateful to the Department of Labor for awarding Hawaii $2.5  million in dislocated worker grant funding. While this is a step in the  right direction, the livelihoods of displaced workers, the health…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689959/maui-dislocated-workers-program"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…ahistorical. In fact, this has not historically  been a particularly partisan issue except for the last 25 years.\n\nThere is a giant, cult-like poster of Donald Trump on the Department  of Labor that I drive by every day in and out of the Capitol. It is  super creepy, the idea that we have Mao- and Stalin-like banners of the  President of the United States surrounding…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699117/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Ms. BONAMICI. Mr. Speaker, I rise today to condemn in the strongest  terms the attack by DOGE on the Women's Bureau at the Department of  Labor, the only Federal agency representing women in the workforce.\n\nLast week, Elon Musk's unelected, unqualified, inept team at DOGE  canceled millions of dollars in grants…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691209/supporting-the-womens-bureau-at-the-department-of-labor"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…weakened rules on overtime,  rolled back safety standards, and gutted protections for wage theft. If  you want any indication where the current President stands on the  Department of Labor and American workers, all you have to do is walk  down the street and you will see a three-story picture, not of the  American worker on the front of the Department…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695576/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…already sick of hearing from me, but  that is too bad. In August, I wrote to the Secretary of Labor urging  her to stop these rollbacks. Today, I want to again call on the  Department of Labor to withdraw this dangerous and disgusting proposed  rule immediately, to reinstate full enforcement of the 2013 rule, and  to focus its efforts where they belong, on…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…they are more vulnerable to fraud and insolvency than those in the  marketplace.\n\nThe second proposal is the Self-Insurance Protection Plan which would  prohibit the Department of Labor and States from ever regulating stop- loss  insurance, inviting nefarious practices that could hurt consumers and  employers by creating loopholes for plans that will…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698382/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "Ms. OMAR. Mr. Speaker, as the ranking member of the Subcommittee on  Workforce Protections, I rise today to speak about the sweeping set of  proposals from Trump's Department of Labor that threatens worker  safety, fair pay, and basic protections for millions of Americans.\n\nThe Department is moving to rewrite or repeal more than 60 workplace  regulations.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695573/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…about your benefits. Those folks  are being terminated, but this is the President who is all about  workers first, which is why I had to drive down to the city to the  Department of Labor and see the President's face on the big, old  banner.\n\nWhy are we spending money on these banners but cutting money to  farmers? Because dismantling USAID and cutting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…mechanisms of  progression, and the effective and efficient path to better patient  outcomes.\n\nMost recently, I worked with FSR to address a lack of clarity from  the Department of Labor regarding whether or not clinical trial  participation was a permissible use of leave under the Family and  Medical Leave Act (FMLA). Like other chronic and rare disease…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689983/recognizing-the-month-of-april-as-sarcoidosis-awareness-month"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…the subject of  expensive litigation and ensures that the Federal Government does not  set a standard that it cannot reasonably expect to enforce. It also  helps the Department of Labor focus on real wage violations instead of  technical paperwork issues.\n\nLet's help small business. Let's help employers. Let's do the right  thing. Let's not work for…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698966/tipped-employee-protection-act"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…B-329926, Sept. 10, 2018.\n\n47. B-335629, July 8, 2024.\n\n48. B-274505, Sept. 16, 1996.\n\n49. B-238859, Oct. 23, 2017.\n\n50. B-329926, Sept. 10, 2018.\n\n51. United States Department of Labor v. Kast Metals Corp.,       744 F.2d 1145, 1153 (5th Cir. 1984).\n\n52. See, e.g., B-329065, Nov. 15, 2017; B-238859, Oct. 23,       2017; B-275178, July 3,1997.\n\n53.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693085/us-government-accountability-office-legal-opinion"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…referring to in this bill  is a part of the Department of Energy. All through government, we have  councils of people that are experts in their fields who come to D.C.  The Department of Labor has them. People from the labor community come  and have councils to give advice on bills.\n\nWe know we have ample crude. We know the ingenuity of the American  people…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…reinforces the idea that retirement plans exist for one reason: to  help Americans retire with stability and security.\n\nH.R. 2988 codifies the principles in the Trump Department of Labor's  2020 rule on retirement plan ESG investing.\n\nUnder the bill, as with the 2020 Trump rule, if a fiduciary finds  that an ESG factor is a financial factor, then that…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Mr. Speaker, I thank President Trump and his Department  of Labor for stopping an administrative rule that was going to get rid  of 14(c) certificates, which are so vital for the lives of our disabled  citizens as they pursue good…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694041/opportunities-to-stay-in-place-for-disabled-workers"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…B-238859, Oct. 23, 2017.\n\n45. See North Dakota RMP, at 15-20, 96-98.\n\n46. B-336217, Aug. 6, 2024; B-334045, July 5, 2023.\n\n47. B-329926, Sept. 10, 2018.\n\n48. United States Department of Labor v. Kast Metals Corp.,       744 F.2d 1145, 1153 (5th Cir. 1984).\n\n49.See, e.g., B-329065, Nov. 15, 2017; B-238859, Oct. 23,       2017; B-275178, July 3, 1997.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693059/us-government-accountability-office-legal-opinion"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Bearden, a resident of Savannah, Georgia, who will serve as the  Deputy Assistant Secretary for the Employment and Training  Administration, ETA, at the United States Department of Labor.\n\nMs. Bearden earned her bachelor's degree in political science from  Columbus State University in Georgia and her master's degree in public  administration from Auburn…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690088/recognizing-deputy-assistant-secretary-lori-frazier-bearden"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…government shutdown and fully fund the following departments and  agencies for the remainder of fiscal year 2026:\n\nPresident Trump's Department of Defense, President Trump's Department  of Labor, President Trump's Department of Health and Human Services,  President Trump's Department of Education, President Trump's Department  of Transportation, President Trump's…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…(3) recommend specific short- and long-term actions the       Department of Transportation, the Department of Defense, the       Department of Veterans Affairs, or the Department of Labor       can take to help members of the Armed Forces eligible for       preseparation counseling under section 1142 of title 10,       United States Code, and veterans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695018/transitioning-retiring-and-new-service-members-to-port-ocean-rail-and-truck-jobs-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…established by       the Commission to reflect the change in the Consumer Price       Index for All Urban Consumers published by the Bureau of       Labor Statistics of the Department of Labor.\n\nMr. Speaker, I rise in strong support of this bill, H.R. 3382, the  Small Entity Update Act.\n\nSmall businesses are the backbone of this country. Everyone on both…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693957/small-entity-update-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…of  Justice, Attorney General Bondi, FBI Director Patel, and DOGE that they  identified and eliminated this violation of the sanctity of our  elections process.\n\nThe Department of Labor and the Department of Agriculture are working  to make sure that illegal immigrants are not receiving Federal benefits  that they are not authorized to receive, such…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…this section, the       term `Consumer Price Index' means the Consumer Price Index       for All Urban Consumers published by the Bureau of Labor       Statistics of the Department of Labor.''.\n\n(b) Clerical Amendment.--The table of sections at the       beginning of chapter 19 of such title is amended by inserting       after the item relating to section…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689629/fairness-for-servicemembers-and-their-families-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Health and Human       Services, the Department of Homeland Security, the Department       of Housing and Urban Development, the Department of the       Interior, the Department of Labor, the Department of       Transportation, the Department of the Treasury, the Commodity       Futures Trading Commission, the Consumer Product Safety       Commission,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697203/count-the-crimes-to-cut-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…members  work in healthcare and most of those are in long-term care. ANFP's  Youth Apprenticeship Program is based in the CDM, CFPP credential and  was approved by the U.S. Department of Labor in 2022.\n\nThe CDM, CFPP credential is a source of pride for those who achieve  and maintain it. CDM, CFPP credential holders are committed to ensuring  our vulnerable…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697863/recognizing-the-national-certified-dietary-manager-cdm-and-certified-food-protection-professionals-cfpp-day"}]