[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Speaker, I rise today to condemn in the strongest  possible terms the illegal and unconstitutional dismantling of the  Department of Education by the Trump administration.", "title": "Trump Administration Dismantling Department of Education", "date": "2025-12-02"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "Department of Health and Human Services--          Applicability of the Congressional Review Act to Policy           on Adhering to the Text of the Administrative Procedure           Act.", "title": "Government Accountability Office Legal Opinion", "date": null}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "Treasury Department took a positive  step.", "title": "Authorizing Representation By the Senate Legal Counsel in the Case of Desmond Bellard V. Ronald Wyden, U.S. Senator", "date": "2025-04-10"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "They even had their Justice Department's two highest officials try  to coerce a House Member to take their name off the discharge petition  that finally triggered the approval of this legislation.", "title": "Release of Epstein Files", "date": "2025-11-19"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "But, certainly, for what this body needs to do this week, it seems  abundantly clear that we need to separate out the budgets for a bunch  of other Departments and Agencies from the Department of Homeland  Security.", "title": "-9999", "date": "2026-01-28"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "This means a fully staffed and funded  Department of Veterans Affairs.", "title": "Aces Act", "date": "2025-05-05"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "In every  State, a police officer would be able to purchase an older gun from  their department at a discounted price.", "title": "Providing for Consideration of H.R. Improving Law Enforcement Officer Safety and Wellness Through Data Act; Providing for Consideration of H.R. Leosa Reform Act; and Providing for Consideration of H.R. Federal Law Enforcement Officer Service Weapon Purchase Act of 2025", "date": "2025-05-14"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "I also strongly oppose the Trump administration's ongoing plans to  fold the CPSC's mission into the Department of Health and Human  Services with a smaller budget, fewer expert staff, and a narrower  mission.", "title": "Awning Safety Act of 2025", "date": "2025-06-23"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Donald Trump found the time to extort  $230 million from the Department of Justice so he could line his  pockets.", "title": "Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "Department of the Interior,                               Bureau of Ocean Energy Management,                                Director's Order, December 22, 2025.", "title": "Permitting Reform", "date": "2026-01-07"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Meanwhile, the Social Security Administration says they are not  closing any offices; but the so-called Department of Government  Efficiency, DOGE, is attempting to weaken and dismantle a system which  has stood tall for almost a century, created by Franklin Delano  Roosevelt.", "title": "Protecting Social Security", "date": "2026-02-10"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "Responding parties initially included Washington, D.C., Fire and  Emergency Medical Services, the Metropolitan Police Department,  Virginia State and municipal police departments, and multiple Federal  agencies, including the NTSB, FBI, and U.S.", "title": "Expressing Condolences to the Families, Friends, and Loved Ones of the Victims of the Crash of American Eagle Flight 5342 and Pat 25", "date": "2025-03-03"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Neither of my colleagues who is on the floor has said a word  explaining why they won't put the plaque up to honor hundreds and  hundreds of police officers on the Capitol Police force, the  Metropolitan Police Department, and the Montgomery County Police  throughout the region who came to defend us.", "title": "Condemning the Violent June 2025 Riots in Los Angeles, California", "date": "2025-06-27"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Speaker, I rise today to condemn in the strongest  terms the attack by DOGE on the Women's Bureau at the Department of  Labor, the only Federal agency representing women in the workforce.", "title": "Supporting the Women's Bureau At the Department of Labor", "date": "2025-05-14"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "That is over a trillion dollars to  Trump's so-called Department of War, even after the Pentagon failed  seven audits in a row.", "title": "Taxing Excessive Ceo Pay", "date": null}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "People at the State Department said that we  shouldn't do it because it leads to dislocation.", "title": "Providing for Consideration of Senate Amendment to H.R. One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "John Thune", "party": "Republican", "sentence": "She will bring valuable experience, an incredible work ethic, and a  passion for education to her new role leading the Department of  Education.", "title": "Nomination of Linda McMahon", "date": "2025-03-03"}, {"senator": "John Carter", "party": "Republican", "sentence": "There he implemented the first  Biometric Identification Fingerprint System, significantly enhancing  the use of technology to expedite time-critical and sensitive data for  the Department of Defense and the Air Force.", "title": "Saluting the Service of Master Sergeant Duane C. Bygum, Jr.", "date": "2025-03-31"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "The Centers       for Medicare & Medicaid Services (CMS), within the Department       of Health and Human Services (HHS), is responsible for       maintaining the federal Marketplace and overseeing state-      based marketplaces.", "title": "Breaking the Gridlock Act", "date": "2026-01-08"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "In 1975, he answered that call by joining the Floral  Park Fire Department as a volunteer firefighter, which would only be  the start of his overall 50-year journey in fire service.", "title": "Recognizing Larry Newman's 40 Years of Service with the Yardley- Makefield Fire Company", "date": null}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "This bill complements those efforts by requiring the State Department  to identify and report on individual gangs tied to gang activity and to  impose sanctions on those responsible.", "title": "Haiti Criminal Collusion Transparency Act of 2025", "date": null}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "2988 codifies the principles in the Trump Department of Labor's  2020 rule on retirement plan ESG investing.", "title": "Protecting Prudent Investment of Retirement Savings Act", "date": "2026-01-15"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "Every dollar of  discretionary spending, which fully or partially funds every department  within the Federal Government, is now borrowed.", "title": "Yosemite Belongs to the People", "date": "2025-03-05"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "However, the language allows the Department of War  to continue to perform an array of gender-affirming child abuse on  military dependents and to continue to mutilate our servicemembers.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "Since 1985, the Florida Department of Agriculture and Consumer  Services, in partnership with the Florida State Fair Authority, has  recognized an outstanding Woman of the Year in Agriculture.", "title": "Recognizing Reba Y. Mazak", "date": "2026-02-09"}, {"senator": "John Thune", "party": "Republican", "sentence": "Most recently, in 2024, they  locked arms and voted to turn a blind eye toward a monthslong  deployment of troops for President Biden's disastrous floating aid pier  to Gaza, even while Biden's own Defense Department called it an active  war zone and the pier was fired upon twice.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "To prove that point, I will reference an  article from earlier this week, from July 12 of 2025: This week the  Trump administration, the State Department, and the DOD approved $100  million to go to the LAF for the Super Tucano aircraft.", "title": "Department of Defense Appropriations Act, 2026", "date": "2025-07-17"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "Department of the Treasury can postpone  tax filing deadlines for taxpayers who have been affected by federally  declared disasters, but right now, Treasury does not have the authority  to provide relief for State-level declarations.", "title": "Filing Relief for Natural Disasters Act", "date": "2025-03-31"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "The medal of sacrifice will ensure that when a family member, a  spouse, a son, a daughter, or a department, that when they reflect on  the end of watch for their friend or their hero or their loved one,  they will know that it is the whole of America that remembers with  them.", "title": "Medal of Sacrifice Act of 2025", "date": "2026-02-02"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "The subcommittee for which I am responsible in this Congress as the  ranking member is the appropriations for the Department of Defense and  for Intelligence Communities.", "title": "Appropriations", "date": "2026-01-30"}]