[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…try to close the Department of Education  and slash education funding, food assistance, and health insurance but  somehow manage to find and give $170 billion to the Department of  Homeland Security to carry out an inhumane mass deportation agenda. It  is tragic, and it is pathetic.\n\nThis administration has declared war on public education, but we are…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697292/trump-administration-dismantling-department-of-education"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…was challenged in court. This attempt has been successfully halted.\n\nIn February, over a dozen religious organizations filed a lawsuit.  These organizations sued the Department of Homeland Security after the  administration rescinded guidance that would prevent immigration  enforcement in sensitive locations, like schools, hospitals, and houses  of worship.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690851/opposing-illegal-power-grabs"}, {"senator": "Diana DeGette", "party": "Democrat", "sentence": "…orders, and shooting and killing immigrants and  American citizens alike.\n\nI cosponsored Articles of Impeachment against Kristi Noem, and I  voted against funding the Department of Homeland Security to hold this  administration accountable.\n\nICE must be defunded and dismantled. I am working to take the $75  billion that Republicans gave to ICE in the big,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699910/holding-ice-accountable"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…my congressional oversight  authority granted under appropriation laws.\n\nUnder the law, Members of Congress have the authority to enter any  facility operated by the Department of Homeland Security used to detain  people. Whether the facility is formally identified as a detention  facility is irrelevant.\n\nThe operational capacity of agents and staff at…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…$1.2 trillion. The Committee on Homeland  Security and I have relied on Mr. Dodaro's deep experience and  knowledge of Federal programs and operations to shape the Department of  Homeland Security and protect civil rights and civil liberties in the  post-9/11 era.\n\nThe teams at GAO led by Mr. Dodaro have made Americans safer, made  their government…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698469/recognizing-the-service-of-us-comptroller-general-gene-l-dodaro"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…declared an emergency. Aren't we going to indicate that we  are going to deal with FEMA and help people out?\n\nVery simply speaking, it is a simple premise. Let's take the  Department of Homeland Security bill where we have major agreement on  the bulk of the bill, let us pass the bill in that context and fund  those agencies, take care of those folks, and fight…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700220/homeowner-energy-freedom-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…six months. A       federal court ruled the action unlawful and restored the       February 3, 2026 expiration date. Despite this ruling, in       late 2025, the U.S. Department of Homeland Security announced       it would not renew Haiti's TPS designation beyond that date.\n\nLCR strongly condemned this decision. Terminating TPS amid       Haiti's ongoing…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…saw. We all know what we saw. I remain hopeful that Leader  Thune and other Republicans can walk us back from the brink, but I am  not so sure anymore.\n\nSo as Trump's Department of Homeland Security raises the stakes and  continues with a series of provocations to justify increasingly  authoritarian actions, we have two obligations. One is to establish…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692449/alex-padilla"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…investigations and justice for  Renee Good and Alex Pretti and the many others who had their rights  violated by this administration.\n\nThere must--must--be new leadership at the Department of Homeland  Security, and Kristi Noem must resign. That is what you do with $75  billion? You put bounties on legal citizens? You break out windows of  people with disabilities…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Ms. DeLAURO.  7481, the Department of Homeland Security Appropriations Act,  2026, and ask for its immediate consideration in the House.", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700239/request-to-consider-hr-department-of-homeland-security-appropriations-act-2026"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "…Violations of law, violations of the Constitution, and violations of  civil rights are happening here in America at the hands of the American  Government, specifically, the Department of Homeland Security. This  cannot stand.\n\nMr. Speaker, I urge all of my colleagues to vote ``no.''", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699352/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…cut D.C.'s local budget by about a billion dollars  last year.\n\nH.J. Res. 142 will also cause chaos in the D.C. tax filing season,  which has already begun. Trump's Department of Homeland Security is  doing horrific things across the country. The DOJ is defying the law to  withhold the Epstein files. We are dealing with a cost-of-living crisis  across…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699683/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…expert decide what should be disclosed in real time. What  goes on at the border in real time is the key here.\n\nWe support full transparency and accountability of the Department of  Homeland Security. That is why a lot of us, including yours truly, were  going to those ICE detention centers in my district for the last 2  weeks. I could  walk in, and I…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693071/special-interest-alien-reporting-act-of-2025"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…this Capitol, assaulted Capitol Police, and terrorized  everyone in this building--where they voted to allow them to work for  the Federal Government, including the Department of Homeland Security.\n\nI ask: How can you deport an American? Where are you going to deport  an American to?\n\nI don't understand.\n\nI have yet to see anything from the Republicans…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…help us build and maintain our Nation's security capabilities.\n\nSpecifically, this bill provides participating cities with more  reliable guidance and support from the Department of Homeland  Security's Securing the Cities program, which seeks to reduce the risk  of terrorist attacks in high-risk urban areas, like my hometown of New  Orleans.\n\nI want to…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688698/securing-the-cities-improvement-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…of this Act, the Secretary of       Homeland Security, acting through the Director of the       Cybersecurity and Infrastructure Security Agency (CISA) of       the Department of Homeland Security, in consultation with the       Attorney General, the Director of the Federal Bureau of       Investigation, and the heads of appropriate Sector Risk…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "Mr. GARBARINO. Madam Speaker, I move to suspend the rules and pass  the bill (H.R. 2261) to amend the Homeland Security Act of 2002 to  enhance the Department of Homeland Security's oversight of certain  intelligence matters, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696751/strengthening-oversight-of-dhs-intelligence-act"}, {"senator": "John Rutherford", "party": "Republican", "sentence": "Mr. RUTHERFORD. Mr. Speaker, today I rise in support of the fiscal  year 2026 Department of Homeland Security Appropriations Act and urge  my colleagues to do the same.\n\nThis bill champions public safety, and it refocuses the Department of  Homeland Security back on…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699353/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…urge all my colleagues to support this bill and to  protect our children.\n\nMr. GOLDMAN of New York.\n\nMr. Speaker, I rise in support of H.R. 2259, a bill directing the  Department of Homeland Security to develop a national strategy to help  secure our elementary and secondary schools from acts of terrorism.\n\nThis bill moves us in the right direction. It…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696997/national-strategy-for-school-security-act-of-2025"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…grown its presence throughout the United States.  It is growing every day and includes growth in my home State of North  Carolina. My legislation would require the Department of Homeland  Security to conduct a comprehensive border threat assessment to  identify the criminal threats posed by TdA members, the threats that  are posed to our communities,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696955/tren-de-aragua-border-security-threat-assessment-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…for other purposes, and ask  for its immediate consideration in the House.\n\nThe Clerk read the title of the bill.\n\nMr. Speaker, I rise in support of H.R. 7147, the Department of  Homeland Security Appropriations Act.\n\nThis bill marks the final measure of our FY26 agenda. Our work here  is about one of the most important duties, which is keeping the…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699354/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Management Program       established under section 3608 of title 44, United States       Code; and\n\n(C) the Cybersecurity and Infrastructure Security Agency of       the Department of Homeland Security, for a case in which the       project is in coordination with a Federal agency with       stringent security requirements.\n\n(b) Deadlines.--\n\n(1) Shared services…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "…professionals, women and men who put their lives on the line  to keep us safe, and they will do a great job for us in investigating  what could be done better.\n\nThe Department of Homeland Security should take this opportunity to  review its policies and procedures because of this investigation to  determine if there are areas to improve upon.\n\nOne of…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699924/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…destruction that was in western North Carolina and  the lack of response in so many ways.\n\nJust to kind of put some points on that with some numbers, according  to the Department of Homeland Security's inspector general, FEMA could  not account for $7.4 million out of an audit sample of $12.9 million.  These sound like small numbers, but that is an audit…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…world's most dangerous, and  hardened criminals. As the Acting Deputy Executive Associate Director,  he was appointed the Deputy Senior Coordinating Official for the  Department of Homeland Security Southwest Border Coordination Center,  where he served as the liaison between numerous federal agencies,  managing the complex challenges of our Southwest…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692698/recognizing-st-paul-minnesota-immigration-and-customs-enforcement-field-office-director-peter-berg"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…already authorized to receive funds from the  Environmental Protection Agency, but this bill will allow the IBWC to  partner with other agencies and entities, such as the Department of  Homeland Security, to address the maintenance backlog for critical  water infrastructure.\n\nThis legislation will allow the IBWC to access more funding sources  so it can maintain…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692167/international-boundary-and-water-commission-authority"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…section 103--\n\n(A) by amending subsection (c) to read as follows:\n\n``(c) Secretary of the Coast Guard.--When the Coast Guard       is operating as a service within the Department of Homeland       Security, to assist the Secretary in the performance of the       Secretary's functions, there is a Secretary of the Coast       Guard who shall be appointed…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…the end of the day, illegal alien criminals who threaten our  communities have no right to be here in the first place. State and  local governments must work with the Department of Homeland Security to  share information on individuals they arrest. They must also honor  lawful detainers. When they do not, Congress must act.\n\nH.R. 2056 ensures that the…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692370/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…amend the Homeland Security Act of 2002 to  reauthorize the State and local cybersecurity grant program of the  Cybersecurity and Infrastructure Security Agency of the Department of  Homeland Security, and for other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 5078…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696787/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…law  on top of the previous packages, we will have funded 96 percent of all  of government.\n\n(Applause.)\n\nMr. President, the package also continues funding for the Department  of Homeland Security for 2 weeks to allow us additional time to  evaluate further changes in ICE procedures beyond those that we have  already included in this bill.\n\nLet me end…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699433/consolidated-appropriations-act-2026"}]