[{"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…celebrate the success of California's  small businesses. But more importantly, I celebrate the return on  investment (ROI) that benefits the entire Nation. While estimates vary  depending on the scope and methodology of each study, the studies I  have seen report a ROI of at least 10:1. That is a remarkable win for  the taxpayer for a relatively small investment.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695449/extension-of-sbir-and-sttr-authority"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…the removal of lifetime caps are also essential. My youngest child  required medical care that I simply cannot afford, costing between  $750,000 and $1 million per year, depending on how stable her health  is. I work part time, but the caregiver burden is too demanding for me  to maintain a full-time job. As a single, widowed mother, Medicaid has…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Mr. Speaker, this year, I received a letter from Rachel,  a mother in my district with stage IV lung cancer who is living on  borrowed time. She is depending on future innovation driven by NIH  research to see her son grow up.\n\nHer words are more powerful than mine, so I will read them directly.  ``I could write endless words…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692074/condemning-anti-semitism"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…billion import partner with Canada--20 percent  tariff. China--a lot of input from China that our manufacturers use--54  percent tariff, plus who knows how many more tariffs depending on the  day and how President Trump feels when he wakes up. Trinidad and  Tobago: 81 million, 10 percent tariff. Germany: 75 million. Mexico: 77  million.\n\nVery frustratingly…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…gotten away from that, Mr. Speaker. We better get back to it  because the American people are losing faith that this body, Congress,  will do its job. We better do it. They are depending on us to. They  have told us they are worried. We heard the stories tonight. This is  just one thing people are worried about.\n\nWe need to get back to our better nature.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…by a large majority of congressional Republicans and Democrats, to  be made available to those who need them most. Women and girls in  dozens of the poorest countries are depending on these commodities to  take control of their lives. Destroying them is antithetical to  America's long-held values and reputation of safeguarding public health  around…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696465/womens-health"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…mitigation does  just as much harm as firing those that we think of as being on the  front lines. They work together.\n\nI also want to mention, imagine if you were a firefighter depending  on that support staff to tell you when the weather conditions change,  when the winds are shifting, because that matters for your own survival  as you are fighting these…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…children       after school or at night; others had kids absent due to       illness.\n\nNot all children who are enrolled are present in child care       at the same time, depending on their families' schedules.\n\n``They (are) just accusing us. And that's lying. And that's       wrong for you to put lie(s) out there,'' Khalif said.\n\nReichert told the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…health insurance issue. It is no secret what  happened in this Chamber over the last several weeks and months. We had  the longest government shutdown in history--42, 43 days, depending on  how you calculate it, but it was a record.\n\nThe issue was whether or not we would do something to provide health  insurance to some 20 million Americans who stand to…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…guaranteed, they are going to  need healthcare. They don't know if they are going to be able to pay  for it. We will continue to raise these stories because too many people  are depending on Congress to act. Their lives literally depend on it.\n\nHopefully before December 31, we will find the political will to  extend these tax credits. If we don't, we better…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Mr. MARKEY. Well, a small business is defined in the Small Business  Administration definitions, and those would be the ones which we would  exempt. And it can be different, depending upon the industry or its  status, but, in general, what we are using is the definition used by  the Small Business Administration.\n\nMr. MARKEY. First of all, I want to say…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…services. These anti-abortion  efforts have disproportionately harmed some students whose access to  services and information is affected by their geographical barriers,  depending on where they are in college.\n\nPregnant and parenting students deserve access to a full range of  family planning resources and reproductive healthcare options that keep…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699313/pregnant-students-rights-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…money in the coffer coming out of your pocket so that it could  then be--some of it--you don't get back dollar for dollar--you might  get some of it back. You may not get any depending on your tax  circumstance. The billionaires will get plenty. You may not get any.\n\nThis is a stealthy way of doing business. It is a steal. This is why  it is the art of…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…time and again for manufacturing  employment in the United States.\n\nHere is the history: Here we have, since before I was born, the  history of U.S. manufacturing employment, depending on which party held  the Presidency. You can see the huge job increase when FDR--that was  when we were coming out of the Depression, which is understandable. It  continued…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695605/devastating-harm-caused-by-trump-administration"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…family is going to face if the Affordable Care credits expire.\n\nNo. 1, as Senator Shaheen said, this can't wait. The date is going to  arrive; the tax credits expire; people depending on that healthcare  won't have it. Twenty-four million Americans will face higher costs.\n\nAgain, I want to emphasize that is not 24 million Democratic  families; that is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…written that had       nothing false in it. Only one book is 100 percent true: the       Bible. God cannot lie and we may be certain that every word       of the Bible is true.\n\nDepending on the translation, Jesus 75-80 times in the       Gospels uses the phrase ``I tell you the truth'' or       variations of it and in John 14:5 he is even more specific…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694761/recognizing-campbell-the-nature-of-truth-odessa-american"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…1980 caused more than $1 billion in  damage. Adjusting for inflation, that figure would now exceed $4  billion.\n\nDamage estimates for volcanic eruptions can swing wildly, depending  on many factors, but are almost always severe, underscoring the need  for early warning and monitoring.\n\nObviously, protecting human life is our paramount concern in  monitoring…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698113/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…look, the Senate's committee process exists, and it exists for a  reason. It exists for exactly these sets of reasons. While it might  have slightly different implications depending on the committee  involved and depending on the type of legislation, there are reasons  why these things are there, and almost regardless of which committee is  affected,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698296/9999"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…dishwashers.\n\nThe argument is they are going to pay more up front, but they are  going  to make it back in efficiency over time. A refrigerator takes 6 years  and sometimes, depending on which model you buy, 46 years to recoup the  increase in the value. These are Department of Energy numbers. It is up  to 10 years on refrigerators.\n\nThe question is: Do…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700166/dont-mess-with-my-home-appliances-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…are a lot of folks who think that Medicare itself is paid for by  your payroll tax. It is actually about 38 percent of that. As a medical  enrollee, you pay--the total cost, depending if you are in Medicare  Advantage, which is--what?--55 percent of the population. The others  are maybe in part A, part A and part B.\n\nFifteen percent is sort of paid by…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…don't blame  another Member of Congress. We have this current reconciliation budget  and another one that sort of starts again this summer because,  remember, functionally, depending on timing, we could have three bites  at the apple on reconciliation.\n\nWhy do we do reconciliation? It is a way to get through the  filibuster in the Senate under the 1974…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…reverse of the medal is sandblasted and bears an engraving of       the names of the fallen heroes. The medal is suspended from a       ribbon, either Azure or Gules depending on the fallen hero       being honored. The ribbon bail is prepared and attached by       hand soldering to the back of the medal. The medal is crafted       from Silver…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699505/medal-of-sacrifice-act-of-2025"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…agencies, affect direct spending,       revenues, and spending subject to appropriation, CBO expects       that enacting the bill could have significant budgetary       effects, depending on the extent to which judges choose to       rely instead on other types of relief like vacatur. CBO       cannot predict what actions will be litigated or the       decisions…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…over. We will tell you  more about it. We will know when the war is over whether it actually  was a war and whether we should have voted to initiate war when the war  is over depending on how many people die.\n\nAnd then they say: Well, we are going to look at the scope, extent,  and duration of the war, but since we don't know what that is, we are  going…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699091/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…it can be to marry up the Federal standards with these new  California standards. It is essentially allowing some Federal credits  to be transferred to the California pool depending on vehicle sales in  California. Confusing, convoluted, and hard to follow. You bet it is.\n\nAnother burden that manufacturers will have to account for are  extended engine…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690434/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "John James", "party": "Republican", "sentence": "…nefarious foreign adversaries; this includes the Chinese Communist  Party. The threat from China is real, and the time to act is now.\n\nDuring COVID, we witnessed the risks of depending on a hostile supply  chain with shortages in medicine, PPE, ventilators, and critical  healthcare supplies when they forced us to rely on our adversaries for  these lifesaving…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690187/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…moms, people who are sick, the frail--that  population, even under today's law, gets a Federal--we will call it a  match; it is really a formula--a match of 50 to 70 percent, depending  on the jurisdiction. Is that correct?\n\nMr. ROY. Let's fast-forward. What we are really talking about--for  everybody at home watching C-SPAN, all 14 of you--we have a situation…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690587/economic-anxiety"}, {"senator": "French Hill", "party": "Republican", "sentence": "…effects.\n\nUncertainty: CBO did not estimate any budgetary effects       arising from changes to the banking system or financial       markets as a result of enacting H.R. 3633. Depending on their       individual design and extent of adoption, virtual currencies       could enhance the efficiency of the system, cause disruption,       or reduce bank deposits.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693775/digital-asset-market-clarity-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…potential differences in the procedures and       responsibilities, Department of Veterans Affairs resources,       and legal resources described in subsection (a)(1)(A)       depending on the operating environment in which an incident       of covered misconduct occurred;\n\n(iv) the investigation of alleged incidents of covered       misconduct, including…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…billion. He is right, but that is actually not what is in  the document here. It is functionally 1.2 with a shock absorber. Once  again, I will give you the shock absorber, depending on what Ways and  Means ultimately does. I thank the gentleman again. It shows we  actually are fairly close on math.\n\nAnother thing, and this is just someone who actually…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}]