[{"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…losing their jobs. From every corner of our State, New Mexicans are  speaking out with one clear message: Do not mess with public  broadcasting.\n\nRadio is one of the most dependable ways to get information out when  disaster strikes a community. I have witnessed this firsthand. That is  why the Federal Government must do everything it can to support…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693299/9999"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…all of our cities and towns.\n\nGeothermal energy doesn't depend on the weather. It doesn't depend on  the season or geographical conditions. It exists as a consistent and  dependable source for a clean energy grid. When you go underground,  generally, you have a 45- to 75-degree constant temperature all year  long.\n\nThe United States has enormous untapped…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…is a  cornerstone of energy resilience in Southeast Louisiana, playing a  vital role in meeting the power needs of nearly half a million  customers by providing a maximum dependable capacity of 1,152 megawatts  and contributing to grid stability during periods of peak demand and  extreme weather events.\n\nWaterford 3 employs more than 800 employees and…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696712/recognizing-the-40th-anniversary-of-entergys-nuclear-power-site-waterford-3-steam-electric-station-in-killona-louisiana"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…Augusta radio  host Austin Rhodes on the recent announcement that he will be inducted  into the Georgia Radio Hall of Fame.\n\nFor over 30 years, Austin has been a consistent and dependable voice  as the host of the ``Austin Rhodes Show'' on WGAC, making it one of  Georgia's longest running weekday drive-time talk shows.\n\nNearly 3 years ago, I stood before this…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692847/congratulating-austin-rhodes"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…strengthens our economy at  the same time.\n\nAcross this country, millions of Americans are doing two full-time  jobs at once. They are employees striving to be productive and  dependable at work, and they are caregivers--parents of young children,  sons and daughters caring for aging parents, or both. These  responsibilities do not disappear when the workday…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699006/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Communications Director of the full Committee on Energy and  Commerce. Since becoming Chairman of the full committee, Christopher  has been an expert policy communicator as a dependable and reliable  member of my team serving as Senior Communications Advisor.\n\nRecently, Christopher departed the Committee on Energy and Commerce  to accept a role as the Director…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690570/recognizing-christopher-krepich"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…shortages. In some cases, this even forced  the closure of Federal buildings to the public.\n\nThe POST Act would require FPS to either fix PTS or replace it with a  modern, dependable solution.\n\nH.R. 3425 contains practical measures to improve FPS' oversight of  contract guards, strengthen accountability, and improve safety at  Federal buildings.\n\nMr.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695058/personnel-oversight-and-shift-tracking-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…National Junior Honor Society. She  jumps in wherever needed and always goes above and beyond. She is kind- hearted and compassionate towards all students and families. She is  dependable, hardworking, and efficient. Mary has a great rapport with  our students, staff, and other volunteers.\n\nIt is clear Mary Miller has made a profoundly positive impact on our…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691273/recognizing-mary-miller"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…that electric grid is under  real pressure. Demand is climbing fast and driven by manufacturing, by  technology, and the needs for a modern economy while large amounts of  dependable thermal generation are scheduled to retire.\n\nMr. Chair, when you put those two trends together, you get a grid  that must work harder than ever and cannot afford any weak…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697893/electric-supply-chain-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…sales. It reduces royalty rates on  oil, gas, and coal production, and it incentivizes production, thereby  lowering energy costs and supplying our country with domestically  dependable energy.\n\nThat is just the beginning. The bill also invests in crucial water  resource infrastructure and helps implement President Trump's executive  orders on forest management.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693178/one-big-beautiful-bill-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…home in 2010, Mayor Taylor has  never simply lived in the community--he has poured his heart into it.  Over twelve years as Mayor, he has provided thoughtful, measured, and  dependable leadership. He has been a steady hand through times of  growth and challenge, always guided by what is best for the families  and officials who rely on Borough government…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697645/commending-mayor-joe-taylor-for-his-dedicated-service-to-langhorne-borough"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…and mandates with little coordination and even less  accountability. Instead of listening to grid operators, they raced to  advance extreme policies that threaten our most dependable power  sources with the American people paying the price.\n\nThe Reliable Power Act puts an end to this by preventing Federal  rules from moving forward if they threaten the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698277/reliable-power-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…STEM education and her students was unmistakable  and contagious. Her kindness and the time she gave to everyone who  stepped into our office enriched our team. She was the dependable,  welcoming smile that greeted us each day.\n\nHer time in our office was impactful and memorable, and it  permanently deepened my understanding of what it means to teach in…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697562/recognizing-albert-einstein-distinguished-educator-fellow-veena-black"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…Having heat provided by  natural gas is literally the difference between comfort and chaos, and,  yes, between life and death in States like mine.\n\nIf we want affordable and dependable energy in our country, then we  must build the infrastructure that delivers it. However, too often  these projects are delayed or blocked by a Federal permitting process…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698057/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…must address.\n\nWe know electricity demand is expected to grow significantly over the  next several years, which means this body has a duty to ensure our  constituents have a dependable grid that meets the needs of hardworking  families.\n\nMr. Speaker, unfortunately, both the Obama and Biden-Harris  administrations were guilty of using the EPA to promote…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698276/reliable-power-act"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…energy needs are rising.  Indiana is foremost a manufacturing State. About 45 percent of our  instate electricity generation comes from coal. That is the reality.  That means dependable, around-the-clock capacity isn't optional; it is  how the Hoosier economy runs.\n\nYes, the expectation was that four Indiana coal-fired power units  would be offline by 2024,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695511/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-emissions-budget-and-allowance-allocations-for-indiana-under-the-revised-cross-state-air-pollution"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Georgia Hospital Association.\n\nThis award recognizes the time, talent, and expertise of hospital  employees in their respective fields. Ms. Daniel exemplifies this by  being dependable, unfailing, and caring in all she does.\n\nIn addition to faithfully serving patients, Ms. Daniel has served as  director of perinatal services and secretary for the Georgia…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699261/recognizing-wayne-barth"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…well done.\n\nFor decades, these cooperatives and their workforce have provided  reliable energy and critical assistance throughout Northern Michigan.  In rural communities, dependable energy is not just a convenience: it  is the backbone of modern life and public safety. These cooperatives  consistently ensure that all residents of Northern Michigan--especially…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690150/thanking-northern-michigan-electric-cooperatives-and-linemen-for-restoring-power-throughout-northern-michigan"}]