[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Everett, WA, or cars and trucks from Detroit, MI.\n\nAmerican farmers rely on our economy to keep fields planted-- production in eastern Washington and northern and central Iowa depend  on the cost of fertilizer, seed, and equipment.\n\nSmall business owners across the country depend on consumer  confidence in our economy so that they can keep sales and stay…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689549/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…Government through our casework services.\n\nThat is one-half million dollars returned to veterans waiting on  care, to families caught in bureaucratic limbo, and to seniors who  depend on their Social Security checks to live with dignity.\n\nIf my constituents need help navigating a Federal agency, my team is  here for them. Visit dexter.house.gov or call 503-231-2300.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697289/oregons-third-district-constituent-services"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…common story that  we came across. A man came here more than two decades ago and worked a  blue-collar job. He raised his family in Texas. He has children whom he  loves and who depend on him. He hasn't committed any violent crimes or  sold any drugs. His only offense was a traffic stop. Now, he faces  deportation to a country he left decades ago.\n\nMy question…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695521/visit-to-bluebonnet-detention-facility"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…is over one in six residents in  the State.\n\nIt is unconscionable to give $2 trillion in tax breaks to the ultra- wealthy by defunding this food assistance American families depend on.\n\nMr. Speaker, we can do better.", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692160/snap-cuts"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…energy that is renewable, reliable,  and constantly available in those vast, underground, big pipes that run  through all of our cities and towns.\n\nGeothermal energy doesn't depend on the weather. It doesn't depend on  the season or geographical conditions. It exists as a consistent and  dependable source for a clean energy grid. When you go underground,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…protect the  ornamental reef species living in the fragile and invaluable ecosystems  of our world's endangered coral reefs.\n\nOur oceans, teeming with life and rich biodiversity, depend on the  health of coral reefs, some of the most biologically diverse ecosystems  on Earth. Nearly 25 percent of the ocean's fish rely on coral reefs for  shelter, food and…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688918/saving-nemo-act"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…Canada. A lot of Virginia peanuts  go to Canada. They are not going to be going. That is going to hurt our  economy. As a matter of fact, in Virginia, 280,000 jobs in Virginia  depend on trade and investment with Canada.\n\nI know, as Governor, I went--and I know, Senator Kaine, as Governor,  you went--because Canada is one of our best partners. What would…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689480/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…proposes gutting it, he is not just slashing spending, he  is taking away critical healthcare from children, from seniors in  nursing homes, and people with disabilities who depend on it to  survive.\n\nToday, in the Capitol, one of my dear friends is here visiting who  runs a hospice company. They provide dignity of care to people at the  end of their…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689782/defending-social-services-and-programs"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…of  their regional offices across the country abruptly closed. Medicaid  could face over $800 billion in cuts over the next 10 years. These  lifelines that working families depend on for affordable support  services are rapidly diminishing, largely due to this administration  and this majority's attack on these lifelines as ``waste.''\n\nThe resources…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699004/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…prevent youth violence, modernize  emergency response systems, strengthen wastewater infrastructure,  expand behavioral healthcare, and protect the clean water our  communities depend on.\n\nEach project came directly from local leaders working to solve urgent  issues on the ground, and I fought to make sure every single one  received funding.\n\nThis is what…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698771/delivering-on-commitments-to-oregons-third-congressional-district"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…no reason. They are doing a  great job.\n\nIt is the same on Long Island as on Staten Island, and it is the same  across all of America in poor communities, which, of course, depend on  Medicaid.\n\nFor so many people, Medicaid is their only lifeline to healthcare-- for middle-class communities and even well-to-do communities. All of  them are nervous, scared,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689512/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…workers and the communities surrounding these  facilities.\n\nWe heard a very impassioned speech by the gentlewoman from Akron,  Ohio, who talked about how much, in Akron, they depend on this industry  and want it to thrive. They have suffered over the years, not only the  people who work in the factory but the people of Akron and the  surrounding areas,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688531/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…predictable problem, but it is also a preventable  problem. The urgency of the crisis requires us to act now, and this  legislation is the roadmap for that action. Workers' lives depend on  it.\n\nI thank the gentleman from Arizona for forming the Extreme Heat  Caucus and for organizing this Special Order to give us the opportunity  to emphasize the importance…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695655/extreme-heat-caucus"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…don't know if they are going to be able to pay  for it. We will continue to raise these stories because too many people  are depending on Congress to act. Their lives literally depend on it.\n\nHopefully before December 31, we will find the political will to  extend these tax credits. If we don't, we better come up with a  solution to ensure that Americans…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…the emails and the phone  calls that are coming through, our constituents are asking: What are  you doing to defend me? What are you doing to protect the programs that  we depend on to stay alive? You need to do more.\n\nOne of the things that we have said in our townhalls, on the calls,  on the emails as constituents come to D.C. demanding that we protect…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…links and safeguarding future generations.\n\nMr. Speaker, this month, let us all honor Trinity's legacy by raising  awareness and championing early detection because lives truly depend on  it.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695612/recognizing-trinity-love-hoblit-foundation"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Biden-era delays on liquefied natural gas  export approvals. Delays discourage investment, undermine our energy  leadership, and threaten the security of our global partners who depend  on the United States to break free from harmful foreign influence.\n\nThe United States is blessed with abundant natural gas resources, and  our producers stand ready to meet…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697089/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…restored to the country, it will be  the most prosperous country in Latin America, having the largest  reserves of oil in the world, which will give them enough resources not  to depend on the charity of the United States or any other country to  fix the destruction that Maduro wrought.\n\nMr. Speaker, for those reasons, I strongly oppose this resolution,  and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698241/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…we can defend our  country and defend our people. Pass the SAVE Act, pass voter ID, and  secure American elections. Secure our border permanently instead of  just having it depend on the current President. Reform our immigration  system. Pause it. We have done it before. Pause it, review it, and stop  people from overstaying their visas. Fix the system.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…administration's 2022 plan imposed ``sweeping restrictions that curtail  responsible development, undermine congressional intent, and disregard  the well-being of the people who depend on these lands for both  subsistence and livelihoods.''\n\nThese communities are located in an area nearly the size of Minnesota  with no highway connections, extreme transportation…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696835/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…agree.\n\nWhat happens now matters greatly, both in terms of accountability for  Maduro and the future of the Venezuelan people. The long-term success  of this operation will depend on Venezuelans having the opportunity to  run Venezuela, with the support of international and private sector  partners.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698694/venezuela"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…and from the bilateral  free trade agreements the President intends to negotiate are  potentially explosive.\n\nNone of these reforms are in this resolution, but all of them depend  on this resolution. If anybody has a better alternative, they need to  bring it to a vote in both Houses this week. Otherwise, let us take a  little of Benjamin Franklin's…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689900/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…well. Every  American depends every single day on the high-quality, low-cost food  supply that our farmers and ranchers provide.\n\nAt the same time, our farmers and ranchers depend on access to  markets to ensure they get good prices for the high-quality crops they  produce. This is particularly true, for example, for soybean farmers in  my State of North…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696017/9999"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…able to access  additional reserves and would have to close. In doing so, the mine  would have to lay off hundreds of workers and devastate the surrounding  communities that depend on the coal mining industry to drive their  local economies.\n\nWith tears in his eyes, this electrician asked me to save his job and  save his livelihood so he could continue…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696882/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…infrastructure projects are critical to our growth, this reform is a  game changer. Too often, confusing, and inconsistent permitting rules  delay or derail projects that communities depend on, whether it is  water storage, energy development, or transportation.\n\nThe PERMIT Act is about delivering certainty and efficiency without  compromising environmental standards.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698029/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…able to hijack environmental agencies with no  authority over the grid to force shutdowns of power plants without  regard to the impacts on that very reliability I said we depend on.\n\nMadam Speaker, if the Biden EPA's radical clean power plan 2.0 had  gone forward, it would have shut down most of the Nation's coal-fired  power and threatened the closing…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698274/reliable-power-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…builds on the success of the JOBS Act by making it  easier for companies of all sizes to go public while maintaining the  transparency and investor protections our markets depend on.\n\nH.R. 3381 allows any company, not just emerging growth companies, to  test the waters by gauging investor interest before or after filing  with the SEC. It also ensures…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692737/encouraging-public-offerings-act-of-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…makes it  to President Trump's desk. When it does, the President will have a  generational opportunity to secure a brighter future for children  across the country. Their lives depend on the ability of us to act.                                  ______\n\nBy Mr. DURBIN (for himself, Mr. Merkley, and Mr. Bennet):\n\nS. 1749. A bill to prohibit United States Government…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…Mr. Speaker, I rise today in strong support of H.J.  Res. 35, legislation I proudly cosponsored to stand up for North  Dakota's energy producers and hardworking families who depend on  affordable, reliable energy.\n\nFor my first action as a Member of Congress, I wrote to President  Trump and Secretary Burgum urging them to repeal 20 unnecessary and  burdensome…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688186/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…U.S. coal  is being murdered. There has been an attack on it for many years, and  some people will not stop until they see it gone. That would be to our  own demise because we depend so much on the energy not only from coal  but from natural gas.\n\nWe need more nuclear power. We need more hydropower. We need all  kinds of new power, and this isn't the time…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}]