[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…with our forces and support these missions.\n\nThe HIV-AIDS epidemic has a devastating impact on many countries,  including on their militaries. It reduces readiness, unit deployments  become limited, and it saps the morale and capabilities of the infected  individuals and their communities.\n\nDOD's HIV-AIDS prevention program pairs health and security…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…(Expeditionary). And was responsible for more  than 10,000 Servicemembers, Civilians, and Contractors deployed  throughout the Central Command Theater of Operation.\n\nHer other deployments were in 2007 to the CENTCOM Deployment  Distribution Operations Center (CDDOC) at Camp Arifjan and Kuwait in  support of Operations Enduring Freedom and Iraqi Freedom. And…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692707/recognizing-deputy-chief-of-army-reserve-major-general-deborah-deb-kotulich-on-her-retirement-from-the-us-army-reserve"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…In this role, he  was responsible for ensuring that more than 1,000 military and civilian  personnel were mission-ready to defend our homeland and support  expeditionary deployments around the globe. Most notably, Colonel  Halasi-Kun has upheld the stellar reputation that has become associated  with Barnes, positioning the base to be selected as the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698681/recognizing-colonel-david-moon-halasi-kun"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…NDAA amongst a steady stream of  alarming misuses of the U.S. Armed Forces by President Trump. While in  office, the President has issued unlawful orders, directed unlawful  deployments, and has unlawfully misused Congressionally appropriated  funds. President Trump has chronically abused his executive authority  as Commander in Chief, and I do not believe…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…abroad. He has deployed the National Guard to the District of Columbia,  Los Angeles, Memphis, and Chicago and has attempted to deploy the  National Guard to Portland. These deployments are a flagrant violation  of U.S. law, including the Posse Comitatus Act, as noted in recent  court decisions. Not only have these deployments created chaos in  American…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…Armed Forces. It represents not just  injury, but sacrifice--the physical cost of defending our freedoms.\n\nCorporal Donald served honorably for over six years, including  deployments to both Afghanistan and Iraq. His time in uniform coincided  with some of the most dangerous years of conflict, ending in 2011.  During that period, he witnessed the loss…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691113/recognizing-the-incredible-service-of-united-states-marine-corporal-joseph-donald"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…September 11, 2001,  Sergeant Major Black deployed repeatedly to the frontlines of the  Global War on Terror. With the 2nd Battalion, 1st Marines, he completed  two combat deployments to Iraq during Operation Iraqi Freedom, and  later, with the 3rd Battalion, 7th Marines, he deployed twice more to  Afghanistan in support of Operation Enduring Freedom.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694958/recognizing-the-retirement-of-sergeant-major-troy-e-black"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…percent of arrestees.\n\nAnd people with no prior criminal backgrounds, including legal  residents and U.S. citizens, were swept up.\n\nAs the President flirts with future military deployments and  continues his militarized immigration raids, we know his campaign of  terror will not stop at Chicago.\n\nAnd while he failed in his attempt to use Chicago as ``training…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698781/operation-midway-blitz"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…doing. He is targeting and punishing the  cities who dare to push back against his abuse of power. And while he  is currently targeting blue cities with his lies, if these deployments  are not stopped, there will be nothing to stop him--or any future  President--from doing this to anyone, anywhere, for any made-up reason  that is also untethered to reality.…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696180/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…needs to become a parent. IVF isn't a luxury for  us. It is the only medical path we have to conceive, and TRICARE  completely ignores that reality. My husband served 11 deployments,  survived a brain injury, and has continued to serve, but we are told  the cost of growing our family is ours alone to carry.''\n\nLydia and her husband have tried everything…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697787/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Executive overreach but also the military  from becoming pawns in any kind of political game.\n\nThis legislation would create checks and balances, limit the scope of  these deployments, authorize extensions via joint resolution, and  create a judicial review process. These commonsense solutions would  amend an outdated law that no longer fully serves the…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696181/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…commissioned as a Military Police Officer. Over the next three decades,  she would shape readiness and emergency response both at home and  abroad through five major operational deployments, including missions  in Honduras, Saudi Arabia during Operation Desert Storm, Afghanistan  during Operation Enduring Freedom, Joint Task Force Panama, and the  Hungarian…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696265/recognizing-major-general-laura-clellan"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…investigations against his opponents and unilaterally defunded programs  that are important to our national defense and our security.\n\nWhile Republicans gleefully cheer on military deployments in American  cities, I bet they would lose their goddamn minds if those troops were  sent to their home States which have substantially higher crime rates.\n\nIf the real…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…during a tremendous upsurge in the two wars in Iraq  and Afghanistan, I visited our troops multiple times in the Green Zone  in Baghdad and in Afghanistan. I went to the deployments and the  homecomings; I went to the wakes and funerals, and I told myself when I  came to the Senate that, if I ever had the chance to stop this Nation  from getting into…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the Metropolitan Police Department (MPD). This bill  would apply to the current deployment of troops and any future  deployment.\n\nThe use of body cameras by troops during deployments related to crime  or civil disturbance in D.C. would promote transparency in the troops'  interactions with the public and protect the public and the troops. MPD  has a…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694758/introduction-of-a-bill-to-require-members-of-the-armed-forces-performing-active-service-in-the-district-of-columbia-in-response-to-an-order-of-the-president-which-relates-to-crime-or-civil-disturbance-in-the-district-of-columbia-to-participate-in-a-program-substantially-similar-to-the-body-worn-camera-program-of-the-metropolitan-police-department-of-the-district-of-columbia"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…I would also note that Presidential action like this is hardly  unheard of or unique. For context, as of the mid-20th century, scholars  identified more than 100 military deployments or actions that lacked  express prior congressional authorization.\n\nI could go back to the beginning of the Republic, with the Barbary  pirates off the coast of North Africa,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696118/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…drug trafficking. Sec. 273. Report on condition of aids to navigation. Sec. 274. Feasibility study on supporting additional port visits and                deployments in support of Operation Blue Pacific. Sec. 275. Study and gap analysis with respect to Coast Guard Air                Station Corpus Christi aviation hangar. Sec. 276. Report…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…United States  Navy in 2005 and has since held numerous assignments, including on the  USS Maryland (SSBN-738), USS John C. Stennis (CVN 74), and successfully  completed two deployments.\n\nThroughout his service, he has not only accumulated over 2,000 flight  hours in various  aircraft, but numerous military decorations, including the CAPT Tim  Tibbets Leadership…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690861/change-of-command-daniel-russell"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…not in a better strategic position thanks to our  interventions.\n\nAfter September 11, a generation of brave Americans answered the call  to  serve, many enduring multiple deployments in the region. Some 7,000  U.S. servicemembers paid the ultimate sacrifice in the War on Terror.  Tens of thousands more carry with them the scars of war: living with  missing…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…becoming captain in 2000 and being promoted  to battalion chief in 2005.\n\nIn the coming years, Chief Estes responded to some of California's  most challenging fires, joining deployments and leading 14 Type I  incidents across California as Type I incident commander.\n\nBrian Estes continued to be promoted, and he served as assistant  chief of operations,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698099/california-is-the-exact-opposite-of-a-model-of-efficiency"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…CRANE. Mr. Chair, I thank my colleague for those remarks and also  thank her son for serving in the Armed Forces. I too served in the  Armed Forces, went on three wartime deployments, and I can tell you I  didn't fight for any of this: global censorship, domestic propaganda,  regime change politics, and many other things that this organization is  doing.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699052/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…them on this important mission.\n\nMr. Speaker, in the coming days, I will be introducing legislation to  ensure our guardsmen are better protected and supported, both during  deployments like this and beyond.\n\nGod bless our military. South Carolina stands with you, and so do I.                  Suicide is at Crisis Levels in the Country\n\nMrs. BIGGS of South…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…testing revealed significant challenges including the  ship's inability to defend itself, if attacked, and frequent failures  of mission-essential equipment on the ships. Deployments have been  marred by breakdowns and setbacks, rendering these ships unreliable at  best.\n\nMr. Chair, forcing the Navy to maintain a fleet of broken and  expensive ships…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693683/department-of-defense-appropriations-act-2026"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…hangar space at our Shelbyville, Indiana, Army Aviation  Support Facility.\n\nMr. Chair, 900 Indiana guardsmen assigned to the 38th Combat Aviation  Brigade have supported 16 deployments since 2001, including to Iraq,  Kuwait, and Bosnia. Our Shelbyville facility remains a crown jewel of  Indiana and Midwest Army aviation.\n\nThis proud combat aviation unit…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692960/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…training, Timothy was assigned to the 2nd Battalion,  1st Marines, where he served as an Administrative Clerk. During his  time with the unit, he completed two Western Pacific deployments. His  dedication and preparedness during this period were a reflection of his  deep commitment to duty and honor.\n\nIn 2003, Timothy reported to the Commanding General of…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693985/recognizing-united-states-marine-sergeant-major-timothy-babcock-as-august-2025-veteran-of-the-month"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…Terror  in Afghanistan.\n\nSince their first mission began, more than 18,000 Danish soldiers  have deployed to Afghanistan with American and British forces.  Throughout their deployments in Afghanistan, 43 of their soldiers lost  their lives fighting alongside American soldiers, defending our freedom  and holding the Taliban and al-Qaida responsible for…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…VF-124 Gunslingers, VF-111 Sundowners,  VF-126 Bandits, VF-1 Wolfpack, flying the iconic F-14A and F-14D  Tomcats along with the T-2C, A-4E, and F-16N.\n\nHe completed multiple deployments aboard aircraft carriers like the  Carl Vinson, Ranger, and Enterprise.\n\nHe also graduated from Navy Fighter Weapons School Adversary Course  and earned a master of science…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…integrating advanced battlefield  technologies helped propel the Army into a new era of digital warfare.\n\nSergeant First Class Leidlein's service also included several combat  deployments. He led and trained soldiers during Operation Enduring  Freedom in Afghanistan, supporting critical security and nation- building missions that included facilitating Afghanistan's…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691145/recognizing-sergeant-first-class-leidlein-as-may-2025-veteran-of-the-month"}]