[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…2021 defense cooperation agreement. This is a 30-year stability-built  relationship in the Middle East with an Arab partner. We need to  nurture and maintain it.\n\nWe have deployed military personnel to Jordan to support operations  that defeated ISIS to enhance Jordan's security and to promote regional  stability. Jordan air bases have been particularly…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…solves the problem.\n\nThis bill streamlines how agencies track, manage, and report their  software assets by requiring complete assessments on the software paid  for, used, or deployed at each agency.\n\nIt also requires agencies to submit these assessments to the Office  of Management and Budget, the General Services Administration, and  Congress so that…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698152/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…not one home in  America had broadband. We still lived in an analog world, not a digital  world. We lived in a world of dial-up internet technology. Broadband  had not been deployed.\n\nSo the legislation, which I am proud to have been the House author  of, along with Senators--what we did was we broke down every monopoly  that existed. The telephone monopolies,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Congress. Mothers and fathers of American sailors, marines, soldiers,  and pilots do not want to lie awake at night wondering if their kids  will be the ones who have to be deployed to yet another armed conflict,  this time in South America.\n\nLast month, we came to this body with a resolution to end the  unlawful strikes that this administration had been…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696564/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…gives us a security advantage.\n\nEvery combatant commander who has come through my office has  highlighted the strategic advantage that this program gives to our U.S.  forward deployed forces, and it gives us that advantage because our  adversaries don't have this kind of program.\n\nOne of the reasons we passed it in the first place is because what we  know…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690349/9999"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…will point out to my colleagues on the other side of the aisle, in  case they need a reminder, L.A. County is 4,060 square miles, not the  10 blocks. When President Trump deployed the Marines and National Guard  in L.A., it was not at the request of local officials, the chief of  police, or the Governor. It was unprecedented, unnecessary, and a clear…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693144/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…that. Not only have a number of very difficult amendments  been added to the original markup, but also, since the markup, this  administration has recklessly and dangerously deployed the National  Guard to American cities without the request or permission of either  State or local officials.\n\nFor good reason, the Governor of each State makes the decision…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695246/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…made harder by the fact that there is only  one arms control agreement remaining in force between the United States  and Russia. The New START Treaty limits the number of deployed  strategic nuclear warheads for each party to 1,550. The treaty expires  in February 2026. There are scant signs that either government is  interested in extending it.\n\nPresident…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…time is of the essence. Multiple warships have been moved from other  ports of the world to be just off the coast of Venezuela. By some  estimates, 10 percent of the Navy's deployed assets are now in the  Southern Command area of responsibility.\n\nThese actions certainly do not sound like mere drug enforcement  against organized criminals--not even close.…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696558/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Matthew answered the call to serve  others by becoming a firefighter in one of our counties. In 2007, he  made the decision to serve our Nation by joining the U.S. Army. He was  deployed to Kuwait and Iraq from December 2007 to 2009. Unfortunately,  he was there when a horrific bomb changed his life forever. It took us  3 years as a country to recognize his…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693028/surveillance-pricing-in-grocery-stores"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…by the       whims of foreign powers, who have increasingly spread their       influence in Libya.\n\nFor the Government of National Unity, this includes Turkey,       which deployed personnel and drones among other assets to aid       the Tripoli-based administration against the Libyan National       Army's advances in 2020. Ankara's role is defended…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…late Congressman  Charlie Rangel. At the age of 17, Charlie Rangel left school and joined  the Army to help his mother support his family. Soon after he enlisted  in 1948, he deployed to Korea for what he thought was a police action  but soon realized it was a full-scale war. With a fighting spirit, he  found himself in combat during the Korean war and…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…foreign relations of this country. The President decides  where we send arms. The President gets to negotiate peace treaties. The  President decides how millions of troops are deployed all around the  world. We trust that the President is going to use those powers for  good, that the President is going to use those authorities to protect  the United States…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…crime  rates, States like Arkansas, Missouri, and Louisiana would be at the  top of the list. We all know this.\n\nWe all know this isn't really why the National Guard has been  deployed to D.C. or L.A. or Chicago. As with so many acts by this White  House, it is just pretext. It is pretext for an agenda based on fear,  intimidation, performative violence,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Trump disregarded his opinion and took the  escalatory action of deploying 2,000 members of the California National  Guard to Los Angeles. Then, on June 10, the President deployed 700  active-duty Marines. Our active-duty military has absolutely no legal  role in domestic law enforcement. Los Angeles County has 17,000 law  enforcement personnel who…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693150/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Detachment, Army Space Command, 91st Training Division, 5th armored  Brigade, 99th Regional Support Command, and the 222nd Broadcast  Operations Detachment.\n\nSFC Macleod deployed in support of Operation Desert Storm, Operation  Private Comfort, Operation Iraqi Freedom, and Operation Sandy in New  Jersey. A highly trained professional, he completed…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696275/recognizing-sergeant-first-class-alyn-michael-macleod-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…history of the  alliance to come to the aid of the United States and the War on Terror  in Afghanistan.\n\nSince their first mission began, more than 18,000 Danish soldiers  have deployed to Afghanistan with American and British forces.  Throughout their deployments in Afghanistan, 43 of their soldiers lost  their lives fighting alongside American soldiers,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…an example  of a completely understaffed police department.\n\nThankfully, in August, President Trump initiated a Federal takeover  of the Metropolitan Police Department and deployed the National Guard  to confront this massive crime crisis. Since then, violent crime has  dropped by 30 percent. Even D.C.'s Democrat Mayor Muriel Bowser has  acknowledged…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696932/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…State adverse possession laws. Due to  this lack of protection, a squatter might be able to move in and make a  claim to that servicemember's home when that servicemember is deployed.\n\nThis is outrageous. We must ensure that servicemembers can return to  their homes following a deployment without the worry that someone might  be occupying their home and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695471/servicemember-residence-protection-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…reserves. As an artillery  crew member on active duty and a finance specialist during his time in  the reserves, Walt's expertise and commitment to service were clear. He  deployed to Afghanistan in 2010 to 2011 with the Army Reserves, where  he served honorably before being medically discharged.\n\nAfter leaving active service, Walt continued his commitment…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692464/recognizing-the-life-and-service-of-united-states-army-veteran-walt-hartnett"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…our Jewish students on college campuses  all over this country if there weren't malign actors changing the focus  of our students' minds on key issues.\n\nChina strategically deployed and expanded their Confucius classrooms  rapidly going from only a few in 2008 to over 1,000 worldwide by 2019.  More than 500 American K-12 schools have hosted Confucius…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697438/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…two flags  to Foster Sayers, Jr., and Foster Sayers III, in honor of their father  and grandfather's legacy.\n\nFoster Sayers was married to his wife, Ellen, at the time he  deployed. He never met Fos, who actually was my neighbor for a lot of  years, for decades, and married to my dad's cousin. Foster's wife,  Ellen, was actually my babysitter when I…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689171/national-medal-of-honor-day"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…contributions to our Nation's missile defense capability are  equally extraordinary. As Product Manager for the Sentinel Radar System  following the September 11th attacks, he rapidly deployed teams to  support operations, achieving record readiness rates and earning him  recognition as the top product manager among thirty-two Lieutenant  Colonels. As Project Manager…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697622/congratulating-mr-david-cook-of-huntsville-alabama-on-his-retirement"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…General Counsel of the agency, or the       equivalent officials of the agency, shall complete a       comprehensive assessment of the software paid for by, in use       at, or deployed throughout the agency, which shall include--\n\n(1) the current software inventory of the agency, including       software entitlements, contracts and other agreements or…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698153/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…consequences of  continued flooding.\n\nI rise today to recognize and commend the nine members of the  Lynchburg Fire Department's Urban Search and Rescue Team who recently  deployed to southwest Virginia in anticipation of further flooding.\n\nThe Lynchburg search and rescue team represents what it means to be a  proud Virginian. No matter where you are…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688279/recognizing-lynchburg-fire-department"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…entrusted with  greater responsibility. This was a reflection of the confidence placed  in him by soldiers and senior leaders alike. Over the course of his  career, General Mingus deployed not once, not twice--nope--not 5 times,  not even 10. General Mingus deployed 12 times to Iraq and Afghanistan,  repeatedly placing himself along soldiers in harm's way and…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699779/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…thank the gentleman from  Texas for yielding.\n\nMr. Speaker, I rise today to recognize and thank the brave men and  women of the South Carolina National Guard who are currently deployed  here in Washington, D.C.\n\nI have been fortunate to spend time with these young men and women on  several occasions during their mission. I have shared a meal with the  guardsmen.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Captain Retzlaff's first assignment was as a Tank Platoon Leader with  3rd Platoon, Battle Company, 1st Battalion, 66th Armored Regiment at  Fort Carson, Colorado. In 2019, he deployed to Kuwait in support of  Operation Spartan Shield, where his leadership made a significant  contribution to the mission's success. Upon returning, he served as the  Headquarters…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695837/recognizing-united-states-army-captain-mike-retzlaff"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Marine Corps' birthday.\n\nNow, we marines--Mr. President, you know this--take our November 10  birthday very seriously. No matter where marines are anywhere in the  world, deployed, they always take time to celebrate the birthday of our  beloved Corps on November 10. Everybody in the Marine Corps wishes each  other happy birthday.\n\nWe also are kind of…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696624/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…and families who cared for  children, moved many times during a military career, compromised their  own careers, and maintained their homelife while the servicemember was  deployed have earned and deserve attention when the spouse has passed.  Placing the OSA directly under the Secretary will help to recognize the  importance of this population.\n\nMr.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689688/prioritizing-veterans-survivors-act"}]