[{"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…completing infantry school and earning his military  occupational specialty as an 0331-Machine Gunner, Sergeant Major Black  trained at Marine Security Force School before deploying aboard the USS  Forrestal (CV-59) in support of Operation Just Cause. He deployed again  in 1990 with the 3rd Battalion, 5th Marines to Kuwait during Operation  Desert Shield…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694958/recognizing-the-retirement-of-sergeant-major-troy-e-black"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…to  address multidisciplinary research areas like biomass energy  development, sustainable aviation fuels, and various methods for  improving clean energy development and deploying that development in  rural America.\n\nH.R. 1326 is going to codify and strengthen these cross-cutting and  collaborative research and development activities between these…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688982/doe-and-usda-interagency-research-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…and how they are going  to protect our troops, our bases, and the American people.\n\nThis follows on days of Donald Trump attacking the American people on  our own soil by deploying United States marines, as combat troops, and  the National Guard against our own people.\n\nHis own DHS Secretary and Federal agents handcuffed and pushed a  United States…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692793/we-say-no"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…or other less-than-lethal devices that       are classified as firearms.\n\nProponents of these bills suggest that state and local law       enforcement are restrained from deploying firearm-classified       less-than-lethal devices, including TASERs that fall under       the definition of firearm, because of concerns about       liability, specifically…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Jake Auchincloss", "party": "Democrat", "sentence": "Mr. AUCHINCLOSS. Mr. Speaker, I rise today in opposition to H.R.  1664, the Deploying American Blockchains Act of 2025, which passed  under voice vote. This bill gives the Department of Commerce broad  authority to pursue U.S. leadership of blockchain technology.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692975/leadership-of-blockchain-technology"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Pentagon failed  seven audits in a row.\n\nAs recently as 2023, the Pentagon could not even account for 62  percent of its assets--a trillion dollars, while the President is  deploying troops in our neighborhoods and threatening to go to war  against American cities.\n\nIt seems my colleagues can always find time and money for war, but  when it comes to clean…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695276/taxing-excessive-ceo-pay"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…we risk the possibility that each side will  go beyond the treaty's limit in a misguided pursuit of geopolitical  advantage.\n\nThird, there is no nuclear strategic gain from deploying more  warheads on more delivery vehicles. Our massive, largely invulnerable  nuclear arsenal is more than sufficient for deterrence.\n\nFourth, increasing our strategic forces…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699036/expiration-of-new-start"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…who are at the bottom of the drug trade  while freeing those who are the very top and ordering them to come.\n\nAt the same time, the administration asks us to believe that  deploying fighter jets, an aircraft carrier, and more than 15,000  troops to the Caribbean is merely a counterdrug mission. This is the  largest U.S. military buildup in the region…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…very proud to be a veteran, and as ranking member of the  Military Personnel Subcommittee, it is my responsibility to make sure  that we are taking care of our troops and deploying them responsibly  and legally, but you don't need to be a veteran or a member of a  military family to see what this administration has done with our  military. It is divisive,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695246/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, today I am here to stand up for Oregon. Just  before the weekend, the President spouted off some nonsense about  deploying the National Guard to Portland. As we have seen in D.C.,  L.A., and now Boston, it is an unwelcome occupation.\n\nThe President is wasting our troops' time and the country's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695015/national-guard-in-portland"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…report, GAO detailed a remarkable lack of oversight by  the FCC, as well as the need for greater accountability to ensure  precious USF dollars are spent on the mission of deploying high-speed  broadband to unserved and underserved communities. Since then, we have  seen modest progress to curb waste, fraud, and abuse in the high-cost  program, but more…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690154/rural-broadband-protection-act-of-2025"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…tunnel, using weapons made from broken furniture, pepper  spray, and flagpoles.\n\nDaniel Joseph Rodriguez was sentenced to 12\\1/2\\ years after being  found guilty. He was filmed deploying fire extinguishers and dragging  Metropolitan  Police Officer Michael Fanone and repeatedly shocked Fanone in the neck  with a taser. He was pardoned.\n\nThe chief of the Capitol…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698552/january-6-attack"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…over our military and a Republican Party that  refuses to challenge him.\n\nAt a time when the Trump administration is abusing its power,  destroying our standing in the world, deploying troops against our own  people, the annual Defense authorization bill offers an important  opportunity. It is an opportunity to hold this administration  accountable, not…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…Washington  University before enlisting in the United States Army in 1966. After  enlisting, he completed Officer Cadet School, Army Airborne School, and  Army Ranger School before deploying to Vietnam in 1969, where he would  serve as a member of the 20th Infantry Regiment and platoon leader for  the 75th Ranger Regiment, acting as a go-between for teams in…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689645/recognizing-first-lieutenant-peter-hamlin-us-army"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…American scientists had developed a drug called Lenacapavir       that could prevent or treat HIV with a single injection that       lasted six months and perhaps even a year. Deploying this       game-changer in high-risk communities through PEPFAR could       finally bring an end to HIV as a devastating public health       threat.'' Cuts to PEPFAR will…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…year, he has delivered. Let's just start at the southern  border. President Trump restored order by ending catch and release,  reinstating proven enforcement policies, and deploying the resources  necessary to defend our homeland. The results were immediate and  historic.\n\nIllegal crossings collapsed to their lowest levels since the 1970s.  Net migration…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "Mrs. CAMMACK. Mr. Speaker, I thank the chairman for his steadfast  support, and I also thank the ranking member for his support.\n\nI rise today in support of H.R. 1664, the Deploying American  Blockchains Act of 2025, bipartisan legislation that I am proud to lead  alongside my colleague Representative Darren Soto.\n\nThis bill is about far more than emerging…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692731/deploying-american-blockchains-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…invest, hire, innovate,       provide services, and manufacture products;\n\n(C) promoting policies to ensure the United States remains       the global leader in developing and deploying cutting-edge       technologies, such as self-driving vehicle technology,       artificial intelligence, Internet of Things, quantum       computing, blockchain; and\n\n(D)…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692697/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…within any national marine sanctuary. Together, these reforms reduce  regulatory burdens. They protect our national security, and they ensure  that America can lead the way in deploying undersea cables while  protecting our marine environments.\n\nMr. Speaker, I want to thank Congressman Carter for his leadership on  this issue. I urge my colleagues to support…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…responsibilities across multiple Coast Guard missions. He led law  enforcement teams supporting international drug interdiction operations  aboard United States Navy and allied vessels, deploying to the  Caribbean, eastern Pacific, and the Middle East. He also served as an  Aids to Navigation Officer in several major ports, supervising cutters  and crews responsible…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698462/recognizing-united-states-coast-guard-cwo4-james-mcinnis-as-december-2025-veteran-of-the-month"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…the global war on terror. I have responded and helped with  tragedies in Boulder, Colorado, both as a National Guardsman fighting  wildfires, putting together the crews, and deploying the aircraft. I  also served as a police officer on the honor guard who has stood with  our colleagues in Boulder when they lost an officer in 2021 in an  active shooter…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…Scott grew up in Warren County, attended Rider University, and  answered the call to serve by enlisting in the U.S. Coast Guard, where  he trained as a rescue swimmer before deploying into action with  courage far beyond his experience.\n\nI am grateful to the first responders and to volunteers, especially  heroes like Petty Officer Ruskan, who risk their…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693983/recognizing-uscg-petty-officer-scott-ruskan"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…to evade modern air defenses and  deliver both nuclear and conventional payloads across the globe.\n\nDyess, the base in Abilene, Texas, will soon become a key platform  for deploying this cutting-edge aircraft. We have a responsibility to  ensure that this investment in national defense is protected  accordingly.\n\nLet's be clear: This is not a theoretical…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692947/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…modernization of the nuclear  weapons stockpile and the United States Navy nuclear fleet.\n\nThe bill strengthens our Nation's energy security by advancing  American leadership in deploying new nuclear technologies and  supporting the administration's efforts to make full use of our  Nation's vast fossil fuel resources. The bill will reduce reliance on  foreign…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698750/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…witnessing the 9/11 attacks from his classroom at Catholic High  School in Little Rock, Austin was determined to serve his country,  ultimately becoming a Marine Corps officer and deploying to  Afghanistan.\n\nAfter his tour in Afghanistan, Austin came to Washington, D.C., where  he would go on to work as an advocate for the corps on Capitol Hill  and, later,…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688705/recognizing-lorie-tudor-on-her-retirement"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Mugu.\n\nTimothy continued his distinguished career as the Administrative  Chief for Marine Special Operations within U.S. Marine Forces, Special  Operations Command (MARSOC), deploying to Afghanistan from 2010 to  2011. He later served as the Administrative Chief for both the Marine  Special Operations Regiment and Marine Aircraft Group 29.\n\nIn 2013, Timothy…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693985/recognizing-united-states-marine-sergeant-major-timothy-babcock-as-august-2025-veteran-of-the-month"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…for Federal projects. The U.S. is facing a rapidly growing  demand for energy production and domestic manufacturing. Meeting these  escalating needs requires efficiency in deploying new infrastructure.\n\nThe RED Tape Act would eliminate duplicative reviews that serve only  to delay the permitting and construction of these needed projects. This  reform…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699211/streamlining-review-process-for-federal-projects"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…the United States Air Force, entering service  on September 16, 1966. After basic training, he was stationed at  Whiteman Air Force Base with the Air Police Squadron before deploying  to Vietnam with the 377th Combat Defense Unit.\n\nHe was stationed at Tan Son Nhut during the Tet Offensive, one of the  most dangerous moments of that war. When he returned…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695704/recognizing-the-funky-buffalo-coffee-house-and-trading-company"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…member of a seasoned crew.\n\nThe USS Moreno played a critical role in the war effort, carrying out  dangerous missions that included firefighting, towing disabled  warships, deploying depth charges, underwater welding, and escort  operations. Radioman Scarpelli's skill as a radioman, communicating  through Morse code and signal lamp, kept the crew connected…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695850/recognizing-united-states-navy-radioman-petty-officer-3rd-class-natale-nate-john-scarpelli"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…ports, as pipelines, and our power  grids.\n\nYet despite their importance, the United States has allowed  overregulation and duplicative permitting to stand in the way of  deploying and maintaining this infrastructure, especially on the West  Coast, where permitting delays and overlapping approvals have made it  effectively impossible to lay new cables…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699956/undersea-cable-protection-act-of-2025"}]