[{"senator": "Greg Stanton", "party": "Democrat", "sentence": "…tired of the chaos  at the Department of Homeland Security. Instead of targeting hardened  criminals, DHS is arresting hardworking people off our streets to meet  arbitrary deportation quotas.\n\nFaith leaders in my district tell me constituents are avoiding  church, keeping kids home from school, and skipping medical care,  terrified of being profiled based…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699702/chaos-at-department-of-homeland-security"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…counsel to come forward  out of the darkness and pay their taxes through their ITIN number, the  Trump administration is now trying to target this data to carry out his  mass deportation plan.\n\nThis is not just an immigration issue; this is a privacy issue.  Taxpayer privacy is key to our democracy. That is why, as chair of the  Congressional Hispanic Caucus,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690851/opposing-illegal-power-grabs"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…is upturning lives and overturning some of  our most basic values like freedom of speech. We have people who are  here legally who are being detained and threatened with deportation,  not for any crime, not for any violence, but for speech, for protest,  for things as simple, as fundamental, as writing an op-ed the  administration disagreed with--in…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…politicizing our servicemembers both by word and by  deed. He has diverted military resources away from numerous--numerous-- critical missions for his chaotic and violent mass deportation  campaign. He has federalized and deployed National Guard troops in  American cities against our own citizens in violation of the law.\n\nThat is why just last Friday the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…inflation rose 2.7 percent in June, and the majority of  Americans rightfully blame the White House for driving up the prices of  food and groceries.\n\nTrump said his mass deportation agenda would only target violent  criminals, but over 90 percent of detainees being held in New Jersey  have no criminal conviction.\n\nTrump said he would improve the Affordable…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694040/trump-administration-chaos"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Now, with the lifting of this TPS designation, these Afghans already  legally in the United States--including some who risked their lives to  help us--may face detention and deportation, returning to horrific  conditions in their homeland.\n\nI urge the President in the strongest terms to reconsider this. It is  not just the fate of these Afghans, but it…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693450/temporary-protected-status"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…human. If allowed to proceed, the termination of Haitian TPS       on February 3, 2026 would impose immediate and serious harms.\n\nFirst, TPS holders would lose protection from deportation       absent another lawful status resulting in the sudden       destruction of countless lives and the separation of       families. Many Haitian TPS recipients have lived…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Juan Vargas", "party": "Democrat", "sentence": "…Speaker, enough is enough. I rise today to join my colleagues in  sounding the alarm on Trump's out-of-control immigration crackdown.\n\nSince January, Trump has unleashed a mass deportation agenda and  indiscriminate immigration enforcement that has pushed past all moral  and legal boundaries.\n\nIn Chicago, Federal immigration agents tear-gassed kids and fired…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697447/fighting-dhs-immigration-raids"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…dollars and limited Federal  prison space.\n\nAmerican taxpayers are certainly justified in asking our Republican  colleagues: Why should we imprison someone who is subject to  deportation here in the United States and at that cost to the American  taxpayer?\n\nEvery day, we are seeing a new atrocity committed by ICE and the  Department of Homeland Security.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…about James Percival to be general counsel at DHS? He is another  Trump loyalist who has been a key figure in pushing the administration  to defy court orders in regard to deportation actions.\n\nThen there is Jeffrey Hall to be Assistant Administrator at the EPA.  How much experience does Mr. Hall have for this position? Zero. And in  his time acting in…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697574/department-of-defense"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…to be a U.S. citizen to vote in a Federal election.  If you are not, you are subject to penalties for attempting to register  to vote, and you are subject to felonies and deportation if you do vote  and are not an American citizen. That is the current law.\n\nI also remind my friend, the gentleman from California (Mr.  McClintock), that an estimated 135,000…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…for their       well-being, will most likely be forced to forego care. That       is, if they survive the tragic violence engulfing the       country.\n\nFor those who evade deportation and are forced to live       undocumented in the US, the stress of living with fear of       detention and deportation is known to increase risks for       anxiety, depression,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…more resources  than dozens of militaries around the entire world.\n\nThis funding is unprecedented, and it is a free pass for ICE to ramp  up Trump's cruel and inhumane mass deportation policies.\n\nThey are already building concentration camps in Florida where they  are threatening to lock up legal immigrants and Latinos from across the  country. I have…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694186/pushing-back-against-ices-authoritarian-overreach"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…frustrated by Donald Trump's failed  economic policies that are raising costs for working families, and the  American people are increasingly outraged by the cruel, violent mass  deportation campaign unfolding in communities across the country, which  has already cost two innocent American citizens their lives.\n\nIt seems to me that the SAVE Act is really only…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…time.''\n\nMr. Speaker, this administration said they were going to go after  dangerous criminals and drug dealers, but what they are doing instead  with this disastrous mass deportation effort is creating fear and  stress across the country including among young children.\n\n``I wish I didn't have to worry about these things,'' the student  said. So do I…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689733/challenges-facing-our-students"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Trump has done more in 100 days  than the previous President has done in 4 years?\n\nMr. Speaker, I have only got 60 seconds, but let's break it all down:  border closed; mass deportation of illegal immigrants; fentanyl  smuggling dropping; Laken Riley Act signed into law; inflation cooling;  egg prices down; gas prices falling; astronauts back home; 11 American…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690430/the-first-100-days"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…are merely  passing through the country.\n\nThe question of our time is whether those who have illegally entered  our country in defiance of our laws and who are subject to deportation  under those laws can be considered as having accepted the jurisdiction  of the laws that their very presence defies.\n\nThe Supreme Court has never considered this question.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688130/birthright-citizenship"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…first weeks in office: We didn't new need new laws. We needed a new  President.\n\nThe largest illegal mass migration in history must now be followed by  the largest legal deportation and repatriation in history.\n\nNew laws would be helpful to prevent a future Joe Biden from making a  mockery of our sovereignty and reopening our borders to the most  violent…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…injunction using deeply flawed legal grounds against the  administration's birthright citizenship order.\n\nMonths later, Judge James Boasberg attempted to halt the lawful  deportation of violent Tren de Aragua gang members, even ordering a  removal flight to turn around in midair. These are not isolated  incidences. The D.C. Federal courts have become…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699053/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…actually taking a  look right now for what we believe is sort of this fiscal year's  snapshot. We actually have foreign born actually going down. Now, some  of this is self-deportation. There are things going on, we don't have  enough data to completely understand it, but my problem is: I don't  actually have enough folks for the civilian labor force.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…continuing resolutions.\n\nWe achieved major rescissions in wasteful spending. We cut IRS  funding. We gutted the Commerce slush fund. We boosted immigration  enforcement and deportation operations. We set the stage for additional  rescissions and pocket rescissions that the OMB Director, Russ Vought,  has been able to carry out, as well as impoundments.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…themselves and their family.\n\nAs to the comments of my colleague from California, he set forth his  view as to what the priority and the limitations ought to be when it  comes to deportation policy. He is, of course, acting appropriately in  doing so. That is his right, and that is his prerogative as a Member of  Congress, as it is for any citizen.\n\nThis resolution…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…taxpayers are facing rising taxes and  uncertainty. To address these challenges, this resolution provides for  the extension of the Trump tax cuts, funds the largest mass deportation  operation in U.S. history, and cuts at least $1.5 trillion in waste,  fraud, and abuse from our Federal budget.\n\nThis is something that should receive bipartisan support.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688049/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…and Islamic terrorism and violence will become the norm.\n\nThankfully, President Trump and his administration are working day  and night to save this country through mass deportation, revoking  immigrant visas, and implementing travel bans on majority-Muslim  countries that support the radical Islam crowds who chant ``Death to  America.''\n\nWe continue…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…violent  criminals, but that is a demonstrable lie. The whole point of the  Democrats' sanctuary laws is to protect criminal illegal aliens from  being turned over to ICE for deportation. Instead, they released them  back into our communities, where many have gone on to commit even more  heinous crimes.\n\nRecently, when Federal officers served a criminal…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694126/sorry-not-sorry-for-immigration-enforcement"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…``At this point, I am afraid  to be close to him.'' She goes on to say: ``I have multiple photos,  videos of how violent he can be . . . ''\n\nWhen Democrats grandstand on the deportation of a wife-beating El  Salvadorian, MS-13 gang member and chant ``Bring him home,'' I have  good news for you. He is home, and he will never be able to call  America home.", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690313/abrego-garcia"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…offenders  in this specific category return to the United States after being  deported due to gaps in the current immigration law.\n\nAs a former U.S. prosecutor, I saw how deportation alone is  insufficient to deter the committed illegal immigrant criminal. I have  investigated, tried, and convicted many individuals who had been  deported 2 times, 3 times,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…colleagues in my party: Don't  give these people an inch. Don't fall for their moral blackmail. Don't  let them negotiate or squirm their way into killing the President's  mass deportation agenda. The American people support it. Don't let them  talk you into believing that this is about justice. That is not what  they care about.\n\nDo you know what I care about?…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…countries and go by our laws and assimilate with our culture, but if  you come here otherwise, it is time to go home.\n\nThe Trump administration is also prioritizing the deportation of  Afghans who are already here illegally. You know, I am 100 percent  behind President Trump's effort to get rid of all Islamists who hate  our country, as I just previously…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…incident  in Minnesota.\n\nWhat we have here is a Somalian illegal alien convicted of homicide.\n\nWe have a Salvadorian illegal alien convicted of three counts of  homicide with a deportation order since June of 2025.\n\nWe have a Mexican illegal convicted of homicide, who was previously  deported in 2002.\n\nWe have a Sudanese illegal alien convicted of homicide.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}]