[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…as you can  see, adorable grandchildren. He was arrested, detained, and sent to the  Northwest Detention Center in Tacoma, Washington. Then immigration  officials tried to deport him.\n\nI visited Victor in Tacoma, where he was kept in bleak conditions and  spoke about his experience and his hopes to be reunited with his  family.\n\nAfter almost 4 weeks…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696911/aggressive-immigration-enforcement-tactics-in-oregon"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…issue on S. Res. 195.\n\nOur President, President Trump, has entered into an agreement still  shrouded in some secrecy with the President of El Salvador, President  Bukele, to deport American residents into El Salvador and imprison them  in prisons in a country that has been charged by the United States and  others with gross human rights violations.\n\nThe…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691406/motion-to-discharge-s-res-195"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…our culture and sacrifices.\n\nThis year, it comes with urgency because we are under attack. Last  week, the Department of Homeland Security attacked me on X, insisting  they deport only criminals. If you walk the streets of my district, Mr.  Speaker, you see the truth, and it looks nothing like their tweets.\n\nLast Friday, in Franklin Park, a suburb in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695742/ice-and-dhs-lost-credibility"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…adult children, and his home.\n\nMr. Park was shot twice in combat, earning a Purple Heart for his  bravery. Yet despite his sacrifice, ICE officers gave him no choice but  to deport himself back to South Korea after nearly 50 years.\n\nMr. Park served. He fought. He belonged. Yes, he made mistakes, as  many veterans struggling with PTSD do, but he turned…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693066/addressing-immigration-inefficiencies"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…enforcement policies.\n\nFor months the President and House Republicans have said that they  are only targeting violent criminals.\n\nWhy is it, then, that last week ICE attempted to deport a constituent  of mine who had been granted legal protections against removal under  the Convention Against Torture?\n\nThis woman, the victim of unspeakable crimes in her home…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689390/president-trumps-immigration-enforcement-policies"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…implementation of a reckless Kristi Noem.\n\nSo if only 14 percent of those people deported are dangerous  criminals, what are the others? It is about detaining and attempting to  deport students who are here legally but said things that the President  and the administration didn't like on a campus, folks who spoke out  about the war in Gaza: Mohsen Mahdawi…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700023/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…share with my colleagues.\n\n``I write today to express my grave concern over the administration's  apparent misuse of obscure provisions in our Nation's immigration laws  to deport or detain indefinitely individuals without due process.  Independent of whether a noncitizen is guilty of what they are being  accused, I fear these actions are setting a bad…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691184/letter-to-secretary-noem-and-secretary-rubio"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…deported.\n\nWe just had a hearing this morning on how the Trump administration is  literally dismissing cases for people who are in a legal process for  immigration just so they can deport them. They can certainly also do  that for somebody who has been convicted of drunk driving and is  serving out their sentence. They could take that case and deport that  person…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693080/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…does deporting a sick child keep our community safe? It does not.  This isn't immigration policy, but this is cruelty, plain and simple.  The idea that the U.S. Government can deport children who are U.S.  citizens or send immigrants to dangerous foreign prisons without a  court hearing and then claim the government bears no responsibility  should terrify…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690420/put-hardworking-american-families-first"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…suffering,  which drives people to our shores and to the border, but the  administration won't even talk to Cubans about migration. How do they  plan to return those they want to deport? Do they think they can hold  Cubans in detention indefinitely?\n\nConditions in Cuba are far more desperate than during Trump's first  term. To be frank, President Biden disappointed…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692909/do-not-forget-the-crisis-in-cuba"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…County Sheriff Don Barnes did not call for the  National Guard. Local police chiefs did not call for the National  Guard. We get the National Guard.\n\nPresident Trump promised to deport criminals, those with deportation  orders, those here less than 2 years, but now it is hard workers,  people who pay taxes that are being picked up. Mr. Speaker, 60 percent…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693145/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…kills someone or if they drive  drunk without a license, but that is the law today.\n\nAn undocumented alien is, of course, deportable in all cases. You  don't need a statute to deport them for falling asleep drunk in their  car.\n\nToday, there are nearly 13 million green card holders, permanent  residents, in the United States. These are people who have followed…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693082/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "Ms. CHU. Mr. Speaker, this administration has thrown out the  Constitution and asserted that the President has king-like power to  arrest anybody in this country and deport them, even to a foreign  prison for life, with no due process.\n\nDays ago, we learned they deported a 4-year-old child with stage IV  cancer and a 2-year-old American citizen.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690502/trump-immigration-policies"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…President Trump's unlawful and unjust deportations to El Salvador.\n\nEarlier this year, the administration invoked the Alien Enemies Act,  an 18th century wartime statute, to deport 137 Venezuelan men to a  notorious prison abroad. This archaic law is being exploited to bypass  our immigration system and deny individuals their most basic legal  protections.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690504/trump-immigration-policies"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…and dying in another  country, and they are here trying to hold their family together in some  minimal way, them receiving a letter saying that they would be able to  self-deport before it was claimed to be sent in error. In other words,  some person in some agency sent out the wrong letter, which causes even  more anxiety and fear in families who are…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…dollars have gone to illegal aliens and politically connected NGOs who  facilitated this recent invasion.\n\nPresident Trump's swift actions to halt illegal crossings and to  deport illegal aliens in his first 100 days has made one thing  painfully clear: The Biden-Harris administration was never working to  fix our immigration system. They actively and…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Biden administration  allowed illegal immigrants to stay in the country even after committing  horrible crimes.\n\nThis piece of legislation would give the courts the ability to deport  illegal aliens from America and bar them from reentry if they are  convicted of a DUI or a DUI-related charge.\n\nThis issue hits home for me. In my district, a 15-year-old…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693081/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…murdered by illegal immigrants.\n\nTodd Lyons, earlier today, testified--OK, just to tell you how sick  this is--that in Colorado, ICE wanted to perform an operation in  Colorado to deport illegal alien Tren de Aragua gang members from an  apartment complex. So they tried to work with the local authorities in  that sanctuary State. Guess what happened. Protesters…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…are all  about. If that is not you--if they don't want to do that--again, we  don't want you here.\n\nThe Trump administration has worked tirelessly this year to arrest  and deport millions of illegals brought into the country by the Biden  administration. Patriotic Americans are thankful for the work of DHS  and ICE and what they are doing to clean up…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…knows what happened, who is here. You sat by, and you did nothing.\n\nAnd here is what I have learned about my friends on the Democratic  side: They are never going to agree to deport anybody because all their  proposals make it pretty much impossible to deport anybody.\n\nBody cameras, that makes sense. If you want to find out how to make  ICE more professional,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "…Getting away from that would  bring our law enforcement operations with regard to illegal immigrants  in this country to a halt. This is an important way that we actually  get to deport the people who are here illegally.\n\nSo that is a nonstarter. We can't slow down the system. Yet we just  saw under the Biden administration an open border policy and 10.5…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699924/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "John Thune", "party": "Republican", "sentence": "…like those that Senate  Democrats and the administration can find consensus around. But one  thing is clear, if the Democrats' goal is simply to make it harder to  detain and deport dangerous illegal aliens, then they will find no  interest on this side of the aisle. I hope that is not the case because  the stakes are high.\n\nRepublicans provided for ICE…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699507/government-funding"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…behind?\n\nThey were facing a constitutional crisis in the sense that their own  government was not enforcing the laws of this land.\n\nAs the new administration is moving forward to deport gang members,  wife-beaters, and others, the real constitutional crisis is finally  being defined, that America should finally stand up for the citizens  who make this country…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690709/constitutional-crisis"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…people who are on our streets, as guests of  our country, and they are committing violence against the people of our  country, let's remember we have a duty to remove them, deport them, and  do it immediately and swiftly.\n\nLet's flip the page real quick. I have a couple more. Let's look  beyond just Minnesota. Remember that when you have dangerous people…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…border and enhance national security.\n\nThis bill includes the largest investment in border security in over  a generation. There is nearly $150 billion to secure the border and  deport criminal illegal aliens. We are restoring order at the border  and restocking our military.  We increase pay, housing, and healthcare for our servicemembers. We  rebuild our…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…in modern technologies to assist in the  interception of drug and human smuggling, and increased detention  capacity for Immigration and Customs Enforcement as they work to deport  violent criminals and gang members who are in this country illegally.\n\nOur bill supports American farmers, ranchers, and ag producers like  those in the Big First District…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692073/condemning-anti-semitism"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…America's laws, it has no right to another dime of  American money.\n\nIt goes further too. It mandates full information sharing about  illegal aliens in our prisons so we can deport them immediately upon  release.\n\nThere are some States right now that refuse to provide this  information--criminals being released in our streets as a political  statement…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "John Thune", "party": "Republican", "sentence": "…giving them the tools they need to keep  illegal immigrants and illegal drugs out of our country. And we are  hiring more ICE officers and enhancing our capacity to detain and  deport criminal illegal immigrants who have taken up residence in our  country.\n\nWe are also making a major investment to bolster our national defense  and build a military that can…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693279/one-big-beautiful-bill-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…prioritizing those with criminal records. Beyond that,  different Presidents have chosen to exercise that discretion in  different ways.\n\nFor example, President Obama chose to deport millions of people  during his time in office. It is ultimately a matter of how the  President chooses to carry out that policy.\n\nHere is the important point for purposes of…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…legislation would amend the Immigration and  Nationality Act to explicitly make clear that fraud is a deportable  offense. This will provide another tool for the President to deport or  denaturalize scammers who have come to our country to steal from the  American people--to steal from the U.S. taxpayer; to steal from the  Federal Government--and pad their…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699102/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]