[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…plans to  fold the CPSC's mission into the Department of Health and Human  Services with a smaller budget, fewer expert staff, and a narrower  mission.\n\nAmerican consumers deserve to have peace of mind that the products  they bring into their homes are safe. I commend Representatives Castor  and Balderson for their work and leadership on this issue.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692745/awning-safety-act-of-2025"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…collar family, a father who is a car salesman and a mother who is a  receptionist--well, they can't afford any disruptions, and they cannot  afford any further pain.\n\nThey deserve instead to know the truth about the Trump tariffs on the  front end. They deserve to know exactly how the Trump tariffs will  affect their day-to-day lives. They deserve to…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689471/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…lipservice to  real problems, undercut the solutions that actually work, and shovel  more tax breaks to the ultrawealthy--rinse and repeat.\n\nMr. Speaker, the American people deserve a hell of a lot better. They  deserve better than a party taking away their healthcare in the middle  of the night. America's hardworking moms and dads, who may work  multiple…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…who got coverage on healthcare.gov from being simply kicked  off their insurance.\n\n``Concepts of a plan'' simply are not good enough for the people that  I represent. They deserve better. In fact, they need some breathing  room and lower costs.\n\nInstead of meeting families where they are and lowering costs,  Republicans are taking us in the wrong direction.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698978/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…haven't added new Members to  the body since.\n\nI am not addressing you, Mr. Speaker, to propose controversy, but I  am here to speak on behalf of the people of Michigan, who deserve fair  and equal representation for the taxpayer dollars that they provide to  the Nation's Treasury.\n\nWhen you look at the largest freshwater basins of our Great Lakes,  when…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…pockets of the people who need it the most.\n\nI urge every Member of this body, Democrat and Republican alike, to  support this bill and stand up for the American people. We deserve  better. I will never stop fighting to protect the basic necessities  that every family needs to survive.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698596/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Susan E. Lukas 9/11 Servicemember  Fairness Act today. This legislation will close the gap in coverage and  ensure that these servicemembers receive the care and benefits they  deserve.\n\nThis bill is named after retired Air Force Lieutenant Colonel Susan  Lukas, a constituent from Gainesville, who returned to work in the  Pentagon the day after 9/11 and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695328/remember"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…to servicemembers and veterans impacted  by violations of the Military Lending Act. Unfortunately, President  Trump has determined that those who served our Nation no longer deserve  protections against bad actors who seek to profit off their benefits.\n\nAs fraudsters' ability to create more complex scams and become more  convincing in their deceit thanks…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699190/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…waiting for an initial decision, they may need to appeal  their case to the Board of Veterans' Appeals where they face more  months and often years of additional delay.\n\nVeterans deserve a system that works with the same urgency and  seriousness with which they served our Nation. In recent years, despite  hiring new veteran law judges, the board has often…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699209/veterans-law-judge-experience-act-of-2025"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…She stood up for them. She made it possible so that  your grandparents and your great-grandparents could be able to give  your parents and your families the life that they deserve so that you  can serve here in Congress with me.\n\nWhat will your legacy be? If you are wondering why constituents don't  believe in government, it is because we say one thing,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…life of the program by 75 years, all without costing 91 percent of  Americans one cent more.\n\nWe owe that to the seniors who built this country and to future  generations who deserve the same dignity in retirement.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690792/expanding-social-security"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…choose between heat and  medicine and no family should have their power shut off, while fossil  fuel companies make more money than they have ever seen in the past.\n\nAmericans deserve better than broken promises and rising bills. We  must deliver lower costs including lower energy costs for American  families.", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699895/prices-are-too-high"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…the work we must do, and we must  resist the fear that would tell us that we must surrender our rights  and forfeit our values in order to protect the little we have when we  deserve so much more.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697453/fighting-dhs-immigration-raids"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…the  youngest, but his ideas are very old.\n\nUndermining democracy in D.C. isn't new. It is just wrong. The people  who live in the Capital of the world's greatest democracy deserve that  democracy themselves.\n\nMr. Speaker, I think it is very interesting, as we sit here, I keep  hearing my colleagues bring up the ``working families tax cut bill.''  They…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699681/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…uniquely positioned to       tell us that our voices matter and that we have finally been       heard. Some of us live in your districts. We look to you to       represent us. We deserve for you to represent us.\n\nWe implore you to stop protecting those who enabled       Epstein's crimes and instead stand firm in protecting the       women and children he harmed.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695788/a-letter-from-survivors-of-jeffrey-epstein-and-ghislaine-maxwell"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…time.\n\nMr. Speaker, in closing, the Expanding Access to Capital for Rural  Job Creators Act takes care of our hardworking small business owners  who are ready to grow. They deserve a seat at the table, Mr. Speaker.\n\nI urge all of my colleagues to support H.R. 1190. I commend the  Representative from Montana (Mr. Downing) for introducing this  legislation,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692759/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…injury, every death, every  single thing that happens in this conflict is the fault of Hamas.\n\nOn October 7, when this invasion by Hamas started, Israel was doing  nothing to deserve this. Instead, Hamas invaded the country. They  killed 1,200 people. They took 251 hostages.\n\nIf that wasn't enough, the torture that they committed on that day  was horrific.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695665/cloture-motion"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…high-speed rail. There is no  viable path forward for the project. I do believe when we have a new  Governor in the State, the project will finally be wound down.\n\nTaxpayers also deserve answers on where all of this money has gone.  Curiously, as we are seeing new scrutiny to answer that question as to  where the money is going, the Governor is pushing a bill…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700217/prices-in-california-are-too-high"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…multiple State titles and competed on the national  stage, all while maintaining a 4.0 GPA.\n\nBrycen Phillips is a total stud, and the entire Congress and the  entire Republic deserve to hear his story, and they now have.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694110/recognizing-brycen-phillips"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…online turns  out to be far more expensive once these deceptive charges are added.  Additionally, the way these prices are advertised are fragmented and  not uniform.\n\nAmericans deserve price transparency so that they can appropriately  budget for their travels.\n\nThe Hotel Fees Transparency Act requires providers of short-term  lodging to disclose upfront…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690198/hotel-fees-transparency-act-of-2025"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…had to be  dissolved.\n\nMr. Chair, I look forward to working with the Department of War on  implementing recommendations to make sure these crucial workers are  paid what they deserve.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695229/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…need.\n\nFamily caregivers are often the unsung heroes in our communities.  Many balance caregiving with full-time jobs, raising children, and  managing their own health.\n\nThey deserve our support and recognition, which is why I am proud to  support legislation like the Lowering Costs for Caregivers Act to help  ensure these caregivers have the financial…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697240/recognizing-national-family-caregiver-month"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…simply acts of graffiti. They were acts to  damage our legacy. These monuments stand as reminders of sacrifice,  unity, and the ongoing work of perfecting this Union. They deserve our  utmost respect.\n\nWe owe it to those who fought for these freedoms and to the future  generations of Americans to ensure that our national parks and  memorials are preserved.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698913/significant-strides-to-strengthen-united-states-warfighters"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Speaker, the name on the front of our jersey, USA, means more  than the name on the back. I am thrilled to be able to vote on this  piece of legislation. These Olympic heroes deserve this because, as  Captain Eruzione says, it will put the cherry on top of their  accomplishment. It is the highest honor we can give.\n\nAs was alluded to earlier, the Olympic…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695441/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "…today in strong support of the  effort to ban congressional stock trading because public service must  never be compromised by private financial interest. The American people  deserve to know that we are acting on their behalf, not for our own  portfolios.\n\nThat is why I have already begun placing all of my assets into a  blind trust, to align my conduct…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691215/stock-trading-ban-for-members-of-congress"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…Act.\n\nOur veterans put their lives on the line to defend this country. When  they come home, they shouldn't have to fight another battle just to get  the benefits that they deserve.\n\nUnfortunately, outdated systems at the VA are causing unnecessary  delays that create real hardships for both veterans and their families.\n\nTo speed up disability claims,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695484/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…have introduced a bill to fully reauthorize the National  Flood Insurance Program for this year and for next year. There are 4.7  million homeowners across the country who deserve that little bit of  certainty, and it does not seem like it is asking too much.\n\nImagine if your homeowners or life insurance was subject to lapsing  every year if Congress…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688826/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…are going to ensure that  Federal employees, whether they were furloughed or laid off or forced  to work without pay, will now receive compensation that they have  earned and deserve.\n\nAnd we will also be able to celebrate on Veterans Day tomorrow the  fact that we have passed the appropriations bill for the VA.\n\nThis would not have come about without…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696664/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…forward-looking application of American  innovation to protect lives, including those of our first responders.  These brave men and women who risk their safety to combat wildfires  deserve every available tool to bolster response capabilities and  enhance operational safety.\n\nI thank Representatives Fong and McClellan for their work to address  this pressing…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700124/advanced-capabilities-for-emergency-response-operations-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…I am proud to support this bill, which will make sure  that all Americans, no matter their disability status, will be able to  receive the access to care that they need and deserve.\n\nMr. Speaker, I thank my good friends, Representative Cammack and  Representative Dingell, for their leadership on this important issue,  and I urge my colleagues to support…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692718/charlotte-woodward-organ-transplant-discrimination-prevention-act"}]