[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…unprecedented levels of obstructionism from this  administration and give the American people, including our Nation's  veterans, the full and public debate they deserve.\n\nMr. BLUMENTHAL. Mr. President, I respect the points that my colleague  from Kansas has just made as chairman. We have worked together in a  bipartisan way. I hope we will continue…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691275/9999"}, {"senator": "Jared Golden", "party": "Democrat", "sentence": "…protect workers' rights.\n\nI urge my colleagues to vote ``yes'' on the rule. Let these workers  have their day on the House floor. Give them an up-or-down vote. They  deserve that much.\n\nMr. GOLDEN of Maine.  Dexter).\n\nMr. GOLDEN of Maine.  Hoyle).", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697864/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…This legislation will lean on  that consensus to help bolster our committee's oversight power and take  a step toward delivering to our Afghan allies the support that they  deserve.\n\nMr. Speaker, I hope my colleagues will join me and support this bill.  I yield back the balance of my time.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692739/no-tax-dollars-for-terrorists-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Illinois' Third Congressional District, it is my sincere  honor to commend Amisha Patel for her lifetime of service organizing  our communities to fight for the future that we deserve.\n\nMr. Speaker, I congratulate Amisha.               National Fair Housing Month: Carlos Ramirez-Rosa\n\nMrs. RAMIREZ. Mr. Speaker, I rise today during National Fair Housing  Month…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690325/national-fair-housing-month-amisha-patel"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…together, along  with our Senate counterparts, to reauthorize the Fox Grant Program in a  responsible way and ensure it is as effective and robust as our  Nation's veterans deserve.\n\nMr. Speaker, I appreciate the opportunity to share my position on  H.R. 1969, the No Wrong Door for Veterans Act, as amended. I will  always be supportive of efforts to prevent…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691508/no-wrong-door-for-veterans-act"}, {"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "…service have elevated the  Agency's impact throughout our community. Her dedication ensures that  our seniors continue to receive the respect, support, and recognition  they deserve.\n\nMr. Speaker, on behalf of Florida's 20th, 23rd and 25th Congressional  Districts, we ask our colleagues to join us in congratulating these  outstanding individuals for their…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691691/recognizing-the-2025-honorees-of-the-broward-county-florida-senior-hall-of-fame"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…Americo Miranda, this team showed the world how Nevada  plays ball.\n\nI was so proud to join the community in downtown Summerlin to give  these all-stars the homecoming they deserve.\n\nMr. Speaker, Summerlin South made Nevada proud on the world stage,  and I can't wait to see what is next for these incredible athletes.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695305/congratulating-summerlin-south-little-league-team"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…to get into the  middle class get screwed over.\n\nWhat we saw from Republicans in the last week of May, Mr. Speaker, is  reprehensible. It is not what the American people deserve.\n\nMr. Speaker, I hate to be the one to have to inform the gentlewoman  of this fact, but the head of CBO, according to The Wall Street  Journal, is a registered Republican.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Black veterans, many of whom  still are not getting the GI Bill benefits that they deserve. This body  is still refusing to honor legislation that would give them what they  deserve.\n\nMr. Speaker, I thank Congresswoman Beatty for joining me in this  Special Order hour. I yield to her now to continue this discussion.\n\nMr. CLYBURN.  Clarke).\n\nMs. CLARKE of…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…aviator  cancers. More importantly, we will be able to provide our Nation's  veterans with comprehensive care, the preventative and palliative care  that they earned and deserve.\n\nMr. Speaker, I look forward to getting this and other critical  exposure legislation through this body and signed into law. I hope my  colleagues will continue to rally around…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693895/aces-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…compensation, and VA needs it fast for  today's and tomorrow's veterans.\n\nThis bill ensures that research gets done and that our military  pilots and aircrew get the answers they deserve.\n\nMr. Speaker, I urge all of my colleagues to support S. 201, and I  reserve the balance of my time.\n\nMr. BOST. Mr. Speaker, understand that we at the committee have  hearings…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693894/aces-act-of-2025"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…response. H.R. 909 provides stability, preserves the  original intent of the Crime Victims Fund, and ensures that those  harmed by crime continue to receive the support they deserve.\n\nMr. Speaker, I urge my colleagues to strongly support this  commonsense legislation.\n\nI, again, thank Representative Wagner for her years of leadership and  dedicated work…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698844/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…the depiction, even  passively. This is a straightforward, bipartisan fix that ensures that  Federal law captures these heinous acts and imposes the penalties that  they deserve.\n\nMr. BIGGS of Arizona. Mr. Speaker, I commend law enforcement for  their tireless work of protecting children, and I commend the work of  this committee and the lead sponsor…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698897/child-predators-accountability-act"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…fiscally responsible bill with broad  support. Mr. Speaker, I urge my colleagues to join me in advancing this  measure and helping more Alaskans get the care that they deserve.\n\nMr. BEGICH. Mr. Speaker, I rise in support of H.R. 3176, the bill to  reauthorize the National Volcano Early Warning and Monitoring System.\n\nThis is a program of national importance.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698112/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…constituents.\n\nI stand here today, Madam Speaker, to urge support for this package  to ensure that communities across this country can have the clarity  that they absolutely deserve.\n\nMr. COMER. Madam Speaker, I yield 3 minutes to the gentlewoman from  California (Mrs. Kim).\n\nMr. COMER. Madam Speaker, I urge my colleagues to vote in favor of  the Boebert…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693902/single-unique-zip-codes-for-certain-communities"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…more to strengthen nursing by expanding training  opportunities, reducing burnout, and investing in the future of care.\n\nNurses don't ask for recognition, but they sure deserve it. Mr.  Speaker, on National Nurses Day and every day, I thank all nurses, and  I promise to keep fighting for nurses in Congress.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690623/recognizing-national-nurses-day"}, {"senator": "French Hill", "party": "Republican", "sentence": "…has important HUD oversight, which I think is critical  to make sure those who are tenants in HUD programs have the care,  oversight, and safe and sound conditions they deserve.\n\nMr. Speaker, I also thank the staff on both sides of the aisle for  their work in putting this bill together, particularly on the majority  side, Ed Skala and Maura Woosley,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…am proud to support this bill, which will make sure  that all Americans, no matter their disability status, will be able to  receive the access to care that they need and deserve.\n\nMr. Speaker, I thank my good friends, Representative Cammack and  Representative Dingell, for their leadership on this important issue,  and I urge my colleagues to support…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692718/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…slowing down the delivery of critical  housing assistance. H.R. 225 simply ensures that HUD operates with the  openness and accountability the American people expect and deserve.\n\nMr. Speaker, I thank Ms. De La Cruz for this important measure, and I  urge our colleagues to support it.\n\nMr. DAVIDSON. Mr. Speaker, I include in the Record the Congressional…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697209/hud-transparency-act-of-2025"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…fast, for  today and tomorrow's veterans. My friend from Texas' bill would ensure  that research gets done and that our military pilots and air crewmen  get the answers they deserve.\n\nMr. Speaker, I urge all my colleagues to support H.R.\n\nMr. BERGMAN. Mr. Speaker, once again, I encourage all Members to  support this legislation, and I yield back the balance…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690650/aces-act"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…timely manner.\n\nThis bill takes an essential first step toward eliminating these  regional healthcare disparities and ensures that all veterans receive  the quality care they deserve.\n\nMr. Speaker, I encourage all my colleagues to vote in support of H.R.  3951. We owe it to our servicemen and -women to make this commitment to  timely healthcare access.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695498/rural-veterans-improved-access-to-benefits-act-of-2025"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…just and truthful. In the end, that is what God honors  always. Don't forget it.\n\nWe need to get this government open as soon as possible. The American  people demand and deserve it.\n\nMr. Speaker, let's get this done.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696723/continuing-appropriations-and-extensions-act-2026"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…efforts of our Nation's  missing servicemembers.\n\nMr. Speaker, we will never stop searching until all our  servicemembers are brought home. They and their loved ones deserve no  less.\n\nMr. Speaker, I urge my colleagues to support this resolution.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695819/national-powmia-recognition-day"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…safer neighborhoods; and we are providing more  opportunities. Republicans are going to continue to deliver the safety  and the prosperity that the American people want and deserve.\n\nMr. BARRASSO. The following Senators are necessarily absent: the  Senator from Iowa (Ms. Ernst) and the Senator from Iowa (Mr. Grassley).\n\nFurther, if present and voting: the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698252/nominations"}]