[{"senator": "Chris Murphy", "party": "Democrat", "sentence": "…they wanted to make sure that never again  would Trump abandon them if there was a contest like that in the Middle  East. So when he asked for the plane, just based upon their desire to  make sure they did not get abandoned again, they felt they had to say  yes.\n\nBut they also wanted an arms sale, and the arms sale they wanted was  a groundbreaking arms…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…and sovereignty because what happens to Ukraine  and its young democracy happens to theirs and happens to ours.\n\nThe conversations were filled with such emotion and a clear desire to  do the right thing. As cease-fire talks continue, may we strive for an  end to this devastating war, to its suffering for all of Europe,  frankly, but obviously so much…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690214/supporting-ukraines-independence"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…been about  finding and working the common ground that unites us rather than  feeding the anger and resentments that divide us. Politicians on the  far fringes of each side desire divisions that they believe can lead to  elective office, power, and status. It is a false and dangerous path.\n\nThe dotted line that divides the city from the suburb is man-made.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697353/america-needs-unity"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…last December, formal  negotiations didn't start until last month.\n\nThere are many areas of overlapping priorities between the majority  and minority on this bill. We share a desire to lower the barrier to  entry for new entrants and bridging the valley of death for the most  promising ideas.\n\nHowever, there are some outstanding issues we are working through…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695450/extension-of-sbir-and-sttr-authority"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…not backed by sound economic theory or empirical evidence.\n\nTrade deficits primarily reflect underlying macroeconomic       factors such as the U.S. savings rate and the desire of our       trading partners to invest in the United States. The United       States has experienced trade deficits for 49 consecutive       years, yet, during this period,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699566/opposing-the-trump-administrations-sweeping-national-tariffs"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…unprecedented campaign against immigrants--immigrant crackdowns in  Virginia and elsewhere. And the claim of the administration and many  who support it is that this is because of a desire to protect Americans  and rid American streets of criminals.\n\nI maintain that President Trump has, instead, demeaned and  dehumanized immigrants and their countries of origin…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…hired him to secure our wedding when  MAGA protesters threatened our very precious and sacred event.\n\nJerry has always put the people of our community first, and his deep  desire to serve his community is an inspiration to all who have had the  opportunity to experience his passion for  protecting our community's most vulnerable.\n\nIn addition to his…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687992/congratulating-jerry-gachett-on-his-retirement"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…independent, elected office, rather than a position appointed       by and subordinate to the Mayor. With that vote, District       residents clearly expressed their desire that the Attorney       General should be independent and accountable to them. The       pending bill would displace that choice in favor of       installing an Attorney General…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…stolen, even though he lost by roughly 7 million  votes, to sow mistrust in our government, to deter people from voting.  This is all in service of President Trump's insatiable desire for power  and his insatiable ego.\n\nEfforts by his enablers to discourage absentee voting have already  disenfranchised servicemembers. In North Carolina, Republicans have…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…home,  they don't have it--because that kid will fall behind the kids who have  it. And it won't have anything to do with their ability, won't have  anything to with their desire to be a full participant in this great  American experiment.\n\nA study using Census Bureau data estimated that individuals with  greater access to the computer and internet…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…public media. In this political  climate, that kind of consensus is unheard of.\n\nThis is about one thing: the President's vendetta against the free  press and his authoritarian desire to control the media.\n\nPublic media enriches our lives, nourishes our minds, and makes our  communities safer. It deserves to be preserved and protected, not  gutted to score…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692523/rescissions-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…sense.\n\nThe Senate then has a trial. I would hope that the Senate would vote,  Republican and Democrat, to convict and remove this President from  office. That would be my desire. I don't always get what I want, which  means I have got to be prepared to file again.\n\nMr. Speaker, I am not going to let this behavior die. If my  colleagues don't vote this…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…all of these changes were backroom deals.  There were no hearings, no markups, no regular order. The chairman of  the Committee on House Administration didn't even feign a desire to  include rank-and-file members in the process. He actually requested a  completely closed rule for this bill.\n\nMr. Speaker, bad process is not a rare occurrence around here.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…that I first say a prayer, and then  after the prayer, I will make some comments about current  circumstances.\n\nI don't ask everyone to pray with me. You pray with me if you desire.  If you choose to do other things, then do those other things, but I  pray this prayer for my country.\n\nMost Gracious Creator, we know You by many names, but we also know…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…that we should not impeach at  this time. Well, I contend that there are many things that we bring to  the floor of the House that we don't get the kind of results that we  desire when we bring them initially, many things.\n\nWe have brought the equality legislation before the House, and we  passed it twice in the House. That doesn't mean that we are not…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692296/and-still-i-rise-denouncing-the-presidents-authoritar-ianism-and-recognizing-the-impeachment-warriors"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…sources by 2035.\n\nMr. GRIFFITH. Madam Speaker, I yield myself such time as I may  consume.\n\nMadam Speaker, let me assure you that those of us on this side of the  aisle have no desire to make people sick.\n\nThe number one test in a community as to whether or not there is a  likelihood of being sick or healthy is whether or not the people have a  good, strong…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…Arizona, which is why I jumped at the  opportunity to ask her to be a part of my veteran advisory council.\n\nJane's powerful voice, grounded by personal experience and genuine  desire to help those who served, has been an invaluable resource for me  and has greatly informed my efforts working to support the nearly  80,000 veterans in my district that they…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691925/jc-flag-football-championship"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…later a guest preacher for many years at summer adult camp       sessions. He continued to speak God's Word with joy until       health issues halted him at age 88. The desire to continue       sharing the Gospel never left him, even from his bed at       Sanford Hospice House.\n\nJim served on many boards in all of these parish       communities.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…always believed in  fostering sound policy with a carefully deliberative and consensus- driven approach. That approach is critical to getting the safety  outcomes that we all desire.\n\nAviation policy is enormously complex and deserves the full  deliberation of Congress to ensure that we get it right. It certainly  deserves some House input into the legislation.…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…jurisdictional interest of the House Financial Services       Committee in matters within H.R. 747, the Stop Chinese       Fentanyl Act of 2025.\n\nIn recognition of the desire to expedite consideration of       H.R. 747, the House Financial Services Committee agrees to       waive formal consideration of the bill as to provisions that       fall…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694826/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…the Subcommittee. This authority may be delegated by the       Chair to any other Member of the Subcommittee when necessary.\n\n4. If at least three Members of the Subcommittee desire the       Chair to call a special meeting, they may file, in the office       of the Subcommittee, a written request therefor, addressed to       the Chair. Immediately thereafter,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687952/us-senate-permanent-subcommittee-on-investigations-rules-of-procedure"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…roles both  as Recording Secretary and First Lieutenant. Over the years, Alan's  service with the fire company was marked by a deep sense of duty--a  reflection of his strong desire to serve and protect the community he's  always called home.\n\nIn 1994, Alan assumed the role of Roadmaster for Plumstead Township,  eventually rising to become the Director…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693337/recognizing-alan-bleams-40-years-of-service-with-plumstead-township"}, {"senator": "French Hill", "party": "Republican", "sentence": "…office to which  your suffrages have twice called me, have been a uniform sacrifice of  inclination to the opinion of duty and to a deference for what appeared  to be your desire. I constantly hoped that it would have been much  earlier in my power, consistently with motives which I was not at  liberty to disregard, to return to that retirement from…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700272/president-washingtons-farewell-address"}, {"senator": "David Taylor", "party": "Republican", "sentence": "Mr. TAYLOR. Mr. Speaker, I rise today to recognize C.J. Jones and  Isaac Corcoran of the Ross County Junior Fair Board.\n\nC.J. and Isaac had a desire to help address hunger needs in their  community and decided to participate in the Fight the Hunger, Stock the  Trailer program, run by Farm Credit Mid-America and Rural 1st.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699469/recognizing-cj-jones-and-isaac-corcoran"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Walt's leadership extended beyond his post as he also  served as District Commander of VFW Pennsylvania District 16. His  contributions to these organizations were rooted in his desire to  support and uplift fellow Veterans and their families, constantly  working to grow membership and expand community outreach.\n\nIn addition to his work in the VFW, Walt's…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692464/recognizing-the-life-and-service-of-united-states-army-veteran-walt-hartnett"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…alive by quietly telling their children the truth about how their  countries were once free and independent.\n\nThen, when the Soviet empire showed signs of weakness, their desire  for freedom burst forth in what is called the Singing Revolution. It  got the name because of the use of national songs banned by the Soviet,  and this, by singing it, was…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689062/russia"}, {"senator": "John Rose", "party": "Republican", "sentence": "…steadfast advocate for the Homebuyers Privacy  Protection Act.\n\nThis has been a long journey leading up to today's vote, and I thank  Representative Torres for his unyielding desire to put a stop to the  scourge of abusive mortgage trigger leads.\n\nMr. Speaker, H.R. 2808, the Homebuyers Privacy Protection Act will  literally impact each and every consumer…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692803/homebuyers-privacy-protection-act"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…language and AI. This app showcases both students'  outstanding knowledge and experience in computer coding.\n\nCreating an app from scratch truly speaks to their initiative and  desire to make an impact. Throughout the process, both students  maintained determination despite technical hurdles.\n\nTheir creativity and determination for success are truly inspiring.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699627/recognizing-congressional-app-challenge-winners-for-indianas-third-district"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…significantly impacting our programs and outreach efforts. Her  willingness to invest her time and talents into the organization speaks  volumes about her love for Brooksville and her desire to see it thrive.  She embodies the spirit of volunteerism, demonstrating a deep sense of  responsibility and pride in her work. Her dedication, hard work, and  commitment…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690272/recognizing-cindy-mahon"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…of meals, including stepping up at the last minute to  support a community feeding event for an elected official. They showed  up with no expectation of recognition--just a desire to help. Whether  at Moon Lake Park or on a roadside in rural Florida, Martha and Vincent  bring warmth and hope wherever they go. Their service touches every  corner of the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691268/recognizing-martha-narvaez-and-vincent-leandry"}]