[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…leaders do. In 5 months, only 6 of the 220  Republicans, over 97 percent of Republicans in this Chamber, have had  an amendment made in order. That is not by mistake. That is a design  flaw; a big one.\n\nI don't understand how my Republican colleagues, some of which were  so excited about having a bigger, better, open process, can say with a  straight face…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…can be made by a  single individual--the President--with no requirement that he first  consult with anyone. A single use of a tactical nuclear weapon, either  by accident or design, could trigger a flurry of escalating responses  with far more powerful strategic weapons that would cause incalculable  loss of life, widespread radiation poisoning, and destruction…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…me.\n\nThat is not the responsibility of a Senator of the United States of  America, to bend the knee to the executive branch. The Constitution  gives us the responsibility to design how the executive branch  functions. It gives us, the Senate, the responsibility to fund the  programs and the services.\n\nThe way you lose government of, by, and for the people…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…beautiful courthouses and courtrooms across this country, and so I  have seen how empty and underutilized many of those spaces are.\n\nBy implementing these standards into the design guide for Federal  courthouses, the GSA will be able to reduce construction costs and  ensure that existing spaces in courthouse complexes are being fully  utilized.\n\nOver…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695379/courthouse-affordability-and-space-efficiency-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…our Constitution  puts the power of the purse here in Congress. Our Founders considered  this the difference between a democratic republic where the people's  representatives design and choose the programs and fund them and an  authoritarian state where a King decides what the programs are.\n\nThe Supreme Court has reaffirmed that vision multiple times,…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699431/consolidated-appropriations-act-2026"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…farms, from schools--all in service of a  political agenda that is not about protecting Americans but is serving  the political interests of the President and the fiendish design of  Stephen Miller, with the implementation of a reckless Kristi Noem.\n\nSo if only 14 percent of those people deported are dangerous  criminals, what are the others? It is…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700023/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…D.C., certain military  property, certain coins and medals, D.C.-owned parks and buildings and  certain private land in D.C. Under the EOs, CFA has review authority  for the design of D.C.-owned parks and buildings. Under the Shipstead- Luce Act, CFA has review authority for the design of private buildings  in D.C. ``adjacent to public buildings and grounds…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694733/introduction-of-the-commission-of-fine-arts-district-of-columbia-residency-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…demonstrating impressive results. For example, earlier this year, NASA  and the DOE collaborated on selecting an award for continued industry  work on a space microreactor design that could provide a supply of  power for use on the Moon and beyond.\n\nJust last week, scientists posted new data from the Department of  Energy's ground-based Dark Energy…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688987/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…power of  judicial review. The duty and responsibility of federal courts is to  review laws and policies that have a national impact. Federal courts  are not local courts. By design their role is national and is not  limited to one state or one county. Limiting the ability of federal  courts to carry out their duty would undermine the rights and freedoms…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690122/no-rogue-rulings-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…billionaires deciding what is important.\n\nSo an incredibly essential distinction between a democracy and an  authoritarian government is the decisions about the programs, their  design, and their funding are made by Congress.\n\nWhat we have seen is that the President and his head of Office of  Management and Budget, Russell Vought, are attempting to take that…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…Representative Haley Stevens for  this opportunity to speak on behalf of this really important  legislation.\n\nImagine, if you will, the ability to model a manufacturing process to  design a basketball shoe, maybe modeling the opportunity to cure a  disease, maybe modeling market behavior, perhaps modeling a system to  be able to equitably donate organs to people…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688979/mathematical-and-statistical-modeling-education-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…bill.\n\nMr. Chair, let me tell you a little bit more about why it is  important that this amendment be defeated. By preventing funding for  the Bioindustrial Manufacturing and Design Ecosystem partnership, or  BioMADE, this amendment would hand a clear win to China.\n\nThe bipartisan National Security Commission on Emerging Biotechnology  recently completed…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Rosendahl, FRH has  built award-winning new developments like the Ives in Wheat Ridge and  the AVi at Olde Town in Arvada, which have been recognized for their  thoughtful design and emphasis on supporting residents. I look forward  to seeing what the next 50 years will bring for FRH as they continue to  provide critical housing resources for our community.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695831/recognizing-foothills-regional-housing"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Vladimir Putin, Xi Jinping, or any other leader of a  nuclear weapon state. Or it could be triggered by mistake.\n\nA single use of a tactical nuclear weapon, either by accident or  design, could trigger a flurry of escalating responses with far more  powerful strategic weapons that would cause incalculable loss of life,  widespread radiation poisoning, and destruction…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699676/the-new-start-treaty"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…was deeply concerned by the language in  the introduced version of this legislation, which may have been  interpreted by the Treasury Secretary to allow him to select a new  design for a $2.50 coin.\n\nWe are already witnessing how Secretary Bessent has exploited  loopholes and ignored existing laws, resulting in the Treasury minting  a $1 coin bearing…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699868/for-americas-250th-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…requirements       applicable to such standard are stated in terms of required       results, with criteria for verifying compliance rather than       specific composition, design, or procedure.\n\n``(6) Institution of higher education.--The term       `institution of higher education' has the meaning given such       term in section 101 of the Higher…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Small Business Advocacy Improvements Act.\n\nI thank my colleagues, Representatives Van Drew, Tran, and  Goodlander, for joining me in support of this critical legislation.\n\nBy design, the SBA Office of Advocacy acts as the independent voice  representing the views and interests of all small businesses within the  Federal Government. This means calling attention…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687957/small-business-advocacy-improvements-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…stuff. The problem is our  hallways are crowded with people. Here it is all about the money.  Understand, Congress is really about one thing: Money. The  inefficiencies, the design failures for these bureaucracies, for the  business models that make their living off government, that is their  profit. They actually like the inefficiencies.\n\nWe came and…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…that do not align with guidance relevant to such software or       hardware, or products or services, as the case may be,       provided by the Agency, including Secure by Design or       successor guidance; or\n\n``(G) to purchase software or hardware, or products or       services of such software or hardware, as the case may be,       that are designed,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696787/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…program, we discourage the nuclear  family. That is why we have gone from a 4 percent rate of kids born  without a mother and father at home to 40 percent. It was like it was  by design, like somebody wanted to destroy the nuclear family.\n\nIt is important to remember that we may individually not know these  people, but there have always been people who wanted…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…and engaging employees, teamwork,       leadership, and professional development; and\n\n``(ii) identify strengths and areas for development.\n\n``(c) Requirements for Training Design.--Training in the       program components established under subparagraphs (A) and       (B) of subsection (b)(2) shall--\n\n``(1) be designed using principles of adult learning…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698216/federal-supervisor-education-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…molecular target that the       Secretary determines to be substantially relevant to the       growth or progression of a pediatric cancer.\n\n``(B) Additional requirements.--\n\n``(i) Design of investigation.--A molecularly targeted       pediatric cancer investigation referred to in subparagraph       (A) shall be designed to yield clinically meaningful…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Technology:\n\n1. The WGU-59/B Advanced Precision Kill Weapon System-II       (APKWS-II) All-Up-Round (AUR) (Rotary Wing) and WGU-59A/B       APKWS-II AUR (Single Variant) are a design conversion of an       unguided Hydra 2.75-inch rocket with a laser guidance kit to       provide precision capability. As a low-cost weapon, it is       intended as an inexpensive…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688927/arms-sales-notification"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…include the less-than-lethal  category to ensure that devices like the TASER 10, that are not  designated to be lethal, are not included under the NFA's taxes and  regulations design for firearms for use by municipalities, not  individuals.\n\nI am honored to be a cosponsor of this bill along with, I think, at  least 22 commonsense Democrats, and I strongly…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700029/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…are still registered to vote in some States and in some  cities around the country.\n\nAlso noncitizens sometimes get registered by mistake. I am not saying  this happens by design, but it happens by mistake, and it largely  happens due to the National Voter Registration Act of 1993 known as the  Motor Voter Act. This requires every person applying for…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…and aircrafts; and\n\n(ii) an assessment of whether existing facilities are       adequate to support such cutter and aircraft, and the costs       of planning, engineering, design construction, land       acquisition, and environmental remediation.\n\n(c) Initial Report.--\n\n(1) In general.--Not later than 90 days after the date of       enactment of this…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…conspicuously.\n\n(c) Reasonable Visibility of Symbol and Label Notice.--\n\n(1) In general.--A covered entity shall ensure that--\n\n(A) packaging seams or folds or other packaging design       elements do not obscure the symbol or label notice;\n\n(B) the symbol and label notice are each equal in size to       at least 2 percent of the surface area of the principal…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692751/wastewater-infrastructure-pollution-prevention-and-environmental-safety-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Arrowhead Pointe is described as the epitome of serenity and offers an  excellent recreational experience to locals and visitors alike.\n\nBeyond its natural beauty and top-tier design, Arrowhead Pointe is  praised for its affordability, making it accessible for golfers of all  ages and budgets. This course is more than just a place to play. It is  a retreat…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691783/recognition-of-richard-dick-wallace"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…leadership seems to have forgotten is that the House is a  coequal, independent branch of our government. There are supposed to be  tensions between the branches. That is the design of our system.\n\nEven if the leaders of the other branches are carbon copies of  yourself, Mr. Speaker, there should, from time to time, be some tension  because of the difference…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…transformation while remaining true to its founding principles.\n\nUnder Mr. Hebel's leadership, Bucks Country Gardens has thrived as  both a retail garden center and a landscape design firm. The garden  center offers an impressive array of plants, trees, and flowers as well  as fine outdoor furniture from trusted brands such as Castelle,  Hanamint, Telescope,…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696583/recognizing-bucks-country-gardens-president-tom-hebels-retirement-after-years-of-service"}]