[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…designation allowing certain foreign nationals  from countries experiencing turmoil to remain here without fear of  being deported--back to Afghanistan in this case.\n\nTPS was first designated for Afghans under the Biden administration  in 2022 after we withdrew from Afghanistan, marking the end of  America's longest war.\n\nFor over two decades, tens of thousands…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693450/temporary-protected-status"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…nearly two centuries, the Armory  provided the tools necessary to defend our Nation and served as a hub  of innovation and craftsmanship. In 1974, the site was officially  designated a National Historic Site and was entrusted to the  stewardship of the National Park Service.\n\nOnce the home of our Nation's first armory, the Springfield Armory  National…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694730/recognizing-the-50th-anniversary-of-the-springfield-armory"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…just to gain entry and finally got  a scheduled appointment.\n\nWhen I visited, 1,079 people were being detained at Bluebonnet.  Nearly 700 of them, almost two-thirds, were designated by ICE itself as  a low threat. Let me repeat: Hundreds of people with no violent  history, no record of serious crimes, targeted solely because of the  color of their skin,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695521/visit-to-bluebonnet-detention-facility"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…constituents who have been harmed by the administration's new  immigration policies, one of which placed a hold on immigration  petitions and applications from 19 countries designated by the  administration.\n\nIn our district, families followed the law. They filed their  paperwork and waited in good faith. They were told that their  application was in good…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698917/korean-american-day"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…letter--about what  they were doing in September. They said they considered themselves to  be in a ``non-international armed conflict''--that means a war--against  a secret list of ``designated terrorist organizations.''\n\nI received a briefing last week on the administration's strikes in  the Caribbean. During that briefing, Members of the Senate Armed  Services…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696126/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…battlefield in  1927, establishing a park known as the Saratoga Battlefield Park.  However, the site's name changed to the Saratoga National Historical  Park when Congress designated it as part of the National Park System in  1938.\n\nToday's bill would restore the use of the term ``battlefield'' in the  park's name to reflect the site's significance in…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691017/strengthening-americas-turning-point-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…1970s, the Federal Government dumped massive amounts of UXOs into the  ocean, including depth charges, torpedoes, munitions, mustard gas, and  even chemical weapons, all in designated explosive dumping areas. If  that wasn't bad enough, these same waters were used to dispose of  radioactive waste.\n\nThe old technology used to map these areas was crude at…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…terrorist group or organization that enforces or espouses terrorist  activity is presently inadmissible to the United States and is  presently deportable. Hamas has been designated as such a terrorist  group since 1997.\n\nWe already plainly have the legal tools to keep any noncitizen  involved with Hamas, as well as any noncitizen who was involved in…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697236/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…prepared for  potential threats. However, its reliance on the annual Urban Area  Security Initiative, or UASI, designations creates uncertainty for  local governments, as the designated high-risk areas can change, and  they usually do.\n\nThis bill aims to improve the program's stability and strengthen  partnerships with at-risk cities by allowing the Countering…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688696/securing-the-cities-improvement-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…into surrounding  neighborhoods.\n\nIt should be no surprise that asthma and cancer remain challenges for  my community. In 2019, the Asthma and Allergy Foundation of America  designated Akron as an asthma capital alongside it being the rubber  capital, and ranked the city 14th in the list of the top 100 most  challenging places in America to live with asthma.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688529/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…Plant Health       Inspection Service. I worked to mitigate human-wildlife       conflict and protect American agriculture. As a Wildlife       Services biologist, I was also designated as an emergency       response official and was preparing to deploy to help the       efforts combating the avian influenza epidemic.\n\nBird flu cases are popping up across…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688173/fired-by-president-trump"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…The place where I lived collapsed, and the building       where I worked was completely destroyed. I could not return       home. When Temporary Protected Status (TPS) was designated       for Haiti, it brought me immense relief during an incredibly       painful and uncertain time.\n\nWhile mourning the loss of so many family members and       friends,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…or local SBA office housed in a `sanctuary       jurisdiction', ignores the fact that millions of small       businesses are located in or near cities that could be       designated as a `sanctuary jurisdiction.' Moving offices       farther away from the small businesses they were intended to       support certainly would not facilitate SBA better servicing…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…claims  of Saddam Hussein having weapons of mass destruction to justify going  into Iraq. Last month, just 2 weeks before ordering the capture of  Nicolas Maduro, Donald Trump designated fentanyl as a weapon of mass  destruction. Fentanyl is terrible. It is not a weapon of mass  destruction.\n\nIt was Donald Rumsfeld all those years ago who falsely claimed…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698623/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…consequences will be severe, forcing       families into crisis, undermining local economies, and       pushing communities into unnecessary instability.\n\nTPS for Haiti was first designated in 2010, after a       catastrophic earthquake. Extensions continued over many years       in recognition of Haiti's ongoing instability and       humanitarian needs. The…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…multiple withdrawals of public land to ensure a stockpile of fuel  supplies for the Navy remained available. The largest of these reserves  was on the Alaska North Slope and was designated by President Warren G.  Harding in 1923 as the Naval Petroleum Reserve Numbered 4, Alaska.\n\nFollowing the discovery of oil at Prudhoe Bay and the ongoing oil  embargo, Congress…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…National Petroleum Reserve in Alaska--we call it NPR-A--is a 23  million-acre tract of land. It is roughly the size of the State of  Indiana. It was specifically--specifically--designated for responsible  energy development.\n\nThe petroleum reserve dates back a century, to President Harding's  withdrawal and initial control by the U.S. Navy.\n\nMore recently,…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…an important debate we are having,  and I will give you my view on how all of this works.\n\nUnder the Constitution, two things occur: The President of the United  States is designated as the Commander in Chief of the Armed Forces, not  Congress. So the Commander in Chief is one person, the President.  Declaring war is a duty of the Congress. In the case…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "James Risch", "party": "Republican", "sentence": "…it is certainly available in the Intelligence Committee.\n\nThe people carrying those drugs were terrorists, plain and simple.  They were trafficking drugs that financed a designated foreign  terrorist organization. These strikes were fully compliant and fully  justified under the President's article II constitutional authority-- and not only authority…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696121/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…rise today to recognize  Coudersport, Pennsylvania, as the 2025 Heritage Community of the Year  through the PA Route 6 Alliance.\n\nThis award is presented each year to one designated heritage  community  that has embraced their heritage tourism work plan and has implemented  worthwhile projects that show impact and results in their community.\n\nCoudersport…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695113/coudersport-2025-heritage-community-of-the-year"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…parties.\\49\\\n\nHere, the Miles City RMPA does entail some changes to       agency procedure in that BLM will no longer consider coal       leasing applications for the acres designated as unavailable       for further consideration. However, like the Forest Service       memorandum in B-274505 and the Tongass Amendment in B-238859,       the Miles City…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693085/us-government-accountability-office-legal-opinion"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…designate a unique ZIP Code for certain communities,  including North Tustin in my district.\n\nNorth Tustin has been a pillar of our Orange County community and a  census-designated place. However, its status as an unincorporated area  has caused confusion for the Postal Service and for tax purposes.\n\nFor example, North Tustin residents are subject to…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693903/single-unique-zip-codes-for-certain-communities"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…described in this       section.\n\n(d) Definition of Critical Infrastructure Sector.--In this       section, the term ``critical infrastructure sector'' means       each of the 16 designated critical infrastructure sectors       identified in Presidential Policy Directive 21 of February       12, 2013 (Critical Infrastructure Security and Resilience).\n\nMr. Speaker,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690290/critical-infrastructure-manufacturing-feasibility-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…POST OFFICE.\n\n(a) Designation.--The facility of the United States Postal       Service located at 840       Front Street in Casselton, North Dakota, shall be known and       designated as the ``Commander Delbert Austin Olson Post       Office''.\n\n(b) References.--Any reference in a law, map, regulation,       document, paper, or other record of the United…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697598/commander-delbert-austin-olson-post-office"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…required under the Clean Water Act (CWA)       permitting process. Because clear and predictable permitting       leads to the creation of attainable housing, NAHB has       designated support for passage of H.R. 3898 as a KEY VOTE.\n\nRegrettably, housing production is not keeping pace with       demand. Among the significant headwinds facing the home…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…disclosure under       section 552(b)(3) of title 5, United States Code):\n\n``(1) Information provided to the Secretary by the       Administrator that the Administrator has designated       confidential.\n\n``(2) Information collected by observers.\n\n``(3) Information submitted to the Secretary by any person       in compliance with the requirements of this…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691006/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…the BLM-managed  areas within the planning area, it affected access for other  landholders in the region, principally Doyon and the State of Alaska.  The Central Yukon RMP designated 21 Areas of Critical Environmental  Concern spanning 3.6 million acres and reclassified Visual Resource  Management areas in ways that hinder infrastructure development.…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…by one person.\n\nSo I will vote today to end the emergency. I will vote today to try  to reclaim the power of taxation, the power of the tariff to where the  Constitution designated it should properly be, and that is in Congress.", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…Justice       program and the rationale for any changes made since       September 1, 2021.\n\n(II) An identification of members of the Haqqani Network       who are Specially Designated Global Terrorists and the status       of the designation of the Haqqani Network as a foreign       terrorist organization.\n\n(III) A description of any United States Government…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692738/no-tax-dollars-for-terrorists-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…or by the Chair with the concurrence of the Ranking       Member, the subpoena may be issued upon the signature of the       Chair or of any other Member of the Committee designated by       the Chair.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687982/us-senate-committee-on-rules-and-administration-rules-of-procedure"}]