[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…office in Syracuse and was fired from her job helping rural  farmers and businesses across Upstate New York. Tiffany is just one of  many USDA employees fired with no notice despite years of service,  leaving farmers across America wondering who is left to help.\n\nIt is amazing. These people worked hard. There was nothing against  them. They didn't get…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…create confusion in the event of an active  shooter, how it might expose their agencies to more liability, and the  insufficiency of training requirements for retired officers.\n\nDespite all of that, LEOSA became the law after Congress legislated  some important limits on it and imposed commonsense training  requirements on the former officers. Those have…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…moment. For us this is not to be about spiking the football. This  is not to be about an end-zone dance. This is about to declare a major  victory for the American people.\n\nDespite what I have heard, they have used every maneuver and  procedure to prevent the very debate that we are going to have for the  next hour. All these years later, they never…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698788/breaking-the-gridlock-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…19, he was flying combat missions over the skies of Europe,  defending and liberating rights and freedoms abroad that we all know  that he did not enjoy even back at home.\n\nDespite that, Lieutenant Colonel Hardy kept the mission first, front  and center. With the other Tuskegee Airmen, they exceeded expectations,  and they left behind a spectacular record…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696982/tuskegee-airmen-moment-of-silence"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…an unfair and costly shortcut to the electric grid  while doing nothing to protect working families from rising energy  costs.\n\nThis is an unfortunate theme this Congress. Despite the promises of  the President and my Republican colleagues in Congress, they haven't  brought any bill that will help address the affordability squeeze.  Right now, as we…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695752/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…The suicide rates among farmers, ranchers, and agricultural managers  stand at nearly 44 deaths per 100,000 people, which is significantly  higher than the national average.\n\nDespite this crisis, my Republican colleagues recently passed their  big, ugly bill, which guts Medicaid. Medicaid provides access to the  care many in our rural communities need.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695302/mental-health-of-farmers"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…further alienate those  partners already reeling from the Trump administration's foreign  assistance freeze, which terminated nearly all humanitarian assistance  to Afghanistan, despite its compliance with U.S. law and policy.\n\nMr. Speaker, I am glad that Mr. Burchett was willing to work with  Democrats to address many of our concerns about this legislation.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692739/no-tax-dollars-for-terrorists-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…reliable housing.\n\nMr. Speaker, this is personal. In New Mexico, there are thousands of  families who are struggling just to make it to the end of the month.\n\nI will say that, despite the darkness, New Mexico is leading the way  and showing what it looks like to lead with integrity and invest in an  economy that will make it possible for families to thrive.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695608/devastating-harm-caused-by-trump-administration"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…are, now  151 days since the beginning of this 119th Congress, and American  families have seen zero relief. Nothing has been done to help them as  costs continue to rise, despite promises from the administration and  the GOP congressional majority to lower prices on day one. Instead,  this Republican majority is poised to make things worse through…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691770/151-days-without-a-vote-to-lower-costs"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Florida. Mr. Speaker, I thank the gentleman from New  Jersey for yielding the time.\n\nMr. Speaker, here we are 9 months into the Trump administration and  Republicans in Congress, despite their promises, have done nothing to  lower energy costs. In fact, costs keep going up, up, and up, and the  GOP policies are making it worse. I have to say that Americans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695692/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…House, that goes to the  heart of our electoral process and the right of each of our citizens to  make their decision and their vote be the one that counts.\n\nAt the same time, despite the political violence at home and rising  tensions abroad, the Trump administration has taken an ax to CISA. As  we know, that is the Agency that works to curb emerging cyber…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…understaffed and run almost entirely by women,       most of them women of color and many immigrants.\n\nGovernment subsidies for child care cover only some of the       cost of care, despite California's recent additional       increases in subsidy rates for providers and funded child       care slots.\n\nChild care providers frequently make personal sacrifices…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…enthusiasm. They pitched in not because they  had to--many donated their salaries to charity--but because they felt  the store's survival was essential to their community.\n\nDespite the challenges they face as a small business--staffing  shortages, supply chain issues, competition from online retailers--Dan  & Whit's endures. The store represents the…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694332/recognizing-dan-whits-general-store"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…decade. He had a court hearing where a court ruled that Mr. Garcia had  a right to be here and that he would be in danger if he was returned or  deported to El Salvador.\n\nYet, despite the court order, ICE agents arrested Mr. Garcia anyway,  and they deported him to El Salvador. Despite this court order, ICE  agents, without a new hearing and without any…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690420/put-hardworking-american-families-first"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…the people of the Second District  of North Carolina.\n\nThis is an exceptionally challenging time for public servants in  America. Congressional staff are no exception. Yet, despite an  increasingly hostile political environment, my office continues to  deliver superlative results for my constituents.\n\nLast year, my district staff hosted or attended almost…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688691/recognizing-my-congressional-staff-in-honor-of-national-employee-appreciation-day"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…premium tax credits--the taxpayers' share of  subsidizing the premiums on the exchanges grew to 93 percent. What  started off as 68 percent has become 93 percent this year. Yet, despite  all this money--let me repeat--the actual premium never decreased; it  is just that the taxpayers were paying more of it for our fellow  Americans.\n\nNow, somebody is paying.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…raise my hands  for seconds. Now, I don't know if I was her favorite, but certainly I  was one of her favorites.\n\nThe interesting thing was, we couldn't gain weight, though. Despite  eating seconds and an active lifestyle, nobody gained weight. We were  all in a good weight area.\n\nAnd what did we eat? We ate real food. What did that real food look  like?…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…80 percent of its power, which is  ultimately what jeopardized their grid. This should be a wake-up call  for policymakers everywhere.\n\nThat brings me to reason number four. Despite the warning signs and  the cries from grid operators, 95 percent of the projects waiting to  connect to our grid in the U.S. are wind and solar; 95 percent.\n\nThat is not because…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690785/big-beautiful-bill"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…by producing data on the health of the fishery.\n\nThe Great Lakes Mass Marking Program Act was administratively  established in 2010 and continues to receive appropriations despite  never being authorized by Congress. H.R. 1917 would provide formal  congressional authorization for this existing program, thereby  increasing the opportunity for congressional…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693992/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…money in U.S. universities comes from just four sources,  including China and Qatar, nations that oftentimes have strategic and  ideological conflicts with U.S. interests. Despite this, 70 percent of  universities fail to comply with foreign funding reporting  requirements. Worse, universities can simply list foreign donors as  anonymous, further obscuring…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689028/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…129 percent since  2014. Indeed, the very first year ObamaCare went into effect, premiums  skyrocketed by 47 percent. This is the true record of the unaffordable  care act.\n\nDespite the lies that continue to be told in the media to this day,  Republicans have always proposed alternatives to the failed  unaffordable care act framework that Democrats continue…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698305/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…Republicans are working to deliver on our promises to the American  people: securing our border, protecting communities and elections, and  bringing down the cost of living despite Democrats fighting us on every  turn.\n\nMr. SCOTT of Florida. If my colleague from western Massachusetts  wants to defend democracy and protect elections, I offer him an  alternative…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700025/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…large- scale annual event in New Port Richey--one that would not only generate  funds for the RAP House but also raise community awareness and  engagement with YFA's mission. Despite having no prior experience in  organizing a 5k race, her determination and passion quickly rallied a  team of dedicated volunteers around her dream. From that vision, the…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692476/recognizing-victoria-barley"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…been declared, as the Senator from Virginia  remarked, everywhere. There is an emergency everywhere. Sounds like an  emergency everywhere is really an emergency nowhere. But despite the  constitutional restraints or constraints on executive power, Americans  have now been ordered to pay higher taxes in the form of tariffs but  without the consent of Congress.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…from receiving Medicaid funding  because these dollars should go toward real healthcare helping women,  children, and families, not to organizations that end innocent lives.\n\nDespite what my good friends from the left claim, killing a child is  not a birth control measure.\n\nWhen Planned Parenthood sued to undo the decision, it wasn't just  about funding.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692891/dobbs-v-jackson-anniversary"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…brought light, safety, and hope to  communities long overlooked, allowing children to study after dark,  families to preserve food, and elders to live with greater comfort.  Despite daunting challenges and limited equipment, the WREC team  completed a demanding project in just eight days--far ahead of  expectations--demonstrating professionalism, humility,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692515/recognizing-cody-thomas"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…itself  estimates the final rule will cost $8 billion. However, it  substantially underestimated compliance costs throughout the rulemaking  process.\n\nThe Department of Energy, despite feedback from stakeholders, did not  account for the significant ongoing capital investment manufacturers  must make to shift to new refrigerants.\n\nWhen amending energy efficiency…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…misses before this deadly crash. In fact, just last  Friday, an Air Force tanker was flying without using ADS-B and nearly  collided into a JetBlue plane headed to New York despite the  justifiable public outrage over what happened at DCA. Clearly, the  Pentagon's behavior needed to change.\n\nIn July, I, alongside eight of my Republican colleagues, introduced…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698320/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…front porch, kayaking, eating hearty  meals, and rescuing animals, like Charlie the dog and Gus the goose.\n\nMr. Chapman was also known for his work ethic and perseverance  despite the challenges faced as a polio survivor.\n\nToday, I ask that we all take a moment to remember Ben Chapman and  his contributions to his local community.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693467/recognizing-ben-chapman"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…factor.\n\nThe mental health crisis among America's veterans has reached an  alarming level. Suicide is now the second leading cause of death for  veterans under the age of 45.\n\nDespite ongoing efforts, the Department of Veterans Affairs struggles  to accurately track and report veteran suicides. This not only hinders  the development of effective policies…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695483/modernizing-all-veterans-and-survivors-claims-processing-act"}]