[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…blast in Iraq made it difficult  to care for the newborn.\n\nWe need to be very clear. This act won't return his amputated leg.  But it can provide him and his family with desperately needed financial  certainty, which they deserve, they need, and they were promised.\n\nAnd it would also help veterans like retired MSgt Gabriel Peterson of  Biloxi, MS. He was…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…blocking that solution, which  we offered as a straightforward extension of the ACA premium tax  credits--why they blocked that, because Kathleen and so many other  families desperately needed it.\n\nI will have to say I have to give some rare congratulations to at  least 17 Members of the House, Republican Members of the House, which  had actually taken action…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698976/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…protects consumers and equips assigned agencies with the  appropriate authority to provide efficient and thorough oversight over  digital asset markets. It also provides desperately needed certainty so  that businesses can grow and evolve.\n\nI will be clear: If the CLARITY Act had been in place, the FTX market  crash that caused their customers to lose $8…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…Look at this photo of a young girl in her father's arms who has lost  more than 40 percent of her body weight. That is the condition in Gaza.\n\nLook at this photo of desperately needed aid sitting right outside  reach.\n\nWhere is our humanity? Where is our compassion? We must bring aid,  hope, and life to Gaza.", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692119/aid-to-gaza"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…for all. It would require lawmakers to place certain  investments into qualified blind trusts, prevent conflicts of interest,  and restore accountability where it is so desperately needed.\n\nMr. Speaker, I am proud to cosponsor the TRUST in Congress Act, and I  thank Representatives Magaziner and Roy for their leadership on this  critical bipartisan legislation.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691223/stock-trading-ban-for-members-of-congress"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…month, which will cut  back in so many instances on the kind of healthcare they get--make them  switch hospitals, switch doctors, not afford the prescription drug that  is desperately needed by their child who has cancer.\n\nEvery night, Americans are grappling with this horrible problem  because there is nothing more important to a family than the health of…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Most of all, this man       respected and showed love for my dad. He lived an honest       life, worked 24 hours a day, 7 days a week--and performed a       job that was desperately needed. This man who kept my father       alive was an immigrant with temporary status.\n\nRemoving temporary status from people who fled hardship,       seek a better life, and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…opportunity available. I also thank the teachers and coaches who worked  with the teams and these impressive students for giving us hope for the  future at a time when it is desperately needed.\n\nPlease join me in congratulating Lincoln High School and Sprague High  School on their cochampionship win of We the People: The Citizen and  the Constitution competition.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691209/supporting-the-womens-bureau-at-the-department-of-labor"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…was that addiction  was a personal failure. Those who suffered from addiction were cast out  of society, isolated from their families, and denied the treatment they  so desperately needed. Instead of being sent to hospitals, they would  be sent to jails.\n\nHowever, there was one man willing to venture to Skid Row. He had  rosy Irish cheeks and a slight…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694580/recognizing-50-years-of-haymarket-center"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…is  currently a wait-list of more than 200 families trying to get into  school on the base; resources to construct a new barracks at Fort  Stewart, where housing has desperately needed upgrades following  alarming reports of mold and pest infestation; resources to bring the  F-35A flight simulators to Moody Air Force Base in Valdosta and  accelerate…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694129/9999"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…universities in this country what they can teach and what they cannot  teach, and I repeat, giving away our money to a country, $40 billion,  at a time when that money is so desperately needed in this government.\n\nWe can talk about this all day, but, absolutely, you are looking  silly when  you are trying to talk about communism-lite or you are trying to  describe…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…who  deserve to have their communities safe as well?\n\nI am standing today just to say, let's use common sense and help our  police officers together; get the resources desperately needed out to  our communities now and not let this fall victim to something that  wasn't even an issue in Donald Trump's first term.", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…be the wind at the backs of our teachers and our  schools.\n\nOf course, they have a bill to help the NCAA take advantage of  student athletes because what this Congress desperately needed was  another billionaire organization empowered to squeeze young people. It  is more of the same. It is more of the same.\n\nThey give more to those with the most, while…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…to create thousands of new jobs and produce $1.1  billion of revenue for Alaska. Road construction alone will create more  than 350 jobs, creating economic opportunity desperately needed in  rural Alaska.\n\nKeep in mind, this is only one project unlocked by this CRA. This CRA  will also help the advancement of the Alaska LNG pipeline project.\n\nGlobal demand…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…continue to talk about  the harmful provisions within this resolution. In reality, this is the  beginning of the process. It is the beginning of a course correction as  desperately needed following 4 years of policy that placed America in a  position of excess and decline.\n\nSpeaking of excess, since President Trump's first term, increased  enrollment and…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688080/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…boy in the truck, cranked up the heat, and  began rubbing his feet to warm them.\n\nDanny immediately radioed the proper authorities to get this boy the  medical care he desperately needed. With temperatures so low, the risk  of catastrophe was imminent. Peculiar Police Chief Don Shepard, who was  on the scene, said the boy ``was near hypothermic and might…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690127/recognizing-the-heroic-actions-of-mr-danny-wells-of-peculiar-mo"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…to say ``well done'' and set a fresh new example; be the next  generation of leaders; be the people who will rise up and do what is  right; be the role models that are desperately needed; be individuals  who will actually not only have a faith but live your faith--all the  principles of the faith.\n\nWe can certainly use individuals in our Nation right…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695773/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Failing\n\nMr. KILEY of California. Mr. Speaker, at this moment, we have an  opportunity to catalyze a school choice revolution across America, and  one has never been more desperately needed.\n\nThe Nation's report card recently came out, and the verdict was  clear: Our public education system is failing. The National Assessment  of Educational Progress showed…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…an emergency, the Treasury  Department can more quickly respond when it comes to an individual's  tax obligations. This legislation will help disaster victims receive  desperately needed tax relief sooner rather than later.\n\nAdditionally, this legislation doubles the current mandatory tax  filing extension following a federally declared disaster declaration…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689383/filing-relief-for-natural-disasters-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…was approved for residential housing in the  past, but the projects never materialized. This land transfer will  bring a new neighborhood into the community, providing desperately  needed housing to Tribal members. The Tribe already owns this land. It  merely seeks the freedom afforded by Federal trust status to bring it  to fruition.\n\nThe transfer of…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697668/shingle-springs-band-of-miwok-indians-land-transfer-act-of-2025"}]