[{"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…economic,  political, and military coercion against it.\n\nJust last month, the PRC conducted large-scale drills in the waters  and airspace around Taiwan in a dangerous and destabilizing show of  force. I heard these concerns reinforced recently during a  congressional visit to the Pacific countries.\n\nUnder such tense circumstances, we must work to maintain…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690684/taiwan-assurance-implementation-act"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…oil, we have other minerals.''\n\nTo address the growing presence of foreign actors, Sahad       called on the U.S. to crack down on the nations suspected of       playing destabilizing roles in Libya. While he said he was       encouraged by moves such as the Libyan Stabilization Act that       passed the House of Representatives in 2021 but was never…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…only at risk of  reestablishing the idea that might makes right and military conquest is  acceptable in your sphere of influence, but there is the very real  prospect of destabilizing a world order post-World War II that has made  us safer and more prosperous.\n\nNow, when it comes to Congress's role in checking this President, in  asserting its war powers…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698678/venezuela"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…with Federal  requirements, many people with disabilities were hit hard and fast by  the loss of services.\n\nI implore every one of my colleagues: Do not be complicit in  destabilizing the lives of millions of people, including Rachael's son  who will have their healthcare ripped away.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691440/gop-tax-scam-hurts-women-and-families"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…can bomb  our way out of a drug trafficking crisis is not strategy; it is wishful  thinking. Using the U.S. military to conduct unchecked strikes in the  Caribbean risks destabilizing the region, provoking confrontation with  neighboring governments, and drawing our forces into yet another open- ended conflict without a clear mission or exit strategy.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…representatives across New Hampshire last  month, the theme they kept coming back to was ``uncertainty.'' As a  former small businessowner, I know that uncertainty is the most  destabilizing aspect of running and growing a business. Yet that is  what this administration keeps creating.\n\nYesterday, we learned that new orders from manufacturers dropped in  February…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…The latest House vote breaks a vital promise to more than       70 million Americans who depend on the Medicaid Program and       now face the potential for unprecedented, destabilizing cuts       to their coverage and access to care. The full extent of cuts       being considered go far beyond addressing ``waste, fraud and       abuse'' and would undermine…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…impact will reverberate through families, schools, churches,       and workplaces.\n\nFrom our clinical and community perspective, ending TPS for       Haitians is not only destabilizing, it is inhumane. It       punishes resilience, undermines recovery, and disregards the       deep trauma history carried by this population.\n\nWe urge decision-makers to…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…to work with any of my colleagues to develop  a commonsense approach to limiting our nuclear stockpiles and to keep  this administration from taking us down a costly and destabilizing  path, which is why I am proud to have cosponsored H.R. 100, which,  again, just reiterates my position on nuclear proliferation. I thank  Dr. Foster for all his work.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699034/expiration-of-new-start"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…a very long part in this history.\n\nMr. Speaker, I will end with this. Let me just tell you, the cameras  of history are rolling. What will be the downstream effects of  destabilizing the country, an entire region? Anyone who tells you they  know, they are lying.\n\nWhat we do know is that the American people don't want this. That is  unequivocal. Even…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…and stateswomen. It is  past time to break out of the brutal and circular logic of terrorism  and violence and war and instead address the underlying political  problems destabilizing the region. We must stay united around these  goals and committed to the continuation of a strong peace process.\n\nMadam Speaker, in the meantime, we must all agree to the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697236/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…It is escalating. Public servants across this country  face rising threats simply for doing their jobs.\n\nSecond, these attacks are about more than individuals. They are  destabilizing our institutions. The only offense that these Minnesota  public officials and Leader Scalise were committing was serving their  communities. When acts of violence are aimed…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692857/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…without judicial process; dramatic cuts to the delivery of  Social Security benefits and veteran benefits; abandoning environmental  protections for clean air and clean water; destabilizing families,  hospitals, and nursing homes with pending Medicaid cuts; and siding  with a ruthless aggressor, Russia, rather than the victim, Ukraine.\n\nMr. Speaker, 100 days:…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690483/trumps-100-days"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…major military buildup. To what  end? The administration will not say. Against what enemy? They won't  specify. For how long? They refuse to answer.\n\nThese operations risk destabilizing the region and provoking direct  confrontation with Venezuela. We could be stumbling into another open- ended conflict without purpose or plan.\n\nIf the administration intends…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…Mr. Speaker, it is undeniable that the People's Republic of China is  the single gravest threat to our national security. It is undeniable  that China has increased its destabilizing military activities in the  Pacific. It is undeniable that China has its sights set on the full- scale invasion of Taiwan.\n\nThe United States must not waver in our deterrence…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690685/taiwan-assurance-implementation-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…ensure these assets remain  secure and trustworthy.\n\nCritically, this bill prohibits the issuance of algorithmic  stablecoins lacking sufficient collateral, guarding against  destabilizing risks that could ripple through the broader financial  system. Also reinforcing the primacy of the U.S. dollar, this bill  ensures that dollar-backed stablecoins are subject…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "James Risch", "party": "Republican", "sentence": "…decades and hostages are returning  home.\n\nIsrael is one of America's greatest allies, a bastion of freedom in  the Middle East, and our closest partner in countering Iran's  destabilizing efforts in the region.\n\nTo execute on President Trump's ironclad support of Israel, we  urgently need a qualified ambassador in the region. I have no doubt  Governor Huckabee…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689827/9999"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…conventional       weapons and ballistic missile development, and support for       terrorism, including Iran's Revolutionary Guards Corps.\n\n(2) The Government of Iran has acquired destabilizing       conventional weapons systems from the Russian Federation and       other malign actors, and is funneling weapons and financial       support to its terrorist proxies…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690688/solidify-iran-sanctions-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…lost family.\n\nWell, I am glad that he has since complied with the court ruling by  stepping down from his position as leader of the RS entity and walked  back some of his destabilizing actions. In return, the United States  has dropped sanctions against Mr. Dodik and his family.\n\nI am all for rewarding this good behavior, but there are very good  reasons…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696528/bosnia"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…are  just as guilty because they created that environment. They fomented the  radicalization and the creation of an environment where that occurred  knowingly, knowingly destabilizing our society in the process.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…multiple locations around the  world, we must remain vigilant about the ongoing threats posed by some  of our long-term adversaries.\n\nIran has a well-established record of destabilizing the Middle East  and threatening its neighbors.\n\nThe Government of Iran is manufacturing weapons, including drones,  acquiring conventional weapons through malign actors,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690689/solidify-iran-sanctions-act-of-2025"}]