[{"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…administration has carried out 25 known strikes, killing 95 people.  Among these was a so-called double-tap strike where U.S. Forces killed  two survivors clinging to the wreckage of a destroyed vessel in open  sea.\n\nThe administration now refuses to release the video of this strike,  denying the American people the ability to see for themselves what is  being done…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…these boats were being used for human trafficking  and that the victims of that offense were killed along with the  perpetrators, or, if not on one of the first four ships destroyed, then  perhaps on the next one.\n\nThe lack of detail concerning these strikes is telling. We have  learned of these strikes through social media posts from the President,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…middle school student; this is their one chance to be a high school  student. When they witness, even at a distance, even from another town  or another State, children being destroyed or wounded by something like  the Aurora movie theater shooting or like Columbine or like the  Evergreen shooting, the fear that enters their young lives is whether  they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695673/cloture-motion"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…market only to turn  around and see conditions improve a few hours later because of a tweet  from the President.\n\nHow is that strategic?\n\nTrump alienated our trade partners and destroyed our credibility as a  country that foreign governments can do business with. House  Republicans are acting as his rubberstamp by banning the House from  taking action to…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689863/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…trapped in the  middle of a bombing campaign. Children are forced to watch their  mothers die slowly of cancer, with no access to medicine. The hospitals  they need are being destroyed.\n\nAt the same time, the Netanyahu government has begun a new military  operation to take complete control of Gaza City. In Gaza City, hundreds  of civilians are living under…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…Republican Senators to join us to vote down the  President's abuse of emergency authorities.\n\nUnless we take action now, millions of people will lose their jobs,  families will be destroyed, and our economy will take years to recover.  But this time, it will be the President of the United States who  destroyed our economy, and it will be congressional Republicans…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690534/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…name-calling of the Canadians.\n\nIn northern New York, we have had a great border--a peaceful,  wonderful, prosperous border--between Canada and New York. Trump just  about destroyed it in a minute with some jerky comment that he always  typically makes.\n\nWell, Thomas's costs have gone up in his brewery, in addition to the  anger for the Canadians not…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698199/new-york"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…now, I wish it was a  little less than 6 years myself.\n\nBut the challenge we have is that that vision of a separation of  powers, of checks and balances, is being steadily destroyed by  President Trump.\n\nIn the book that I was using as kind of a framework for discussing  these issues, it says that most people even today think it is still  that republics…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…President, I rise today to pass into law a lifesaving  bipartisan legislation that will enable us to keep fighting the opioid  and fentanyl epidemic, an epidemic that has destroyed families and  devastated communities all across our country.\n\nOur country faces many challenges, and I am sure we will continue to  debate in the coming weeks how to address…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695792/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…first aid,'' to be able to respond appropriately to callers in mental  health distress. You see, after experiencing trauma--like witnessing a  shooting or seeing their home destroyed by a fire--people can suffer.  Exposure to trauma can harm the brain, changing the way people see and  interact with the world.\n\nWe know that young people who experience…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688330/recognizing-the-joliet-emsfire-department-program"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…outbreaks under the       waiver.\n\nWith very few exceptions, payments were halted for our       lifesaving work. USAID's efficient and reliable financial       system was destroyed, and replaced by a wasteful and       inaccurate patchwork that fails to provide needed funding to       implement our programs.--and--\n\nAnd--The Global Health workforce…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…be gone. That trusted  adult that had created that bond, that relationship that is helping  that child, that is keeping that school safe--that relationship, that  bond is destroyed because in cutting these grants off with no warning,  there is no way, in the middle of a school year, for a school mental  health clinic to find the money under the mattress.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…neighbors and their communities.\n\nThe 2020 Labor Day fires were the most destructive in our State's  history. Mr. Speaker, 1.4 million acres burned. More than 4,000 homes  were destroyed, and at least nine people died. Smoke filled the air for  days throughout the region.\n\nLast year, Oregon saw 1.9 million acres burn, setting a new record.\n\nMr. Speaker, I…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692450/wildfires-in-oregon"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…to       return to my home country of Haiti, a devastating earthquake       struck. The place where I lived collapsed, and the building       where I worked was completely destroyed. I could not return       home. When Temporary Protected Status (TPS) was designated       for Haiti, it brought me immense relief during an incredibly       painful and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…families, rural families, seniors and other  vulnerable Americans. But the president is not laser focused on the  cost of-living crisis.\n\nPresident Trump has attacked and destroyed programs created by  Congress and funded by the Appropriations Committee that protect our  national security and help increase domestic energy production. They  are substituting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694862/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…seen the quote and recommended       to Senator Tower for inclusion:       The civilized people of today look back with horror at their       medieval ancestors who wantonly destroyed great works of art,       or sat slothfully by while they were being destroyed. We have       passed that stage. We treasure pictures and sculptures. But       we are, as…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Desert Storm displaying outstanding tactical and  technical skills. His proficiency enabled the Scout Platoon to quickly  in advance friendly forces so the enemy could be destroyed while  displaying high morale and a cool demeanor. During his tenure, he  served with courage and distinction, embodying the highest standards of  military excellence. His…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696279/recognizing-delman-leon-orme-with-a-congressional-veteran-commendation"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…about the pay and treatment of Black soldiers and then to       discuss the President's desire to assist escaping slaves;\n\n[Whereas after Douglass' Rochester home was destroyed by       fire (which Douglass believed resulted from arson), he moved       his family to Anacostia in Washington, DC;\n\n[Whereas, in 1870, Douglass was asked to become editor…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…to do with national defense? Bluntly, the  process here in this Senate, the process with our President, and the  process of spending or not spending appropriated funds has destroyed a  lot of the trust that is essential for the Senate as a body to work,  for the Congress to legislate, and for our Federal Government to  reopen.\n\nIn the last Congress,…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696237/9999"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…by 21 percent.  That is 20,000 Americans who did not die because of a fentanyl  overdose. That is 20,000 national emergencies diverted. That is 20,000  families that aren't destroyed, and that is 20,000 futures that still  get to be in our country.\n\nWe should not be criticizing the President for what he has done,  because the last thing I will say is…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699967/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Continental Congress from  1776 to 1778, helping guide our young nation through the turbulent  revolutionary years.\n\nEstablished in 1752, the Midway Congregational Church was destroyed  during the Revolutionary War, highlighting the immense sacrifice made  by the citizens of Midway in advancing the cause of liberty.\n\nThe town is now home to Georgia's only…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694770/recognizing-the-city-of-midway-georgia-on-its-centennial-celebration"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…higher and higher for families across  this country. Whether you are in an employer-sponsored plan or an  individual  market, it doesn't matter. The entire thing has been destroyed by the  Democratic Party and their schemes.\n\nFor years, Washington has told the American people that if we just  spend more, if we just mandate more, if we just regulate…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…fascinating is the  Dyke Mountain Annex. It was built between 1906 and 1908 and originally  was part of the Dyke Mountain Hotel. While the rest of the resort would  later be destroyed by fire, the annex functioned as a summer hostel and  continues to be used as such by the present owners.\n\nAnother example of Sebago's small-town beauty is Fitch's General…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699146/town-of-sebago-200th-anniversary"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…taxes, raising their kids, and taking care of their neighbors whose  lives were impacted substantially by Hurricane Helene that hit last  year. It tore through our region. It destroyed roads. It destroyed  homes. It took lives. It changed so many things.\n\nI will say the good news is the resilience of North Carolinians, not  only in government, not only…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Operation Midnight Hammer; it was an incredible success.\n\nIf you look up ``obliterate'' in the dictionary, it means to destroy  utterly and wipe out. These three facilities were destroyed utterly,  and they were wiped out. They were obliterated.\n\nNow that doesn't mean that the threat from Iran is over. The desire  of the regime still exists, and we will have…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693122/motion-to-discharge-sj-res-59"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…western North Carolina home, it meant so much more.\n\nIn our mountain communities, waters crested above 30 feet; winds  peaked at over 100 miles an hour; and 1,500 landslides destroyed  hundreds of homes and many communities. Over 1,300 roads were blocked  by damage and debris. There were 1.2 million citizens left without  power. Mr. Speaker, 108 North…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695797/hurricane-helene"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…young girls associated with Camp Mystic.\n\nIt has been grueling. It was a rough week.\n\nThere has been a lot of destruction, and a lot of beautiful parts of  our State have been destroyed, but we will rebuild.\n\nHere is the thing that I want to say. When people talk about  destruction, what will not be destroyed is the spirit of the people of  Texas; the spirit…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693607/mourning-the-loss-of-life-in-the-state-of-texas"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…I represent in southeastern and  south central Missouri were struck by 19 deadly tornadoes and storms. I  had the chance to visit and talk with the people impacted. I saw  destroyed homes, tossed cars, and crop damage. I also saw how  neighbors, churches, and charities spring into action to provide a warm  meal, temporary shelter, and hope to the families…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689314/disaster-related-extension-of-deadlines-act"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…recruited Black  soldiers, met with President Lincoln to advocate for equal pay and  treatment, and worked to assist those escaping slavery.\n\nAfter his Rochester home was destroyed in a suspected arson attack,  he moved to Anacostia here in Washington, D.C., and became the editor,  and later owner, of the New National Era, which chronicled Black  progress…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692222/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…ideology.\n\nThis has nothing to do with political parties. This is not a  Democratic issue. This is not a Republican issue. This is a moral vote  against an ideology that has destroyed millions and millions of  families--many of those families I serve in District 27, the heart of  the city of Miami, the heart of the Cuban exile community and now the  Venezuelan…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697160/denouncing-the-horrors-of-socialism"}]