[{"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…to drive 3 hours, and then they would turn me away. The goal  was to meet with my constituents and their attorney and get a tour of  the facility.\n\nWhen I asked about the detainees not being able to access medication,  facility officials told me that detainees often lie about the lack of  access to medical care. They claimed anyone could get access…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697458/fighting-dhs-immigration-raids"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…President's specialty.\n\nDHS insists they target criminal immigrants, yet in Elgin, in the  dead of night, ICE staged a reckless raid with helicopters and armored  trucks parading detainees for cameras. Secretary Noem showed up for 5  seconds of fame and rushed to declare: Mission accomplished.\n\nThe reality is two U.S. citizens were detained. They were not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695742/ice-and-dhs-lost-credibility"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…different story.\n\nAccording to CBS, only 8 percent of those detained have been  convicted of violent crimes. The conservative Cato Institute found that  only 7 percent of detainees were violent criminals.\n\nIn fact, most detainees aren't even criminals at all. Of the people  in detention, about half of them have criminal records. That is 300,000  people…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693662/weaponization-of-ice"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…intensifying scrutiny of Federal tactics.\n\nLast year was the deadliest year in over 20 years, with over 56  people dying under ICE and CBP custody in detention centers. Reports of  detainees like Luis Beltran Yanez-Cruz, who died in a hospital in my  district after complaining for days of chest pain without receiving the  appropriate urgent care, are concerning…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699658/horrific-ice-abuses"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…is the reality for Palestinian children in the West  Bank.\n\nSecond, administrative detention, compounded by physical and  psychological abuse and humiliation of Palestinian detainees and the  lack of due process that is endemic in the military justice system,  have long-lasting impacts on a child. They have difficulty re-entering  and continuing school,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697313/palestine"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…It is a place where nearly 1,000 humans are being forced to live in a  tent city in the middle of the hot Florida summer, hot sun, where folks  are not getting enough food. Detainees are exposed to the heat, and  wildlife, and mosquitoes that can potentially carry disease. They are  being stripped of their civil rights, and as of this past Saturday,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693654/internment-camp-in-the-florida-everglades"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…occurred  without his family knowing.\n\nThis is why I introduced the INFORM Act. The INFORM Act brings  transparency to ICE's decisionmaking process and fights for the dignity  of detainees.\n\nWhen I visited the Adelanto Detention Facility to get answers into  ICE's decisionmaking process, ICE blocked me. I will keep fighting and  seeking justice for Benjamin,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694911/ice-is-out-of-control"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…meant  to serve.\n\nCongress must reject cruelty as a tool of policy and restore  humanity, transparency, and accountability.\n\nThat is why I introduced the Restoring Access to Detainees Act with  Senator Murphy. Every family should know where their loved one is being  held. Every detainee must have easy, free access to call legal counsel.\n\nI also authored…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697452/fighting-dhs-immigration-raids"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…necessary to target the ``worst of the worst.'' But the facts  tell a different story, one that I have laid out repeatedly on this  floor.\n\nIn one instance, on a list of 614 detainees submitted to a Federal  court, the administration identified criminal histories for just 16 of  the detainees. That shakes out to less than 3 percent of arrestees.\n\nAnd people…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698781/operation-midway-blitz"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…blame the White House for driving up the prices of  food and groceries.\n\nTrump said his mass deportation agenda would only target violent  criminals, but over 90 percent of detainees being held in New Jersey  have no criminal conviction.\n\nTrump said he would improve the Affordable Care Act, yet he just  signed a bill into law that cuts over $1 trillion…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694040/trump-administration-chaos"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Detention Center in Tacoma. The detainee population has  doubled in the last few months. The average time detained has extended.  Discretionary releases are now uncommon, even for detainees without  violent criminal records. Folks are being detained and disappeared for  nothing more than political speech.\n\nMr. Speaker, what this visit reaffirmed for me is that…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690510/trump-immigration-policies"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…are not using taxpayer dollars to keep  communities safe; they are using it as political theater. They dress up  in ICE jackets, parade through detention centers, and turn detainees  into props for their campaigns.\n\nThis isn't law enforcement. It is performance. It makes a mockery of  our justice system by prioritizing sensational videos over safety…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695521/visit-to-bluebonnet-detention-facility"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…of me.\n\nWhen we sat down with the U.S. Embassy, one thing was chillingly  clear: Donald Trump has done nothing, not one thing, to bring Kilmar  Abrego Garcia or any of the detainees home. Their families haven't  heard a word--no calls, no updates, and no proof of life, just silence.\n\nHere is what gives me hope: Yesterday, Mohsen Mahdawi, a detained…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690555/stand-for-justice-bring-detainees-home"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…the  previous year. Not surprisingly, the conditions are deplorable. There  was no preplanning of how to accommodate the people that the government  was taking into custody. Detainees are fed food laced with worms. These  are all documented facts. It is not a political argument. This is what  is happening. Many places have toilets that don't flush.\n\nIn…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700023/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…a decade found just one day in jail increases a  person's likelihood of being arrested in the future.\n\nBeyond the financial and familial losses suffered by       pretrial detainees, there is a very real threat to physical       well-being. Nationally, pretrial detention is the riskiest       phase for in-custody deaths, and DC Jail is already unsafe.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696958/opposition-letter-led-by-tzedek-dc-on-the-district-of-columbia-cash-bail-reform-act-of-2025-hr-november-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Review of the Evidence,''       published by Matthew Robertson, China Studies Research Fellow       with the Victims of Communism Memorial Foundation, former       Uyghur detainees ``now in exile have reported blood tests and       physical examinations consistent with those necessary to       establish organ health.'' The parallel between the forced…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…pervasive than previously  thought, with individuals relocated over 2,000 miles away from the  Uyghur region.\n\nMeanwhile, Uyghur human rights advocates and family members of  detainees are intimidated and harassed by the CCP's transnational  repression and espionage campaigns abroad. The fact that this happens  here on U.S. soil is unacceptable and threatens…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694801/uyghur-policy-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Uyghurs and members of other ethnic minority groups       have been imprisoned in extrajudicial ``political       reeducation'' centers.\n\n(14) Independent accounts from former detainees of       ``political reeducation'' centers describe inhumane       conditions and treatment including forced political       indoctrination, torture, beatings, rape, forced…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…their arrest or provided arrest  warrants.''\n\nAmong those most frequently reported as targets are Falun Gong  practitioners and Uyghur Muslims in the Xinjiang Province. These  detainees, often imprisoned for their beliefs, are subjected to medical  procedures that other prisoners are not: blood draws, organ  examinations, and ultrasound scans. These are…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…is expanding detention facilities,  because that is what the law requires if our borders are going to mean  anything.\n\nThe Democrats call these concentration camps, but the detainees are  free to leave for home anytime they choose. Indeed, that is the  purpose, to provide temporary shelter while transportation is being  arranged.\n\nDeportation is not a…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694126/sorry-not-sorry-for-immigration-enforcement"}]