[{"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…efforts to target  immigrants, the Constitution, and the law be damned.\n\nNow, in addition to being unconstitutional, this wastes a great deal  of tax dollars because they are detaining masses of people in these  large sweeps, only to have to release them when proof of their legal  status is shown. It also horrifies the citizens who have to go through  this…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693662/weaponization-of-ice"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…assaulting, and murdering people.\n\nLast month it was Renee Nicole Good and Alex Pretti.\n\nNext month? It could be another beloved, hard-working member of your  community.\n\nAgents are detaining sick children.\n\nLast month it was Diana Crespo, a seven-year-old from my district and  her parents who were detained on the way to urgent care.\n\nNext month? It could be another…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699670/horrific-ice-abuses"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…and fathers from their vehicles in front  of their kids--in front of their kids--often taking those kids and  separating them from their parents, breaking down doors, and detaining  citizens and noncitizens alike.\n\nAs for warrants? No. Apparently, DHS lawyers now claim you don't need  a judicial warrant to break through the door of a U.S. citizen and…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699422/9999"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…believe, ICE is  creating significant levels of fear, including around schools.\n\nMr. Speaker, this is not about targeting criminals. It is about  targeting, arresting, and detaining people because of their national  origin or the color of their skin. This ought to send chills down the  spines of everyone in this body and this country.\n\nAs someone who…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698641/immigration-enforcement-and-schools"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…community  shaken but not defeated.\n\nThe President manufactured a crisis in Los Angeles and then blamed  our constituents for it. He induced ICE to terrorize our community,  detaining hundreds of hardworking residents at places like Home Depot  and car washes, including U.S. citizens like Job Garcia, a doctoral  student in my district at Claremont Graduate…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693142/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…She was 9 months pregnant. Apparently the  CBP officers responded: ``Okay. Your  baby is going to be born here, but you're from Mexico, right?'' They  were wrong. They were detaining an American citizen. This is what has  been unleashed on the American people.\n\nOne last story that I feel compelled to share on this issue, Mr.  Speaker. I have still got…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…has manufactured a crisis that harms our most  vulnerable, including students starting a new school year, senior  citizens, young children, and disabled individuals. He is detaining  hardworking individuals who are in this country legally and providing  for their families so they, too, can have a chance at their American  Dream.\n\nI know California, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695175/happy-birthday-to-california"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…agents are violating people's civil rights,  glorified bullies masquerading as public servants. They terrorize our  communities in the name of so-called law and order, while detaining and  deporting our neighbors without due process.\n\nThat hypocrisy is not a coincidence. It is a deliberate, resounding  message from an administration that believes that…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697461/fighting-dhs-immigration-raids"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…students across the country are  terrified to go to school because ICE is in their community. In Oregon,  ICE agents are stalking school parking lots and school routes and  detaining parents in front of their children. In one instance, ICE  agents surrounded two high school students at a coffee shop and pointed  rifles at them. This is beyond unacceptable.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697292/trump-administration-dismantling-department-of-education"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…today is happening every day all across this  country. Every day, DHS agents are throwing people to the ground and  violently handcuffing them while they are not resisting, detaining them  for exercising their First Amendment rights of free speech. Every day,  Donald Trump is making this Nation look more and more like a fascist  state.\n\nIf this is how…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692473/alex-padilla"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…wrongfully arrested him. Where did they find him? On the streets  of the suburbs of Chicago. Family members believed Federal agents just  dropped him off, possibly a day after detaining him. But no one  contacted the family, and they didn't know where he slept during this  time away from home.\n\nUnfortunately, Mr. Huerta Cisneros' case is not isolated. Donald…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…teenager.  Bun has since served his time, and once granted parole, he has become a  leader in his community.\n\nIn Trump's eyes, Bun's rehabilitation doesn't matter. Trump is now  detaining and deporting Southeast Asian refugees who have had pauses on  their deportation orders for decades and are deeply tied to their  communities. Mr. Speaker, 15,000 of these…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690502/trump-immigration-policies"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…Security. All over America, masked ICE agents,  often in unmarked cars, are taking parents from their children,  arresting the elderly, arresting law-abiding immigrants, and even  detaining citizens.\n\nTrump says he is going after the worst of the worst, but over 70  percent of the immigrants his government has rounded up have no  criminal record. In fact, the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…U.S. Supreme Court       made this clear in United States v. Salerno, holding that       pretrial detention must be a ``carefully limited exception,''       not the rule. Detaining someone without an individualized       hearing strips them of due process and violates one of our       most fundamental constitutional rights: the presumption of…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…information, masks,  breaking your car window when your 2-year-old is in the backseat.  Imagine peacefully protesting and having rubber bullets shot at you.\n\nImagine masked men detaining a 5-year-old who is coming home from  preschool. Imagine being pepper-sprayed as clergy while you are praying  out loud. Imagine tear gas filling your car on your way home…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…is stating the facts of how awful and terrible  what it is that we have been doing in this country by allowing known  murderers to exist and to stay in the country and not detaining them,  giving them due process, and then, at the very least, deporting them.\n\nThat is Mr. Evans' point here. That is what he is trying to say. That  is what he is trying…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Operation  Absolute Resolve. This past weekend, in the middle of the night, in  Caracas, Venezuela, our brave servicemembers successfully accompanied  law enforcement personnel in detaining the illegitimate President of  Venezuela, someone who had become the head of a drug cartel and who was  working with our most concerning adversaries all around the world,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…horrifying reality: mass detention, forced labor, and  brutal oppression of the people who live there.\n\nThe CCP is oppressing the Uyghur people and other ethnic minorities  by detaining them in what they call reeducation centers for forced  labor in the Xinjiang Autonomous Region of China.\n\nSlavery in any form is morally repugnant. America, known on the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690655/no-dollars-to-uyghur-forced-labor-act"}]