[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…sentry  dog handler around the globe. He later dedicated over four decades to  the Toledo Police Department.\n\nHis instincts, integrity, and fearless commitment to justice as a  detective made our community safer and stronger. His work earned him  countless honors including induction into the Birmingham Hall of Fame  and the National Law Enforcement Officer…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…Officer Jonathan Diller who  proudly served with the NYPD. Tragically, he was killed last year while  conducting a routine traffic stop in Queens.\n\nIn just 3 years on the force, Detective Diller made over 70 arrests  and was honored with three Excellent Police Duty medals. His colleagues  remember him as a bright, positive presence, always eager to learn,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691183/national-police-week"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…Department as a Community  Service Officer in 1994. Over the next two decades, he took on several  roles with the department including as a DARE officer, School Resource  Officer, detective, sergeant and lieutenant. New also earned a master's  degree in public administration from Metro State University and  graduated from the FBI National Academy.\n\nIn 2016,…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696271/congratulating-chief-roger-new-on-his-retirement"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…years of service to the Cranford Police Department and  wish Lieutenant Swandrak the best on his retirement.\n\nHis decades of service in patrol, community policing, and the  detective bureau allowed him to build invaluable relationships and  strengthen the bond between the police department and the Cranford  community.\n\nThat was demonstrated in profound…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699515/congratulating-lieutenant-john-swandrak"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…attendance.\n\nAmong those honored and remembered will be Officer Adam R. Buckner of  the Tucson Police Department, Officer Joshua Briese of the Gila River  Police Department, Detective Ryan So of the Scottsdale Police  Department, and Officer Zane Tristan Coolidge of the Phoenix Police  Department.\n\nPolice Officer Zane Coolidge was shot in the line of duty…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689660/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…place, but  three blocks  from my home is this place called McDonald's.\n\nNow, I have a guy who has driven me since I was a mayor. He was on my  protective detail. He was a detective in the Newark Police Department.  His name is Kevin Batts. From 2006 until now, he has been driving me  around. And we have such a great friendship. We know each other so…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…Chief Steven  Colucci, who retired after 29 years on the force this summer.\n\nChief Colucci first put on a badge in 1996 as a part-time patrolman.  He rose through the ranks of detective, sergeant, lieutenant, and  eventually earned the top job as chief, where he served for over 3  years.\n\nChief Colucci was a mentor to many. His legacy includes training a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695739/recognizing-steven-colucci"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…year's Lifetime Achievement Awards was Warrenton Police  Chief Tim Carter. A native of Fauquier County, Chief Carter has served  his hometown as a police officer, corporal, detective sergeant,  lieutenant, and deputy chief before becoming police chief in 2023.\n\nAlso recognized with a Lifetime Achievement Award was retired fire  chief Dale Koglin. Chief…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690556/recognizing-valor-award-winners-and-honorees-from-fauquier-county"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, I rise today to honor the career of a  dedicated and true public servant, Detective Jerry Gachett, who is  retiring from the Akron Police Department.\n\nI am honored to be standing here today talking about a man who has  served the Akron community so humbly…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687992/congratulating-jerry-gachett-on-his-retirement"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…and that Denise and Aaron had the backing of law  enforcement, despite how they were treated.\n\nChief Borges then decided to meet with the couple, along with Alameda  County Detective Misty Carausu and El Dorado County DA Vern Pierson,  all of whom felt that the investigation was mishandled. The group then  started their own investigation and quickly found…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689139/recognizing-seaside-police-department-chief-nick-borges"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…serving and  protecting the people of Summit County in a wide range of roles. Her  work has spanned the corrections division, the patrol division and  special operations, the detective bureau, and more.\n\nIn 2021, Captain Wiltrout earned the Taskforce Director position for  a State of Ohio Narcotics Taskforce, making her the first woman to run  a Narcotics…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691913/captain-michelle-wiltrout-named-ohios-13th-district-champion-of-the-week"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…One such recipient of this grant from the Rural Violent Crime  Reduction Initiative was the Shawano, Wisconsin Police Department,  which was using the funding to pay for a detective dedicated to  investigating and solving unsolved violent crimes and to stop  narcotics trafficking in their community.\n\nThe police department said that the additional detective…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "Mr. GARBARINO. Mr. Speaker, I rise today to honor my constituent,  NYPD Detective Fabio L. Gonzalez of Babylon, New York on the occasion  of his recognition with an Honorable Mention in the 2025 TOP COPS  Awards from the National Association of Police…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691108/recognizing-nypd-detective-fabio-l-gonzalez"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…own agency and began teaching and facilitating classes in private  investigation and executive protection. For a time, he served as a  member of the Georgia Board of Private Detective and Security Agencies.\n\nDue to Bart's vast experience and reputation, he became part of my  staff when I entered Congress. He was our veteran engagement liaison  and the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698432/republicans-have-delivered-in-2025"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…approach  to community safety and to fostering collaboration among Federal,  State, and local agencies.\n\nCurrently, as the commanding officer of the New York Police  Department's Detective Bureau Tactical Training Unit, Mr. Camhi plays a  vital role in preparing law enforcement officers for the challenges  they face. Under his leadership, the unit provides…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689427/recognizing-david-camhi"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…red line  that holds society together. They serve not for accolades but out of  duty and honor.\n\nMr. Speaker, I know this personally. My father was a police officer  and a detective, while my grandfather also was a firefighter. He was  the captain of his house.\n\nI remember clearly the risks that my father took every day he walked  out the door. I remember…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691021/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…enforcement career began in 1970, when he was  appointed a deputy sheriff in the Dutchess County Sheriff's Office. He  served in the uniform patrol division and was promoted to detective in  1974.\n\nIn 1983, he was elected mayor of the village of Pawling and served  for 8 years.\n\nSheriff Anderson was elected Dutchess County Sheriff in 1999 and  served with…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697693/sheriff-adrian-butch-anderson-post-office-building"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…team, which is the equivalent of a SWAT team, and was  selected as the element leader for the chemical agents unit.\n\nThat year, Lieutenant Doolittle was also assigned as a detective to  the investigations unit. He handled cases involving burglary, theft,  fraud, stalking, homicides, sexual assaults, and assaults with deadly  weapons. Lieutenant Doolittle…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}]