[{"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "Durbin also announced that he will be introducing legislation, joined by Senators Amy Klobuchar (D-MN) and Kamala Harris (D-CA), to establish an independent ombudsman to oversee federal detention facilities."}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "This would undoubtedly be good for the owners of all the private  detention facilities and prisons who are getting rich off of laws like  this, but it would fail the rest of us."}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "In December 2018, Merkley led a congressional delegation to investigate the conditions at Dilley and two other detention facilities in Texas."}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "Last week, I led a bicameral codel to two ICE detention facilities in  Louisiana where Mahmoud Khalil, Rumeysa Ozturk, and Wendy Brito are  being held."}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "Immigration and Customs Enforcement (ICE) detention facilities in New Mexico are unprepared to manage the novel coronavirus 2019 (COVID-19) pandemic."}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "Secretary Noem has denied me and  other Members of Congress oversight of ICE detention facilities."}, {"senator": "Cory A. Booker", "party": "Democrat", "sentence": "\"As we mobilize nationally to preserve life during this global pandemic, abandoning those in detention facilities is not only immoral, but also a threat to our collective health."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "These individuals housed in jails, prisons and other detention facilities are particularly vulnerable to the spread of COVID-19."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Since March 18, 2020, ICE has confirmed that at least four detained persons and five ICE employees and personnel staffing detention facilities have tested positive for COVID-19."}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "I recently returned from rural Louisiana where my colleagues and I  went behind the wall at two remote detention facilities."}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "This development comes following a request from Senators Rosen, Cortez Masto, and Senate colleagues that the DHS IG conduct a full assessment of ICE detention facilities nationwide to evaluate whether their facilities' operations, management, standards, and conditions are properly addressing the threat of COVID-19."}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "Further, 869 detainees, 42 ICE employees at detention facilities, and 102 ICE employees not assigned to detention facilities have tested positive for COVID-19."}, {"senator": "Dianne Feinstein", "party": "Democrat", "sentence": "On December 11, 2017, your office published a report concluding that certain detention facilities \"undermine(d) the protection of detainees' rights, their humane treatment, and the provision of a safe and healthy environment.\" On September 27, 2018, your office found severe health and safety violations that \"pose(d) significant health and safety risks\" to individuals detained at a privately-run detention facility."}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "That is why the administration is expanding detention facilities,  because that is what the law requires if our borders are going to mean  anything."}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "ACCESS TO DETENTION FACILITIES AND PRISONS AND THE                     RELEASE OF PRISONERS."}]