[{"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…and check-ins as setups and  defying court orders, and then our neighbors are being shipped off to  countries where they have never even been. They are being held in  detention centers with unspeakable, inhumane conditions with no due  process, no access to attorneys, and no path forward.\n\nThis is not immigration policy. This is cruelty for the sake…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697454/fighting-dhs-immigration-raids"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…Trump and Secretary Noem are not using taxpayer dollars to keep  communities safe; they are using it as political theater. They dress up  in ICE jackets, parade through detention centers, and turn detainees  into props for their campaigns.\n\nThis isn't law enforcement. It is performance. It makes a mockery of  our justice system by prioritizing sensational…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695521/visit-to-bluebonnet-detention-facility"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…efforts,  taking that money away from your healthcare and taking that money away  from food for hungry families to spend on weapons for enforcement  agents and billions on detention centers to imprison people who are  undocumented but who have committed no crimes and have no criminal  records at all.\n\nThis is the America that Donald Trump has created, but…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699422/9999"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…in  the greatest numbers, who pose minimal pushback, with the real mission  to scare all immigrants, legal or otherwise.\n\nAmerica has existed for 250 years without mass detention centers, but  apparently, Noem and her cohorts plan for a different America to start  the next 250 years, one where masked, unmarked agents seize people  without judicial warrant,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699213/in-opposition-to-ice-facility-in-hudson-valley"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…widespread  protests and intensifying scrutiny of Federal tactics.\n\nLast year was the deadliest year in over 20 years, with over 56  people dying under ICE and CBP custody in detention centers. Reports of  detainees like Luis Beltran Yanez-Cruz, who died in a hospital in my  district after complaining for days of chest pain without receiving the  appropriate…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699658/horrific-ice-abuses"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…executive  orders, many of which courts have deemed illegal or unconstitutional.  Every day this administration is disappearing hundreds of people,  sending them to faraway detention centers without any due process, due  process that would expose mistakes and lies about some people who are  not criminals and, in some cases, are even citizens and, therefore,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…are out every day  kidnapping, trafficking, torturing, and, indeed, even murdering  immigrant Americans and American citizens in the cold and hidden  recesses of their detention centers, where atrocities beyond our  wildest nightmares are occurring without cessation.\n\nI am speaking of atrocities like the death of Jean Wilson Brutus at  the Delaney Hall…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699655/horrific-ice-abuses"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…immigration enforcement. It is disgusting. It is un- American. It demands oversight.\n\nMembers of Congress have a legally protected right to conduct  oversight of immigrant detention centers. That means that we have the  power to show up unannounced, as I have on other occasions, and see  what is going on with our own eyes.\n\nThat was my plan and the plan…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693654/internment-camp-in-the-florida-everglades"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…all about transparency, why is it  that Members of Congress can't show up to a detention center and do  their congressional oversight and see what is going on in those  detention centers?\n\nIt seems like Republicans are okay with transparency when it is  convenient to them, but when it is about Members of Congress,  regardless of their party that they…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693072/special-interest-alien-reporting-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…United States Government violates the  rights and due process of our neighbors. Families are frantically  trying to locate their loved ones who have been hauled away to  detention centers, for-profit makeshift prisons, prisons where meals  are inedible and medical care is denied, prisons where women are denied  cancer treatment and endure miscarriages…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697132/immigrant-neighbors"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…a constituent of mine who is a senior in high  school. He was detained by ICE in August while walking his dog.\n\nIn the span of 24 hours, ICE shuffled Benjamin between detention  centers and across State lines without his family knowing. I visited  Benjamin at the Adelanto Detention Center and observed a recent court  hearing of his, and my team has been…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697953/benjamin-guerrero-cruz-is-home"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…detention  facilities in rural communities like Newport, Oregon, that I represent.  We will not normalize cruelty as public policy.\n\nWhile innocent people continue to die in detention centers and on our  streets, we must continue to speak up and fight for real change.\n\nThe Constitution is clear. It guarantees due process. It guarantees  the right to assembly.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699660/horrific-ice-abuses"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…many of these people we are finding had no record and  were here legally.\n\nAmerican citizens and permanent residents are snatched from their  cars, and they are taken to detention centers. I worked on one case  this past weekend. It was cold, and a woman was warming up her car. She  was taken out of her car. She was taken to Whipple. Then she was taken…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699348/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…It  engages in obscene racial profiling and discrimination that communities  see clearly, even when Washington looks away. It stops Members of  Congress from inspecting detention centers, which is their duty as a  coequal branch of government.\n\nThese facts should outrage every Member of this House. If you believe  in the rule of law, you should be furious.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699041/authority-without-accountability"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…took office, at least six people have died during  enforcement activities by Federal agents. People are not just dying in  our streets. They are also dying in immigration detention centers run  by ICE and private companies that have been empowered to profit off of  detaining mothers, fathers, and children who pose no threat to our  communities.\n\nJust last…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699662/horrific-ice-abuses"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…change that  agenda. It is happening whether you like it or not.\n\nThank God we front-loaded in the Working Families Tax Cut money for  deportations and tens of billions for detention centers. Two hundred  thousand Americans have applied to be ICE agents because they love this  great country, and they don't want it destroyed.\n\nThis is another hissy fit along…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…detainers. The Colorado legislature  restricted data sharing with Federal immigration agencies. The  legislature also passed a law that banned contracts for immigration  detention centers.\n\nThis is lawlessness, and this body should recognize it as such.\n\nIn 2024, my good friend, Sheriff Joe Roybal of El Paso County, and  other county leaders filed a lawsuit…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692103/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…reconsider the budget, they are  going to spend $45 billion for basically jails for illegal immigrants  who come across, because if we don't have that jail space or the  detention centers as they are looking at asylum, then they go into the  country. That means they might not have a court case for a few years.\n\nLet's just think logically here, Mr. Speaker,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}]