[{"senator": "Judy Chu", "party": "Democrat", "sentence": "Ms. CHU. Mr. Chairman, as chair emerita of the Congressional Asian  Pacific American Caucus, I rise in strong opposition to the DETERRENT  Act.\n\nFor now, the American university research system is the envy of the  world, but the DETERRENT Act would burden our higher education  institutions and Federal agencies…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689033/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…their  immediate family members.\n\nThe bill would also restrict U.S.-based financial services, intending  to limit the financial options for these officials and to extend the  deterrent or punitive impacts to their families.\n\nBoth actions would only occur under the bill if the President uses a  never-applied--and hopefully unnecessary--clause in the Taiwan…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693875/taiwan-conflict-deterrence-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…American democracy into authoritarianism  with himself as the authoritarian. Authoritarian President Donald John  Trump is the problem. The threat of impeachment can act as a deterrent.  Should that fail, actual impeachment becomes the solution.\n\nHaving presented Articles of Impeachment that laid the foundation for  President Trump's prior impeachments,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…States, Russia, and China to stop building more nuclear weapons. Yet  while his National Security Strategy calls for ``the world's most  robust, credible, and modern nuclear deterrent,'' it says nothing about  preventing another nuclear arms race. With respect to New START, he  reportedly said, ``If it expires, it expires.''\n\nAs the New START Treaty fades…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699676/the-new-start-treaty"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…read the speech, I said out loud to people around me: It sounds  like he is planning to separate children deliberately from their  parents in order to have that trauma be a deterrent for people coming.\n\nI said: There is no way any American administration--not blue, not  red--would ever deliberately harm children as a political policy  strategy.\n\nA member…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…to the adult system increases violence rather  than reducing it. Youth charged as adults are more likely to reoffend  than those processed in juvenile courts. This is not a deterrent; it is  a recipe for a cycle of violence and incarceration.\n\nThis bill would make Washington, D.C., an outlier in its approach to  juvenile justice. While the current law…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695783/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…and national  security because arms control is national security. It remains one of  the most effective tools we have to reduce nuclear risk while  maintaining a credible deterrent.\n\nThe expiration of New START without a successor would mark a  dangerous turning point, signaling that restraint and verification no  longer matter.\n\nThis Special Order…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…impeachment of the President, and he lost an election as  a result of that, I believe. I plan to bring these Articles of  Impeachment. Removal is a possibility.\n\nThere is always a deterrent effect of Articles of Impeachment. They  can be used to say to a President: If you don't behave, if you don't  cease and desist with what you are doing, then you can be removed…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690862/and-still-i-rise-impeaching-president-trump"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…law enforcement, but ``agents of  the United States''--``United States''--those four words will change  the nature of DHS and its practices and tactics. It will serve as a  deterrent. It will force compliance with basic standards of decency and  use-of-force protocols and regulation. And it will raise the standards  that we expect of our Federal enforcers.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…of the  Department of Education would mean to local communities.\n\nThe Department of Education is responsible for protecting the civil  rights of students, exactly what this DETERRENT Act would do. The  Department of Education would handle the enforcement. The Department of  Education supports students from low-income backgrounds. They develop  and prepare…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689051/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Speaker, I thank the gentleman from  Colorado (Mr. Neguse) for yielding me time.\n\nMr. Speaker, I rise today to express my disappointment that my  commonsense amendment to the DETERRENT Act was rejected yesterday in  the Rules Committee by my colleagues on the other side of the aisle.\n\nMy amendment would have distinguished between benign donations from…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Mr. Lomell  continued onward and successfully scaled the wall.\n\nHowever, upon reaching the top, he and his fellow Rangers realized  the weapons were decoys designed to be a deterrent to the troops below.  Even this was not reason enough for Mr. Lomell to give up. He and his  team quickly found the real weapons unguarded nearby and destroyed  them.\n\nFor…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693924/leonard-g-bud-lomell-va-clinic"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "Ms. BARRAGAN. Mr. Chair, I oppose H.R. 1048, the DETERRENT Act,  because it imposes unnecessary, overly broad reporting mandates on  universities under the pretense of national security. While protecting  research from foreign influence…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689203/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…state that only U.S. citizens are  allowed to vote. Under Federal law, it is a felony for non-U.S.  citizens to vote. These laws are enforced, and they are a significant  deterrent.\n\nAn exhaustive study by the Brennan Center found that at least 30  cases of noncitizen voting were referred for investigation or  prosecution during the 2016 election. Trump's…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…majority ignored the paygo rule.\n\nWhat CBO told us on August 15 is that will trigger automatic cuts to  other programs. That is the way the paygo law was designed to create  some deterrent on Congress from excessive deficit spending.\n\nMadam Speaker, the Medicare program, the program that helps people  over the age of 65, will take the hit of 4 percent across…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…increase of $1.3 billion. These funds ensure we can  maintain today's nuclear stockpile, prepare for future needs, and  modernize aging infrastructure that underpins our nuclear deterrent.\n\nOur bill also delivers a nearly 10 percent increase for naval  reactors, advancing Columbia-class submarine reactor development, and  supporting the safe handling of naval…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698749/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jim Justice, Jr.", "party": "Republican", "sentence": "…demonstrated effective interdiction technology and practices       aimed at eliminating dangerous contraband arriving through       the mail and served as an effective deterrent to smuggling       attempts.\n\n(9) Apart from digital mail scanning, there is no widely       deployed interdiction technology that has demonstrated a 100       percent efficacy…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689519/9999"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…weapon. At this time, it is unknown.\n\nThe lesson Tehran and other unsavory regimes around the world may  learn is that the only way to deter a strike is to maintain a nuclear  deterrent. Pandora's box has been opened, and the consequences remain  to be seen.\n\nCongress must now focus its efforts on deescalation and preventing  the call for regime change,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…that our universities and institutions are receiving gifts or entering  into contracts with foreign countries that seek to destroy or harm the  United States.\n\nH.R. 1048, the DETERRENT Act, would strengthen disclosure  requirements by reducing the threshold from $250,000 to $50,000, but  those provisions are not strong enough. The American people deserve…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689034/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…Services Committee, I am proud to  report that this year's National Defense  Authorization Act meets this moment. It includes key provisions I  secured to modernize our nuclear deterrent and strengthen our national  defense.\n\nAs chair of the Strategic Forces Subcommittee, I fought to upgrade  the National Nuclear Security Administration's infrastructure.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695027/9999"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…and  Interior and Environment Appropriations Act of 2026, these bills make  targeted, disciplined investments to strengthen American energy  dominance, reinforce our nuclear deterrent capabilities, support law  enforcement, and expand access to critical minerals. These policy  priorities are shared by President Trump, congressional Republicans,  and millions…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…DHS, will resume construction  of President Trump's border wall. Border Patrol agents have told us  again and again that a physical barrier on our southern border is a key  deterrent to the trafficking of humans and illicit drugs by the Mexican  cartels across our southern border. Yet, on day one of his Presidency,  President Biden stopped construction…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689178/border-common-sense"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…produce.  This bill will apply innovative and rapid acquisition approaches to  keep pace with the dynamic threat environment and ensure our Nation  continues to field a nuclear deterrent that is second to none.\n\nFor the defense of this homeland, the bill supports development of  the Golden Dome system to achieve President Trump's bold vision. It  also includes…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697798/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "James Risch", "party": "Republican", "sentence": "…notification. The proposed sale will improve NATO's       capability to meet current and future ground threats with       precision. NATO will use the enhanced capability as a       deterrent to regional threats, and to increase       interoperability within contingency operations.\n\n(v) Justification: This proposed sale will support the       foreign policy goals…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693742/arms-sales-notification"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…and now-Vice Chair for  Supervision Michelle Bowman, who talked about the procompetition  benefits of healthy mergers, said: ``Reducing the efficiency of bank  M&A can be a deterrent to healthy bank transactions. It can reduce the  effectiveness of M&A activity that preserves the presence of community  banks in underserved areas, prevent institutions…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…tools in this bill, investigators and prosecutors will be  better able to dismantle organized crime rings across America. Most  importantly, they will employ an efficient deterrent to anybody who  seeks to enter or reenter this country illegally.\n\nIt is time for the illegal immigrant criminals to know that we are  finished tolerating their presence…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…defense  system, our answer to hypersonic and NextGen threats from adversaries  like China and Iran.\n\nIt expands our naval fleet, restocks our munitions, modernizes our  nuclear deterrent, and accelerates the delivery of Next Generation  aircraft and autonomous systems.\n\nJust as important, it puts our troops first, with $8.5 billion to  improve barracks, housing,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692966/peace-through-strength"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…to succeed in every  domain, including land, air, sea, space, and cyberspace. It provides  for next-generation systems and emerging technologies, strengthens our  nuclear deterrent, and supports investments in cyber capabilities to  defend against 21st century threats.\n\nImportantly, this legislation continues bipartisan efforts to improve  military…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "James Risch", "party": "Republican", "sentence": "…with those       objectives.\n\nThe proposed sale improves Israel's capability to meet       current and future threats, strengthen its homeland defense,       and serves as a deterrent to regional threats. Israel already       has these weapons in its inventory and will have no       difficulty absorbing this equipment into its Armed Forces.\n\nThe proposed…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…and the  enforcement going significantly up. That gap in the fence will be  closed in the days ahead. And as one of many requests the Border Patrol  has: just help us have a deterrent in this area so that we can better  patrol and be able to chase folks down that are violating American law.\n\nThey need additional personnel as well. I will talk a little…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}]