[{"senator": "Glenn Ivey", "party": "Democrat", "sentence": "Of the people  in detention, about half of them have criminal records."}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "For over two decades, Falun Gong practitioners have suffered from  detention, torture and organ harvesting at the hands of the Chinese  government."}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "I  saw it just last week in a detention center in Dilley."}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "Not only am I going to vote ``no'' on any funding bills that gives  this agency more resources to do this type of thing and terrorize our  communities from the State of Florida to across this entire Nation, but  I am going to continue to show up physically at bases of operation,  field offices, detention centers, and the so-called Alligator Alcatraz  to conduct oversight and work with our communities to keep our people  safe."}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "The Trump administration demanded that Republicans deliver a $170  billion taxpayer-funded slush fund for these misbegotten efforts,  taking that money away from your healthcare and taking that money away  from food for hungry families to spend on weapons for enforcement  agents and billions on detention centers to imprison people who are  undocumented but who have committed no crimes and have no criminal  records at all."}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "5214, the DC Cash Bail Reform Act, requires mandatory       detention on a wide range of cases and is almost certainly       unconstitutional under the requirements set out by the       Supreme Court in United States v."}, {"senator": "George Latimer", "party": "Democrat", "sentence": "America has existed for 250 years without mass detention centers, but  apparently, Noem and her cohorts plan for a different America to start  the next 250 years, one where masked, unmarked agents seize people  without judicial warrant, whisk them away to remote detention centers  en route to uncertain final destinations."}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "Masked agents are roaming our streets, and reports of human  rights abuses at ICE detention facilities are growing."}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "She lost consciousness  in detention."}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "As plans to house undocumented immigrants on military bases continue,  base leadership must be informed about everyone that is coming onto the  base and if their treatment and detention meets well-established  Federal standards."}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "They are also dying in immigration detention centers run  by ICE and private companies that have been empowered to profit off of  detaining mothers, fathers, and children who pose no threat to our  communities."}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "And then imagine being grabbed off the street and taken to a  detention facility without your family or a lawyer knowing where you  are."}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "The Community First Pretrial Reform and Jail Decarceration Act  helps local jurisdictions cut unnecessary pretrial detention and expand  proven alternatives."}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "In the span of 24 hours, ICE shuffled Benjamin between detention  centers and across State lines without his family knowing."}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "They are clearly using racial profiling to meet the  arbitrary detention quotas they have been given."}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "This resolution will bring transparency into all the documents and  records related to Jeffrey Epstein, Ghislaine Maxwell, flight logs, any  individuals referenced in connection to Epstein, any entities with ties  to Epstein, any agency internal documents, documents related to  Epstein's detention and death, and other areas."}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "It takes detention beds."}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "Since the 2021 coup, nearly 3  million Burmese have been driven from their homes; more than 75,000  people have been killed; and the military has swept up more than 30,000  political prisoners into detention, silencing those who oppose them."}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "(8) All communications, memoranda, directives, logs, or       metadata concerning the destruction, deletion, alteration,       misplacement, or concealment of documents, recordings, or       electronic data related to Epstein, his associates, his       detention and death, or any investigative files."}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "They were  sentenced to only 3 years of secure detention."}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "(9) PRC authorities have made use of the legal system as a       tool of repression, including for the imposition of arbitrary       detentions and for torture against members of the Uyghur       community and other minority populations."}, {"senator": "Brian Mast", "party": "Republican", "sentence": "As United Nations human rights experts stated in 2021: ``Forced organ  harvesting in China appears to be targeting specific ethnic,  linguistic, or religious minorities held in detention, often without  being [informed of] the reasons for their arrest or provided arrest  warrants.''\n\nAmong those most frequently reported as targets are Falun Gong  practitioners and Uyghur Muslims in the Xinjiang Province."}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Speaker, in the policy that we are looking at  today where we are going to let's say reconsider the budget, they are  going to spend $45 billion for basically jails for illegal immigrants  who come across, because if we don't have that jail space or the  detention centers as they are looking at asylum, then they go into the  country."}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "Thank God we front-loaded in the Working Families Tax Cut money for  deportations and tens of billions for detention centers."}, {"senator": "John Cornyn", "party": "Republican", "sentence": "Aggravated felons are subject to mandatory detention."}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "They have a right to challenge their detention through a writ of  habeas corpus."}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "Third, it turns illegal entry into a felony with mandatory  detention--no more catch-and-release--and it establishes a 10-year  mandatory minimum prison sentence for those who try to illegally  reenter this country after they have been deported."}]