[{"senator": "Robert Garcia", "party": "Democrat", "sentence": "These waivers are rarely granted and  only when a judge determines it is appropriate."}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "Policy determines who lives."}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "To ensure that the cost-match requirement is not a barrier to entry,  the Secretary of Energy has the discretion to reduce or eliminate this  cost-share requirement if the Secretary determines that it is necessary  or appropriate to do so."}, {"senator": "Al Green", "party": "Democrat", "sentence": "How you use power determines whether you are a person who should  possess power, whether you are the person that should be armed with  lethality such that you can change a person's family's history and  remove a person from existence."}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Article I, Section 9, Clause 7 proclaims that  Congress, not the President, determines how the taxpayers' dollars are  spent."}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "The Secretary shall evaluate expunged       convictions on a case-by-case basis according to the nature       and severity of the offense to determine whether, under the       particular circumstances, the Secretary determines that the       alien should be eligible for cancellation of removal,       adjustment to permanent resident status on a conditional       basis, or other adjustment of status."}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "determines that special  conditions of an emergency nature exist which require the use of the  MPD for Federal purposes, he may direct the Mayor to provide him, and  the Mayor shall provide, such services of the MPD as the President may  deem necessary and appropriate'' for 30 days, unless Congress  terminates or extends the emergency declaration."}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "The result is a system where wealth, not justice,       determines who waits for trial at home and who waits behind       bars."}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "Republicans want to ensure that even if the VA determines that a  veteran has a mental health condition to the point where they can't  cash their own check, the check has to be given to a family member  because they are going through a crisis, congressional Republicans want  that person to be able to go to a gun store and buy a weapon."}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "Palau reminds us  that size is not what determines strength; conviction is."}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "The bill directs the Secretary of the Interior to approve a State's  SWAP within 180 days, once the Secretary determines the SWAP complies  with the requirements of the Pittman-Robertson Wildlife Restoration  Act."}, {"senator": "French Hill", "party": "Republican", "sentence": "I hope all my colleagues can recognize that Article I determines how  we issue money and how we value it, that that is a power of the  Congress, and that we are not delegating it to the executive."}, {"senator": "Brian Mast", "party": "Republican", "sentence": "(b) List of Persons.--\n\n(1) In general.--Not later than 180 days after the date of       the enactment of this Act, the President shall submit to the       appropriate congressional committees a list of foreign       persons who the President determines to have knowingly and       directly engaged in or facilitated the involuntary harvesting       of organs within the People's Republic of China."}, {"senator": "John Kennedy", "party": "Republican", "sentence": "What determines prices in America?"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "(4) Waiver.--The President may waive imposition of       sanctions under this subsection on a case-by-case basis if       the President determines and reports to the appropriate       committees of Congress that--\n\n(A) such waiver would serve national security interests; or\n\n(B) the circumstances which caused the individual to be       ineligible have sufficiently changed."}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "(c) Terms and Conditions.--The conveyance under subsection       (a) shall be--\n\n(1) subject to valid existing rights;\n\n(2) made without consideration;\n\n(3) made by quitclaim deed; and\n\n(4) subject to such additional terms and conditions as the       Secretary determines to be appropriate to protect the       interests of the United States."}, {"senator": "French Hill", "party": "Republican", "sentence": "(3) Exemptions.--The requirements described under paragraph       (1) may not be applied with respect to a natural person or a       financial institution, as the case may be, if the President       determines:\n\n(A) The funds described under paragraph (1)(A) were       primarily acquired through legal and noncorrupt means."}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "(b) Restrictions on Conveyance.--\n\n(1) In general.--The conveyance under subsection (a) shall       be subject to--\n\n(A) valid existing rights; and\n\n(B) such terms and conditions as the Secretary determines       to be necessary."}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Secondly, because they are owned by the government, the  government determines what fare is offered."}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "4321 et seq.) and other applicable       laws; and\n\n(ii) subject to such terms and conditions as the Secretary       determines to be appropriate."}]