[{"senator": "Valerie Foushee", "party": "Democrat", "sentence": "These devastating cuts are not only costing people their livelihoods  here at home but are also putting lives at risk around the world.", "title": "Trump Rescissions Request and Usaid Cuts", "date": "2025-06-11"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "Republicans' devastating cuts would mean many PBS stations would be  forced to shutter, especially those in rural areas.", "title": "Corporation for Public Broadcasting", "date": "2025-06-10"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Speaker, Republicans in this House are proposing a budget that  includes devastating cuts to Medicaid.", "title": "Republicans' Assault on American Arts, Culture, and Public Knowledge", "date": "2025-05-15"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "But  these bills show that when Democrats roll up their sleeves and demand a  seat at the table and drive the hardest bargain we can, we do have the  power to reject devastating cuts proposed by President Trump, protect  programs that families rely on, and take power back from this out-of- control administration.", "title": "Appropriations", "date": "2026-01-30"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "Speaker, while many, rightly, have been focusing on the arbitrary  and devastating cuts to essential Federal programs or the disastrous  and reckless tariffs that have increased prices and inflation and have  tanked the economy, President Trump's first 100 days have also  escalated this relentless assault on the checks and balances that have  been the foundation of our great Nation.", "title": "Attacks and Threats on Democracy and Rule of Law", "date": "2025-04-29"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "Throughout these negotiations, our ranking members and I focused on  protecting funding that our communities rely on, rejecting sweeping,  devastating cuts, and eliminating far-right, poison pill riders.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior", "date": "2026-01-12"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Here is what is particularly galling: The Republicans' bill would  also kick more than 15 million people off of their healthcare through  devastating cuts to Medicaid and the Affordable Care Act, including the  millions of Americans who will lose coverage on the exchanges once  Republicans let the premium tax credits expire.", "title": "Providing for Consideration of H.R. Support for Patients and Communities Reauthorization Act of Providing for Consideration of H.R. Save Sba From Sanctuary Cities Act of Providing for Consideration of H.R. American Entrepreneurs First Act of and Providing for Consideration of H.R. Capping Excessive Awarding of Sblc Entrants Act of 2025", "date": "2025-06-04"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "That is why it is perplexing and unconscionable that this  administration has proposed devastating cuts to VA healthcare and  benefits, eliminating 80,000 staff who provide healthcare and benefits  to veterans who have earned them.", "title": "Cuts to Va Benefits", "date": "2025-04-29"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "Either the other side of the aisle is going to acknowledge we have to  make these devastating cuts, or they are not going to cut them.", "title": "H. Con. Res. 14", "date": "2025-04-03"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "Republican Members don't want people to remember that the majority  voted just last week to set in motion devastating cuts to Medicaid and  SNAP or that, a few days ago, Elon Musk said that Social Security is a  Ponzi scheme.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Ocean Energy Management Relating to ``Protection of Marine Archaeological Resources''", "date": "2025-03-06"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "In case they  have forgotten, Republicans are right now moving forward with a budget  that includes devastating cuts to Medicaid, all so they can give tax  breaks to their billionaire buddies.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program for Appliance Standards: Certification Requirements, Labeling Requirements, and Enforcement Provisions for Certain Consumer Products and Commercial Equipment''", "date": "2025-03-05"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "At a time when  Oregonians and Americans are already struggling with rising costs, this  bill locks in devastating cuts to healthcare and drives up the cost, in  many cases, significantly.", "title": "Providing for Consideration of Senate Amendment to H.R. Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "Is it such a priority to fund tax cuts for individuals with over $1  billion in net worth that we would enact devastating cuts to healthcare  for rural and low-income communities?", "title": "Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Consumer Gas-Fired Instantaneous Water Heaters''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Waste Emissions Charge for Petroleum and Natural Gas Systems: Procedures for Facilitating Compliance, Including Netting and Exemptions''; and Providing for Consideration of H. Con. Res. Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-02-25"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "It sets the stage for even more party line  devastating cuts in the future to healthcare, to education, anything  Republicans decide they don't like, all on a party-line vote, all  because of obeisance and fear of Donald Trump, not a conviction that he  is doing the right thing.", "title": "Rescissions", "date": "2025-07-14"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "However, privately,  behind closed doors, according to reports, Republican leadership is  meeting with vulnerable, moderate Republicans to try to sell them on  trading devastating cuts to Medicaid for tax cuts for billionaires.", "title": "Providing for Consideration of H.R. Gulf of America Act; and Providing for Consideration of H.R. Dhs Restrictions on Confucius Institutes and Chinese Entities of Concern Act", "date": "2025-05-06"}]