[{"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…USAID are already being felt. Thousands of talented  professionals have lost their jobs, and vital partnerships with our  local universities have been terminated.\n\nThese devastating cuts are not only costing people their livelihoods  here at home but are also putting lives at risk around the world.\n\nUSAID is a cornerstone of our national security, advancing…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692405/trump-rescissions-request-and-usaid-cuts"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…PBS and its affiliate stations also provide emergency alerts that are  quick and reliable, reaching 97 percent of households during natural  disasters.\n\nRepublicans' devastating cuts would mean many PBS stations would be  forced to shutter, especially those in rural areas. They likely won't  be able to fill the gap.\n\nThe Corporation for Public Broadcasting…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692233/corporation-for-public-broadcasting"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…creativity are not the  enemies of democracy, but instead, they are its very foundation.\n\nMr. Speaker, Republicans in this House are proposing a budget that  includes devastating cuts to Medicaid.  These are cuts they know will negatively impact their constituents,  just like they would mine in north Texas.\n\nThis isn't about balancing a budget, responsibly…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691316/republicans-assault-on-american-arts-culture-and-public-knowledge"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…House. But  these bills show that when Democrats roll up their sleeves and demand a  seat at the table and drive the hardest bargain we can, we do have the  power to reject devastating cuts proposed by President Trump, protect  programs that families rely on, and take power back from this out-of- control administration.\n\nTruly, the difference between the…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…easier to simply shoot the messenger and  claim that everything bad about you is just fake news?\n\nMr. Speaker, while many, rightly, have been focusing on the arbitrary  and devastating cuts to essential Federal programs or the disastrous  and reckless tariffs that have increased prices and inflation and have  tanked the economy, President Trump's first 100…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…with overwhelming support.  Throughout these negotiations, our ranking members and I focused on  protecting funding that our communities rely on, rejecting sweeping,  devastating cuts, and eliminating far-right, poison pill riders.\n\nNow, this week, the Senate is taking up the package that the House  cleared last week in an overwhelming vote, which contains…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698874/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…trillion over the next  decade.\n\nHere is what is particularly galling: The Republicans' bill would  also kick more than 15 million people off of their healthcare through  devastating cuts to Medicaid and the Affordable Care Act, including the  millions of Americans who will lose coverage on the exchanges once  Republicans let the premium tax credits expire.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…have put on the uniform of this country and risked  their lives for all of us.\n\nThat is why it is perplexing and unconscionable that this  administration has proposed devastating cuts to VA healthcare and  benefits, eliminating 80,000 staff who provide healthcare and benefits  to veterans who have earned them.\n\nMore than a quarter of VA staff are veterans…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690327/cuts-to-va-benefits"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…it happens. Right?\n\nWhat, normally, we would see is tough choices being made, right?  Either the other side of the aisle is going to acknowledge we have to  make these devastating cuts, or they are not going to cut them. But  what we see now is that third secret option, which is magic math, which  is: We are going to tell you we are not cutting anything,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689544/h-con-res-14"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…simply  requires scientific standards for underwater surveys.\n\nRepublican Members don't want people to remember that the majority  voted just last week to set in motion devastating cuts to Medicaid and  SNAP or that, a few days ago, Elon Musk said that Social Security is a  Ponzi scheme. Yet, the other night, my Republican friends stood and  applauded…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…on the  other side that this is a pressing issue facing Americans. In case they  have forgotten, Republicans are right now moving forward with a budget  that includes devastating cuts to Medicaid, all so they can give tax  breaks to their billionaire buddies.\n\nEvery day for the last 6 weeks, we have heard horror stories of mass  firings across the Federal…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688549/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…continue the  Republicans' assault on Americans and their pocketbooks. At a time when  Oregonians and Americans are already struggling with rising costs, this  bill locks in devastating cuts to healthcare and drives up the cost, in  many cases, significantly.\n\nThe assault on healthcare and the Republican shutdown more broadly  are further proof that the first…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696695/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…an amendment to this resolution to ask a simple question.  Is it such a priority to fund tax cuts for individuals with over $1  billion in net worth that we would enact devastating cuts to healthcare  for rural and low-income communities?\n\nThis proposal would steal from the poor to give to the rich. Even if  my colleagues don't think that is a problem,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688099/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the details of any of  this stuff.\n\nThe rescissions package is certainly troubling, but the pattern  behind it is even worse. It sets the stage for even more party line  devastating cuts in the future to healthcare, to education, anything  Republicans decide they don't like, all on a party-line vote, all  because of obeisance and fear of Donald Trump,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693459/rescissions"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…However, privately,  behind closed doors, according to reports, Republican leadership is  meeting with vulnerable, moderate Republicans to try to sell them on  trading devastating cuts to Medicaid for tax cuts for billionaires.\n\nUnder their plan, they have to cut $880 billion from Medicaid and  $230 billion from food assistance just to make the math…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}]