[{"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…pour enormous sums into elections to  block climate action while communities like mine in Arizona face record  heat, drought, and wildfires and continue to deal with the devastating  impact to our water, land, and environment.\n\nThe gun lobby spends millions to stop lifesaving reforms while my  friend Congresswoman Gabby Giffords continues to fight for commonsense…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699240/restoring-election-integrity"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…attorney, and the Legal Service Coordinator and Immigration       Policy Analyst for the City of Somerville, I submit this       written testimony to address the devastating impact that       terminating Temporary Protected Status (TPS) for Haitian       individuals and families would have on our communities in       Somerville, across the Commonwealth…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…American public. The same thing is true for  Senator Wyden and Senator Klobuchar.\n\nThank you so much for your leadership.\n\nAnd I rise to join them in highlighting the devastating impact  President Trump's economic policies are having on small businesses  across our country. Small business owners are struggling in President  Trump's economy.\n\nLet me just…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…President's chaotic trade war has been crushing businesses and  raising prices on families across the country. I am hearing from  communities across Washington about the devastating impact of these  tariffs. A small business owner in my district told me he is being  tariffed out of business. I know my colleagues are hearing the same,  especially from farmers…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699902/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I am deeply concerned about the devastating  impact that President Trump's reckless tariff policies are having on  our American automotive industry and its workers.\n\nThe latest financial figures from Jeep Stellantis,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…Congress' constitutional authority  to authorize the use of military force.\n\nDrug trafficking is a serious offense. Communities across the United  States have seen the devastating impact of addiction. But that does not  give Donald Trump the right to go to war, to deploy military forces  without congressional authority, or to kill anyone against the laws…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698246/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…megamillionaires and billionaires who are serving in this Chamber quite  happy, but it doesn't make America better.\n\nI must say that leaving 4 million children hungry has a devastating  impact on their ability to study and learn and thrive in their lives to  come. And to do it for tax breaks for billionaires may make my  colleagues who are really rich really…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Promoting Resilient  Supply Chains Act, S. 257, with Senators Blackburn and Blunt Rochester  to mitigate or prevent disruptions of critical supply chains that could  have a devastating impact on the U.S. economy. The bill charges the  Department of Commerce's Assistant Secretary for Industry and Analysis  with promoting the stability and resilience of critical…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692997/promoting-resilient-supply-chains-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…security. These foreign military forces must be healthy and functional  to effectively engage with our forces and support these missions.\n\nThe HIV-AIDS epidemic has a devastating impact on many countries,  including on their militaries. It reduces readiness, unit deployments  become limited, and it saps the morale and capabilities of the infected  individuals…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…word for it. Listen to the Catholic Hospital Association, who issued  a statement just a few days ago after this provision came out. They had  warned them before of the devastating impact it would have,  particularly on safety net hospitals which Catholics are definitely a  part of all across the country. It fell on deaf ears.\n\nChildren's hospitals rely…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692841/stop-this-insane-attack-on-healthcare-that-affects-every-single-american"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "Ms. SEWELL. Mr. Speaker, I rise in observance of today, November 20,  as World Pancreatic Cancer Day.\n\nIt is a time to shine light on the devastating impact of this disease  and dedicate ourselves to improving prevention, early detection, and  treatment.\n\nPancreatic cancer is the third leading cause of cancer-related deaths…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697076/observing-world-pancreatic-cancer-day"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Mr. DURBIN. Madam President, later today, the Senate will vote on  passage of the HALT Fentanyl Act. Opioid addiction has had a  devastating impact on communities all across the country.\n\nWe have an overdose crisis in the United States, and we should be  doing everything possible to combat it. In just a decade, fentanyl…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688848/halt-fentanyl-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…of our colleagues on the other side of the aisle have made  the representation that, as House Democrats, we are not telling the  truth to the American people about the devastating impact that Donald  Trump's one big, ugly bill, a bill being rushed through this Chamber,  will have on the health and the well-being of people in Louisiana and  all across…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…longer enforce the care worker  rule, effectively stripping these workers of basic wage protections  without notice, without public comment, and without regard for the  devastating impact this will have on families, caregivers, and our  long-term care system.\n\nMr. Speaker, I just can't wrap my head around some of these changes.  Home care workers are too…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…yolks, egg whites, egg souffle,  meringue pie, egg salad, and so much more.\n\nEgg prices still cost 25 percent more at the grocery store. The  answer is: Don't ignore the devastating impact of bird flu decimating  flocks across our district and Nation. Meanwhile, the big egg  conglomerates like Cal-Maine are posting record profits, tripling them,  while…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691814/recognizing-national-egg-day"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…decades. We are talking about infrastructure for  our troops who are over there, as well as our allies' troops.\n\nWe all know that warming global temperatures are having a devastating  impact on our military installations, including sea level rise,  recurrent flooding, hurricanes, and extreme weather, as well as extreme  heat and drought, yet this bill includes…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692959/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "Mr. BALDERSON. Mr. Chair, communities in my district and across the  country continue to feel the devastating impact of the opioid and  fentanyl crisis. We all know someone who has been affected, and many of  us felt that loss ourselves.\n\nThe SUPPORT for Patients and Communities Act,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691871/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…and  recognize this monumental achievement.\n\nThis championship win is a story of perseverance and dedication that  has spanned multiple years. The COVID pandemic had a devastating impact  on Band membership, which hit a low in 2021 of only 31 members. In  2022, the Band earned a bronze medal in a much smaller division, which  piqued more interest and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698290/congratulating-the-big-spring-high-school-marching-bulldogs"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…proposes to make use of  this airspace 60 or fewer days every year. That is less than 20 percent  of the time, Mr. Speaker.\n\nThe problem with this is it is going to have a devastating impact on  four local area airports, as well as operations in the adjacent Johnson  Valley, which is home to the King of the Hammers, one of the largest  off-road races in the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695111/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…there.\n\nIt is past time for Congress to pass a fiscally conservative 5-year  farm bill, including support for agricultural research and development.  We have seen the devastating impact disease outbreaks can have with the  HPAI virus, and now we must continue to take steps to prevent the New  World screwworm from reaching our borders.\n\nThe Big First…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693761/getting-animal-health-research-right-in-farm-bill"}]