[{"senator": "Rob Menendez", "party": "Democrat", "sentence": "…speak out against the cruelty of  this administration. Her children were robbed of memories that make a  life, and they won't have their mother there for them.\n\nThis week, ICE, DHS took this 5-year-old boy, Liam Ramos, from his  family and from his community. This is what Liam's teacher says about  him:\n\n``He is very friendly. He comes into class every…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699379/speaking-out-against-ice"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…their kids--often taking those kids and  separating them from their parents, breaking down doors, and detaining  citizens and noncitizens alike.\n\nAs for warrants? No. Apparently, DHS lawyers now claim you don't need  a judicial warrant to break through the door of a U.S. citizen and haul  them out in their underwear in the dead of winter, only to later…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699422/9999"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "Mrs. MURRAY. Mr. President, earlier tonight, we voted to pass five  crucial funding bills while splitting off the DHS bill so that Congress  is forced to reckon with the horrific killings we have all witnessed.  And negotiations can continue to secure the reforms that Americans are  demanding.…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…Ana a few weeks back, I was repeatedly lied to, including having ICE  government relations people tell me that there had been zero  warrantless raids in Orange County by ICE, DHS, or CBP and that zero  complaints had been filed or litigation filed against ICE in Orange  County, things that were demonstrably untrue.\n\nAt this point, I think it is necessary…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695089/congratulating-colonel-dominic-v-dinh-on-his-retirement"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "Mr. Speaker, H.R. 881, the DHS Restrictions on Confucius Institutes  and Chinese Entities of Concern Act seeks to help address the threat  posed to U.S. colleges and universities by the People's Republic…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690827/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…marines, which have  only inflamed peaceful protest, and they have thrown down to the ground  a U.S. Senator, my U.S. Senator, and handcuffed him for trying to ask  questions to DHS Secretary Noem.\n\nThis is happening because the administration does not like that they  have different opinions from the State of California.\n\nMy constituents deserve more from…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692443/californians-should-continue-to-peacefully-protest"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…terrorize immigrant families who have been contributing to our country  for decades, including law-abiding marines and even American kids.\n\nThis bill means billions of dollars for DHS to continue obstructing  Congress and denying due process to legal immigrants.\n\nMy Republican colleagues may be fooled by the one big, ugly bill, but  the American people are…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693217/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…workers. On July 7, the  Agency received 16,000 calls and only answered 2,000 of them, around 16  percent.\n\nSecretary Noem, meanwhile, issued a directive on July 11 saying that  all DHS contracts of over $100,000 had to be personally approved by  her, according to the New York Times--including, according to the New  York Times, deployment of search and rescue…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693517/central-texas-floods"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "…streets to protect their neighbors, their customers, and  their employers.\n\nCBP's actions in Charlotte were deplorable and absolutely  unacceptable. I have already reached out to DHS and demanded  transparency on exactly what Border Patrol was doing in Charlotte. I am  still waiting for answers to my questions.\n\nMake no mistake about it. My constituents…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697455/fighting-dhs-immigration-raids"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…enforce the law, yet  whose actions have violated basic human rights, the Constitution, the  rule of law, and are now costing our country economically.\n\nUnder these policies, DHS is targeting people because of the color of  their skin, the language they speak, and where they come from. Families  are being separated, children are traumatized, and communities…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697448/fighting-dhs-immigration-raids"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…DEXTER. Mr. Speaker, today, I rise as Federal agents once again  descend upon Portland, not to protect, but to terrorize.\n\nOver the weekend, during a peaceful labor-led protest, DHS agents  deployed tear gas on civilians, including children in the crowd. DHS,  let me say that again, tear-gassed children. The clouds were so dense,  they sickened families…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699722/dhs-excessive-use-of-force"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…across the country and  detained. It is shameful and an embarrassment to our country. That is  why we must act. It is why I will vote ``no'' and not give a single  other penny to DHS. It is why we must impeach Kristi Noem. It is time  to act. We will not be complicit.", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699491/children-are-not-political-pawns"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "I rise today in support of Representative Strong's bill, H.R. 706,  the DHS Biodetection Improvement Act.\n\nThis legislation is essential in advancing the Department of Homeland  Security's efforts to protect Americans from emerging biological  threats.…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688729/dhs-biodetection-improvement-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…came to  us from Colorado. The ripple effects of the cruelty that we saw  demonstrated in that attack--utter and total cruelty--are repeated  again and again and again.\n\nToday, DHS announced, through Tom Homan, that there will be a  ``withdrawal'' of 700 personnel--agents, whatever they have as their  title--from Minneapolis. And numbers are important.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…time we were going to show up  anyway.\n\nWe took them up on that. We went in the facility. I am here to talk a  little bit about my experiences there.\n\nThe State of Florida and DHS got wind of our visit. They got scared.  They invited us. Of course, what we got was a sanitized version of the  way things usually are. Even that sanitized version to me was…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693654/internment-camp-in-the-florida-everglades"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…attacks against our Nation's  schools, there is currently no comprehensive Federal strategy to  protect schools from acts of terror.\n\nThis bill closes this dangerous gap, requiring DHS to produce a  school security strategy that identifies and works to mitigate  vulnerabilities. In doing so, our schools will no longer be soft  targets.\n\nMr. Speaker, I urge…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696997/national-strategy-for-school-security-act-of-2025"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…safety and preparedness. It protects  taxpayer dollars and refocuses the Department on its core functions.\n\nWith border encounters at a historic low, this legislation fully  funds DHS and the effort to detain and remove violent, illegal  immigrants from our communities.\n\nIn central Washington, we know firsthand the important work done by  the Federal Emergency…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699356/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Enhancing Stakeholder       Support and Outreach for Preparedness Grants Act''.       SEC. 2. DHS GRANT OUTREACH.\n\n(a) Urban Area Security Initiative.--Section 2003 of the       Homeland Security Act of 2002 (6 U.S.C. 604) is amended by       adding at the end the following…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696945/enhancing-stakeholder-support-and-outreach-for-preparedness-grants-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…to preserve ``one  person, one vote.'' Maybe that is not important to them. It is  important to 80 percent of the American people.\n\nAnd, you know, they are not wanting to fund DHS, and they are saying:  Oh, it is over ICE. ICE is funded. Their money is going to continue.  But what they are doing, they are defunding FEMA. They are defunding  TSA. So if…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700058/9999"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…November of 2024, and this new direction of foreign policy  is the ascendant view.\n\nBut outside of the foreign policy debate, just how offensive is it  that they voted to defund DHS and are going to fly transatlantic on the  taxpayer dime and trash talk America.\n\nThat won't get reported probably many places. The corrupt media  covers for the Democrats day…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "Mr. WILLIAMS of Texas. Mr. Speaker, due to a personal family matter,  I was unable to vote on H.R. 881--the DHS Restrictions on Confucius  Institutes and Chinese Entities of Concern Act. Had I been present, I  would have voted YEA on Roll Call No. 120.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690815/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "Mr. MOOLENAAR. Mr. Speaker, I rise today in strong support of  Representative Pfluger's bipartisan bill, H.R. 881, the DHS  Restrictions on Confucius Institutes and Chinese Entities of Concern  Act.\n\nMr. Speaker, this legislation is about one thing, and that is  protecting American students, American…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690829/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "Mr. STRONG. Mr. Speaker, I thank Chairman Green for his support as  well as my colleagues who joined me in introducing this legislation,  H.R. 706, the DHS Biodetection Improvement Act.\n\nThe anthrax attacks of 2001 opened our eyes to a new dimension of  national security risks, including the possibilities of bioterrorism.  In response…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688731/dhs-biodetection-improvement-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…believes that we will hold discretionary spending  flat, but history would say we wouldn't. Our budget assumes that we  hold discretionary spending flat. That is Defense, DOJ, DHS, all the  spending on all the various programs in Commerce, and go down the list.\n\nWhat else? I read a story yesterday that because of tariff policy--by  the way, I support…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "Mr. EVANS of Colorado. Mr. Speaker, today I rise in strong support of  H.R. 881, the DHS Restrictions on Confucius Institutes and Chinese  Entities of Concern Act, of which I am an original cosponsor. The  stakes for our national security, constitutional freedoms,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690825/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…know? It is a legitimate  consideration that the citizenry from sea to shining sea should ask  themselves right now. What exactly is the problem?\n\nThey say again and again, oh, DHS could do this if they wanted to.  They already report to us. We are saying exactly that: The special  interest alien data should be reported to Congress along with the rest…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693077/special-interest-alien-reporting-act-of-2025"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…worked tirelessly this year to arrest  and deport millions of illegals brought into the country by the Biden  administration. Patriotic Americans are thankful for the work of DHS  and ICE and what they are doing to clean up our streets.\n\nIf we don't take this threat seriously, more terrorist attacks will  take place, and more stories of third world Islamists…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Strengthening Oversight of       DHS Intelligence Act''.       SEC. 2. ENHANCED DHS OVERSIGHT OF CERTAIN INTELLIGENCE                     MATTERS.\n\nThe Homeland Security Act of 2002 is amended--\n\n(1) in paragraph…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696751/strengthening-oversight-of-dhs-intelligence-act"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…purposes, and ask  for its immediate consideration in the House.\n\nThe Clerk read the title of the bill.\n\nMr. PFLUGER.  881.\n\nMr. Speaker, I rise in support of my bill, H.R. 881, the DHS  Restrictions on Confucius Institutes and Chinese Entities of Concern.\n\nI have long been concerned that the threats the Chinese Communist  Party poses to our homeland are not…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690828/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…not honoring due process. They are not honoring due  process. They are ignoring the Constitution to be able to do that.\n\nInterestingly enough, just last week, President Trump's DHS released  an extensive release that they called 100 days of fighting fake news.\n\nOne of the items that they listed as the fake news that they are  fighting is that aliens don't…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}]