[{"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…nationwide network of  nonprofit partners and corporate donors to deliver essential products  to individuals and families in times of crisis. Through continuous  coordination and dialogue, Good360 has demonstrated its capacity to  serve as a strategic partner with local governments, relief  organizations, and corporate leaders in both the immediate aftermath…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694807/recognizing-good360-in-honor-of-national-preparedness-month"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…democracy is at risk.\n\nThird, we must meet this moment with unity and resolve. We must  reject the violent rhetoric and conspiracies that fuel this hatred. We  must defend civil dialogue. We must stand together as Republicans and  Democrats to condemn political violence and, for that matter, violence  of all kinds.\n\nJust as an aside, I hope that the American…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692857/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…Abraham accords and commitments to regional partners  on critical mineral investment.\n\nOver the years, the C5+1 format has evolved into an important  platform for advancing dialogue, strengthening regional cooperation,  and expanding opportunities for trade, investment, and connectivity.  The recent summit in Washington underscored the mutual benefits…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696589/welcoming-the-positive-outcomes-of-the-c51-summit-and-us-central-asia-partnership"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…also sparked       some acknowledgment within the Government of National Unity       regarding Turkey's growing role, particularly after Ankara       began fostering closer dialogue with the House of       Representatives as part of what Turkish President Recep       Tayyip Erdogan referred to in August as a step in line with       his       nation's…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…recreation, planning and budget, youth services,  education, health and human services, and veterans services, with board  members and community volunteers engaged together in dialogue and  action to serve the overall region.\n\nI am pleased that Co-op City is a major contributor to the work of  this board.\n\nFrom the floor of the House of Representatives,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699710/saluting-scarsdale"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…I rise to thank my colleague from Minnesota  Senator Klobuchar for her hard work on this effort and her work over  many years in leading the U.S.-Canada interparliamentary dialogue. That  is a dialogue that we have with some nations, nations that are  longstanding allies of the United States, and I maintain that the U.S.- Canada relationship is really…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…notion that Jews in the diaspora must remain silent on  matters concerning Israel. . . . To those who fear that public  criticism undermines Israel, we say that open, honest dialogue only  reinforces our democracy and security.''\n\nThis is true for this body, too, Mr. Speaker. We all must speak up.  If our voices contribute to preventing one  more ounce…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692485/supporting-israeli-security-and-palestinian-freedom"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…revered global religious leader whose life's work has been defined by  faith, peace, and reconciliation.\n\nHis All-Holiness has long been a tireless advocate for interfaith  dialogue, human rights, religious freedom, and environmental  stewardship. For decades, he has traveled the world promoting  understanding and respect among faith traditions and urging…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696208/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Patriarch of Constantinople, His All- Holiness Bartholomew, who is traveling to the U.S. this month to  receive the prestigious Templeton Prize, on his achievements in  interfaith dialogue. As this year's Templeton Prize Laureate,  Ecumenical Patriarch Bartholomew will join the esteemed ranks of past  recipients, including Mother Teresa, the Dalai Lama, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695851/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…Connecticut for yielding. It is so good to be here with her.\n\nI want to focus a little bit on the importance of bringing this to  the floor and perhaps even entering into a sort of dialogue with Mrs.  Hayes about it.\n\nI am thinking that the Individuals with Disabilities Education Act  came around 50 years ago. Long before that time, people recognized that  education…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698944/protecting-education-for-children-with-disabilities"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…a 550-year history of co-existence  with Muslims in the Middle East, he has initiated a series of meetings  with Muslim leaders throughout the region in what he calls ``a dialogue  of loving truth.'' To strengthen that dialogue, he has traveled to  Libya, Syria, Egypt, Iran, Jordan, Azerbaijan, Qatar, and Bahrain, and  met political and religious figures…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…luncheons--that rotate between churches with  historically Black or White congregations. These events are not mere  meetings; they are powerful acts of reconciliation, fostering honest  dialogue, trust, and deeper understanding among individuals of diverse  backgrounds.\n\nThrough these efforts, Mission Mississippi of Leflore County engages  in what Mr. Williams aptly…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692273/recognizing-mission-mississippi-of-leflore-county-for-its-commitment-to-racial-reconciliation-and-community-unity"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Bartholomew, which now include the 2025 Templeton Prize.\n\nPatriarch Bartholomew has long been a voice of spiritual clarity and  moral courage. His leadership in advancing interfaith dialogue, human  rights, and especially environmental stewardship, has earned him the  nickname ``The Green Patriarch.'' The Templeton Prize recognizes his  decades of work urging…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695408/recognizing-the-accomplishments-of-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…reinforce structural and       institutional bias and scrutiny of the decisions students       make regarding their personal lives.\n\nWe welcome the opportunity to have an open dialogue with       the sponsors of the ``Pregnant Students' Rights Act'' and       with any other members of Congress who are ready to be the       champion that pregnant and parenting…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…is the same.\n\nWe are bound together by that shared humanity, so we must be  relentless in our commitment to peace: peace rooted in diplomacy, peace  that is sustained with dialogue, and peace that insists, without  exception, that every single life matters.\n\nFrom Boston to the Middle East, our destinies are tied, and everyone  deserves to live free from…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692987/our-destinies-are-tied"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Emmer's bill. They want that. Republicans are thankfully united in  opposing Central Bank Digital Currency, but we should deal with that  fully here.\n\nOn March 8, 2023, in a dialogue with Chairman Hill, Federal Reserve  Chairman Jerome Powell said that they would need congressional approval  for a retail CBDC, but he went on to explain that you could have…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693835/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…alliance, and that is NATO,  and that gives Russia and China exactly--exactly--what they are looking  for.\n\nNow, there may be some new forms of partnership. I am talking about  dialogue and trade relationships, but there may be other forms of  partnerships that might make sense in 2026. There has been some  suggestion of a joint Compact of Free Association…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…Whereas a healthy and collaborative relationship between       local law enforcement officers and the communities they serve       is essential to creating mutually respectful dialogue; and\n\nWhereas local law enforcement officers and their families       deserve respect, appreciation, and support for their       sacrifices and commitment to public service:…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691031/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…worldwide. He has  consistently called for the protection of religious minorities and has  championed the rights of Orthodox Christians to worship freely. His  efforts to promote dialogue between the Orthodox Church and other  Christian denominations have significantly strengthened interreligious  understanding.\n\nIn my home State of Kansas, we are honored to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695589/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…environment. He has been at  the forefront of religious freedom and bringing together others from  many faiths to work towards better cooperation and understanding.  Through dialogue and visitations, the Ecumenical Patriarch Bartholomew  has significantly advanced Orthodox relations with the Roman Catholics,  Lutherans, Baptists, and others through visitations…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695924/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…Mr. EVANS of Colorado. Mr. Speaker, I, unfortunately, had other  engagements that had been scheduled.\n\nThe resolution was introduced to, again, focus a component of the  dialogue. Of course, our thoughts and our condolences go out, but we  need more than thoughts and condolences. We need to have the  conversation about how to prevent this from happening…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…Archbishop of the 2,000-year-old Church  founded by the Apostle Andrew. For more than three decades, he has  stood at the forefront of the cause of religious freedom, interfaith  dialogue, and peacebuilding, making him the longest-serving Archbishop  of Constantinople in the history of Christianity.\n\nBorn Demetrios Arhondonis in 1940 on an island in Turkey,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695424/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…that became  proverbial. Fluent in seven languages and a holder of several  doctorates in Canon Law, he has tirelessly championed the cause of  religious freedom, inter-faith dialogue and environmental  responsibility--earning the endearing nickname ``the Green Patriarch'',  by stating that damaging God's creation is a sin.\n\nAt a time when religious persecution,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695076/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-the-united-states"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…antithetical to who we are  as Americans.\n\nThe beauty of our Nation and the First Amendment is that anyone from  anywhere has the right to express their beliefs, engage in dialogue,  and disagree peacefully. That is the heart of our democracy. We need to  get back to embracing that dialogue.\n\nCharlie often said that when we stop talking, that is when…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695600/we-are-better-together"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…for my constituents and all Orthodox Christians who call America home.\n\nPatriarch Bartholomew is known worldwide as a bridge-builder, working  tirelessly to promote peace, dialogue, and respect among all different  faiths. He is also a champion for protecting our natural environment,  earning him the title of the ``Green Patriarch.''\n\nHis leadership…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695267/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…horrifying act of political violence, we can be reminded of the broader  swath of common ground that we share. It is a belief that political  differences should be resolved through dialogue, debate, and elections,  not force. It is a commitment to the founding ideals of our country,  however differently we might conceive of them at any given moment, that  all…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695355/tragic-loss-of-charlie-kirk"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…have spoken with one voice: to defend the weak, serve those in  need, and pursue reconciliation among nations. Patriarch Bartholomew is  also a leading figure in interfaith dialogue among Judaism,  Christianity, and Islam. His presence here reminds us that faith has a  vital role to play in protecting liberty and human dignity.\n\nMr. Speaker, it is my…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695856/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…lawmakers who are working very hard  to try to advance their bills. So I appreciate the discussion that I  have had with my colleagues here on the floor about a way, a process, a  dialogue that needs to be had with our colleagues on the other side of  the aisle.\n\nSo there are a few bills that we are looking at today specifically,  but I think it goes to a bigger…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700283/cape-fox-land-entitlement-finalization-act-of-2025"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…during a campaign may be true, but       during the course of it the truth will become clear and the       voters will know whom to vote for from the total body of the       dialogue. German philosopher Immanuel Kant (1724-1804) said       lying steals one's dignity and we know from Scripture that       God wants us to maintain our dignity as Christians…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694761/recognizing-campbell-the-nature-of-truth-odessa-american"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…a discourse about our representative democracy as part of  the Nation's semiquincentennial celebration.\n\nAs part of our contribution to America250, we want to engage in a  dialogue with many different audiences, and we want that dialogue to be  credible, inspirational, genuine, and motivating. FMC's exceptional  deliverable is an insider's view on the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698189/9999"}]