[{"senator": "Lou Correa", "party": "Democrat", "sentence": "Mr. CORREA. Mr. Speaker, today I rise to honor Diana Barrios, a  homegrown, passionate leader.\n\nDiana graduated from Oxford Academy at the young age of 16 after  finishing her sophomore year. She then earned a bachelor's degree…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692112/recognizing-diana-anahi-barrios"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…Renee Nicole Good and Alex Pretti.\n\nNext month? It could be another beloved, hard-working member of your  community.\n\nAgents are detaining sick children.\n\nLast month it was Diana Crespo, a seven-year-old from my district and  her parents who were detained on the way to urgent care.\n\nNext month? It could be another sick second grader in your community.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699670/horrific-ice-abuses"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…benefits will be ripped  away from millions of Americans in Donald Trump's one big, ugly bill, a  bill that Republicans are prepared to recklessly rubber stamp.\n\nWe also heard from Diana from the great State of California. Diana  writes: ``SNAP has helped my family tremendously during this difficult  time. We really appreciate all the help. My husband was diagnosed…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…food, limited access to clean water, and where  there have been confirmed measles cases.\n\nYour tax dollars are funding this.\n\nLast Friday, I traveled to Texas to fight to bring Diana and her  family home to Oregon. I am grateful that Diana is home safe in  Gresham.\n\nThis never should have happened in the first place. It is immoral to  jail children. It…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700028/your-tax-dollars-are-funding-this"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…He loved  his family dearly. For 42 years, he stood side by side with his beloved  wife, Judy, raising their sons, Garrett and Greg. They also cherished  their granddaughter, Diana Del.\n\nTo his church and to his church family at First Baptist of Boulougne;  his brothers and sisters; and his many friends, nieces, nephews, and  neighbors who knew him, Carrol…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694060/may-beam-continue-to-light-the-way"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Kenneth Rosen\n\nOffice of the Sergeant at Arms: Wendy Benson, Christopher       Brown, LaKeisha Commodore, Christopher Fischer, Lynn Hershey,       John Looney, Robin Pegues, Diana Rodriguez\n\nOffice of Inspector General: Julie Poole\n\nOffice of the CAO: Marcus Suydam, Shawn Sessoms, Steve       Hunter, Brandon Braxton, Andreal Little, Myrtle Norma, Carol…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698362/recognizing-employees-of-the-us-house-of-representatives-who-have-reached-25-years-of-service"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Kimberly: NBC NEWS.\n\nCornish Emery, Audie: CNN; Correa, Pedro: AP-BROADCAST;       Correa Diaz, Pedro: TELEMUNDO NETWORK; Corredor, Jordan:       VENTANA PRODUCTIONS; Correll, Diana: FOX NEWS; Cortes,       Gerard: CARACOL TELEVISION; Cortes, William: TELEMUNDO       NETWORK; Corti, Stefano: RAI RADIO TELEVISIONE ITALIANE;       Corujo Oruna, Cristina:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…publisher and CEO of The  Baltimore Sun.\n\nThroughout his life and career, Mr. Murphy stayed true to his morals  and strong ethical compass.\n\nMr. Murphy is survived by his wife, Diana; daughters, Karen and  Susan; two grandsons; a sister; and three nieces and nephews.\n\nMr. Murphy will always be remembered as a humble, approachable,  gentle, and kind man.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "David Taylor", "party": "Republican", "sentence": "Mr. TAYLOR. Mr. Speaker, I rise today to recognize the selfless acts  of service done by Diana Lawrence and the Troop Box Ministry to bless  our Nation's servicemembers.\n\nIt all began nearly a quarter century ago in the garage of the  Lawrences' residence in Hamersville,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691308/acts-of-service-by-diana-lawrence-and-troop-box-ministry"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…that is worthy of support. I have not decided whether I will be  able to support it. We will find out whether it has what is needed.                      Honoring the Life of Diana Denman\n\nMr. ROY. Mr. Speaker, I do want to take one second before I yield to  my friend from California to honor a dear friend of mine who passed  away a couple weeks ago,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Axios;       Gillison, Douglas: Thomson Reuters; Gillum, Jack: Wall Street       Journal/Dow Jones; Givhan, Robin: Washington Post; Glazier,       Kyle: Bond Buyer; Glebova, Diana: New York Post; Glenn,       Michael: Washington Times; Goba, Kadia: Washington Post;       Gold, Ashley: Axios; Gold, Michael: New York Times; Golden,       Rodrek: Thomson…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}]