[{"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…intent. So far, the administration has cut congressionally authorized  programs that support human rights in China, including initiatives  empowering Chinese and Uyghur-related diaspora groups to combat  transnational repression and defend religious freedom.\n\nDespite the fact that Radio Free Asia helped break the story about  China's program of detention,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694800/uyghur-policy-act-of-2025"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…vibrant culture through festivals, carnivals, music,  dance, film, food, and literature, enriching the cultural landscape of  the United States.\n\nMembers of the Caribbean diaspora also have a longstanding legacy of  economic contributions, both in the U.S. and in their countries of  origin. Through monetary and social remittances, they play a vital…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693058/introduction-of-resolution-recognizing-the-significance-of-national-caribbean-american-heritage-month"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…ICAN DFW has been instrumental in building bridges across  communities, empowering families, and supporting generations of Igbo  descendants as they navigate life in the diaspora. From cultural  education and youth mentorship to advocacy and charitable outreach,  ICAN DFW has consistently demonstrated what it means to lead with  purpose and pride.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694153/recognizing-the-igbo-community-association-of-nigeria-dalles-fort-worth"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "Mr. ESPAILLAT. Mr. Speaker, it is with a heavy heart that I rise on  the floor today as people across the Dominican diaspora are united in  solidarity to mourn the devastating tragedy in Santo Domingo, Dominican  Republic.\n\nFollowing the collapse of a roof at a nightclub, 124 individuals lost  their…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689828/mourning-devastating-tragedy-in-santo-domingo"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…retired senior officials from Israel's defense,  security and diplomatic services. The ``Commanders,'' as they are often  referred to, recently published a letter urging Jewish diaspora voices  to speak out in favor of ending the violence in Gaza.\n\nThey wrote: ``Accused of weakening Israel or betraying their  connection to the Jewish state, they are told…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692485/supporting-israeli-security-and-palestinian-freedom"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Caucus--that we arrive here today.\n\nReviving the Haiti caucus was a significant priority for       me, because my district represents the third largest Haitian       diaspora in the country. More than 77,000 Haitians call the       Commonwealth their home. Our Haitian neighbors are attorneys,       nurses, social workers, chefs, artists, teachers,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699707/congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…administration has cut at least $50 million for projects  that focused on addressing Beijing's human rights abuses. This includes  programs that were empowering Chinese advocates and diaspora groups to  combat transnational repression, monitoring forced labor goods in  global supply chains, and promoting religious freedoms.\n\nThe administration is also trying to…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690653/no-dollars-to-uyghur-forced-labor-act"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "Mr. TRAN. Mr. Speaker, I stand here today to mark the most solemn  time of the year for the people of the Vietnamese diaspora. ``Black  April,'' ``Thang Tu Den,'' is not just a solemn day in history, but it  is a reminder of the day when we lost everything: our homes, our  livelihoods, and our beloved…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690347/recognizing-black-april"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "Mr. TRAN. Mr. Speaker, I rise to mark the beginning of the most  solemn month of the year for Vietnamese Americans and diaspora. We  refer to this month as Black April, or Thang Tu Den, because so many of  us lost our homes, our livelihoods, and our country.\n\nMy own parents escaped brutal oppression…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689425/reaffirm-commitment-to-freedom-during-black-april"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…School of  Halki through his studies and teachings, he continues to provide  guidance to the faithful.\n\nOn a per capita basis, New Hampshire is proud to host the largest  Greek diaspora in the United States. On behalf of the Granite State, I  wish him well on his visit to the United States and look forward to  continued engagement between His All-Holiness…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695442/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…detained, while approximately 3.6  million people, nearly 6 percent of the population, is now displaced  from their homes.\n\nIn response to the calls for action from the Burmese diaspora in the  United States and in my district, I introduced H.R. 3190, the BRAVE  Burma Act.\n\nAs I have mentioned many times before, issues involving Burma are  near and dear to…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699832/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…barbarism both united and divided Israelis       with a backlash of antisemitism in the United States and       Europe. It is evident that events in Israel affect the Jewish       Diaspora, even as the author emphasizes the debt of the       latter to the Israeli partner. It is clear though that       influential American Jewry is the glue to the essential…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697168/the-triumph-of-life"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…that support Uyghurs and  other ethnic and religious minority groups in the Xinjiang Uyghur  Autonomous Region. It counteracts transnational repression against the  Uyghur diaspora and creates reporting mechanisms for Uyghur victims.\n\nIt also works to expose and disrupt Beijing's state-sponsored forced  labor programs that exploit Uyghurs in order to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694801/uyghur-policy-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…cultural, religious, and       linguistic identities, for expressing their political or       religious beliefs in the XUAR, or for being related to       members of the Uyghur diaspora or activist community       including--\n\n(A) Ekper Asat, who participated in the Department of       State's International Visitors Leadership Program in 2016,       was incarcerated…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…on brutal intimidation, terrorism, and violence to  maintain their grip on power. A third of the population has now fled  that afflicted nation. With Maduro's ouster, this diaspora of  socialism's victims finally see a cause for hope, and they are  rejoicing in the streets.\n\nThis should be a warning to our fellow Americans who today are  flirting with…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698660/lessons-from-caracas"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…Economic Lift  Program Extension Act.\n\nIn my Hudson Valley district just north of New York City, we have a  vibrant Haitian community. It is actually one of the largest Haitian  diaspora communities in the country, and it has been an honor  representing these great people and working with them over these many  years.\n\nOne of the things that they have taught…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698848/haiti-economic-lift-program-extension-act"}]