[{"senator": "Al Green", "party": "Democrat", "sentence": "…necessary to give some  indication today and possibly at a later time as to why this is so  important, why would I do such a thing.\n\nMr. Speaker, I agree with Vice President Dick Cheney. I agree with  him. I agree with a statement that he has made. Yes, Vice President  Cheney represents the Republican Party or he did when he was Vice  President, and…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…dollar denominate all its oil revenue  trades, bringing enormous financial benefit to the U.S. financial  markets. Moreover, it is important to follow the footsteps of Richard  ``Dick'' Cheney, then Secretary of Defense, and late Vice President  during the George Bush II Presidency from 2001 to 2009. When he left  his position as U.S. Secretary of Defense…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…Bernie Sanders. I heard it from Tulsi Gabbard. I heard it from  Donald John Trump: No regime-change wars. And yet here we go again.\n\nAlmost 25 years ago, George W. Bush and Dick Cheney cooked up claims  of Saddam Hussein having weapons of mass destruction to justify going  into Iraq. Last month, just 2 weeks before ordering the capture of  Nicolas Maduro,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698623/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…question really is: Why wouldn't I do it? Why wouldn't I do it,  when I have in my hand language that motivates me to do it?\n\nLet me read what I bear in my hand. It says here Dick Cheney's  statement. For further edification, that would be Vice President Dick  Cheney. This is his statement on Donald Trump's statement, talking  about Donald Trump. This…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…has been home to the headquarters of  McDonald's, but the multibillion-dollar hamburger chain's history with  the Prairie State does not begin there.\n\nIn the 1920s, Richard ``Dick'' and Maurice ``Mac'' McDonald, two sons  of Irish immigrants, headed to California to try their luck in  Hollywood. By the 1940s, they had pivoted to the drive-in restaurant…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689830/recognizing-70-years-of-mcdonalds"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "Mr. LANGWORTHY. Mr. Speaker, today I rise to honor the remarkable  life and service of Richard ``Dick'' Young, a lifelong member of the  Lancaster, New York community, who recently passed away at the age of  94.\n\nDick was a proud graduate of Lancaster High School, Class of 1948,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690585/recognizing-the-life-of-service-of-dick-young"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…on Minnesota.\n\nMr. Speaker, I thank Mary for her decades of service, and I wish her  a long, happy, and well-deserved retirement.                      Recognizing Richard ``Dick'' Pesek\n\nMrs. FISCHBACH. Mr. Speaker, I rise today to recognize a  distinguished member of the Minnesota agricultural community.\n\nI congratulate Dick Pesek of Taunton, Minnesota,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698583/recognizing-mary-krinkie"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…its commitment  to excellence, creativity, and service. Mr. Hebel joined the company in  1981 as a young landscape designer, quickly finding a mentor and  partner in owner Mr. Dick Royer who shared his vision for inspiring  outdoor living. After a decade of collaboration, Mr. Hebel assumed  ownership, guiding the business through decades of growth and…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696583/recognizing-bucks-country-gardens-president-tom-hebels-retirement-after-years-of-service"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…of anyone they choose, maybe it would be better to make it so  California is no longer the fraud capital of the United States.\n\nHonoring an extraordinary American, Richard ``Dick'' Burbine\n\nMr. KILEY of California. Mr. Speaker, I rise today to honor an  extraordinary American, a man whose life story reflects the very best  of our Nation's character,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, we rise today in memory of  Congressman Richard T. ``Dick'' Schulze, who died on December 23 at the  age of 96.\n\nCongressman Schulze represented the Philadelphia suburbs from 1975 to  1993 in the people's House. He was the driving…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698746/moment-of-silence-for-congressman-richard-t-dick-schulze"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…spirit of the people that those camps represent; the spirit  of the little girls who are already talking about wanting to go back;  the spirit of the people associated with Dick Eastland, the camp  director of Camp Mystic who gave his life trying to save those little  girls; the spirit of Jane Ragsdale, who lost her life saving five  little girls--her…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693607/mourning-the-loss-of-life-in-the-state-of-texas"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to mourn the loss of  Richard ``Dick'' Wallace.\n\nDick was a man who led a captivating life growing up in Alexandria,  Virginia. From a young age, he exhibited an exceptional musical talent,  often playing intricate…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691783/recognition-of-richard-dick-wallace"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…the Susquehanna Township  Board of Commissioners, and the first African American Chairman of the  Dauphin County Republican Committee. In 1986, Stan stood alongside  Governor Dick Thornburgh for the signing of House Bill 1855, which  conveyed funding and property designated for Susquehanna Township,  while he was the President of the Susquehanna Township…", "date": "2025-12-05", "source_url": "https://justfacts.votesmart.org/public-statement/1697565/recognizing-mr-stanley-r-lawson-sr"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  the Susquehanna Regional Emergency Medical Service, which recently  received the 2025 Dick Ferneau Career EMS Service of the Year Award.\n\nThis is one of the top national awards in emergency medical services  and highlights organizations that exemplify outstanding…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699537/recognizing-susquehanna-regional-emergency-medical-service"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…Sergeant Willie Frank Stephenson, U.S. Army.\n\nMaster Sergeant Patrick Ervin, U.S. Air Force.\n\nCaptain Ean Sullivan, U.S. Marine Corps.\n\nSergeant Ayman Hatkwa, U.S. Army.\n\nColonel Dick Thompson, Jr., U.S. Air Force.\n\nSergeant Paul David Hoch, U.S. Army.\n\nChief Petty Officer Michael Thompson, Jr., U.S. Navy.\n\nPetty Officer Second Class James Johnson, U.S. Navy.…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696747/recognizing-veterans-in-texas-third-congressional-district"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…David: Tax Notes; Desiderio,       Andrew: Punchbowl News; Desrochers, Daniel: Politico;       Detrick, Paul: Bloomberg Industry Group; Dewey, Oliver:       Arkaea Media Group; Dick, Jason: Roll Call; DiCosmo, Bridget:       Energy Intelligence; DiMolfetta, David: Nextgov/FCW;       DiSciullo, Joseph: Tax Notes.\n\nDixon, Darius: Politico; Dixon, Kim: Bloomberg…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698171/members-entitled-to-admission-to-the-119th-congress-periodical-press-gallery"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…tear[ing] communities apart.''\n\nSenator Ruben Gallego said ICE exists ``to scare the American  public.''\n\nSenator Mark Warner equated ICE officers to a brutal dictator.\n\nSenator Dick Blumenthal accused ICE of spreading ``lawlessness and  recklessness.''\n\nSenator Alex Padilla accused ICE of ``indiscriminate violence.''\n\nSenator Dick Durbin accused ICE's officers…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…among the first to implement specific pathogen-free herd standards. A  recipient of the Ohio Pork Industry Excellence Award from the Ohio Pork  Council. Bill joins his brothers, Dick Isler and the late Gene Isler,  as a Hall of Fame member.\n\nThe late Steven D. Maurer of Botkins in my congressional district was  a long-time public servant both locally and…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694257/recognizing-the-2025-class-of-the-ohio-agricultural-hall-of-fame"}]