[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…against  anyone who might disagree with Donald Trump.\n\nDonald Trump doesn't want to be President of a democratic republic.  He has said he wants to be a King or some kind of dictator. He said:  Let me be a dictator for one day. But his actions show he wants to be  one for much longer.\n\nMeanwhile--meanwhile--billionaires like Elon Musk have been handed…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690262/trump-administration-first-100-days"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…right now, and Congressman   Steve  Cohen will also have remarks for the Record.\n\nI will begin briefly, and then I will yield to my fellow Congressman  from Illinois.\n\nChina's dictator Xi was recently at the historic military parade that  fellow dictator Vladimir Putin celebrated in Moscow. The purpose of the  celebration was to honor the anniversary of…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…for these unauthorized strikes, nor any kind of serious  long-term strategy.\n\nIt is unquestionably an act of war to invade a foreign nation, kidnap  a foreign leader--even a dictator--and leave dozens of bodies,  including civilians, behind.\n\nWould my colleagues still nod their heads and go along with it if a  country tried to do this to American leaders?…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698684/9999"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…peaceful justice seekers and freedom  fighters.\n\nWe must see our neighbors' humanity in this moment. Yet, across the  country, occupant Trump is working overtime to be a fascist dictator,  to weaponize our government against its own people, to sow fear and  chaos, and to silence dissenting voices in our communities, at our  colleges, in the courts, and, in…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692413/protecting-our-immigrant-communities"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…under repurchase agreements that are a means of exchange currently  authorized or adopted by a foreign government.\n\nDo my colleagues know what Trump's favorite strongman, the dictator  of El Salvador, adopted as a legal currency? He adopted bitcoin.\n\nThis highly volatile cryptocurrency will now be eligible to be a  reserve backing your stablecoins. It is…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…behavior that would be  indicative of a person becoming an authoritarian.\n\nThere were some who said that he would be a fascist. There were some  who said that he would be a dictator. The point is that there are many  people who are Members of this House who made this prognostication.  What is absolutely amazing is that many of them who made these  prognostications…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "Mr. THOMPSON of Mississippi. Mr. Speaker, like Hitler, Mussolini, and  Saddam Hussein before him, Vladimir Putin should be called what he is:  a dictator.\n\nOver the past 20 years, Putin has systematically ended free and fair  elections, crushed independent media, quashed protests, and killed,  jailed, or exiled political opponents.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687989/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…of the Presidency in a manner  offensive to, and subversive of, the Constitution, in that:\n\nHe has, by his actions and statements, sought to establish himself as  tyrant, dictator, and autocrat over the people of the United States,  usurping unto himself the constitutional powers of Congress, the  courts, and the States and powers illegitimate and beyond…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…King calls to our  attention, it may be too late at some point within the next 3 years for  us to do so. Because this President is showing us that he intends to  become a dictator. To a certain extent, he is already, to a limited  extent, a dictator.\n\nSo we have to take back our power to declare war while we can before  it is too late. We have got to…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…snatching people off the streets  with masked agents in unmarked vehicles. They are forcing American  troops to get on their knees and roll out the red carpet for a brutal  dictator. They are now using a terrible tragedy to pit Americans  against one another and grab power.\n\nMr. Speaker, political violence in every form is abhorrent. I condemn  every…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…ignored.\n\nMr. Speaker, this situation is desperate and it is not the result of  a natural disaster or an act of God. Instead, it is the direct action  of a narcissistic, cruel dictator who occupies the Oval Office who has  contempt for every person that calls this country home.\n\nNone of us is free until all of us are free. No one is truly safe in  Donald…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697132/immigrant-neighbors"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…who will vote for it will be  known as persons who have supported what I believe to be the last  effort that we have to prevent this President from becoming a full- blown dictator. He is right now a de facto dictator. He has the  potential to becoming full-blown.\n\nWhat do I mean by de facto?\n\nIt is because we are in the nascency of his dictatorship.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690862/and-still-i-rise-impeaching-president-trump"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…The power of any President is not about what one man thinks is moral.  It is guided by constitutional limitations, including three branches of  government, not a dominant dictator and a subservient politburo and  judiciary.\n\nHarry Truman understood this. Dwight Eisenhower understood this. John  F. Kennedy understood this, and so did Lyndon Johnson,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698929/greenland"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Supreme Court's  order.\n\nI call that, in Article 1 of my Articles of Impeachment, devolving  democracy within the United States into a dictatorship with himself as  a de facto dictator.\n\nMy friends, truth be told, we are now into a de facto dictatorship  with a de facto dictator, not a dictatorship that has been declared by  some official body.\n\nWhen the…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…our Presidents. They have said: We see the  system to our north where there is no freedom, where people are not in  charge of their own destiny because they are ruled by a dictator, and  we reject that and will fight with our lives--and so many have, in  fact, perished on the battlefield--to defend our freedom.\n\nThat inspires me every time I think about…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…the most successful law enforcement  operation in history.\n\nYour hypocrisy is clear, as you chant and you lead your no kings  protests, but when it comes to taking down a dictator, you crawl into a  corner. You curl up, and you start to cry about it.\n\nThis is about your base having protests to free Maduro. This is about  appeasing your far-left friends.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…stok[ing]  fear and tear[ing] communities apart.''\n\nSenator Ruben Gallego said ICE exists ``to scare the American  public.''\n\nSenator Mark Warner equated ICE officers to a brutal dictator.\n\nSenator Dick Blumenthal accused ICE of spreading ``lawlessness and  recklessness.''\n\nSenator Alex Padilla accused ICE of ``indiscriminate violence.''\n\nSenator Dick Durbin…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…be done; and America, Venezuela, and the world are much  safer as a result of it.\n\nOperation Absolute Resolve was conducted for one reason: to bring to  justice a murderous dictator and an indicted drug trafficker. Maduro is  an outlaw, and he is now in custody. The Trump administration indicted  him in 2020 on drug trafficking charges. President Trump…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698571/venezuela"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…in 1989. Without prior congressional approval, he  ordered 12,000 American troops into that country. We toppled Panama's  illegitimate regime. We apprehended the country's dictator, and he  spent the rest of his life in foreign custody.\n\nLet's compare these two cases. In both cases, you had the leader of a  country who is indicted by the U.S. courts…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696118/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…million Russian casualties. He may have at one time been a  successful KGB torturer, but he is a failure at today's attempt to  overrun his neighbor by force.\n\nThe Russian dictator is actually breaking records for his inability  to achieve battlefield gains. Since 2024, his most significant  offensives have scraped a meager 16 yards to 75 yards of ground…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699762/9999"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "Mr. COTTON. Mr. President, today is a great day in America. Nicolas  Maduro--an indicted drug trafficker, an illegitimate communist dictator  who has the blood of hundreds of Arkansans and thousands of Americans  on his hands--is behind bars in a prison in New York. Again, he was an  illegitimate communist dictator,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…conflicts and terrorism to this day.\n\nLibya is still highly unstable, and the conflict constantly threatens  to reignite. Like Saddam and Qadhafi, Maduro is unmistakably a  dictator. He  is a bad guy. He suppresses freedom of speech. He controls his people.  There is no free voting. He treats people poorly, and that is an  understatement.\n\nBut there are…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…Venezuelan people.\n\nNicolas Maduro is a narcoterrorist and international drug trafficker  whose actions led to the addiction and deaths of many Americans. He was  an illegitimate dictator who held power through stolen elections and  horrific violence against the people of Venezuela. The Biden  administration imposed a $25 million bounty for his arrest and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698694/venezuela"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…member of  this body in the thirties, would I have seen what was coming?\n\nAnd, in recent days, I have been chilled when watching a parade in  Beijing where Xi Jinping, the dictator of the PRC, assembled the  leaders of North Korea, Iran, India, and other allies of theirs to  watch a parade of state-of-the-art weaponry. It reminded me of similar  moments…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…took on that day to do  what no other political administration in the world had ever  contemplated as remotely possible: to remove and exfiltrate for  prosecution a ruthless dictator whose direct involvement in  narcoterrorism has led to the death of scores of Americans and other  allies' citizens.\n\nPlease don't take my word for the nature of Maduro's…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "Mr. McCLINTOCK. Mr. Speaker, there is much to unpack from the arrest  of Venezuelan dictator Nicolas Maduro. Above all, there is the stark  contrast between the American socialists who are bitterly denouncing  the ouster of this socialist dictator and the masses of…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698660/lessons-from-caracas"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…Europe becomes more likely if we withdraw.\n\nStrong support for the Baltic Security Initiative is a vote for  deterrence. It is a vote to stand by our allies and to oppose a  dictator who is invading his neighbors.\n\nMr. AUSTIN SCOTT of Georgia. Mr. Chair, may I inquire as to how much  time is remaining.\n\nMr. BACON. Mr. Chairman, I stand 100 percent opposed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695259/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…It is an American law. Does anybody in their right mind-- does any sane individual who can read in our country--believe that it  applies to the security forces of a foreign dictator or a foreign  President; that if their guards have machineguns, they are guilty of  breaching a 1934 U.S. law? What kind of world would we live in if we  could accuse people…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…united and to  remember who we are dealing with in the form and person of Vladimir  Putin.\n\nVladimir Putin is unrepentant. He is ever and will always be the KGB  agent. He is a dictator with decades of bloodshed on his hands. He is  the biggest thief in the history of the world, a war criminal who  should be behind bars at this moment. And, of course, Putin…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699095/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…to the floor today to add my  voice to the many who are commending President Trump as he works toward  peace in Ukraine.\n\nThe President recently gave the aggressor, Russian dictator Vladimir  Putin, every chance to put down his guns and end the killing. He has  done that over and over, but our President is now showing that he will  not wait on Mr. Putin…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690223/ukraine"}]