[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…healthcare system of the country, now wants to turn the  metaphorical war on drugs into an actual, physical war on drugs.\n\nWell, Donald Trump's real interests in supporting dictators and big- time drug dealers were made clear with a series of Presidential pardons  of major drug dealers, including the former President of Honduras, Juan  Orlando Hernandez.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698444/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…order to detain individuals at their will or  discretion. The constitutional checks and balances and our Bill of  Rights have been the envy of the free world and a warning to dictators  everywhere that a nation can be strong and secure and at the same time  show forbearance in the administration of justice. Seeing the erosion  of these concepts in our own…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691184/letter-to-secretary-noem-and-secretary-rubio"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today in vigorous opposition to  occupant Trump's hostile attacks, hostile and insecure attacks on Black  history. Black history is American history.\n\nDictators try to shutter museums, censor history, and whitewash the  truth, but we know the truth. We hold these truths to be self-evident,  that centuries of bondage and enslavement…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689876/trumps-attacks-on-black-history"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Stalin and Mao Zedong, which everyone  in this Chamber agrees should be condemned.\n\nSomehow, once again, this resolution fails to condemn some of our  history's most terrible dictators, like Adolph Hitler and modern-day  dictators like Vladimir Putin, who is responsible for killing countless  people in Ukraine, or President Xi who basically runs actual…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "Mr. HOYER. Mr. Speaker, I applaud and support the remarks of the  gentlewoman from North Carolina (Ms. Ross). We must be on Ukraine's  side and against dictators, despots, and war criminals.                            HONORING BEVERLY BYRON\n\nMr. Speaker, I rise today to honor a great Marylander, a dedicated  champion of our men and…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688629/staying-on-ukraines-side"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…named Russia and North Korea as the ``axis of evil.'' We could add Iran  and other countries. Never before at the United Nations has any U.S.  President ever stood with the dictators of Russia.\n\nThose countries that voted with Russia yesterday are state sponsors  of terrorism. Russia understands terror. That is what she does. For the  United States to…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687991/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…the American people hear  President Trump's own words, see his own actions, and be appropriately  outraged.\n\nPresident Trump's disavowal of Ukraine and his cozying up to  dictators puts us here in the United States at risk as well. President  Trump's turn towards authoritarianism leaves us exposed politically and  economically.\n\nScorned allies could…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…America's global reputation. Perhaps most damaging, Trump has  upended our global reputation as a responsible partner and guardian of  liberty across our world. He leans toward dictators.\n\nWhat is that all about?\n\nIt took 80 years for America, with our leaders like Franklin  Roosevelt, John F. Kennedy, Ronald Reagan to meticulously secure our  place as leader…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the most lethal dictatorship  in Europe. The free world must not allow this. Putin will take  everything he wants and more unless he is stopped.\n\nAmerica must not appease dictators. We should support our fierce  allies to fight dictatorship with every fiber in our being. Ukraine  needs ammunition and arms. We must send them. They are not asking us to…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…standards of the working-class majority of America  and rip up the social fabric of the country.\n\nMeantime, President Trump's heroes and best friends in the world are  Communist dictators.\n\nIf House Republicans really want to oppose the promotion of socialist  ideology, why don't they write a letter to President Trump and condemn  his worship and admiration…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697148/denouncing-the-horrors-of-socialism"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…This past Sunday I had the honor to stand with her and Ukrainian  Americans at a Chicago rally to send a clear message: We who stand for  democracy will not be bullied by dictators, not in Ukraine, not in  other parts of the world, and not in the United States.\n\nOn behalf of Illinois' Third Congressional District, home to  thousands of Ukrainians and…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688474/womens-history-month"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…allies for his perceived grievances with their  domestic politics and alleged movements away from ``democratic  values,'' while at the same time remaining silent on the brutal  dictators in Russia and Belarus who have never had a free or fair  election in the course of their tenure.\n\nPresident Trump gave his tip of the hat to autocracy last week when  he…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…is not the Department of War. It is the Department of  Defense. That is how Americans view our role in the world, to defend  ourselves and to defend freedom in a world with dictators and thugs who  would subjugate us all if they could.\n\nGod stop us if we become the thug, if we become the dictatorship that  uses our economic and military strength to bully…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698929/greenland"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…foolish.\n\nMake no mistake, this rescission package is Project 2025 in action-- dismantling our institutions, silencing oversight, and handing U.S.  global leadership over to the dictators on a silver platter, leaving us  alone in the world.\n\nThis bill attempts to rubberstamp the Trump administration's illegal  actions, blocking funding already approved by…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Navalny.  Let's be clear. Putin is not the only dictator--and for the third time  I use the word ``dictator''--who is dancing today.\n\nLet's just take one example. For the dictators of Iran, this betrayal  is a bright light in a dim room. They want nothing more than a stronger  and resurgent and unchecked Russia because that brings them renewed  hope…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687987/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…courageous patriots such as Ahmed Albasheer in Iraq, the  people of Iraq will free themselves from Iranian domination for  independence, achieving stability with prosperity.\n\nDictators around the world are losing in the war of dictators with  rule of gun invading democracies with rule of law. War criminal Putin  is failing in Ukraine with Ukrainians inspired…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…against  narcoterrorists, then oppose this resolution. It is plain and simple.  If you stand shoulder to shoulder with MS-13, Tren de Aragua, and  Sinaloa Cartel, and the dictators who work hand in hand with them, like  Nicolas Maduro in this photo, then this resolution is for you. Vote for  it.\n\nWe know exactly where some of my colleagues stand. You…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…and enforce the Monroe Doctrine, or what we now  refer to as the Donroe doctrine. Appeasement never results in effective  deterrence.\n\nDemocrats' fecklessness has empowered dictators, emboldened  traffickers, and left Americans less safe. Peace through strength  works, and strong leadership matters.\n\nThe mission is stability in the Western Hemisphere…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698881/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…actually believed he should be removed from office.\n\nThere is an old Twitter post from President Biden that said: ``Trump  talks tough on Venezuela, but admires thugs and dictators like Nicolas  Maduro.''\n\nGuess what, Mr. Speaker.\n\nI think President Trump showed in actions, not words, that he was  determined to remove a drug lord, and that is what Nicolas…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699369/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "John James", "party": "Republican", "sentence": "…self-reliant.\n\nThis is about unleashing American energy. This is about reshoring and  reindustrializing American manufacturing. This is about reducing  dependence on foreign dictators and despots. For Michigan, it is about  harnessing the full economic potential of both of our great and strong  peninsulas.\n\nThe Securing America's Critical Minerals Supply…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699991/securing-americas-critical-minerals-supply-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…controls his people.  There is no free voting. He treats people poorly, and that is an  understatement.\n\nBut there are a lot of bad guys in the world. There are a lot of  dictators. There is a lot of socialism leading to starvation. It  doesn't mean that the United States should carelessly risk its blood  and treasure to go and topple every one of them.…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Of  course he does. Democrats want to weaken the President's ability to  enforce the law of the land. That is the wrong message to send to  hardened drug traffickers and to dictators.\n\nIt is interesting because, for years, Democrats were for holding  Maduro accountable. Senator Chris Murphy, a Democrat from Connecticut,  tweeted in 2019 that ``getting…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698571/venezuela"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Tom Barrack, history is being made  today for the repeal of the Caesar Act, giving Syrians a chance after  54 years of Ba'athist socialist dictatorship, a message to the  dictators in Tehran.\n\nFinally, enhancing security ties with European allies to defeat war  criminal Putin keeps American families safe at home.\n\nMr. Speaker, I encourage my colleagues…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697810/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…recession.\n\nOne hundred days of chaos in the White House, where Secretary Hegseth  texts war plans to journalists, and the administration belittles allies  while embracing dictators like Putin.\n\nOne hundred days of corruption, as billionaires like Musk and DOGE  take Americans' personal Social Security data and fired the employees  we need to process…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…They think it is going to help the climate. Democrats remain  the party of painful and punishing regulations. They remain the party  of never-ending dependence on foreign dictators for energy that we have  right here. Democrats want to continue the war on American energy, and  that is why they are going to line up today and oppose what President  Trump…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688189/energy"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…on American energy. He shut  down production, blocked development on Federal lands, and recklessly  drained our Strategic Petroleum Reserve, all the while begging foreign  dictators for oil. The result was skyrocketing prices and American  families clutching their wallets in fear.\n\nAgain, these are facts, Mr. Speaker, proven facts.\n\nThis budget resolution…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…moment, but in service of democracy.\n\nDemocracy is a fragile flower, and around the world, people look to  what we do to know what they should do. There are petty, tin-pot  dictators, authoritarians, and strongmen around the world who will  watch this video and be encouraged and think this is the way to silence  their critics.\n\nI can't image a Member…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692447/alex-padilla"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…the families who have lost loved ones, and to the people  of our hemisphere who have suffered under his criminal regime, this  action sends a clear message: Narcoterrorist dictators are not immune  from consequences, and the United States will not stand by while our  citizens continue to be poisoned and murdered by the Maduro regime.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698883/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…demonstrated will do more to       shore up American power and world peace than all the best       speeches President Obama ever made.\n\nPresident Trump has made it clear to dictators around the world that  if they try their hands at making mischief, there will be consequences.  And I can guarantee that the illegitimate heads of the governments of  Nicaragua,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…and streamlines refinery regulations.\n\nMr. Speaker, it is simple: When America produces more energy, we pay  less at the pump. That means that we don't have to beg foreign  dictators for oil.\n\nIn fact, experts are already predicting a decline in gas prices as we  move through the summer months. Usually, they go up because the summer  fuels are more expensive.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692964/taking-a-step-toward-true-energy-dominance"}]