[{"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…I am utterly disgusted that President Trump would refute this  absolute truth.\n\nI am equally horrified by President Trump's characterization of  President Zelenskyy as a dictator who does not want peace. I was with  President Zelenskyy just last week in Germany for the Munich Security  Conference. He is an honorable and earnest leader, a man who has…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…executive accounts or from other Federal agencies to  conduct these costly Venezuelan operations. From where? So now the  simple question: How much did it cost to capture the dictator of  Venezuela, Maduro, and his wife?\n\nI ask, Mr. President, how much money and exactly from which accounts?  Give me the specific numbers and accounting titles from which…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…President pardon a drug-trafficking former President of Honduras?\n\nThis is not about drugs. This is about regime change and control of  Venezuela's resources.\n\nNicolas Maduro is a dictator, and you don't have to defend him to  recognize a simple truth: Venezuela does not pose an imminent threat,  and a war will do nothing to make America safer.\n\nWe are sleepwalking…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698448/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…struggling to make every single dollar stretch.\n\nMs. PRESSLEY. Mr. Speaker, they are struggling to make every dollar  stretch because of the harmful policies advanced by your dictator in  chief. Vote ``no.''", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689838/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…right now, and Congressman   Steve  Cohen will also have remarks for the Record.\n\nI will begin briefly, and then I will yield to my fellow Congressman  from Illinois.\n\nChina's dictator Xi was recently at the historic military parade that  fellow dictator Vladimir Putin celebrated in Moscow. The purpose of the  celebration was to honor the anniversary of…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…President wants to dictate what the policies will be and  expect everybody to live happily thereafter. If we want true peace,  then, Mr. President, you have got to cease to be a dictator and become  a negotiator. You have to talk to the Palestinians and get their  opinions about what they want, and you have got to decide that you  cannot side with one side…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…our allies in Europe?\n\nIt is sick. We are standing with dictators and against our allies. I  never thought I would see the day when our President would be a puppet  for a dictator.\n\nTo my Republican colleagues: Did you ever imagine that you would be  in a party that stands on the side of dictators or on the side of a  country who has killed journalists,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687904/putins-merciless-war"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…doesn't  have the votes in Congress, and he doesn't have a legal agenda, so he  wants to ignore the law.\n\nWe should not be surprised by this. Trump said he was going to be a  dictator on day one. He told us this is what he was going to do. I  personally don't know of any dictators who stop being a dictator on  their own.\n\nWe have got to fight back, and…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690635/trumps-first-100-days"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…to stand up to him.\n\nHe wants to take Greenland. He wants to make Gaza a resort. The  President has to understand that he is not a king. He is not the  emperor. He is not a dictator. He has awesome power, but he doesn't  have the power to just go around people and take what he wants. He  doesn't have that kind of power, and we can't let him have that…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…in the history of the United States. They are trying  to give him a jet plane.\n\nIt is humiliating for the American President to be flying around in a  plane created by the dictator, the theocratic monster of Qatar, while  they are collecting billions of dollars. His son-in-law, Jared Kushner,  has gotten $2 billion from Saudi Arabia.\n\nThis is totally…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…your parents' care  deserves an audience, but because you belong everywhere. You deserve to  live and thrive and to take up space.\n\nThe Halls of Congress don't belong to a dictator. They belong to you.  Childhood should be a birthright, but today in America, it is a  privilege afforded to the few and not the many. I will fight for you  like you are my…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700186/state-of-our-union-is-traumatizing-our-children"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…happening to this country is  going to cause us to dissolve into something that we have been  fighting. We are already at the point of having a person who is maybe  less than a dictator but an authoritarian, we are getting close.\n\nWhen the President controls one side of the aisle that has a  majority, the Republicans in the House, when a President controls…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…same month, Donald Trump, the President of the United States,  standing facts on their head, called Volodymyr Zelenskyy, the leader of  Ukrainian democracy, an unelected ``dictator,'' and incredibly, spewing  another blatant falsehood, blamed Ukraine for starting the war.\n\nIn this month, in perhaps the most shameful statement from an  American President…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688107/marking-third-anniversary-of-unprovoked-russian-invasion-of-ukraine"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…of  the law.\n\nI believe that, if we do not take immediate action, this  authoritarian President will devolve the country into authoritarianism.  I believe he is a would-be dictator who would become a dictator.\n\nI today announce that, later today, I will bring these Articles of  Impeachment to the floor, and I will call for a vote. I believe that  the…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692829/government-of-the-people-by-the-people-and-for-the-people"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Americans.\n\nYet the President is talking about wanting to cut deals with Russia  for economic development. I don't see the logic in going half way  around the world to deal with a dictator--a murderous dictator, by the  way--like Vladimir Putin. At the same time, we are damaging  relationships and cutting off trade with our closest allies right here  in North…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…the most successful law enforcement  operation in history.\n\nYour hypocrisy is clear, as you chant and you lead your no kings  protests, but when it comes to taking down a dictator, you crawl into a  corner. You curl up, and you start to cry about it.\n\nThis is about your base having protests to free Maduro. This is about  appeasing your far-left friends.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…stok[ing]  fear and tear[ing] communities apart.''\n\nSenator Ruben Gallego said ICE exists ``to scare the American  public.''\n\nSenator Mark Warner equated ICE officers to a brutal dictator.\n\nSenator Dick Blumenthal accused ICE of spreading ``lawlessness and  recklessness.''\n\nSenator Alex Padilla accused ICE of ``indiscriminate violence.''\n\nSenator Dick Durbin…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…be done; and America, Venezuela, and the world are much  safer as a result of it.\n\nOperation Absolute Resolve was conducted for one reason: to bring to  justice a murderous dictator and an indicted drug trafficker. Maduro is  an outlaw, and he is now in custody. The Trump administration indicted  him in 2020 on drug trafficking charges. President Trump…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698571/venezuela"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "Mr. COTTON. Mr. President, today is a great day in America. Nicolas  Maduro--an indicted drug trafficker, an illegitimate communist dictator  who has the blood of hundreds of Arkansans and thousands of Americans  on his hands--is behind bars in a prison in New York. Again, he was an  illegitimate communist dictator,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…united and to  remember who we are dealing with in the form and person of Vladimir  Putin.\n\nVladimir Putin is unrepentant. He is ever and will always be the KGB  agent. He is a dictator with decades of bloodshed on his hands. He is  the biggest thief in the history of the world, a war criminal who  should be behind bars at this moment. And, of course, Putin…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699095/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…in 1989. Without prior congressional approval, he  ordered 12,000 American troops into that country. We toppled Panama's  illegitimate regime. We apprehended the country's dictator, and he  spent the rest of his life in foreign custody.\n\nLet's compare these two cases. In both cases, you had the leader of a  country who is indicted by the U.S. courts…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696118/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…conflicts and terrorism to this day.\n\nLibya is still highly unstable, and the conflict constantly threatens  to reignite. Like Saddam and Qadhafi, Maduro is unmistakably a  dictator. He  is a bad guy. He suppresses freedom of speech. He controls his people.  There is no free voting. He treats people poorly, and that is an  understatement.\n\nBut there are…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…Venezuelan people.\n\nNicolas Maduro is a narcoterrorist and international drug trafficker  whose actions led to the addiction and deaths of many Americans. He was  an illegitimate dictator who held power through stolen elections and  horrific violence against the people of Venezuela. The Biden  administration imposed a $25 million bounty for his arrest and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698694/venezuela"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…member of  this body in the thirties, would I have seen what was coming?\n\nAnd, in recent days, I have been chilled when watching a parade in  Beijing where Xi Jinping, the dictator of the PRC, assembled the  leaders of North Korea, Iran, India, and other allies of theirs to  watch a parade of state-of-the-art weaponry. It reminded me of similar  moments…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…took on that day to do  what no other political administration in the world had ever  contemplated as remotely possible: to remove and exfiltrate for  prosecution a ruthless dictator whose direct involvement in  narcoterrorism has led to the death of scores of Americans and other  allies' citizens.\n\nPlease don't take my word for the nature of Maduro's…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "Mr. McCLINTOCK. Mr. Speaker, there is much to unpack from the arrest  of Venezuelan dictator Nicolas Maduro. Above all, there is the stark  contrast between the American socialists who are bitterly denouncing  the ouster of this socialist dictator and the masses of…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698660/lessons-from-caracas"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…Europe becomes more likely if we withdraw.\n\nStrong support for the Baltic Security Initiative is a vote for  deterrence. It is a vote to stand by our allies and to oppose a  dictator who is invading his neighbors.\n\nMr. AUSTIN SCOTT of Georgia. Mr. Chair, may I inquire as to how much  time is remaining.\n\nMr. BACON. Mr. Chairman, I stand 100 percent opposed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695259/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…It is an American law. Does anybody in their right mind-- does any sane individual who can read in our country--believe that it  applies to the security forces of a foreign dictator or a foreign  President; that if their guards have machineguns, they are guilty of  breaching a 1934 U.S. law? What kind of world would we live in if we  could accuse people…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…million Russian casualties. He may have at one time been a  successful KGB torturer, but he is a failure at today's attempt to  overrun his neighbor by force.\n\nThe Russian dictator is actually breaking records for his inability  to achieve battlefield gains. Since 2024, his most significant  offensives have scraped a meager 16 yards to 75 yards of ground…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699762/9999"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…to the floor today to add my  voice to the many who are commending President Trump as he works toward  peace in Ukraine.\n\nThe President recently gave the aggressor, Russian dictator Vladimir  Putin, every chance to put down his guns and end the killing. He has  done that over and over, but our President is now showing that he will  not wait on Mr. Putin…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690223/ukraine"}]