[{"senator": "Joe Morelle", "party": "Democrat", "sentence": "…this corrupt provision that I actually  voted against it last week. I look forward to hearing my colleagues on  the other side of the aisle try to explain why they did not.\n\nMr. MORELLE. Mr. Speaker, I need to say, as someone who served on the  House Rules Committee for 4 years, that we clearly could have put on  the floor and made in order an amendment…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696924/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…to live together as brothers,'' he said. I would  add: and sisters.\n\nWe must all learn to live together as brothers and sisters, or we  will perish together as fools.\n\nI did not know Mr. Kirk. I don't believe I have ever met him. I meet  a lot of people, so I may have, but I don't believe that I have.\n\nHere is what I know about him: He was a human being.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Donald  Trump? It is just absolutely amazing.\n\nMr. Speaker, I have a little less than a minute left in my time. I  would ask my colleague across the aisle one simple question: Did Mr.  Donald Trump ask him to run a showerhead bill today on the House floor?  If my colleague across the aisle cannot answer a simple question about  why we are running legislation…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698563/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…connection with the GOP tax scam that callously and unnecessarily  imposed a $10,000 cap, wiping away thousands of dollars a year for  hardworking American taxpayers. Republicans did that.\n\nMr. Speaker, let's set the record straight. Mr. Speaker, there are  people in this Chamber claiming to be saviors. Saving what? Saving from  the devastation that Republicans…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…clothes and  clothe you? When did we see you sick or in prison and go to visit you?'  '' When did we do this? And He said: ``Whatever you did for the least  of these, you did for Me.''\n\nMr. Speaker, I came to Congress looking to do for the least of these  as well as every American, but Congress' priorities this year have not  been that.\n\nCongress bent over…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…whom  are working for a living. Just give us a little bit of a sense of the  enormity of the consequence that this ultimately would bring to this  country.\n\nMr. MURPHY. I did.\n\nMr. MURPHY. Will the Senator yield?\n\nMr. MURPHY. There is so much similarity between the debate that you  are forcing this Senate to have tonight and the debate that we were…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…rule XV, I  rise to provide notice my intent to offer a motion to discharge the  Committee on Rules from the further consideration of House Resolution  164.\n\nMs. PETTERSEN. I did, Mr. Speaker.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689702/notice-of-intention-to-offer-motion-to-discharge-committee-on-rules-from-further-consideration-of-house-resolution-164"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…can spare this heartache--literally, taking away people's  healthcare--is by extending the premium tax credits. So that is a  decision this body has to make.\n\nMr. WELCH. I did.\n\nMr. WELCH. Let me get that number for you but go ahead.\n\nMr. WELCH. Right.\n\nMr. WELCH. That is right.\n\nMr. WELCH. That is right; $37,000 a year, and there are 40,000 as you…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…the country, how many of you could only  work 12 days in July, August, September, and October and still have a  job and still get paid while you are out? That is what they did.\n\nMr. Speaker, the time has come to get this done finally, to make some  kind of an effort to reach a bipartisan solution and resolve this  crisis that was created entirely by…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…and we clothed you?  When did we see you sick or in prison and go to visit you?\n\nThe king will reply: Truly, I tell you, whatever you did for the  least of these, you did for me.''\n\nMr. Speaker, there are a lot of people in this country who are  hungry, who are sick, who are unhoused, who are strangers, and who are  imprisoned.\n\nThis year, Congress…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…battle to reclaim this continent to liberty. .  . . Here the Allies stood and fought against tyranny in a giant  undertaking unparalleled in human history,'' and they did it together.\n\nMr. Chair, these quotes and sacrificial deeds of our forebears  explain why I rise to express my deep opposition to this bill's  irresponsible and shortsighted exclusion…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693693/department-of-defense-appropriations-act-2026"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…free, fair elections. It is  just another page from the authoritarian playbook, and we must have the  moral clarity in this place to stand against it, just like our  ancestors did.\n\nMr. Speaker, I urge my colleagues to vote ``no'' on this bill and to  vote with moral clarity.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700017/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Jared Golden", "party": "Democrat", "sentence": "…of rule XV,  I rise to provide notice of my intent to offer a motion to discharge  the Committee on Rules from further consideration of H. Res. 432.\n\nMr. GOLDEN of Maine. I did, Mr. Speaker.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697677/notice-of-intention-to-offer-motion-to-discharge-committee-on-rules-from-further-consideration-of-h-res-432"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…only country making sizeable investments in K-12  classrooms across the country. The Qatar Foundation allocated $30.6  million to various schools around the Nation.\n\nWhat did they get, Mr. Speaker?\n\nWhat do you get for $30 million invested in our schools?\n\nIt is a clear act of anti-Semitism. Classroom maps where they funded  omitted Israel and instead labeled…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Anna Luna", "party": "Republican", "sentence": "…of rule XV, I rise to  provide notice of my intent to offer a motion to discharge the  Committee on Rules from further consideration of House Resolution 164.\n\nMrs. LUNA. I did, Mr. Speaker.", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689424/notice-of-intention-to-offer-motion-to-discharge-committee-on-rules-from-further-consideration-of-house-resolution-164"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…have daughters, 12 years old. Jocelyn Nungaray was 12 years old and was  heinously murdered by two people allowed to come and stay here  illegally. These are animals who did this.\n\nMr. PERRY. You are right, Chip. There are the good guys, and,  unfortunately, there are the bad guys; there just are.\n\nNo one would think--I will just try to put it in any…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…actually  been proposed and scored produces about 1.5 percent of GDP. The cuts we  have talked about are about 1 percent of GDP. You have a big 2.5  percent there if we both did everything.\n\nMr. Speaker, we are scheduled to borrow about 7.3 percent of the  economy this year. Does anyone see a math problem?\n\nWhy is it so hard around here to tell the truth? We…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…thank her for acknowledging that the life within  her was a baby. Women are fully capable of raising children and getting  an education at the same time. I know because I did it.\n\nMr. Speaker, I thank Congresswoman Hinson for her leadership on the  Pregnant Students' Rights Act.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699318/pregnant-students-rights-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…to vote on it. That is because they throw these things out and  get them scored. They controlled everything here 1 year ago, a couple  of years ago. You notice they never did them, Mr. Speaker. They pretend  this solves the problem.\n\nYou get 1.5 percent, Mr. Speaker, and you will have stagnated the  economy.\n\nMr. Speaker, you have already heard the discussions…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…and work together, we can get the job done and do a great  job for the American people. I share my good friend Ms. DeLauro's  opinion in this case, that is exactly what we did.\n\nMr. Speaker, I urge support for the bill and urge its passage. I urge  my colleagues to support this, and I yield back the balance of my time.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698749/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]