[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…the workforce  it needed to implement the largest expansion of veteran benefits in  recent history.  While use of those incentives has been overwhelmingly successful, VA  did make some initial missteps in oversight and utilization of the  awards for senior executives. These missteps were corrected during the  last administration. Despite what my colleague…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693968/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…did have a conversation with my staff and asked them to tell me why I  should and should not come over. We had that conversation, and I made  the decision myself. My staff did not make the decision, but I welcomed  their input. I came here to behave, as I did, and engage in peaceful,  silent protest--peaceful, silent protest.\n\nHowever, my colleagues caused…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700250/peaceful-silent-protest"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…proposed to overturn the damage done by Citizens United. I  introduced legislation, the Campaign and Election Accountability Act.  One of the things that Citizens United did was make it easier for  foreign nationals to funnel money into U.S. elections.\n\nThe Federal Election Campaign Act currently prohibits foreign  nationals from contributing to U.S.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…term. NAFTA was 20 years  old; it needed to be renegotiated.\n\nDonald Trump said: We are going to renegotiate it and make it a lot  better.\n\nGuess what. He did. He and his team did make it better.\n\nSo when it came to the Senate, my recollection is it came to the  Senate, and it passed by about 89 to 10. We can't get that vote on a  Mother's Day resolution…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…out of the way. We grow the best crops  in the world. We can compete with any country on Earth. Just don't make  our job more difficult by government action.\n\nThe tariffs did make it more difficult for these farmers, and they  told me as much.\n\nLast week's decision was a victory for America and a defeat for this  President. It was a victory for the…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700151/tariffs"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…That  is extraordinary. I am not going to sit here and claim that the entire  reason was the Bipartisan Safer Communities Act, but it was a big part  of the reason because we did make it harder for bad people to get their  hands on guns. We did deliver the kinds of services that are necessary.  You are seeing this downward trajectory, but let me just put…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…flexibility, tuition assistance incentives, and behavioral healthcare.\n\nEqually important, this bill capitalizes on the extensive work that  former Commandant, Admiral Fagan, did to make institutional changes to  address sexual assault and sexual harassment.\n\nOur coasties deserve better, and this legislation provides oversight  and the tools needed for the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694192/coast-guard-authorization-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…anchoring this very important Special Order hour.\n\nMr. Speaker, every 7 hours, a child is killed by gunfire in the  United States. Thus far in 2025, nearly 100 American children did not  make it to their 12th birthday because they were killed by gunfire.\n\nEvery single child lost is an unfathomable tragedy. Families are  destroyed, and communities are left in…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…half of the House Republicans' fiscal year 2026 appropriation  bills include bans on the Pride flag as well. I don't know what they  think this flag does. The Pride flag did not make me gay, and it will  not make DOD employees gay either.\n\nWhat displaying a Pride flag does do, however, is send an important  signal to LGBTQI+ people that they belong.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695261/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Speaker, it did take care of preexisting conditions. I wasn't  here then. It is something that Republicans should have fixed. They  should have fixed that. Other than that, it did not make healthcare  affordable.\n\nIn fact, the biggest complaint that my colleagues have had throughout  the course of the last few weeks about the enhanced premium tax credits…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…have implemented.\n\nProducers want to improve on that rate--and we continue to--but the  Biden administration and its Green New Deal allies tried to make it-- and, in fact, did make it--harder to permit the very gathering systems  that we needed to capture that natural gas. So they impeded our ability  to reduce emissions.\n\nInstead of supporting more…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688157/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…next year, not to  mention their proposed solution is just aimed at papering over the mess  that ObamaCare created because the facts are clear: The Affordable Care  Act did not make care affordable.\n\nAll of this seems like one elaborate attempt to save face. Well, it  is not working, and, more importantly, Americans are suffering. I  repeat: Reopen…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Senate  these days where there is such strong bipartisan support, so I am  grateful for that.\n\nRegrettably, even in the face of such overwhelming consensus, this  amendment did not make its way into the final version of the bill for  reasons I won't dwell on now. But, as my colleagues can attest, I am  not one to give up easily, and this issue is simply…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688807/cormick-and-mmcr-fettermanhagerty-kim-cormick-schumer-sullivan-fetterman-and-others-for"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Affordable Care Act--better known as ObamaCare--was as dubiously named  as the Inflation Reduction Act, which did not reduce inflation, just  like the Affordable Care Act did not make healthcare affordable.\n\nWhen ObamaCare was crafted, debated, and passed, Democrats refused to  work with Republicans to make it a bipartisan law.\n\nSo this failed experiment…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…wrote a major study saying: What  does obesity cost America?\n\nThat is not Republican or Democrat. It is just what we are. It means,  every time you say that, Mr. Speaker, did you make all the people who  make money off certain foods, off of certain healthcare, and other  things, nervous?\n\nWe came up with a number 2 years ago. It was $9.1 trillion of…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…these COVID credits temporary. They  could have made them permanent, but they chose instead to focus on  advancing priorities for wealthy Americans, which some of these they  did make permanent by subsidizing electric vehicles for politically  connected cronies to siphon off Federal dollars of the greenhouse gas  slush fund.\n\nNow, Democrats are uniting…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…side of the aisle is not something that I am used to hearing. It  is the Republicans who have led the fight against anti-Semitism on our  college campuses.\n\nMr. Speaker, we did make Democratic amendments in order in this rule.  If my colleague had submitted his amendment in a more timely fashion  and not just a few minutes before the Rules Committee met…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…guy; I am a car guy. I would  tease him every summer when we came back into session because he was  restoring a De Tomaso Pantera, and I would ask him: Doug, what progress  did you make on the Pantera this summer? He would hang his head and  say: Nothing.\n\nOn this playing Galaga with him, a little known fact about Doug  LaMalfa, he was a fierce competitor…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698729/9999"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Senate  these days where there is such strong bipartisan support, so I am  grateful for that.\n\nRegrettably, even in the face of such overwhelming consensus, this  amendment did not make its way into the final version of the bill for  reasons I won't dwell on now. But, as my colleagues can attest, I am  not one to give up easily, and this issue is simply…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688824/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…abuse that is occurring in this program.\n\nI also find it interesting that the Democrats voted twice to extend  these temporary enhanced premium tax credits but specifically did not  make these  premium tax credits permanent. They didn't do it. They had many  opportunities to make these permanent if they wanted to do that as much  as they say today, but…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…to do some designs. We have to say that you should be within  one plan for maybe 3 years, so there is an investment in helping you be  healthier. There are things we did in there to make it work. The bill  has been introduced. Yet, if you look at the total spend over the next  10 years, it is still $14.67 trillion as the baseline spending over the  next…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…to  have a prayer at reducing the national debt, even by a little, as a  first step.\n\nWhile this bill was not perfect--and, certainly, no piece of  legislation ever is--it did make important reforms that will help us  bend the curve of our debt trajectory.\n\nFor example--and Democrats opposed this--we implemented work  requirements for able-bodied adults…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}]