[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…described.\n\nThat may have been what the Congressional Review Act was like until  today, but after today, none of that is true any longer because of this  action.\n\nIt did not have to come to this. It did not have to come to this.  There were many ways around the procedural shortcut of going nuclear,  where a majority of the Senate shoves its view on the…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…why the people they elect to represent them always seem to have time  for the priorities of billionaires and big corporations but not enough  time for them.\n\nThat question did not come out of nowhere; it came from lived  experience. Hard-working Americans are doing everything right. They are  working longer hours. They are budgeting carefully. They are…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699113/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…pretty good job. I  never know what my next day will bring.\n\nI do know this: I will have my record show that I fought all the way  out. I didn't come to stay forever, but I did come to make a difference  while here on the great issues of our time.\n\nWhere do we stand? On H. Res. 939, 140 persons voted for H. Res. 939,  140 Members of Congress, not one…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "Mr. KELLY. Mr. President, we made a sacred promise to our veterans  that after their service, they would get the care and support that they  earned. That promise did not come with an expiration date. And as a  combat veteran myself, I take this responsibility personally on behalf  of Arizona's more than 500,000 veterans and veterans across the…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688446/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…throughout west Michigan.\n\nHattie Beverly, Teacher Extraordinaire: In 1899, Hattie became the  first African-American woman to teach in Grand Rapids Public Schools, a  feat that did not come without struggle.\n\nDespite her remarkable academic achievements, she faced resistance  from those who believed a Black woman should not teach White children.  Yet, she persevered,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Security for their daily  life needs.\n\nWe will remind them that Congress has a job to do and that we will  not concede the power of the people.\n\nI ask my colleagues, again: Why did you come here?\n\nThey made a lot of campaign promises. Perhaps while you are  campaigning you actually listen to some people. Perhaps what they heard  from people was, we are tired…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Americans, including older adults, all to       bankroll tax cuts for the wealthy. Thanks to our collective       advocacy, the vote to pass this dangerous budget blueprint       did not come easily, and we will make sure lawmakers know       that voting to enact these cuts would be voting to abandon       older Americans.\n\nThe National Alliance for Caregiving:…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…Lincoln signed  the Emancipation Proclamation, Union soldiers arrived in Galveston,  Texas, with the news that the last enslaved Black Americans were  finally free.\n\nFreedom did not come easily. It came slowly, unevenly, and at a  painful cost, but it came. Along with it, generations of Black  Americans began the long, unfinished journey toward full equality…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692430/2025-juneteenth-major-league-baseball-events-in-birmingham"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…years. Generations of  immigrants, workers, dreamers, and innovators have propelled California  forward and made it a beacon for the rest of the Nation.\n\nThose advancements did not come without challenges, and communities  across our State currently face threats to their livelihoods that  directly challenge our State's values.\n\nBecause of the Trump administration,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695175/happy-birthday-to-california"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Mr. Speaker, I rise today in strong opposition to this  rule and the underlying bill.\n\nAs a physician who spent 20 years saving lives, I did not come to  Congress to let healthcare be decimated by Congress. I came to fight  for my constituents who deserve to be able to see a doctor they trust,  afford their medication,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696685/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…community. Though  Jim has passed, his legacy and impact on his community will remain long  past our mortal lifetimes. I am reminded of Mark 10:45--``For even the  Son of Man did not come to be served, but to serve, and to give his  life as a ransom for many.'' Jim's life was one dedicated to serving  others in need, improving the lives of countless people…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696936/recognizing-the-life-and-memory-of-james-jim-neil-crain"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…We got lots of smug lectures from the other side. Guess what. On  January 3, 2026, not only did Donald Trump authorize land activity in  Venezuela, but his administration did not come to Congress beforehand.  We were not even the first group that he talked to after the attack on  Venezuela.\n\nI guess the best we can get from the current majority here is…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699359/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…discoveries have helped ensure the American  people are not held hostage by adversarial powers seeking to use energy  as a tool of coercion. The discovery of Prudhoe Bay did not come in a  vacuum. In fact, it was long known that the North Slope of Alaska had  oil potential. In the early 1900s, as the U.S. Navy began transitioning  from coal to oil-burning…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…The second is from Senator John Hoeven of North Dakota. His  resolution cuts about $7 billion in new natural gas taxes on energy  producers--$7 billion of new taxes. Where did it come from? It came  from the Democrats.\n\nThis tax on American energy hits American families who use the energy  to heat their homes. It was mandated by the Democrats' reckless…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688189/energy"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…to know what is the data of so-called special  interest aliens. These are suspicious-travel-pattern, illegal  immigrants coming into our country. We want to know: Where did they  come from? How did they get here? Where were they before? We want to  know all the data that we allegedly collected. Congress has a right to  know.\n\nWhy would DHS need Congress…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693077/special-interest-alien-reporting-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…of ethnic groups  who are doing better than the native born today, which puts a lie to  the idea that anybody is not succeeding in this country because their  ancestors did not come from Europe.", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}]