[{"senator": "Michael Bennet", "party": "Democrat", "sentence": "…voters were U.S. citizens.\n\nNow, even Kansas's Republican secretary of state, who championed the  bill when he was a State legislator, has warned against it, saying:\n\nIt didn't work out so well.\n\nI would say so. About 12 percent of the people who tried to register  couldn't.\n\nCompare those 30,000 Kansans who attempted to register and were  denied to…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690528/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…armed law  enforcement agents were directed to show up at her house on a Friday  night, late, knocking on her door, and they tried to intimidate her out  of testifying.\n\nIt didn't work, I am happy to report. The DOJ is also opening  investigations to intimidate other whistleblowers from speaking up and  to punish those who already have. The Department…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…some of the most overworked  and underpaid people in our country to ensure that the money that they  work so hard for goes to them and their families, not to someone who  didn't work for it.\n\nThe true purpose of this bill is not to protect tipped employees. The  true purpose is to make it easier to pay people less for their work and  to pay them less…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698963/tipped-employee-protection-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…form--you would be receiving a sentence for the crack cocaine that  would be 100 times that of powder cocaine.\n\nWhat happened as a result of it?\n\nThe result, I am sorry to say, didn't work. You would think, with  that kind of sentencing hanging over you, people would think twice. It  didn't work. As a result, more people were using crack cocaine after we…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693940/judicial-nominations"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…since the original Tri-Party Agreement between the U.S.  Government and those agencies that I mentioned. He claimed that he  would save $50 billion on cleanup. Guess what? It didn't work. It just  delayed the cleanup and cost taxpayers more money.\n\nSecretary Bodman, he inherited Secretary Abraham's unrealistic  promise, and he failed to address the fundamental…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695342/hanford-site-cleanup"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Speaker, diethylstilbestrol, or DES, is a drug that  was prescribed to pregnant women  between 1940 and 1971 to prevent miscarriage.\n\nAs early as 1953, there was evidence it didn't work. Nevertheless, it  was prescribed for decades because the FDA waited years to alert  doctors that something was wrong.\n\nSince then, we have learned DES is an endocrine disrupter…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693582/no-apology-from-food-and-drug-administration"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…corruption,  but  committee Republicans voted it down last night. They said that they  knew that it was corrupt but that there was nothing that could be done  and that the system didn't work.\n\nRepublicans are the system, and House Republicans promised a vote on  this next week as a standalone bill. There is no guarantee that the  Senate will act. In fact, they…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696698/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…between life and death, and Trump and our Federal Government  failed.\n\nAfter Katrina, we saw how inadequate FEMA can be sometimes. We saw  the disaster of government when it didn't work. Congress put in place  some measures to repeal and increase FEMA. One of those was you have to  hire an experienced administrator of FEMA, somebody who knows what they…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693655/tragic-storms-in-texas"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Social Security accounts are yours, and it is a sacrilege to do  anything to disturb them. You might think about President Trump; he  inherited all of his money. He didn't have to work.\n\nMr. Speaker, we have to do everything possible to protect Social  Security for the millions and millions of Americans who deserve those  earned benefits, and no one…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688636/social-security-benefits-are-your-hard-earned-benefits"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…actions. Let's not return to the old, failed playbook  of treating our counterterrorist administrations solely as a law  enforcement matter. We tried that for decades, and it didn't work. It  cost hundreds of thousands of American lives.\n\nMr. Speaker, I urge my colleagues to join me in protecting Americans  by opposing this resolution.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698238/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…night--her job was a  bartenderess--what she thought about these programs in which you would  get a benefit, not only if you didn't get married, but an even larger  benefit if you didn't work too hard. She said she got married before  she had a baby, but a lot of her friends preferred not to get married  before they had a baby because they got free college. In…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…should have taken him seriously. They wrote it off as just talk. They  excused Hitler's provocative behavior, saying: He is just saying these  things.\n\nWell, we know that didn't work out too well. Last month was the 80th  anniversary of the end of World War II, the Nazi regime. One of the  centerpieces of the Nazi regime was to kill the Jewish people.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…insane--you believe we can  just borrow forever, you are a monetarist, but even the fragility in  the monetarists, you saw in the previous few years of inflation that  their model didn't work. Also, in addition to that, we are going to pay  the interest. In 9 years, baseline under a favorable interest rate  model, 30 percent of all U.S. tax receipts go to interest…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…haven't achieved that objective yet, and you are not going  to. We did the same thing twice, so I am not saying that we have clean  hands over here. You guys did it on DACA. It didn't work there. It is  not going to work here.\n\nThe only people who have suffered have been the American people, the  people whom we are all here to serve.\n\nLet's keep the focus…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Mr. CRANK. Mr. Speaker, my colleagues on the other side of the aisle  have a choice to make.\n\nThey thought it was cute to defund the police. That didn't work out  for  cities like Portland, Seattle, and St. Louis.\n\nThen they thought it was cute to ignore our border. They allowed  millions to storm America. Many were sex traffickers,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692194/los-angeles-protests"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…saw during the  COVID shutdowns how he would come up with one crazy scheme after  another because he was jealous that Andrew Cuomo was getting all the  attention. That didn't really work for him either. This is literally  the first time anything he has ever done has gotten him the attention  that he so craves.\n\nIndeed, while his poll numbers are still…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…conservative. He was warm, kind, and principled. In  my mind, he was exactly the kind of leader that Americans want. He is  going to be dearly missed. I feel robbed that I didn't get to work with  him more, and I will keep him and his family in my prayers.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698669/protecting-healthcare-for-millions-of-americans"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…malicious. It was all made up. It was all a  lie. Yet Gemma even generated fake links to fabricated news articles to  support the defamatory claim, and, of course, the links didn't work.\n\nThis marks a catastrophic failure of oversight of an AI model that  has been downloaded by more than 200 million people. So last week, I  sent a letter over to Google's…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}]