[{"senator": "Paul Tonko", "party": "Democrat", "sentence": "…significant mental health  challenges, and his family struggled along with him, fighting with  insurance companies to get him the care he truly needed.\n\nThe insurance companies didn't know the Timothy that I knew. Where we  all saw an extraordinary little guy in a fight for his own life, the  insurance company saw expenses in a ledger book. They put caps on…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692435/timothy-oclair-and-mental-health-parity"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…Perhaps these positions were eliminated as an oversight. Perhaps  these hardworking, passionate civil servants were merely line items on  a budget to some cost-cutter who didn't know any better.\n\nThat is why I rise today to give voice to these cuts, to put faces to  these draconian measures, and to plead with my colleagues across the  aisle and with…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689637/protecting-and-serving-our-firefighters"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…bringing people  together.\n\nLast night, one of my constituents from Albuquerque, NM, shared with  me that she had been furloughed as a Federal employee. She told me she  didn't know how she was going to pay this month's bills without a  paycheck. She felt that President Trump was doing nothing to end the  shutdown, and she didn't know how she could…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…community project funding  to police departments across America, victim rights organizations, and  others receiving those grants. They have not been able to explain it.  They didn't even know it was happening.\n\nOf course, they unleashed DOGE on the Department of Justice and  hundreds of millions of dollars in State and local law enforcement,  victim assistance,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…not be able to show up to  school ready to learn and how it would impact their learning experience  and their school environment.\n\nI spoke to families who told me that they didn't know how they would  be able to afford healthcare once their Medicaid is cut, once the  effective date kicks in. We talked to many constituents about how they  would be able…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695039/better-is-possible"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…organization that does budget analysis says that they are  going to add trillions to the debt. The only people who don't are the  gentlewoman from North Carolina. I am sorry. I didn't know that you do  independent budget analyses, but every other one does.\n\nThere is one Republican in this House who is not afraid of Mr. Trump  and that is Mr. Massie.\n\nLet me…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…spending will slash  the Medicaid Program and threaten to discontinue lifesaving, safety-net  services in many communities.\n\nThirty-eight national parents organizations--I didn't know there were  38  national parents organizations. But they wrote in a chorus of  conviction:\n\nCuts on this magnitude would require enormous changes--such       as instituting…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…have pointed out  that: No, this is about wokeism, and it has a direct impact on  reconciliation, reconsideration, and inquiries of resolution. Those are  three Rs that I didn't know about.\n\nI had to explain to my daughter when she said: Do you mean your  granddaughter won't see these programs?\n\nI said: Well, I went to  Jim Himes on the Permanent Select…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693050/defunding-sesame-street"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the largest ever cut to food assistance and will strip healthcare from  16 million Americans, all while adding $3.3 trillion to the debt.\n\nMr. Speaker, some Republicans didn't even know what was in the bill  when they voted for it. Yet when they had the chance for a revote 2  weeks ago, because they screwed it up the first time, they voted to cut  Medicaid…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…anti-Semite, even  after he clearly had evidence that he was, Mr. Martin continued to  legitimize and validate the views of this man.\n\nMr. Martin's weak protests that he didn't know anything about what  his views really were were debunked not only by National Public Radio  but by the record of Martin's involvement with other extremists.\n\nFor example,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…time with diagnosis was       easy. My mom's a doctor, so we caught it super easy, which       was very lucky. Kids that don't have that same chance--I knew       a kid who didn't know, his parents had no idea it could be a       possibility and he got super sick. When he woke up in the       morning, he had to get evac'd out and had brain damage. He…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693470/recognizing-ms-abby-lachman-for-her-dedicated-medical-research-advocacy"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…coverage.  That is just a fact based on the math that they put out publicly and  voted on today.\n\nSo I thank my colleague for the opportunity to do my first colloquy.  I didn't know this was a thing that we could do. Thank you for giving  me that opportunity, and I will let you finish us out.\n\nMs. CORTEZ MASTO. Thank you, the great Senator from Michigan.…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689544/h-con-res-14"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…those of us who voted for the money, and that is people  on both sides of the aisle, voted for the money to be distributed by  the Department of Justice to local grantees didn't even know about  this. I shared with the chairman and with all the members of the  committee, the one name of the DOGE employee, an unelected bureaucrat,  a juvenile bureaucrat…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…pardon one of  the biggest drug dealers who was killing Americans, Juan Orlando  Hernandez. The last time, the gentleman said that he hadn't spoken to  the President and didn't know why.\n\nMr. Speaker, if he is so interested in stopping drugs, maybe he could  have and should have had a conversation.\n\nLet me just tell you something about drugs, how much…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Depression, and  my father was born in 1925. He would have been 100 years old in  September. He was just old enough to remember when the stock market  crash happened. He didn't know what was going on. He was 4.\n\nHe remembered how his father one day owned an apartment complex, a  newspaper, and a nightclub, and the next day lost everything due to  circumstances…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…billion was the amount the  Federal Government improperly paid last year. We paid some bills two or  three times. We paid the wrong invoices altogether. We paid invoices we  didn't know we paid because there was no tracking mechanism.\n\nIf only, Mr. Speaker, there was a bill to require the Department of  the Treasury to ensure accuracy and eligibility in…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692480/accountability-and-transparency-in-government"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Nearly half of all enrollees--that is, 12 million people--didn't even  file one single medical claim, not even a prescription, all year, last  year. It sounds like they didn't even know that they had insurance  through ObamaCare, but those insurance companies were subsidized,  almost half of them, on the exchanges.\n\nIf Democrats think that is not a problem,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…the ability for Alaska Natives to get their Native  allotment.\n\nWell, guess what. A lot of these guys and a few women were overseas  serving their country in Vietnam. They didn't know. There was no  internet, no cellphones, right? So they got home. They weren't treated  well because they were Vietnam vets. Let's face that. They weren't  treated well because…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Mr. BEAN of Florida. Mr. Speaker, let's go back to the year 1919. We  had just 48 States. World War I had just ended but we called it the  Great War because we didn't know there was going to be another. Charlie  Chaplin had just released a short silent film called ``Sunnyside,''  before talking pictures would be all the rage. In this very…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699733/happy-106th-birthday-to-hazel-womble"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "Mrs. FEDORCHAK. Mr. Speaker, I am happy to be here today as a  freshman Member. I didn't know Doug long, but I met him on one of our  first days in the orientation sessions and the planning sessions for  Congress. He was warm. He was friendly. He was helpful to a…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698669/protecting-healthcare-for-millions-of-americans"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Chair, I really appreciate the hard work of the gentlewoman  from Colorado (Ms. Pettersen) on this issue. She is a leader in  Congress on substance use disorder.\n\nI actually didn't know the story of my friend from Colorado's mother.  Certainly, when someone is touched by an issue, they certainly become  passionate about it. I greatly appreciate her passion…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…we appreciate his support and many, many, many  others.\n\nSo a big thanks. This has been a multiyear process for my staff, a  personal goal. I was raised on whole milk. I didn't know there was  anything except whole milk, and I always wondered why all of a sudden  our youth weren't drinking any milk.\n\nAnd just many of us prefer the taste of it, and guess…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697062/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…not be so successful.\n\nI have also seen the same thing with Hmong in my district. I have a  substantial Hmong population from Laos. These people came to America  and  didn't even know English when they were children. Nevertheless, they  have come here, and now they all own houses. Their children are doing  well. Their families are strong. Again, this…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…of people who weren't using their health insurance  went up significantly. It wasn't like people were getting hurt or sick  at a similar rate. What was happening was they didn't know they were in  the system. As part of the GAO study will explain, they were getting  signed up.\n\nThe last final piece that I will highlight here are the income caps.  People…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…including ``the ravages of late-stage capitalism,''  ``structural privilege,'' and her own ``cis White mobility privilege.''\n\nMr. Speaker, most Americans, including myself, didn't know what that  meant until reading this.\n\nShe wrote about the ``politics of representation,'' and, of course,  ``toxic masculinity.''\n\nShe also wrote about herself, about one…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693722/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…and  her husband, Mark, and attempting to kill State Senator John Hoffman  and his wife, Yvette.\n\nI am absolutely devastated by this terrifying act of violence. While  I didn't know Melissa Hortman personally, her reputation was that of a  very dedicated public servant who cared deeply about our shared State  and its peaceful people. I heard equally…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692860/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…having strong  families, succeeding in the realm of education, and all seem to have  jobs. This despite the fact that when they came here from Laos, again,  many of them didn't know the language. It, again, shows it is a lie for  any of these DEI professionals--be they in business, government, or  education--to say that America is not a place where…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…sound absurd? Absolutely.  It is absurd. It is craven. It is cowardice at its best, and it is  dishonest because a rule of the House is preventing a law from being  obeyed. I didn't know we could pass a rule to prevent a law from being  obeyed.\n\nWhen the emergency powers were granted to the President in 1966, the  Emergencies Act was meant to constrain the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…that would stay with him throughout his life.\n\nWhen Elder Childs was first appointed pastor of St. Clara's Church of  God in Christ in Kingston in 1969, he admitted that he didn't know if  he was ready. Yet, he was called to serve his community, which he has  done faithfully for the past 56 years.\n\nIn 1961, he married Dorothy Neal, and the two of them…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694021/recognizing-cornwall-cleanup-crew"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…your  stomach--when I was a resident in Los Angeles is when the HIV epidemic  came out. And all of these men--they were all men--20 to 30, came in  with something that we didn't even know what the disease was. We didn't  have a way to diagnose it. So we called it the Acquired  Immunodeficiency Syndrome. And they all died. They all died.\n\nAnd I remember…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691544/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}]