[{"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…and his  colleagues pioneered breakthroughs that impacted biochemistry around  the world, leading to all kinds of developments to keep our bodies  healthy, from nutrition and diet to advanced drugs, to, really, so much  more.\n\nI share my grandfather's story because it demonstrates why the NIH is  so essential. As the world's premier biomedical research…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688264/national-institutes-of-health"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…centuries, Hawaiians have relied on these plants for a variety of  essential purposes, including as staple foods like taro (kalo) and  breadfruit (`ulu), which were central to their diet and agricultural  system. These plants also provided medicinal benefits, with species  like `a`ali`i (hopbush) and mamaki (pipturus) integral to the holistic  health practices…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688920/supporting-the-designation-of-april-2025-as-national-native-plant-month"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Yesterday, the administration  released its Make America Healthy Again report. The report commended  the WIC program for its science-based approach to evaluating the health  and the diet of participants and working to improve them.\n\nUnfortunately, the report made no mention of the administration's  drastically insufficient budget request for WIC or the need…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…SNAP, she wouldn't be able to keep food on the table.\n\nAnother constituent, Catherine, is a veteran from Manchester who has  type 2 diabetes. She wouldn't be able to afford the diet she needs to  keep herself healthy without SNAP and fears losing her benefits could  put her life at risk if she is unable to manage her blood sugar.\n\nPeople across my district,…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692014/food-assistance-for-working-families-at-risk"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…blood pressure, which has led to  diabetes and strokes and heart failure.\n\nThen at 25, a man has a stroke, and half of his body is paralyzed  because of his salt intake, poor diet, or lack of exercise. Yes, they  are ignoring that light and that signal that says go to the doctor.  Something is out of balance.\n\nMental health is the very same way.\n\nAccording…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…basketball player. He was particularly healthy, but  he came from a family that had a history of heart disease and diabetes.  He did everything right. He lost weight. He watched his diet. Yet,  about a year ago, he woke up one morning feeling nauseous.\n\nNausea is not usually associated with heart disease. He thought he  had food poisoning, so they waited until…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692205/raising-awareness-about-mens-health"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…City, local nonprofits, the Centers for Disease Control  and Prevention, and the online grocery platform Mercato have partnered  to help thousands of low-income New Yorkers with diet-driven chronic  diseases purchase more nutritious food. The United Way of New York City  is anchoring one produce prescription project, Connect2Food, that  provides hungry people…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689401/end-hunger-now-with-innovative-ways-to-feed-hungry-people"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…knowledge and compassion to these meetings and often showed  her unique talent of being able to quickly learn the names of everyone  in her meetings.\n\nSupported by her afternoon Diet Cokes, Alison assisted with many of  my key legislative priorities over the past few years. She worked  diligently to support the implementation of my Pregnant Workers  Fairness…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695684/recognizing-alison-cohen-and-her-service-to-the-us-house-of-representatives"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…that Congress had already voted to appropriate to go to the  American people.\n\nSome Republicans said let's do this once a month. That is not an  exercise. It is like going on a diet once a month. Let's cut more money  out of the hands of the American people. It is not funny.\n\nI know people think that Congress is drama and theater, but it is not  theater…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "John Boozman", "party": "Republican", "sentence": "…BOOZMAN. Mr. President, I am proud to join my colleagues in  emphasizing the importance of whole milk in a healthy school lunch and  taking Senate action to ensure a balanced diet for school-age children.\n\nI rise today in support of S. 222, the Whole Milk for Healthy Kids  Act. This legislation, as we discussed, would allow for schools  participating…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697061/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…the end the following new       paragraph:\n\n``(11) The term `produce prescription' means a service in       which the Secretary provides a benefit to a veteran who has a       diet-related chronic condition and is food-insecure or refers       such a veteran to receive a benefit, including a voucher or       debit card, for the purchase of fruits and vegetables…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699386/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…adding sugar to it.\n\nBut today's world, unfortunately, we eat from a box. We eat from a  sack, and that is not real food. We did not have any of these  ultraprocessed foods in my diet growing up.\n\nNow, I would like to talk a little bit more about eating, about  eating real food, and share the new nutritional guidelines released  yesterday by USDA, HHS, and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…healthiest--option  in the cafeteria.\n\nBringing whole milk and nutritionally equivalent beverages to schools  would help fight early onset osteoporosis, osteopenia, and other diet- related diseases by providing students with critical nutrients-- nutrients like calcium, potassium, and vitamin D--that we are all  lacking today.\n\nIt strengthens bones. It…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697062/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…through  small everyday choices. Taking care of our hearts doesn't require  drastic changes. It is about simple, constant, consistent habits:  staying active, eating a balanced diet, managing stress, and keeping up  with regular checkups.\n\nBeyond personal choices, Heart Health Month is also a reminder to  check in on our loved ones. Encourage family and…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688152/recognizing-heart-health-month"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…in 1970, and it has just gotten steeper. Part of it and part of my  conclusion is television, then moving to cable news, and then moving to  social media, we have crashed the diet of robust facts in our speeches.\n\nNow that we are going to make fun of ourselves, let's go on to the  next thing. Mr. Speaker, for anyone who asks, we have been running the…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…thank Mr. Arrington for the yeoman's work he has done. He  stood tall and he stood strong.\n\nFor those who are watching on TV and for those listening, we have  gotten a steady diet of the same old, worn-out tactics: rich, poor,  divinity politics, taking food from hungry children. They haven't used  granny is going over the cliff yet, but I assume that…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688063/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Colorado Springs is becoming an economic titan of the  West and a destination for global brands.\n\nMr. Speaker, I am personally very excited for easier access to my  favorite drink, Diet Coke, right in my hometown.", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698080/welcoming-swire-coca-cola-to-colorado-springs"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…JOYCE of Pennsylvania. Mr. Speaker, I rise in support of the  Whole Milk for Healthy Kids Act of 2025.\n\nWhole milk needs to be offered in schools as part of a healthy  childhood diet. This Congress, I am proud to be an original cosponsor  of the Whole Milk for Healthy Kids Act to bring whole milk back into  schools.\n\nAs a doctor, I recognize that as a source…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698187/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…offered in school cafeterias, giving our  students the option to choose the milk that they want to drink.\n\nMilk is an essential building block for a well-rounded and balanced  diet, offering 13 essential nutrients and numerous health benefits.\n\nUnfortunately, out-of-touch and outdated Federal regulations have  imposed restrictions on the types of milk…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698178/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…and the nutrients that whole milk provides due to out- of-date regulations that limit the type of milk that students can drink  at lunch.\n\nAs a doctor, I know how important a diet that includes whole milk is  to ensure that our Nation's kids have the building blocks to build  strong bones, strong muscles, and strong brains.\n\nEven the CDC agrees that whole…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691745/nippon-steel-and-us-steel-merger"}]