[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Finally, H.R. 1919, the Anti-CBDC Surveillance State Act, would  immediately halt and prohibit the United States from exploring the  potential benefits of a central bank digital currency (CBDC). This bill  would stifle innovation at the Federal Reserve as they research and  develop ways to meet the evolving money and payments landscape, keeping  the U.S.…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694254/9999"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…of the U.S. dollar  internationally. What do they do to hobble the dollar? They say the  Chinese Communist Party can have a digital yuan, the bitcoin bros can  have a digital currency, but America is limited to 1776 technology.\n\nOur banking system is the envy of the world because we innovate. This  bill says no innovation.\n\nMr. SHERMAN. Mr. Speaker,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693738/anti-cbdc-surveillance-state-act"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…Anti-CBDC Surveillance State Act. At the expense of U.S. global  economic leadership, this misguided legislation would prevent the  Federal Reserve from issuing a central bank digital currency, also  known as a CBDC.\n\nUnfortunately, the facts surrounding the development of CBDC have  been obscured by disinformation, conspiracy theories, and extreme  political…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693737/anti-cbdc-surveillance-state-act"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…blockchain is an exciting technology. It is new  technology that can be used for data storage and helping AI to analyze  major issues. In addition, it could be in the digital currency form.\n\nThe next section also instructs that the FTC shall report to Congress  on its efforts to address unfair and deceptive trade practices related  to tokens, also known…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693413/consumer-safety-technology-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…knowing about it and being in control.\n\nH.R. 1919 would immediately halt and prohibit the United States from  any research and exploration of the benefits of a central bank digital  currency, or CBDC. A central bank digital currency is essentially a  digital version of the dollar, issued by the Federal Government, that  uses crypto technology known as blockchain…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693736/anti-cbdc-surveillance-state-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…In a money market mutual fund, all customers       receive the same prevailing interest rate and enjoy equal       redemption rules.                        central bank digital currency\n\nThe CBDC Anti-Surveillance State Act oddly places its       specious talking point in the bill's title. The bill would       bar the government from establishing a central…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…digital future that protects  freedom and financial privacy.\n\nAt the center of that effort is the Anti-CBDC Surveillance State Act.  This bill ensures that no central bank digital currency will be created  under the Federal Reserve. We have seen what that looks like in  Communist China where the CCP uses it to track, monitor, and control  their people, but…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693727/anti-cbdc-surveillance-state-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "Mr. DAVIDSON. Mr. Speaker, I am here today to talk about central bank  digital currencies.\n\nA lot of people don't necessarily know what a central bank digital  currency is, so we will start with a definition. A central bank digital  currency begins with the central bank. The central bank in the United  States is the Federal Reserve.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Reserve Act to prohibit the Federal reserve banks       from offering certain products or services directly to an       individual, to prohibit the use of central bank digital       currency for monetary policy, and for other purposes, as       passed by the House, as new matter at the end of H.R. 3633;\n\n(b) conform the title of H.R. 3633 to reflect the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…prohibits stablecoins  from being covered by FDI insurance.\n\nA robust, well-regulated stablecoin market eliminates any  justification for a government controlled Central Bank Digital  Currency, or CBDC, which jeopardizes Americans' access to freedom,  privacy, and apolitical private capital.\n\nThis is an important point for all of my colleagues on my side of…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693841/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…bills, including efforts to establish a clear market structure  for cryptocurrency and protect Americans' financial privacy by blocking  a surveillance-style central bank digital currency.\n\nLet me begin with the Defense appropriations bill. Chairman Calvert  and his team have, once again, delivered a strong, thoughtful proposal  that makes  strategic investments…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693549/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…problem.'' Nonetheless, Mr. Speaker, in 2022, in his  executive order on Responsible Development of Digital Assets, President  Biden sought to explore a U.S. central bank digital currency placing  ``the highest urgency on research and development efforts into the  potential design and development options of a United States CBDC.''\n\nPresident Trump understands…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693734/anti-cbdc-surveillance-state-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, the Biden administration  started us down the road of adopting a Central Bank Digital Currency  issued by the Federal Reserve without the consent of the American  people or their Representatives here in Congress.\n\nToday, we are saying no. We are not the Chinese…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693728/anti-cbdc-surveillance-state-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…in support of the Anti-CBDC  Surveillance State Act. This critical legislation aims to safeguard  financial privacy and freedom of the American people.\n\nA central bank digital currency may sound like innovation, but under  Federal control, it becomes a powerful and dangerous tool for  surveillance. This allows unelected bureaucrats to monitor and  potentially…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693527/congratulating-central-high-school-womens-softball-team"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…they are important. Frankly, while the GENIUS Act does address  retail CBDC, and it is an important concession because Democrats want a  surveillance state Central Bank Digital Currency.\n\nMr. Speaker, you are going to see that when we vote later on   Tom  Emmer's bill. They want that. Republicans are thankfully united in  opposing Central Bank Digital…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693835/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "Mr. EMMER. Mr. Speaker, after much debate, we can now codify  President Trump's effort to prevent the development of a central bank  digital currency, or CBDC, and ensure that the United States' digital  currency policy remains in the hands of the American people and not the  administrative state.\n\nI am proud to have…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693735/anti-cbdc-surveillance-state-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…offering that certainty and stability once again  for our economy to make America first. We are going to make the dollar  dominant once again, and we are going to lead on digital currency  payments.\n\nIt will increase, of course, the demand for U.S. Treasuries and move  us toward that dominant position we need to have in the financial  markets.\n\nI applaud…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693838/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…Minnesota, Whip Emmer's bill, the Anti-CBDC Surveillance State Act, a  bill I am proud to cosponsor. This bill would prohibit the Federal  Reserve from issuing a central bank digital currency, or a CBDC, to  anyone.\n\nI don't think the Federal Reserve has the authority to do this. In  fact, a cursory, simple review of the Federal Reserve Act shows that  the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693730/anti-cbdc-surveillance-state-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Federal Reserve Act to  prohibit the Federal reserve banks from offering certain products or  services directly to an individual, to prohibit the use of central bank  digital currency for monetary policy, and for other purposes, and ask  for its immediate consideration in the House.\n\nThe Clerk read the title of the bill.\n\nMr. HILL of Arkansas.  1919.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693731/anti-cbdc-surveillance-state-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "Mr. DAVIDSON. Mr. Speaker, central bank digital currency poses an  existential threat to western civilization. It is essentially, at its  heart, communist banking.\n\nElizabeth Warren, Sherrod Brown, and Democrats in the Senate…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693732/anti-cbdc-surveillance-state-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…Reserve Act to prohibit the Federal reserve banks       from offering certain products or services directly to an       individual, to prohibit the use of central bank digital       currency for monetary policy, and for other purposes. All       points of order against consideration of the bill are waived.       The amendment in the nature of a substitute…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}]