[{"senator": "Steve Cohen", "party": "Democrat", "sentence": "…coastal city of Sirte a ``red line'' that would result in       direct Egyptian military intervention.\n\nRussia and the UAE have rejected allegations that they       provided direct support for the Libyan National Army during       its westward offensives, while Egypt has framed its stance as       necessary for maintaining security along its border with…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…essential workers, the  majority of whom are women and women of color.\n\nThese care workers are certified nursing assistants, home health  aides, personal care attendants, and direct support professionals. They  provide skilled, often medically necessary care, from administering  medication to helping with daily activities like bathing, dressing, and  eating.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…recognize the outstanding  contributions that Mr. Eric Verosic has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690659/recognizing-eric-verosic"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…recognize the outstanding  contributions that Ms. Tyra Youngblood has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692457/recognizing-tyra-youngblood"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…recognize the outstanding  contributions that Mr. Travis Smith has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692197/recognizing-travis-smith"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…recognize the outstanding  contributions that Ms. Ruth Gavish has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691963/recognizing-ruth-gavish"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…recognize the outstanding  contributions that Ms. Lynn White has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691191/recognizing-lynn-white"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…recognize the outstanding  contributions that Mr. Jason Chase has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690800/recognizing-jason-chase"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…recognize the outstanding  contributions that Ms. Carol Noble has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help.…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690136/recognizing-carol-noble"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…recognize the outstanding  contributions that Ms. Jami Frazier has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690794/recognizing-jami-frazier"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…recognize the outstanding  contributions that Mr. Mike Phillips has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691726/recognizing-mike-phillips"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…recognize the outstanding  contributions that Mr. Harry White has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690669/recognizing-harry-white"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…recognize the outstanding  contributions that Ms. Tasha Phillips has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692158/recognizing-tasha-phillips"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…recognize the outstanding  contributions that Ms. Kay Hoffland has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691124/recognizing-kay-hoffland"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…contributions that Pastor Kenny Buzzie of Life Style Church has made to  our community in the aftermath of Hurricane Milton. In addition to  providing countless hours of direct support to neighbors and flood  victims, he helped coordinate the collection and distribution of  emergency supplies, meals and donated services to help those who needed  help.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690644/recognizing-pastor-kenny-buzzie"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…recognize the outstanding  contributions that Mr. Ronnie Hutton has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691912/recognizing-ronnie-hutton"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…recognize the outstanding  contributions that Mr. Sean Arnold has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691984/recognizing-sean-arnold"}]