[{"senator": "Al Green", "party": "Democrat", "sentence": "…he has done. I will not  allow his reputation to be tarnished without a fight to protect it. I  am going to do what I can to protect his reputation.\n\nSo we have the Director of National Intelligence on the call, on the  chat. The Director of National Intelligence and the Secretary of State  were on the chat.\n\nAgain, the Defense Secretary, the Vice President,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…still being perpetrated by  Kurt Olsen, who is the President's ``Stop the Steal'' lawyer now  working in the White House and on President Trump's decision to send  the Director of National Intelligence to Fulton County, GA, last month,  to seize paper ballots from the 2020 election--ballots that have  already been counted at least three times in three…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…application by a foreign mission with respect to the location,  expansion or replacement of a chancery, the Board consists of the  Executive Director of NCPC, the Director of the National Park Service  (or, if the President so designates, the Secretary of Defense, the  Secretary of the Interior or the Administrator of General Services) and  the three…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693426/introduction-of-the-district-of-columbia-board-of-zoning-adjustment-home-rule-act"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…but had I  been present, I would have voted no on rollcall vote No. 451, Motion to  invoke cloture on Executive Calendar No. 95 Joseph Kent, of Washington,  to be Director of the National Counterterrorism Center, Office of the  Director of National Intelligence. I missed the following votes, but  had I been present, I would have voted no on rollcall…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695340/vote-explanation"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…intelligence  community and, in turn, the security of the United States.\n\nFor months now, we have watched President Trump's administration, led  in this arena by his handpicked Director of National Intelligence Ms.  Gabbard, systemically undermine the men and women whose mission is to  keep this country safe. These are professionals who serve under  Republican…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…against a foreign adversary or threat. That is the law that he used  against Canada, and the reason he said was that fentanyl is coming into  Canada.\n\nLast week, the Director of National Intelligence testified before the  House Intelligence Committee. They released their annual threat  assessment listing all the countries that are threats to the U.S.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689376/cost-of-living-still-high"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Research, where I       remain today.\n\nHow proud I have been to work alongside titans of the       scientific community. Dr. Francis Collins, physician and       former director of the National Institutes of Health and the       National Human Genome Research Institute, led the NIH with       vision, dedication and hope. Dr. Anthony Fauci, physician and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Assistant Secretary of the Army.\n\n5. Calendar Number 355: Christopher Fox, of Virginia, to be       Inspector General of the Intelligence Community, Office of       the Director of National Intelligence.\n\n6. Calendar Number 359: Macon Hughes, of Texas, to be an       Assistant Secretary of Defense.\n\n7. Calendar Number 360: Philip Weinberg, of Virginia,…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696058/nominations-en-bloc"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…Colleagues who joined me in calling  for a report to Congress from the FBI and State Department, in  consultation with the Attorney General, Secretary of Defense and  Director of National Intelligence, on the death of American-Palestinian  Journalist, Shireen Abu Akleh. I send my deep condolences to the Abu  Akleh family for this terrible killing and…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699427/reintroduction-of-the-justice-for-shireen-act"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…straight-up lied. He said there was no  classified information on the chat, that he didn't share attack plans,  and that no troops were put in harm's way.\n\nThen, there is our Director of National Intelligence, who is  supposedly our Nation's most trusted, meticulous secretkeeper, who went  before the Senate to mislead, evade, and perjure herself. What a truly…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689418/reckless-incompetence-of-signal-chat-put-servicemembers-at-risk"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…crisis surrounding medical research in this country, created entirely  by this new Trump administration.\n\nTen years ago, I met with Dr. Francis Collins, then the Director of  the National Institutes of Health, the world's premium biomedical  research agency. I admired his work so much that I asked him what I  could do to help.\n\nHe said:\n\nIf you can…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698206/nih-funding"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…Abderholden for  her transformational leadership and advocacy for accessible mental  health services in Minnesota.\n\nDuring her 24 years of service as the executive director for the  National Alliance on Mental Health Illness Minnesota, she helped pass  over two dozen landmark laws that reshaped education, healthcare,  housing, and criminal justice to…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691125/recognizing-sue-abderholden"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…of loyalty. He later       reportedly pressured Comey to drop investigations into his       recently departed national security director, Michael Flynn,       pressed Director of National Intelligence Daniel Coats and       CIA Director Mike Pompeo to intervene in Comey's       investigation, and personally appealed to Coats and NSA head       Michael…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…risk.\n\nAll responsible must be held fully accountable, including through  removal or resignation from their positions. Secretary of Defense Pete  Hegseth, CIA Director Radcliffe, Director of National Intelligence  Gabbard, Secretary of State Rubio, National Security Advisor Waltz,  Chief of Staff Wiles, and Vice President Vance were among those  involved…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689228/responding-to-signal-chat-leak"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…Khanna in  imploring a full committee hearing for the House Armed Services  Committee with Secretary Hegseth and a full committee hearing for the  Intel Committee with Director of National Intelligence Tulsi Gabbard.  We absolutely and collectively all must have the oversight and the  understanding of what is going on in Venezuela and the attacks in the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697807/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…PROGRAM.\n\nSection 844 of the Homeland Security Act of 2002 (6 U.S.C.       414) is amended by adding at the end the following new       subsection:\n\n``(b) Office of the Director of National Intelligence       (ODNI) Intelligence Community Civilian Joint Duty Program.--      The Secretary shall require all components of the Department       that are members…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696795/dhs-intelligence-rotational-assignment-program-and-law-enforcement-support-act"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…nominee today  approved.\n\nLet's consider Bradley Hansell to be Under Secretary of Defense for  Intelligence and Security.\n\nMr. Hansell is a former Green Beret, Senior Director on the National  Security Council staff, and has previously received bipartisan  support. He will be responsible to exercise the Secretary of Defense's  authority, direction, and…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691405/motion-to-discharge-s-res-195"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…was involved in numerous local civic,       business, and charitable organizations, including serving as       president of the Ocean County Bar Association, a director of       the First National Bank of Toms River, a member of the Dover       Township Board of Education, and a co-founder of the Garden       State Philharmonic. He was also National Commander…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…actors can exploit vulnerabilities in routers to infect users'  computers, access their information, or disrupt their network.\n\nNational security agencies, including the Director of National  Intelligence, the Department of Justice, and the Department of Homeland  Security, have reported on the threat posed by vulnerabilities in  routers and how some Chinese…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690156/removing-our-unsecure-technologies-to-ensure-reliability-and-security-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…vetting vulnerabilities.\n\nI asked then-Director Wray about the program's national security, and  I asked the same, this year, of Director Patel of the FBI.\n\nThis year, Director of National Intelligence Gabbard told my office  an important data point: Of the more than 100,000 Afghan evacuees, as  of August 2022, 1.6 percent had links to terrorism or other…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697333/national-security"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…RESEARCH AND DEVELOPMENT COORDINATION.\n\n(a) In General.--The Secretary of Energy (in this section       referred to as the ``Secretary'') and the Director of the       National Science Foundation (in this section referred to as       the ``Director'') shall carry out cross-cutting and       collaborative research and development activities…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688989/doe-and-nsf-interagency-research-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Department of Energy;\n\n(6) the Department of Agriculture;\n\n(7) the Department of the Interior;\n\n(8) the Department of Health and Human Services;\n\n(9) the Office of the Director of National Intelligence;       and\n\n(10) the Small Business Administration.\n\n(d) Designations.--The Assistant Secretary shall--\n\n(1) not later than 120 days after the date of the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Assistance Program.--\n\n``(1) In general.--The Secretary, in consultation with the       Secretary of Transportation, the Secretary of Commerce       (acting through the Director of the National Institute of       Standards and Technology), the Administrator of General       Services, the Administrator of the Environmental Protection       Agency, and appropriate…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…the educational resources and modules established under       subsection (a) is factually accurate and current, including       by consulting with--\n\n``(A) the Director of the National Institute of Standards       and Technology; and\n\n``(B) the Advisory Working Group established under       paragraph (2).\n\n``(2) Advisory working group.--\n\n``(A) Establishment.--The…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699206/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…self-proclaimed realists warned again of regional  conflagration if the President intervened alongside or even supported  Israel's strikes.\n\nThe President's own--his own--Director of National Intelligence  traveled to Hiroshima to record a bizarre video, not as a warning  against Tehran's nuclear ambitions but presumably against American or  Israeli operations…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692870/9999"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Calendar No. 279, Brent Ingraham, of Virginia, to       be an Assistant Secretary of the Army\n\nExecutive Calendar No. 283, George Wesley Street, of       Virginia, to be Director of the National Counterintelligence       and Security Center\n\nExecutive Calendar No. 285, Peter Thomson, of Louisiana, to       be Inspector General, Central Intelligence Agency…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695696/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…communication as reasons for       continued participation in modeling challenges.\n\n(b) Definitions.--In this section:\n\n(1) Director.--The term ``Director'' means the Director of       the National Science Foundation.\n\n(2) Federal laboratory.--The term ``Federal laboratory''       has the meaning given such term in section 4 of the       Stevenson-Wydler Technology…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…the Department of Justice  inspector general. Both inspectors general substantiated vetting  failures that I have raised for years.\n\nRecently, I was informed by the Director of National Intelligence  Tulsi Gabbard of new information. My office has been told that of the  more than 100,000 Afghan evacuees, as of August 2022, 1.6 percent had  links to…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693254/afghan-evacuees"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…policies.                    Report on Director's Initiatives Group\n\nThe Committees direct that, not later than 30 days after       the date of enactment of the Act, the Director of National       Intelligence shall provide to the Committees a briefing on       personnel matters of the Director's Initiatives Group, which       shall include: (1) a list of…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698262/explanatory-statement-for-the-intelligence-authorization-act-for-fiscal-year-2026"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "Mr. BABIN. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 3679) to require the Director of the National Institute of  Standards and Technology to develop resources for small businesses in  utilizing artificial intelligence, and for other purposes, as amended.\n\nThe Clerk…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700127/small-business-artificial-intelligence-advancement-act"}]