[{"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…and chew gum.\n\nWe have to fight fentanyl, but we also have to respond to the  devastation and respond to the uncertainty and the pain that is created  by the tariffs that do directly attack the middle class.\n\nAll we are asking in this moment, if these tariffs are so harmless to  the American people, well, let's prove it. Allow the bipartisan group,  the…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689471/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…after the Revolutionary  War. Thousands of Shays' Regulators marched on the Springfield Armory,  hoping to seize its weaponry and force a change of government. The  rebellion directly influenced the delegates at the Constitutional  Convention later that year, with James Madison citing it as a warning  for the need for a stronger federal government.\n\nThe…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694730/recognizing-the-50th-anniversary-of-the-springfield-armory"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…struggling to support their families, and forced to navigate a system  that moves far too slowly for the urgency of their lives.\n\nAcross our district offices, our caseworkers hear directly from  veterans who are desperate for answers about their claims and appeals.  In many cases, a timely VA decision could change a veteran's life. Yet,  even after waiting for…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699209/veterans-law-judge-experience-act-of-2025"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…workers who protect  consumers or do critical safety or health research, you will make us  less safe and costs will go up.\n\nMr. Speaker, this administration's policies will directly lead to  costs going up for all families. Americans deserve better.", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688637/the-actions-of-this-administration-will-actually-raise-costs-for-every-american"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…something to address the growing  healthcare crisis in this country.\n\nLet me be clear at the outset that when we talk about the CRA that  the clerk just reported, it is not directly related--it is not the tax  credit issue that has been the subject of an enormous amount of other  debate and, frankly, action in the House but a CRA that will be voted  on…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698976/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…preferential treatment for developing African countries,  AGOA promotes U.S. strategic influence and democratic values, as well  as economic prosperity. Eligibility under AGOA is directly tied to the  progress by these developing African countries on market reform, rule  of law, labor standards, and human rights.\n\nThe conditionality of this trade preference…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…extraordinary spectacle. It is the spectacle of a President of  the United States trying to stonewall and stall the disclosure of a  file from the U.S. Department of Justice that directly implicates him  and others in places of power after boasting to the American people  that he would reveal everything. He promised again and again and again  that he would…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694635/9999"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…chips fall where they may. It is the right thing to do.\n\nEveryone involved in assisting Jeffrey Epstein in running an  international trafficking organization or involved in directly  purchasing access to young women through Jeffrey Epstein or directly  abusing young women proffered by Jeffrey Epstein--every single person,  let the chips fall where they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…a union may have helped them  achieve the dream that they have of serving, as well as being able to  take care of their families. Many of us are recipients indirectly or  directly because of unions.\n\nCollective bargaining isn't a privilege, Mr. Speaker, that can just  be signed away. It is a fundamental right. When working people have a  voice on their…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697997/protect-americas-workforce-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…was the primary  motivator.\n\nAnd 3, it is extremely important for us not to allow history to be  rewritten so what happened then will happen again.\n\nSo I want to start most directly with what we all share, and that is  an incredible appreciation for the Capitol Police. They showed up that  day. These are folks who oftentimes have to commute an hour and…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698518/anniversary-of-january-6"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…somebody on the other side, from the private  sector or something of that nature on foreign affairs. The diplomats  and representatives from the State Department and people directly from  the administration don't come before our committee.\n\nNo matter what your position is, this is about the United States  House of Representatives doing its duty and responsibility.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…mining will contaminate the water and the  habitat in this priceless wilderness.\n\nThe BWCA is a huge reserve of the most pristine water in the United  States, so clean you can directly drink from its lakes or streams. This  water is under threat once again.\n\nIn 2017, the Obama administration applied for a mineral withdrawal of  the Rainy River Watershed--the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…Order hour along with  my distinguished colleague from Oregon (Ms. Bynum).\n\nFor the next 60 minutes, Members of the Congressional Black Caucus  have an opportunity to speak directly to the American people about  Black History Month, an issue of great importance not only to the  Congressional Black Caucus but to Congress, the constituents we  represent,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…could be used.       Although participation in the programs was voluntary, we       concluded that the actions substantially affected non-agency       parties because they directly determined whether interested       entities would receive funding under the programs, and, for       certain programs, imposed additional implementation and       reporting…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693338/us-government-accountability-office-legal-opinion"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…National Guard in Santa Ana have created a climate of fear,       anxiety, and instability across our community. These actions       are harming hardworking immigrant families, directly       jeopardizing public safety, and impacting the local economy.\n\nThe aggressive tactics used by federal agents have       shattered trust in law enforcement and are eroding…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…it will punish American producers, increase  reliance on foreign energy, and make life more expensive for America's  working families.\n\nWhile some claim this tax does not directly impact my home State of  Alaska, what is bad for American energy is bad for Alaskan energy.  Alaska holds over 100 trillion cubic feet of natural gas, and the  Alaska LNG…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688188/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…in the military, I know in the military we  get specific skills. We can be diesel mechanics. We can be all these  different things we learn in the military. Sometimes they directly  translate actually, but some others don't. It creates the opportunity  to reach out and find military members who are leaving the military and  who have specific skills for…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…cared for. In  addition to their weekly meal program, the Center runs a robust food  distribution service to combat food insecurity. Volunteers deliver bags  of groceries directly to targeted areas of need throughout the  community, ensuring that no one is left behind. They also host a large- scale monthly food distribution event in partnership with…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691893/recognizing-shawn-woodruff"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…I thank the gentlewoman for  having us tonight to talk about this important issue.\n\nOver the August district work period, I traveled throughout coastal  Virginia and heard directly from the people I represent:  servicemembers, shipyard workers, working families, and aerospace  leaders. I saw firsthand how the One Big Beautiful Bill Act is already  beginning…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694795/promises-made-promises-kept"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…good news for her.  Very shortly, there is going to be legislation to allow that, to permit  the mining and processing here in the United States of America. I am  going to go directly to my good friend and colleague from New Mexico to  help sponsor that with me because she is right. Let's do it here. Let's  mine here, Mr. Speaker. I am going to give her…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…step  in the right direction to prevent bad-faith actors from taking  advantage of U.S. surrogate mothers and the children they bear.\n\nI am proud to champion legislation that directly benefits Utahns and  families across the country. We have strong families. We have strong  communities, and these bills reflect our dedication to supporting them.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…gas production in  America, and in doing so, it punishes American families.\n\nThe golden age of American energy is the foundation of our golden age  for America. It is linked directly to the prices that we pay, to the  technology we use, and to the world we live in. Republicans are not  going to allow the sticky thorns of redtape to entangle American  energy.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688189/energy"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…just for families in my district,  but for the families across the country, as well.\n\nHouse Republicans have heard these concerns and responded with  legislation that will directly help more Americans achieve the dream of  homeownership.\n\nInstead of throwing more taxpayer dollars at ineffective government  programs, we are restoring housing affordability…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699812/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…respectively, and moving such       subparagraphs, as so redesignated, two ems to the left;\n\n(5) in the matter preceding subparagraph (A), as so       redesignated, by striking ``directly provided'' and inserting       ``whether directly or indirectly provided''; and\n\n(6) in subparagraph (I), as so redesignated, by striking       ``; and'' and inserting a period.…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688931/united-states-research-protection-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…business-focused event with members of the Salt Lake  Chamber to discuss the One Big Beautiful Bill Act and other industry- related issues.\n\nDuring this event, I was able to hear directly from local  businessowners and stakeholders about how the One Big Beautiful Bill  Act and other Federal policies are impacting businesses in my district.  What I heard was…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694796/promises-made-promises-kept"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Mr. WILLIAMS of Texas. Madam Speaker, I yield such time as he may  consume to the gentleman from Missouri (Mr. Alford).\n\nMr. WILLIAMS of Texas. Madam Speaker, H.R. 5764 will directly give  small businesses the AI resources and tools for SBDCs across this  country. I urge my colleagues to support this commonsense legislation.\n\nMadam Speaker, I yield back…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699179/ai-for-main-street-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Service on the land where the Boys & Girls Club  currently operates.\n\nH.R. 1276 removes that restriction, which would, in turn, allow the  city of Paducah to transfer the parcel directly to the club.\n\nMr. Speaker, I thank Representative Comer for working with the  Natural Resources Committee to amend this bill during our committee's  markup to ensure that…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697651/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…to make their budgets simpler, more  efficient, and more flexible by consolidating budget lines. But they  can't do that under a full-year CR.\n\nPunting new appropriations directly contradicts--directly  contradicts--the Pentagon's stated goal of building a resilient, surge- ready munitions enterprise. The prohibitions on new program starts  under a…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…where  agriculture is the backbone of the local economy, where every dollar  spent at the co-op, in the grain elevator, and at the plants and  refineries that support it is directly invested back into the families  and communities that produce it.\n\nAuthorizing year-round E15 nationwide, a free market approach that is  American-made, benefits not only…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699304/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…energy workers, and small businesses. By  imposing burdensome land management policies, it undermines the very  communities that power our great Nation.\n\nH.J. Res. 104 aligns directly with President Trump's vision to  unleash American energy by removing regulatory barriers and  prioritizing domestic production. This resolution ensures our lands are  used…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694890/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}]