[{"senator": "Delia Ramirez", "party": "Democrat", "sentence": "As director of housing justice at the Shriver Center on Poverty Law  and now as the director of a tenant advocacy clinic, Eric uses  litigation advocacy to advance housing equity in Illinois and beyond.", "title": "Recognizing Eric Sirota", "date": "2026-01-14"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "OMB and  Director Vought continue to be deeply confused about the Constitution,  the rule of law, and foundational fiscal laws like the Antideficiency  Act and the Impoundment Control Act.", "title": "Senate Amendment to H.R. 4", "date": "2025-07-23"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "I am calling on acting CDC Director O'Neill to reject this  recommendation and protect our children.", "title": "Vaccines Are A Great Invention", "date": "2025-12-09"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "In 2020, an acting SBA director was named, and in 2021, the SBA  appointed a permanent, full-time career deputy director to stand up the  office.", "title": "Office of Rural Affairs Enhancement Act", "date": "2025-12-01"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "For over seven decades Edith has served her  church in several roles, including teaching Sunday School, serving as  Director of the Daily Vacation Bible School, holding memberships in the  local and national Missionary Societies, singing in the church choir,  serving as a deaconess, and teaching a manners class for young  children.", "title": "Recognizing Mrs. Mary Edith Brown Coleman's 109th Birthday", "date": "2026-02-11"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "But before the Senate could act on that bipartisan vote by the  Judiciary Committee, Erik Siebert was forced out of office, and he was  forced out of office because he refused to prosecute, to indict, former  FBI Director Jim Comey and New York attorney general Letitia James.", "title": "Trump Administration", "date": "2025-10-21"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "She continued her public service as  Director of Legislative Affairs at the White House Office of National  Drug Control Policy.", "title": "Recognizing Michele Manatt for Her Service to the George Washington University Graduate School of Political Management", "date": null}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "Margaret  Leinen, who is stepping down as director of Scripps Institution of  Oceanography and vice chancellor for marine science at the University  of California San Diego.", "title": "Recognizing Scripps Vice Chancellor Margaret Leinen", "date": "2025-05-06"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "Speaker, in light of the President's offensive and  cruel post about the tragic murders of director Rob Reiner and his  wife, producer and actress, Michele Reiner, I think it is important to  speak out.", "title": "President Trump's Offensive Post", "date": "2025-12-15"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "office, working primarily on Transportation and Infrastructure issues,  before becoming my Legislative Director in 2022.", "title": "Recognizing Andrew Heineman and His Service to the United States House of Representatives", "date": "2026-01-08"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Just this week,  the Director of the Office of Management and Budget, in a statement  that was both insulting and condescending, said that ``it wasn't in our  interest'' to release a full budget plan to the American people.", "title": "Protecting Regular Order for Veterans Act of 2025", "date": "2025-07-21"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Proposals to gut NOAA's funding by more than 25 percent, to decimate  the Office of Oceanic and Atmospheric Research would, as the former  director of that office said, take our scientific footing back to the  1950s.", "title": "Noaa Contributes to Our Economy and Well-Being", "date": "2025-05-15"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "We need to make his latest attack on public health--firing a CDC  Director, why?", "title": "National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "She  then spent four years with Congresswoman Kathy Castor as her  communications director, where she led the team during the COVID-19  pandemic and its aftermath.", "title": "Recognizing the Career of Erica ``rikki'' Miller and Her Work on Behalf of Michigan's 3rd Congressional District", "date": "2025-11-12"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "Sincerely,                                                     Jody Calemine,                                      Director, Government Affairs.", "title": "Empowering Employer Child and Elder Care Solutions Act", "date": "2026-01-13"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "Report on Director's Initiatives Group\n\nThe Committees direct that, not later than 30 days after       the date of enactment of the Act, the Director of National       Intelligence shall provide to the Committees a briefing on       personnel matters of the Director's Initiatives Group, which       shall include: (1) a list of personnel of such group from the       date of the creation of the group; and (2) funding sources       for personnel of such group.", "title": "Explanatory Statement for the Intelligence Authorization Act for Fiscal Year 2026", "date": "2025-12-17"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "He was our veteran engagement liaison  and the security director for several years.", "title": "Republicans Have Delivered in 2025", "date": "2025-12-17"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Prasad served as the Food and Drug  Administration's--FDA--Chief Medical and Scientific Officer and as the  Director of the Center for Biologics Evaluation and Research.", "title": "-9999", "date": "2025-07-31"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "I asked then-Director Wray about the program's national security, and  I asked the same, this year, of Director Patel of the FBI.", "title": "National Security", "date": "2025-12-02"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "(a) In General.--The Secretary of Energy (in this section       referred to as the ``Secretary'') and the Director of the       National Science Foundation (in this section referred to as       the ``Director'') shall carry out cross-cutting and       collaborative research and development activities focused on       the joint advancement of Department of Energy and National       Science Foundation mission requirements and priorities.", "title": "Doe and Nsf Interagency Research Act", "date": "2025-03-24"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "He earned his third and final star in 2022, becoming the director of  the Army's Rapid Capability and Critical Technologies Office, more  affectionately known as RCCTO.", "title": "Congratulating Lieutenant General Robert A. Rasch, Jr.", "date": null}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "Kelsi began working in my office 7 years ago, as a press secretary,  and quickly proved herself, moving up to communications director and  now deputy chief of staff for communications and policy.", "title": "-9999", "date": "2025-05-13"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "After his tenure as mayor, Corbett  served as the Executive Director of the Celina Economic Development  Corporation for ten years.", "title": "Recognizing Congressional Patriot Award Recipient Corbett Howard", "date": "2025-04-28"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "Athletic Director Kevin Dustin has also  been instrumental in fostering a culture of excellence at SLCC.", "title": "Recognizing the Slcc Cross Country Team", "date": "2025-04-10"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "Before joining Goodwill in 2016, he served as Executive Director of the  Hult Center for Healthy Living and as Vice President of Community  Investments at the Heart of Illinois United Way.", "title": "Congratulating Don Johnson on His Retirement As the Ceo of Goodwill Industries of Central Illinois", "date": "2025-06-27"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "Samuel Papenfuss,       Deputy Director of Budget Analysis.", "title": "Moving National Woman's Relief Corps Incorporation and Domicile to Illinois; Principal Office to Murphysboro, Illinois", "date": "2026-02-02"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "There he was part of the 2014 farm bill and later spent a  few months with Senator Lankford before serving as the director of  advocacy and government relations for the national FFA organization.", "title": "America is Back", "date": "2025-03-05"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "Whether she was operating in a role as communications director,  scheduler, or, ultimately, deputy chief, she has continued to be a true  mentor.", "title": "Recognizing Emily Tuttle-Millard", "date": "2025-02-27"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "I asked the FBI Director in a hearing: Have you looked at the  documents?", "title": "Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``National Petroleum Reserve in Alaska Integrated Activity Plan Record of Decision''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Buffalo Field Office Record of Decision and Approved Resource Management Plan Amendment''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Coastal Plain Oil and Gas Leasing Program Record of Decision''; Providing for Consideration of H. Con. Res. Denouncing the Horrors of Socialism; Providing for Consideration of H.R. Unlocking Our Domestic Lng Potential Act of Providing for Consideration of H.R. Researching Efficient Federal Improvements for Necessary Energy Refining Act; Providing for Consideration of H.R. Common-Sense Law Enforcement and Accountability Now in DC Act of Providing for Consideration of H.R. District of Columbia Cash Bail Reform Act of and for Other Purposes", "date": "2025-11-18"}]