[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…folks? They are not the 29-year-old sitting in his  mother's basement playing video games. They are restaurateurs,  beauticians, landscapers, mediators, chiropractors, funeral directors,  farmers, ranchers, freelancers, contractors, and gig workers, and now  they are stuck.\n\nAs open enrollment began and they opened their mail, they found that  their premiums,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…transparency around multiclass shareholder companies.\n\nFor annual shareholder meetings, companies will have to disclose the  true distribution of voting power of insiders, like directors or  executives, who hold more voting rights than their ownership share  would suggest.\n\nAn imbalanced power structure could limit other investors' abilities  to direct strategy…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693912/enhancing-multi-class-share-disclosures-act"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…needed to do  business legally and be part of the Mercado. This Mercado Night Market  has become a community staple for five consecutive years.\n\nShe also served on the board of directors for the Kids Discovery  Station, a museum dedicated to children and currently sits on the board  for the Merced Main Street Association.\n\nDuring her professional career,…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695992/recognizing-annissa-fragoso"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Owned and operated by the Riverbay Corporation, the Co-op City Times,  led by Rozaan Boone, editor-in-chief, and her team of reporters, covers  the work of the Co-op Board of Directors and the many organizations of  Co-op City, from the NAACP branch to The American Legion post and every  other group in between.\n\nThe Co-op City Times provides weekly news,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698631/recognizing-co-op-city-times"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…Curtis, over the course of his career, has served as president of  the Connecticut State Missionary Baptist Convention. He has served as  chairman of the Advisory Board of Directors of Norwalk ACTS, which is a  partnership of civic leaders. He has acted as the president of the  Norwalk NAACP, commissioner of the Judicial Selection Commission, and  when…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693739/welcoming-reverend-dr-lindsay-curtis"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…and  Theological Studies and a Doctor of Ministry. She continues to lead  community service through the North Carolina Council of Churches where  she serves on the Board of Directors, the Delta Sigma Theta Sorority,  and health advocacy networks. I am honored to recognize Rev. Dr. Della  J. Owens-Barber on her fourth anniversary as Senior Pastor at the…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697322/recognizing-the-dedicated-public-service-of-reverend-dr-della-j-owens-barber"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…a  community-based organization serving caregivers and older adults in  Minnesota. That call was a turning point for Ann and her father. She  went on to join the Board of Directors and ultimately became President  of the organization in 2015.\n\nDuring her 10 years as President, Ann reimagined DARTS' vision to  best serve individuals in the southeast…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689623/congratulating-ann-bailey-on-her-retirement-from-darts"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "Ms. CROCKETT. Mr. Speaker, I rise today to recognize Mr. Randall  Bryant, my constituent and the incoming Chairman for the Dallas Area  Rapid Transit (DART) Board of Directors. His selection as Chairman is  not only a testament to the agency's forward momentum, but it also  marks a milestone: Mr. Bryant is now the twenty-second board chair in…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696402/recognizing-mr-randall-bryants-selection-as-chairman-of-the-dart-board-of-directors"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…University and the Alameda County Office of Education.  Her dedication to public service further includes her tenure as an  elected official on the Zone 7 Water Agency Board of Directors.\n\nThe Naismith Basketball Hall of Fame has rightly recognized Michelle  Smith-McDonald as a trailblazer and visionary whose work has broadened  opportunities and raised the…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689730/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Station is owned by the federal government, and USRC, a  nonprofit, manages and operates the station under a lease with the  federal government. The members of USRC's board of directors are the  Federal Railroad Administration, Amtrak, the Federal City Council, the  District of Columbia and the USRC President and CEO. USRC is the only  entity exclusively…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689966/introduction-of-the-union-station-redevelopment-corporation-funding-eligibility-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…region's  priorities break through the noise.\n\nOn behalf of Rhode Island, I want to congratulate the New England  Council, president and CEO Jim Brett, the entire board of directors,  and all its members on a well-earned centennial. From working to  address our region's housing shortage and infrastructure challenges to  advocating for reliable and affordable…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696048/100th-anniversary-of-the-new-england-council"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…what they are: terrorism--part of a  violent, systematic effort, supported by the Israeli military, to  forcibly remove Palestinians from their land.\n\nAwdah worked with film directors Basel Adra and Yuval Abraham on  their Oscar-winning documentary ``No Other Land,'' which heroically  showcased the violence in the West Bank, enabled by Israeli forces.…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694532/awdah-hathaleen"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, I introduce a bill that would require  the Directors of two federal agencies, the Court Services and Offender  Supervision Agency for the District of Columbia (CSOSA) and the  District of Columbia Pretrial Services Agency (PSA),…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690239/introduction-of-the-requirement-of-the-director-of-the-court-services-and-offender-supervision-agency-for-the-district-of-columbia-and-the-director-of-the-district-of-columbia-pretrial-services-agency-to-reside-in-the-district-of-columbia"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…Additionally, as I was serving  as Mayor of Kansas City during this time, I had the pleasure of asking  Gerard to serve on the Mayor's Race Relations Task Force and on the  Board of Directors of the Mayor's Corps of Progress.\n\nFor the past nearly 24 years, Gerard has worked at Truman Medical  Centers (now called University Health), our area's safety net provider,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688302/recognizing-mr-gerard-j-grimaldi-on-his-retirement-and-expressing-appreciation-for-a-lifetime-of-dedicated-service-to-our-community"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…will retire at the end of March. With over 45 years in journalism, he  is leaving an indelible mark on the industry and our community as one  of the longest-serving news directors in all of New York State.\n\nRandy oversees WXXI's daily news operations across radio and digital  platforms, all while reporting on local issues himself. Over his  career,…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688914/recognizing-randy-gorbmans-retirement"}, {"senator": "French Hill", "party": "Republican", "sentence": "…(12 U.S.C.       1761b) is amended--\n\n(1) by striking ``monthly'' each place such term appears;\n\n(2) in the matter preceding paragraph (1), by striking       ``The board of directors'' and inserting the following:\n\n``(a) In General.--The board of directors'';\n\n(3) in subsection (a) (as so designated), by striking       ``shall meet at least once a month…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…of the Department of Defense       titled ``Memorandum for Senior Pentagon Leadership Commanders       of the Combatant Commands Defense Agency and DoD Field       Activity Directors'', dated September 22, 2021, (relating to       commencing Department of Defense actions and implementation       of the recommendations of the Independent Review Commission…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…that the media is getting the real story to amplifying Members'  priorities and offering advice to aspiring communicators, I can  guarantee that almost all of your comms directors have worked with  Lauren at some point in time.\n\nLauren is the Hill's number one expert in communicating our  Republican message to the American people back home, as well…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694933/recognizing-lauren-fine"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…Beach. There he continued his career in public service as the  mayor of Surfside Beach from 2016 to 2020. He also served  on the Surfside Beach Town Council, the board of directors for the  Horry County Council on Aging and the Waccamaw Regional Council of  Governments. He brought honesty and common sense to local government  and was loved by all.…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692819/recognizing-coastal-carolina-university-baseball-team"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…today to recognize the outstanding  contributions that Ms. Marie Bienkowski has made to our community  through her volunteerism as part of the Save Crystal River Board of  Directors. She has helped forge a path to secure more than $50M in  funding to meet the agency's original goal of restoring nearly 100  acres of waterways by the City of Crystal River's…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691243/recognizing-marie-bienkowski"}, {"senator": "John Carter", "party": "Republican", "sentence": "…has served on the Cedar  Park City Council, the Cedar Park Tourism and Advisory Board, and the  Planning and Zoning Committee. Additionally, he is a member of the  Board of Directors for the Williamson County Appraisal Board, where he  also chaired the Bond Oversight Committee. Driven by a passion for  service, Commander Lux was a founding member of American…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689344/saluting-the-service-of-commander-jon-lux"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Spartan Shield.\n\nMG Hamilton's retirement did not end his service. He continues to  train National Guard Division Commanders and staffs. In addition, he  serves on the Board of Directors for the Central Texas YMCA and the  Board of Governors of the Central Texas Community Foundation. For his  extraordinary efforts during and after service he was awarded the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689353/saluting-the-service-of-major-general-patrick-hamilton"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Virginia, to be General Counsel of the Department of Energy\n\nExecutive Calendar No. 161, Robert Gleason, of       Pennsylvania, to be Director of the Amtrak Board of Directors       for a term of 5 years\n\nExecutive Calendar No. 177, Sean McMaster, of Virginia, to       be Administrator of the Federal Highway Administration\n\nExecutive Calendar No.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695696/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…Southwest  Indiana.\n\nMr. Farabaugh is a member of the Automobile Dealers Association of  Indiana, where he has served as President and currently as a member of  the Board of Directors.\n\nMr. Farabaugh was nominated for this award by Marty Murphy, Executive  Vice President of the Automobile Dealers Association of Indiana. I  congratulate Mr. Farabaugh on…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690130/time-dealer-of-the-year-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…the outstanding  contributions that Charles A. ``Charlie'' Rogers has made through his  work with Habitat Tampa Bay Gulfside. Charlie Rogers has been on  Habitat's Board of Directors since July 2022. A lifelong advocate for  education and health, Charlie has brought that experience and passion  to Habitat as we continue to find solutions for affordable…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690164/recognizing-charles-a-rogers"}, {"senator": "French Hill", "party": "Republican", "sentence": "…beneficial owner of securities       with 5 percent or more of the total combined voting power of       all classes of securities entitled to vote in the election of       directors--\n\n``(A) the number of shares of all classes of securities       entitled to vote in the election of directors beneficially       owned by such person, expressed as a percentage…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693913/enhancing-multi-class-share-disclosures-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…and Food Fresh in Claxton, Georgia.\n\nBeyond his profession, Chris was a member of the Claxton community,  serving on the Claxton-Evans County Chamber of Commerce board of  directors for over 25 years. He played an instrumental role in forming  the Chamber Junior Board, served on the Claxton Downtown Development  Authority and the Georgia Food Industry…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691812/mourning-the-loss-of-chris-lane-gay"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…influential figure in the museum field. She has served on the board of  trustees of the American Alliance of Museums, played a leading role  within the Association of Art Museum Directors, and contributed her  expertise to organizations dedicated to the study of classical  antiquity and the history of glass. Through these roles, she has  strengthened professional…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697880/recognizing-dr-karol-b-wight-on-her-retirement"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…these programs and the willingness to  fix that, should that be Republican or Democrat, or should it just be  our attempt to do good governance?\n\nRemember, we are the board of directors for the biggest concern in  the world. It is malfeasance the way we run this place. Our rhetoric is  often completely intellectually vacuous. There are solutions.\n\nFor any…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…rights. She was also among the activists who were  instrumental in the renaming of West Broad Street to Martin Luther  King, Jr. Boulevard.\n\nMs. Pryor served on the Board of Directors of the Ralph Mark Gilbert  Civil Rights Museum and was the former grand marshal for the annual  Martin Luther King, Jr. Day Parade.\n\nMs. Pryor is survived by her two daughters…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}]