[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…has also made several public comments about the  potential for U.S. military forces to be used to remove Nicolas Maduro  from power in Venezuela. President Trump has even directed the seizure  of oil tankers in the region to apply pressure in Venezuela. As a  Member of Congress who voted against authorizing the disastrous Iraq  War, I believe that a…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698418/supporting-of-h-con-res-61-and-h-con-res-64"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…further       states that ``the good cause exception should be used in       appropriate circumstances in accordance with'' APA       requirements rather than ``sparingly,'' as directed in the       Richardson Waiver. The Policy Statement explains that the       ``obligations of the Richardson Waiver impose[d] costs on       [HHS] and the public, [we]re contrary…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…nuclear explosive  testing, Trump will trigger a dangerous nuclear arms race that would  blow apart the nuclear Nonproliferation Treaty. In fact, Vladimir Putin  has already directed his forces to prepare a resumption of nuclear  testing and, just this week, the Washington Post reported that China is  rapidly expanding and modernizing infrastructure at…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696948/opposition-to-explosive-nuclear-testing"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "Mrs. GRIJALVA. Mr. Speaker, since the beginning of his second term,  Donald Trump has directed an enforcement machine that is not only cruel  but unconstitutional, targeting longtime residents, law-abiding visa  holders, U.S. citizens, and even veterans who have fought…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697450/fighting-dhs-immigration-raids"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…about her  termination, she was called by Democrats to Congress. Then the Friday  night before the Monday she was to show up in Congress, armed law  enforcement agents were directed to show up at her house on a Friday  night, late, knocking on her door, and they tried to intimidate her out  of testifying.\n\nIt didn't work, I am happy to report. The DOJ…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "…It has been equally alarming to see that our veterans have not been  exempt from what we are all concerned about. In fact, if we look at the  mass firings that occurred, as directed by Elon Musk and his DOGE  effort, one-third of our Federal workforce is made up of veterans. They  have been at risk with those firings.\n\nWe know also that there are additional…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692955/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…put together a compromise.  So we passed the Bipartisan Safer Communities Act, which included a  landmark $14 billion investment, most of it in mental health, most of  it directed toward kids' school-based mental health, but there were  also significant investments in school safety--just hardening schools  to make it harder for a shooter to get inside…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…to instruct CBO to  conform to the way it originally scored the program.\n\nOn a bipartisan basis during the fiscal years 2023-2025  appropriations cycles, Budget chairs have directed CBO to score  appropriations language related to the Purchase Power and Wheeling  activities of three Federal Power Marketing Administrations consistent  with a 2000 bipartisan…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693857/hr-1"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…and then say: OK. I am  going to cut the program next year.\n\nBut the way they are doing things is mean and cruel and is having an  impact on people's lives.\n\nCongressionally directed medical research programs--I have worked  across the aisle with my colleagues. I have friends in here that have  worked with me on specific diseases in a bipartisan way. I…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…Capital Repertory Theatre, as she retires from her storied  career bringing the joy of live theater to patrons across the capital  region and beyond.\n\nSince 1995, Maggie has directed more than 125 productions, workshops,  and readings, helping to cement the repertory as a treasured  cornerstone of both the city of Albany and the wider theater community.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695332/recognizing-maggie-mancinelli-cahill"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…County  when she was appointed principal of Mountain View School in Goleta.  Over the next 17 years, she served as principal of Brandon, El Rancho,  and Ellwood Schools and directed the Goleta State Preschool. Throughout  her career, JoAnne centered the well-being and success of all students.  She introduced innovative enrichment opportunities--including…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698084/the-year"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…addition, I believe that the administration has sought from  secretaries of state throughout the United States information about  their voting rolls, which is specifically directed perhaps at electoral  interference.\n\nMr. REED. Well, I concur.\n\nIf I may raise one additional question?\n\nMr. REED. You have seen firsthand what is happening in Portland. It…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696343/trump-administration"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…defender of  Congress' power of the purse. His work has been especially important to  the Budget Committee, including oversight of Impoundment Control Act  reviews. He also directed the first-ever audit of the consolidated  financial statements of the federal government, an annual effort that  has significantly improved transparency and accountability.…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698464/commending-the-honorable-gene-dodaro"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Finance Committee, we both know how much our Nation needs to  continue to have interstate commerce and to have foreign commerce.\n\nSince the 1930s, Congress has enacted or directed the President to  negotiate trade deals, including authority to negotiate the agreements  and impose or adjust tariffs.\n\nBut I think these Presidents have used this authority…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689522/klobuchar-ms-murkowski-mr-warner-mr-mcconnell-and-mr2024"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…considers this year's NDAA amongst a steady stream of  alarming misuses of the U.S. Armed Forces by President Trump. While in  office, the President has issued unlawful orders, directed unlawful  deployments, and has unlawfully misused Congressionally appropriated  funds. President Trump has chronically abused his executive authority  as Commander in Chief,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Chair and the Ranking Minority Member,       speaking order shall be based on order of arrival,       alternating between Majority and Minority Members, unless       otherwise directed by the Chair.\n\nRule 6. Any witness who is to appear before the Committee       in any hearing shall file with the clerk of the Committee at       least three business days…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687982/us-senate-committee-on-rules-and-administration-rules-of-procedure"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…was expanded to its present size of 19.3 million  acres--an area nearly as large as South Carolina--and renamed the  Arctic National Wildlife Refuge. Section 1002 of ANILCA directed the  Department of the Interior to study the oil and gas potential of the  1.57-million-acre Coastal Plain, a designated area of ANWR that held  great promise of oil and gas…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…procedure, or       practice. There, the manual outlined procedures for SSA       employees to follow in processing and adjudicating benefits       claims. Because the manual was directed to and binding only       on SSA officials without imposing new burdens on claimants,       we concluded that the manual met CRA's third exception.\n\nIn contrast, rules that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Health       Service Act to treat an adult cancer is in effect and is held       by the same person submitting the application under paragraph       (1)(B); and\n\n``(bb) that is directed at a molecular target that the       Secretary determines to be substantially relevant to the       growth or progression of a pediatric cancer.\n\n``(B) Additional requirements.--…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…a President has is the determination of when to engage the  Armed Forces of our Nation. Such decisions can both cost and save  lives.\n\nThis past Saturday, President Trump directed our military to respond  to a growing threat that Iran could weaponize nuclear material and  deliver a nuclear weapon. With escalating tensions between our ally  Israel and…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693123/motion-to-discharge-sj-res-59"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…and small businesses should  be the ones being served by SBA offices, not illegal aliens in  sanctuary cities.\n\nLet's get serious. Let's put America first, like the mandate directed  to be done in November, the America First agenda led by President  Donald J. Trump.\n\nI urge my colleagues to support this legislation and vote ``yes'' for  H.R. 2931.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692100/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…throws,  high jump, long jump, tug of war, softball and foxtail throws and  others--that sometimes feature entire classrooms on the field.\n\nThe incredible day of sportsmanship directed by Mr. Wisler has  positively impacted thousands of students over the years--proving his  dedication to the students of North Hills and Sinking Springs  elementary schools.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690717/recognizing-brian-wisler"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…dangerous gap between America's  mineral needs and mineral production. Upon returning to office a year  ago, he signed three executive orders to help close that gap.\n\nThe first directed Federal agencies to correct or rescind regulations  that unduly burden domestic mining and instructed the Secretary of the  Interior to accelerate geologic mapping.\n\nA second…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…awareness for the       measles outbreak, publicly urging people to take it seriously       and emphasizing the critical role of the measles, mumps, and       rubella vaccine.\n\nHe directed the Centers for Disease Control and Prevention       and the Administration for Strategic Preparedness and       Response to work hand-in-glove with Texas health officials…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696063/texas-measles-outbreak"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…service.\n\nMr. EDWARDS. Mr. Chair, that is why I fought to include two  provisions that bring real oversight and real answers. First, the  United States Postal Service is now directed to report to Congress  within 90 days with a concrete plan to reopen and restore service,  including in western North Carolina. Second, the Postal Service's  Inspector General…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699044/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…scenarios, we sought to act as an ordinary       consumer would in attempting to make a successful       application. For example, if, during online applications,       we were directed to make phone calls to complete the       process, we acted as instructed.\n\nFor applications for plan year 2024, our covert tests       included fictitious applicants who…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…America.\n\nGovernor Kathy Hochul of New York welcomed in the new year by  declaring January as Muslim American Heritage Month. To red-blooded  American patriots' dismay, Hochul directed State landmarks, including  the iconic skyline of New York City, to be lit in the color Islamic  green.\n\nWhat makes the situation even worse is that One World Trade Center…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…our colleagues and  the American people have seen the tragic news out of my hometown just  yesterday. And I am grateful for their thoughts and their prayers this  morning directed toward the people of Louisville.\n\nFolks around our county, Jefferson County, need those prayers right  now and in the days and weeks to come. The death toll from last  evening's…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696544/9999"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…many of these responsibilities existed or were  relevant. This legislation ensures that NTIA has the right structure  and resources to fulfill its 21st century mission as directed by  Congress.\n\nToday's NTIA plays a key role in our effort to maintain global  leadership in wireless communications. NTIA has important statutory  obligations to manage Federal…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690256/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…Vladimir  Putin has turned this winter into a weapon. He has systematically  targeted energy sites, wiping out power and turning homes into  freezers. The results--specifically directed at civilians, directed at  mothers and children--have been deadly. Putin knows that he has failed  to achieve his objectives on the battlefield, so he continues trying to…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699762/9999"}]