[{"senator": "Kathy Castor", "party": "Democrat", "sentence": "…here is where we will yank  the curtain back on what this really is about. It is about everything  that this administration has done to serve the fossil fuel industry,  the dirty fuel industry, from canceling clean energy projects that  would help lower electric bills that would bring cleaner and cheaper  resources onto the grid, projects like offshore…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…of a  relentless, purposeful campaign to stoke fear among voters and sow  seeds of distrust in American elections. They have employed Federal  Agencies to help do some of the dirty work. In fact, President Trump  has weaponized several Federal Agencies against you, the voters. He is  using these Agencies as instruments to suppress your vote.\n\nThe Department…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…that they deserve so  much better than they are getting here.\n\nThis bill, H.R. 3628, amends the Public Utility Regulatory Policies  Act to four States to favor more expensive, dirty energy over cleaner,  cheaper energy. It is a ridiculous requirement that they want to add,  and it directly conflicts with the provisions in the law right now that  require…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697883/state-planning-for-reliability-and-affordability-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…health groups into the room.\n\nThey could say: Look, we want to have some consideration here. Let's  negotiate. But they didn't want to do that because they had this quick  and dirty, sneaky maneuver that they could pull off so they didn't have  to negotiate, they didn't have to legislate, and they didn't have to  use regulatory process. All those rules…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…give tax breaks to billionaires  but won't lift a damn finger to extend the tax credits that help ensure  people's health insurance premiums don't skyrocket.\n\nThis CR, this dirty CR, which does nothing to solve the healthcare  crisis, is one of the most immoral, unethical, evil things that I have  ever seen happen in all of my time in Congress. It is…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…victory for the American people.\n\nNot only is its formal office gone, but its downfall demonstrated the  strength of our unity. Americans rejected DOGE because they recognize a  dirty deal when they see one.\n\nNow, let us be clear: We want to address the national debt, root out  waste, fraud, and abuse, and build a government and programs that can  serve…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697304/ode-to-doge"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…schools, and municipal buildings.\n\nMake no mistake about it. Eliminating these standards is climate  sabotage. Overturning even a few of them jeopardizes that future. It  locks in dirty fossil fuel use. It worsens pollution in frontline  communities that are already burdened by asthma, heat, and high energy  bills. We cannot slam the brakes on progress just…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690527/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…facility. All of       that has changed.\n\nDiversity, equity and inclusion initiatives were scrubbed       away at the direction of this new administration, as though       they were dirty words. Donald Trump created the Department of       Government Efficiency and put Elon Musk at its head. In       record time, Musk moved from disrupting social media and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…GREEN of Texas. Mr. Speaker, and still I rise. I rise to call to  my colleagues' attention that they are no longer claiming that this is  a clean CR. The truth is that it is a dirty, filthy, and stealthy CR  that has been contaminated with millions of dollars for people who have  not earned it. They want to take it from the taxpayers of this country  because…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696678/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…industries we need to  rebuild, like steel and manufacturing and technology, we can give  American businesses the breathing room to compete and grow. When  foreign countries play dirty with unfair trade practices, tariffs can  be a productive way to respond to that.\n\nHere is the key: Tariffs have to be smart. When used correctly,  tariffs can defend American…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689098/understanding-tariffs"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…cruel, and  completely avoidable consequences you'll find.\n\nIt weakens our public school system and makes higher education more  expensive.\n\nIt gives sweetheart tax deals to dirty fossil fuel companies and  makes it cheaper for them to extract gas and coal from our public  lands.\n\nIt attacks our federal investments in clean energy, which will cost  over…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693153/one-big-beautiful-bill-act"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…past: our triumphs, our  failures, and the lessons that bind them together.\n\nThat is why the recent removal of the interpretive materials titled  ``Life Under Slavery,'' ``The Dirty Business of Slavery,'' and signage  addressing climate change should alarm every American.\n\nThese changes don't make us more patriotic. They make us more  ignorant. Let's be…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699714/rewriting-history"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…newspaper deliveryman and a car salesman. I once went to work with my  dad on a very early morning, delivering newspapers.\n\nHe said to me: You know, I hop up and down on this dirty truck every  morning so you don't have to.\n\nJust like my own father, Maynor worked day in and day out, hard and  long hours, to build a better life for his family.\n\nMiguel…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689022/9999"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Chairman, we know that the dirty water bill reduces  significant oversight for the Clean Water Act, and it is really  important to know that polluters are pushing to weaken this--not  residents, not families,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698042/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…economic race.\n\nAmerica can lead in the energy sector, but we cannot roll back the  clock to a former era when America became economically paralyzed due to  oil embargoes and dirty manufacturing.\n\nThree of the projects across our country for which funding had been  assured are from well-respected Ohio  companies: Libbey Glass, Owens-Illinois Glass, and…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691905/department-of-energy-project-cancelations"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…previous administration by  declaring a national energy emergency.\n\nYou know, I was in Seoul, South Korea, last spring. And one day, we  had clear air. The next day, it was so dirty that you couldn't see, Mr.  President, from where I am standing to where you are sitting. And I  said: What went wrong over 24 hours? And they told me the wind shifted  and…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…that Senator  Crapo and Senator Cassidy proposed, we voted on, and our Democratic  colleagues did not support it at all. We sure didn't vote for this  mess, what we call Dems' dirty ObamaCare bill. This is a disaster, and  it was sold under false pretenses. We need to do better for our  constituents who need access to affordable healthcare.\n\nWell, our…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697929/healthcare"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…designed, then it needs to go through  the Financial Services Committee.\n\nAlso, don't think, Mr. Speaker, that our opposition on this--being  China, for the most part--will not play dirty. What they do is when  they see any kind of mining project or processing facility considered  in the United States, they dump product onto the global market, driving  the price…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Biden--I call him ``O'biden'' because I think he is Obama's  third term--we had a shortage of truckers, Madam Speaker. This was  Washington bureaucrats trying to do California's dirty work. Don't our  bureaucrats here have enough work to do on their own?\n\nThis is a direct hit on our truckers. I know. I ran a small trucking  business for a short time. This…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690481/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…clean continuing resolution  so we can get our government open again.\n\nI do want to just explain to the American people and maybe some of  our friends in the media a little dirty secret that is going on down  here on the Senate floor. A lot of my Democratic colleagues are getting  frustrated, not with us--not with us. We have had three already cross…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696006/en-bloc-nominations"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…excitement for when it is their turn to garden. He  has helped instill a love of learning in students as look forward to  Garden Day when it is their turn to get their hands dirty and learn.\n\nIt is clear Robert ``Bob'' O'Brien has made a profoundly positive  impact on our community, and I am grateful for his service. May we all  strive to serve our communities…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691924/recognizing-robert-obrien"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…actually believed that, they would respect the fact that the  American people voted for this, that they voted for deportations. I  know that in the ``woke'' left world, that is a dirty word. It is not  where I come from, not in Missouri. People believe in common sense.  They don't think you should get to break the law like that and get away  with it.\n\nSo…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…world. It helps us, and it helps places like  India and sub-Saharan Africa, where many of their people don't have a  steady supply of electricity. Nobody can blame them for using dirty  coal and those Chinese technology plants, which are not as good as the  U.S. plants, because they want to make sure their people have a chance  at prosperity, as well.\n\nDOE…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694868/energy-and-water-development-and-related-agencies-appropriations-act-2026"}]