[{"senator": "Brian Schatz", "party": "Democrat", "sentence": "…important programs, and we are asking our diplomats and our partners to  navigate a riskier world with fewer resources. The cuts to humanitarian  assistance are especially disappointing, and they are the result of the  administration effectively shutting down the U.S. Refugee Admissions  Program, slowing assistance for those impacted by conflict, and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…things. That is why we need oversight, and the Senate Republicans are  nowhere.\n\nMeanwhile, the briefing we had, yesterday, with Secretary Rubio and  Hegseth was utterly disappointing. The administration walked into the  room totally empty-handed. They gave us no real answers about what the  objective is in the Caribbean. Hegseth also refused to give…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…peace or votes on affordability  or votes on the tariffs, we ought to have those debates on the floor.  They are always blocked. We can't talk about those things. It is so  disappointing and so sad, Mr. Speaker.\n\nThe bottom line is, it is not just Democratic amendments, but  Republican amendments, bipartisan amendments. Anything that might force  a real…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700195/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…to the people of Missouri as a result of the  all-out assault on Medicaid and then turned around and voted to cut  Medicaid from his constituents.\n\nIt is so shocking, so disappointing, so heartbreaking for many  Americans that a lot of people in the House of Representatives, Mr.  Speaker, and a lot of people in the Senate have talked a good game  about…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…all of my colleagues to vote ``yes'' on H.R. 1520.\n\nMr. Speaker, while I support this underlying legislation--and it is  important legislation--I have to say that it is disappointing to see  that my Republican colleagues are proceeding with this bill without a  CBO score. They are violating their own protocol, which requires a CBO  score before bringing…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692716/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…President Hernandez, whose government functioned as a criminal  enterprise. But President Castro insisted this was a priority,  including during her campaign, and it is disappointing that she and her  government did not do more to build public support to overcome  opposition in the Congress. Honduras' justice system has so far been  largely incapable…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696472/honduras"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…I close, Madam Speaker, I find it disturbing that  my-- The SPEAKER pro tempore. The time of the gentlewoman has again  expired.\n\nMs. BONAMICI. I find it disturbing and disappointing that my  colleagues seem to be more obsessed with what genitals are in people's  pants than whether they can afford their healthcare or housing bills.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698355/protect-childrens-innocence-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…critical  that we face the world with a unified front.\n\nThis bill was not an easy task to come by. We have, in my opinion,  and the opinion of many on my side of the aisle, a disappointing  reduction in top-line funding. The infrastructure needed to deliver  foreign assistance has, in many ways, including the illegal destruction  of USAID, been dismantled.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…sadly only the latest betrayal by the Republican  majority talking a big game about being profamily but blocking policies  that would actually support them. It is beyond disappointing. It is  cruel.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697966/expanding-access-to-ivf-for-military-families"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…to ensure that we maximize the efficiency of all of our energy sources,  including oil, gas, and coal. More efficient energy production means  lower prices.\n\nIt is deeply disappointing that this measure follows the  administration's lead to abandon the transformational projects like the  hydrogen hub in my district. Industry, the USW, the building trades,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694858/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…resource management plans for North Dakota?\n\nOf all of the concerns of the people in Arkansas or Colorado, this is  the priority?\n\nIt is a shame, Mr. Speaker. It is deeply disappointing and  disheartening, I suspect to most Americans, to those who might be  watching C-SPAN, to learn that this august body in the world's greatest  democracy is wasting its…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694889/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…economic  security and dignity by speaking with one powerful, unified voice. A  union helps workers use their power by standing together to level the  playing field.\n\nIt is disappointing that this bill couldn't come to the floor through  the regular process as there is enough bipartisan support to pass this  good and critical legislation, but that didn't…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697868/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…need for this  guidance is significantly diminished, as congressional Republicans  inexplicably gutted this program by withdrawing $850 million in  funding. It is deeply disappointing that congressional Republicans  would rather use this money to give tax cuts to billionaires than  develop creative solutions to protect our wireless networks from  foreign…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693486/open-ran-outreach-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…this: This is  one of many amendments I have come to debate this Congress where it  seems like it was just written by the gun industry and the gun  manufacturers.\n\nIt is disappointing. When gun violence happens, it doesn't matter if  you are a Democrat or a Republican. Bullets don't care who you voted  for. It impacts every single one of us in all of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695142/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…504. Vote ``yes''  on overriding this veto.\n\nMr. HUFFMAN.  Wasserman Schultz).\n\nMs. WASSERMAN SCHULTZ. Mr. Speaker, I thank the gentleman for  yielding.\n\nMr. Speaker, it is disappointing that I must rise to support this  veto override of the Miccosukee Reserved Area Amendments Act.\n\nIt is a very commonsense bill, as our unanimous vote in both houses  of…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698657/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…buying an electric stove or an electric hot water heater. That should  be their choice. Maybe that type of appliance works best for their  household.\n\nThis subsidy is really disappointing. We are taking taxpayer dollars  and supporting one class of appliances over another and even giving the  subsidy to rich folks. This is just a recipe to increase inflation…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700197/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…you that you must support violent murderers,  rapists, robbers, gang members, drug traffickers, and human  traffickers? It couldn't be more black and white, and it is so  disappointing.\n\nMr. PERRY. I just have to ask you in this colloquy, Representative  Roy from Texas: You say, ``the radical left,'' but I listened to you  rattle off the statements of…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…This provision is supported by 39 State attorneys general and  over 81 national and State public health, medical, law enforcement, and  other organizations.\n\nIt is beyond disappointing that our colleagues on the other side of  the aisle will soon be voting to continue the chaos and uncertainty of  a government shutdown.\n\nThis is what responsible Republican…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696739/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…choose to continue their  pregnancies. Yet, today, some of those efforts are being undermined  unless amendments that explicitly promote abortion are included.\n\nIt is deeply disappointing that some of my Democratic colleagues have  chosen to turn this straightforward transparency bill into an abortion  debate, implying that support for pregnant students…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699316/pregnant-students-rights-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…legislation, really kind of bad stuff. I am not going to be negative,  but there has been this trend of anti-Alaska Native bias on the other  side of the aisle. It has been very disappointing. To be honest, it has  been puzzling.\n\nBut I am hoping today, these two bills that we are going to move  forward that go to the heart of Alaska Native culture in one and…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696086/alaskas-right-to-ivory-sales-and-tradition-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…consideration of appropriations bills is  going to require cooperation from Democrats. This week, we will get a  glimpse of where Democrats are on this issue.\n\nIt was deeply disappointing the Democrat leader threatened to shut  down the government if Republicans dared to pass legislation to trim  just one-tenth of 1 percent of the Federal budget, but I am…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693870/trump-administration"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…assertion that my whistleblowers are protected by law. It is an act  done to chill, to intimidate, and to smear patriotic government  workers.\n\nIn closing, perhaps the most disappointing element of this article is  the quote from the Government Accountability Project. The Government  Accountability Project is a group that I have worked with for decades…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Anna Luna", "party": "Republican", "sentence": "…just being anti-election integrity  but also enabling a position that I don't typically agree with.\n\nThat in itself, I would say, in this entire process has been the most  disappointing especially from among my party. I would also ask my  colleagues to remember that up until 1916, female representation was  not a common thing in Washington, D.C.\n\nMrs.…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689415/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…limbs and let you bleed to  death if you had a cold. Notch that as another textbook example of  Democrat fear-mongering that we have heard over the past few months. It  is disappointing but far from surprising.\n\nHere is the truth: There are no programmatic cuts or assumptions in  the House-passed budget resolution. Not a single Democrat can back up  his…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…actually going  to try to pass two bills.\n\nI see that the senior Senator from New Mexico is on the floor, which  doesn't bode well for the passage of this bill, which is disappointing,  and I am going to get to why it is disappointing. It is remarkable that  this bill would be blocked, again, by Democrats. But let me give you a  little bit about the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "John Thune", "party": "Republican", "sentence": "…President Trump a bipartisan  win. Given the fact that the Democrats keep moving the goalposts, it is  hard not to suspect that is the case, and I have to say that is deeply  disappointing.\n\nI strongly support this bill, but I have now changed my vote to no  today so that we can bring this legislation up again if and when  Democrats are ready to get serious.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690892/genius-act"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…veterans have suspected  for decades. Those who served in Vietnam face a much higher risk of  contracting, suffering from, and dying from this disease.\n\nHere is the most disappointing part, Mr. Speaker. The Department of  Veterans Affairs continues to hide behind a familiar excuse: We don't  have enough data.\n\nLet me tell you what we do have. In 2018,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689626/vietnam-veterans-liver-fluke-cancer-study-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…Progress.\n\nBelieve it or not, and it gives me no joy to say this, there are  reports that say 54 percent of Americans cannot read at a sixth-grade  level. This is not just disappointing; this is indeed a national  failure.\n\nAt this point, the Department of Education just doesn't need reform,  it needs a complete overhaul.\n\nIn the last 5 years, the Department…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689153/advancing-america-first-policies"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…think Kate  Millett, who was described as the mother of women's studies classes,  which are all over our universities, were outright opposed to the  nuclear family.\n\nIt is disappointing they are not doing more in this budget to address  that problem, to stop encouraging young people not to be married. We  all by now have run into young couples who may…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}]