[{"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…there are minor changes made there, and then this product is  sent here as an AGOA trade preference product. Our trade laws should be  clear and not put our workers at a disadvantage by forcing them to  compete with these kinds of practices.\n\nAGOA cannot undo the immense harm that President Trump has already  inflicted, but if properly structured, it…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698906/agoa-extension-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…career pipeline. In addition to stopping research  discoveries, these cuts will lead to the loss of STEM talent, which  places the United States at a permanent competitive disadvantage.\n\nPresident Trump's budget also proposes eliminating NASA's Office of  STEM Engagement, which will significantly deter young talent from  participating in STEM programming…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…in our Nation--from having the same opportunities that  we have provided for 250 years since the dawn of our country.\n\nSo we are putting these young people at a serious disadvantage  compared to their classmates. So now my colleagues on the other side of  the aisle, they want to just take that tool away. They want to rip the  hotspots out of students'…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…is enough evidence-- I think this is the evidence we need.\n\nI was there when a person testified at great length that this was  being done for political reasons.\n\nNow, the disadvantage that we would have but for these letters--and  some other evidence that I shall not go into--the disadvantage that we  would have if not but for this would be that we would…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Russia don't have that role for women in their military. What  Secretary Hegseth's action has done is not only showed his ignorance,  but is now putting our military at a disadvantage because of that  ignorance.\n\nNow what these kind of actions do is to create opportunities for our  adversaries to gain influence. It is not just giving Vladimir Putin the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690349/9999"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Secondary Education Act: money in low-income areas to offset the  effect of funding education with the real estate tax, guaranteeing that  low-income areas will be at a disadvantage, so we put money in Title I.  ED helps low-income students, racial minorities, dealing with  achievement gaps, English as a Second Language, and students with  disabilities.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Diversity and  Inclusion held 18 hearings, released three major reports, and brought  long-overdue scrutiny to the ways in which systemic barriers in our  financial system disadvantage entire communities. We exposed inequities  in hiring and promotion. We shined a light on the racial wealth gap,  and we demanded that corporate America take diversity seriously,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…minority students of the few financial and  academic resources the government provides reduces college  affordability and, once again, places students who are already at a  disadvantage further from the finish line. In addition, he signed an  executive order refusing Public Service Loan Forgiveness to non-profits  that he does not like.\n\nPresident Trump…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690128/alarm-at-the-trump-administrations-dangerous-attack-on-education"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…in education. Title I addressed it by putting money into  low-income areas. We fund education with the real estate tax,  guaranteeing that low-income areas won't be at a disadvantage, so title  I comes in with money for low-income areas.\n\nOther provisions in the Elementary and Secondary Education Act talk  about students with disabilities and making…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698125/dismantling-the-department-of-education"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…investments in our manufacturing sector, unstable and erratic tariff  policies, and mass elimination of trusted Federal programs and partners  put American businesses at a disadvantage.\n\nAll of these actions by the Trump administration are detrimental to  our ability to compete globally. I encourage my Republican colleagues  to stand up for American businesses,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692696/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…administration denied them these tools we can all debate, but the  voters of this country made a decision in November. They said: We don't  want our Border Patrol agents to be at a disadvantage with the drug  cartels in Mexico, which they are.\n\nDrug cartels have better technology today than America's Border  Patrol agents. That is a disgrace. Mr. Speaker, you can…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…system to send a payment to a supplier overseas, they face delays up to  10 days and 2 to 5 percent transaction fees. This isn't just  inconvenient; it is a competitive disadvantage to American businesses.\n\nBut digital assets change all that. Stablecoins can complete these  same transactions in seconds, at a fraction of the cost, 365 days out  of the…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691665/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…And then we talk about title IX. We talk about:\n\nWhereas there are fundamental biological differences       between men and women that put women at a competitive       disadvantage in sports and jeopardize their safety during       competition;\n\nAnd 79 percent of the American people agree with this.\n\nThen we go through:\n\nWhereas, since 2003, biological…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…to accomplish that. My  friends on the other side of the aisle know it.\n\nAfter the bank failures of 2023, community financial institutions  lost consumers and remain at a disadvantage. Again, any rule that leads  to greater consolidation in the banking industry only benefits the  largest financial institutions in America, a class of banks regularly  attacked…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689844/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…vast majority of venture capital investment flows to companies in  just three States: California, Massachusetts, and New York, leaving  entrepreneurs in other regions at a disadvantage.\n\nThis bill takes a targeted step to help address that imbalance. It  directs the SEC's Office of the Advocate for Small Business Capital  Formation to do more to support…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692706/promoting-opportunities-for-non-traditional-capital-formation-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…controls that have  already driven down the number of units available in the city of New  York, which is already suffering from a huge housing shortage and a  huge price disadvantage for the thousands of people who want to work in  the city.\n\nThis is contrary to economic choice, and that is another reason why  we are here on this House floor. We are…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697143/denouncing-the-horrors-of-socialism"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…countries can enhance the       United States economic strength, policies regarding foreign       direct investment should reflect security interests and       should not disadvantage domestic investors or companies;\n\n(5) United States efforts to attract foreign direct       investment from responsible private-sector entities based in       trusted countries…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692697/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…at home to  be penalized over $20,000 a year if they get married.\n\nWe have to look at these programs, and frequently, these programs  materially put a married couple at a disadvantage.\n\nWe have all heard stories of Food Share. If you talk to people at the  local convenience store, talk to people at the local grocery store,  people are taking advantage…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Act. For communities across eastern Washington, the  relief cannot come soon enough.\n\nFor years, rural communities with large amounts of Federal land faced  a structural disadvantage. They can't collect property taxes on those  lands, yet they are still expected to keep schools open, maintain  roads, and provide public safety. The Forest Service manages…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692323/taking-an-important-step-for-rural-america"}]