[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…It means scientists free to pursue truth without fear. It means  alliances that multiply our influence instead of isolation that  diminishes it. It means an America where disagreement doesn't mean  demonization, where debate doesn't mean destruction, where we can be  fierce advocates for our beliefs while still recognizing the humanity  in those who disagree.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…oversight.\n\nWe also have the problem with the whole Signalgate thing, where  classified information was shared in a way that it should not be  shared, and there should be no disagreement on that. We didn't exercise  oversight on that either, so stepping aside from all of these issues,  simply letting the President do what he wants to do.\n\nThen, internationally,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…has suggested that the Federal executive branch should take over  elections, which, under our Constitution, belong to the States.\n\nSo let me be clear. This is not a policy disagreement. This is not a  gray area. This is not a novel constitutional question. This is,  flatly, outright, unquestionably, unconstitutional. The Framers could  not have been more…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700022/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…on those making under a  million dollars a year.\n\nIn fact, in the Rules Committee a few weeks ago, a Democratic Member  offered an amendment to say we agree.  Where the disagreement lies is in those who make more than a million  dollars a year. The top 1 percent, in fact, the top one-half of 1  percent.\n\nEvery Democratic Member voted in favor of that…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689914/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…responsibilities, not by  rubberstamping the Department of Defense's requests but by, yes,  identifying areas of agreement, identifying and negotiating or saying  no to areas of disagreement, and, ultimately, passing, on a bipartisan  basis, what we refer to as the National Defense Authorization Act, the  final product reflecting the priorities of both Congress…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…thank the gentlewoman for yielding to me,  and I thank her so much for leading this Special Order hour.\n\nMr. Speaker, I join with my colleague from Virginia to express my  disagreement with the misplaced priorities of the Republican majority.  The American people have made clear that they want their elected  leaders to be focused on improving the economy…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…right, Mr. Chair,  their constitutional right. You don't have to agree with them, Mr.  Chair, no one does, but it is their right. It is their right to again  express their disagreement with policy and decisions by a foreign  government.\n\nIn fact, many of my colleagues again continue to say there is  transparency for some countries in relationships with…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689027/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…of our intelligence is being  sacrificed on the altar of partisan convenience.\n\nThis is not some kind of inside-the-beltway turf battle, and it is  not another partisan disagreement. I believe at stake is something much  more fundamental: whether America will continue to have an intelligence  community free to speak truth to power or whether political…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…endure in this country. This is their way of trying to roll back the  Civil Rights Act of 1964 that so many died and bled for.\n\nMr. Speaker, this is not just about policy disagreement. This is  about direct attacks on Black futures, Black prosperity, and Black  freedom. This is about right versus wrong, point blank. But here is  what they don't understand.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…speaking, to make sure that that Member gets  phone calls. He makes  sure that that Member is intimidated to the extent that that Member has  to reconsider whatever the disagreement was.\n\nThis is the President of the United States, the intimidator-in-chief.  He prides himself on his ability to intimidate and to get persons to  cooperate. He doesn't…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…without demonizing our  opponents.\n\nOn this 15th anniversary, we honor those who we lost by recommitting  ourselves to the work that they believed in, a democracy where  disagreement is not just tolerated but celebrated, where robust debate  strengthens rather than threatens our institutions, and where every  American can engage in civic life without…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698819/fifteenth-anniversary-of-arizona-mass-shooting"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…night spoke to the Nation. One of the things he  said was that TSA, the Coast Guard, and FEMA are not operating. That is  accurate. They are not operating because we have a disagreement in this  House between Republicans and Democrats on whether those agencies ought  to be funded. We do have a deep and severe disagreement with the  administration with respect…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700218/homeowner-energy-freedom-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…from that.\n\nIf it was just deportation operations focused on dangerous, violent  criminals, there would be no discussion, there would be no debate, and  there would be no disagreement. But that is not what this  administration is doing. They are going after all immigrants.\n\nThe vast majority of those who have been arrested and detained, and  many of those…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694421/daca"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…say on pipelines and power lines, respectively.\n\nWhile FERC and DOE could consult with other appropriate Federal  agencies, such consultation is optional.\n\nIf there is a disagreement between the State Department and the  Department of Energy or the State Department and FERC, this bill says  that our national security and diplomatic interests will take…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695689/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…periods when you weren't scrolling and weren't  doing social media. In many ways, you were liberated from that toxin,  which feeds in our society so much hate and so much disagreement.\n\nThese are corporations actually that feed us through their algorithms  things that make us more enraged on each other. If there is any great  threat to America, it is…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…the       requirement described in subsection (a)(1); or\n\n(B) in the event the committee does not reach a consensus,       a report identifying any points of agreement and disagreement       with respect to such proposed regulations.\n\n(4) Proposed rule.--If the Administrator elects to       establish a committee under this subsection, not later than…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…of this bill as we try  to make the anti-firearm groups happy. It turns out we would meet their  requests, and then they would change their standard. The problem or the  disagreement kept changing.\n\nI don't know what the motivation is for playing games, but we bring  this to the floor with honest hearts. We want our brothers and sisters  not to die in…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…threats  and attacks on public officials across the political spectrum in recent  years. While we may have our differences, it is incumbent upon us all  to make sure that disagreement never descends into violence.\n\nNow, more than ever, we must remember that we are all Americans, and  what unites us is far more powerful than anything that might divide…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692860/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…respectfully disagree with others. We have to do the same as a society.  We have to lead by example and put civility back into today's political  discourse.\n\nPolitical disagreement is healthy. It is what our system of  government was founded upon. We have our fair share of that political  disagreement in Minnesota, and we even have it here in the House…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692856/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…not to run  again--and I decided it was just easier to do it here versus answer the  callous questions out in the hallway--is because in the moment where he  and I had a disagreement, I had to make a decision about how I could be  most helpful to him.\n\nIf I ran for reelection, I would necessarily always have to think  about what boundaries I should have…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…legislation.\n\nI haven't been here very long in this body, but I have learned  something, and it is amplified today. That is that this town has a  remarkable ability to snatch disagreement out of the jaws of consensus.  This is an issue that liberal thinkers and conservative thinkers have  both said is a problem that we ought to address.\n\nJustice Kagan has…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689716/no-rogue-rulings-act-of-2025"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…human side of  governance, paired with professional excellence--is rare. That is what  made her indispensable.\n\nIn moments of pressure, she was unflappable. In moments of  disagreement, she brought thoughtfulness. In moments of decision, she  was always guided by principle.\n\nI have relied on her judgment more times than I can count. When I  needed honest…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699672/recognizing-christine-lee"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…administration policy for the Defense appropriations bill. I was very  supportive of the bill we produced. One of the very few areas the  administration expressed any slight disagreement with our bill was  wanting more money for Taiwan. The administration has proposed  including $1 billion while this bill provides $500 million.\n\nMr. Chair, had OMB delivered…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…for those who do  their jobs. That was the fix. It is not a niche bill. It is not to  punish one group or the other group. It is to say, if you are working  and there is a disagreement on the spending levels, that all workers  are paid. I don't understand the objection, and I will continue to  support paying all the workers all the time they are at work…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}]