[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…he gets into the Governor's office, and he stands right behind  our Governor. One of our legislators, who basically wants the Governor  to know that this individual, who he disagrees with--doesn't support  this bill--has now snuck into the Governor's press conference.\n\nSo what does our Governor do? He turns around, and he looks at Mr.  Eyman, and he says,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692451/alex-padilla"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…to guide  and balance the multiple uses of our public lands and resources based  on the needs of today and into the future.\n\nIt is important to recognize that even if one disagrees with the way  in which this resource management plan balances public land uses--and I  understand there are good faith disagreements with the resource  management plan. The…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694909/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…that is very, very dangerous. That is number one.\n\nNumber two is transgender people exist. That is just a fact. Gender  dysphoria is a medical fact. No serious medical person disagrees on  that point. It is not even debatable. There are a couple of things that  are debatable.\n\nWhat do we do about it? What treatments are appropriate, given the  set of circumstances?…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…from New York (Mr. Morelle), the  distinguished ranking member of the Committee on House Administration.\n\nMr. McGOVERN. Mr. Speaker, I know a Senator from North Carolina who  disagrees with everything the gentleman just said, including a lot of  hospitals in North Carolina that disagree with what he just said.\n\nMr. McGOVERN. Mr. Speaker, I read the bill,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…tell them the actual price  given by the drug company itself. He thinks it is too confusing for  them to understand that that price means anything at all.\n\nDo you know who disagrees with him? The AARP, the American  Association of Retired Persons. They represent American seniors, and  they endorse the Grassley-Durbin bill. They believe that seniors can…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694204/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…safety of vaccines. The administration  could send broadcast licenses because you know this is an  administration that is not shy about attacking anybody in the community  who disagrees with their agenda. We can see the administration send  merger approvals--again, not just those that are pending but go back to  1996--and any number of government decisions…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691542/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…some indications that  some independence is starting to present itself.\n\nGenerally speaking, the President doesn't respect the separation of  powers. If a Member of the House disagrees with him, he immediately  calls upon the constituents of that Member to do what is necessary  within the law, generally speaking, to make sure that that Member gets  phone…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…the same educational assistance and support that other students enjoy.  I think that is a good thing. I think that is what should make America  America, but this White House disagrees.\n\nThe Trump administration believes that the rights and opportunities  available to students like RJ can and should be limited. They have spun  abandoning programs as efficiency…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698947/protecting-education-for-children-with-disabilities"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…authorities as President;  that if a judge criticizes him, he believes it is wrong.\n\nHe drew reprimand from the Supreme Court for his calling out Justices  whose opinions he disagrees with. This is a President that doesn't  believe in the checks and balances of our Constitution.\n\nBut the frustrating thing about all of this is that it is distracting  us--this…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692454/alex-padilla"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…is to sit in that chair. I  did my 100 hours in that chair, plus quite a few. And I know it is  awfully hard to be there and not even be able to respond when maybe  someone disagrees profoundly. Yet you are here making it possible that  I could carry this conversation, ringing the alarm bells about  authoritarianism. It couldn't have been done if you…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…rights, a right that we are all  entitled to, regardless of status.\n\nUnder Trump, ICE and DHS have become a means to carry out political  arrests and to silence anyone that disagrees with their extreme agenda.  That is what we are looking at right now. It has never been about  removing the criminals. It has always been about creating mass fear and  mass…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693019/ice-turns-courthouses-into-traps"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…free speech.\n\nI don't see this administration saying anything about limiting the  free speech on FOX, OAN, or Newsmax. Free speech is okay if you agree  with it, but if it disagrees with you, then out it goes.\n\nThat is the way it is in Putin's Russia and in Kim Jong-un's North  Korea. That is the way it is in China, Hungary, and Iran. That is not  America.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695811/brendan-carrs-words"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…battlefield within 48 hours, there was no time to decompress. There was  no time to work through the challenges that you have seen.\n\nWhat do we do? Well, PTSD is real. Nobody disagrees with that at all.  How do we turn a negative into a positive?\n\nWell, how about in changing the term ``post-traumatic stress  disorder'' into ``post-traumatic growth.'' Take…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692714/recognizing-national-post-traumatic-growth-day"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…executive order, and  no one is screaming that is a constitutional crisis, even though many  of us strenuously disagree with those judges just as strenuously as the  left disagrees with the President.\n\nUltimately, though, we have faith in our Constitution, and as the  case progresses through the courts, we will get  a clear and authoritative ruling…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688130/birthright-citizenship"}, {"senator": "James Risch", "party": "Republican", "sentence": "…completely and  unconditionally withdraw from the territory of Ukraine. This isn't even  a law. It isn't even a bill. It is only a resolution.\n\nNow, there isn't anybody that disagrees with this. I certainly agree  with the substance of this, but this is going to have absolutely zero  effect of any kind. If my good friend Senator Sanders believes that…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688569/9999"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Americans, working Americans and everyday Americans, use  the doubled standard deduction.\n\nThat is real tax relief. It goes unsaid a lot. It is such a standard  piece. Nobody truly disagrees with it--``nobody'' meaning both parties.  It is something that we have now established as the norm, and it will  give immediate relief to the vast majority of American families.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699706/historic-tax-relief-for-families"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…therefore, those grants can now be terminated.\n\nThe High-Speed Rail Authority came out with this statement, which,  frankly, defies belief. It said: ``The Authority strongly disagrees  with the [Federal Rail Administration's] conclusions, which are  misguided and do not reflect the substantial progress made to deliver  high-speed rail in California.''…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}]