[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "Mr. McGOVERN. Mr. Speaker, last month Republicans passed a budget  that enables massive cuts that are going to kick people off of food  assistance. Children, seniors, disabled veterans, workers--people who  all rely on SNAP, the Supplemental Assistance Nutrition Program, to  help purchase food when times get tough, Republicans want to rip it  away,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689041/impact-of-proposed-snap-cuts"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "Mr. PADILLA. Mr. President, I rise to speak in support of the  bipartisan Housing Unhoused Disabled Veterans Act, which I introduced  today.\n\nLet me begin by expressing my sincere appreciation for veterans and  members of our Armed Forces who have answered the call of duty and…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690059/by-mr-padilla-for-himsmcelf-mr-cormick-mr-gallego-mrsthank-senators-gallego-cormick-and-britt-for-introducing-this"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. Speaker, I rise to express my support for H.R. 877, the Deliver  for Veterans Act. This bill would make it easier for disabled veterans  to obtain the adaptive automobiles they are entitled to through their  service-connected disability. If signed into law, this bill could save  veterans tens of thousands…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689674/deliver-for-veterans-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…to gain even a vote. So I am asking today that that support  be turned into action.\n\nThis bipartisan legislation will correct one of the deepest  injustices impacting disabled veterans. It is labeled by stakeholders  as the ``wounded veterans tax.''\n\nThe wounded veterans tax, as it stands now, causes more than 50,000  combat-injured veterans who were…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…require Federal agencies to examine the following  data:\n\nHow many small businesses received a prime contract for the first  time and are owned and controlled by service-disabled veterans.\n\nIt will track the concerns of qualified HUBZone small businesses,  track the concerns of businesses controlled by socially and  economically disadvantaged individuals,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687943/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…families in  Mattapan who receive their healthcare through MassHealth, the Medicaid  program for Massachusetts; mothers in Chelsea, who rely on SNAP to feed  their babies; disabled veterans in Randolph who receive lifesaving care  and benefits through the VA; families in Roxbury who rely on Head Start  for childcare.\n\nThis Republican majority said they would…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688079/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…lazy  and reward exaggeration, but I know, as does America, that this is a  ridiculous notion.\n\nI think Senator Duckworth put it perfectly when she said:  ``Portraying disabled veterans as a group of takers who will happily  never work again for $3,100 a month is incredibly condescending and  disrespectful to these heroic Americans.''\n\nOur veterans have…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696762/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Finally, the administration should exercise its legal authority to  fund SNAP in November.\n\nPretty simple. Pretty straightforward.\n\nMr. President, children, seniors, the disabled, the veterans, our  most vulnerable families--they are not bargaining chips. It is simply  wrong to treat them as bargaining chips. It is wrong to adopt a  position in which they…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Introduced by Veterans' Affairs  Committee member Representative Dexter, the VA Veterans Readiness and  Employment, or VR&E program, is perhaps the greatest resource disabled  veterans have to seek a new career path, but veterans are dealing with  historic wait times due to program popularity and expanded eligibility  under the PACT Act.\n\nI respectfully…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695411/focused-assistance-and-skills-training-for-veterans-employment-and-transition-success-act"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…transitioning into  the small business world. It will ensure that the task force reports  annually to Congress on its outreach efforts for programs available to  veterans, service-disabled veterans, reservists, and their spouses.\n\nFor many of our Nation's veterans, transitioning back to civilian  life can be daunting, especially for those seeking to start their…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687889/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…assistance, including career counseling, vocational training, and  educational support to help veterans overcome employment barriers.\n\nThe program's ultimate goal is to empower disabled veterans to  achieve independence and a successful career in the civilian workforce.\n\nI take great pride in my work on the Honoring our PACT Act that  resulted in hundreds of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695444/veterans-readiness-and-employment-program-integrity-act"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…he became an active member of the Combat  Veterans Motorcycle Association, contributing countless hours to  fundraising efforts that provided construction projects for disabled  veterans, ensuring safe homes and greater mobility for those who  sacrificed for our freedoms. He further demonstrated his compassion and  solidarity by volunteering at local…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696272/recognizing-christopher-aaron-mcgowen-with-a-congressional-veteran-commendation"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "Mr. WICKER.  He is a veteran; I am a veteran. I have no doubt in my  mind that Senator Blumenthal has a heart for the veterans and for  disabled veterans, and I appreciate that. He is moved with concern for  those who have served and who have been injured.\n\nHowever, my colleague is asking for an entitlement that does amount…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696110/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…people who  need it most: people who rely on tips and overtime and people living on  Social Security. It lifts burdens off the backs of working parents,  retirees, and disabled veterans.\n\nThe truth is, Mr. Speaker, whatever name you choose, this bill will,  and is, launching the golden age of America because, as Shakespeare  reminded us, it is not the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695114/launching-golden-age-of-america"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…subparagraph:\n\n``(E) The number of new small business entrants, including       new small business entrants that are small business concerns       owned and controlled by service-disabled veterans, qualified       HUBZone small business concerns, small business concerns       owned and controlled by socially and economically       disadvantaged individuals, and…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687942/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…VR&E plan, instead of being forced to complete their current  rehabilitation plan first.\n\nThis bill is a simple fix that would remove the outdated practice  that requires disabled veterans to complete their current plan before  switching to a plan that may better fit the changes in their  disability.\n\nDuring the Biden Administration, VA damaged their relationship…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695412/focused-assistance-and-skills-training-for-veterans-employment-and-transition-success-act"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…because of  economic change outside of their control.\n\nWithout their disability compensation benefits, veterans may not be  able to afford the cost-of-living increase. Many disabled veterans and  their families rely on their benefits to help pay for necessities like  mortgage payments and groceries.\n\nI know there are veterans in my district currently struggling…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696760/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…Streamlining Aviation for Eligible Veterans Act, in the text of this  bill.\n\nThis bill will make meaningful improvements to the way that the VR&E  program serves our disabled veterans, and my section of the bill will  enable those veterans to use their VR&E benefits to pursue vocational  flight training.\n\nMr. Speaker, as you know, we have a nationwide…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699488/veterans-readiness-and-employment-improvement-act-of-2025"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…responders, especially those who had once  served our country in uniform and continued that service here at home.\n\nCamp Freedom provides outdoor healing experiences for disabled  veterans, first responders, and their families. Their mission is rooted  in community, connection, and recovery. I thank Matt and all of his  team for all that they do to support…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691021/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…veteran in my district could not get the timely access to  mental health care from the VA that he needed, Michael created the  Sergeant Ted Grubbs Mental Healthcare for Disabled Veterans Act. Just  last night at dinner, Michael shared how the highlight of his time in  my office was meeting Sergeant Ted Grubbs.\n\nI also highlight his critical work on the…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693053/commending-michael-kraan"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…veteran community.\n\nThe VA currently supports over 506,000 surviving spouses. However,  the VA does not track the cause and manner of death among recently  deceased totally disabled veterans. Data like this is critical to  ensuring that the VA programs for surviving family members meet their  needs.\n\nThe report would also require the VA to publish the total…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695487/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…my friend and colleague, the delegate from Guam (Mr. Moylan).\n\nH.R. 877, as amended, would allow the VA to pay for the shipping  price of specially adapted vehicles for disabled veterans. Currently,  service-connected disabled veterans who are unable to drive due to  their disability can work with the VA to get a vehicle that is adapted  for their use.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689675/deliver-for-veterans-act"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "…for the  resolution is right in my congressional district. Camp Freedom in  Carbondale, Pennsylvania, provides meaningful outdoor adventures that  promote healing for disabled veterans, first responders, and their  families, including the families of the fallen.\n\nBy passing H. Res. 364, we send a clear message that the sacrifices  of these families…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691022/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…strides to  improve the quality of life for our servicemembers and their families.  It expands childcare options. It enhances access to tutoring for  children of fallen and disabled veterans, and it supports the daily  needs of the men and women who wear the uniform.\n\nAccess to a VA facility is not a reality for some of our rural  veterans. I hear this each…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692959/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…2025, the rates of  compensation for veterans with service-connected disabilities and the  rates of dependency and indemnity compensation for the survivors of  certain disabled veterans, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                  S. 2392\n\nBe it enacted by the Senate…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696763/veterans-compensation-cost-of-living-adjustment-act-of-2025"}]