[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…skirts.\n\nRepublicans have already banned trans people from the military and  the service academies via executive action. This amendment is just  another backdoor attempt to discourage transgender people from  enlisting in the future while making the military less safe for all  women and embedding discrimination into law. This amendment is a  classic example…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695232/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…in the military by President Trump. Republicans  must stop injecting partisan politics into the NDAA because these  provisions promote only division and will continue to discourage  Americans from serving our Nation.\n\nFifth, this NDAA authorizes expanded military cooperation between the  United States and Israel that, considering the Israeli military…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…medical jargon and dress up in scrubs, yet most of the 2,600 clinics do  not have a single licensed medical professional. Instead, they rely on  fear and misinformation to discourage vulnerable women as they are  trying to make one of the most important healthcare decisions about  what is best for them.\n\nMuch more shocking than the waste that is promoted…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699233/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…stations in urban  areas. We see it in efforts to suppress the vote of certain  communities. We see it in the purging of voter rolls. We see it in  affirmative efforts to discourage people from voting. We see it in the  demonization of election workers, the interference with election  boards.\n\nFinally, although the list is much longer, I would end with…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696336/trump-administration"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…is  ``to combat the rise in violent crime in our Nation's Capital by  eliminating policies which place law enforcement personnel of the  District of Columbia at risk and discourage them from serving, ensuring  that such personnel will be treated equitably and fairly and the  recruitment and retention of such personnel shall be increased.'' We  are not…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…wave of baby boomer business owners looking for ways to  transfer ownership. As these owners retire, many are considering ESOPs,  but the complexity of setting them up may discourage some from pursuing  this option.\n\nTo help overcome these challenges, my ESOP Funding for SBA Position  Act of 2025 will create a position within the SBA to guide small  businesses…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690133/introduction-of-the-esop-funding-for-sba-position-act-of-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…ought not to be entirely out of  sight) the common and continual mischiefs of the spirit of party are  sufficient to make it the interest and the duty of a wise people to  discourage and restrain it.\n\nIt serves always to distract the public councils and enfeeble the  public administration. It agitates the community with ill founded  jealousies and false…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…voters, and we wouldn't force married women to navigate even more  bureaucratic obstacles. We wouldn't force States to turn over their  voter rolls, and wouldn't actively discourage voting by mail.\n\nMr. Speaker, I have a different challenge for my colleagues from the  Republican side. They should join me in focusing on what Americans  actually need:…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699937/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…our government, to deter people from voting.  This is all in service of President Trump's insatiable desire for power  and his insatiable ego.\n\nEfforts by his enablers to discourage absentee voting have already  disenfranchised servicemembers. In North Carolina, Republicans have  sought to cancel 65,000 votes in a judicial election--an estimated  2,000…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…requires a look at bills that create enormous additions to our  national debt. And to protect our fisc, it requires mandatory cuts to  other accounts.\n\nThat is supposed to discourage running up the debt by trillions in  the first place, and it is supposed to remedy that defect with  automatic cuts.\n\nGuess what is lined up for automatic cuts under the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695699/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…ability of Taiwan to receive appropriate technical       assistance and training by the Fund.\n\n(b) United States Policy.--It is the policy of the United       States not to discourage or otherwise deter Taiwan from       seeking admission as a member of the Fund.\n\n(c) Waiver.--The Secretary of the Treasury may waive any       requirement of subsection…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…development in the 10-02 area of ANWR. The Biden  administration's Record of Decision runs completely counter to the laws  that Congress has enacted, and they played games to discourage  development like only offering unfavorable acreage in their lease sale.\n\nThese policies run counter to the wishes of the Alaska Natives across  the North Slope of Alaska.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696829/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…shouldn't have to be a Member of Congress or an attorney to  understand how the VA claims process works.\n\nH.R. 1039, as amended, would ensure that none of VA's notice letters  discourage veterans from accessing the benefits they have earned.  Representative Barrett's bill would ensure that VA sends veterans and  survivors understandable notice letters so…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689678/clear-communication-for-veterans-claims-act"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…double-checked that. They hadn't  been consulted. They hadn't been talked to.\n\nThis is an important day. Taxes, like the one we are discussing,  raise energy production costs. They discourage investment. They  ultimately lead to higher consumer prices and costs. Not only is this a  tremendous burden on both producers and consumers but this rule also  completely…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688184/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…as children whose ancestors come from Pakistan or India or  Philippines--is that we have such strong incentives in America, through  a horrible broken welfare system, to discourage mothers and fathers to  stay together with their children.\n\nThis began in the 1960s under Lyndon Johnson, who I felt, before Joe  Biden, was the worst President in this country's…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…know that the goal is to  effectively end the sale of internal combustion engines.\n\nNow, I am not here today to disparage electric vehicles, and I am  certainly not here to discourage the manufacturing and the purchasing  of EVs either. What I am concerned about is the Federal Government  dictating which cars and which trucks are acceptable and which are…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691668/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…our proposed big, beautiful bill,  but I know President Trump's team is concerned about this. It is the  degree to which so many of our welfare programs are designed to  discourage people from getting married.\n\nWe know that people who get married and have children--well, all  types of families have successful children. I personally know many  people…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…that reopens all of NPR-A's subsurface historically available       to oil and gas leasing with reasonable and economically       feasible stipulations that do not discourage the development       and transport of energy resources.\n\nThe 2022 BLM IAP ROD unnecessarily prohibits leasing and       development of potentially oil-rich lands in much…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…list, leaving us the question of who  else was allowed to enter this country undetected.\n\nThat is why the Stop Illegal Entry Act is so important. The  legislation seeks to discourage migrants from coming to the U.S.  illegally and keeps criminal aliens who disregard Federal immigration  law out of our American communities.\n\nIt is vital that law enforcement…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695364/stop-illegal-entry-act-of-2025"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…energy.  Alaska holds over 100 trillion cubic feet of natural gas, and the  Alaska LNG project is our best chance to bring it to market. Yet,  burdensome Federal regulations discourage investment, keeping Alaska's  energy potential locked away.\n\nMeanwhile, Cook Inlet gas supplies are declining, threatening  Alaskans in south central Alaska with higher heating…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688188/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…Federal thresholds. That makes no  sense. Facilities that make major investments to reduce emissions  should be rewarded, not locked into outdated, costly regulations that  discourage further improvements.\n\nBy refusing to let businesses reclassify after making progress, this  rule removes any real incentive to invest in cleaner technologies.  Instead of…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689195/work-highlights-of-western-caucus"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…producers a clear and reliable  path to move forward with critical projects.\n\nH.R. 1949 ends the harmful Biden-era delays on liquefied natural gas  export approvals. Delays discourage investment, undermine our energy  leadership, and threaten the security of our global partners who depend  on the United States to break free from harmful foreign influence.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697089/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…easier to get if you don't have a working  parent in the household.\n\nWe have our child credit, which is, again, something that is phased  out and appears to be designed to discourage people from getting  married.\n\nWe have Pell grants--and I will tell you a story about that in a  minute--a program that gives free college to a family without a working…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…regions of the United States which have the greatest       workforce need for supply chain employees; and\n\n(E) barriers and industry trends that directly or       indirectly discourage members of the Armed Forces eligible       for preseparation counseling under section 1142 of title 10,       United States Code, and veterans from pursuing, attaining,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695018/transitioning-retiring-and-new-service-members-to-port-ocean-rail-and-truck-jobs-act"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…Under NORRA, we reaffirm the principles that district court orders can  only bind parties before the court and not nonparties across the  country. This reform will also discourage the growing trend to forum  shop, Madam Speaker. If you can go to Hawaii because you can find a  judge who will rule against an action taken here in the District of  Columbia,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}]