[{"senator": "John Larson", "party": "Democrat", "sentence": "…for his mortgage.\n\nLet's cut right to the chase. This is about a vote for the American  people. This great democracy that we live in, this Chamber that could  once actually discuss and debate issues, Speaker Johnson should be  bringing this bill to the floor today.\n\nDo Republicans have the courage to vote, or are they going to run and  hide? Four Republicans…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698380/lower-health-care-premiums-for-all-americans-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…seen the progress we have made, I know  that we cannot stop our commitment now.\n\nJust last week, I attended a roundtable with Long Island Sound  Citizens Advisory Committee to discuss how we in Congress can work with  them to preserve Long Island Sound. This roundtable built on an event  in Rye in June where a new 10-year conservation and management plan…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693947/protecting-and-preserving-long-island-sound"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "Mr. KAINE. Mr. President, I move to discharge S. Res. 195 from the  Committee on Foreign Relations, as provided under the previous order.\n\nMr. KAINE. Mr. President, I rise to discuss S. Res. 195, which is a  vote on a motion to discharge that will be the next pending vote in the  Senate.\n\nIt is actually a pretty simple bill about very basic concepts: Do…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691406/motion-to-discharge-s-res-195"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "Mr. BOYLE of Pennsylvania. Mr. Speaker, I thank the ranking member  for yielding time to discuss our proposal.\n\nLate Sunday night, the House Budget Committee, on which I serve as  ranking member, passed out, with only Republican votes, a draconian tax  bill that cuts…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691513/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "Mr. CARTER of Louisiana. Mr. Speaker, I rise today to discuss an  issue that affects men of all ages, races, and socioeconomic  backgrounds: prostate cancer.\n\nJust last week, I introduced a resolution designating September as  Prostate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695816/recognizing-prostate-cancer-awareness-month"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…bipartisan bills. We want to work on bipartisan appropriations.\n\nBut what we have in front of us is a CR that is partisan, that says:  Do it my way or the highway, and do not discuss the priorities of the  Democrats.\n\nWhen you are asking us for votes--when you are asking for Democratic  votes--you can't just demand whatever you want and say: If you don't…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696460/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…when we  started this conversation about diversity, equity, and inclusion, I  invited some of my other colleagues to participate. One person asked  me: Is it legal for you to discuss DEI, diversity, equity, and  inclusion?\n\nAs coequal branches of government, we do not work for the DOGE. We do  not work for the Presidency. We fundamentally disagree with…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…budget and the Republican perspective.\n\nI am on the House floor right now. I am ready to debate one-on-one,  prepared to yield to the Speaker for colloquy at any time so we can  discuss the Democratic vision for building an affordable economy that  lowers costs and makes life better for the American people and the  Republican budget proposal that would enact…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689902/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Speaker, as part of the Congressional Field Hearing  on Haitian TPS Termination held in the Massachusetts 7th Congressional  District, experts from the community were invited to discuss the  importance of extending TPS for Haitian nationals. Therefore, I include  in the Record their testimonies:  Testimony of Attorney Mirian Albert of Lawyers for Civil Rights…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…meet. They are  scheduled to meet at 1 a.m. in the morning when Americans are sleeping  and when families are resting awaiting the next day.\n\nThey are scheduled to meet to discuss at length Medicaid cuts. More  than one-half of the residents in the district that I have the  privilege to represent, the 13th Congressional District, encompassed by  Harlem,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691482/medicaid-and-social-security-cuts"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…antithesis of democracy.\n\nThe substance of this bill is irrelevant since there is never  justification for Congress to legislate on local D.C. matters.  Nevertheless, I will discuss it.\n\nVehicular pursuits by police officers are inherently dangerous not  just for officers and suspects but for bystanders, too, and often there  are other options to detain…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…American and lived in Anaheim and  worked at Disneyland.\n\nWe knew some facts, but we never in our times when we would get  together for our family gatherings would we ever discuss what happened  in Hiroshima. It wasn't until I was well into my adulthood on my first  trip to Japan visiting Hiroshima and visiting Kikue, who was there  taking care of her…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694115/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…used right now to  repeal a Park Service decision of this nature. This is meddling and  micromanaging at its worst, and it could have some unintended  consequences as we will discuss in the course of this debate.\n\nWhen Congress uses the CRA to repeal a rule, then the agency is  prohibited by law from issuing a substantially similar rule on the same  topic.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690404/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Mr. DURBIN. I thank the Senator from Vermont.\n\nSeveral weeks ago, several Senators joined me in meeting with the  Ambassador from Israel. It was an effort to discuss many of the things  which we are discussing this evening.\n\nWe asked him why Israel was not providing humanitarian aid in Gaza.  He said: That is not true. We were providing…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694435/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…savings accounts or homeschooling instead. Today, instead of freedom of  inquiry and inclusion, we see policing of what schools can teach, what  students can read, what they can discuss, and how they should think.  This is a recipe for stifling creativity and the development of the  skills needed for an ever-changing knowledge economy.\n\nWe politicize and…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…from military servicemembers and  surviving family members about their struggles accessing VA benefits.\n\nIn my district, I started a Veterans Advisory Council, and we often  discuss this very topic to find ways to better this situation. I am  always looking to ensure that Department of Veterans Affairs leaders  hear the concerns of veterans' loved ones.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689688/prioritizing-veterans-survivors-act"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…to hold on to their  elections. That is what this debate is about.\n\nI believe that we need to move forward today because all this vote is  right now is a vote on whether to discuss and vote on whether to reopen  the government.\n\nI will be honest. There are things in the underlying appropriations  bills that make my stomach churn, but I believe we have…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699594/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "Mrs. CAPITO. Mr. President, I rise to discuss my support for H.J.  Res. 61, a joint resolution of disapproval under the Congressional  Review Act to repeal the Environmental Protection Agency's misguided  National Emission…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692022/hj-res-61"}, {"senator": "James Risch", "party": "Republican", "sentence": "…subcommittee on the same subject for a period of no more       than 14 calendar days may be closed to the public on a       motion made and seconded to go into closed session to       discuss only whether the matters enumerated in paragraphs       (1) through (6) would require the meeting or hearing to be       closed followed immediately by a record vote in open…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "Mr. SCOTT of Florida. Mr. President, the nominees I will discuss  today were approved by the Armed Services Committee with bipartisan  support. Republicans and Democrats agreed they are qualified and ready  to serve. President Trump was…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691405/motion-to-discharge-s-res-195"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…examples out of others  that could be addressed with the same rebuttals. So, in the interest of  time, I will only address the January 18, 2026, article that I came  here to discuss with my colleagues.\n\nIn that article, Thrush, Feuer, and Goldman issued the same  slobbering defense of fired FBI agents whose emails Senator Johnson and  I made public. So…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "John Rose", "party": "Republican", "sentence": "Mr. ROSE. Mr. Speaker, I thank Chairman Hill for yielding me time to  discuss this important issue.\n\nMr. Speaker, it is no secret that the sky was the limit when it came  to regulations for the last administration. Our Nation endured 4 years  of costly…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689836/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…``(iii) small businesses affected by hurricanes or other       natural disasters; and\n\n``(J) at least annually, meet with representatives of State       securities commissions to discuss opportunities for       collaboration and coordination with respect to efforts to       assist small businesses and small business investors.''.\n\nMr. Speaker, I rise in support…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692706/promoting-opportunities-for-non-traditional-capital-formation-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…hostages. As we remember this day, we are more motivated than ever to  stand with Israel and the Jewish people. I am grateful to my colleagues  for joining me this evening to discuss this solemn anniversary.\n\nMr. WILSON of South Carolina. Mr. Speaker, I thank and very much  appreciate Republican Vice Chairman Blake Moore of Utah for holding  this Special…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "Mr. McCONNELL. Mr. President, I rise today to discuss the original  intent of the 2018 farm bill's Federal hemp legislation and the need to  restore it.\n\nEarlier this year, a report from the University of Kentucky found  that…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694557/9999"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…with 1,800  Hoosiers. I reported back on my work in Congress. I listened to their  concerns and priorities.\n\nI met with leaders in our communities, including our Governor, to  discuss how our Federal policies affect their lives. Together, we  explored opportunities to deliver more for all Hoosiers.\n\nI visited hardworking families, farmers, local businessowners,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694973/hoosier-heartland-tour"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…encouraging and  supporting the laws of our land.\n\nYet, we find ourselves in a position as conservatives where our  warnings of the past echo upon a nearly empty Chamber as we discuss the  horrors of the day and the crimes that have been committed upon the  citizens we are sworn to serve that need not have been committed. This  is because of the culture…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…communities.\n\nI am proud to stand in support of these bills. I look forward to this  debate, and I hope my colleagues can stay focused on the topic in front  of us today as we discuss these proposals that are important to  American families and taxpayers.\n\nMr. Speaker, I am just a little confused. My colleague mentioned  ``whiplash,'' and I am feeling a…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…to give you some updates on my concern about  that and an update today on investigations that I have followed up on.\n\nAs we start a new congressional session, I am here to discuss, as I  have just said, an oversight topic of significant importance.\n\nFor over a decade, I have investigated the government's mismanagement  of migrant children and related…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699108/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…have  already made in reducing emissions.\n\nMr. GRIFFITH. Mr. Speaker, parliamentary inquiry.\n\nMr. GRIFFITH. When debating this resolution, H.J. Res. 35, is it  appropriate to discuss superfluous matters to the matter at hand  currently on the floor?\n\nMr. GRIFFITH. Thank you, Mr. Speaker.\n\nMr. GRIFFITH. Mr. Speaker, let me be clear: I meant no offense and…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}]