[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…financial  certainty, which they deserve, they need, and they were promised.\n\nAnd it would also help veterans like retired MSgt Gabriel Peterson of  Biloxi, MS. He was medically discharged as a result of reactive airway  disease. He is on five different drugs. They help with his breathing.  It is a struggle for him to live, and this act would ensure that he…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…the House floor is a wholesale attack on what is left  of the Clean Water Act. It is a one-two punch that would allow more  forever chemicals and harmful pollutants to be discharged into our  waterways with little regulation, while diluting the ability for States  and Tribes to take action to protect their communities.\n\nI continue to believe that there…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698044/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…was a 30-year-old nurse from Georgia and the mother of  a vibrant 5-year-old boy. She started to experience debilitating  headaches, and she sought medical care. She was discharged and her pain  was dismissed, as is so often the case for Black women in this country  and certainly in our healthcare system.\n\nThe next morning, Adriana woke up gasping for…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692035/adriana-smith"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…survived the  attack, and his colleagues note that his resilience has been a  testament to the strength and sacrifice of the Greatest Generation. Mr.  Drake was honorably discharged from the Navy on October 6, 1947. He was  awarded the World War II Victory Medal and the Asiatic-Pacific Campaign  Medal with two battle stars to honor his valor and dedication.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694839/recognizing-jesse-drake"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…servicemen wrote to President Truman. Perhaps the most pivotal  letter that Truman got came from Isaac Woodard, Jr., a World War II  veteran who, hours after being honorably discharged from the United  States Army, was dragged off a bus and beaten to near death and blinded  by police in Batesburg-Leesville, South Carolina.\n\nIn response to Woodard's letter,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…or other similar       State-authorized exam; or\n\n(iv)(I) has served, is serving, or has enlisted in the       Armed Forces; or\n\n(II) in the case of an alien who has been discharged from       the Armed Forces, has received an honorable discharge; and\n\n(E) the alien has sworn under penalty of perjury that the       alien--\n\n(i) has no unpaid applicable…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…knew that however sharp and heartfelt their       disputes and however keen their ambitions, they had an       obligation to work collaboratively to ensure the Senate       discharged its constitutional responsibilities effectively.       Our responsibilities are important--vitally important--to the       continued success of our Republic. Our arcane rules…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…we broke was the Congressional Review Act itself,  which says--I am reading from the text of the law:\n\nIn the Senate--\n\nWhich is where we are--       when a committee is discharged from further consideration of       a joint resolution--\n\nWhich means it has come to the floor, it is out of the committee,  which is procedurally where we are--       all…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…University of Missouri-Kansas City. In addition  to his education endeavors, Jim served during the Vietnam War in the  U.S. army as First Lieutenant and was later honorably discharged in  1971.\n\nAs an Operations Manager at Hallmark Cards, Jim had a 34-year  successful career before retiring in 2004. Being a Grandview native,  Jim decided to seek ways to…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696936/recognizing-the-life-and-memory-of-james-jim-neil-crain"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Cross. Following the fighting at D-day, Mr.  Lomell continued to serve his country in other battles, earning a  Silver Star. After receiving another injury, he was honorably  discharged in December of 1945.\n\nAfter the war, Mr. Lomell returned to New Jersey, where he settled in  Toms River. He graduated from Rutgers University Law School, married  and had…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693924/leonard-g-bud-lomell-va-clinic"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…and supporter of this bipartisan bill.\n\nI make the following unanimous consent: Notwithstanding rule XXII, I  ask unanimous consent that the Committee on the Judiciary be discharged  from further consideration of S. 1837 and the Senate proceed to its  immediate consideration.\n\nMr. DURBIN. Mr. President, it feels good. It feels good to see the  Senate…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Juan Vargas", "party": "Democrat", "sentence": "…worked as a Technical Illustrator, a skill that would later  influence his artistic career. He was recognized as a Newfoundland Air  Force Base Boxing Champion and honorably discharged as Sergeant.\n\nAn Associate of Arts graduate of Los Angeles Trade Technical-College,  Mr. Barajas first became involved with Chicano Park in 1973. Since  then, he has been…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694876/recognizing-salvador-barajas"}, {"senator": "James Risch", "party": "Republican", "sentence": "…from Congress to       Congress until the committee takes action to report it to the       Senate or recommend its return to the President, or until the       committee is discharged of the treaty by the Senate.\n\n(c) Floor Proceedings.--In accordance with Senate Rule       XXX.2, treaties which have been reported to the Senate but       not acted on before…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…and Green Island, in which he was awarded a Unit Citation for his  meritorious actions. He later worked in aviation electronics in North  Carolina before being honorably discharged in 1945. During the conflict  in Korea, Walter was also briefly called back to duty from the  Reserves.\n\nAfter his service, Walter has continued to be an upstanding American…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690722/recognizing-congressional-patriot-award-recipient-walter-hunter"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "Mr. MORENO. Mr. President, I ask that the Committee on the Judiciary  be discharged from further consideration and the Senate now proceed to  S. Res. 570.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698900/national-lung-cancer-awareness-month"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…moment's notice. Bill's heroic  efforts earned him the National Defense Service Medal, the Vietnam  Service Medal, and the Vietnam Campaign Medal. After being honorably  discharged in 1970, Bill served in the Army Reserves until 1975.\n\nAlthough his military service had ended, Bill stayed committed to the  honorable life of a public servant, becoming…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696330/recognizing-william-bill-forest-harris-with-a-congressional-veteran-commendation"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…occupation  until January of 1946. During his service, he traveled the world from  Australia to Africa to Japan and back home through the Panama Canal.\n\nHe was honorably discharged with the rank of Seaman 1st class.\n\nAfter the Navy, Edward built a long and successful career in the  floral industry and was known for his love of fishing, golfing,  hunting,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694105/recognizing-edward-eugene-holmes-july-veteran-of-the-month"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…with the U.S. Navy Nurse  Corps at Naval Air Station Memphis, Tennessee, where she ministered to  service members during the final months of World War II. She was  honorably discharged in January 1946 after devoting service to her  country.\n\nIn the closing days of her service, she met Ardell O. Kennedy at the  Memphis Naval Air Station. They married in…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696672/recognizing-anna-kathleen-cummins-kennedy"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…the Judiciary Committee's Rule X jurisdiction, and I       appreciate that you consulted with us on those provisions.       The Judiciary Committee agrees that it shall be discharged       from further consideration of the bill so that it may proceed       expeditiously to the House floor.\n\nThe Committee takes this action with the understanding that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694826/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Bill Hagerty", "party": "Republican", "sentence": "The PRESIDING OFFICER (Mr. Hagerty). Under the previous order, the  Committee on Finance is discharged from and the Senate will proceed to  the consideration of S.J. Res. 88, which the clerk will report.\n\nThe senior assistant legislative clerk read as follows:\n\nA joint resolution…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696489/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "Mr. COTTON.  Res. 104, H.J. Res.  105, and H.J. Res. 106, respectively, if the Senate companion measure  has been discharged from committee, and for Senator Schiff or his  designee to make a motion to discharge S.J. Res. 83.\n\nMr. COTTON. I know of no further debate on the nominations.", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696075/9999"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Judiciary Committee's Rule X jurisdiction,       and I appreciate that you consulted with us on those       provisions. The Judiciary Committee agrees that it shall be       discharged from further consideration of the bill so that it       may proceed expeditiously to the House floor.\n\nThe Committee takes this action with the understanding that       forgoing…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Committee on Foreign       Affairs on the text of H.R. 1765, the Promoting United States       Wireless Leadership Act of 2025. I agree that Foreign Affairs       may be discharged from further consideration of the bill, so       that it may proceed expeditiously to the House Floor.\n\nThis agreement is made with the understanding that it does       not…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693668/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Judiciary Committee's Rule X       jurisdiction, and I appreciate that you consulted with us on       those provisions. The Judiciary Committee agrees that it       shall be discharged from further consideration of the bill so       that it may proceed expeditiously to the House floor.\n\nThe Committee takes this action with the understanding that       forgoing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694815/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…is a veteran of the Second World War and served with the United  States Army from 1943 to 1946. He participated in the South Pacific  campaign, and after being honorably discharged, he joined the Army  Reserves in 1948 where he remained until 1985. For his distinguished  service, Ralph has received the Meritorious Service Medal, the Southern  Philippine…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690225/recognizing-congressional-patriot-award-recipient-ralph-odell"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Walt's expertise and commitment to service were clear. He  deployed to Afghanistan in 2010 to 2011 with the Army Reserves, where  he served honorably before being medically discharged.\n\nAfter leaving active service, Walt continued his commitment to  helping fellow Veterans by becoming involved in Veteran organizations,  including serving as the Commander…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692464/recognizing-the-life-and-service-of-united-states-army-veteran-walt-hartnett"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Judiciary Committee's Rule X jurisdiction, and I appreciate       that you consulted with us on those provisions. The Judiciary       Committee agrees that it shall be discharged from further       consideration of the bill so that it may proceed       expeditiously to the House floor.\n\nThe Committee takes this action with the understanding that…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}]