[{"senator": "Kathy Castor", "party": "Democrat", "sentence": "…interest and  not in the interest of polluters.\n\nMr. Speaker, FERC doesn't even want this power. They lack the  capacity and the staff for this highly technical work.\n\nWhen we discussed this bill 2 years ago, David Ortiz, then FERC's  Director of the Office of Electric Reliability, testified before the  Energy and Commerce Committee that FERC couldn't execute…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…inspired the More  Action for Students organization in northwest Indiana.\n\nI was greatly impressed with their knowledge of many important issues  and their sincere advocacy.\n\nWe discussed a variety of topics, including the significant cuts to  Federal Pell grants, the programs designed to help first-generation  college students.\n\nThey also shared their concern…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695393/recognizing-more-action-for-students-organization"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…endurance  and determination in hanging in there.\n\nHe is bringing up a critical issue and subject for America at a  critical moment, but I would like to return to an issue we discussed  this morning when I was visiting, and that is the issue of the  militarization of our Federal Government and its impact on States like  yours of Oregon and mine of Illinois.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696348/trump-administration"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…time to cut the Forest  Service. In fact, it is a time to hire up at the Forest Service because  we need them more than ever right now.\n\nWe need them for fighting fires as I discussed, for maintaining our  forests, but also for supporting recreation, maintaining roads and  trails, and producing timber that we all need for affordable housing,  and for water…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Speaker, I have no further speakers, and I am  prepared to close after hearing that the other side has no further  speakers. I yield myself the balance of my time.\n\nAs I have discussed, H.R. 2808 is an important positive step to  strengthen data privacy for consumers and curb the harmful practice of  trigger leads, protecting consumers from entities that…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692804/homebuyers-privacy-protection-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…are really the central item that is causing  damage to our economy right now.\n\nThe tariffs that have been imposed by President Trump on Canada, like  the Brazil tariffs we discussed yesterday or the ``Liberation Day''  tariffs we will talk about tomorrow, are proposed under the statute  IEEPA.\n\nYesterday on the floor, as I talked about the Brazilian…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "…much we hate it when you  guys fight amongst each other.\n\nThat wasn't enough, right? Then Representative Massie went to the  Republican meeting where the budget was being discussed, and he came  out, and he said: You know what, they convinced me.\n\nThey convinced me that he is a ``no.'' The reason he is a ``no,'' he  said, over the next 3 years, it is…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688029/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…consumers and allow the  kind of government oversight that is needed to protect our economy.\n\nAll of these amendments were rejected by committee Republicans.\n\nLast night, as we discussed the Defense spending bill, we also  pressed Republicans on how military families will be impacted by the  Medicaid cuts in Republicans' big, ugly bill.\n\nAbout 850,000 military…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…several       territories. We received a request for a decision as to       whether the Policy Notice is a rule for purposes of the       Congressional Review Act (CRA). As discussed below, we       conclude that the Policy Notice is a rule subject to CRA's       submission requirements.\n\nOur practice when rendering decisions is to contact the       relevant…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698437/us-government-accountability-office-opinion-letter"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…(Barred Owl ROD or ROD). We received a request       for a decision as to whether the Barred Owl ROD is a rule for       purposes of the Congressional Review Act (CRA). As discussed       below, we conclude that the ROD is a rule subject to CRA's       submission requirements.\n\nOur practice when rendering decisions is to contact the       relevant agencies…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693338/us-government-accountability-office-legal-opinion"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…Federal  Government will default in 2032, and people would see their Social  Security payments cut.\n\nMeanwhile, this bill also ignores the Trump regime's effort, which I  discussed, about the development of a digital file on every American  and the invasion of our privacy. It is good that this legislation  requires the Treasury Department's Do Not Pay…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…so  that we can fulfill our oversight role and verify the administration's  accounting of events. If the administration truly believes no lines  were crossed, no war plans discussed, and no classified information  shared, then they should release the messages and let Members of  Congress and the American people see for themselves, as the President  has…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689071/protecting-details-of-ongoing-military-operations"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…October 7, out of this country forever or to  deport them from the United States if they are already somehow here.\n\nThis approach is, alas, symptomatic of the syndrome we just discussed  in the last bill of the proliferation of redundant legislation and  redundant language simply to make a point.\n\nThe Judiciary Committee's standard visa sanctions language,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697236/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…Rather,       CRA's coverage broadly extends to all actions satisfying the       elements of the APA definition of a rule, so long as none of       CRA's three exceptions, discussed in detail below, applies.\n\nThough some information collections subject to the PRA's       requirements may not be rules under APA and CRA, the fact       that an agency action…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…It is unbelievable.\n\nMr. Speaker, once again, I rise in strong opposition to this bill. I  heard what the previous speaker said, and this rehashes the same thing  that we discussed with some of the bills that were voted on yesterday,  which is this notion that somehow fossil fuels are reliable and  renewables are not.\n\nThere are reliability problems…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…Dakota RMP).\\1\\ We received a request       for a decision as to whether the North Dakota RMP is a rule       for purposes of the Congressional Review Act (CRA).\\2\\ As       discussed below, we conclude that the North Dakota RMP is a       rule for purposes of CRA.\n\nOur practice when issuing decisions is to obtain the legal       views of the relevant…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693059/us-government-accountability-office-legal-opinion"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…City RMPA).\\1\\ We       received a request for a decision as to whether the Miles       City RMPA is a rule for purposes of the Congressional Review       Act (CRA).\\2\\ As discussed below, we conclude that the Miles       City RMPA is a rule for purposes of CRA.\n\nOur practice when issuing decisions is to obtain the legal       views of the relevant agency…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693085/us-government-accountability-office-legal-opinion"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…led the charge to  expose government abuses, curb reckless regulations, and protect hard- working taxpayers from Washington's overreach.\n\nAs my colleagues have so rightly discussed, the actions by the Biden  administration made it necessary for President Trump to declare a  national energy emergency on day one.\n\nThe Biden administration's green energy…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688158/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…respects States' authority to set higher  wage levels. This creates even more opportunities for tipped workers to  earn more, often far above the minimum wage.\n\nAs we have discussed at length in the Education and Workforce  Committee, Federal policy far too often treats a State like California  the same as Michigan or Arkansas. One-size-fits-all rarely…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698965/tipped-employee-protection-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Amendment (Buffalo RMPA). We received a       request for a decision as to whether the Buffalo RMPA is a       rule for purposes of the Congressional Review Act (CRA). As       discussed below, we conclude that the Buffalo RMPA is a rule       for purposes of CRA.\n\nOur practice when issuing decisions is to obtain the legal       views of the relevant agency…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695880/government-accountability-office-opinion-letter"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…was a MAHA mom. And my wife was  cooking MAHA food, as well. They seldom opened a box. If you are  opening a box to cook, think twice about it.\n\nAnother good option, as we discussed what the new guidelines are, is  putting water back where it belongs. I would argue water, whole milk-- those are your one-two drink alternatives, and certainly not sugary…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…things  to do.\n\nI want to walk through just a handful of quirky things. When you hear  people talk about DOGE and how upset they are, one of the primary  things that is being discussed is that the United States has a handful  of huge databases. The problem is, they don't talk to each other.\n\nYou saw the story last week of, hey, we just looked at some of…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "James Risch", "party": "Republican", "sentence": "…followed immediately by a record vote in open       session by a majority of the members of the committee or       subcommittee when it is determined that the matters to be       discussed or the testimony to be taken at such meeting or       hearing or series of meetings or hearings--\n\n(1) will disclose matters necessary to be kept secret in       the interests…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…technologies.\n\nIn November 2025, I convened a subcommittee hearing on export control  loopholes which leave American technology vulnerable, and this is where  we extensively discussed issues such as this one. H.R. 2683 was  reported favorably out of the House Foreign Affairs Committee by a vote  of 51-0. Mr. Speaker, we can't do better than unanimous,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698859/remote-access-security-act"}, {"senator": "John Boozman", "party": "Republican", "sentence": "…taking Senate action to ensure a balanced diet for school-age children.\n\nI rise today in support of S. 222, the Whole Milk for Healthy Kids  Act. This legislation, as we discussed, would allow for schools  participating in the National School Lunch Program to, once again,  offer whole and reduced-fat milk while also expanding the options for  nutritious…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697061/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…caucuses.\n\nWe have had a positive and productive process in Senate  appropriations this year, but the leader's motion to go to the House  Defense bill was not expected, was not discussed, and was not clear to  my caucus as to what happens next. So it is with some real regret that  I will vote no today but will continue to talk with my colleagues about  how…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696237/9999"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…risk that they will not get sick. We should  not have that in our country.\n\nIn July, the Health, Education, Labor, and Pensions Committee--the  HELP Committee, which I chair--discussed affordability across the  entire commercial insurance market, trying to find out why costs are  going up so high when you are buying your insurance through your  employer…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Plan (North Dakota RMP). We received a request for       a decision as to whether the North Dakota RMP is a rule for       purposes of the Congressional Review Act (CRA). As discussed       below, we conclude that the North Dakota RMP is a rule for       purposes of CRA.\n\nOur practice when issuing decisions is to obtain the legal       views of the relevant…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…securing $2.9 million in Federal funds. During the  legislative process, many students at Whiting Village School wrote  letters supporting the Mill Pond Dam project. When I discussed this  funding with my Senate colleagues, those letters made a difference. It  was impressive to see young people getting involved in the future of  their community.\n\nThis…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693257/town-of-whiting-200th-anniversary"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…be closed followed immediately by a recorded vote in open       session by a majority of the Members of the Committee when it       is determined that the matters to be discussed or the       testimony to be taken at such meeting or meetings:\n\n(a) will disclose matters necessary to be kept secret in       the interests of national defense or the confidential…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687982/us-senate-committee-on-rules-and-administration-rules-of-procedure"}]