[{"senator": "Greg Casar", "party": "Democrat", "sentence": "…a report indicating that there was substantial reason  to believe that Representative Cory Mills may have omitted or  misrepresented required information in his financial disclosure  statements, accepted excessive contributions to his campaign committee  in the form of personal loans and contributions that may not have  derived from Representative Cory…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695580/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…their money in  them, because of the Securities and Exchange Commission. Yet, the  CLARITY Act would allow companies to raise up to $200 million over 4  years without any disclosure and without any transparency, just by  tokenizing their security.\n\nLet's be clear. Putting a security on the blockchain doesn't make  investors safe. It might make money…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693785/digital-asset-market-clarity-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…language to clarify the FDA's long- held treatment of orphan drug exclusivity and bring new treatments to  more patients suffering from rare diseases. It will also allow for  disclosure of certain information related to drug formulations to  generic drug manufacturers to bring lower-cost medications to patients  more quickly.\n\nThese provisions all advance…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697277/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…is his goal and he will  accomplish that goal. He denied us that basic information.\n\nSo I have said I am opposing this nomination until we are given the  information and disclosure we need to do our jobs. The Secretary has  issued a pause on rulemaking that effectively halts efforts underway to  provide veterans, including K2 veterans suffering from…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691275/9999"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…years.  That is only 2 years of audited financials, keeping in line with what  is required when the EGC itself goes public.\n\nIn doing so, this bill streamlines the financial disclosure  obligations for emerging growth companies across the board making it  easier for them to raise capital from the public.\n\nI commend the gentleman from Iowa (Mr. Nunn) on…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692760/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…every single  Republican in this Chamber keeps voting to defend. It is called the  dark money system. There is no cap on the amount that can be donated.  There is no public disclosure to the American people.\n\nThe Supreme Court created this dual system, saying: You know, a cap  on money to the candidate--well, that could produce a conflict of  interest…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…crypto asset, own the  majority of tokens, and then anyone who wants to buy that politician's  attention or votes can just invest in the asset. There is no oversight  or disclosure requirement. There is deniability on both sides of the  transaction. Any person, any foreign country can bribe and buy  politicians through cryptocurrency like this. Those…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…President, a lot of people actually care. We know that MAGA  was all in on Jeffrey Epstein. My Republican colleagues have sent  letters, they have posted, and they have demanded disclosure. Donald  Trump, Jr., the President's own son, has tweeted dozens of times about  this case.\n\nFBI Director Kash Patel swore under oath in front of the Senate that  he would…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693624/release-the-epstein-files"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Mr. Speaker, I rise in opposition to this resolution. We are here  today on the floor to support the complete disclosure of information  related to Jeffrey Epstein and his billion-dollar, international child  sex-trafficking ring. Our side of the aisle, at least, supports the  release of information…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…undermined public safety,  delayed projects, and contributed to cost overruns. Our bill seeks to  avoid these potential conflicts of interest, while also mandating  public disclosure of any private inspection contracts used by state and  local transportation departments when public inspectors are  unavailable.\n\nMr. Speaker, I encourage all Members to…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692433/introduction-of-the-public-inspectors-for-safe-infrastructure-act"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…getting it wrong would be enormous. My  approach would not have stopped this project. It would not have  dismantled anything. It simply would have required transparency, basic  disclosure of how Social Security data has been used or misused by the  Trump regime in the creation of this centralized database.\n\nYet, despite the gravity of these concerns, Republicans…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…inadvertently discouraged capital flows into BDCs, constraining their  ability to serve small businesses. The rule--part of the SEC's Acquired  Fund Fees and Expenses (AFFE) disclosure framework--requires mutual  funds and other investment vehicles that invest in BDCs to disclose the  management fees, expenses, and AFFE of the BDC itself.\n\nThis has the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697831/increasing-investor-opportunities-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…already passed the Senate one time before.  Senator Grassley and I worked together in 2018, because we knew that 88  percent of the American people support what we are doing--disclosure of  price and reduction of the cost of drugs to consumers.\n\nIn fact, because of our work, President Donald Trump made a  statement.\n\nBig announcement . . .--\n\nThe President…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694204/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…require employers to provide the salary range for jobs  in advertisements and interviews and to existing employees.\n\nSeveral states have enacted laws relating to salary range disclosure,  and the Federal Government should follow their lead and make salary  range disclosure a national requirement. Salary transparency is an  important tool to combat the gender…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688710/introduction-of-the-salary-transparency-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…This is the one that limits overdraft fees to $5 for the big banks,  the 175 biggest banks, or they can charge what their actual cost is if  it is more than $5. It requires disclosure of what these overdraft fees  are going to be.\n\nIt will save American consumers $6.1 billion every year. If we are  concerned about inflation, why shouldn't we tell the banks…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689952/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…practices to avoid online       fraud or being defrauded by a member of an online dating       service, which may be provided through a link to another web       page or disclosure.\n\n(E) Contact information to reach the customer service       department of the online dating service provider.\n\n(3) Manner and timing.--\n\n(A) Manner.--A fraud ban notification…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692730/romance-scam-prevention-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…House on the state of the Union,  reported that that Committee, having had under consideration the bill  (H.R. 1048) to amend the Higher Education Act of 1965 to strengthen  disclosure requirements relating to foreign gifts and contracts, to  prohibit contracts between institutions of higher education and certain  foreign entities and countries of concern,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…Greater  transparency in education will reveal where school funds come from and  whether foreign adversaries are exploiting financial ties to influence  students.\n\nBy requiring disclosure, we protect American values, strengthen  national security, and ensure our children learn what is right, not  what our adversaries dictate.\n\nMr. WALBERG.  I say that as a…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697409/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…inserting itself into the  prosecutorial process for political motivations, driven heavily by  hatred of President Trump.\n\nWe should be concerned about victim privacy, risking disclosure of  noncredible allegations of child sexual abuse materials, and future  investigations. However, here is the deal: The leaders of this Nation  must expose abuses by the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696812/epstein-files-transparency-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Representatives.\n\n``(B) Publication.--Each report submitted under this       paragraph shall be published on a publicly accessible website       of the Coast Guard.\n\n``(f) Disclosure.--The Commandant and the Superintendent of       the Academy shall ensure candid and complete disclosure to       the Board, consistent with applicable laws relating to…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…of Americans who are looking for financial security and a better  future. I want to take a minute to highlight my bill which is included  in this package.\n\nThe Improving Disclosure for Investors Act directs the Securities and  Exchange Commission to promulgate rules with respect to electronic  delivery of certain required disclosures to investors.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697832/increasing-investor-opportunities-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…APPLICATION.\n\n``Not later than 6 months after the date of enactment of       this section, the Director shall, by regulation or order,       require each enterprise to include a disclosure below the       military service question which shall be above the signature       line on the form known as the Uniform Residential Loan       Application stating, `If yes,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Rules Committee report (H. Rept. 119-299)  to accompany House Resolution 722 should have included in its waivers  of all points of order against consideration of H.R. 5371 a disclosure  of the following violations:\n\nSection 303 of the Congressional Budget, which prohibits  consideration of legislation providing new budget authority, a change  in revenues,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696091/report-h-rept-to-accompany-h-res-722"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…``(III) with respect to which a person is required to       submit a report to the Secretary of Agriculture under section       2(a) of the Agricultural Foreign Investment Disclosure Act of       1978.\n\n``(iii) Sunset.--The requirements under this subparagraph       shall terminate, with respect to a foreign person of the       respective foreign country,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692799/agricultural-risk-review-act-of-2025"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…over  congressionally mandated proxy script disclosures. This section turns a  capital formation package into another compliance mandate by hardwiring  a one-size-fits-all disclosure regime into statutes instead of letting  the markets and existing disclosures do their jobs.\n\nStriking section 307 keeps the INVEST Act focused on expanding  opportunity…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697825/increasing-investor-opportunities-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…disclosures were to Congress, not to the  media.\n\nThe same Department of Justice's opinion also says in footnote No. 2  that a separate statutory provision exists that ``protects disclosure  to Congress using significantly different language and raises distinct  issues that we don't discuss in this opinion.''\n\nThe same Department of Justice opinion also says,…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…required to be provided in the reports required by this       subsection (other than the information required by paragraph       (2)(C)) shall be exempt from public disclosure pursuant to       section 1761(h)(1).\n\n``(4) Protecting enforcement information.--In preparing and       submitting a report under subsection (e), the Secretary shall…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690696/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Director shall designate an       internet website on which guidance documents shall be       published under section 3.       SEC. 5. DOCUMENTS AND INFORMATION EXEMPT FROM DISCLOSURE                     UNDER FOIA.\n\nIf a guidance document issued by an agency is a document       that is exempt from disclosure under section 552(b) of title       5, United…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688391/guidance-out-of-darkness-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…assess our education system  this week by advancing the DETERRENT Act, to protect our higher  education institutions from foreign influence by strengthening gift and  contract disclosure requirements and potentially banning contracts from  foreign entities of concern.\n\nI applaud  Michael Baumgartner, a new freshman out of Washington, for  his work on this…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…from the Secretary of Defense with respect to an application       that is subject to approval by the Department of Defense,       including technology security and foreign disclosure release       determinations.       SEC. 4. REPORTS.\n\n(a) In General.--The Secretary of State shall submit to the       Committee on Foreign Affairs of the House of Representatives…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694830/international-traffic-in-arms-regulations-licensing-reform-act"}]