[{"senator": "Al Green", "party": "Democrat", "sentence": "…to tax them so that he could then  return money, some to them if they were qualified but much to  billionaires who would qualify.\n\nThis is, in my opinion, a shameful and disgraceful way for the  President to tell people that they are going to get a tax break when it  is really their money that is being returned to them by way of this  tariff.\n\nI would…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…I have served in this body, as I mentioned previously, Mr. Speaker,  for 6\\1/2\\ years, and I have seen a lot of partisan debate unfold on  this floor, but I think it is disgraceful to not give my community an  opportunity to see our resolution considered on this floor.\n\nI don't know how the Republican majority can force a vote on a  resolution like…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692191/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…percent of the  files have been released. What the hell is taking so long? What is he  so afraid of? What is he hiding?\n\nIt has been clear to me since day one of Donald Trump's disgraceful  Presidency what it has been all about. Look at who was in the front row  of his inauguration, all billionaires: his Treasury secretary, a  billionaire; his education secretary,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…patients' medical interest  or decisions.\n\nYet, my Republican colleagues want to divert Federal TANF funding  away from families in need and to these clinics instead. This is a  disgraceful diversion. If my Republican colleagues were serious about  helping children and families in need, let them speak out against this  administration's illegal payment freeze…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699230/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…another priority where they can sell more guns with less  restrictions in our country, where we have this problem where we lose  over 100 lives a day due to gun violence, is disgraceful. My hope is  everyone will vote ``no'' on this amendment.\n\nMr. Chair, I yield back the balance of my time.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695142/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…our democracy. I am  calling on my Republican colleagues to join us in demanding a  bipartisan investigation into this incident.\n\nWhat happened at this press conference was disgraceful. It was un- American. And every Member of the U.S. Senate should condemn it and  condemn it now.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692473/alex-padilla"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…faster than  we thought. Remember that, just by its nature, monetizing the human  harm caused by fossil fuel emissions disrupting our climate and natural  systems is an almost disgraceful undercount of the actual damage to  what one writer called our ``planetary solvency.'' As another author  wrote:\n\nWhile the social costs--understood as costs to people--of…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…and the 250,000  students enrolled in bachelor's, master's, and doctoral nursing  programs across the United States, this decree that they are not  professionals is both a disgraceful insult that shocks the conscience  and an order which will condemn America's nurses into second-class  status for Federal graduate student loan assistance.\n\nMadam Speaker,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697261/nursing-excluded-as-professional-degree-by-department-of-education"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Venezuela. In 2018, I had the opportunity to  visit Venezuela--a once prosperous, albeit imperfect democracy,  suffering terrible economic and political decline under the disgraceful  and failed leadership of Nicolas Maduro.\n\nI told then-President Maduro that if he rigged any upcoming  elections, Venezuelans would be even more isolated and endure further…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696557/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…gang of violent extremists failed in their  mission to undermine our democracy that day, but make no mistake,  Donald Trump continues to bear direct responsibility for this  disgraceful attack, an attack that forever scarred our political system  and scarred our Nation.\n\nWe cannot, and we must not forget, what happened on January 6, 2021.  That morning,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698517/anniversary-of-january-6"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…heartbreaking for these students, who have worked so hard to  join the workforce, to have the rug pulled out right from underneath  them with only hours of notice. It is disgraceful that our government  would turn its back on them like this.\n\nThere is one young person in my district in the city of Detroit whose  mother has cancer. She is trying to seek…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691869/job-corps-cuts"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…and insulate themselves from accountability. That is not what we are,  or at least we weren't until last week, when nearly every single House  Republican voted for this disgraceful provision of law after rejecting  Democratic amendments to strip it from the bill.\n\nMy Republican colleagues had every opportunity to stop this provision  from ever becoming…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696924/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…scalpel; he did not cut the arm  off with a chain saw. Let's give up Elon Musk's chain saw, and if there  is waste, do it with a scalpel.\n\nThese first 100 days have been disgraceful and shameful, cruel and  dumb, deeply un-American. These VA employees are the ones delivering  healthcare to the people we love and revere.\n\nTo my colleagues across the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…does pardoning this criminal send to parents  who have lost children to narcotics, to law enforcement officers  risking everything to stop the flow of deadly drugs?\n\nThis disgraceful pardon should be met with bipartisan condemnation as  an affront to our values, our safety, our rule of law, and our  democracy.\n\nThose who do not join in that condemnation…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697367/shameful-hernandez-pardon"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…his obeisant Republicans cut out the cheapest way to  get new power and new electrons on the grid--solar energy. They cut it  out in obeisance to the oil industry. It was disgraceful.\n\nThat is what is wrong with this government--the corruption. The oil  industry promises Donald Trump that Harold Hamm will raise him a ton of  money, so Trump cuts out…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…here in our country illegally, and he is taking a  hard look at anyone who has been improperly vetted. His actions will  make America safer and more secure.\n\nJoe Biden's disgraceful withdrawal was not an isolated failure. It  was part of a pattern of dangerous, destructive, and deadly policies.  More than 10 million illegal immigrants entered our country…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697341/trump-administration"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Mr. Speaker, the FEC rejected Ms. Ravel's complaints since it was  completely made up. This was the very body that she was once the  supposed chair of. It was a completely disgraceful thing that she did.  Yet, that attempt also, of course, failed.\n\nAll three of these attempts to undermine the opportunity for voters  to even vote on this fairly failed.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Hoeven, as well as my former House colleague and  good friend, Governor Kelly Armstrong, for their work in supporting the  CRA.\n\nThis CRA allows us to turn the page on a disgraceful chapter of  radical environmentalism pursued at the expense of the American people.  H.J. Res. 105 removes the bureaucratic barriers designed to prevent the  use of our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…ensure that California remains as having among  the worst education outcomes in the country, especially for students in  underserved communities.\n\nThe bill is so bad and disgraceful that almost 20 Democrats just  didn't even vote at all. They abstained. They knew it was terrible, but  they didn't want to go against their party, the Governor, or special…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}]