[{"senator": "Julie Johnson", "party": "Democrat", "sentence": "He has  mocked climate scientists, dismissed decades of evidence, even as  Americans suffer record floods, droughts, and wildfires."}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "But any       court challenge will be without merit, and indeed likely will       be dismissed as presenting a political question."}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "He dismissed commissioners from the Federal agency responsible  for enforcing workforce civil rights, and he stripped the National  Labor Relations Board of its quorum."}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "Families  were told to stay quiet while bright and brilliant minds were  dismissed, and today that door is closing again, eerily quickly because  of the Trump administration's reckless and cruel agenda."}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "Instead, they withheld, dismissed, and covered  up."}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "These servicemembers were just dismissed by this  administration."}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Meanwhile, Paramount settles a lawsuit with President Trump over a  dispute that could have been easily dismissed, which is defended as  freedom of the press, or not."}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "So now, what we are seeing is that lawsuits are  being dismissed."}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "We have seen the Chairman and Deputy Chairman of the National  Intelligence Council dismissed because their well-documented, evidence- based assessment of the Venezuelan Tren de Aragua criminal network did  not align with the administration's preferred narrative."}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "I rise to urge my colleagues across the aisle to show some  humanity and compassion to the thousands of veterans who have been  recklessly dismissed from their civil service jobs at the political  whim of this administration."}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "They were  dismissed."}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "But any       court challenge will be without merit, and indeed likely will       be dismissed as presenting a political question."}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "Already, 2,400 VA employees have been dismissed."}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "Federal judges appointed by Presidents of  both parties dismissed these cases for a lack of evidence."}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "United States dismissed an  opportunity to affirm that emergency abortion care is protected under  Federal law."}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "They  were all dismissed by the BLM."}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "The treaty was dismissed after the passage  of the General Allotment Act, and the Tribe's lands were separated into  2,340 80-acre allotments to individual Tribe members."}, {"senator": "Ben Cline", "party": "Republican", "sentence": "We cannot allow the failures of  socialist systems abroad or here in the United States to be rewritten,  dismissed, or forgotten."}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "Cases can be dismissed before the merits are even  heard, putting taxpayers at risk for losing their claim when they are  not at fault for missing the deadline."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Instead of coming clean, the previous administration dismissed and  failed to answer my oversight request."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Real commitments were made, and they were dismissed."}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "The case was dismissed by the Court as the       victim's family ``failed to plead claims that withstand       Omegle's Section 230 immunity.'' The platform has since       ceased operations."}]