[{"senator": "John Mannion", "party": "Democrat", "sentence": "That is why my very first bill was the Protecting Students With  Disabilities Act, which would protect IDEA programs from the illegal  dismantling of the Department of Education.", "title": "Protecting Education for Children with Disabilities", "date": "2026-01-13"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "Speaker, I rise because dismantling the Department of Education  is not just bad policy.", "title": "Protecting Education for Children with Disabilities", "date": "2026-01-13"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "At first glance, it may appear that dismantling the Department of  Education and imposing slapdash sky-high tariffs have little in common  beyond their destructiveness.", "title": "Education is of Great Importance to Congressional Black Caucus, Congress, and Constituents", "date": "2025-04-07"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "President Trump is attacking the right to vote with respect to  dismantling of the Department of Justice organization of attorneys who  are being punished for their efforts to protect that right to a vote.", "title": "Terminating the National Emergency Declared to Impose Global Tariffs", "date": "2025-04-30"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Republicans' obsession with  dismantling the Department of Education appears to be the only  education policy they really have.", "title": "Protecting Education for Children with Disabilities", "date": "2026-01-13"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "First, when we talk about protecting the Department of Education, I  think we have to first--when we talk about dismantling the Department  of Education, we keep saying we are going to return education to the  States.", "title": "Dismantling the Department of Education", "date": "2025-12-15"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Transparency and accountability in education are under assault with the  dismantling of the Department of Education, which leaves student  veterans and their hard-earned benefits at risk of exploitation and  fraud.", "title": "Veterans Education Transparency and Training Act", "date": "2025-04-07"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "On top of that, it has been credibly reported that the Trump  administration has started dismantling the Department of Education,  including the staff who oversee these IDEA programs.", "title": "Protecting Education for Children with Disabilities", "date": "2026-01-13"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "At the same time as  congressional Republicans are creating additional bureaucratic hurdles  for K-12, the Trump administration is actively dismantling the  Department of Education.", "title": "Transparency in Reporting of Adversarial Contributions to Education Act", "date": "2025-12-03"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "The dismantling of the Department of Education is not reform.", "title": "Dismantling Department of Education is Not Reform", "date": "2025-12-12"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Speaker, I rise today to condemn in the strongest  possible terms the illegal and unconstitutional dismantling of the  Department of Education by the Trump administration.", "title": "Trump Administration Dismantling Department of Education", "date": "2025-12-02"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "My colleagues across the aisle  have remained silent as the administration has dismantled or is in the  process of dismantling the Department of Education, undermining its  legitimacy, capacity, and effectiveness.", "title": "Combating the Lies of Authoritarians in School Systems Act", "date": "2025-12-03"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "On March 20, 2025, the President signed an executive order directing  the Secretary of Education, Linda McMahon, to facilitate the  dismantling of the Department of Education, which raises significant  questions about the future of IDEA and the impact on the education of  these 7.5 million children.", "title": "Protecting Education for Children with Disabilities", "date": "2026-01-13"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "Donald John Trump has withheld funds and terminated en masse Federal  employees and numerous Federal agencies and departments, including the  following:\n\nOne, directed the dismantling of the Department of Education.", "title": "Notice of Intention to Offer Resolution Raising A Question of the Privileges of the House", "date": "2025-05-13"}]