[{"senator": "Shontel Brown", "party": "Democrat", "sentence": "Two, more than 20 employees resigned from DOGE, refusing to  ``jeopardize Americans' sensitive data, or dismantle critical public  services.''\n\nThree, one of Musk's companies secured a lucrative FAA contract,  laying bare his blatant conflicts of interest."}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "Speaker, I rise today to speak in defense of one of the most  important civil rights laws Congress has ever passed, the Individuals  with Disabilities Education Act and to oppose the dangerous and  unlawful efforts to dismantle the Department of Education."}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "I have consistently voted to provide law enforcement with  the resources they need to dismantle these criminal networks."}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Since taking office, this administration has made every effort to  dismantle public health."}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Republicans are looking to dismantle the basic Medicaid Program to help  the tax cuts for billionaires."}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "McMahon will be a rubberstamp on  President Trump's agenda to dismantle the Department of Education."}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "18 which would  dismantle important protections against predatory overdraft practices."}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "They were concerned about costs to Medicaid and  threats from Elon Musk to dismantle Social Security."}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "For the  last 15 years, all they have done is try to repeal, defund,  deauthorize, and dismantle the Affordable Care Act with no alternative  ever presented."}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "This action is yet another example of the cruel actions taken to  dismantle programs for our families."}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Only  Congress can dismantle it, something I will fight every step of the  way."}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "This is nothing more than an attempt to dismantle Social Security  from the inside."}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "It is  what we must do now as a Presidential administration, emboldened by  hatred and vengeance, seeks to weaken and dismantle Federal programs  that support our veterans, care for our seniors, and defend our Nation  from public health emergencies, just to name a few."}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Speaker, finally, I rise today to address the  administration's efforts to dismantle a cornerstone of American speech,  our public media system."}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Now is not the time to dismantle an agency that supports older  adults and people with disabilities."}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "I will always oppose any effort to defund, demoralize, or  dismantle the law enforcement agencies that keep our streets safe."}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "Now, my friends across the aisle are going to say that eliminating  the zero-dollar premium will prevent people from getting a plan and  that it is a trap to dismantle the ACA."}, {"senator": "Blake Moore", "party": "Republican", "sentence": "The confusion of why would you dismantle the Department of Education,  I will make sure I do my part, and I have spoken about this to a lot of  constituents back home."}, {"senator": "John Thune", "party": "Republican", "sentence": "We have also been able to dismantle Democrats' regulatory assault on  Americans' cars."}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "They want to weaken American power and  dismantle our influence across the globe."}, {"senator": "Brad Knott", "party": "Republican", "sentence": "With this information, law enforcement and their intelligence  counterparts will be better able to deploy a unified and focused  strategy on how to appropriately dismantle and remove these threats  from our country."}, {"senator": "Brad Knott", "party": "Republican", "sentence": "With the tools in this bill, investigators and prosecutors will be  better able to dismantle organized crime rings across America."}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "Last year, the United States, working with our international  partners, utilized blockchain technology to help dismantle a Russian  money laundering scheme that seized more than $22 million in illicit  funds, many of those taken from Americans right here at home."}, {"senator": "David Valadao", "party": "Republican", "sentence": "Without authorization, Southern California Edison would be forced to  dismantle critical infrastructure, costing ratepayers in the region  tens of millions of dollars and eliminating a clean, reliable, and  affordable source of energy."}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "The legislation also  equips the Drug Enforcement Agency and the FBI with resources necessary  to dismantle drug trafficking networks that have gained, unfortunately,  a stronghold and a foothold in the United States and to combat the  fentanyl crisis that continues to claim way too many American lives."}, {"senator": "Chip Roy", "party": "Republican", "sentence": "We are going to channel all  the anger that we have over the organized campaign that led to this  assassination to uproot and dismantle these terrorist networks."}]