[{"senator": "Jim Clyburn", "party": "Democrat", "sentence": "At first glance, it may appear that dismantling the Department of  Education and imposing slapdash sky-high tariffs have little in common  beyond their destructiveness.", "title": "Education is of Great Importance to Congressional Black Caucus, Congress, and Constituents", "date": "2025-04-07"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "We should be  building the EV infrastructure for the future, not dismantling climate  progress.", "title": "Providing Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine and Nonroad Engine Pollution Control Standards; the `omnibus' Low NoX Regulation; Waiver of Preemption; Notice of Decision''", "date": "2025-05-22"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "You are dismantling our capacity  to even name the problems we face, let alone fix them, but we are  renaming bodies of water.", "title": "Gulf of America Act", "date": "2025-05-08"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Speaker, I am horrified, and I am outraged that Trump is actively  dismantling our ability to respond to the opioid crisis moving forward.", "title": "Providing for Consideration of H.R. Support for Patients and Communities Reauthorization Act of Providing for Consideration of H.R. Save Sba From Sanctuary Cities Act of Providing for Consideration of H.R. American Entrepreneurs First Act of and Providing for Consideration of H.R. Capping Excessive Awarding of Sblc Entrants Act of 2025", "date": "2025-06-04"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "They are  dismantling the priorities of the people as passed through the people's  House and through the Senate and signed into law.", "title": "Federal Law Enforcement Officer Service Weapon Purchase Act of 2025", "date": "2025-05-15"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "That is why the Trump administration's dismantling of the Department  of Education, the decimation of special education enforcement, and the  hollowing out of the Office for Civil Rights is so dangerous.", "title": "Protecting Education for Children with Disabilities", "date": "2026-01-13"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "Did you speak up at a time when the President of the United States  was launching trade wars against our closest allies, when he was firing  regulators who investigate America's biggest banks and biggest  corporations to stop them from taking advantage of the little guy or  the little gal or my grandmother or your grandfather, dismantling the  Agency that protects consumers from fraud--the only one whose sole  purpose is to look out for them?", "title": "Privileges of the Floor", "date": "2025-03-31"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "That is why Democrats are standing here tonight: to stand up for our  students, to stand up for our young people, to fight back against these  attacks, and to take a stand against the dismantling of these vital  programs.", "title": "Protecting Education for Children with Disabilities", "date": "2026-01-13"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "However, we must acknowledge that this legislation came to the House  Floor at a time when the Trump administration is systematically  dismantling our Nation's mental health and substance use treatment  programs.", "title": "Support for Patients and Communities Reauthorization Act of 2025", "date": "2025-06-06"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "The House approved this bill in February, and since that time, the  Trump administration has set its sights on dismantling our Nation's  public health infrastructure, including the agency directly responsible  for addressing mental health and substance abuse disorders.", "title": "Halt All Lethal Trafficking of Fentanyl Act", "date": "2025-06-11"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "It is  a regime hell-bent on dismantling the Federal Government.", "title": "-9999", "date": "2025-11-19"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "They have put in place a dismantling of the Medicaid program.", "title": "Protecting Healthcare for Millions of Americans", "date": "2026-01-08"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Importantly, it reasserts congressional oversight  over critical independent agencies that were targeted for dismantling.", "title": "Financial Services and General Government and National Security, Department of State, and Related Programs Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "That is why my very first bill was the Protecting Students With  Disabilities Act, which would protect IDEA programs from the illegal  dismantling of the Department of Education.", "title": "Protecting Education for Children with Disabilities", "date": "2026-01-13"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "He wants the country to continue  spiraling into chaos so that he can keep stealing from our communities  and dismantling Congress' power of the purse.", "title": "-9999", "date": null}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "What they are now plotting is a special election where they will use  confusing ballot language and other means of deception to try to  convince voters--to fool voters--into dismantling the very independent  commission that they recently established.", "title": "Dismantling California's Citizens Redistricting Commission", "date": "2025-07-23"}, {"senator": "Ted Budd", "party": "Republican", "sentence": "In a region still working to recover from the devastation caused by  Hurricane Helene, dismantling this trafficking ring has brought a  renewed sense of hope and security for Western North Carolinians.", "title": "Operation Uptown Funk", "date": "2025-06-27"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Finally, we have brought transparency and common sense back to our  institutions, dismantling DEI mandates, and restoring fairness, merit,  and basic common sense.", "title": "Highlighting Republican Successes in 2025", "date": "2026-01-21"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "By dismantling a longstanding standard, and eliminating automatic  approval for certain applications, the Biden administration's actions  risk stifling competition and innovation in the financial sector.", "title": "Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Office of the Comptroller of the Currency of the Department of the Treasury Relating to the Review of Applications Under the Bank Merger Act; Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Review of Final Rule Reclassification of Major Sources As Area Sources Under Section 112 of the Clean Air Act''; and Waiving A Requirement of Clause 6(A) of Rule Xiii with Respect to Consideration of Certain Resolutions Reported From the Committee on Rules", "date": "2025-05-20"}]