[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…disruptions disrupt the natural  environments that they need.\n\nThe first biggest shock will come through insurance markets as  climate risks make real estate uninsurable. This disruption kicks off a  cascade: Climate risk collapses insurance markets; insurance collapse  cascades into mortgage markets; mortgage collapse cascades into  property value losses;…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…heritage.\n\nEqually vital, the 9,000-strong Gwich'in Nation, whose subsistence  and culture depend on the caribou herd, reside along the herd's  migratory route, making any disruption not only a threat to  biodiversity but also an assault on indigenous livelihoods and  traditions.\n\nLet me read a quote from the Executive Director of the Gwich'in  Steering…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…get these questions  answered. I could go on and on about this Cabinet sharing war plans on  Signal chats.\n\nDo I have to tell you more about the chaos, Mr. Speaker, the  disruption? Do I have to tell you more about the uncertainty and the  situation that we find ourselves in, Mr. Speaker?\n\nWe are here trying to place a lid on these overdraft fees because…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689845/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…the variation among State systems, some of which       are decades old, it is unclear how many States will complete       the changes in an automated manner with minimal disruption       versus manual overrides or computations that could lead to       payment errors and significant delays. See Penn Decl. Doc.       No. 14-2 \f 24.\n\n29. For at least some…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…receives about $400 million from the Child Care and  Development Fund and another $500 million from TANF that help low- income working families afford quality childcare.\n\nDisruption to this funding will have substantial, immediate, and  destructive consequences to children, families, businesses, and  communities.\n\nI am upset but not shocked that the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699231/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…garment factories.\n\nThese sudden and large-scale operations, which led to       numerous arrests, were reportedly conducted without prior       notice, causing severe disruption and significant damage to       the affected businesses.\n\nDisturbingly, reports indicate that individuals with       limited English proficiency or those unable to immediately…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…services and inputs--from agricultural equipment to digital and  logistic services to energy and finance--supporting jobs at home and  abroad.\n\nIn an era of global economic disruption, AGOA helps U.S. companies  diversify supply sources and build resilient and market-oriented  networks in key sectors, including textiles, agriculture, and renewable  energy.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…course of the last several months, not only  has he not made it more efficient, but he has mired the Federal  Government in constant litigation and constant dismantling, disruption,  and chaos of our agencies.\n\nNow, he is telling us that he is going to leave the Federal  Government in just a few weeks to expand his data and AI operations, as  he announced…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689400/demanding-answers"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…allies and donors; firing talented, career-committed professionals and  replacing them with blind loyalists; insulting Canada, Mexico, Denmark,  and the European Union; disruption of programs; threats to  universities, law firms, State and local governments, the Federal  workforce, and the media; and threats to elected officials.\n\nThe American people…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690483/trumps-100-days"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…House. I am not here because  I am so smart. I am not here because of brilliancy or good looks. I am  here because people made great sacrifices. It was incivility, and it  was disruption, but they were prepared to suffer the consequences.\n\nWe are going to have to resort to the same tactics that we used in  the sixties, but we did it for a worthy and noble…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688663/incivility-in-chamber"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…approximately 16,000 Haitian residents, making it the       2nd largest Haitian community per capita in the United       States. The decision to end TPS would be a devastating       disruption to the social and economic fabric of our city.\n\nIn recent weeks and months, my office has been inundated       with calls, emails, and walk-ins from constituents who are…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…developed over more than a decade of engagement  with a variety of stakeholders: scientists, experts, indigenous  communities, NGOs, and industry.\n\nIt aimed to limit the disruption and ecological harm from existing  oil and gas development while also designating special areas to protect  habitat for the many species that call this amazing place home.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…executive overreach.\n\nThis will provide much-needed funding and certainty to public land  management agencies, like the National Park Service, that have suffered  tremendous disruption over the past year.\n\nThe bill also protects funding for programs important to combating  and adapting to climate change. It rejects House Republicans' effort to  gut funding…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698754/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…increasingly feeling uncertain about the future of the  country. The small business landscape is littered with obstacles like  finding qualified workers, dealing with supply chain disruption as they  adjust to the President's tariff regime, and adopting new technologies  in order to stay competitive. These economic headwinds make SBA  services more important…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697219/made-in-america-manufacturing-finance-act"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…manufacturers from Indiana. They  make essential products in the construction, automotive, energy, and  agricultural industries. Rising costs on inputs, market uncertainty,  and disruption in supply chains are harming these businesses and  putting millions of good-paying jobs at risk.\n\nWhen costs for these businesses rise, so does the cost of living for  the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695607/devastating-harm-caused-by-trump-administration"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…It is a co-op making drugs,  selling insulin cheaper than our Federal Government-subsidized price.\n\nThe fact of the matter is legalizing, encouraging, and incentivizing  disruption in the market is where you get all sorts of different  channels. If PBM is the best price, God bless them. If the drug company  wants to sell directly to consumers, bless…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…boosting domestic  manufacturing and innovation.\n\nTo remain at the forefront of the next generation of technology, we  must thoroughly assess and protect our supply chain. Any disruption  threatens not only our progress but also our national security, our  economic strength, and our global position in the artificial  intelligence race.\n\nThis amendment strengthens…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697894/electric-supply-chain-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…cyber       actors, including Volt Typhoon, of the People's Republic of       China.\n\n(C) A classified assessment of the extent of potential       destruction, compromise, or disruption to United States       critical infrastructure by State-sponsored cyber actors,       including Volt Typhoon, of the People's Republic of China in       the event of a major…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…achieving compliance;\n\n(ii) the Administrator, in consultation with the Secretary       of Transportation, determines additional time is required to       mitigate a significant disruption to air transportation; and\n\n(iii) the Administrator determines the aircraft operator or       owner does not have any uncorrected violations of subchapters       F and G…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…result of enacting H.R. 3633. Depending on their       individual design and extent of adoption, virtual currencies       could enhance the efficiency of the system, cause disruption,       or reduce bank deposits. Those effects are uncertain and,       given their potential range, CBO cannot currently estimate       their direction or magnitude.\n\nIncrease…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693775/digital-asset-market-clarity-act-of-2025"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…in the region  tens of millions of dollars and eliminating a clean, reliable, and  affordable source of energy.\n\nThis bill ensures that Kaweah can keep operating without disruption  or unnecessary costs for families across California.\n\nMr. Speaker, I thank Chairman Westerman and his staff at the  Committee on Natural Resources for their work on this…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693463/amendment-to-kaweah-project-provision"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…significantly benefIted from duty-free access to the U.S.       market through AGOA. Given the infancy of the beef export       relationship with the United States, a disruption to AGOA       could risk its sustainability and undermine capital       investments within the sector.\n\nSustaining a positive economic relationship with Namibia is…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…actors, often aim to exploit high-      density public gatherings, critical infrastructure, and key       transportation hubs, causing mass casualties and widespread       disruption.\n\n(4) Emerging automotive technologies, such as autonomous       vehicles, Advanced Driver Assistance System (ADAS)       capabilities, and ride-sharing platforms, create…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…reserve the balance of my time.\n\nMr. STAUBER. Mr. Speaker, H.R. 972 will ensure that the people of  southern Nevada have a more reliable water supply with fewer risks of  disruption. This legislation shows we can meet the needs of growing  communities while being good stewards of America's public lands.\n\nMr. Speaker, I urge all of my colleagues to support,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698162/sloan-canyon-conservation-and-lateral-pipeline-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…The executive orders returning education authority to the States not  only prioritizes school choice, it also ensures that vital services and  benefits continue without disruption during the transition.\n\nThat is how we reform education the right way: by empowering parents,  protecting students, and putting our educational life and results ahead  of…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689153/advancing-america-first-policies"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…inside sensitive systems for long periods of time, for  years, in some cases, before being discovered.\n\nTheir activity indicates preparation for the possibility of major  disruption during a time of crisis, including potentially over Taiwan.  This is a serious strategic concern, and it demands a serious national  response.\n\nThese groups often use advanced…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696757/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…goods, production equipment, or       manufacturing technology needed in critical supply chains;\n\n(E) evaluating the effect on market stability that may       result from the disruption, strain, or elimination of a       critical supply chain;\n\n(F) evaluating the state of the manufacturing workforce,       including by--\n\n(i) identifying the needs of domestic…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "John James", "party": "Republican", "sentence": "…resiliency  program to identify and address gaps in critical industries and  emerging technologies, establish an early warning system to predict and  prevent supply chain disruption, and reduce dependence on adversarial  nations by incentivizing domestic manufacturing.\n\nResilient global supply chains are the cornerstone of American  innovation and leadership,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690187/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…President is correct. My friend, Stephen Miller, is correct.  The President is correct to be declaring antifa a terrorist  organization. Enough is enough. Enough with the disruption of our  Nation. For those who say this is somehow clamping down on speech:  Wrong. You can say virtually anything you want to say in this country,  but number one, there…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…were not given the same  opportunity as families from other countries to be united with their  children. Real commitments were made, and they were dismissed. This  brought disruption to families and needlessly left children orphaned.\n\nAgain, I suggest China doesn't honor its commitments, and I pray that  the hearts of Chinese leaders experience a transformation.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692787/intercountry-adoptions"}]