[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…the gentlewoman  from Connecticut (Ms. DeLauro), and I move to strike the last word.\n\nMs. McCOLLUM. Mr. Chair, I yield to the gentlewoman from Ohio (Ms.  Kaptur), the distinguished ranking member of the Subcommittee on Energy  and Water Development and Related Agencies.\n\nMs. McCOLLUM. Mr. Chair, as the designee of Ms. DeLauro, I move to  strike the last…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Economic Committee and our preeminent environmental economist.\n\nMr. BEYER. Madam Chair, I yield 1 minute to the gentleman from  Illinois (Mr. Krishnamoorthi), who is the distinguished ranking member  of the Select Committee on the Strategic Competition Between the United  States and the Chinese Communist Party.\n\nMr. BEYER. Madam Chair, I yield 1\\1/2\\ minutes…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…vote, you will own the  pain that comes with these tariffs, the chaos and the uncertainty, and  you will have no one to blame but yourselves.\n\nMr. McGOVERN.  Craig), the distinguished ranking member of the  Committee on Agriculture, to discuss our proposal.\n\nMr. McGOVERN. Mr. Speaker, can I inquire of the gentlewoman whether  she has any Republicans that…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…forward to voting for  it, and I encourage my colleagues to vote for it.\n\nMs. DeLAURO. Mr. Chair, I yield 5 minutes to the gentleman from  Maryland (Mr. Hoyer), the distinguished ranking member of the Committee  on Financial Services.\n\nMs. DeLAURO. Mr. Chair, I yield an additional 1 minute to the  gentleman from Maryland.\n\nMs. DeLAURO. Mr. Chair, I…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…60- year-old couple earning $82,800 per year, their premiums will rise by  over $17,000. This is a 255 percent increase.\n\nMs. DeLAURO.  Wasserman Schultz), who is the distinguished ranking  member of the Military Construction and Veterans Affairs Subcommittee.\n\nMs. WASSERMAN SCHULTZ. Mr. Speaker, I thank the gentlewoman for  yielding.\n\nMr. Speaker, I…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…and that determination leads me to a ``no'' vote on this  bill.\n\nMs. DeLAURO.\n\nMs. DeLAURO.  Clark), the distinguished Democratic whip.\n\nMs. DeLAURO.  McCollum), the distinguished ranking member of the  Defense Subcommittee.\n\nMs. DeLAURO.  Lois Frankel), the distinguished ranking member of the  National Security, Department of State, and Related Programs…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699345/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…hide from  taking up-or-down votes this time until the end of July. It is  outrageous, outrageous, and it is why we are offering this amendment.  Before yielding to the distinguished ranking member who has been a  leader in this regard, I want to quote my colleague  Tom Massie from  Kentucky, a Republican, who I think said it best. ``Why haven't we  voted…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699903/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…strengthens the entire  industrial base, promotes competition, and drives innovation.\n\nMr. Speaker, passing this bill today will do that.\n\nMr. McGARVEY.  Velazquez), the distinguished ranking member of the Small  Business Committee.\n\nMr. Speaker, I thank the gentleman from New York (Mr. LaLota) and the  gentleman from Texas (Mr. Williams) for their work…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691800/wosb-accountability-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…way too expensive, and  ultimately ineffective.\n\nI will urge my colleagues to oppose this legislation, with all due  respect to my friend.\n\nMr. RASKIN.  Jayapal), the distinguished ranking member of the  Subcommittee on Immigration Integrity, Security, and Enforcement of the  Committee on the Judiciary.\n\nMr. RASKIN. Madam Speaker, I yield an additional…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…and  continue to fight to protect our communities in the coming weeks.\n\nMs. DeLAURO. Madam Speaker, I yield 4 minutes to the gentleman from  Maryland (Mr. Hoyer), the distinguished ranking member of the Financial  Services and General Government Subcommittee.\n\nMs. DeLAURO. Madam Speaker, I yield an additional 30 seconds to the  gentleman from Maryland.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…when he is  going to schedule the vote on his meaningless bill on the Epstein  files, but I think we will have to wait until he gets back on the  floor.\n\nDeLauro), the distinguished ranking member of the Committee on  Appropriations.\n\nMr. McGOVERN. Mr. Speaker, the gentleman voted for the big, ugly bill  and added $4 trillion to the debt.\n\nLeger Fernandez),…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693718/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Mr. MORELLE. Mr. Speaker, I thank my longtime friend, the  distinguished ranking member of the Rules Committee, for his vigorous  defense of our position and his encouragement that people vote against  the so-called SAVE America Act.\n\nMr. Speaker,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699938/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…forfeits our global leadership, undermines national security, and  steals from the American people to hand more wealth to billionaires.\n\nMs. DeLAURO.  Pingree), the distinguished ranking member of the Interior  and Environmental Subcommittee of Appropriations.\n\nMs. DeLAURO.  Jayapal).\n\nMs. DeLAURO.  Clark), the distinguished Democratic whip.\n\nMs. DeLAURO.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…providing  precise spending levels for specific projects that they are bound by  law to carry out.\n\nThat is exactly what this bill does.\n\nMs. DeLAURO.  Kaptur), the distinguished ranking member of the Energy and  Water Development Subcommittee.\n\nMs. DeLAURO.  Pingree), the distinguished ranking member of the Interior,  Environment, and Related Agencies…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698760/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…urge my colleagues to vote ``no.'' I reserve  the balance of my time.\n\nMr. CLYBURN. Mr. Chair, I yield 2 minutes to the gentleman from New  Jersey (Mr. Pallone), the distinguished ranking member of the Energy  and Commerce Committee.\n\nMr. CLYBURN. Mr. Chair, I have one additional speaker.\n\nMr. CLYBURN. Mr. Chair, I yield 1 minute to the gentlewoman from…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699287/amendment-no-1-offered-by-mr-massie"}, {"senator": "French Hill", "party": "Republican", "sentence": "…leadership as a former  counterintelligence officer, someone who has brought that expertise to  his work here in the House.\n\nI appreciate my friend from Connecticut, our distinguished ranking  member of the House Permanent Select Committee on Intelligence, lending  his expertise to this bill. For years we have talked about how do we  fuse private-sector…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693963/financial-technology-protection-act-of-2025"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…to support it.\n\nMr. COLE. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, I will begin by recognizing the hard work of my  distinguished ranking member and my very good friend, Ms. DeLauro from  Connecticut. We have had the opportunity to work together for a long  time in a variety of capacities, and I particularly…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698749/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…underlying statute for our  officers.\n\nMr. SCHMIDT. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. SCHMIDT. Mr. Speaker, I thank the distinguished ranking member  for his argument and advocacy today.\n\nI would just point out to the body that while my distinguished  colleague speaks with his usual passion on many subjects,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691241/leosa-reform-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…in the  process. This work demonstrates what we can accomplish through  collaboration and respect.\n\nI also particularly thank my good friend and working partner, the  distinguished ranking member of the full committee, Ms. DeLauro, and I  also thank the superb staff on both sides of the aisle who worked  tirelessly to present us with the product before…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Committee. He just joined us, and I am happy to have him.\n\nMs. WASSERMAN SCHULTZ. Mr. Chairman, I yield 3 minutes to the  gentleman from California (Mr. Takano), the distinguished ranking  member of the Veterans' Affairs Committee and a champion of our  Nation's veterans.\n\nMr. CARTER of Texas. Mr. Chair, I yield 2 minutes to the gentleman  from North…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692945/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…ensure the safety of our  servicemembers and making sure that we look out for them.\n\nMr. Chair, I yield 5 minutes to the gentlewoman from Connecticut (Ms.  DeLauro), the distinguished ranking member of the Appropriations  Committee.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692959/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "Mr. ALFORD. Mr. Speaker, I thank the Chair, our ranking member, and  the distinguished ranking member of the full committee. It is good to  be here on this late evening to do important business for the American  people.\n\nI rise in strong support today of H.R.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693646/department-of-defense-appropriations-act-2026"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…supporting it on final passage.\n\nMs. WASSERMAN SCHULTZ. Mr. Chairman, I yield 3\\1/2\\ minutes to the  gentleman from Georgia (Mr. Bishop), my dear friend who is the  distinguished ranking member of the Agriculture, Rural Development,  Food and Drug Administration, and Related Agencies Subcommittee.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692942/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}]