[{"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…very little but live  hand-to-mouth, including more than 12 percent of our children.\n\nMadam Chair, I yield 2 minutes to the gentleman from California (Mr.  Aguilar), the distinguished chair of the House Democratic Caucus.\n\nMr. BEYER. Madam Chair, I yield 1 minute to the gentlewoman from  Wisconsin (Ms. Moore), a distinguished member of the Ways and Means…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Mr. JEFFRIES. Mr. Speaker, I thank the distinguished gentleman, my  good friend from the great State of Maryland, the ranking Democrat on  the Judiciary Committee, for yielding.\n\nMr. Speaker, I rise today in strong opposition.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696891/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "Mr. BLUMENTHAL. Mr. President, I am honored to follow the ranking  member on the Foreign Relations Committee and to be followed by another  distinguished member of that same committee and to focus on these first  100 days.\n\nThe focus on the first 100 days of an administration, I think, comes  from  the time of Franklin Roosevelt…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…her  commitment to empowering youth with the skills and knowledge to thrive,  Edith is worthy of the highest praise. Mr. Speaker, I respectfully ask  that you and my other distinguished colleagues join me in wishing Mary  Edith Brown Coleman a very happy 109th birthday.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699981/recognizing-mrs-mary-edith-brown-colemans-109th-birthday"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Mr. RASKIN. Mr. Speaker, I thank the distinguished gentlewoman from  Georgia for her extraordinary leadership for gun safety and public  safety in America.\n\nMr. Speaker, this bill would rip a dangerous new loophole in the…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700036/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…his dedication and achievement will have a lasting  impact on the Army's ability to fight and win our Nation's wars.\n\nUpon retirement, Colonel Dinh is recognized for his distinguished  service and exemplary performance of duty, reflecting the highest  tradition of the United States of America.\n\nColonel Dinh is married to Ashlie Anne Dinh, and they have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695089/congratulating-colonel-dominic-v-dinh-on-his-retirement"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…father but also a guiding  light for interfaith understanding, religious freedom, and  environmental stewardship.\n\nPart of his visit to the United States is to receive the  distinguished Templeton Prize in New York City. This recognition,  bestowed previously on figures such as Mother Teresa, the Dalai Lama,  and Archbishop Desmond Tutu, acknowledges his…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695409/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-archbishop-of-constantinople-new-rome-and-ecumenical-patriarch"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…Speaker, it is with great honor that I rise  today to coanchor this Congressional Black Caucus Special Order hour,  along with the gentlewoman from Ohio (Ms. Brown), my distinguished  colleague.\n\nFor the next 60 minutes, members of the CBC have an opportunity to  speak directly to the American people on the harmful policies of Donald  Trump's first…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…am proud to welcome the Ecumenical  Patriarch of Constantinople, His All-Holiness Bartholomew, to  Washington, D.C. this week, and to congratulate him on receiving the  distinguished Templeton Prize.\n\nHis All-Holiness has been a steadfast leader for the Orthodox Church,  and especially for my constituents in New Jersey. He continues to  encourage us…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695803/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…and compensate for the disastrous impact, the  devastating affect it will have on families and working people all  across this great country.\n\nI am honored to yield to our distinguished leader.", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694385/9999"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…negotiator. He  worked in the financial crimes unit. Jerry also worked for 21 years as  a juvenile detective, where he investigated crimes against children.\n\nThroughout his distinguished career, Detective Gachett has played a  pivotal role of securing justice with his investigations, leading to  the imprisonment of hundreds of child predators, solidifying…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687992/congratulating-jerry-gachett-on-his-retirement"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "Mr. FIGURES. Mr. Speaker, it is with great honor that I rise today to  co-anchor this Congressional Black Caucus Special Order hour along with  my distinguished colleague from Oregon (Ms. Bynum).\n\nFor the next 60 minutes, Members of the Congressional Black Caucus  have an opportunity to speak directly to the American people about…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…waste, fraud, and abuse.\n\nWhat he is trying to do actually is eliminate nonpolitical Federal  workers, people who have gotten their positions based on merit, people  who are distinguished in their careers, have outstanding experience,  great credentials, but he is trying to force them out so he can replace  them with people who are politically loyal to him.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…region known for its patriotic spirit, strong  civic institutions, and deep respect for those who have served our  Nation in uniform. Today, I am privileged to recognize a distinguished  leader and devoted advocate from our community--Cindy Rice, National  President of the AMVETS Ladies Auxiliary.\n\nWhereas, Cindy Rice, a lifelong resident of Ohio and a…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690126/proclamation-for-national-amvets-auxiliary-president-cindy-rice"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…Bauldrick, Sr. (2022-2024), L. Bernard Jakes (2024-      2025), and Robert O. Harris Jr. (2025-2026);\n\nAs a proud member who share brotherhood with this outstanding group  of distinguished men, some of whom I met as a freshmen in college  (Kenneth R. Watkins and Ernest Gibson) and one (Isiah P. Ward) who was  my line brother when we joined Mu Mu Lambda.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697509/commending-the-mu-mu-lamda-chapter-of-alpha-phi-alpha-fraternity-inc-on-its-50th-anniversary"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…handed resource management plan amendment by the previous  administration because this took a sledgehammer to an established  industry in the State of Wyoming.\n\nI am sure my distinguished colleague from the great State of Wyoming,  Representative Hageman, who is the lead sponsor of this legislation,  will go into detail what this would mean to Wyoming if…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…Partner Violence.\n\nAt his undergraduate alma mater, Illinois State University, Judge  Knecht was an adjunct professor for nearly three decades and is a  recipient of their Distinguished Alumni Award.\n\nAgain, I congratulate Judge Knecht on this momentous achievement in  his legal career and thank him for his continued service to the State  of Illinois.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694181/congratulating-the-honorable-james-knecht-illinois-fourth-district-appellate-court-justice"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…enhanced.''\n\nThis week, His All-Holiness Ecumenical Patriarch Bartholomew will  return to Washington as part of his visit to the United States, where  he will also receive the distinguished Templeton Prize in New York  City, an award previously bestowed upon Mother Teresa, the Dalai Lama,  and Archbishop Desmond Tutu. This honor recognizes his lifelong  commitment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695424/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Honoring Roger Reed\n\nMr. BAUMGARTNER. Mr. Speaker, I rise today to honor the life of Roger  Reed, a man whose legacy is defined not only by his distinguished legal  career but his deep love of family, history, faith, and Cougar  football.\n\nBorn in Portland in 1939 and raised in Wenatchee and Spokane, Roger  was a lifelong learner…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695071/operation-rolling-thunder"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…SFC Macleod's legacy  is one of leadership, commitments to excellence, and unwavering service  to his Soldiers, his fellow veterans, and his country.\n\nIn addition to his distinguished military career, he earned a  Bachelor's in Business Administration in Program Management and is  currently pursuing a Master of Business Administration. He currently…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696275/recognizing-sergeant-first-class-alyn-michael-macleod-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to recognize and commend  the dedicated public service of Ms. Judy Hoover, a distinguished member  of the Warminster Township Board of Supervisors who celebrated her  final meeting as Secretary and Supervisor on December 4, 2025. Her six- year commitment to Warminster…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697487/recognizing-warminster-township-board-of-supervisors-judy-hoover"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…truly  inspirational. This recognition speaks not only to her skill, but also  to her compassion and commitment to healing and serving others.             Recognizing Seven Distinguished Georgia Golf Courses\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to recognize seven  Georgia golf courses as being named Golfweek's top 200 resort golf  courses in…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699261/recognizing-wayne-barth"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…the longest serving  Archbishop of Constantinople in two millennia of Christian history, he  stands as a symbol of faith and resolve. His visit comes as he receives  the distinguished Templeton Prize in New York, an honor once bestowed  on Mother Teresa, the Dalai Lama, Archbishop Desmond Tutu, and Nelson  Mandela--leaders whose lives have testified…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695856/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Mr. HARIDOPOLOS. Mr. Speaker, I rise today to recognize a  distinguished Brevard County resident and Army veteran, Lyndsay Gray.\n\nEnlisting in 2006, Ms. Gray served over a decade as a radiology  technologist.\n\nAfter training at Fort Sam Houston…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691773/recognizing-lyndsay-gray"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, I rise today to recognize the  distinguished service of Captain Mike Retzlaff, a proud veteran of the  United States Army whose dedication, leadership, and commitment to duty  reflect the highest traditions of military…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695837/recognizing-united-states-army-captain-mike-retzlaff"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…respect and  gratitude to recognize the extraordinary service and unwavering  dedication of Sgt. Richard Loughran, a proud veteran of the United  States Marine Corps and our distinguished Veteran of the Month for July  2025 from Michigan's 9th Congressional District. His exceptional  military career and steadfast commitment to duty, excellence, and  patriotism…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693382/recognizing-united-states-marine-sgt-richard-loughran-as-july-2025-veteran-of-the-month"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "Mr. GRAVES. Mr. Speaker, it is my privilege to recognize Mary Miller,  who is retiring after more than four decades of distinguished service  as a well-respected and remarkable advocate for the general aviation  industry.\n\nMary's forty-four-year career in general aviation has been spent  mostly on the…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688717/recognizing-mary-miller"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…confessional of a crisis of faith of an Orthodox raised Jew,       challenging his basic assumptions about God, covenant and       life's meaning. ``My loving wife (Blu is a distinguished       feminist Orthodox Jew and author) and family saved me from       nihilism and despair by showing me the incredible tenacity       and unspent power of embracing life.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697168/the-triumph-of-life"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…of our FY26 duties. I  urge all Members to support this bipartisan package.\n\nMr. COLE. Madam Speaker, I yield 3 minutes to the gentleman from  Arkansas (Mr. Womack), the distinguished chairman of the  Transportation, Housing and Urban Development, and Related Agencies  Subcommittee of the Appropriations Committee, and my very good friend.\n\nMr. COLE.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…Makennah  claimed her fourth and final State title on March 8 in the 2025 State  Wrestling Tournament, securing her win by more than 15 points over her  opponent. Makennah has distinguished herself as only the fifth female  wrestler to ever accomplish this feat in Ohio high school wrestling  history.\n\nJumping into the sport at just 4 years old, Makennah's…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689346/joanna-sheaf-celebrates-100th-birthday"}]