[{"senator": "Al Green", "party": "Democrat", "sentence": "…episode take  place in this country. It looks like we have secret police.\n\nAmerica is not a country with secret police that come and take you  away, away from your home to some distant State where you are not  known, where you don't have resources, and they don't give you any due  process. This is not America.\n\nThe President is destroying the lawful, judicious…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…W.       Bush, has explained, because Maryland's cession of the       territory now constituting the District was full and       complete, it severed D.C. residents' now far distant       ``political link with'' Maryland. The current District is not       part of Maryland, and Maryland has no claim on any portion of       the District's territory. There…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…collaboration?\n\nThat was several years ago. But as we have watched, over time, some  significant things are happening that we should understand as Senators.  In the not so distant past, you have tried to have a fair allocation of  revenue laws that raised money, and then, as you filled the Treasury,  the question became: How shall we spend it?\n\nSo the…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…suspect, and the  king's men can show up with a mask, faces covered, collect you--that is  a very kind way of saying it--put you in some vehicle, and then storm  away to some distant place and lock you up. Relatives don't know where  you are--no due process.\n\nI know. I know who you are. I know where you are going. I know what  you  want to do. I have suffered…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…W.       Bush, has explained, because Maryland's cession of the       territory now constituting the District was full and       complete, it severed D.C. residents' now far distant       ``political link with'' Maryland. The current District is not       part of Maryland, and Maryland has no claim on any portion of       the District's territory. There…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…and to build on some of the arguments that he has made  so well. We are here because our democracy is in crisis. It is not some  potential catastrophe on the horizon that is distant or hypothetical.  It is real. It is now because of the lawlessness and recklessness of  this administration.\n\nAnd it is the result of a contempt for the law, for legal norms…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695873/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the insurance program that pays the largest share of mental health  services; we cannot slash the Medicaid program to pay for billionaire  tax breaks.\n\nThese may sound like distant debates in Washington, but when it comes  to preventing suicides in Joliet, IL, it is a critical investment. And  I will work every day to defend these programs.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688330/recognizing-the-joliet-emsfire-department-program"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…chair of the Black Caucus of the  Illinois State Senate.\n\nMr. JACKSON of Illinois. He has walked arm in arm with the African- American community, not as a visitor, not as a distant ally, but as a  brother in the same long struggle for liberation. He understands that  the battles of the South Side echo the battles of Little Village, that  the pain of…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696773/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…large and  abstract, so unimaginable that it becomes easier just to ignore it all,  but to say nothing is not an option, especially for someone like me.\n\nMany of my family, my distant family, were in Hiroshima on the day  the atom bomb fell. That memory is not just historical. It is personal  for me and my family.\n\nMr. Speaker, the atomic bombs of 1945…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699031/expiration-of-new-start"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…assault is  serious and significant, but each action needs to be seen together as  something deeper and broader. It is the sum and substance of  totalitarianism--not at some distant point in the future, not a vague  storm cloud on the horizon, but the destruction of democracy here and  now.\n\nAs we approach our democracy's 250th anniversary, we can't afford…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…stay, because I know      Great dreams are born from seeds we bravely sow                                 BY EMMA ROSS       I dreamed of shaping laws before I came,      A distant vision held in hopeful hands;      But here, where marble echoes history name,      My quiet wish grows fierce with each command.      These halls hum with decisions yet to…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…Speaker, two of my constituents, Renee Good and Alex  Pretti, beloved neighbors and community members, were murdered by  Federal immigration enforcement agents.\n\nThese are not distant headlines. These were beloved community members  fighting to protect their neighbors.\n\nAlex Pretti was a 37-year-old ICU nurse at the Minneapolis VA who  cared for veterans.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699668/horrific-ice-abuses"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…determine her future,  not here nor in Iran.\n\nIn Oregon, where thousands of families with Iranian roots have built  their lives, we understand that their fight for freedom is not distant.  It lives right here in our own communities.\n\nThe people of Iran deserve a future without fear, a future with free  speech, free assembly, and the right to choose their own…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697722/free-iran"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…being undermined by Trump's senseless tariffs and war on       legally binding trade agreements. America as the first       responder to global humanitarian crises becomes a distant       memory with the dismantling of USAID.\n\nDomestically, Trump is aggressively eliminating constraints       on his power and fomenting fear. He is intimidating       independent…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…better.'' Nothing. It never  happened.\n\nSeptember 10, 2024, ABC News Presidential debate, he says: ``I have  concepts of a plan. . . . You will be hearing about it in the not-too- distant future.'' Nothing happened.\n\nDecember 8, 2024, he said: ``Yes, we have concepts of a plan that  would be better. You will see it very soon.'' It produced nothing.\n\nIn May…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…respects to their loved ones.\n\nMy bill would expand the land adjacent to the Alpine Community  Cemetery, preventing the need for members of the community to be laid  to rest in a distant cemetery.\n\nThese communities have storied histories dating back to the pioneers,  and they deserve to lay their loved ones to rest in a place that means  so much to them.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691143/apache-county-and-navajo-county-conveyance-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…representatives in Congress standing idly by saying: Nothing to  see here; the President can do whatever he wants, while their sons and  daughters are sent to fight wars in distant lands.\n\nAs the administration authorizes covert CIA action in Venezuela and  surges U.S. forces to the region, including our most advanced aircraft  carrier, the risk of imminent…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…will speak of those diseases as diseases of the past, as we now speak  of bleeding peptic ulcer disease causing a portion of your stomach to  be resected as something in the distant past.\n\nNow, by the way, I applaud my colleague. I applaud President Trump  for saying that other countries are not carrying their fair share of  the load for paying for this…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691544/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…to say that tonight I rise to  speak as we continue to examine what is unfolding before us. It is  important to remember that the fight for the Iranian people is not some  distant, unfamiliar struggle. In many ways, it echoes the very  heartbeat of our very own American story.\n\nLong before America became the beacon of liberty it is today, we were  a…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…right here at home.\n\nRenewing HOPE and HELP supports nearshoring and more resilient supply  chains, benefiting American workers and businesses, while reducing  reliance on distant and unreliable sources.\n\nI commend Dr. Murphy for his leadership on this issue. Through his  numerous trips to Haiti, he has seen firsthand the human consequences  of economic…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698853/haiti-economic-lift-program-extension-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…mattered happened here.\n\nBut, over the last few decades, the people in power squandered that  inheritance. They sent our children and our wealth overseas to defend  the borders of distant nations while throwing open our own borders to a  tidal wave of mass migration here at home. They shipped the good- paying, middle-class American jobs that once were the backbone…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Refuge (ANWR), and KIC holds       significant ANCSA lands within the Coastal Plain lands that       Congress specifically conveyed to our people so that local       Inupiat not distant federal agencies, would have a central       voice in decisions about our homeland.\n\nFor decades, KIC has participated constructively in every       federal process affecting…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697510/sj-res-91-and-hj-res-131"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…U.S. coal demand for the next 116 years.\n\nMr. Speaker, 92 percent of Wyoming's coal is exported to other  States, helping keep the lights on and utility prices affordable in  distant places as far as Texas, Illinois, and my home State of  Arkansas.\n\nNationwide, residential electricity prices have increased by 13  percent since 2022, and overturning misguided…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Restrictions, novel electric vertical takeoff and  landing aircraft (eVTOL) certifications, promoting new sustainable  fuels, right down to real-time advice to a pilot at a distant Signature  Aviation base on how to unsnag a challenge clearing customs.\n\nFor so many years, we have seen Mary on the bustling ramps at Super  Bowls, Oshkosh, Tarkio, presidential…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688717/recognizing-mary-miller"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…establishment 250 years ago, tens of millions of American patriots  have put their lives on the line to protect national security, defend  our allies, and fight tyranny and terror from distant shores.\n\nToday, the Army is comprised of roughly 450,000 Active-Duty  servicemen, 325,000 National Guardsmen, and 176,000 members of the  Reserve, making the U.S. Army the…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692460/executive-calendar"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…governments there that didn't have a voice when this rule was made.  This is hurting their economy. It doesn't make sense, and it is kind of  a bad example of having that distant landlord with an alternative  agenda that lives many miles away managing the land where you live. I  thank her for her efforts on behalf of her constituents and on all  Americans…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…military assets could be based at Thule, at the time--now called  Pituffik--Air Base Station.\n\nAgain, these are discussions that have been had in the past--but in  the very, very distant past--until just recently, when, again, we have  seen comments coming out of the administration and really stepped up in  this past week or so.\n\nIt is one thing to have a…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…gaming systems, and through social  media. Every 30 seconds a child is sold into slavery. Every 30 seconds  another child is sold into slavery.\n\nHuman trafficking is not just a distant overseas problem. The issue  is here. It is in our communities. It is in our small towns. It is in  our big cities.\n\nI am from Texas and Texas being a border State, we are…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699002/human-trafficking-awareness-month"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…currently located on U.S. Forest  Service land and operated under a special use permit. If the cemeteries  are not expanded, families will be forced to travel long distances to  distant cemeteries to visit their deceased relatives.\n\nTo address this need, Pinedale and Alpine have worked with their  respective counties to identify additional land to expand…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691144/apache-county-and-navajo-county-conveyance-act-of-2025"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…part of their history and part of their recreation for generations.  These road restrictions reflect a pattern of access loss that  characterizes the problems with having a distant Federal Government  make local rules.\n\nPeople from across the world come to experience the unique  opportunities these trails offer. The rule threatens to sever these  connections,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690403/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}]