[{"senator": "Al Green", "party": "Democrat", "sentence": "…and he       is an active member of Kappa Alpha Psi Fraternity, Inc.\n\nNow, therefore, be it resolved that, on behalf of the       constituents of the Ninth Congressional District of Texas, I       am proud to salute Apostle Dr. Dana Carson for his 40 years       of dedicated service to enriching the lives of his family,       congregation, our Nation,…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692044/certificate-of-congressional-recognition-proclamation-presented-to-apostle-dr-dana-carson-in-honor-of-40-years-of-ministry"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…voted nay.\n\nI was unavailable for rollcall vote No. 23, on Motion to Invoke  Cloture on Nicholas Jon Ganjei, of Texas, to be United States District  Judge for the Southern District of Texas. Had I been present, I would  have voted nay.\n\nI was unavailable for rollcall vote No. 24, on the confirmation on  Nicholas Jon Ganjei, of Texas, to be United States…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699909/vote-explanation"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…progress in  Texas, from Houston to Fort Worth. For almost a year after the tragic  death of our late colleague, Sylvester Turner, the citizens of the 18th  Congressional District of Texas in Houston have been denied  representation in this Congress.\n\nAfter Governor Abbott delayed the call for the election for almost 8  months and then delayed the runoff…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699521/welcoming-the-honorable-christian-d-menefee-to-the-house-of-representatives"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Committee, for yielding.\n\nMr. Speaker, I rise in support of H.R. 1949, the Unlocking our  Domestic LNG Potential Act, introduced by my friend and colleague from  the 11th District of Texas.\n\nThis legislation will streamline regulatory approvals of LNG export  facilities to meet the movement of global energy demands.\n\nThis legislation removes unnecessary…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697081/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Unfortunately, this final rule will disproportionately affect rural  communities and small businesses. In many areas across the country, Mr.  Speaker, including in my district in Texas, there are communities with  limited food and drink retail options. It is not uncommon for a  convenience store to bridge that gap in providing food to American  families.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689265/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…and dedication to others. It is with  great honor and respect that I present Nola Jane Saldana with a  Congressional Veteran Commendation from the 17th Congressional District  of Texas.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696264/recognizing-nola-jane-saldana-with-a-congressional-veteran-commendation"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…contributions to his country and  community reflect the very best of American values. I am proud to  represent such a distinguished citizen in the 26th Congressional  District of Texas. On behalf of a grateful community, I thank him for  his selfless service and wish him continued happiness in his well- earned retirement.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693149/recognizing-mr-ray-fletcher"}, {"senator": "Keith Self", "party": "Republican", "sentence": "Mr. SELF. Mr. Speaker, I rise today to salute our soldiers of  tomorrow, the service-bound academy students of the Third Congressional  District of Texas.\n\nThis district of Texas is home to some of the best and brightest  young people, and it is always an honor to recommend such fine students  to our Nation's service academies.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692978/saluting-our-soldiers-of-tomorrow"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "…in the Fort Worth Stockyards  is much more than a preferred store, but rather shines as a living  landmark of Fort Worth History.\n\nOn behalf of the 12th Congressional District of Texas, I extend my  congratulations to M.L. Leddy's on their outstanding achievement and  wish them continued success in their future endeavors.", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700234/recognizing-ml-leddys-on-being-included-in-the-new-york-times-list-of-the-top-50-clothing-stores-in-the-united-states"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…enforcement  community.\n\nIt is with great honor and respect that I present Danny Wallace Smith  with a Congressional Veteran Commendation from the 17th Congressional  District of Texas. His exemplary service to our Nation and continued  contributions to his community stand as a powerful example of public  duty and honor.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696284/recognizing-danny-wallace-smith-with-a-congressional-veteran-commendation"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "…I am honored to represent these exceptional students and commend them  for their achievements both academically and athletically.\n\nOn behalf of the 12th Congressional District of Texas, I congratulate  the Fort Worth All Saints football team and wish them continued success  in all their future endeavors.", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700254/recognizing-the-all-saints-football-team"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…enough oil. It is also interesting that  President Obama, when he--the gentleman from Georgia, Buddy Carter,  mentioned the Keystone pipeline. It would have come into my district in  Texas, 830,000 barrels of oil a day. That is what we are talking about  refining on the Gulf Coast of Texas. If you transfer that to 18- wheelers, it is about 5,253 18-wheeler…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697030/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…achievement.\n\nIt is with great honor and respect that I present William ``Bill''  Forest Harris with a Congressional Veteran Commendation from the 17th  Congressional District of Texas. His exemplary service to our Nation  and continued contribution to his community stand as an inspiration to  us all.", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696330/recognizing-william-bill-forest-harris-with-a-congressional-veteran-commendation"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…with great honor and respect that I present retired USA  Sergeant First Class Alyn Michael Macleod with a Congressional Veteran  Commendation from the 17th Congressional District of Texas. His  exemplary service to our Nation and continued contributions to his  community stand as an inspiration to us all.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696275/recognizing-sergeant-first-class-alyn-michael-macleod-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "…engaged member of our Fort Worth  community. I know he is looking forward to well-earned time with his  family and first grandchild.\n\nOn behalf of the 12th Congressional District of Texas, it is an honor  to recognize Mr. Jeffrey L. DeWitt's service to the Fort Worth Fire  Department and his impact on keeping our community safe for the past 37  years.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689725/9999"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…strengthened this institution. She has  done so with professionalism, humility, and unwavering commitment.\n\nOn behalf of the constituents of the Eighth Congressional District of  Texas, on behalf of my staff, and on behalf of a Member of Congress, I  want to thank her.\n\nHer service has mattered, her leadership has made a difference, and  her example…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699672/recognizing-christine-lee"}, {"senator": "Troy Nehls", "party": "Republican", "sentence": "…Speaker, I thank Dr. Nivens for investing in the education and  future of our children and for his commitment to our community. He  continues to make the 22nd Congressional District of Texas proud.", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700275/congratulating-dr-roosevelt-nivens"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "…the student-athletes, coaches,  and families for an outstanding season and for upholding a  distinguished tradition of excellence.\n\nOn behalf of the 12th Congressional District of Texas, I am proud to  congratulate the Trinity Valley School girls' soccer team on this  incredible state championship victory.", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700251/congratulating-the-trinity-valley-girls-soccer-team-on-their-fourth-consecutive-3a-state-championship"}]