[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Massie-Khanna bill passed. They want something with teeth in it that  will force this administration to comply because they don't trust that  they will.\n\nLeger Fernandez), a distinguished member of the Rules Committee.\n\nMs. LEGER FERNANDEZ. Mr. Speaker, last night, the Rules Committee  spent hours helping Trump and the White House cover up the Epstein  files.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…absolutely nothing  that can make Affordable Care Act plans affordable. It was a gift to  the insurance industry from the Democratic Party.\n\nMs. SCANLON.  Leger Fernandez), a distinguished member of the Rules  Committee.\n\nMs. LEGER FERNANDEZ. Mr. Speaker, once again, Republicans on the  Rules Committee blocked a vote on the bipartisan Massie-Khanna bill to  release…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…how that  solves anything.\n\nI would hope that we would not reduce workers' pay. To do that, we  have to oppose the legislation.\n\nMr. SCOTT of Virginia.  Lee), who is a distinguished member  of the Committee on Education and Workforce.\n\nMr. Speaker, I encourage people to support the motion to recommit,  which would actually create childcare availability.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699005/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Interdenominational Theological Center of  Morehouse College, and culminated with a Doctorate in Theology from  North Carolina University Wilmington, where he was recognized as a  distinguished member of the President's Club.\n\nBefore full-time ministry, Bishop Williams worked at McGregor Golf  for eleven years and later served the community as a bus driver for the…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…point?\n\nAll we are asking for in the Epstein files is, release the materials  so we can check it out. They want to go ahead and censure and remove  from a committee a distinguished Member of the House of Representatives  with no due process at all.\n\nMr. Speaker, I reject this. I hope the whole body will reject this  just like I voted and spoke against…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…lecture us about our dedication to making sure that women are not  only presented all options but treated by people who are actually  qualified.\n\nLeger Fernandez), a distinguished member of the Rules Committee.\n\nMs. LEGER FERNANDEZ. Mr. Speaker, this week marks the 52nd  anniversary of Roe v. Wade, a decision that allowed women to make their  own decisions…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…from New Jersey to listen to  their constituents and vote ``no.'' May God forgive those who do not do  for the least among us.\n\nMr. BOYLE of Pennsylvania.  Balint), a distinguished member of the  House Committee on the Budget.\n\nMr. BOYLE of Pennsylvania. Mr. Speaker, may I inquire as to how much  time remains on each side.\n\nMr. BOYLE of Pennsylvania.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693195/one-big-beautiful-bill-act"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…trillion to the  deficit. This is a rip-off for working families, and I strongly  encourage my colleagues to oppose this measure.\n\nMr. BOYLE of Pennsylvania.  Plaskett), a distinguished  member of the House Committee on the Budget.\n\nMr. BOYLE of Pennsylvania. Mr. Speaker, the majority leader just said  something absolutely remarkable. He said that there should…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689914/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…America.\n\nMr. Chair, I also want to say that I am honored to serve as the  ranking member. I would rather be chairman. I am honored to serve as  the ranking member with the distinguished Member of this body, Mr.  Joyce.\n\nIf he would like me to yield to him now, I will. If not, I want to  thank him for his leadership of our committee, which has been collegial…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699056/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…too expensive, and  ultimately ineffective.\n\nI will urge my colleagues to oppose this legislation, with all due  respect to my friend.\n\nMr. RASKIN.  Jayapal), the distinguished ranking member of the  Subcommittee on Immigration Integrity, Security, and Enforcement of the  Committee on the Judiciary.\n\nMr. RASKIN. Madam Speaker, I yield an additional 30…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…he is  going to schedule the vote on his meaningless bill on the Epstein  files, but I think we will have to wait until he gets back on the  floor.\n\nDeLauro), the distinguished ranking member of the Committee on  Appropriations.\n\nMr. McGOVERN. Mr. Speaker, the gentleman voted for the big, ugly bill  and added $4 trillion to the debt.\n\nLeger Fernandez),…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693718/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…residents of Florida's Third  Congressional District lack a passport. The cost to those individuals:  $53.1 million to secure passports.\n\nSewell), my dear friend and distinguished member of our committee and  the ranking member of the Subcommittee on Elections of House  Administration.\n\nMr. Speaker, the gentleman's comments lead me to the question: Do…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "Mr. BLUMENTHAL. Mr. President, I am honored to follow the ranking  member on the Foreign Relations Committee and to be followed by another  distinguished member of that same committee and to focus on these first  100 days.\n\nThe focus on the first 100 days of an administration, I think, comes  from  the time of Franklin Roosevelt…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…California (Mr.  Aguilar), the distinguished chair of the House Democratic Caucus.\n\nMr. BEYER. Madam Chair, I yield 1 minute to the gentlewoman from  Wisconsin (Ms. Moore), a distinguished member of the Ways and Means  Committee and the Joint Economic Committee.\n\nMr. BEYER. Madam Chair, I yield the gentlewoman from Wisconsin an  additional 15 seconds.\n\nMr. BEYER.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…resolution calls on elected officials, faith leaders, and civil  society leaders to condemn and counter all acts of anti-Semitism.\n\nI also want to salute Mr. Schmidt, the distinguished Member from  Kansas, for his powerful endorsement of this idea.\n\nThe resolution also goes on to urge the House to take ``all possible  steps to ensure the safety, security,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Mr. Speaker, I recognize the gentleman from  Missouri (Mr. Alford), the chair of the Small Business Subcommittee on  Oversight, Investigations, and Regulations and a distinguished member  of the Appropriations Committee.\n\nMr. HILL of Arkansas. Mr. Speaker, may I inquire as to how much time  I have remaining.\n\nMr. HILL of Arkansas.  Salazar), my friend…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697143/denouncing-the-horrors-of-socialism"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…Speaker, I thank the gentleman from Mississippi for  his remarks.\n\nMr. CRAWFORD. Mr. Speaker, I recognize the gentleman from Arkansas,  Mr. Hill, my colleague and the distinguished member of the House  Permanent Select Committee on Intelligence, as well as the chairman of  the Committee on Financial Services.\n\nMr. CRAWFORD. Mr. Speaker, I am pleased to…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "French Hill", "party": "Republican", "sentence": "…action derailed their attempt for more       wilderness areas in Arkansas.\n\nThe ACC firmly believed that their break would come when       Arkansas' senior senator, and distinguished member of the       Senate Energy and Natural Resources Committee, Dale Bumpers       (D-AR), would introduce a bill--as he had promised 18 months       previously in 1981.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to recognize and commend  the dedicated public service of Ms. Judy Hoover, a distinguished member  of the Warminster Township Board of Supervisors who celebrated her  final meeting as Secretary and Supervisor on December 4, 2025. Her six- year commitment to Warminster…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697487/recognizing-warminster-township-board-of-supervisors-judy-hoover"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…her  a long, happy, and well-deserved retirement.                      Recognizing Richard ``Dick'' Pesek\n\nMrs. FISCHBACH. Mr. Speaker, I rise today to recognize a  distinguished member of the Minnesota agricultural community.\n\nI congratulate Dick Pesek of Taunton, Minnesota, who has been named  the Minnesota 2025 Cattleman of the Year. This honor is…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698583/recognizing-mary-krinkie"}]