[{"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…accept  the second resignation offer, leaving fewer than 150 attorneys, as  Trump has twisted the division into something unrecognizable, a unit  that is bent on dismantling diversity, equity, and inclusion  initiatives, reversing policies on transgender rights, rooting out so- called woke ideology, and other such nefarious goals.\n\nVanita Gupta, a former…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…longer  bridges instead of higher walls between parties, between communities,  between the America we are and the America we could be. It is the  recognition that our Nation's diversity isn't our weakness; it is the  very source of our strength, our creativity, our resilience.\n\n``A more perfect Union'' means families who don't go bankrupt because  someone…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…a  President from Ohio without any consultation to the indigenous people  of Alaska.\n\nThat same day, the President signed an executive order mandating the  elimination of diversity, equity, and inclusion offices across the  Federal Government, leading to the illegal firing and loss of  leadership across Federal and military service.\n\nIn March, he signed…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699713/rewriting-history"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…well and  let the representatives of the people decide as our Constitution  states.\n\nFourth, this bill continues to embrace the Trump administration's  culture war attacks on Diversity, Equity, Inclusion and Accessibility  programs that undermine recruitment, retention and unit cohesion.  Americans have watched President Trump turn the Defense Department…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…high-level courses for  students.\n\nThanks to her efforts, the gaps in advanced coursework decreased and  now these advanced classes more closely reflect the composition and  diversity of our students.\n\nAs we all know, good teachers, good counselors, and good classes stay  with us for a lifetime. I would not be in Congress today if I did not  have my own…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697970/national-school-counselor-of-the-year-danielle-crankfield"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…Honorable Harriet Tubman.\n\nI rise to oppose book banning.\n\nI rise, Mr. Speaker, to oppose assertions that DEI are ``wicked  ideologies.''\n\nI rise to speak against the notion that diversity, equity, and  inclusion cause division and hostility toward White males.\n\nI rise to oppose the idea that Pell grants are a part of the remnants  of extremist education that…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689641/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…significance of this day and  African American history is being erased. Across our Nation, we are  witnessing the systemic losses of our hard-fought gains--the stripping  of diversity, equity, and inclusion from federal institutions,  censoring school curriculums, and silencing conversations about the  true history of America.\n\nJuneteenth commemorates…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692688/commemoration-of-juneteenth-amid-the-erosion-of-black-history"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…is cruelty.  America must choose neither because when we forget what we were, we  forfeit the right to know who we are.\n\nMr. Speaker, we are addressing the issue today of diversity, equity,  and inclusion. I would like to speak on this matter because it is an  urgent matter, one that touches the very soul of our Nation's promise  and its founding ideals…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…and helps  keep our children fed.\n\nTrump is also threatening to cut funding from schools that won't  comply with his draconian Executive orders--his obsession to stamp out  diversity, equity, and inclusion in our public schools; Executive  orders that direct our schools to stop teaching entire chapters of our  Nation's history like the Civil War, African-American…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690856/teacher-appreciation-week"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…to fighting for our  communities. At a time when wannabe kings threaten welcoming cities  like Chicago, I am inspired by the stories of local residents  demonstrating that diversity, that equity, that inclusion which are  exactly what make our communities and our country strong.\n\nIn a time such as this, we need to summon the courage of those who  came…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…community leader from  Rochester, New York, Padron-Morales.\n\nAs co-founder of Hipocampo Children's Bookstore, Henry Padron-Morales  has created a space that celebrates culture, diversity, and the power  of literacy. Rooted in his Puerto Rican heritage, his vision and  leadership have fostered a love of reading while amplifying voices that  too often go unheard.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695845/recognizing-henry-padron-morales"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…ensure that America's promise  extends to every American. In 2025, as we face renewed attacks on these  principles, we must renew our commitment to this work.\n\nLet me be clear: Diversity, equity, and inclusion are not about  guarantees and preferences; they are about removing barriers. They are  not about lowering standards; they are about ensuring that the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690322/ending-of-dei-programs-through-executive-order"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…1975, WRTP BIG STEP was determined to improve the labor  force through its efforts in reshaping apprenticeships. The  organization envisioned an environment that intertwined diversity,  resilience, and creativity to produce an incredible generation of  workers. Soon, their vision became a reality as WRTP BIG STEP developed  pre-apprenticeship programs…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695334/recognizing-the-50th-anniversary-of-wisconsin-regional-training-partnership-building-industry-group-skilled-trade-employment-program"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Anglers; Big Mountain Dreams; BlueGreen Generation; Bolder       Options; Californians for Western Wilderness; Cascade Forest       Conservancy; Center for Biological Diversity; Change the       Chamber; Clean Water Action Minnesota; Colorado Mountain       Club; Colorado Wild Public Lands; Conservation Colorado;       Conservation Lands Foundation;…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…SUBRAMANYAM. Mr. Speaker, I rise in support of merit-based  hiring, especially in the Federal Government, because this  administration, which has talked a lot about the evils of diversity and  fired veterans left and right, is now focusing its hiring efforts  exclusively on one thing, blind loyalty to the President. It is like  DEI for MAGA.\n\nAccording to…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691978/recognizing-fauquier-high-school-class-of-2025"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…Exxon, to Nvidia--summoned to the White House, pressured to avoid  disfavor or bad regulatory decisions; suing a globally known company  like Nike for choosing to have a diversity program.\n\nWhere is the alarm and the concern from the Chamber of Commerce, the  Business Roundtable, the National Association of Manufacturers, those  who have stood up in…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…to ensure that these overreaching regulations are  permanently overturned. By doing so, we will protect small businesses  from unnecessary compliance costs and preserve the diversity of choice  available to consumers.\n\nThis action aligns with our broader commitment to roll back  burdensome regulations that stifle economic growth and infringe upon  individual…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689262/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…$5.1 million for programs to  strengthen the resilience of lesbian, gay, bisexual, transgender,  intersex, and queer--good grief--global movements; $1.5 million to  advance diversity, equity, and inclusion in Serbia's workplaces; $2  million for Moroccan pottery classes; $2 million for sex changes and  LGBT activism in Guatemala; $33,000 for being LGBTI--I…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692388/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…quality of life and experiences for residents, businesses, and  visitors.\n\nOver the span of more than seven decades, the South Tahoe Public  Utility District has achieved a wide diversity of accomplishments,  including building the world's first advanced wastewater treatment  plant, bringing high-quality Tahoe tap to the community, earning  national recognition…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…enforcement and our intelligence agencies find bad actors.\n\nThat is a good thing. That is not a bad thing. It is important,  though, that we preserve the dynamism and the diversity of our banking  sector. That is why we also want large regional banks, regional banks,  midsize banks, and, yes, community banks and microbanks. We want it  all. It is the…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…expertise in military and foreign       relations matters. Thus, the Arkansas wilderness bill and the       Texas anti-clear cut measure both fit neatly in his       legislative diversity plan. In a 1986 law school paper,       distinguished Little Rock attorney, Scott Trotter, postulated       that Tower was recruited as a co-sponsor ``in anticipation of…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…for messianic era which Greenberg       testifies is within human reach in our postmodern era with       its new opportunity for creative human unity within enriching       diversity, upholding universal human dignity and equality via       restoring God's violated image, ``I hope it will appeal to       non-Jewish readers as well, especially to Christians,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697168/the-triumph-of-life"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Association and the Spokane Chinese Christian Church for  hosting an outstanding Lunar New Year celebration in Spokane.\n\nThe event was a vibrant tribute to our community's diversity and the  rich cultural traditions that strengthen all of us. The music and dance  performances showcase not only extraordinary talent but also the spirit  of unity and joy…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700140/recognizing-joshua-elliott"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…two-spirit farmers in New York; cut $24 billion to USAID; cut $22  billion from Health and Human Services to provide housing and cars for  illegal aliens; cut $45 million for diversity, equity, and inclusion  scholarships in Burma; cut $8 million to promote LGBTQ in Africa; cut  $10 million for male circumcision in Mozambique; cut $20 million for  the Arab…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}, {"senator": "French Hill", "party": "Republican", "sentence": "…held as political prisoners, and have little recourse.\n\nThe discrimination they face not only violates their basic human  rights, but also undermines Egypt's rich cultural diversity and  history, as well as Egypt's own legal commitments to its citizens.\n\nIt is critical for the international community to encourage the  Egyptian government to further embrace…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698914/warmth-of-collectivism"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…about those ten countries? Not one of those  countries are sending us immigrants who are primarily European in  nature. I should maybe qualify that. For whatever reason, the diversity  bureaucrats have decided to tell us that people, say, from Cuba or the  Dominican Republic are not European.\n\nI have always felt it was odd the way they define this. You…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…conventional,  traditional banking system.\n\nOur banking system, in contrast to Europe and China, is the envy of  the world due to its free market principles, dynamism, and diversity.  Banks of all different sizes serve customers, communities, and  businesses with all different needs. Capitalism promotes market  demands, which incentivize banks to offer…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693730/anti-cbdc-surveillance-state-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…advocate for others but has also dedicated herself to  advocating on Capitol Hill for those living with rare diseases. She is  also a dedicated member of the Rare Disease Diversity Coalition (RDDC),  where she works to ensure that the needs of rare disease patients are  heard. Liz's work with the RDDC has been instrumental in promoting  inclusivity…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688709/recognizing-elizabeth-kennerleys-tireless-rare-disease-advocacy"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…permit, which under  current law only lasts 5 years, has caused national marine sanctuaries  to effectively become no-go zones for undersea cables. This means  reduced routes of diversity, consolidation of cable landing zones, and  an increased threat to our national security.\n\nNotably, this dynamic does not just cause stress on the physical  infrastructure…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Carter), who represents the Second District.\n\nThis legislation helps pave the way for greater U.S. competition with  China by promoting technology that encourages vendor diversity.  Specifically, this legislation requires NTIA to provide support to all  of our small and rural communications providers that want to deploy  Open RAN technology. Promoting…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693488/open-ran-outreach-act"}]