[{"senator": "Sarah McBride", "party": "Democrat", "sentence": "…decision isn't about  readiness. It is not about discipline or merit, and it is certainly not  about cost.\n\nIt is about exclusion. It is about using identity as a wedge to  divide and distract. It is a cynical politics, not sound policy. Our  military, which should never be a political tool, is paying the price.\n\nAcross Delaware, from Georgetown to Wilmington,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693974/transgender-americans-serve-with-honor"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…help and serve  everyone else in the community.\n\nA lot of this rhetoric that you are hearing from people who don't  want to talk about this reconciliation bill is trying to divide us into  ``us'' and ``them'' buckets. The truth is that we are all in this  together. We are all in this country together. We are all in this  debate together. We are all in…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Mr Speaker, I rise today to honor and celebrate March 14,  3.14, or Pi day. Pi is a Greek letter, and in mathematics it is a  symbol for the number you always get when you divide a circle's  circumference by its diameter. Many people approximate pi as 3.14 or  3.14159.\n\nBut the number is irrational and will continue infinitely without  repeating. If…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688887/recognizing-pi-day"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…who make this country work.\n\nMadam Chair, I urge my colleagues to reject it, and I reserve the  balance of my time.\n\nMr. BEYER. Madam Chair, while we are doing math, when I divide $2  trillion in savings and cuts over 10 years, I get $200 billion a year.\n\nMadam Chair, I yield such time as she may consume to the gentlewoman  from Massachusetts (Ms. Clark),…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…students, and digital literacy skills are fundamental  to succeeding in this digital economy, but that economy also creates a  new system of haves and have-nots. In education, that divide is called  the homework gap. It is a fundamental question of equity and fairness  to close that gap. Studies have shown that without broadband at home,  people earn lower grades…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690726/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…by loading every  defense bill with radical, rightwing policy riders. These riders have  turned what was once a rare area of bipartisan consensus into yet  another partisan divide.\n\nThis time around, Republicans have loaded the national defense bill  with provisions to prevent female servicemembers from accessing  reproductive healthcare. They have given…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…other as fellow  citizens on one shared journey, we find that what unites us is far  greater than what divides us.\n\nWhile the temptation is great, we cannot let this moment divide us.  We were never meant to be the divided States. We were created as and  have thrived for over 250 years as the United States.\n\nMr. FIELDS. Mr. Speaker, one of the problems…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690322/ending-of-dei-programs-through-executive-order"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…is as sick as it is a waste of time.\n\nTrump is using the same tired playbook authoritarian regimes have  used throughout history. He is dehumanizing our most vulnerable to  divide us and distract us from the fact of his failure to meaningfully  improve the lives of the people he was elected to serve.\n\nMr. Chair, we see this for what it is, and we refuse…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695236/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…Their goal is simple: Erase facts, silence independent voices,  replace them with partisan noise, and use them as propaganda machines  to spread disinformation and continue to divide our Nation.\n\nThe latest example is President Trump's removal of Dr. Carla Hayden  as Librarian of Congress, a respected public servant with decades of  experience, and his…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691316/republicans-assault-on-american-arts-culture-and-public-knowledge"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…needed to  complete their homework, to attend class, to reach their full  potential.\n\nThis repeal will widen educational disparities in our country, it  will deepen the digital divide, and it will slam shut the doors of  opportunity for millions of children in our country.\n\nWe should be doing everything in our power to close the homework gap  that exists…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…My whole life, not just my time in public service, has been about  finding and working the common ground that unites us rather than  feeding the anger and resentments that divide us. Politicians on the  far fringes of each side desire divisions that they believe can lead to  elective office, power, and status. It is a false and dangerous path.\n\nThe…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697353/america-needs-unity"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…to celebrate that people from diverse backgrounds  worked together to create a new country, the Republican Congress and  Trump Administration advance hate and brutality to divide our great  nation.\n\nI reject this bill that makes poor people poorer, sick people sicker,  and hungry people hungrier.\n\nI reject this bill that bill rips health care from 17…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693186/one-big-beautiful-bill-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…from  the Province of Alberta that want to break away from Canada and form  their own nation.\n\nWhy any American government would give aid and comfort to a group  that would divide and destabilize an ally and peaceful neighbor like  Canada is beyond reality.\n\nYet, those who speculate we should invade and take Greenland by force  are operating with Vladimir…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699490/alberta-canada"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…our memory because her legacy endures.\n\nAs we close out Immigrant Heritage Month, Saint Frances Xavier  Cabrini challenges us to stand up to those in power who would seek to  divide us and pit us against our own neighbors.\n\nDespite those who seek to use their faith to justify their cruelty,  we remember that the Bible itself teaches us that: ``When a stranger…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…excellent  presentation, but this bill is a case study in a legislative majority  that is in search of not common ground and common sense but rather  extreme measures that divide and polarize the Congress and the people.\n\nOnce upon a time this was a sensible, bipartisan bill led by our  Democratic colleague, Val Demings from Orlando, Florida, who had…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…and the South without the  capital they need to build and scale businesses. Access to capital is  not just a coastal issue. It is a national economic necessity.\n\nThis capital divide is why the DEAL Act is so critically important.  This bill is a targeted, forward-looking effort to modernize outdated  rules and channel investment to where it is needed most.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697190/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…violence-- including, by the way, the riots in 2020--in the false name of  supposedly healing racial division or in the name of certain lives  mattering because we want to divide our country further.\n\nOrganizations funded for a specific purpose, to create instability  and to undermine our way of life and our freedoms, should be  investigated. Leftwing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…should educate the young people  on all of the issues. Until they realize what our government is doing,  they may go back to the days of Joe Biden, a time in which he tried to  divide people by ethnic background.\n\nWe will continue down the path of having huge incentives not to get  married, and our young people will continue to be educated that America…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…had 20 Republican, 20 Democrat,  and 9 bipartisan amendments. The second managers' package was similarly  bipartisan.\n\nIn October, we considered the NDAA amid stark partisan divide during  the longest Federal shutdown in the history of our Republic.  Nevertheless, during that shutdown, this body came together to pass  this very important legislation.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698257/nominations"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…disagreement never descends into violence.\n\nNow, more than ever, we must remember that we are all Americans, and  what unites us is far more powerful than anything that might divide us.\n\nI am deeply grateful to Melissa Hortman, John Hoffman, and both of  their families for everything they have contributed to our great State  of Minnesota. I think one of…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692860/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…state  and federal grants, as well as a $100 million investment by the  cooperative itself, Tombigbee Electric Cooperative has delivered on its  promise to bridge the digital divide for rural Alabamians.\n\nMr. Speaker, this milestone represents more than the completion of a  project, it signifies a lasting investment in the prosperity and  potential of…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696050/recognizing-the-tombigbee-electric-cooperatives-achievements"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…clothing. Each in his own way honors July 24, and I ask you today to  honor those long-dead pioneers as well as those whose hearts hold Utah  close.\n\nThis place west of the Great Divide and east of Salt Flats, north of  the Grand Canyon and south of the lava flows and potato fields of Idaho  is my home. I wasn't born in Utah. In fact, my father wasn't even…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694022/july-24th-utahs-state-holiday"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…of food that we eat at home.\n\nYet, I ask us as we tackle this issue to be focused on solving the  problem and not making it worse by trying to come up with things that  will divide us all.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691193/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…did the basic math. If you actually were saying, let's just go  back to the tax rate for the top earners back to 2017, it is $32.7  billion over 10 years. Okay, we can all divide that by 10, so let's  call it $3.2 billion a year.\n\nWe borrow $6 billion a day. If that is $3.2 billion, you functionally  bought yourself 12\\1/2\\, 13 hours' worth of borrowing…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…Energy and Natural Resources--a committee that I currently  chair--that fits into each of these categories: controversial bills  where there is a sharp Republican-Democratic divide; bills that have  some controversy that cut across party lines; and, yes, mercifully,  this other category of noncontroversial votes without a single  substantive objection.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…provides each a motion to recommit.\n\nAdditionally, the rule provides for consideration of H.R. 1048 under  a structured rule. The rule provides for 1 hour of debate equally  divide and controlled by the chairman and ranking member of the  Committee on Education and Workforce or their designees. The rule also  provides for one motion to recommit.\n\nThe…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…initial requests for next year's budget.\n\nOne of the goals of the Biden administration, of course, could  destroy the country by having unfettered immigration, but also to  divide America by groups. Part of that was when he passed one of his  big bills, and he put in there an American Hispanic museum. This is  consistent with the Democratic policy of…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692121/opposing-funding-for-museum"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…to thrive, from accurate mail delivery to reliable emergency  services to robust economic growth.\n\nThis is a moment to act with purpose.\n\nLet's be the bridge that heals this divide and make a meaningful  difference in the lives of our constituents.\n\nMr. Speaker, by receiving a unique ZIP Code, these communities will  hold on to more of their tax revenue,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…for one motion to  recommit.\n\nMr. Speaker, I rise in support of this rule and in support of the  underlying legislation. The rule before us once again exposes a  fundamental divide in the House. Republicans are focused on protecting  American lives, American infrastructure, and American national  security. Democrats are focused on protecting bureaucracies,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…to  initiate war unilaterally. These Founders were not just engaged in a  sales pitch; they were accurately representing the Constitutional  Convention's decision on how to divide the war powers. Initiation,  declaration of war, would be the prerogative of Congress; execution,  fighting the war, would be the prerogative of the President.\n\nAn early draft…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}]