[{"senator": "John Larson", "party": "Democrat", "sentence": "…husband,       Carman.\n\nIt is also appropriate that we are here today, in East       Hartford, the place where my grandmother met her love,       Carman, and started a family. The divine serendipity of a       faulty bus on Silver Lane where two strangers met and set off       a series of events that led to nearly all of us being       together today. That…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688362/eulogy-by-sam-iacobellis-for-dorothy-christiana"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…the hurt inflicted on our world or to contribute toward its  healing. The choice is ours.'' and each day he rises and chooses serve,  to lead, to guide, to empower, and to divine God's grace into healing.  And it is my humbling honor to note for the Congressional Record the  unique gift of Ecumenical Patriarch Bartholomew's leadership and  spiritual…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695860/recognizing-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…The Voices of Tabernacle and served as minister of music for  churches across southwest Georgia, gathering and guiding people in  worship.\n\nIn 1991 Bishop Williams answered a divine call to preach the gospel.  He pursued nonprofit and leadership training at Clark Atlanta  University and, in 1992, launched Gethsemane Worship Center  International in Albany…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…the streets between which St. Augustine  High School has been located for 74 years. More appropriate symbols  would be difficult to find as so much of this school speaks of Divine  Providence. I congratulate the St. Augustine High School Purple  Knights, the 1975 Championship Football Team, and those that continue  the mission of the Josephite Fathers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695287/recognizing-the-50th-anniversary-of-an-historic-athletic-achievement-in-the-history-of-the-louisiana-high-school-athletic-association-lhsaa"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…replacing  someone if they aren't up to the job. We have got to look for people  whom we can trust for the long haul.\n\nThe Senate will soon vote on the confirmations of Joshua Divine to  serve as a judge for the Eastern and Western Districts of Missouri and  Judge Cristian Stevens to serve for the Eastern District. I am  concerned about these two nominees.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693940/judicial-nominations"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…wrongfully incarcerated for 22 years, outlaw discrimination  against pregnant women in the workplace, and a Specialty License Plate  to benefit organizations that comprise the Divine Nine with 85 percent  of the proceeds from the sale of the plate benefitting the  organizations to support scholarships.\n\nCareer highlights, honors, and awards include: Having…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689507/recognizing-geraldine-f-thompsons-service-to-the-great-state-of-florida"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…colleagues  will--if they vote for this nominee.\n\nAnd we should not in any way turn a blind eye toward the other  nominees that will be before us for the district court: Josh Divine,  Maria Lanahan, Jordan Pratt--all nominated to serve as district court  judges on the Federal bench. They have made careers of crusading  against reproductive rights.\n\nJudge…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…inviting a court to strike down whatever  fallback rule the administration tries reverting to, and when that  litigation ensues and they comb through the Congressional Record to  divine the intent of Congress, they will see pretty plainly that I  warned you folks that that was the case right here on the record.\n\nNow, since this information seems new to some…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690404/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Speaker, I congratulate Dearborn's Divine Child High  School for winning the Division 4 State championship with a thrilling  23-22 win.\n\nAfter a dominant season, they rose to the moment at Ford Field to  earn their…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697975/divine-child-championship"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Reverend Carr's  unwavering dedication, hard work and strong faith.\n\nReverend Carr's journey has been one of a vision, purpose, and  service. Before deciding to follow her divine calling, Sarah was a  respected leader and worked in various capacities, including Alexandria  City Public Schools, the Campagna Center, and the Alexandria  Recreational Department.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688586/recognizing-reverend-sarah-yvonne-williams-carr"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…years or more, these days have expressed faith that can  move the human conscience. Faith motivates people's behavior to think  about the difference between daily life and the divine and what life  could be.\n\nChristians are encouraged to be a sacrificial people and,  importantly, a resurrection people. Jews think of how hard it was for  their ancestors…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "French Hill", "party": "Republican", "sentence": "…envisioned in his famous 1630 sermon. Grounded  in the ideas at the heart of the Declaration that all men are created  equal and that governments derive their power not from the divine right  of kings but from the consent of the people, the United States has made  the world more free and more prosperous over our two-and-a-half  centuries.\n\nTo celebrate our…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699867/for-americas-250th-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…slavery. John Quincy Adams  knew it for what it was, a stain on our soul, and he worked so hard,  dedicating his life to eliminating slavery. I can't help but think of  the divine providence that allowed John Quincy Adams for one term to  serve in the same Chamber as Abraham Lincoln. I think God smiled upon  our Nation when he did that to pass the torch…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697633/adams-memorial-great-american-heroes-act"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…fundamentally at odds  with one another. The Constitution begins with: ``We the people.''  Sharia states: ``Allah has said.'' Followers of sharia believe Muhammad  received a divine legal code that stands supreme over all man-made  laws.\n\nWhile Western civilization has evolved, Islam has not. Islam is stuck  in the eighth century, and if they succeed at…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697017/sharia-is-dangerous"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…haunting Biblical.       Words come true on a sacred turned scarred Day robbed of its       joys, ``For a stone shall cry out From the wall.'' Once       loving homes where the Divine forged an abode turned Into       blackened stones soaked from Hatred--filled wells of blood       and fire, With walls of witness wailing in silence Of strewn       bodies,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697096/recognizing-october-7-revisited"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…Dena of Zamosc,\n\nWith radiant grandma Rachel smilingly approving,\n\nReassuring their first grandchild,\n\nA refugee like Father Abraham and Mother Sara,\n\nWhose birth was surely a divine sign of a threatened\n\nCovenant renewed, to protect me always with a Tallit\n\nOf reaffirmed life even if God's blessing would not.\n\nRabbi Dr. Israel Zoberman is the founder and…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699495/recognizing-remarks-of-rabbi-dr-israel-zoberman"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…from       nihilism and despair by showing me the incredible tenacity       and unspent power of embracing life. The emergent State of       Israel suggested to me that the Divine was still operating in       the world, and testified to the human capacity to take power       for reestablishing life and reasserting its value.''\n\nReferring to his book…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697168/the-triumph-of-life"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…the Republic.\n\nEvery individual is born with intrinsic dignity that is       inherent to each member of the human race with life being our       most fundamental inalienable divine right. All men and women       have the right to liberty, self-determination and self-      governance. The individual's responsibility of work,       education, and industry…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688744/declaration-of-mothers-a-proclamation-and-pledge-for-the-preservation-of-freedom-and-virtue"}]