[{"senator": "Rob Menendez", "party": "Democrat", "sentence": "…covered in ashes, trying to get home. It  is impossible to forget.\n\nWhat I remember most is how we came together as a country after that  fateful day and how we bridged our divide and joined together as one  Nation in grief and mourning but also in resolve and patriotism.\n\nToday, 24 years later, we are once again reminded of how easily those  divisions…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695319/recommitting-to-civility-and-unity"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…mandate the       following year, leading to the creation of the Government of       National Stability in the east and entrenching the dual power       system that continues to divide Libya to this day.\n\nSporadic clashes also persist, sometimes among internal       factions of the two major governments that claim legitimate       authority in Libya, such…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Kirk's wife and young daughters who are enduring  unimaginable pain and sorrow.\n\nSadly, Republicans are misleading Americans and deliberately using  this resolution to further divide Democrats and Republicans at a time  when all Americans need to come together to condemn acts of political  violence, which are becoming all too commonplace in our Nation.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695762/issues-with-h-res-censure-of-rep-omar"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…our memory because her legacy endures.\n\nAs we close out Immigrant Heritage Month, Saint Frances Xavier  Cabrini challenges us to stand up to those in power who would seek to  divide us and pit us against our own neighbors.\n\nDespite those who seek to use their faith to justify their cruelty,  we remember that the Bible itself teaches us that: ``When a stranger…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…place that allow our citizens to feel safe,  for there to be accountability''--we are being told that it is too  complicated because we already have a bill and we will have to divide  it, and that means procedural hassles; that means, oh, the House will  have to come back.\n\nAre we serious? That is called doing your job. It is called  accountability. It…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699407/9999"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…us who  serve in this body, in public office, have a duty to end that silence  and loudly and resolutely condemn Islamophobia and anti-Arab hate.\n\nAnd while others seek to divide and distort circumstances to advance  their narratives, there are so many stories actually worth telling. So  I want to take a moment to recognize and celebrate the contributions…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…Governor of each State makes the decision about  when and where to deploy National Guard, not Presidents who are trying  to score cheap political points and who are trying to divide our  Nation.\n\nI am very proud to be a veteran, and as ranking member of the  Military Personnel Subcommittee, it is my responsibility to make sure  that we are taking care…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695246/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…by loading every  defense bill with radical, rightwing policy riders. These riders have  turned what was once a rare area of bipartisan consensus into yet  another partisan divide.\n\nThis time around, Republicans have loaded the national defense bill  with provisions to prevent female servicemembers from accessing  reproductive healthcare. They have given…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…down in Black neighborhoods. We have long lines in indigenous  communities that stretch around the corner and throughout the night. We  have purges, ID laws, and maps drawn to divide rather than to unite.\n\nMr. Speaker, we have courts gutting the Civil Rights Act, statehouses  cooking up new restrictions, and a President threatening to override  the will…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…communities like the Sacramento region  where, just 20 minutes outside the city, rural areas still suffer major  gaps in broadband coverage.\n\nProgress to close the digital divide, however, is currently at a  standstill. This critical broadband funding must not be delayed. We  cannot risk changes that waste taxpayer dollars and strand Americans  with…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690255/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…from  the Province of Alberta that want to break away from Canada and form  their own nation.\n\nWhy any American government would give aid and comfort to a group  that would divide and destabilize an ally and peaceful neighbor like  Canada is beyond reality.\n\nYet, those who speculate we should invade and take Greenland by force  are operating with Vladimir…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699490/alberta-canada"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Discuss, argue, debate and disagree,      Our voices echoing with every strive      To from one another's perspective see.       My fellow Pages across the aisle:      Let our divide be only by miles.                             by lilliana grinberg       It's a new day, here in the Capitol:      Prayer and pledge and now hear the gavel.      Under these…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…needed to  complete their homework, to attend class, to reach their full  potential.\n\nThis repeal will widen educational disparities in our country, it  will deepen the digital divide, and it will slam shut the doors of  opportunity for millions of children in our country.\n\nWe should be doing everything in our power to close the homework gap  that exists…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…for the  broadband division in its work on finally rolling out the rest of the  broadband grants for universal high-speed internet access and to  finally close the digital divide.\n\nLastly, I can't help but say the public safety division is essential  for NG911 services and FirstNet.\n\nI commend the committee for this much-needed network, and I ask my…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690254/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…race--everywhere in the United States.''\n\nHe says: ``regardless of residence, station, or race.'' That is  Presidential leadership that brings people together. It doesn't seek to  divide us, which is what, unfortunately, is happening in the United  States of America right now.\n\nPresident Truman goes on to say to Congress: ``We should resolve now  that the health…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…and the South without the  capital they need to build and scale businesses. Access to capital is  not just a coastal issue. It is a national economic necessity.\n\nThis capital divide is why the DEAL Act is so critically important.  This bill is a targeted, forward-looking effort to modernize outdated  rules and channel investment to where it is needed most.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697190/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…violence-- including, by the way, the riots in 2020--in the false name of  supposedly healing racial division or in the name of certain lives  mattering because we want to divide our country further.\n\nOrganizations funded for a specific purpose, to create instability  and to undermine our way of life and our freedoms, should be  investigated. Leftwing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…it by ethnic group or dividing it by gender. He was a  genuine Communist sort of person.\n\nPrior to this time, people who wanted to destroy this country thought  they could divide it by income, and they thought they could make  everybody very mad and jealous of very successful people and tear down  America by doing that.\n\nThey tried in the 1960s. There…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…had 20 Republican, 20 Democrat,  and 9 bipartisan amendments. The second managers' package was similarly  bipartisan.\n\nIn October, we considered the NDAA amid stark partisan divide during  the longest Federal shutdown in the history of our Republic.  Nevertheless, during that shutdown, this body came together to pass  this very important legislation.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698257/nominations"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…disagreement never descends into violence.\n\nNow, more than ever, we must remember that we are all Americans, and  what unites us is far more powerful than anything that might divide us.\n\nI am deeply grateful to Melissa Hortman, John Hoffman, and both of  their families for everything they have contributed to our great State  of Minnesota. I think one of…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692860/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…state  and federal grants, as well as a $100 million investment by the  cooperative itself, Tombigbee Electric Cooperative has delivered on its  promise to bridge the digital divide for rural Alabamians.\n\nMr. Speaker, this milestone represents more than the completion of a  project, it signifies a lasting investment in the prosperity and  potential of…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696050/recognizing-the-tombigbee-electric-cooperatives-achievements"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…clothing. Each in his own way honors July 24, and I ask you today to  honor those long-dead pioneers as well as those whose hearts hold Utah  close.\n\nThis place west of the Great Divide and east of Salt Flats, north of  the Grand Canyon and south of the lava flows and potato fields of Idaho  is my home. I wasn't born in Utah. In fact, my father wasn't even…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694022/july-24th-utahs-state-holiday"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…of food that we eat at home.\n\nYet, I ask us as we tackle this issue to be focused on solving the  problem and not making it worse by trying to come up with things that  will divide us all.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691193/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…did the basic math. If you actually were saying, let's just go  back to the tax rate for the top earners back to 2017, it is $32.7  billion over 10 years. Okay, we can all divide that by 10, so let's  call it $3.2 billion a year.\n\nWe borrow $6 billion a day. If that is $3.2 billion, you functionally  bought yourself 12\\1/2\\, 13 hours' worth of borrowing…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…Energy and Natural Resources--a committee that I currently  chair--that fits into each of these categories: controversial bills  where there is a sharp Republican-Democratic divide; bills that have  some controversy that cut across party lines; and, yes, mercifully,  this other category of noncontroversial votes without a single  substantive objection.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…provides each a motion to recommit.\n\nAdditionally, the rule provides for consideration of H.R. 1048 under  a structured rule. The rule provides for 1 hour of debate equally  divide and controlled by the chairman and ranking member of the  Committee on Education and Workforce or their designees. The rule also  provides for one motion to recommit.\n\nThe…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…initial requests for next year's budget.\n\nOne of the goals of the Biden administration, of course, could  destroy the country by having unfettered immigration, but also to  divide America by groups. Part of that was when he passed one of his  big bills, and he put in there an American Hispanic museum. This is  consistent with the Democratic policy of…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692121/opposing-funding-for-museum"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…to thrive, from accurate mail delivery to reliable emergency  services to robust economic growth.\n\nThis is a moment to act with purpose.\n\nLet's be the bridge that heals this divide and make a meaningful  difference in the lives of our constituents.\n\nMr. Speaker, by receiving a unique ZIP Code, these communities will  hold on to more of their tax revenue,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…for one motion to  recommit.\n\nMr. Speaker, I rise in support of this rule and in support of the  underlying legislation. The rule before us once again exposes a  fundamental divide in the House. Republicans are focused on protecting  American lives, American infrastructure, and American national  security. Democrats are focused on protecting bureaucracies,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…to  initiate war unilaterally. These Founders were not just engaged in a  sales pitch; they were accurately representing the Constitutional  Convention's decision on how to divide the war powers. Initiation,  declaration of war, would be the prerogative of Congress; execution,  fighting the war, would be the prerogative of the President.\n\nAn early draft…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}]