[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…standards and  support having consistent guidance from DOE, as opposed to ever- shifting goalposts.\n\nAgain, even if my colleagues on the other side come up with testimony  or documents today that say that the Department of Energy was wrong, it  would have been helpful to hold a hearing where their experts could  come in and challenge the Department of Energy…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689127/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…not grow by what some would consider a very large number, but  it did move to 66 Members of Congress with H. Res. 705.\n\nThe reason I know Members are in possession of these documents that I  have called to your attention that were displayed is because I sent  them to the Members. I sent Members a thank-you, as we customarily do  here, and it was something…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…real obstacles for transgender people by  requiring DOD systems to list the wrong gender for transgender people.  Discrepancies between these systems and trans people's legal documents  will cause a host of issues, including complicating background checks.\n\nThis administration is already forcing transgender servicemembers out  of the military just because…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695261/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…of the action taken this  evening--quoting still from the letter:\n\nEPA stated that the Notices of Decision were not rules       under CRA, and, in the underlying decision documents for two       of those notices, cited to our 2023 decision in support of       that statement. However, EPA submitted them as rules to GAO       and Congress without any…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…Affairs Technology  Modernization Subcommittee.\n\nEvery day, my office hears from veterans who are struggling to get  the benefits that they earned because of overcomplicated documents and  bureaucratic red tape. Correspondence from the VA regarding benefits  decisions, often called notice letters, usually contain complex legal  jargon, which can be confusing,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689679/clear-communication-for-veterans-claims-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…naturalization.--An alien       may not apply for naturalization while the alien is in       permanent resident status on a conditional basis.       SEC. 6. DOCUMENTATION REQUIREMENTS.\n\n(a) Documents Establishing Identity.--An alien's       application for permanent resident status on a conditional       basis may include, as proof of identity--\n\n(1) a passport or national…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Donald Trump when he was his  personal attorney. He defended the President when the President was  accused of inciting the January 6 insurrection, mishandling classified  documents, falsifying business records, and more.\n\nSo what should that do when someone defends a President who is  accused of very serious crimes? It should disqualify them from the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693921/nomination-of-emil-j-bove-iii"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…burden. For rural communities, it is an added  burden. For people of color, it is an added burden. For the 21 million  American citizens who don't have ready access to these documents, it is  a burden.\n\nThe right to vote is sacred, and I will fight any effort to put more  barriers in citizens' way to exercise it, and that is exactly what the  SAVE America…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699947/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…with young children. Head Start affords working families  the peace of mind that their children will be cared for and educated  during the workday.\n\nRecent White House budget documents show that the administration has  backed down, for now, in some of their attacks on Head Start and the  resources that are helping our families, but we can't stop our advocacy…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690638/trumps-first-100-days"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the victims  is bad enough, but what makes it even more heinous is how far the DOJ  went to protect Donald Trump during these releases. The DOJ took down  pages and pages of documents that were full of vulgar accusations  against the President. And when they got caught, they put the documents  back up without redacting the information of the victims.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699465/epstein-files"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…settlements, internal  Department of Justice communications about decisions to charge or not  charge those involved, all communications about attempts to conceal  information or documents, and any documentation related to Mr.  Epstein's detention or death.\n\nIt makes one exception, and that exception is deleting the names of  the victims involved. They should…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…``It is a  republic, if you can keep it.''\n\nArguably, Mr. Franklin's most important accolade is that he is the  only person to have signed formally all three foundational documents  separating our new Nation from the British monarchy.\n\nThe Treaty of Paris, the Declaration of Independence, and the Bill of  Rights, together known as the Charters of Freedom,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688221/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…here today.\n\nThe Tax Court Improvement Act will strengthen Tax Court procedures  and practices by making four commonsense reforms. The act will  accelerate the collection of documents, expand the types of cases  assigned to special trial judges, hold Tax Court judges to the same  recusal standards as other Federal judges, and allow the deadline for  petitions…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697271/tax-court-improvement-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…current laws are working; so we don't  need new documentation requirements like passports and birth  certificates.\n\nBy the way, 21 million Americans cannot readily access these  documents. We shouldn't be risking the disenfranchisement of 69 million  American women who have changed their names from what is printed on  their birth certificates, most of whom…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…that the shooter committed this terrible crime to terrorize  and intimidate. He intended to spread his hate and violence toward many  more public servants. The gunman had documents listing dozens of  additional lawmakers targeted for assassination or for violence,  including Congressman Krishnamoorthi who, of course, is a member of our  Oversight Committee.…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692858/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…career in South Carolina serving as the in-house  Counsel for the Georgetown County government. In this role, Mac was  responsible for drafting, reviewing, and approving legal documents,  including deeds, contracts, leases, dedication instruments, financing  documents, resolutions and ordinances. These wide-ranging  responsibilities afforded Mac the opportunity…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "James Risch", "party": "Republican", "sentence": "…a majority vote of the       committee at a meeting or by proxies, shall have authority to       subpoena the attendance of witnesses or the production of       memoranda, documents, records, or any other materials. At the       request of any member of the committee, the committee shall       authorize the issuance of a subpoena only at a meeting of…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…smuggling  linked to Maduro, now exceeding thousands of tons.\n\nThe new indictment highlights other criminal activity directly tied  to Maduro, including providing fake travel documents to facilitate drug  smuggling under the guise of diplomatic cover and partnerships with the  Sinaloa Cartel boss El Chapo.\n\nThe bottom line is that Maduro is a thug. He is…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698885/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…Investigation, and the heads of appropriate       Sector Risk Management Agencies, as determined by the       Director of CISA, shall provide to the task force such       information, documents, analysis, assessments, findings,       evaluations, inspections, audits, or reviews relating to       efforts to counter the cybersecurity threat posed by State-      sponsored…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE.  Res. 262, which is at the desk.\n\nMr. THUNE. Mr. President, this resolution concerns a subpoena for  deposition testimony and documents in a civil action pending in Federal  district court in the District of Columbia. Plaintiffs in this case,  former employees of the Architect of the Capitol, have sued the…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691911/authorizing-testimony-document-production-and-representation-by-the-senate-legal-counsel-in-the-case-of-in-re-architect-of-the-capitol-employment-dispute"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…1601.0-      5(n).\n\n11. 85 Fed. Reg. 45438 (July 28, 2020).\n\n12. See Id.\n\n13. North Dakota RMP, at 3, 13, and 25. BLM houses the       North Dakota RMP and other relevant documents on its National       NEPA Register website. BLM, BLM National NEPA Register,       Documents, available at https://eplanning.blm.gov/eplanning-  ui/project/1505069/570 (last…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693059/us-government-accountability-office-legal-opinion"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…motion.--A motion described in paragraph       (1) shall--\n\n``(A) be in writing;\n\n``(B) describe any supporting evidence;\n\n``(C) state the offense; and\n\n``(D) include copies of any documents showing that the       movant is entitled to relief under this section.\n\n``(3) Hearing.--\n\n``(A) Mandatory hearing.--\n\n``(i) Motion in opposition.--Not later than 30 days…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…half of all covert tests. That is  unacceptable, and it should never have been allowed to persist. It is  also preventable.\n\nH.R. 3425 makes sure FPS reviews these failures, documents them,  identifies the root causes, and then takes corrective action.\n\nThis bill also addresses the embarrassing state of FPS's Post  Tracking System. Back in 2018, FPS promised…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695060/personnel-oversight-and-shift-tracking-act-of-2025"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…deal and other sources of revenue, which was a really  bad idea. That is why Trump pulled out.\n\nHere is the reporting over the period here:\n\nHamas-Iran alliance: Captured documents expose decades-long       terror funding.\n\nWhen Israel began to liberate Gaza from Hamas and drive out Hamas  terrorists, they found a treasure trove of documents showing…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Angela  Davis, who some on the left view as a hero, as another person who was  antifamily.\n\nMore recently, Black Lives Matter, during their ascendancy a few  years ago, in documents written by their founders, wanted to get rid of  the Western-prescribed, so-called nuclear family.\n\nEven after that was out there on the internet, before they took it  down,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…Resolution shall be       available at a public website of the Library of Congress.\n\n``(2) The Librarian of Congress shall ensure the continuing       availability of the documents referred to in paragraph (1) to       Congress and the public.''.\n\n(c) Repeal of Additional Printing Requirements.--\n\n(1) Mandatory printing of additional copies.--Section…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689324/repeal-requirement-for-congressional-research-service-to-prepare-annotated-constitution-and-supplements-in-hardbound-version"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "Mr. BURCHETT.  4405) to require the Attorney General to release all documents  and records in possession of the Department of Justice relating to  Jeffrey Epstein, and for other purposes, and ask for its immediate  consideration in the House.\n\nMr.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696708/request-to-consider-hr-epstein-files-transparency-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the U.S.''\n\nThis is done by some of the super economic geeks out of Boston and  Cambridge, but what terrified me because I am actually doing my best to  read these sorts of documents is the little sentence I have highlighted  here. I tried to point this out last week. This is for supergeeks. If  you use a 6 percent discount rate, you need 104 percent…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…proposed trying to get to $2 trillion in spending  reductions. Dear heaven, I hope we can be tough enough and disciplined  enough to get there. I have produced all sorts of documents. I am not  one of those people giving speeches. I am showing up with binders of  ways you can get there. Much of it isn't cuts. It is just using  technology to change the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…minors and one count of conspiracy to commit sex  trafficking of minors, and he was later found dead in the New York  Metropolitan Correctional Center;\n\nWhereas according to documents released from Epstein's estate, during  a House Committee on Oversight and Reform hearing featuring testimony  from Michael Cohen, disgraced former attorney to President…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696890/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}]