[{"senator": "Haley Stevens", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of the DOE and NASA Interagency  Research Coordination Act, H.R. 1368.\n\nThe gentleman from Alaska (Mr. Begich) and the gentleman from  California (Mr. Whitesides), the vice ranking member…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688987/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…want to do, they say: We are  going to amend the Department of Energy's mission to include securing  the supply of critical energy resources--not minerals--and it directs  the DOE to conduct ongoing assessments to develop strategies to  strengthen critical energy resource supply chains--not minerals.\n\nAgain, this vague definition risks diverting resources…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…natural gas pipelines.\n\nH.R. 3628 would force states to show arbitrary preference for fossil  fuels over clean, cheap energy.\n\nH.R. 3638 would require the Department of Energy (DOE) to issue a  supply chain report, asking DOE to do more with less after Elon Musk  and DOGE forced out 3,500 DOE employees and put the agency's capacity  to write such a report…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698075/opposition-to-permitting-bills"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…common-sense energy efficiency  standards for commercial refrigerators, freezers, and walk-in coolers-- standards that were rigorously developed by the Department of Energy  (DOE) to save businesses money while cutting energy waste. These  updated regulations are technologically feasible, economically  justified, and essential for reducing long-term…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689256/opposition-to-hj-res-24-and-hj-res-75"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…However, this bill would remove that  requirement so that FERC and the Department of Energy would have the  final say on pipelines and power lines, respectively.\n\nWhile FERC and DOE could consult with other appropriate Federal  agencies, such consultation is optional.\n\nIf there is a disagreement between the State Department and the  Department of Energy…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695689/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Speaker, hopefully, our friends and colleagues in the other  Chamber are listening because we are moving once again to pass an  incredible piece of legislation, H.R. 1350, the DOE and NSF Interagency  Research Act, that I and Dr.  Jim Baird have introduced yet again to  see it, hopefully, pass in the House, and we eagerly await the Senate  to take it…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688990/doe-and-nsf-interagency-research-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…electricity, or $54 billion annually.       One hundred percent of our member companies are from the       manufacturing sector and are price sensitive.\n\nThe U.S. Department of Energy (DOE) has already approved a       significant volume equal to 48 Bcf/d for shipment to non-free       trade agreement (NFTA) countries, which equals 49 percent of       2024 net…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…we are not  giving Europe or other allies enough LNG. The fact of the matter is  that we are sending more LNG to our European allies and our other  allies than ever before.\n\nDOE, the Department of Energy, has issued enough permits to triple  our export capacity from what it is today, even if they never issued  another permit. That will take us into…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…prices,  meaning our constituents and our neighbors would face higher  electricity bills and pay more at the gas pump.\n\nThat is why I planned on introducing legislation requiring DOE to  certify that LNG exports to our foreign adversaries are actually in the  public interest and aligned with our Nation's national security needs.\n\nWe must close this current…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697082/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…haven't heard from the other side or any experts they  cite to, other than their own opinion, to say the experts at the  Department of Energy made a mistake.\n\nThe experts at DOE who established these energy conservation  standards were not politicians. DOE's process involves extensive  stakeholder engagement, working with manufacturers and advocates…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689127/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…whether they are imported or made here in  the U.S.\n\nRepealing the certification would increase costs for the  manufacturers that play by the rules and can make it harder on the DOE  to enforce standards against those that don't. The good guys  all like the rule and don't want it repealed. Only the bad foreign  manufacturers might like to get rid of the…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688549/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…``Colorado company may close after Trump administration cuts  funding for nearly 3 dozen energy projects in the State.''\n\nI will quote this article, Madam Speaker: ``In all, DOE eliminated  $7.6 billion in projects in 16 States, all of which are led by  Democrats.''\n\nHere is the kicker: ``But some of the projects are in Republican  congressional districts,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697884/state-planning-for-reliability-and-affordability-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…address the real challenges facing our  neighbors, helping them with the cost of living, housing, healthcare,  and electric bills. This bill will simply make matters worse.\n\nThese DOE standards are long overdue. It has been, I think, at least  6 or 7 years since they have had an update. The law says you update  energy-efficient standards for appliances every…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…by making it permanent.\n\nOf course, they offer no justification as to why this council and  only this council is special. There isn't one.\n\nI also want to point out that among DOE's other 27 advisory councils,  not a single one is focused on clean energy. There is no solar council,  no wind council, no battery council, and not even a geothermal energy…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695765/national-coal-council-reestablishment-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…offices, including the  Office of Manufacturing and Energy Supply Chains, which would have been  tasked with carrying out the very report required by this bill.\n\nBack in October, DOE canceled over $7 billion in energy project  awards throughout the Nation, including nearly $1 billion from projects  funded through the then Office of Manufacturing and Energy…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…However, the Department of Energy has the  ability under Federal law to waive or reduce that grant amount.\n\nIt has become clear in recent years that it is not transparent when  the DOE uses that authority. It is hampering our ability as Members of  Congress to provide the oversight necessary into the activities of the  DOE.\n\nThis bill will impose a quarterly…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688928/cost-share-accountability-act-of-2025"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…on  fundamental research that will enhance existing production methods and  unlock new, innovative techniques. This will ensure that the world- class tools and technologies at DOE are being used by the very  taxpayers who funded them.\n\nIt also enables DOE, in consultation with other Federal agencies, to  offer technical assistance to entities seeking…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688937/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…years. They  will incur significant, major up-front costs on equipment while  reckoning with associated operational disruptions and supply chain  challenges. The Biden-Harris DOE itself estimated that the cost of  these standards, which were last updated just a handful of years ago,  to be almost $1 billion, with a b.\n\nHowever, the real cost, Mr. Speaker,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689265/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…authorizes the U.S. Department of Energy and the  National Aeronautics and Space Administration to carry out research and  development activities focused on the advancement of shared DOE and  NASA mission priorities. This includes R&D in critical technology areas  like nuclear thermal propulsion systems, astrophysics, radiation health  effects, machine learning,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688986/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…enacted by the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``DOE and USDA Interagency       Research Act''.       SEC. 2. DEPARTMENT OF ENERGY AND DEPARTMENT OF AGRICULTURE                     JOINT RESEARCH AND DEVELOPMENT ACTIVITIES.\n\n(a)…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688980/doe-and-usda-interagency-research-act"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…yet too many of them face roadblocks when  trying to do business with the Federal Government's largest buyer, the  Department of Energy. That is why I proudly introduced the DOE and SBA  Research Act, which strengthens the relationship between America's  small businesses and the Department of Energy.\n\nThis legislation creates a partnership between the…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687908/doe-and-sba-research-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…regulation, I mean it is merely a labeling thing that doesn't cost very  much according to my colleagues on the other side of the aisle, then  what in the world were we doing having DOE employees?\n\nWe have got so many DOE employees that they have time to spend all  day, weeks, and months creating a new regulation that my colleagues on  the other side of the…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688547/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…resolution shall not be subject to a  demand for division of the question at its adoption.\n\nAdditionally, the rule provides for consideration of H.J. Res. 20, a  CRA relating to the DOE's water heater rule, under a closed rule. The  rule provides for 1 hour of debate equally divided and controlled by  the chair and ranking member of the Committee on Energy…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…bothered.\n\nMr. Chair, we need to support this amendment. I urge passage, and I  yield back the balance of my time.\n\nMr. PERRY.\n\nMr. PERRY. Mr. Chair, this amendment fully defunds DOE's Office of  Energy Efficiency and Renewable Energy, or the EERE.\n\nThis amendment is offered because we simply cannot continue to fund  the destruction--and that is what it…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Accountability Act of 2025, is a good  government bill that does exactly what it says: It improves  accountability.\n\nLed by Mr. Obernolte, this bill requires the Department of Energy  (DOE) to submit a quarterly report to Congress describing instances  where it has modified or waived cost-share requirements and make these  reports publicly available.\n\nDOE is subject…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688929/cost-share-accountability-act-of-2025"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…our  energy security.\n\nThe facts are clear: We must reform the broken approval process and  unlock LNG's potential. My bill does exactly that. It eliminates the  politicized DOE, which was weaponized by the previous administration,  and gives FERC sole authority over that authorization process.\n\nThis is common sense. FERC already leads the review of…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697088/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…yield myself such time as I may consume.\n\nMr. Chairman, I rise in support of the amendment from my colleague,  Representative Houlihan from Pennsylvania.\n\nThis amendment requires DOE to evaluate the potential role  transitioning military servicemembers could play in meeting the  workforce needs for the electric supply chain.\n\nMr. Chair, while our efforts…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…standards is up to 93.9 years. That is right, nearly 94 years.\n\nTo make matters worse, the Department of Energy's test procedures do  not align with real-world conditions. The DOE's estimate of the CRE  door openings in an hour often undercounts the real number of door  openings. This means the appliance's interior temperature may rise  above safe food-storage…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689131/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…investment, $112 million from the State of  Texas, and just last month, thanks to the leadership and vision of  Secretary Chris Wright, has received a conditional commitment from DOE  to provide its fuel.\n\nThis is the only molten salt reactor to ever receive a construction  permit from the Nuclear Regulatory Commission and the first research  reactor to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694865/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…amended standards are economically justified, as  well as technologically feasible, and that they result in significant  savings. Not only is it unclear if compliance with the DOE's final rule  is technically feasible but it is certainly clear that the rule is not  cost-effective.\n\nFor example, one popular refrigerator design covered by this rule,  vertically…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}]