[{"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…and Russia, the United  States must stand firm in our support of Ukraine's young democracy.\n\nHistory makes clear that appeasing a bloodthirsty dictator in Europe  simply does not work. It only encourages him to continue his  aggression, press for more territory, and shed more innocent blood.\n\nJust last week, Russia launched a barbaric missile strike…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690214/supporting-ukraines-independence"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…economics are a resounding failure, Republicans  are nonetheless pushing ahead with their party orthodoxy. We have more  than enough evidence that trickle-down economics does not work. It  doesn't help the middle class. It doesn't create jobs. It doesn't  increase business investment, and it doesn't grow the economy.\n\nWhat these policies actually do…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…Personally, I think it is wide open to have that  conversation. What should the medical profession do?\n\nSecond, when there is a transgender woman or a transgender man, how  does that work in terms of sports and a wide variety of different  things with women's sports or men's sports? We can have a conversation  about how to fit that in.\n\nActing like transgender…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…it in their bill and make consumers pay to send hundreds of millions of  dollars to these big donors.\n\nSo that is what we see in New England.\n\nOn the Hawaii grid, how does this work also?", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699019/energy-costs"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…cuts to the ultrawealthy will,  somehow, magically help the Nation.\n\nBut time and time again, we have seen the same script yield the same  results. This approach simply does not work. Since 2001, $31.6 trillion  has been added to our total debt, and thanks to the ``Big Bad Bill,''  that total is about to get supercharged.\n\nIt won't stop there.\n\nLater…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695675/cloture-motion"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…bad policy that is hurting our country, leaving us behind, and  costing Americans more. The people I serve deserve nothing less than a  Congress that works together and does the work that they have been  constitutionally given the right to do.\n\nNo one should cede our House of Representatives' constitutional power  to Donald Trump. We can fix this. We…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695609/devastating-harm-caused-by-trump-administration"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…We can help you, but why are you doing this if it  is all part of a larger package to give tax cuts to the wealthiest  Americans, to give tax cuts to billionaires? How does that work?\n\nThat Elon Musk should get richer and richer and richer, and  families--the love in these letters--who love their children, who love  their aging parent, who love that…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…weapons.\n\nIf we do this, we would be giving away the most significant strategic  advantage that our country has, which is this huge database of exactly  what works and what does not work in detailed and very technologically  aggressive designs for our nuclear weapons.\n\nIf we open that Pandora's box, every country that is nuclear-capable  will say this is…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…her that they would only  continue mailing a paper check to the same address where it had failed  to get to her multiple times.\n\nThis policy is burdensome and it simply does not work. The caseworker  on my staff continued to encounter cases just like this one, some  taking over a year to resolve. This is way too long for the American  public, and we…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689292/recovery-of-stolen-checks-act"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…of providing critical electrical services to  the residents of Orange, he has built a legacy of hard work. What makes  him so deserving of this award is not just what he does at work. It is  the time and energy he devotes to strengthening our community. He has  helped grow local businesses and create new opportunities for the  people of Orange County.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690866/constituent-of-the-week-joe-clontz"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…coverage  altogether because they will not be able to afford it.\n\nI want to share the story of a constituent who lives in my district  in Brooklyn, a woman who wants to work, who does work, and who  contributes to her community every single day.\n\nDenise, of Prospect Lefferts Gardens, is self-employed. She is a  graphic designer. She also lives with lupus, a…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…professionals. I  never asked a single one what their party affiliation was. They  oftentimes put their lives in harm's way and, candidly, never get the  attention that our military does. They work in secret.\n\nThe truth is, these professionals and the work they do deserve to be  respected, honored, and listened to because if you corrupt the  intelligence and bend…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…detained abroad? Is that allowed? Can he argue the  courts can't require him to call such a deal off? Or maybe he just  denies it and says any agreements are state secrets. Does that work?\n\nIf President Trump said he would pay El Salvador $6 million to  assassinate his rivals, I think we would all agree that that is  blatantly unconstitutional. And if the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…belong to the Federalist Society or now this Teneo Network, you are in.  It means a nominee will use the Republican playbook for deciding  important Federal cases. How does it work? You claim to be neutral,  but, in fact, you contort history and overturn precedents to reach the  Republicans' preferred outcome.\n\nMs. Hermandorfer followed this playbook…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693415/nomination-of-whitney-d-hermandorfer"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…have to worry about whether House Democrats are going to stand up  for you because you have always been there for us.\n\nThat is our personal story. Every single one of us does this work  because we have lived a life of opportunity that this great country has  provided to us.\n\nWe are deeply troubled, saddened, and disgusted that this great  institution,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…create an opportunity to cut away a lot of fraud.\n\nDemocrats created a program that Americans can't afford. The  unaffordable care act works for insurance companies, but it does not  work for patients. Like I mentioned, it is filled with waste and fraud.\n\nInsurance revenues have increased from $245 billion, when ObamaCare  was originally passed, to $1.4…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…constituents.\n\nThe Biden EPA wrongly allowed California to enact an electric vehicle  mandate that will ultimately affect the entire United States.\n\nWhat works in Glendale does not work in Gettysburg. Allowing the  California waiver to stand impedes on the rights of all other States,  even those who do not follow California standards.\n\nNot only do EVs…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690494/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Bitcoin became popular.\n\nThe ability to do this depends on the architecture. There is no  corporate headquarters, no CEO. It is really math and computer  programming.\n\nHow does this work? They establish trust in a different way. They  assume they trust no one. The transactions are approved in blocks. With  blockchain, that is the way it is done. It is done…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…since we have the highest tax, we  must have great roads as a result. No, that is not the case either. We  have just about the worst roads of any State in the country.\n\nHow does that work: highest taxes, deepest potholes? It is a stark  illustration of our State government's utter inability to provide  effective services to our citizens.\n\nMr. Speaker, I…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…President of the United States, Mr.  Biden.\n\nThis is not political. This is getting the work done that Washington,  D.C. needs, and this commission process that we go through does not  work.\n\nI know we wanted to hear that this is all related to Donald Trump and  Republicans wanting to control the process that goes on so that we can  control Washington, D.C.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695616/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…building out this 911  system.\n\nJust last week, it was announced that after spending all of this  money, the State is scrapping the entire project because the technology  does not work. It is absolutely beyond belief. The $450 million that  Californians have been paying on their phone bill was absolutely,  completely squandered, wasted by the State, which…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}]