[{"senator": "Al Green", "party": "Democrat", "sentence": "…does,  and that is throw his acolytes, his underlings, his persons who are  beneath him, if you will, throw them under the bus, and he did. He  threw them under the bus. He doesn't know anything about this. He just  happens to have heard about it. The President gets briefings on all  important issues, but for him to sit and say, oh, I know nothing about…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…people of the city of Chicago, a city that my colleague does not  really understand the kind of faith that they have in Chuy Garcia all  of these years.\n\nFor someone who doesn't know about the city of Chicago and the role  that he has played and to find some outside idea that he has somehow  cheated the city of Chicago or the people of the city of Chicago--are…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696779/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…Then we were informed about a nonexistent Pelosi precedent.\n\nAt one point, the Speaker went on television and said, ``Bless her  heart. She's a Representative-elect. She doesn't know how things work  around here.''\n\nBless his heart, because here is how it should work. Let's call it  the Adelita Grijalva precedent: When the American people vote, this…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696709/welcoming-the-honorable-adelita-s-grijalva-to-the-house-of-representatives"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Congress, and he has his cane,  and he is just waving his cane.\n\nThat is what they say. They would have me become a person who is just  another person from some dark place who doesn't know what he is talking  about, so they talk about waving my cane.\n\nYes, I am waving my cane, and I am pointing it straight at all of you  who are antithetical to righteousness,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…violence against our very Members  of Congress who simply reminded our military of their constitutional  duty not to follow illegal orders. Most troubling, the President  doesn't know how to lead, and he doesn't care.\n\nMr. Speaker, I implore my Republican colleagues, ask yourself: Is the  President serious about stopping the flow of fentanyl?\n\nNo. He…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697535/venezuela-boat-strikes"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…four children, a  mortgage to pay, and his family lives paycheck to paycheck. He said,  with all the stress and hurt that is being caused by the Republican  shutdown, he doesn't know if people will be able to afford their  healthcare if it is taken away.\n\nThis week, people across America are watching Donald Trump tear down  the east side of the White…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…Hmong woman that I met in Hmong  Village just last week who, in tears, is telling me that her son has  been detained. He has been gone for days and days and days, and she  doesn't know when she is going to get him back.\n\nWhere is he?\n\nThis is about ICE agents going to a suburban restaurant in the Twin  Cities, having lunch, and then after lunch, they go…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Code.\n\nAs a reminder, by law, the Secretary of Education may not interfere  with the content that schools teach, nor the academic standards that  they set. Mrs. McMahon doesn't seem to know that.\n\nBy the way, while Mr. Musk has been tearing the Department of  Education apart from the inside, Republicans in Congress have passed  punitive blueprints that…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…DHS quickly whisked Javier out of Los Angeles,  all the way to El Paso, TX. His family feared that he could be deported  or he had been deported, not only to a country he doesn't know but to a  country whose language he doesn't speak.\n\nBut as tragic and as heartbreaking as Javier's story is, he is not  alone. There have been more and more stories of DACA…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694421/daca"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…deploying vaccine treatments. Only recently emerging from a devastating  public health crisis, we know firsthand how important their work is.\n\nSecretary Kennedy either doesn't know or doesn't care what his  Department's mission is. He is doing the administration's bidding to  eliminate funding that goes toward finding cures for cancer,  Alzheimer's,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Foundation and the Inter-American Foundation, agencies  established and funded with direct appropriations by Congress, that  their budgets are being slashed.\n\nElon Musk doesn't know and doesn't care why Congress established  these Agencies, what they do, or the positive impact they are having on  the lives of millions of people. To Musk and his DOGE…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…let's let sleeping dogs lie. What is the problem  with having proliferation of offenses that may be opaque, inscrutable,  obscure, and duplicative? One danger is the citizen doesn't know what  kind of conduct and behavior is actually expected of him or her. That  leaves the citizen in a state of confusion and potential anxiety.\n\nThe other major danger is…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697205/count-the-crimes-to-cut-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…city at the time.\n\nI couldn't believe the waste, fraud, and incompetence that occurred  at places like FEMA.\n\nHere we are, years later, with an acting FEMA director who doesn't  even know we have a hurricane season. Well, we do have a hurricane  season, and it is estimated by the National Oceanic and Atmospheric  Administration, or NOAA, that there will…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692184/concerns-about-hurricane-season"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…invasion was not a military operation. Do you  believe that? He calls it a law enforcement action. Really? Did these  funds flow from the Department of Justice? Congress doesn't know.  Thousands upon thousands of America's finest have been positioned and  missed holidays and family days on dozens of battleships, some lifted  in the air and then dispatched…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…companies  will have to pay more to import goods, and in turn, the American people  will have to pay more to buy those products.\n\nDonald Trump knows this. It is not that he doesn't know; it is that  he doesn't care. And those aren't my words; they are his. Just this  past weekend, he was asked about the effects that his tariffs will have  on the price of…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689475/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…tariffing  a country that acknowledges that they have a drug trafficking crisis  but weren't doing anything to fix it.\n\nI am going to suspect that my colleague over here doesn't know this  as well: Last year, Justin Trudeau, former Prime Minister of Canada,  himself addressed the fentanyl problem and said that it needed to be  eradicated. That is the…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699965/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…can--these brokers get paid a bonus for signing  up somebody new to the plan. The person is listed. Money goes to the  insurance company because the person is cut out of it and doesn't know  about.\n\nThat is why we had 200,000 complaints to the Federal Government last  year.\n\nIt is fraud, plain and simple. The Democrats want to continue it for  the next 3 years.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…that Greenland should be a part of  NATO, he should talk to people like me who have an election certificate  and a vote in the U.S. Senate, because I know what he either doesn't  know or he should know, and if he did know, I can't imagine why he  would make the comments that he did the other night in a television  interview.\n\nLet me give you some facts…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}]