[{"senator": "Mike Thompson", "party": "Democrat", "sentence": "…expect our healthcare system and infrastructure to stand. Hospitals  and clinics will close their doors. If they don't close, they will cut  services dramatically.\n\nIt doesn't matter if you are on Medicaid, on Medicare, if you have  private insurance through your employer, or you are filthy rich with  pockets full of gold. If you go to the hospital…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…and big  corporations.\n\nWho pays for the tax cuts? American families just trying to make ends  meet.\n\nThe Republican budget cuts at least $880 billion from Medicaid. It  doesn't matter whether someone is a Democrat, a Republican, an  Independent, or a nonvoter. Americans across the country will either  lose healthcare or see their premiums increase.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688258/american-families-will-pay-for-republican-tax-cut"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…causing people within this country to fear the other, the other, the  people from other countries.\n\nIf you are Latino in this country, you are now suspect. Mr. Speaker,  it doesn't matter where you are from. If you are a Latino in this  country, then you are now suspect. If you look like you are a Latino,  then you are now a suspect in the United States…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…to  extend provisions that hurt women on the issue of abortion. Some want  to block it because they want to privatize the system, which would only  make it worse. But it doesn't matter; we can debate all those things  down the road. The opportunity is now, right now, to allow this body to  unanimously pass this much-needed proposal to extend the credits…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Medicaid, whether millions of children  would lose access to food stamps, and just how many consumer watchdogs  they would fire at the Consumer Financial Protection Bureau. It doesn't  matter that the United States bond ratings were downgraded, that  foreign investors are dumping U.S. investments, or that small  businesses are struggling to keep their lights…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…heart attack--and  do you know what? They are dead.\n\nThis has real consequences for people when we don't have adequate  healthcare. This should not be a partisan issue. It doesn't matter if  you are a Republican or Democrat. When your mom is sick, you want them  to have healthcare. When your baby breaks their arm, you want them to  have healthcare. This…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688235/democratic-proposals"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…justice; and if there is to be justice, all babies have to be  treated equally. All babies have to be respected equally. All babies'  lives are equally as important. It doesn't matter where they are or who  they are.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…dismantling of the Department of  Education isn't just a bureaucratic decision. It is dangerous. It is a  decision that tells every child in this country that their future  doesn't matter, that their dreams are negotiable, that their ZIP Code  should determine the quality of their education.\n\nLet me be clear, that is not just wrong, it is vicious because…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689640/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "…help people in  their own States.\n\nThat is what the Democrat majority next year is going to do. We will  continue fighting for our own people throughout the country. It doesn't  matter if a constituent is in a red State or a blue State, if someone  is hurting because of the Republican majority this year. Donald Trump  has taken away healthcare. He has…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698802/breaking-the-gridlock-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…and hope of patients,  grandparents, mothers, fathers, and children who are counting on the  next clinical breakthrough to survive. These cuts say to them: Your  health doesn't matter. Your life doesn't matter.\n\nPresident Trump, unelected billionaire Elon Musk, and Secretary  Robert Kennedy are more concerned with cutting services and pushing an  antiscience…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…people under expanded Medicaid that were  eligible for Medicaid under the State program, but only 4,500 of those  300,000 to 400,000 qualified because of the paperwork.\n\nIt doesn't matter what you say. Eliminating these people is simply  unacceptable, and it just means they are going to go without health  insurance. Then the costs are going to go up for…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…for a vote if you agree, but that has not happened yet. And we know the  American people overwhelmingly oppose a military campaign there as  well.\n\nBut every week--it doesn't matter--Donald Trump keeps testing us to  see just how much he can get away with, threatening now a land invasion  of Venezuela and even seizing an oil tanker off its coast. Now,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…Minneapolis in the past 30  days. If you have a problem with any of  those things happening to you, you should have a problem with those  things happening in Minneapolis.\n\nIt doesn't matter if you are a Democrat or Republican. This is not  about political party.\n\nIn my State, we have seen political protests over the last 5 years  for all kinds of political…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…have for the Federal  Judiciary. They want to fill our courts with partisan operatives who  will protect and serve Donald Trump, not protect the rule of law.\n\nExperience doesn't matter. Judicial independence doesn't matter.  Understanding the law and applying it without fear or favor doesn't  matter at all. In fact, there is fear of Donald Trump among…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693921/nomination-of-emil-j-bove-iii"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…throwing it into chaos, all  just to score that quick win for their fossil fuel buddies because the  existing plans don't give away the store the way they would like to.\n\nIt doesn't matter that this might upend the system that grants land  ownership to Alaska Native veterans of the Vietnam war, which is what  one of these RMPs does, or that the Tribal governments…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694887/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…man.\n\nThis is not theoretical. These aren't just random incidents. This is  an epidemic. They are the natural, predictable consequence of policies  that pretend biology doesn't matter. These are the policies of the  left, policies of Democrats who say: Follow the science, except for  women. We don't care about you. We hate you. We want to take everything…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…the lives of  67 people.\n\nOver the time that I have been in Congress, we have had a number of  shutdowns and, in many instances, even Kansans told me: Shut her down.  It doesn't matter. It doesn't matter to me.\n\nI have never found the value in a government shutdown. That accident  that I just mentioned forced Congress and our Nation to reckon with an…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696174/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…to find out why costs are  going up so high when you are buying your insurance through your  employer or, as the employer, buying the insurance for the employee.  But it doesn't matter. If you are on the individual market or if you  are on the small business market, you are paying more, and because of  increasing healthcare costs, insurance premiums are…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…defendants'  desire to make money and to keep their jobs and was not an effort to  influence the election, so said the Pennsylvania Attorney General Dave  Sunday. It really doesn't matter what the motivation is. What matters  is the result--fraudulent voter registrations.\n\nBack in 2008, there was an organization called ACORN. There was an  ACORN whistleblower…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699945/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…That is, what, $70,000 to $72,000 a second.\n\nI have this aggregator on my news, and there are some crazy articles.  A couple leftwing economists are saying: Borrowing doesn't matter,  people are always willing to buy U.S. debt.\n\nOkay. Let's pretend these leftwing economists are right. We can  continue to borrow and borrow and borrow. They purposely…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…address  this. In the reconciliation bill that we passed, we included key  language to require stricter adherence to the budget neutrality  requirements for 1115 waivers.\n\nIt doesn't matter if the President is Democrat or Republican who is  approving these waivers. It needs to be budget neutral. We need to be  good stewards for programs like Medicaid and to…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…insurance, saving  the National Flood Insurance Program money; therefore, it is worthwhile  to raise your home.\n\nNow, however, under a new system called Risk Rating 2.0, it doesn't  matter. Here, they pay tens of thousands of dollars to elevate their  home, and under this new system, their premium is back up to $9,800 or  to $7,300--in this case, higher…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691629/risk-rating"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…it. If you buy something, you are trading. If you go to  the store and you buy a smartphone, and you give them $1,000, you want  that smartphone, and you don't lose. It doesn't matter where the money  went; you got your smartphone. You only give money to somebody for  something if you want it. If it is a voluntary trade, it is always  equal. Well, it…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…is it. They, the Chinese Communist leadership, almost  never abides by their agreements with the United States--and I mean  never. Big agreements, small agreements, it doesn't matter. They never  abide by their agreements. I have seen this throughout my career.\n\nIn 2003, I was actually in this meeting right there. That is  President George W. Bush and…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…deductibles.\n\nOut-of-pocket expenses became higher and higher for families across  this country. Whether you are in an employer-sponsored plan or an  individual  market, it doesn't matter. The entire thing has been destroyed by the  Democratic Party and their schemes.\n\nFor years, Washington has told the American people that if we just  spend more, if we…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…investors are doing to help prop up the Chinese economy  and the Chinese military?\n\nFailure to address outbound investment transparency is to pretend  that national security doesn't matter. And we don't have any more time  to procrastinate. The best time to act on this was years ago when my  initial outbound investment legislation was proposed and passed…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…water  resources and other conservation efforts.\n\nMr. Speaker, these things matter to the average American. My  colleagues are going to say that this is small ball, and it doesn't  matter.\n\nEvery one of these regulations add up to interference with the  enjoyment of life by the American people, drive up the price of the  goods and services for the average…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…absolutely screwed up, but the fact of the matter is on tax  collections, the numbers have been good, and we need a scorekeeper.\n\nMy grandfather used to have this saying: It doesn't matter how you  play the game. It is who keeps score. He thought that was hysterical.\n\nHow do we convince the American people we are serious about economic  growth, productivity,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}]