[{"senator": "Michael Bennet", "party": "Democrat", "sentence": "Not only does CPB funding provide needed resources  for local outlets--the lifeblood of our democracy, responsible for  ensuring informed debate and holding power to account--but these funds  also support a wide array of free, easily accessible educational  programming and resources for our children.", "title": "H.R. 4", "date": "2025-07-16"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "We will always find the money for war, but not to take care of our  workers or Tribal partners or to compensate the communities who paid  the price for that last generation of weapons, so we must act in good  faith to ensure an open-ended arms race does not happen.", "title": "Expiration of New Start", "date": "2026-01-14"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "The United States Postal Service does not use  taxpayers dollars for operating costs.", "title": "Closure of Quartz Hill Post Office", "date": "2025-06-26"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "Trump doesn't care about you, none of you.", "title": "Better is Possible", "date": null}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "since 2024.''  ``AFFORDABILITY,'' he said, ``is a Republican Stronghold.''\n\nDoes the President of the United States actually have any  conversations with families who are shopping for groceries?", "title": "The Economy", "date": "2025-12-01"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "What does the President do?", "title": "Providing for Consideration of Senate Amendment to H.R. Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "This portion does, in fact, follow the science.", "title": "Whole Milk for Healthy Kids Act of 2025", "date": "2025-12-15"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "Importantly, this legislation fully preserves FSOC's authority to  take swift action in emergency situations and does not alter the  authorities of FSOC's member agencies to take enforcement actions.", "title": "Financial Stability Oversight Council Improvement Act of 2025", "date": "2026-02-09"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "As the demand for satellite services increases, so does the need to  protect these communications networks from untrusted actors and  equipment.", "title": "Secure Space Act of 2025", "date": "2025-04-28"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "I wish my Republican colleagues would take that oath because the harm  that this proposal does to the least amongst us in this country is  unfathomable, cruel, and madness from a financial perspective.", "title": "Gop Tax Scam Hurts Everyone", "date": "2025-05-20"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "So I am asking my colleague: What kind of threat does this blatant  corruption pose to our democracy, our institutions, and on the American  people?", "title": "Trump Administration", "date": "2025-10-21"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "the  Republicans ought to nationalize the voting.''\n\nDoes Donald Trump need a copy of the Constitution?", "title": "Government Funding", "date": "2026-02-02"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "It weakens national security, and it undermines  the critical work that the Army Corps of Engineers does to keep our  coastal communities safe.", "title": "Energy and Water Development and Related Agencies Appropriations Act, 2026", "date": null}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Limiting  commercial filmmaking and photography of the Capitol, an important  vehicle for telling the Nation's story, does not serve the American  people.", "title": "Introduction of A Bill to Permit Commercial Filmmaking and Photography on the Grounds of the U.S. Capitol", "date": "2026-01-20"}, {"senator": "Al Green", "party": "Democrat", "sentence": "The President is not playing the role of a negotiator because the  President does not seek to get input from the Palestinians.", "title": "Impact of President on Peace Process", "date": "2025-02-27"}, {"senator": "William Timmons", "party": "Republican", "sentence": "(2) Agency.--The term ``agency'' has the meaning given that       term in section 3502 of title 44, United States Code, except       that such term does not include an element of the       intelligence community.", "title": "Strengthening Agency Management and Oversight of Software Assets Act", "date": "2025-12-15"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "According to Joel Trotter, one of the authors of the JOBS Act,  ``Decades of successful experience show that the well-known seasoned  issuer category is long overdue for expansion.''\n\nI couldn't agree more, and this bill does exactly that.", "title": "Expanding Wksi Eligibility Act", "date": "2025-12-01"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "If I am reading one of the paragraphs here correctly, they are  basically saying our computer model doesn't go beyond 250 percent.", "title": "Tell the Truth About Math", "date": "2025-03-25"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "The Bureau of Land Management, which would inherit the property  through the reversion, does not want to manage the land in question.", "title": "Reversionary Interest Conveyance Act", "date": "2025-05-13"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "It does.", "title": "Government Funding", "date": "2025-10-03"}, {"senator": "James Risch", "party": "Republican", "sentence": "If, within three calendar days       after the filing of the request, the chairman does not call       the requested special meeting, to be held within seven       calendar days after the filing of the request, a majority of       the members of the committee may file in the offices of the       committee their written notice that a special meeting of the       committee will be held, specifying the date and hour of that       special meeting.", "title": "U.S. Senate Committee on Foreign Relations Rules of Procedure", "date": "2025-06-02"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "All  it does is remove the dangerous, misguided ban that stops us from  considering any project.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to Public Land Order No. 7917 for Withdrawal of Federal Lands; Cook, Lake, and Saint Louis Counties, Mn", "date": "2026-01-21"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "2965, the Small Business Regulatory Reduction  Act, led by Representative Van Duyne from Texas, would ensure that any  agency action taken by the Small Business Administration does not  increase compliance costs on small businesses.", "title": "Providing for Consideration of H.R. Student Compensation and Opportunity Through Rights and Endorsements Act; Providing for Consideration of H.R. Combating the Lies of Authoritarians in School Systems Act; Providing for Consideration of H.R. Transparency in Reporting of Adversarial Contributions to Education Act; Providing for Consideration of H.R. Promoting Responsible Oversight to Eliminate Communist Teachings for Our Kids Act; Providing for Consideration of H.R. Small Business Regulatory Reduction Act of Providing for Consideration of H.R. Destroying Unnecessary, Misaligned, and Prohibitive Red Tape Act", "date": "2025-12-02"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "I urge my colleagues to support both the GENIUS Act and the CLARITY  Act and send a message that America leads in financial innovation and  does so with integrity, strength, and a firm commitment to protecting  the people we serve.", "title": "Guiding and Establishing National Innovation for U.S. Stablecoins Act", "date": "2025-07-17"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Where does it end?", "title": "The California Redistricting War", "date": null}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "Speaker, any  soldier or veteran will tell you that service to the Nation takes many  forms, but that also means sacrifice does, too.", "title": "Benefits That Endure for Lifetimes of Service Act", "date": "2025-05-13"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "We are the only  State that does it because the Supreme Court ruled that way.", "title": "Providing for Consideration of S. Veterans Accessibility Advisory Committee Act of Providing for Consideration of H.R. Law- Enforcement Innovate to De-Escalate Act; Providing for Consideration of H.R. Undersea Cable Protection Act of and Providing for Consideration of H.R. Securing America's Critical Minerals Supply Act", "date": "2026-02-11"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "Speaker, you are sure to hear from my colleagues on the other  side that noncitizen voting doesn't exist or that it rarely happens so  we don't need to do anything about it.", "title": "Safeguard American Voter Eligibility Act", "date": "2025-04-10"}, {"senator": "James Lankford", "party": "Republican", "sentence": "The executive branch does have checks and balances, as does the  legislative branch, as does the judicial branch.", "title": "Nationwide Injunctions", "date": "2025-05-22"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "I have been an  advocate of looking at ways to trim mandatory spending programs, and  the Big Beautiful Bill does just that.", "title": "One Big Beautiful Bill Act", "date": "2025-07-14"}]