[{"senator": "Steve Cohen", "party": "Democrat", "sentence": "…incorporated United States of America, Inc., in  Texas. What that means is it shows his mentality. He thinks he owns  this government. He has bought it. He has been given it. He doesn't  care about anybody else. He is the only stockholder.\n\nAmerica is not a stockholder. Americans are the people who give him  the money to give it to the trillionaires and…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688101/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…States. While it       is reassuring that our government--in your hands--is       addressing it at the highest levels, it is troubling that it       has to be addressed at all. It doesn't take much history to       teach us that what starts with hatred of the Jewish people       does not end there.\n\nWhat are the conditions that nurture antisemitism?…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690804/rose-helene-spreiregen"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…are rising for other things, like groceries,  prescription drugs, and other necessities. So health insurance is going  to push people off of a financial stability. If Congress doesn't extend  the expiring ACA credits, an estimated 5 million Americans--80,000  Washingtonians--will drop insurance altogether, creating more  uncompensated care.\n\nAnd as I said…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697783/healthcare"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…longer hold the  Executive accountable; dismantled so that the political opposition  never has enough room to maneuver meaningfully.\n\nThere are still elections. The Executive doesn't try to stuff the  ballot box. Occasionally, at lower levels, the opposition still wins.  But what happens is that those structures of accountability are either  so degraded…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…infrastructure  and lower their energy bills.\n\nAt the heart of Delaware's agriculture industry are chickens. We have  roughly 200 chickens per person in Delaware, and while Delaware doesn't  have a ton of people, that is a lot of chickens.\n\nThe rising crisis of bird flu poses a massive risk to Delaware  farmers. It is a real and present danger to our food supply…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688191/protecting-agriculture-the-backbone-of-delawares-economy"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…and the second dealing with  overdraft protection. In both cases, I came here for the entertainment  value to watch Republican after Republican tell us how much the  majority doesn't trust the Trump administration. It is as if Trump  doesn't control the CFPB.\n\nMr. Speaker, the regulation we are considering now is just a  regulation that says that this…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689952/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…other side of the aisle will choose to do so as well.\n\nThe Senate passes bipartisan appropriations bills every year. They  are hard, and they take months to negotiate, and it doesn't always work  as well as it should. Senators on both sides of the aisle often discuss  wanting to return to something we call regular order. We decry full- year continuing…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693591/rescissions-act-of-2025"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…Trump is punishing cities like Portland  simply for standing against his authoritative power. This isn't about  safety. It is political retribution, plain and simple. Portland doesn't  need his help. We are resilient, creative, and strong.\n\nTo my fellow Oregonians: I am standing with Governor Kotek, Attorney  General Dan Rayfield, our delegation, and local…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695215/national-guard-in-portland"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…our ability as servants of  the people to speak up for the people that we represent. Make sure that  we do not normalize this kind of violence simply because the White  House doesn't agree with people who dissent.\n\nIf this is how a U.S. Senator can be treated, then none of us  ultimately are immune. If this is how a U.S. Senator can be treated,  none…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692557/alex-padilla"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…impact of Medicaid cuts on hospitals in all areas and people  in every part of their States.\n\nBut those efforts are doomed to failure. They fall short. The rural  healthcare fund doesn't come close to offsetting the losses rural  providers will face from the cuts of Medicaid, just to give you one  example. That is why I have joined Senator Wyden and Senator…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694385/9999"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…systematic attacks on scientists at CDC, at  NOAA, the EPA, and the NIH--career professionals driven from public  service for the crime of publishing findings the President doesn't  like, DOGE'd for speaking truth to power, for respecting facts and  science, or simply--seemingly and perversely in this cruelest of  administrations--fired for the apparent…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700183/state-of-the-union-address"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…isn't a need for it to be  made great. It is already great. We have all got to learn how to work  together so that everybody can benefit from the greatness of this  country.\n\nIt doesn't take anything away from a child sitting in a class with my  grandchildren, learning about the contributions, learning about Chappie  James. How can that be an insult? There…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…people have no criminal records in the United States, and yet  all of these people have now been imprisoned in a foreign country with  no end date in sight.\n\nUnconstitutional doesn't even begin to cover that.\n\nThere are so many questions--basic questions--about this that we all  should be demanding answers to. At the barest, smallest, slimmest  minimum--and…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…risks involved.\n\nAs my friend and ranking member of the Financial Services Committee,  Ms. Waters, has said during our markup of this bill:\n\nJust because you have $1 million doesn't mean you       understand the complexities of the private markets. On the       other hand, you shouldn't be prohibited from investing in       products if you have full…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692775/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…bottom line. Their  cost estimates keep growing and growing. A new arms race is a race with  no finish line. Let us be clear: There are no winners, only losers in  this race.\n\nIt doesn't have to be this way.\n\nWe must urgently renew and expand nuclear arms control treaties with  both Russia and with China. The path to security lies not in new  warheads or…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694116/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…forward without hesitation. When  the mission demanded long hours and personal sacrifice, she never asked  for recognition. She simply got the job done.\n\nThat kind of leadership doesn't happen by accident. It comes with  character, from experience, and from a deep belief in service before  self.\n\nHer impact extends well beyond my office. She has mentored…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699672/recognizing-christine-lee"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…Communist-inspired Confucius Institutes.\n\nThis places the Chinese authorities in a real position of influence  among our young people, all the more so because our own government  doesn't try to hold our colleges and universities accountable to the  basic disclosure standards.\n\nA 2019 Senate report found that up to 70 percent of all institutions  failed to…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689026/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Anyone who wants to get in a room and come debate me with a  whiteboard, show me the math. At some point, if you are in Congress,  pass a math test because the Senate bill doesn't add up. It will  destroy this country with more deficits and the inflation tax that is  crippling the average American family.\n\nMr. Speaker, I will not vote for the Senate…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689906/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Congressional Review Act. The purpose of these is to undo  burdensome Biden regulations. This is our ability and our prerogative  to hold the Biden administration accountable, and that doesn't stop  just because the Democrats lost an election and we have a Republican in  the White House. We have a duty to undo some of that damage.\n\nUnder these bills, we would repeal…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…This is a  moment. This bill, as we advance this, will be a reconciliation bill.  Traditionally, in my recent memory, these have been majority-rule  votes. The opposition party doesn't vote for these. These go on party  lines. The vast majority of what is in this particular one, we actually  have a lot of bipartisan support on it.\n\nThis tax bill that we…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…words will take the uncertainty out of  whether this agreement will be extended, and if it is not extended,  there will be great economic loss to the United States. Uncertainty  doesn't help anybody's economy. Such uncertainty is holding back our  economic growth.", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699771/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…all ginned up, you cut $800 billion from  this, and a little bit from a couple other things, it was less than 2  percent of that spending.\n\nAre you telling me that the left doesn't believe that if you are  spending $86 trillion as your baseline spending, and understand--I am  going to show you some of the charts and how much of this is basically  demographics.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…themselves, and  themselves alone, is outrageous. I will, of course, be voting to repeal  it today.\n\nWe also need to ask how this was allowed to happen, and I have to  tell you, it doesn't help that the House wasn't even here. For 6  straight weeks, House leadership decided to cancel our sessions, every  oversight hearing, every markup of legislation, everything.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696926/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…duty.  They are issued handguns, maybe a shotgun, and maybe a rifle. That is  it.\n\nThese things are ultimately distractions. The DOGE stuff I won't  respond to at all because it doesn't need to be.\n\nThis is a commonsense bill supported by a lot of law enforcement  agencies, a lot of law enforcement organizations, and was voted on in a  bipartisan fashion…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691348/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…CRA simply reverses the withdrawal that the Biden administration  put out. It takes us back to Congress' original intent to allow  somebody to propose to develop a project. It doesn't change any of the  permitting laws. They still have to go through every permitting law.\n\nThere seems to be a lot of scare tactics on what this mine, which  hasn't even been…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…not justify  the actions that we witnessed last night, the disrespect of the  institution.\n\nUsing the argument that, well, our side did it so we can do it, too,  well, that doesn't work. That does not hold water.\n\nMr. Speaker, we can do better. Mr. Speaker, we must do better. We  cannot ignore the willful disruption intended to stop a proceeding.\n\nLet…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688496/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…time period.\n\nWhen I was Governor of North Dakota in 2000, our State was producing  less than 100,000 barrels a day. We took that up to 1.5 million barrels  of oil a day. This doesn't just happen overnight. It is because we work  to provide the regulatory certainty to empower innovation and  entrepreneurial spirit to unlock the potential for energy development…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688157/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "John Thune", "party": "Republican", "sentence": "…literally since 2021 has tripled.\n\nAs I said before, there are lots of reasons why people don't file  claims. You might have a good, healthy year. You may be a younger  person who doesn't have health issues. But the fact of the matter is,  you would see--from 2021, when they made this change to take the lid  off of income and to create zero-dollar premiums…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…Since January of last year, there has been a 1,347-percent increase in  assaults against ICE officers, a 3,200-percent increase in vehicular  attacks. And don't tell me Tim Walz doesn't have something to do with  that, and don't tell me that Mayor Frey doesn't have something to do  with that, with the rhetoric. Even Senators on this floor, you know,  called…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "John Rose", "party": "Republican", "sentence": "…activities of Special Counsel Jack  Smith and to consider possible Fourth Amendment violations during  Operation Arctic Frost.\n\nThat deserved scrutiny. That deserves answers. It doesn't merit  restitution paid for by hardworking waitresses, truck drivers, and  small business owners. Hardworking taxpayers shouldn't be punished to  put millions of dollars…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699753/repeal-of-senate-payday-provision"}]