[{"senator": "Ro Khanna", "party": "Democrat", "sentence": "…the American people. How is that  America first?\n\nThen he says he doesn't care about the cab driver who is now paying  $2,600 per month in healthcare as opposed to $44. He doesn't want to  save the 20 million Americans who are going to face high premium  increases. How is that America first?\n\nMr. Speaker, we need national health insurance in this country.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696687/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…trusted with your money, it should play  by the same rules as any bank. That is what the CFPB was doing. It was  making sure the rules apply to everyone.\n\nYet, Elon Musk doesn't want to follow the rules. He wants to turn X,  formerly known as Twitter, into a payment platform without any  accountability and no rules. If you get scammed, that is too bad.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689951/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…bill that has been introduced into the U.S.  Senate that has 11 Republicans that are cosigners, including the  Republican who authored it, a colleague out of Missouri. He doesn't  want his folks to go hungry, and he said: Enough of this nonsense.  Let's have a bill on the floor.\n\nGive him a UC. If you don't want to give the Democratic bill a  unanimous…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…expert civil service; it is jeopardizing our government's  ability to deliver crucial services to the American people.\n\nAnd like authoritarians in the past, President Trump doesn't want you  to know about his illegal actions, so he is covering them up by  undermining independent oversight at every single turn.\n\nAnd when it comes to picking winners and losers,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696352/trump-administration"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…are going to put all of the good work and all of the experience  they have to the side because the Republicans don't want us to see what  the real score is. The majority doesn't want my colleagues to see the  kind of reckless deficits that this bill is going to create.\n\nMr. Suozzi said it well:\n\nAll of the tax policy that we are talking about is not…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…actors. That is a world away from the independent  agencies that they are now where they act in the public interest and  not in the interest of polluters.\n\nMr. Speaker, FERC doesn't even want this power. They lack the  capacity and the staff for this highly technical work.\n\nWhen we discussed this bill 2 years ago, David Ortiz, then FERC's  Director of the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…well-known dress seller there. Her costs are going up 30  percent because of tariffs, and she is faced with two awful choices:  raise prices or lay off employees. And she doesn't want to do either.\n\nSmall businesses, medium businesses, big businesses--they are all  frozen because they don't know what Donald Trump will do next. They  can't plan for the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690523/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…Trump are facts when he demands flattery.\n\nThis attempt to quash thorough, objective NPR and PBS reporting is a  sign of Trump's weakness, of his drive toward tyranny. Trump doesn't  want a country of engaged, informed Americans. He prefers those who  salute on command, like for his North Korean-style, taxpayer-funded,  wasteful $45 million birthday bash…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692535/rescissions-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…out there: Tune in at 1 o'clock in the morning  and watch what unfolds in that committee. Republicans do not want you  to pay attention to their tax scam.\n\nHell, Trump doesn't even want Republicans to pay attention to what is  in this bill. Mr. Speaker, he told you guys to close your eyes and vote  for this garbage.\n\nRepublicans were ordered not to say…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…black hole so nobody remembers him or so nobody  remembers the things the Republicans said. They called it terrorism at  the time, but now it is inconvenient.\n\nDonald Trump doesn't want police officers being honored for the work  they did defending our Constitution, our democracy, our Capitol, and  the Members of Congress, including people who sit on that…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…negotiations have  stalled, and outside countries--the UAE, Turkey, Iran, as well as  Russia and China--continue to send weapons to the factions. Why? Well,  because Russia doesn't want to give up its port access to the Red Sea,  China doesn't want to abandon the nearly $6 billion of investments it  has made in Sudan since 2005, and the UAE doesn't want…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690103/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…groceries is up. Rent is up. Housing foreclosures  are up. Healthcare is about to soar through the roof while Republicans  refuse to do anything about it. John Thune said he doesn't want to  extend the ACA tax credits at all. And Americans will pay the price.\n\nDonald Trump and his billionaire buddies and the Republican Senators  just don't get it. They don't…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Musk said that Social Security is a  Ponzi scheme. Yet, the other night, my Republican friends stood and  applauded for him like he was Elvis Presley.\n\nThe majority also doesn't want people to remember that the Trump  administration has announced plans to cut staffing in half at the  Social Security Administration, guaranteeing that services for seniors…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…public.  I would like to have more opportunities for clean energy and for  renewables, and we can certainly work on permitting reform in that  regard. However, the President doesn't want that. The President says  that there shouldn't be any windmills, there shouldn't be any solar  panels, and there shouldn't be any renewables at all. The only thing he  wants…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…in health insurance and accounting, and she is willing to  take almost any job that will offer benefits, she said, even if that  means working at McDonald's because she doesn't want to let her  children go without healthcare.\n\nHer projected monthly premium increase is $400, which would raise her  monthly out-of-pocket costs to $1900. On top of that,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…to get back to balanced Federal budgets.\n\nWhy don't we all work together to do that? We are here working  together to do that. Unfortunately, the other side of the aisle doesn't  want to achieve that. They want to vote against any attempt to save  money. They criticize DOGE when they identify hundreds of billions of  dollars of tax dollars being wasted…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…Able-bodied people, 35- year-olds sitting at home playing video games are going to have to now  go get a job. That is right. By the way, that is a good thing for them.  Their mom doesn't want them sitting in the basement playing video games  anyway. Now it no longer will be crowding out Medicaid for the truly  needy people who deserve it. The disabled people…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…residents and businesses the local  tax conformity impacts of several tax benefit provisions of the One Big  Beautiful Bill Act.\n\nSimply put, the District of Columbia Council doesn't want its  citizens to benefit from the largest working families tax cut in  American history.\n\nSpecifically, the District of Columbia Council wants to deny its  citizens the…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…doing  it.\n\nIf the other side votes no, they want to keep borrowing money from  our children to spend a million dollars on voter ID in Haiti. This is  the same party that doesn't want voter ID in America, calls it racist,  wants to fund voter ID in Haiti. They want to spend $6 million for net- zero cities in Mexico. I know some of their best supporters…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…toward the  United States of America or President Trump. President Putin is not  acting seriously.\n\nI don't know a single fairminded person with an IQ above his age who  doesn't want peace in Ukraine. We all want to see peace in Ukraine.  President Zelenskyy wants to see peace in Ukraine. President Trump  wants to see peace in Ukraine. I thought President…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689486/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…informed--and you heard it from the  Senator from New Mexico--that maybe they don't want to pass House  bills. He kind of said that. He did mention that he is objecting  because he doesn't want to favor one party over the other. That  argument is irrelevant because I am passing a Democrat bill and a  Republican bill. So this is even stephen when it comes to the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…from these  guys, boots on the ground across the country, including deep in Federal  law enforcement, and they support this law. Don't tell me that Federal  law enforcement doesn't want to do this or it is bad for the country in  some way. That is smoke. That is smoke that is being put out by  Democrats to protect themselves from the impact of the reveal…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693077/special-interest-alien-reporting-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…learn about events such as the  Tiananmen Square massacre or the ongoing genocide of Uyghur Muslims.  Students don't learn about these despicable crimes because the CCP  doesn't want them to. This one-sided approach extends beyond K-12  classrooms.\n\nWhile the CCP operates programs in U.S. schools, American educators  are not allowed to expose Chinese…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697438/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…watching, they are building ships at a torrid pace. They have  three generation-six airplanes and aircraft carriers that they are  building at an astonishing rate.\n\nChina doesn't want us to build the F/A-XX because that opens the  Davidson window. If we do build it, it closes it. That is exactly why  we should.\n\nMr. Chair, that is exactly why I thank…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693649/department-of-defense-appropriations-act-2026"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…President said:\n\nThere was no reason for Putin to be shooting missiles into       civilian areas, cities and towns, over the last few days. It       makes me think that maybe he doesn't want to stop the war--      he's just tapping me along--and has to be dealt with       differently.\n\nThank you, Mr. President, for saying that.\n\nOne of the President's staunchest…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690223/ukraine"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the country? How do you save  my kids' future? How do you save your own retirement? Maybe we can just  keep lying to each other and the public because the public really  doesn't want to hear these things.\n\nThere is a path to make this math work, but you keep telling me that  we are going to take off on productivity, but then you see the charts  of available…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…colleagues on the other sides of the  aisle know it  is a good bill. In fact, one of the cosponsors won't even come and talk  about it because his majority, Mr. Speaker, doesn't want it. This is  the extension of defund the police. I have had it.\n\nWe need to protect law enforcement. We are the ones who call them  when we are in harm. They come to the…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700031/law-enforcement-innovate-to-de-escalate-act"}]