[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…empower workers' ability to form  unions and bargain for their rights.\n\nThe Trump administration, instead, is rolling back regulations that  protect workers. We should be doing better.\n\nMr. Speaker, I thank the gentlewoman for organizing this Special  Order and giving us the opportunity to discuss what is going on with  the Department of Labor.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695574/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…to triumph.\n\nI hope we can again rely on humility, on our need to       cooperate, on our dependence on each other to learn how to       trust each other again and, by so doing, better serve the       people who elected us. Stop listening to the bombastic       loudmouths on the radio and television and the internet. To       hell with them. They don't…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…Japan spend on healthcare, so we  should be the healthiest. We are not. We are 48th in the world for life  expectancy.\n\nDo you know, Mr. Speaker, what most of the countries doing better and  paying less than us have in common? They have universal healthcare.  Americans' physical and financial health depend on us doing the same.\n\nIt is time to take real…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698672/protecting-healthcare-for-millions-of-americans"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Progress was the largest in the  assessment's history, and the percentage of fourth graders who scored  below the basic level was the largest in 20 years.\n\nAdults are not doing any better. Recent results of the Program for  the International Assessment of Adult Competencies show that overall  scores in literacy and numeracy have decreased for U.S. adults,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…Republicans want to take food away from hungry people, not to balance  the budget. We know the bill actually increases the deficit by nearly  $3 trillion, and they are not doing it to better serve our veterans.  The bill actually reduces funding for our vets, too.\n\nRepublicans are doing this to fund tax breaks for the wealthiest of  individuals and big corporations.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691942/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…affordability.\n\nThe gentleman can say as many times as he wants, and my Republican  friends can say as many times as they want, that somehow this economy  is great and doing much better. That doesn't make it so. Look at the  polls. The majority of the American people think that they are driving  this economy into a ditch.\n\nPeople told me this last week…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700195/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…while I don't think the Hmong are a large  enough minority to have statistics on how well they are doing  economically, it is apparent subjectively that they are probably doing  better than the average American who was born here and, indeed, larger  minorities for which we have statistics.\n\nI remind everybody that people who come here from India, who…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…are part of our profit model.\n\nWhere are my own brothers and sisters, particularly on the  conservative side, saying: We want to unleash technology. We want to  unleash doing this a better, faster, and cheaper way?\n\nFor those Members who run around saying: PBM reform. Fine, but  understand that every study we have right now is that PBM reform saves  a…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…best to engage  with Syria in a post-Assad era, this threat assessment ensures that we  have the information we need to make these decisions with eyes wide  open. By doing so, we can better examine and mitigate emerging threats  from the region.\n\nOur mission is clear. We must protect American lives and prevent  future attacks on the homeland by strengthening…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697014/syria-terrorism-threat-assessment-act"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…responded: Jesus.\n\nMr. Speaker, I ask my colleagues to join me in honoring this  remarkable young woman. Because of her decisive actions, her mother is  alive today and doing much better.\n\nI also want to recognize and thank Brenda Dawes for her service to  our community. Because of her calm guidance and sound advice, a tragedy  was prevented. Northeast…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699061/recognizing-josie-pethan-and-brenda-dawes"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…live in a time of miracles. We are going to have some conversations  about how you change the view of healthcare. It is all about what we  pay. Can we change the cost by doing it better, faster, cheaper with  technology and our brothers and sisters being healthier?\n\nIf we don't, we will have problems like what is shown on this chart.  Today, 16 percent…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…hundreds of billions of dollars in here that aren't going to  services. They aren't going to make our brothers and sisters healthier.\n\nHelp us. Help us engage the morality of doing this better, faster,  and cheaper.\n\nMadam Chair, I yield 2 minutes to the gentleman from California (Mr.  Valadao).\n\nMr. SCHWEIKERT. Madam Chair, I yield 30 seconds to the gentleman…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…are they feeling that? It is called inflation. And the inflation  started under President Biden. As we know, it got to 9 percent. I won't  go into the reasons why. We are doing better. We got it down to 3  percent. When you get inflation down from 9 percent to 3 percent, that  is called disinflation.\n\nWhat is disinflation? It just means disinflation is…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697423/the-economy"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…reform, you just paid for our  reconciliation bill and put some more money in the bank.\n\nMy point is that if we would actually think about policy, the  modernization, doing things better, faster, cheaper--next week we are  going to do a--I think one of our Democratic colleagues a couple of  moments ago was attacking some of the--we will call it the DOGE…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…vote for  it. It will work. We have been jawboning and talking about ``Oh, you  know, the cost of living is''--some say it is fake. Some say it is not.  Some say we are doing better than we are. Well, things are better, but  they are still not well. This bill will lower the cost of housing in  America, and it will do it under the basic principles of…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…start running this country.\n\nGo to the Joint Economic Committee Republicans' website. We put out  some amazing data, and we are trying to make it easier to absorb. We  are doing better with charts and graphs, but another thing we do is  every workday we send out a text message. We call it the Daily Debt,  Schweikert's Daily Debt, and it basically does…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…it can happen in the  best of families--the number of people dying of drug abuse wouldn't  fall? Does anybody think our education would improve if we had kids who  are doing a better job of focusing at school?\n\nIt is high time, in the second bill that this Congress passes, that  we begin to address this problem. We can't address it by giving every…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}]