[{"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "Ms. CROCKETT. Mr. Speaker, I rise today for a 28-year-old single  mother of five in my district. She is doing everything right. She is  working hard, raising her babies, and trying to keep them fed and  healthy.\n\nShe was receiving $1,000 a month in SNAP benefits. Then one day it  was suddenly…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691466/snap-and-medicaid-cuts"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…of the administration just last  week: Do not continue to be a flunky of the President. Don't be a  flunky of the President. Don't block for the President if he is not  doing the right thing. Work for the American people. Don't be flunkies  for the President when you know he is wrong. Work for the American  people. Let's vote on this. Let's have the…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699897/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…healthcare, to education, anything  Republicans decide they don't like, all on a party-line vote, all  because of obeisance and fear of Donald Trump, not a conviction that he  is doing the right thing. This is a dark omen moving forward.\n\nOur Republican friends say they fight for the middle class. They say  they fight for working people. Then they turn around…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693459/rescissions"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…the Department of  Veterans Affairs in fiscal year 2026.\n\nAs the daughter of a World War II veteran, the programs we fund in  the MILCON-VA bill are very personal to me. Doing right by our vets and  getting them the care they need and the support they were promised is a  moral obligation, which is why I am pleased to say the MILCON-VA bill  we are voting…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694203/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "Mr. COHEN. Mr. Speaker, what Members of the Democratic Caucus are  doing to my right is signing a discharge petition to release the  Epstein files.\n\nThey need to be released because the American public wants to see  them. The fact that so many people…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694814/release-epstein-files"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…good. But there is nothing that I found in my experience in my  career--I am 61 years old--that is as professional as U.S.  servicemembers and as motivated by mission and doing the right thing  and making moral and ethical choices. And that is all at risk.\n\nIn Senator Merkley's State, in Portland, they are sending armed  uniformed soldiers to do what we…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696346/trump-administration"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…is happening right  now makes the Teapot Dome scandal and all of these scandals we read  about in history look like penny-ante stuff.\n\nThe Trump administration is doing everything it can right now to  allow for people to violate the Hatch Act. I emphasize the Hatch Act  was a series of laws passed by Congress to prevent senior officials in  the administration…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…the House version of this  bill, for acknowledging the urgent need to address the alarming rates  of aviator cancers.\n\nMr. Speaker, this isn't a partisan issue. It is about doing right by  those who served.\n\nSadly, since we passed the House version of the bill, we have lost  more aviators to cancer.\n\nThe urgency here is undeniable. We simply cannot afford…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693895/aces-act-of-2025"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…billionaires and big corporations but not enough  time for them.\n\nThat question did not come out of nowhere; it came from lived  experience. Hard-working Americans are doing everything right. They are  working longer hours. They are budgeting carefully. They are raising  their families. And they are just trying to stay afloat, but they are  still falling…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699113/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…the intensity that we currently  farm. We're going to have to take those rising prices and deal with it  the best we can.''\n\nThis is what Republican agriculture policy is doing right now: losing  export markets, raising costs, telling farmers to just deal with it.  They are complicit in the dismantling of rural healthcare, in the  freezing of funding…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Silverio, what they did to Marimar, to  Keith, to Renee, to Alex, what they did to Illinois resident Nenko  Gantchev in an ICE detention center. Also, Mr. Speaker, what they are  doing right now to my own constituent, Steven, a 14-year-old boy with  autism in a detention center plagued with measles, it is  unconscionable. It is unacceptable.\n\nMany of us are…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699667/horrific-ice-abuses"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…others for  a living. Even though she has her own insurance, it doesn't come close  to covering all of her daughter's needs.\n\nThat is where Medicaid comes in. She is doing everything right and  this family is still holding their breath. If Medicaid disappears,  Charlene's granddaughter faces the possibility of going without the  medicine that keeps her…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691478/gop-tax-scam-hurts-women-and-families"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…it. He hadn't let us know that he  needed the help to work on it, and he certainly hadn't done any work to  prepare the project.\n\nThat is what our Republican colleagues are doing right now. They came  into office on January 20th knowing that these ACA tax credits were  going to expire. They didn't do anything to address it. Not only that,  but we brought…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…undo the Consumer Financial  Protection Bureau's overdraft fee rule.\n\nNow let's be very clear: This overdraft rule never should have been  necessary. If big banks were doing the right thing and playing fair  with their customers, this rule would never have been necessary. Taking  that fee from $35 to $5 simply reflects what the possible cost is of…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689109/9999"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…from any country for any reason--no rules. And the only reason is  Trump doesn't have the legal authority to do that. He doesn't have the  legal authority to do what he is doing right now.\n\nTrump claims to have authority under a 1977 law signed by Jimmy  Carter, the International Emergency Economic Powers Act. This law was  so uncontroversial in 1977…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…receipts are coming  down, and this is without a war. I mean just using actually what were  optimistic numbers of the next 10 years' tax receipts, and what we are  talking about doing right now is over the next 10 years doubling what  took us 240 years to build up in debt.\n\nDoes anyone care about your retirement? Does anyone have kids? Think  of this: It may…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…forced to rely on  adversaries to meet our energy needs, countries that do not have strong  labor or environmental laws.\n\nThis tax hurts energy producers who are already doing it right.  America is leading the way in reducing emissions.\n\nSince 2015, upstream oil and gas producers have reduced their methane  emissions by 42 percent. Our innovation and…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688186/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…overseas, we lived by a  simple creed: Mission first, and no Americans left behind.\n\nMy bill is an embodiment to that promise. This isn't partisan  posturing. This is about doing right by America's warfighters. The  House Committee on Veterans' Affairs agreed. They voted for my bill by  voice vote without opposition. There was zero dissent. There was…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695432/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…should have been over and done with by now. We don't have time to be  playing games, Mr. Speaker.\n\nNow, I wholeheartedly echo the sentiment offered by Chairman Cole  that doing the right thing for the American people is something that  does not get old.\n\nCongress holds an explicit mandate that is outlined in our Article I  responsibilities to appropriate…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699591/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…gets behind the microphone and even uses the  word, it will be an attack ad next week because, God forbid--this place  cares more about winning the next election than doing what is right,  doing what is moral, owning a calculator. This place is absolutely  perverse.\n\nHere is another thing. Let me enrage my brothers and sisters because  so much of what…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…make this work. It just turns out that it is really  hard. Are we ready to do hard things for the country and then go home  to try to explain it to our voters that we are doing the right thing  for them?", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…what is the politically right thing to do, what politically  will help me get reelected.\n\nI never heard Doug talk that way. Doug always talked about the right  policy, doing the right thing, and then selling it back home, which was  one of the reasons why I think he was so special.\n\nAnother thing that was so special, in all the conversations I had…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698712/9999"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…or so when that extra $500 enhancement  is up for renewal, we will have already grown the $2,000 to be at  approximately that level. What we are doing is, we are really doing  right by individuals that are doing the right thing by investing in our  future and raising kids.\n\nThose two things are the biggest items of this entire bill. Then to  go and…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…powerplant 2.0, 1.3 million comments; with the  Biden WOTUS rule, 115,000; with the California waiver, 53,000.\n\nThis is all the people in this country who care about what we are  doing right now. It is just attempting to waste floor time in the U.S.  Senate, trying to reverse a technical correction in an underhanded  effort to close powerplants that provide…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695512/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-emissions-budget-and-allowance-allocations-for-indiana-under-the-revised-cross-state-air-pollution"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…does this  have on those downrange in counterterrorism operations as we speak?  What needs to be put back in place in order for us to not be afoul of  something that we are doing right now?\n\nThese are questions that were not asked, and the answers were not  given. This goes beyond just our generals in the Pentagon. It goes to  our Secretaries. It goes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695244/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…Speaker, today, I rise on behalf of the people of North Carolina,  particularly western North Carolina. I represent hardworking Americans  playing by the rules, doing everything they can right--paying their  taxes, raising their kids, and taking care of their neighbors whose  lives were impacted substantially by Hurricane Helene that hit last  year.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the policy we are working on, the baseline  between now and 2035 of the $22 trillion we are supposed to borrow,  some of the potential financing costs of what the Senate is doing right  now, the higher interest rates, we are not exactly there, but we come  close to doubling U.S. sovereign debt over the next decade. That took  us 240 years, and we functionally…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…U.S. investments, undermined  our allies, and harmed energy-producing regions like west Texas.\n\nThankfully, we now have a President in the White House who is  committed to doing the right thing for the country, for our producers  and consumers, and committed to making American energy great again, not  weaponizing  this authority for purely ideological purposes.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697087/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…themselves have articulated, is to open up our  borders to ultimately provide amnesty, a path to citizenship, and  voting rights to illegal aliens.\n\nMr. Speaker, they are doing that right now. That is exactly what they  are doing, and they are fighting for it. Allowing illegal aliens to  vote is not only grotesquely unjust, but it waters down the meaning…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692317/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…Clackamas,  Oregon--are the situations for which EMS professionals train and  prepare. But we should also honor the everyday professionalism, skill,  and commitment to doing what is right for the patient that is at the  forefront of everything emergency medical responders do, both on duty  and off. By putting their own lives on the line every time they…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696510/recognizing-the-global-medical-response-2025-stars-of-life-award-recipients"}]