[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "They know that most Americans  reject what they are doing.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "They are doing that because they hope we are asleep.", "title": "Republican Budget Bill", "date": "2025-05-20"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Instead of doing what I would consider the hard work to find a  bipartisan path forward, Republicans are simply giving up.", "title": "Improving Interagency Coordination for Pipeline Reviews Act", "date": "2025-12-12"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "For us to just give away that power to the executive branch is not  doing our job.", "title": "Resolution, to Remove United States Armed Forces From Hostilities with Presidentially Designated Terrorist Organizations in the Western Hemisphere", "date": "2025-12-17"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "Speaker, if it is safe to do, then why isn't DHS already doing  it?", "title": "Special Interest Alien Reporting Act of 2025", "date": "2025-06-26"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "Why are they doing it?", "title": "Gop Tax Scam Hurts Women and Families", "date": "2025-05-20"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "For those doing the math at home, after our 4-year run of surpluses  in 2001, the national debt stood at $5.8 trillion.", "title": "Cloture Motion", "date": null}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "I  certainly agree that we should be doing that.", "title": "Researching Efficient Federal Improvements for Necessary Energy Refining Act", "date": "2025-11-20"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "And just  because they are doing the corruption in plain sight not does make it  any less damning or sad or gross.", "title": "Qatar", "date": "2025-05-12"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "I would say, as an economy, we are doing pretty  good.", "title": "Save Sba From Sanctuary Cities Act of 2025", "date": "2025-06-05"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "The administration claims to be doing this in the name of efficiency.", "title": "Department of Health and Human Services", "date": "2025-02-27"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "What the hell has he been doing for the last 3 months?", "title": "Caribbean Boat Strike", "date": "2025-12-10"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "On a day when we are working to ensure that some of the critical  programs at the Federal level are funded in this bill which is an  important piece of this, we also have to support the structure  and the payment system that supports the people on the ground who are  doing this work.", "title": "Support for Patients and Communities Reauthorization Act of 2025", "date": "2025-06-04"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "It was a betrayal of northeast Ohio,  but Myesha and our community have never stopped doing the work to make  our neighborhoods safer because we know that community-oriented  solutions work and are needed.", "title": "Recognizing Myesha Watkins", "date": "2025-12-03"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "In doing so, she will be 100-percent loyal to Donald Trump above all  else.", "title": "Nomination of Linda McMahon", "date": "2025-02-27"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "I want to applaud  President Trump for what he is doing.", "title": "President Trump in the Middle East", "date": "2025-05-14"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "When you say that wind and solar is cheaper and then complain because  you took away the tax--people aren't doing it because you take away the  tax credits and subsidies.", "title": "Electric Supply Chain Act", "date": "2025-12-10"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "We commit to honoring their memory by doing the best we can to carry  out a thorough investigation and make whatever changes are deemed  necessary.", "title": "Expressing Condolences to the Families, Friends, and Loved Ones of the Victims of the Crash of American Eagle Flight 5342 and Pat 25", "date": "2025-03-03"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "So you want to get me back to thanking the President for all the good  things he is doing?", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Environmental Protection Agency Relating to ``Air Plan Approval; South Dakota;", "date": "2026-01-07"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "Then along came the 1990s and unrelated to methamphetamine, we had a  lot of big drug companies and some bad actors, who decided they were  going to make more money by doing a lot of stuff they shouldn't have  done to incent the medical community to prescribe more opioids, and  they did and it was illegal.", "title": "Support for Patients and Communities Reauthorization Act of 2025", "date": "2025-06-04"}, {"senator": "John Thune", "party": "Republican", "sentence": "Now, that may  be how it  worked when they were in control, but Republicans are doing it  differently.", "title": "Genius Act", "date": "2025-05-08"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "And while they are doing this, Russia and China want to control both  the Arctic and space.", "title": "-9999", "date": "2026-02-02"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "That  will help the 750,000 executive branch employees who are on furlough  without pay; that will help the congressional staff who are working  without pay, help the economy--something we should be doing.", "title": "-9999", "date": "2025-10-03"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "Speaker, what the Republican plan is doing is saving Medicare for  the people it was intended to be there for.", "title": "Cleaning Up Medicaid Rolls", "date": "2025-05-07"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Speaker, as has been pointed out, the technologies are  changing so rapidly, especially when looking at AI and blockchain and  how they are revolutionizing the private sector because of the  efficient security and transparency and what we need to be doing on the  Federal Government side at the same time.", "title": "Consumer Safety Technology Act", "date": "2025-07-14"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Any Republican who goes along with that needs to answer for doing the  same thing.", "title": "Bringing America Back to its Roots", "date": "2025-12-12"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "The legislation ensures that rogue IRS employees are not able to  unfairly impose penalties and fines on taxpayers without going through  proper channels of authorization and doing so in a timely manner.", "title": "Fair and Accountable Irs Reviews Act", "date": "2025-12-01"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "I am enraged right now because I am hearing down the hallway the  Senate, they are talking about doing their reconciliation budget and  setting a floor, saying: We are not going to allow the Senate to pass  budget cuts of less than $3 billion.", "title": "U.S. Borrows Billion A Day", "date": "2025-03-31"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "To God be the glory for the great things He is doing through the  Gossetts and Green Acres Baptist Church in Tyler, Texas.", "title": "Welcoming Guest Chaplain Dr. Michael Gossett", "date": "2025-04-10"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "So what are Republicans doing?", "title": "Providing for Consideration of H.R. Protecting Prudent Investment of Retirement Savings Act; Providing for Consideration of H.R. Flexibility for Workers Education Act; Providing for Consideration of H.R. Empowering Employer Child and Elder Care Solutions Act; Providing for Consideration of H.R. Tipped Employee Protection Act; and Providing for Consideration of H.R. Save Local Business Act", "date": "2026-01-13"}]