[{"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…called a provider tax. That is  when hospitals or health plans agree to pay a small tax to keep  Medicaid running. In return, the Federal Government matches those  dollars. It is a Federal-State partnership that keeps hospitals open,  staff paid, and patients covered, but the Senate Republican bill would  limit how much States can use that tool. It puts…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693032/opposing-provider-tax-restrictions-in-the-gop-reconciliation-bill"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…Congress for equity,  inclusion, and the honest American history.\n\nToday, the Trump Administration threatens Chicago Public Schools with  the loss of over one billion dollars in federal funding for its efforts  to improve the success and reduce suspensions of Black students, teach  Black history, and recruit teachers who reflect the students they  teach.…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692688/commemoration-of-juneteenth-amid-the-erosion-of-black-history"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…prosecutor and lauded the work of the  grand jurors as cathartic. That same Senator announced just yesterday  that he intends to seek his payout of tens of millions of dollars from  Federal taxpayers.\n\nIt should be clear to everyone here: Under no circumstances should  the power entrusted to us as Members of Congress be used to line your  own pockets,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696924/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…law enforcement, then I might ask why we are simply honoring them with  this concurrent resolution and not taking more meaningful action, like  restoring millions of dollars in Federal grants that help support them  that were recently terminated by the Department of Justice at the  direction of DOGE and Elon Musk.\n\nThose grants supported programs like…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…points and       undermine civil rights protections. An administration that       truly cared about public safety would not have rescinded       hundreds of millions of dollars in federal grants for gun       violence prevention, victim services, and community-based       safety programs.\n\nWe urge Congress to reject these attacks on D.C.'s       autonomy.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…Americans, classified information,  budget information, and payment systems, et cetera.\n\nFrom a conflict of interest standpoint, Elon Musk has vacuumed up  many billions of dollars in Federal contracts for his companies and  enriched himself. Tesla, SpaceX, Starlink have all profited under  Musk's time as a Federal employee. At the same time, he went out of…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…students who do not  come from wealthy families. The lost potential from these cuts is wrong  for students, the country, and the economy. This bill will slash  billions of dollars in federal funding for higher education, raising  student loan payments for working and middle-class borrowers, and  making it harder for students to access an affordable college…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…growth and innovation of our great country and  underpin and form the foundation for the best global economy in the  world. He is now threatening to withhold billions of dollars in Federal  funding unless universities change their curriculum, change their  admissions process, change their hiring process, and change other core  parts of their mission that…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…programs that serve the  people who make up our communities; thousands fired, agencies  dismantled, and people's personal and private data stolen; self-dealing  billions of dollars in Federal contracts, judges jailed, a Congress  that refuses to act and to do its job, and the countless Americans who  are living in fear.\n\nMr. Speaker, I have just wrapped up…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690395/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…joining me in introducing this bill, which will  go a long way to help SBA modernize its IT infrastructure and improve  its services to small businesses.\n\nBillions of dollars in Federal contracts are awarded to small  businesses every year, and the SBA plays a vital role in promoting  small business participation; however, over the years the SBA's  outdated…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697272/sba-it-modernization-reporting-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…nowhere near enough to make up for the cuts imposed  by Trump's big, ugly bill.\n\nCharity alone has never, will never, can never make up for the  hundreds of billions of dollars in Federal cuts. Ending hunger requires  strong Federal investments in basic needs programs and a strategy  championed by the Federal Government.\n\nUntil we have a government that…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697684/16th-annual-march-for-the-food-bank"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…is first once again.\n\nNevertheless, there is still much work to be done, especially in this  119th Congress. Under President Biden, Americans' hard-earned taxpayer  dollars in the Federal budget were used as a slush fund for the radical  left to facilitate a border invasion of millions of illegal aliens,  export their woke ideologies across the globe…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…services.\n\nWhile initial interest in the NPR-A was tepid, new oil finds closer  to the NPR-A boundaries led to a number of successful lease sales  generating millions of dollars in Federal revenues. Among the most  successful was the 2016 lease sale, which came following the discovery  of the Willow field. The Bureau of Land Management, BLM, estimates the…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Government broke it, shipping our jobs overseas, not only in the  gentlewoman's communities but in my communities.\n\nOf course, the Federal Government did that with our tax dollars. Then  the Federal Government is going to come back in after they broke it and  use our tax dollars to tell us that they are fixing it.\n\nWhat I am saying is that these programs are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…there is a new sheriff in town who actually believes in  law and order.\n\nSo I would hope that city leaders who defy our Federal laws shouldn't  be entitled to Federal tax dollars. Federal grant dollars are not  entitlements. They are not unconditional welfare for far-left  activists. If you want Federal funds, you have to comply with Federal  law.\n\nSanctuary…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696003/unanimous-consent-requests"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…our country.\n\nMr. Chair, we cannot allow that to happen. Yet, Mr. Chair, we have a  spending problem. We do not have a revenue problem. Last year, we  collected more dollars in Federal tax revenue than ever in the history  of our country.\n\nThat is why this budget resolution is so important. It starts us,  finally, down the path of reducing Federal spending…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688037/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…class: no tax on tips, no tax on  overtime, and tax relief for seniors. Under the working families tax  cut, a family of four who makes less than $73,000 will pay zero dollars  in Federal taxes, and every single Democrat in the House and the Senate  voted against that provision.\n\nWe also increased the child tax credit to $2,200 and made it  permanent,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699682/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}]