[{"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…of these funds, and those folks defrauded not only the  government, but they defrauded the mom-and-pop shops on Main Street  and, in my case, on Broadway.\n\nThose dollars could have been used to create jobs, revitalize  communities, and to help those businesses stay open and thrive.  Instead, these fraudsters took advantage of the lax application  screenings,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687934/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…costly tariffs. Families have seen the cost of beef, produce,  and other groceries skyrocket over this year because of the tariffs.  And now they are told their taxpayer dollars must be used to clean up  the mess that Donald Trump and his tariffs created.\n\nSo, on the first, he tells consumers: You have to pay more for the  tariffs.\n\nThen the taxpayers have…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697574/department-of-defense"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…includes ending masked  enforcement with roving patrols, requiring judicial warrants, mandating  body cameras, ending total immunity, and repurposing the billions of  dollars that are being used to menace our communities.\n\nSecurity does not require brutality. Enforcement does not require  lawlessness, and our immigration policy should reflect our values,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…discriminating  against workers based on race, color, religion, sex, sexual  orientation, gender identity, or national origin. These actions ensured  that taxpayer dollars were not being used to fund discrimination.\n\nBut despite the President's reckless actions and the acquiescence of  congressional Republicans, we need to assure the public that many…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Mr. Speaker, I rise today to tell the American people  exactly what their tax dollars are being used for: imprisoning  children, even infants.\n\nLast month, DHS agents detained a sick 7-year-old and her parents in  an urgent care parking lot while they were trying to…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700028/your-tax-dollars-are-funding-this"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…proceedings to impeach Noem. I  said it before, and I will say it again. She will either quit, she will  get fired, or we will impeach her.\n\nHere is the thing: Our tax dollars should be used to make sure  working people have every single thing they need to thrive, not money  used to execute U.S. citizens.\n\nLet me end by saying this: We brought the Department…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699667/horrific-ice-abuses"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…700,000  Americans being spared from choosing between seeing a doctor or paying  rent or paying for their groceries. This is a simple question of our  values.\n\nTaxpayer dollars should be used to care for people, not to fund  masked agents terrorizing our communities, spreading panic, making us  less safe, and killing people.\n\nInstead of lowering costs, Republicans…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699592/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…funds while the service reviews their plans.\n\nAt the same time, this bill would maintain the standards by which  these plans are reviewed, ensuring that these Federal dollars are used  responsibly and as Congress intended.\n\nMr. Speaker, I urge my colleagues to join me in supporting H.R.\n\nMs. RANDALL. Mr. Speaker, I support this legislation, and I urge…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697623/make-state-wildlife-action-plans-efficient-act-of-2025"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…does nothing  to address these crises for pregnant women and families.\n\nInstead, the bill before us today would allow Temporary Assistance  for Needy Families, or TANF, dollars to be used to fund so-called  crisis pregnancy centers that have a proven track record of  intentionally lying to, misleading, and endangering women.\n\nIt is no coincidence that…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…that are applying for American  taxpayer-backed loans.\n\nNow, this should not surprise anybody. This proposed rule increases  lending security and ensures that taxpayer dollars are used well.  Further, participating in government lending programs like the 7(a)  program naturally involves complying with government rules. This is no  different.\n\nU.S. taxpayer…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692123/american-entrepreneurs-first-act-of-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…demonstration authorities and statutes ``allow States to  operate their Medicaid programs outside of [certain] Federal rules.''\n\nNow, even Democrats are admitting that Medicaid dollars are being  used to benefit illegal immigrants and that is what we are trying to  stop, the draining of this program of funds that are intended to help  American citizens in need.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…money that should have gone to serve the American people, not  to subsidize private union interests.\n\nEnding ``official time'' is a commonsense step to ensure taxpayer  dollars are used responsibly and to increase accountability across the  Federal workforce. Public funds should serve the American people, not  private union interests.\n\nMr. Speaker, I…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689724/congratulating-glenvar-high-school-boys-swim-team"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Medicaid benefits to out-of-State  residents.\n\nIf you live in New York and you are getting benefits through the  Medicaid program and you find out that a half a billion dollars has  been used to provide benefits for people who are not even residents of  the State, you ought to be asking questions.\n\nIn Illinois, the State's auditor general found that the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698560/fraud-accountability-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…the flexibility to use the best tools  available. The ASCEND Act strengthens America's scientific leadership,  supports our domestic space industry, and ensures taxpayer dollars are  used efficiently.\n\nI thank Chairman Babin for advancing my bill to the floor. I urge my  colleagues to support H.R. 2600.", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700117/accessing-satellite-capabilities-to-enable-new-discoveries-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Supporting Pregnant and  Parenting Women and Families Act, ensuring that young families have  access to prenatal vitamins, formula, and diapers. It also ensures that  TANF dollars can be used to support pregnancy resource centers.\n\nThe Pregnant Students' Rights Act provides guidance and resources to  pregnant students so that no student feels forced to choose…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…programs around the world. That is not the role of the  Federal Government, and that is not an appropriate use of taxpayer  dollars of American citizens.\n\nTaxpayer dollars should not be used to fund woke projects overseas or  bloated government programs at home. They should be funding efforts  that protect our border, defend our Nation, and serve the…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692312/recognizing-new-freedom-farm-and-lois-mcgill"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…consistent reporting formats  so Congress can compare outcomes across programs and track progress  over time. It ensures that the American people can see how their tax  dollars are being used.\n\nThese are basic principles of good governance. Transparency  strengthens public trust and improves program performance. It allows  Congress to address problems early…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697209/hud-transparency-act-of-2025"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…ammunition, and  sporting equipment without congressional approval, and decreases  funding for the ATF. It also maintains pro-life Hyde protections to  ensure taxpayer dollars are not used to fund abortions.\n\nThe Energy and Water Development and Related Agencies Appropriations  Act directs $58 billion towards national security and strengthens  America's…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…imagine $1 million going to one of the cities in our  congressional districts and the impact that it could have there. It is  a disgrace that Americans' hard-earned tax dollars are being used to  support these programs and organizations under the guise of necessary  foreign aid.\n\nIn addition to this, Congress continues to prop up the Corporation  for Public…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692496/rescissions-package-is-first-step"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…the ability of fraudsters to exploit the system that is  currently in place.\n\nBy mitigating the ability to defraud government contracts, we help  ensure that taxpayer dollars are used as intended and help create a  more level playing field between the WOSB program and other small  business set-aside programs.\n\nMr. Speaker, I urge all of my colleagues…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691798/wosb-accountability-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…here  to do, which is end wasteful spending, to stop the ridiculous spending  of a bureaucratic government that has been weaponized against the  people. These are dollars that are being used and wasted and sent  around the world for $32,000 for transgender comic books in Peru. That  is how they want to use taxpayer money.\n\nWe are over here trying to…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693712/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…companies in America--certainly since ObamaCare started.\n\nThen, finally, they want to break what has been, roughly--let me  see--a 50-year consensus on whether tax dollars should be used to pay  for abortions. We know that the issue of abortion divides much of  America, but one area that we have agreed on is this consensus named  after Henry Hyde, who…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697929/healthcare"}]