[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…funding in this bill does not support offensive weapons for  Israel. That is funding in a separate appropriations bill. This bill  provides for defensive measures only, like Iron Dome, which I support.\n\nSafety is what everyone in the region deserves. Israeli children  deserve to go to bed at night knowing that missiles from Yemen, Iran,  the Houthis, or anywhere…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…has killed approximately 70,000 Palestinians, I  do not support. To be clear, I have always supported and continue to  support cooperative missile defense programs like Iron Dome because I  believe that no child--Israeli or Palestinian--deserves to have  missiles fall on their heads. However, this NDAA goes beyond support  for missile defense and includes…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…XIX.      The Senate has been living for centuries,      Alive by following our framers' themes.                                By Hunter Coy       Sun rises on the Capitol dome      Suddenly I don't feel so far from home      I drove 16 hours to be here      Becoming a Senate page meant leaving everything I held dear.      30 strangers came together…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…do is elect a climate denier to be President whose most  creative approach to energy was Sarah Palin's shopworn ``drill, baby,  drill,'' which is what he announced under the dome of the United States  Capitol the day he was inaugurated President and said--completely  untruthfully--that we were in an energy crisis, when what we have is an  energy abundance…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688166/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…We will not be safer.\n\nInstead of doing the hard work of diplomacy, we are being asked to  plow billions of taxpayer dollars into a dangerous fantasy: the so- called Golden Dome, a missile defense system. We will be safe. We will  build more bombs, and we will stop their bombs.\n\nWe are told the system would cost only $175 billion and it will  provide…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699035/expiration-of-new-start"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…rise to salute the Rye High School  Garnets football team as they head to Syracuse to compete in the New  York State Athletic Championship for Class A under the JMA Wireless  Dome, previously the Carrier Dome.\n\nThis Class A State championship game is much watched across the State  of New York. Under the legendary 50-year leadership of Coach Dino Garr,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697468/recognizing-omayra-andino"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…mission to  the Moon.\n\nSo while I hear Trump bragging about his buddy Elon and a mission to  Mars and all these satellites out in outer space and how he wants to  have a Golden Dome over our Nation that is going to protect us from  incoming Soviet missiles at 2 a.m. in the morning, and here is vision  of a Golden Dome that is going to protect us.\n\nThen,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…fake definition of ``reliable  generation.''\n\nUnfortunately, the American people are paying the price. This past  summer, when much of the United States was in a so-called heat dome  fueled by climate change, the grid's electricity regulators said that  solar helped save the day, preventing dangerous outages in that record  heat.\n\nThe reality is that no…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…FOSTER. Mr. Speaker, I thank the gentleman for his remarks.\n\nMr. Speaker, I have to say the gentleman is absolutely right about  the messaging that is surrounding the Golden Dome effort. This is a  system that has never been tested against countermeasures that we know  our adversaries have. For 40 years physicists have been patiently  explaining to Members…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Parliament and gotten their commitment to do so.\n\nWe are asking Canada to participate with us in one of President  Trump's most significant military priorities, called Golden Dome. In  Canada, they call it Continental Shield. They have a different name for  it, but it is the same thing; it is missile defense for North America.  And we are trying to get…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…always in violent agreement was to stop  wasting money on Star Wars, which was then rebranded as the SDI, the  Strategic Defense Initiative, and has now been rebranded Golden Dome.\n\nFor more than 45 years, scientists have been patiently explaining to  policymakers that this is never going to work. It is easy to overwhelm  with a trivial response to it.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…U.S. Congress, which gave him its highest award, the Congressional Gold  Medal, in a ceremony in the Capitol. ``The greatest lesson about  America lies under this magnificent dome,'' he told the assembled  legislators. ``The Pentagon embodies might, but the Capitol embodies  right. In these halls, different points of view meet and are reconciled  . .…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…leaders have earned him  honors from the United Nations, the European Union, and this very  Congress, which bestowed upon him the Congressional Gold Medal beneath  this Capitol dome.\n\nMr. Speaker, in honoring Patriarch Bartholomew, we recognize a man  whose life's work has been the building of bridges, between East and  West, faith and justice. His  enduring…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695368/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…5 years.\n\nIt was also a great honor for the city and county of Orangeburg. The  State of South Carolina showed its appreciation by flying the school's  flag over the Capitol dome yesterday as the Nation honored HBCU  graduate, Martin Luther King, Jr.\n\nMr. Speaker, I ask that you and our colleagues join me in  congratulating the South Carolina State University…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699194/south-carolina-state-university-football-team-2025-hbcu-national-champions"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…worldwide to verifying that other countries  and various rogue actors are not developing nuclear weapons.\n\nIt would be nice if we lived in a world where a miraculous Golden  Dome could keep us safe from nuclear weapons, but we do not. We depend  on being able to detect and enforce violations of nonproliferation  agreements.\n\nThis bill leaves wide open…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694866/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…States.\n\nLombardi was also devoted to his alma mater, Syracuse University, and  was pivotal in working with the Governor of New York to facilitate the  construction of the Carrier Dome. Tarky was so tenacious. Without his  advocacy, the dome would never have been built.\n\nTarky was a one-of-a-kind member of the Greatest Generation. He loved  our State and our…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693663/recognizing-colonel-john-peyton-swain"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…ObamaCare, known as the  Affordable Care Act, is not affordable to anyone in America.\n\nIt is a fact that Space Command is coming to Redstone Arsenal in  north Alabama and the Golden Dome is on the horizon.\n\nIt is a fact that President Trump and our Republican majority is  making America better for the people. America is back.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…investments in the One Big Beautiful Bill Act, investments  that reaffirm President Trump's commitment to peace through strength.\n\nThis bill delivers $25 billion for the Golden Dome missile defense  system, our answer to hypersonic and NextGen threats from adversaries  like China and Iran.\n\nIt expands our naval fleet, restocks our munitions, modernizes…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692966/peace-through-strength"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…environment and ensure our Nation  continues to field a nuclear deterrent that is second to none.\n\nFor the defense of this homeland, the bill supports development of  the Golden Dome system to achieve President Trump's bold vision. It  also includes multiyear procurement authority and additional resources  to expand production of critical missile defense…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697798/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…President Trump's peace through  strength agenda.\n\nH.R. 1 includes a historic $150 billion investment in America's  national defense that will help us begin building the Golden Dome  missile defense shield to protect our homeland, begin to revitalize our  defense industrial base, help us secure our border because border  security is national security, begin…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693190/one-big-beautiful-bill-act"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…and ultimately ensure our deterrent continues to keep pace  with the dynamic threat environment.\n\nFor defense of the homeland, this bill supports development of the  Golden Dome system to achieve President Trump's bold vision.\n\nIn space, we established the Tactical Surveillance, Reconnaissance,  and Tracking program as a formal program of record to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695146/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…missile defense was key to facing up to the challenge of the  communists.\n\nToday, the big, beautiful bill puts much-needed funding into missile  defense through the Golden Dome system.\n\nI encourage every American that cares about making our country  wealthier and safer to support the big, beautiful bill.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693226/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…since October 7.  Forty-three Americans were killed on October 7, and 12 were taken  hostage.\n\nMore importantly, the research that this funds is the premise behind  the Golden Dome. When we support research and development for the Iron  Dome, we are creating the capability for the United States to defend  itself as well.\n\nI have news. We have a nuclear…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693692/department-of-defense-appropriations-act-2026"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…systems. And we should not be allowing Federal  Agencies to sell critical communication channels needed to carry out  the Trump administration's priorities, including the Golden Dome  missile defense shield. That is why this year's defense bill prohibits  any modifications to defense systems in these spectrums bands unless  top Pentagon leaders themselves…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695027/9999"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…will actually have the funding to make sure that  is a long-term solution.\n\nIn that same vein, as we face increasing threats from around the  world, he is making the Golden Dome happen. We are seeing the success  of the Iron Dome right now in the Middle East. We will now have this  Golden Dome so that, God forbid, if something radical happens, we have…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692814/elections-matter"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…effort. Despite her University of Illinois pedigree, she will always be  an Iowan and a Hawkeye at heart, from the corn dogs at the State fair  to winning friends under the golden dome in Des Moines to right here at  the marble steps of the U.S. Capitol.\n\nOur country, our State, and our family are grateful for her service,  and we wish her great success in…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688336/recognizing-emily-tuttle-millard"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…reducing our debt.  Insofar as we find excess people around here, I think we are not  prepared enough in this country for hypersonic missiles. I don't think  we have an Iron Dome-type Israel situation in which we are prepared for  other sorts of missiles.\n\nI think the reason we are not prepared is that there are way too many  people who are not working…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…has also  signed 27 bills into law, the greatest of which, the One Big Beautiful  Bill Act, delivers tax cuts to American families, solidifies funding  for America's Golden Dome, and defunded Planned Parenthood.\n\nOver the past 6 months, President Trump has delivered on his promise  to restore America's strength and dominance, and I look forward to…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694059/six-months-of-america-first-leadership"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…illegal aliens are not released back onto the streets like they were  for the last 4 years.\n\nOur homeland can rest soundly again under the protection of President  Trump's Golden Dome. That is what we are investing in.\n\nLook, any of these individual achievements would be historic  victories for a Republican Congress or any Congress, and today, we are  delivering…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…this fall.\n\nThe President has set some ambitious, important, and overdue  priorities for America's national security, and none of them--none of  them--come cheap: the Golden Dome for America, an American shipbuilding  renaissance, sixth-generation stealth fighter aircraft, the long- overdue modernization of our nuclear force. Reconciliation isn't enough…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}]