[{"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…still dangerous in the wrong hands.\n\nThis bill would mean that anyone can buy them without a background  check including people convicted of serious violent crimes and domestic  abusers with restraining orders against them.\n\nThis bill would also eliminate serialization, making these dangerous  devices untraceable. H.R. 2189 is a reckless expansion of…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700040/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…law, law enforcement in their official capacity are not  subject to the background check requirement in the Gun Control Act.  That is the law that prevents felons and domestic abusers from buying  weapons.\n\nUnder the current law, contrary to what the chairman just mentioned,  law enforcement is not subject to the excise tax for firearms or for  tasers.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…as being necessary in order to tackle this epidemic  in this country, but it was significant. It was five changes in gun  laws: supporting State red flag laws; stopping domestic abusers from  getting their hands on guns; putting in a short but meaningful waiting  period when young people are hastily buying an assault weapon; making  it easier for law…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…laws,  including those that require firearms to be traceable, detectable by  security equipment, and not available to prohibited purchasers, like  felons, fugitives, and domestic abusers. These exemptions would allow  these weapons, which can be deadly, to be sold to anyone, including  dangerous people, without having to undergo a background check.\n\nLaw…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…laws.\n\nMr. Speaker, 42 States have explicit statutory definitions for less- than-lethal devices. Of those 42 States, 34 already prohibit possession  by violent felons and domestic abusers, they impose age restrictions,  and impose criminal penalties for misuse. Several States even require  permits, licenses, or a background check to purchase or possess…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700039/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…convicted multiple  times but never removed from the United States.\n\nAs recently as last month, ICE arrested 118 illegal aliens in  California, including pedophiles, burglars, domestic abusers, and  serial drunk drivers. One of these offenders had four separate DUI  convictions, including one that caused bodily injury. He was also  convicted of driving with…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}]