[{"senator": "Terri Sewell", "party": "Democrat", "sentence": "…in Alabama's Seventh  Congressional District who led their teams to championship victories  this season.\n\nThat includes the girls' 7A champions at Hoover High School, who  dominated their competition and brought home the gold at the end of  their 29-3 season. Way to go, ladies.\n\nLikewise, Hoover High School's boys were also crowned 7A champions at  the…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689179/congratulating-high-school-basketball-champions"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…interest.\n\nThe Republicans across the aisle are making a very articulate case  for energy producers. It is not lost on us that most of them represent  districts that are heavily dominated by producers.\n\nOver here, there is a very articulate case on behalf of consumers  because most of Americans--I would hazard a guess that all Americans  are consumers.\n\nBecause…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697090/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…coaching her award winning team, she recently  published a book titled ``When Girls Win,'' which delves into the  personal challenges Coach MJ has faced as a woman in a male-dominated  field while illustrating how people like you and me can build a winning  mindset.\n\nMaryJo has been a fixture at George Fox University, and her hard work  and determination…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698083/congratulating-maryjo-mccloskey"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…communities that need it most.\n\nHouse Republicans are using this bill to eliminate protections for  small meat and poultry producers against large corporations that have  dominated the market, forced small producers out of business, and price  gouged consumers.\n\nWe are in an era of unprecedented corporate consolidation. Mr.  Speaker, four countries…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…abundant  supply of fossil fuels and nonfossil fuels. We are less corrupt than  almost any country on the face of the planet, and especially less  corrupt than economies that are dominated by petrochemicals and by oil  and gas around the world. We are the innovators in the world. We have a  commitment to the rule of law. All of that puts us in this incredible…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688166/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…refrain from taking unnecessary  risks in introducing new technology into their networks.\n\nWe know Open RAN can both help introduce competition into a market  that is currently dominated by untrusted equipment makers, like Huawei,  and support the development of new trusted manufacturers, including  those in the United States.\n\nThis bill helps bridge a gap…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693486/open-ran-outreach-act"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…Sepi Saidi, who passed away on March 24, 2025. Sepi was  a trailblazer and beloved member of the Wake County community who  nurtured her company from the ground-up in a male-dominated field. Her  contributions to our community will live on for years to come in her  children, friends. and the many members of our community she touched  throughout her life.…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689506/recognizing-the-life-and-legacy-of-sepi-saidi"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…without public  accountability, to influence who holds power and how that power is  used.\n\nSince Citizens United, we have watched a parallel political system  take shape, one dominated by super-PACs and dark money organizations  that can raise and spend unlimited sums and operate with fewer rules,  less transparency, and the ability to determine election…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699237/restoring-election-integrity"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…contractors no  longer even track discrimination.\n\nIf you stop collecting the evidence, you can pretend the crime no  longer exists. The result: an older, Whiter, more male-dominated  workforce that doesn't really reflect the diversity of backgrounds that  makes our Nation great.\n\nLet's call it what it is: a calculated, careless, cowardly rollback  of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…California's 25th District that is lifting up young athletes and  inspiring our entire community.\n\nThis past year, the Coachella Football Club's Premier team, our semi- pro squad, dominated the field. They were SoCal East season champions  and went undefeated in the divisional playoffs. Coached by Aldo Caro  and Octavio Bustillos, this team played one of their…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692140/recognizing-coachella-football-club"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…season around with determination and teamwork and ultimately secured an  at-large bid into Division 11 playoffs.\n\nIn the playoffs, the Braves became a different team and dominated  their way to the CIF Division 11 championship game.\n\nThis was the first CIF Southern Section championship appearance for  Baldwin Park since 1991. Unfortunately for the…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697339/congratulations-to-the-lady-eagles-volleyball-team"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…indigenous communities depend on. There is no doubt that part of the  responsibility for the failure to establish the commission falls on the  Honduran Congress, which is dominated by the National Party of former  President Hernandez, whose government functioned as a criminal  enterprise. But President Castro insisted this was a priority,  including…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696472/honduras"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…nobody  would produce them, if they weren't subsidized by your tax dollars. It  funds zero-emission vehicles that only the wealthy can afford and  depends on supply chains dominated by China.\n\nIt actively promotes divisive concepts like energy equity and  environmental justice, which allocate tax dollars based on immutable  characteristics. Are you serious?…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…during a  dark chapter of the Cold War, a time when Americans faced nuclear  threats, economic uncertainty, and a crisis of confidence.\n\nThe Soviet Union's hockey team had dominated for decades, beating the  U.S. in their last 12 matchups, including a crushing 10-3 exhibition  win just 3 weeks earlier. No one expected the Americans to win.\n\nHowever,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695439/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…items for blessing boxes in the community of Ozark, Arkansas, ensuring  those in need have access to essential resources.\n\nJayden is also blazing trails in traditionally male-dominated fields.  She is currently the only female member of the Fire Crew at Cass, where  she recently passed the Pack Test and earned her Red Card for wildland  firefighting. She…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692255/recognizing-ms-jayden-coffey"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…colleagues for their unwavering support to  get this across the finish line. It was 40-plus years since they did  that, and 3 weeks, 2\\1/2\\ weeks before these games, the Soviets  dominated them at Madison Square Garden.\n\nMr. Speaker, named after Coach Herb Brooks, we call them Herbies.  Blue line back, red line back, far blue line back, and far goal line  back…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695441/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…state championship while helping to  restore ``U.P. Power'' by bringing a title home to the Upper Peninsula.  Under the leadership of head coach, Chad Brandt, the Maroons dominated  opponents  throughout the fall, with only one game being decided by less than ten  points, capping off an undefeated season.\n\nWhat makes this accomplishment even more remarkable…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698002/recognizing-the-menominee-maroons-2025-division-7-michigan-state-football-champions"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…a global enterprise, revolutionizing  international supply chains, transforming how businesses operate, and  changing how people connect. Fred Smith not only directed and dominated  the modern logistics industry; he created it. For more than 50 years  after the conception of FedEx, he continued to lead it.\n\nToday, FedEx operates in over 220 countries,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692825/remarkable-life-and-legacy-of-frederick-w-smith"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise to rally support for  addressing the growing abuses of vision benefit managers, or VBMs.\n\nThe industry is dominated by two vertically integrated giants whose  actions are undermining healthcare access and threatening the existence  of eye care practices in all of our districts.\n\nIt is…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693946/addressing-the-growing-abuses-of-vision-benefit-managers"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…schools, a gristmill and limestone quarry.  Centuries later, the town retains the charm and rugged beauty that  attracted the first settlers. The town's economy was originally  dominated by forests and farms. Today, the town attracts outdoor  enthusiasts from throughout Maine and beyond to Rocky Mountain Terrain  Park and nearby Mt. Blue State Park.\n\nCarthage…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700097/200th-anniversary-of-the-town-of-carthage"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Mr. Speaker, like many Americans, I caught a little of  the TV over the weekend, which was dominated by the tragic events in  Minneapolis.\n\nHowever, there is one thing I felt had to be commented on because I  think there is a lot of confusion as to who we should be removing…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698892/confusion-over-who-should-be-removed-from-this-country"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…and Braylen Garcia of Hempfield High School on winning the 2025 PIAA  Class 3A boys' Tennis Doubles championship on May 24.\n\nSenior Cooper Lehman and freshman Braylen Garcia dominated the 2025  tennis season. Their doubles team was instrumental in Hempfield's 15- win start and claiming the Section One title, second place finish in  the Lancaster-Lebanon…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692412/congratulating-cooper-lehman-and-braylen-garcia-tennis-doubles-champions"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…volleyball  team's second title in its history. What makes this title even sweeter  is that Kent State knocked the Cougars out of the playoff tournament  last year.\n\nUC Clermont dominated the playoffs, thanks to their tireless work  ethic and family culture. Ending the season 23-4, the Cougars secured  the top tournament seed and rode the momentum to the national…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697701/recognizing-brandan-holliday"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…brokered by President  Trump to ensure that a critical American company remains right at home  in Pennsylvania.\n\nBy ensuring that U.S. Steel retains an American CEO, an American- dominated board, and allows the U.S. Government to have veto power over  critical business decisions, President Donald J. Trump has fully  protected our national security.\n\nThis merger…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691745/nippon-steel-and-us-steel-merger"}]