[{"senator": "Joe Neguse", "party": "Democrat", "sentence": "…the duration of his speech was  Elon Musk. So I am not sure if that was an accident on your part or if  that is intentional, and perhaps the Speaker can clarify because I  don't believe he referenced President Trump, but apparently you mistook  his references to Elon Musk as a reference to the President.\n\nMr. NEGUSE. I would just say, Mr. Speaker, that…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…trampled.\n\nICE agents, this so-called ``dream team,'' believe they are above the  law and not bound by the Constitution. We are on the slippery slope  into authoritarianism. Don't believe me? Listen to the President's own  words.\n\nIn a ``60 Minutes'' interview this week, he was asked about sending  Active-Duty military into American cities. He responded:…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…drilling, the more these companies will have to charge for the methane  they do deliver and the more gas prices will go up for families and  businesses.\n\nThe oil companies, they don't believe in what our economists call  externalities. They think they can just throw methane into the air and  let everyone else pay the price in terms of climate change, in terms…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688145/methane"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Social  Security.\n\nLast night, in his state of the Union and over the weekend, the  President and Elon Musk referred to Social Security as a scam and a  Ponzi scheme. I don't believe the people who receive those benefits  believe that Social Security is a scam. It is the Nation's number one  antipoverty program for the elderly. Since its inception in…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688584/congress-has-not-enhanced-social-security-in-more-than-50-years"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…care so that Elon Musk  and the very richest Americans can pay a little less in taxes.\n\nThat is the choice they have thrust upon the American people. It is a  choice that I don't believe they truly understand, so I would like to  take some of my time today on the floor to explain what happens when we  choose Elon Musk's well-being over the people we have…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689514/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…percent, according to a reliable estimate. Obviously, that error is so  small that it is hard to measure and would not have any material impact  on our elections.\n\nIf you don't believe me, ask folks over at the libertarian Cato  Institute, a very conservative organization. They have labeled  President Trump's claims about noncitizen voting as ``bogus''--their…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…crisis, all because of a manufactured emergency  and one person's ego.\n\nThe damage doesn't stop there. What about American products? They are  being boycotted across Canada. Don't believe me? Just look at the  President's social media posts from just 2 days ago where he said:\n\n``Ontario won't even put the U.S. spirits, beverages, and other  alcoholic products,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…FERC's responsibilities is to keep prices affordable. That is  made possible by competition. You want this resource to be as resource  neutral as much as possible. If you don't believe in neutrality, what  you are going to do? You are going to stifle American innovation and  entrepreneurship.\n\nWhen you talk about reliability, it isn't a description of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695752/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…benefits, and no one should lie about them and say that they are  in trouble. They are 99.8 percent delivered. They are 99.8 percent  perfect. It is almost a perfect score. Don't believe what the President  said down on this floor just a few days ago. We are here to protect  Social Security benefits.", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688636/social-security-benefits-are-your-hard-earned-benefits"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…are comparable to offshore wind. That is how much the  wind blows in parts of essentially Maui and Hawaii Island. The southern  part of Hawaii Island is incredible. People don't believe the numbers  until they go down there and measure them. It is as if it is an  offshore wind platform, but it is land-based. So we have ample  resources to power our grid.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699020/energy-costs"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…this data.\n\nWe asked Elon Musk and DOGE to come before this Committee on Ways and  Means, and they refused to come. Why? Because they believe they are  above the law. They don't believe that they are accountable to an equal  branch of government. Now they have gone in and taken the data that  they were after. Why is Elon Musk after it? Because that data…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695217/data-collected-by-doge"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…your parents and your families the life that they deserve so that you  can serve here in Congress with me.\n\nWhat will your legacy be? If you are wondering why constituents don't  believe in government, it is because we say one thing, and then harm  them. I believe that this is a moment where we can choose to love, to  choose compassion, to choose unity…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…are using their  power to subsidize dirty, expensive fossil fuel, all at the cost of  American families who are struggling to afford their electricity bills.\n\nNow, if you don't believe me, just ask Secretary Chris Wright. At an  Energy and Commerce Committee hearing in June, he was blunt. The  Secretary said: ``I have never been for all of the above,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…many people voted for  because of that promise, is out the window. No one is even paying any  attention to it. Donald Trump really is not paying attention to it.\n\nPeople don't believe it anymore. They don't believe any of the  promises that Donald Trump has made. Donald Trump has broken faith with  the very same people he promised to fight for, and I…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698199/new-york"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…don't really want to get into this debate about who, when, and  where because the bottom line is that the Republican Party has never  supported any of this. Many of them don't even believe, I think, that  somehow we should be helping Americans pay for their health insurance.  In any case, they have never supported the Affordable Care Act,  ObamaCare. They…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…make it very clear. The Afghan terrorist attacked these two  soldiers because that is what Islam teaches. The Quran says to kill all  infidels. That means all people who don't believe in Islam.\n\nSo let's not mince words about this. Islamists want every single  American, and especially Christian Americans, they want them dead.\n\nIn 2021, Joe Biden orchestrated…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…crystallized America's transcendent values in a way that  made every degree of difference seem trifling.\n\nWe were all Americans then, and still today, we are all Americans. I  don't believe that the generation that has passed since 9/11 has  depleted our ability to come together as a country, and I don't believe  that an attack on the homeland is the only…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695355/tragic-loss-of-charlie-kirk"}, {"senator": "French Hill", "party": "Republican", "sentence": "…idea.\n\nOver those years, it is not out of ignorance that I have come to the  conclusion that it is a bad idea. One of the contributing factors to my  determining that I don't believe it is an idea whose time has come, to  supplement private-sector innovation in this Nation, is actually  Congressman  Jim Himes' white paper that he shared with me years…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693731/anti-cbdc-surveillance-state-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…I want done that we shouldn't pass anything.  If you vote this rule down, you are basically saying if you are not  going to do what I want, you shouldn't do anything. I don't believe  that is the way a legislative body ought to operate.\n\nMr. Speaker, I urge passage of this rule in order to bring more  transparency and oversight into our children's schools,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…a number of healthcare bills. Every single one of  them is wonderful, except for one small problem: There are rounding  errors.\n\nI love, love, love price transparency. I don't believe you can have  functioning markets without price transparency. Every academic paper I  have in my office says it is only about \\1/2\\ percent of price  improvement. Yet,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…have been trying to do on this reform of Medicare  Advantage. We want the system to work, but we can't allow $1.76  trillion over 10 years of fraud and bad acts.\n\nIf you don't believe me, get in front of your computer right now and  look up some of the articles of the potential indictments, the criminal  activities that are coming. Also, look up The…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…to how much time is  remaining.\n\nMr. GRIFFITH.\n\nMr. GRIFFITH. Mr. Speaker, point of order.\n\nMr. GRIFFITH. I believe the gentleman is referencing a Member by  name, and I don't believe that is proper.\n\nMr. GRIFFITH. There you go.\n\nMr. GRIFFITH. Mr. Speaker, I withdraw my point of order.\n\nMr. Speaker, I have failed. I thought I made it very clear that…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…assume also that they would be against  photo ID to exercise a Second Amendment right.\n\nI have not seen any legislation from my Democrat colleagues to do  that, so I really don't believe that. I think it is all a hoax.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699940/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…power.\n\nDuring his inaugural ceremony, commie Mamdani used two Qurans for his  swearing-in ceremony, not the Bible. He used a book that advocates for  the killing of all who don't believe in Islam or refuse to follow  Islamic teachings. He was also sworn in at an abandoned subway--a  subway station symbolizing what New York City will soon look like when…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…children about sexual activity, that those people, for whatever reason,  in favor of abortion till birth--which is so grotesque that the people  I deal with back home don't even believe the Democrats are for that  because it is so preposterous, but they are. I am afraid that people  like that are going to carry the day in the November election.\n\nMr.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…than the consumer what they actually need in terms of  their health insurance coverage.\n\nBut, of course, our Democratic colleagues wouldn't countenance that.  They don't actually believe in consumer choice. They don't believe in  free enterprise. What they believe in is more government, more  expensive government, and we know that is not the answer…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…Democratic Party  abandoned the middle class for the liberal elite class a long time ago.  The election last November should have been a wake-up call that the  American people don't believe them anymore, nor should they.\n\nThe Democrats are desperate for attention and for power. Don't give  it to them.\n\nLet's set the record straight about what this budget resolution…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…sanctuary city  policy is bad for your country. Democrats are wrong to support it and  want to continue it.\n\nSo what do we hear on the floor today? Not only is it that they don't  believe it is a problem but that they wish to continue it.\n\nThis is why I want a vote. We are going to have a vote on this. You  want to continue these policies. You don't think…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…States.\n\nWe authorize these programs. I don't think the answer is to say we  believe in these programs, therefore we are not going to vote to  reauthorize them because we don't believe they are going to be carried  out. It is our job to authorize them, to work the appropriations  process, and then to do the oversight to make sure these are  implemented.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…working every day to put America first.\n\nWe saw Congress take many actions on Congressional Review Acts to  undo bad rules that the previous administration put in place.\n\nDon't believe the accusation that Republicans aren't working. We have  11 committees that have reconciliation instructions, and 8 of those  committees have marked up those instructions…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}]