[{"senator": "Becca Balint", "party": "Democrat", "sentence": "…Governors, and now the leader of a powerful labor union.\n\nThis is about abusing power to silence dissent. This is about  generating fear to turn us against each other so that we don't pay  attention to this lawbreaking administration.\n\nDavid Huerta said this after being arrested: ``What happened to me is  not about me. This is about something much bigger.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692154/supporting-david-huerta"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…maybe get rid of the Affordable Care Act. They  want people to be forced into junk plans, which could force Americans  into bankruptcy. By the way, Trump made sure that if you don't pay your  healthcare bill, it will go on your credit report. He actually went out  of his way to make sure that that happens.\n\nThe PQ vote today will be Republicans' 22nd opportunity…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697852/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…cronies, everybody who is  surrounding Trump, all the pals in the Cabinet, and all the ones who  write the big checks to the super-PACs and who fund Republican  politicians don't have to pay taxes anymore.\n\nIt is ``Leona Helmsley Day'' here in the Senate. Taxes are just for  the little people. This is a disgrace, and I hope there will be a few  voices on…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689472/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…against them.\n\nWhat do I mean? When China makes a loan to Sri Lanka, that they know  Sri Lanka is not going to be able to pay for that project. They put in  there: Oh, if you don't pay, we get to control your port. Sri Lanka  should be encouraged: Don't give your port to China. Give your middle  finger to China, and you will able to borrow from American…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…50 years.\n\nMr. Speaker, we are long overdue for a vote. We have got a plan that  both expands Social Security across the board, makes sure that people  who continue to work don't pay taxes on their Social Security, and make  sure that we have a COLA that works.\n\nDon't you think, Mr. Speaker, it is long overdue for us to have a  vote?\n\nIf you have a better…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688584/congress-has-not-enhanced-social-security-in-more-than-50-years"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…the  record. Well, they are going to be on the record.\n\nThey know that more than 60 percent of Americans disapprove of these  tariffs. They know that the foreign governments don't pay these  tariffs. They know that American families do. The farmers feel it.  Small businesses feel it. Moms and dads feel it every time they see the  prices at the grocery…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…through  the United States to their breeding grounds. They stop along the shores  of our Great Lakes flyway before continuing their journey to Canada and  beyond. They don't have to pay any tariffs.\n\nBirding in our abundant freshwater kingdom draws environmental  stewards from around the globe. Nationwide, 95 million birders generate  over $90 billion…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690918/national-american-birding-week"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…pay taxes on money they haven't earned.\n\nMy FAIR BET Act would undo the Senate mistake by keeping the 100  percent loss policy in place. This will ensure that gamblers don't have  to pay taxes on phantom income and are not lured to offshore and  unregulated markets.\n\nMy legislation has bipartisan support because Members on both sides  understand that…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693484/bringing-fairness-back-to-gaming-taxation"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…the answer is pretty simple--so they can give tax  breaks to billionaires. Why are they cutting off clinical trials and  cancer research? So that people like Elon Musk don't have to pay their  fair share. Why are they withholding funding to find a cure for  Alzheimer's disease? So big corporations can pay less in taxes than the  average American family.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688264/national-institutes-of-health"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "Mr. COHEN. Mr. Speaker, today Representative Beyer, Senator  Whitehouse, Senator Wyden, and I introduced a billionaires tax bill.\n\nBillionaires don't pay their fair share of taxes, and with the Trump  tax program starting in 2017, they have increased their wealth  tremendously.\n\nNot paying taxes on real estate and stocks and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695620/billionaires-dont-pay-their-fair-share-of-taxes"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…support,  not demonization.\n\nLet's fix this. Let's get our letter carriers the resources they  need. Let's get our sorters the machinery they need. Let's ensure  Americans don't pay late fees if their mail is delayed. Let's get this  done.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688285/protecting-postal-workers"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…know if you  know this, but we have subsidized food in the U.S. Senate, not because  the government is paying for it but because all of the restaurants that  operate here don't have to pay lease rent so it is a little bit cheaper  than you would normally get. I can't get anything for 6 bucks  downstairs in the Dirksen cafeteria, not that would feed me.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Social Security needs.\n\nWhy is it that hardworking people in this gallery should pay into a  system all their lives and get a benefit, yet billionaires can be  excluded and don't have to pay in the same amount or some totally  circumvent the law altogether and pay nothing?\n\nIt is long overdue, Mr. Speaker, don't you agree, for a vote to take  place. For all…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688950/it-has-been-over-50-years-since-congress-has-enhanced-social-security"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…very interesting  topic for today.\n\nWhen the mayors and Governors protested, they said: We don't want to  have a Federal income tax because you are going to hurt us. We don't  want to pay taxes on the taxes we have already paid at the State and  local level.\n\nThe Federal Government said: Don't worry about it. We will put a  deduction in place that says…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690627/republican-tax-cuts"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…that exceeds these  thresholds, and the best part is that companies could avoid the fee  altogether by simply not wasting methane. Members should understand  that they don't even pay the fee if they don't waste the methane, and  we actually have a fund to help them upgrade their equipment so that  they do not waste the methane and actually improve the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…been very  prominent here in the beltway is the talk of reconciliation. To put it  in plain terms, this is just making sure that, at the end of this year,  American families don't pay a significant increase in taxes.\n\nIn 2017, there was major tax reform done, and I think if you were to  take a look at the specific elements of that bill, Mr. Speaker, you…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…When we hear people running around here saying  let's just use current policy, let's just pretend our spending stays  the same, our tax policy all stays the same, and we don't have to pay  attention to the actual law, that would be $5.5 trillion plus another  $1.3 trillion on top of that in interest.\n\nThen, let's add in some of the President's priorities:…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…showing up for work. I think this should become a permanent feature of  our government.\n\nI think it is disruptive, I think it is unfair, and I think it is  wrong that we don't pay the workers that show up. A better way than  isolating different groups and punishing different groups is actually  to pay those who are working. I think, if we do this,…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…2017  tax reform, and those portions expire at the end of this year. I  believe it is the absolute right thing to extend them. We should just  pay for it, because when we don't pay for it--our base number, now you  are going to see two differences here. We are using the next 10 years,  so that takes us to 2035.\n\nThe Senate budget, they did a gimmick.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "John Thune", "party": "Republican", "sentence": "…insurance company  can say ``I found somebody in this particular population group who  meets these criteria, this eligibility. We are signing them up.'' And  since they don't have to pay a premium, they don't even know they are  covered.\n\nSo what has happened the past few years? The number of people who  haven't filed claims literally since 2021 has tripled.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…accounts, so it is cash. We are paying  interest on it because that money was borrowed. We estimate that it is  over $1.5 trillion.\n\nIf you grab that cash and realize you don't have to pay interest on  it anymore, talent-based, MA reform, you just paid for our  reconciliation bill and put some more money in the bank.\n\nMy point is that if we would actually…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}]