[{"senator": "Al Green", "party": "Democrat", "sentence": "…frankly, I don't know  any Democrats that would stand for that. It doesn't matter. We aren't  going to say the person shouldn't be punished.\n\nI speak in specificities. I don't come to the floor and paint with a  broad brush. I don't think all of my colleagues on the other side are  racist. I don't label all of them as rightwing nuts. If I see someone…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…mostly seniors and children. Why? It is to help subsidize  massive tax cuts that mostly go to the top 1 percent.\n\nOf course, all of those cuts, over $1.5 trillion worth, don't come  close to paying for the more than $5 trillion worth of tax cuts. Who  pays the remainder? Our national credit card does.\n\nHere we are, actually voting not just for the biggest…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693195/one-big-beautiful-bill-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…private  sector or something of that nature on foreign affairs. The diplomats  and representatives from the State Department and people directly from  the administration don't come before our committee.\n\nNo matter what your position is, this is about the United States  House of Representatives doing its duty and responsibility.\n\nLet me tell you, when…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…creating access to competition.\n\nMr. Speaker, why would you be afraid of that unless you are mediocre,  less than average, and need extra help because you can't compete?\n\nWell, don't come for Black America. Fix yourself.\n\nLet's talk about the workers who are the backbone of our economy, the  workers who run this government. I am always surprised when folks…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…mother who have  both made Black history in their own right. I stand before you here  today as the proud grandson of men who set the stage.\n\nMost Black people in this country don't come from privilege. I  consider myself to be blessed. I think here in Congress, a lot of the  time, we see a lot of people born on third base thinking they hit a  triple. That…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…term by summarily firing nearly half of  the Department's workforce. He did this in one fell swoop. These  committed people at the Department of Education were told: You don't  have to come to work tomorrow. So this followed the plan laid out,  basically, for President Trump and Project 2025. Then, just this week,  his Secretary of Education laid out plans…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697008/9999"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…problem worse, making them much easier targets for xenophobic attacks.\n\nSafeguarding national security can be done through commonsense  reforms Democrats have offered that don't come at the expense of U.S.  scientific innovation, global collaboration, and the Asian-American  community. As if we needed another reason to oppose this bill, it would  create…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689033/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…you to be afraid of Federal DEIA  programs, maybe even to think they are stopping you from getting a job.  In reality, these are things like paid internships, so you don't have  to come from a well-off family to work a Federal job, or basic  disability accommodations in the office, like making sure the office  coffee pot is in reach of someone in a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…conclusion. Medicaid cuts should be off the table.\n\nMedicaid cuts should be off the table.\n\nIt is up to these lawmakers to follow through and ensure       spending cuts don't come at the expense of care for over 70       million Americans, including kids, seniors, and hard-working       families.\n\nI love the appeal in that letter because it was an…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…seeking medical care. Too often there is a stigma, a belief that asking  for help or going to the doctor is a sign of weakness. We have been  taught to suck it up, big boys don't cry. Come on, man. You can do it.  Until it is too late. We often only go to a doctor when we are deathly  ill or we break a bone.\n\nOur counterparts, young ladies and women, unlike…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…amendments, including the Fifth  Amendment for due process, and the 10th Amendment, rights that are  reserved for the States and the people from the Federal Government.\n\nOur rights don't come with an asterisk. We don't surrender the First  Amendment or any others to political convenience.\n\nOn this Constitution Day, let us remember the greatest threat to  democracy…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695623/warning-about-suppressing-rights-on-constitution-day"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…possess those talents in fields  because we have suffered along the way.\n\nYou have heard the stories of our parents. You have heard the stories  of our grandparents. We just don't come tonight for a Special Order to  tell you our stories, but we want America to know that we are  suffering. We want America to know that we stand with them in this time  when…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687896/black-history-month"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…socialism? I raise the question.\n\nInstead of my colleagues taking this time to talk about how we were  the cause of the shutdown, when my colleagues know they were, don't  deflect it. Come on. Let's talk about socialism. Let's talk about the  commissaries. Let's talk about our Social Security. Let's talk about  the PPP program and how some of my colleagues…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…process in which electrons are treated fairly, irrespective  of source, so you can get the power that you need. That is where we  need to go.\n\nIf you want permitting reform, don't come to me. I am not the  problem. Don't come to Democrats in the Senate. We are eager to do  permitting reform. Don't bother Chairman Capito and the Republicans.  They are ready…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…after these terrible, deepfake, harming images  are pointed out to Grok and to X, formerly Twitter, they do not  respond. They don't take the images off the internet. They don't come  to the rescue of people who are victims. That is why this legislation  is critical, because this legislation says that if they are guilty of  such reckless misconduct, they…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Speaker, you get cancer  groups, you get ALS groups, you get people who have a heart to solve a  problem, and they want money. They want funding. I have to say no. If  they don't come in and say: Well, we know that we are $37 trillion in  debt, so we are proposing this plan, and we are proposing cuts over  here in order to achieve what we want, which is…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…their nominees on a simple voice vote.\n\nIt will, I am afraid, have a very, very, very bad ramification on  this institution if we don't correct course sometime today, if we don't  come to some sort of an agreement that recognizes that Donald Trump won  the election and has the right to have the government that he wants and  that we have a prerogative to…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694711/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…go through those  States--Mississippi, Louisiana, Alabama, sadly, New Mexico, Missouri,  Arkansas, South Carolina. See a little trend there? It is actually  Republicans. Don't come and talk to us about that. It is dangerous to  live and work in many Republican-led States.\n\nLet's get back to what we do to honor and respect law enforcement on  this Police…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…Trump's effort to get rid of all Islamists who hate  our country, as I just previously said, take advantage of the system  when they come here. Don't defraud our government. Don't come here to  try to destroy us. Assimilate with the Americans in this country to  make our country better. We should be welcoming immigrants who are  willing to assimilate with…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "James Lankford", "party": "Republican", "sentence": "Mr. LANKFORD. Mr. President, this week, I filed a bill, as I do  multiple different weeks. I don't come every week  to be able to talk about the bills that I file, but I want to be able  to talk about this a little bit and some context that comes into it.\n\nI also don't come…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695773/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Meanwhile, I believe that we are still that shining city on the hill.  We welcome more legal immigrants than any nation on Earth, more than  the next four countries combined. They don't come because they crave  government control, but because they flee it. They come for liberty.  They come for freedom.", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697149/denouncing-the-horrors-of-socialism"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…Budget, No Pay Act of 2013. President Obama's bill  said: Look, Congress is about to go into a shutdown. Fine, have at it.  Knock yourselves out. Go into a shutdown. But if you don't come out of  that shutdown by this particular date, you are not going to get paid.\n\nAnd do you know what? Members of Congress had an epiphany. They had a  Damascene moment. They…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…present on that day, saying that they do not believe there was criminal  intent sends a very clear message to a young U.S. attorney with a dream  in the DC District: Why don't you come talk to people who were at the  alleged scene of the crime?\n\nWe said we do not believe there was any criminal intent--2 minutes.\n\nMr. President, as a matter of fact, the…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}]