[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…eggs, chocolate eggs, egg yolks, egg whites, egg souffle,  meringue pie, egg salad, and so much more.\n\nEgg prices still cost 25 percent more at the grocery store. The  answer is: Don't ignore the devastating impact of bird flu decimating  flocks across our district and Nation. Meanwhile, the big egg  conglomerates like Cal-Maine are posting record profits,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691814/recognizing-national-egg-day"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…the pressure of local community people watching to see if they are  making progress on that recovery.\n\nBut what has happened with FEMA, where everything is centralized, is  you don't get an answer. Can we replace an 18-inch culvert with a 36- inch culvert? Can we do the bridge over Hartland Road? Or can we make a  change because the bridge over Route 5…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…critical care physician, I know what this means. Without  Medicaid, patients go without preventive care. They get sicker. They  defer lifesaving medications. Too often, they don't survive.\n\nMedicaid is not a handout. It is a lifeline. Cutting it to fund tax  breaks for the ultrawealthy is unconscionable because healthcare is a  human right. It is not…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690885/medicaid-is-not-a-handout"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…Firefighters are  being laid off or not even being hired for the summer fire season.\n\nIn our national parks, who will be there? Apparently my colleagues on  the other side of the aisle don't care much for those people who are  necessary for providing the summer programs in our national parks.\n\nMy Republican colleagues will give $3.5 trillion in tax breaks to the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…the people who stand to lose the most under the Republican  bill.\n\nThese are the folks who rely on basic needs programs like SNAP and  Medicaid. These folks aren't lazy. They don't want something for  nothing. They just want to feed their families and to take care of  their kids.\n\nHowever, the Republican plan is to drown them in red tape, to kick  them…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691770/151-days-without-a-vote-to-lower-costs"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…masked agents and more inhumane detention facilities for  those who are beaten and dragged off the street.\n\nThis is not who we are. This is not the character of our country. I  don't think my Republican colleagues understand the gravity of their  silence. It seems they have been silenced from speaking out against  this brutality due to their fear of this…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692930/holding-power-accountable"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…abroad who cannot physically get  back to their polling place in their jurisdiction to register to vote.\n\nWe are basically telling these citizens of this country that their  votes don't count. We don't care if they can vote. We don't care how  hard it is, and we are going to make it impossible for them to vote.\n\nRepublicans categorically rejected that amendment.…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689407/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…Speaker, I rise today because the right to vote, the crown jewel  of our  democracy, is under attack again. We have seen this play out before,  and we know how it ends if we don't act. Tonight, I say: We have come  too far and there is too many to go back in time again.\n\nIn 1965, a year before I was born, after 346 years, African Americans  were finally…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…amendments, including the Fifth  Amendment for due process, and the 10th Amendment, rights that are  reserved for the States and the people from the Federal Government.\n\nOur rights don't come with an asterisk. We don't surrender the First  Amendment or any others to political convenience.\n\nOn this Constitution Day, let us remember the greatest threat to  democracy…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695623/warning-about-suppressing-rights-on-constitution-day"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…made a friendly wager with a New  York Member of Congress last year at the beginning of the Minnesota  Lynx-New York Liberty WNBA final series. That bet included that I would  don a Liberty jersey and give a speech congratulating them from here on  the House floor if they won the series. I would have, but I won't. Why  won't I? Because the truth is that…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693881/taking-on-wnba"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…It is  because these rich and powerful men donate to the politicians in  Washington, D.C., and play golf with the elites in Washington, D.C.  They are foreign leaders who we don't want to offend. They interact  with our intelligence agencies that we don't want to disobey. There is  something rotten in Washington.\n\nThis is a question of whose side are…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693552/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…abuse of Trump's unilateral military  force abroad.\n\nNot surprisingly, not one of the ten amendments I submitted were made  in order.\n\nLet me tell you what Republicans apparently don't care about:  Accountability for predators.\n\nI offered an amendment to disinter Dr. Robert McCormick Browne, a man  accused of sexually abusing dozens of students in Hawaii,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695301/fiscal-year-2026-ndaa"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…something her  body simply couldn't digest. Because the school offered no alternative,  it was this or nothing. As you know, in many cases, our young people  will get nothing if they don't enjoy some nutritional values at school.\n\nMany children may not make the connection between consumption of milk  and their feelings of discomfort and even illness. Lactose…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698179/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Speaker, I thank the ranking member for yielding.\n\nMr. Speaker, once again, my Republican colleagues are selling  Americans on a bill with a flashy title and hoping that they don't read  the fine print.\n\nThe so-called Tipped Employee Protection Act implies that something  in this bill might actually benefit workers who work for tips. In  reality, this…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698962/tipped-employee-protection-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…months, ``King'' Donald's reign has rained down chaos  and corruption and cuts and crisis on the American people. And he is  counting on you not to pay attention. He is hoping you don't notice  that, every day, costs are rising, retirement savings are sinking, and  families are living paycheck to paycheck and they are bearing the  burden of the Trump world.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…this resolution truly is. It  orders the United States to withdraw forces from Venezuela, yet there  are no U.S. forces in Venezuela to withdraw. You cannot remove troops  that don't even exist. That alone shows how unserious Democrats are in  this effort.\n\nThey also claim the act to remove Maduro was unconstitutional, which  ignores Article II and decades…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699365/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…withdrawal itself locks up roughly 11,000 acres for helium exploration,  blocking development of one of the largest and most concentrated helium  deposits in the entire world.\n\nDon't let the rhetoric around this issue confuse what is at stake  here. The resolution before us today is about more than just one  project. There are two options, Mr. Speaker:…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…this case for some plus-ups for some subsidies for  the broken ObamaCare system.\n\nNow we are 5 years removed from COVID, and my Democrat colleagues are  trying to say that if we don't extend those subsidies that somehow we  are denying people healthcare. That is just flat false. It is a lie.\n\nThe fact is, ObamaCare remains in place. Its subsidy structure…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…the programs is such that there is a  feeling of: Why would I get married at all?\n\nThese programs also cause cheating or breaking the law because, of  course, they frequently don't catch it if you are getting cash off the  books. All of these programs encourage working for cash. They also  encourage, I think, earning money by doing things illegally because…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…them the relief  that they so desperately need.\n\nIn a few short weeks, this body will have a chance to show what we  stand for. For most of my Democrat colleagues, I know they don't want  to give President Trump a win, but surely they can work with him on  behalf of working-class families. They are either for the largest tax  cuts for middle- and working-class…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…eight remaining  biologists at Yosemite looking out for it rather than nine? I guess we  will just have to find out.\n\nHow many of Yosemite's employees are working from home? We don't know  because the park management won't tell us. We do know that 34 percent  of National Park Service employees across the country were still  working from home in 2023. Need…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688585/yosemite-belongs-to-the-people"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "Ms. MACE. Mr. Speaker, when solicitors don't prosecute crimes, when  judges and rogue magistrates let thugs out on the streets of America,  cases like Iryna Zarutska happen, murders like Iryna Zarutska happen.\n\nI want…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695274/warning-to-scarlett-wilson"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…of our  budget, I would ask them what, outside of border security and national  defense, would they like to cut from our budget? They have never seen a  foreign country they don't want to shower with our tax dollars or an  illegal alien that they don't want to give welfare to.\n\nThis is a logical first step to get our finances under control. I  urge…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692538/rescissions-act-of-2025"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…This is an issue that matters to Kansas farmers and farmers around the  country. It allows them to sell nearly $2 billion worth of excess  commodities every year, so farmers don't have to let the crops go to  waste and shoulder the losses.\n\nFor years, Food for Peace has been hampered by bureaucratic delays,  mismanagement, and abuse within USAID. The…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691403/motion-to-discharge-s-res-195"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…are going  to sit down and negotiate with you under those circumstances. That is  not going to happen.\n\nWe told you 43 days ago, from bitter experience, government shutdowns  don't work. They never achieve the objective that you announce. Guess  what. You haven't achieved that objective yet, and you are not going  to. We did the same thing twice, so…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Syria or Yemen? Certainly, there is  little daylight between the legality of this operation and the one  President H.W. Bush undertook to apprehend Manuel Noriega in Panama.\n\nYou don't have to agree with a President's approach to national  security policy to acknowledge his compliance with the law and his  constitutional authority for the use of force, which…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698662/venezuela"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Mr. SCHWEIKERT. Mr. Speaker, I thank my friend from California for  his remarks, and as I always say to Californians, don't take Arizona's  water.\n\nMr. Speaker, may I inquire as to the time remaining.\n\nMr. SCHWEIKERT. Mr. Speaker, I am going to try to do a run-through of  a couple things here.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…do is focus on what we are here to do today.  We could talk about tariffs sometime, yes. We are happy to do that, but  let's talk about what we have to do here.\n\nThe Democrats don't want to talk about these because they correct  issues that the Biden administration did wrong, these midnight rules of  the CFPB. They don't want to talk about the rogue judges…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…footnote No. 2  that a separate statutory provision exists that ``protects disclosure  to Congress using significantly different language and raises distinct  issues that we don't discuss in this opinion.''\n\nThe same Department of Justice opinion also says, in part, that an  employee is provided whistleblower protection ``when the employee  reasonably…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…officers across the country put their lives on the line every  single day to keep us safe. Every day that they go out, they put their  uniforms on and leave their families, and they don't know what they are  going to run into. Every day can be a boring day where nothing happens.  They can go through a whole career that way, but they never know and  their families…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689661/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}]