[{"senator": "Joe Neguse", "party": "Democrat", "sentence": "…recent years.\n\nMore importantly, my amendment would also require that universities  disclose the detailed terms and conditions that they agreed to in  return for the foreign donation from this expanded list of countries,  critically revealing whether those foreign donations come with strings  attached that can foment antidemocratic influences on campuses.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…capacity of frontline communities to withstand and  recover from future disasters.\n\nGood360's innovative use of advanced data and resource matching  technology accelerates donation routing and optimizes logistics. This  system enables the delivery of critical goods up to three times faster,  while minimizing environmental impact and ensuring that the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694807/recognizing-good360-in-honor-of-national-preparedness-month"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…adequate funding  for the plant. If we can get money from other sources, there is no  reason not to accept it. For some reason, current law prevents us from  accepting even a donation from a nonprofit that would want to help us  with the issue.\n\nMr. Chair, I say let's get out of the way. H.R. 1948 passed out of  the House on suspension in June of this year,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698031/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Coach Harrington, Coach Young, the Winter Guard, and  the Independence High School community on their championship.            Honoring Richard Martin on his 700th Platelet Donation\n\nMr. SUBRAMANYAM. Mr. Speaker, I rise today to honor Richard Martin of  Sterling, Virginia, who reached a remarkable milestone last month, his  700th platelet donation. This…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689774/congratulating-chief-keith-johnson-on-his-retirement"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…success of this food drive requires extensive  dedication, compassion, and community support. In the weeks and months  leading up to Thanksgiving, Terri starts setting up donation sites  throughout town, storing donations, and coordinating volunteers to  assemble baskets and deliveries. The entire community truly rallies  around Terri and steps up to…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699949/recognizing-terri-judah"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…University to improve family  mental health and created RI For Gun Safety to promote commonsense gun  reform.\n\nPerhaps most notably, he provided the vision and the founding  donation for Hasbro Children's hospital in Providence.\n\nThanks to Alan, Rhode Island is home to a world-class pediatric  healthcare facility providing for the specialty and emergency…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693984/recognizing-arthur-coia-of-rhode-island"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…about those American citizens who came forward. But make  no mistake, what happened to them could happen to any of us on our way  to church for a clothing drive or to make a donation, on your way to a  doctor's appointment, or even heading home from dropping off your 6- year-old son at school--everyday activities, American activities, by  American citizens…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…people.\n\nWhat we really have now are two campaign systems--one for ordinary  citizens and one for the megarich that gives the megarich extraordinary  power.\n\nIf you or I make a donation to a candidate, well, first of all, there  is a cap on it of several thousand dollars. I know nobody in my blue- collar community donates several thousand dollars to a campaign,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Above all, Sydney loved fiercely: her family; her friends; her dog,  Waylon; and the community she served. In her final act, she gave the  gift of life itself through organ donation, offering hope to families  she would never meet.\n\nWe honor the strength of her family who made this courageous decision  with love and grace. Sydney's passing reminds us…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…blood centers across the United States that  provide a lifeline to people and patients in our hospitals.\n\nThis week the center declared a blood emergency.\n\nA single blood donation can save up to three lives, making the work  of our community blood centers and the generosity of the employees and  the volunteer blood donors who contribute their work extremely…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698776/recognizing-national-blood-donor-month"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…``Celebrity Jeopardy!'' just recently, he gave a  million dollars--the full winnings--back to the community, specifically  to the school district in Oakland, California. His donation has  supported over 200 projects in Oakland schools, including Castlemont  High School.\n\nJust recently, I visited Castlemont High School and met with these  amazing students,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690855/thanking-w-kamau-bell-for-his-generous-donation-to-oakland-schools"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…foreign entity of concern.\n\nThe bill also guarantees parents the right to know how many personnel  at their child's school are being compensated by foreign sources or any  donation of foreign transactions between the school and a foreign  entity.\n\nThe dangers of foreign influence in American K-12 schools cannot be  overstated. They threaten our national…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…entities of concern for the purposes of this act.\n\nThis amendment provides clarity and ensures that any U.S. college or  university entering into a contract with or receiving a donation from a  section 1260H list company is required to first receive a section 117A  waiver from the Department of Education.\n\nAgain, the reporting threshold for foreign entities…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689026/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…not just a reflection on the past but a  celebration of what is to come.\n\nAs part of this milestone, ACCAP is launching a monthlong  celebration, including the placement of donation boxes throughout  Armstrong County. This is a wonderful opportunity for all of us to give  back and to ensure that ACCAP's vital work continues for generations to  come.…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689395/recognition-of-accaps-60th-anniversary"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…including  211, Success by Six, and Supporting Student Access.\n\nDuring Johnson's tenure at Goodwill, the organization broadened its  mission beyond traditional job training and donation-based stores.  Under his leadership, Goodwill introduced innovative programs that  supported children and families at risk of violence and created a new  job placement program…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693113/congratulating-don-johnson-on-his-retirement-as-the-ceo-of-goodwill-industries-of-central-illinois"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…business  excellence.\n\nHe is often recognized for his significant philanthropic efforts,  recently donating $20 million to the Savannah Community Foundation.  This generous donation is just one of many throughout his successful  career.\n\nMr. Speaker, the First District of Georgia appreciates Greg and his  many years of friendship.               Savannah:…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692245/congratulating-greg-parker-retailer-executive-of-the-year"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…pregnancy center and then share other  serviceable items with community partners. Ms. Furlong also visits the  Center each weekend when the facility is closed to check the donation  box and bring donated items inside to ensure they reach the intended  recipients. When volunteers are united in an important mission, it  naturally fosters camaraderie which…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691825/recognizing-patricia-furlong"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…events such as graduations, sporting events, and a Cold War Veteran  Recognition Ceremony that I held in November 2025. He has also led  community service efforts, such as donation drives, and organized a  Veterans Day program for his hometown.\n\nThe Young Marines is a national youth program that focuses on  community service, leadership, and a drug-free…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699827/recognizing-young-marine-corporal-chase-muchmore-on-being-named-the-pennsylvania-regiment-junior-young-marine-of-the-year"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…end to  preventable TB deaths like Shandra's.\n\nThe bill will also require HHS to conduct research and public  education campaigns on the risks of surgery requiring a tissue  donation.\n\nMr. Speaker, I urge my colleagues to support this vital bipartisan  legislation in honor of Shandra and her family.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692764/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…dissemination of educational materials to inform health care       professionals and other appropriate professionals about       issues surrounding--\n\n(1) organ, tissue, and eye donation, including evidence-      based methods to approach patients and their families;\n\n(2) the availability of any donor screening tests; and\n\n(3) other relevant aspects of donation.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692768/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…United States--\n\n(1) to combat international trafficking in persons for       purposes of the removal of organs;\n\n(2) to promote the establishment of voluntary organ       donation systems with effective enforcement mechanisms in       bilateral diplomatic meetings and in international health       forums;\n\n(3) to promote the dignity and security of…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Cross continues that legacy by delivering disaster  relief, supporting military families, and offering health and safety  training. They run one of the world's largest blood donation networks,  supplying more than 40 percent of our Nation's blood products.\n\nEvery 2 seconds, someone in the U.S. needs blood. Yet only a small  percentage of eligible donors…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691605/american-red-cross-founding-day"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…supply remains critically low.\n\nBecause of the urgent and ongoing need for blood donations, I  recently introduced H.R. 5791, the Boosting Lifesaving Operations,  Opening Donation Centers Act, or the BLOOD Centers Act, alongside my  Democratic colleague, Congresswoman Schrier.\n\nThis commonsense, bipartisan legislation would streamline the  bureaucratic…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699256/national-blood-donor-month"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, this month of April is National Donate  Life Month. This month is the time to raise awareness about the  lifesaving importance of organ donation.\n\nThere are over 103,000 Americans on the national organ transplant  waiting  list. We should have confidence that our organ transplant system is  efficient and fair. Sadly,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690102/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…where  she joined the Florida Bar in 2009 and continued her legal career for  an additional 14 years. Kathy has since retired from practicing law but  remains active in her donation of time and legal expertise to the  community. She is an active member of both the Illinois and Florida  bars and remains in the retired reserves of the U.S. Army, ready to…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691195/recognizing-kathy-logue"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…hospital patients need blood, and  approximately 29,000 units of red blood cells are needed every day in  the United States.\n\nOver the last 50 years, public awareness for blood donation has  increased. Now approximately 13.6 million volunteers donate blood  annually.\n\nIn the Commonwealth of Pennsylvania, more than 5,000 blood drives  were held in 2025, according…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698826/national-blood-donor-month"}]