[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…Guard and Reserve, offering free car washes to  veterans on every Veterans Day and donating a portion of proceeds to  the Puget Sound Honor Flight. Brown Bear Car Wash has donated over  $71,000 to the Puget Sound Honor Flight and is a vital partner to  Cathay Post No. 186, helping raise funds for veteran services. Beyond  supporting the post, Brown…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697600/recognizing-victor-odermat"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…the State  endangered great grey owl and little willow flycatcher, as well as a  suite of additional at-risk wildlife species. In 2016, a coalition of  conservation groups donated Ackerson Meadow to Yosemite National Park;  however, it is almost completely surrounded by Stanislaus National  Forest and only partially contiguous to the rest of Yosemite…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695778/by-mr-padilla"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…system for the powerful that every single  Republican in this Chamber keeps voting to defend. It is called the  dark money system. There is no cap on the amount that can be donated.  There is no public disclosure to the American people.\n\nThe Supreme Court created this dual system, saying: You know, a cap  on money to the candidate--well, that could produce…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…children via a  network of local nonprofit organizations, churches, and community  agencies.\n\nWhether she is coordinating drop-off sites, recruiting volunteers, or  searching for donated warehouse space, Rita's logistical skill set  matches her passion and her dedication.\n\nRita has described her late hours and working weekends with the  Marine Corps Reserve…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697836/commending-omar-martinez-gonzalez"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…of today, so we can start that clock ticking. It is  important that we take up this legislation now so that this awesome  statue that has already been built and already been donated can be cast  to perfection and placed ahead of 2026.\n\nI am grateful for the support of this effort. I thank the sculptor,  Zenos Frudakis, for his beautiful work already.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688221/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Vermonters who had been retired  for years, but they stocked shelves, checked out customers, and  prepared sandwiches with enthusiasm. They pitched in not because they  had to--many donated their salaries to charity--but because they felt  the store's survival was essential to their community.\n\nDespite the challenges they face as a small business--staffing  shortages,…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694332/recognizing-dan-whits-general-store"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…last month, his  700th platelet donation. This isn't just a number. It represents lives  saved and hope restored.\n\nRichard's journey began in 1982, inspired by his father who donated  an incredible 17 gallons of whole blood. For over four decades, Richard  has visited his local blood donation clinic every 2 weeks. He is a  familiar face to the staff, always…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689774/congratulating-chief-keith-johnson-on-his-retirement"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Koglin. Chief Koglin served the Warrenton Volunteer Fire  Company for 62 years, first joining when he was only 14 years old.\n\nAnother award went to Sergeant John Larson, who donated a portion of  his liver to a child after screenings said he was a good match.\n\nGeorge Scheulen was honored for his courageous service as a platoon  leader in the Army.\n\nTo…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690556/recognizing-valor-award-winners-and-honorees-from-fauquier-county"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…has netted $1  billion from those crypto schemes, taking advantage of the Office of  the President to enrich him and his family.\n\nDuring the 2024 election, crypto companies donated millions of  dollars to elect the President. After he was elected, they donated  millions more to his inaugural committee. It is notable that in his  first 6 months in office,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…their daily life. Pat has represented the  MOAA on numerous occasions and spearheaded events to honor surviving  spouses. In one case, Pat established a memorial fund that donated to  family charities identified by each surviving spouse in memory of their  loved one.\n\nPat showcases exceptional personal care for the people she helps,  immediately contacting…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691686/recognizing-patricia-ann-miller-for-her-service-as-surviving-spouse-liaison"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…electricity. Trump and Republicans are destroying this clean and  affordable energy by cutting its funding in half. They are doing this  to benefit the fossil fuel companies that donated to their campaigns.\n\nFinally, they are also rewriting the history of January 6. They  quietly slipped into the rule a brand-new select committee on selective  memory designed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…was responsible for leading technical oversight over the       Organ Procurement and Transplantation Network in order to       ensure patient safety, maximal usage of donated organs,       continued confidence in the donor system, efficient spending       of taxpayer dollars, and a secure, modern technology       infrastructure.\n\nThese aggressive…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688136/fired-by-president-trump"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…answer  that immediately by saying, ``Do you know how my life would be better?  If the President of the United States of America had a $450 million new  plane that had been donated from a foreign country.''\n\nI have never heard a constituent tell me when I have asked them what  the most important thing is for them right now: ``Do you know what the  most…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…people.\n\nAfter their wealthy donors took them on trips and involved them in  this vast scheme over the last several years to fundamentally remake  America, the same donors who donated to Donald Trump and who donated to  our friends across the aisle are also making money hand over fist on  the stock market right now.\n\nThis is what comes from Citizens United,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699236/restoring-election-integrity"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…former board member Ellamae Doyle's many years of outstanding  service. Recipients have also been selected for the Eakin Philanthropy  Award, named in honor of the family that donated the first parcels of  parkland to the park authority more than 50 years ago; the Mayo Stuntz  Cultural Stewardship, named in honor of a celebrated local historian  and military…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696038/recognizing-the-2025-elly-doyle-park-service-awardees"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…military fort, the community recognized the historical significance of  the site and pushed for its preservation. The State of Wyoming bought  the land from local residents and donated it back to the Federal  Government in 1937.\n\nToday, it is recognized as the Fort Laramie National Historic Site.  National Park Service employees and volunteers keep the site…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694485/100th-anniversary-of-fort-laramie-wyoming"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Ms. Frazier was a strong advocate for bringing in government  and non-profit resources to aid in the recovery…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690794/recognizing-jami-frazier"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Verosic was a strong advocate for bringing in government  and non-profit resources to aid in the recovery…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690146/recognizing-brody-verosic"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…addition to providing countless  hours of direct support to neighbors and flood victims, Casey helped  coordinate the collection and distribution of emergency supplies, meals  and donated services to help those who needed help. A truly selfless  leader, Casey was a strong advocate for bringing in government and non- profit resources to aid in the recovery process.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690275/recognizing-casey-kc-gabelli"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Youngblood was a strong advocate for bringing in government  and non-profit resources to aid in the recovery…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690716/recognizing-glen-youngblood"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…soil. Ryan was a son, a brother, a  best friend, and an uncle.\n\nThis is why 100 percent of their shop's net proceeds of coffee,  awareness bracelets, and awareness shirts are donated to suicide  prevention programs and other veteran organizations.\n\nMr. Speaker, I am more than proud to recognize the Funky Buffalo as  our small business of the month, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695704/recognizing-the-funky-buffalo-coffee-house-and-trading-company"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…calls annually.\n\nSusquehanna Regional EMS is dedicated to serving the community and  has worked to ensure that patients beyond the hospital are protected.  The service has donated over 100 AEDs to various counties and has  helped to train residents in critical lifesaving skills.\n\nRepresentatives from Susquehanna Regional EMS will accept the award  on…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699537/recognizing-susquehanna-regional-emergency-medical-service"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…301(c) of the National Organ       Transplant Act (42 U.S.C. 274e(c)).\n\n(5) Organ transplant.--The term ``organ transplant'' means       the transplantation or transfusion of a donated human organ       into the body of another human for the purpose of treating a       medical condition.\n\n(6) Qualified individual.--The term ``qualified       individual''…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692719/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…addition to  providing countless hours of direct support to neighbors and flood  victims, he helped coordinate the collection and distribution of  emergency supplies, meals and donated services to help those who needed  help. He and his wife also provided cash assistance to victims of  Hurricane Milton in Lacoochee, Trilby, Ridge Manor area. A truly  selfless…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690644/recognizing-pastor-kenny-buzzie"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…volunteers from all over town joined Diana's mission. Her operation  expanded to two sheds in her backyard, where volunteers collected the  names and addresses of troops, assembled donated items in the care  packages, and sent them on their way overseas. Each box included a  Gideon Bible, a deck of cards, as well as toothbrushes, shampoo,  personal hygiene tools,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691308/acts-of-service-by-diana-lawrence-and-troop-box-ministry"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Ms. Noble was a strong advocate for bringing in government and  non-profit resources to aid in the recovery…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690136/recognizing-carol-noble"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…team request funds. She also  supported the school's new PBIS House system with custom flags and t- shirts for all staff members, handmade by her. Just last year, the PTA  donated over $10,000 to the media center to refresh its library with  new books. These are just a few of the examples of the programs and  initiatives that Emily leads. We are so…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690622/recognizing-emily-mazzaro"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Arnold was a strong advocate for bringing in government and  non-profit resources to aid in the recovery…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691984/recognizing-sean-arnold"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…addition to providing countless  hours of direct support to neighbors and flood victims, she helped  coordinate the collection and distribution of emergency supplies, meals  and donated services to help those who needed help. A truly selfless  leader, Ms. Mankotya was a strong advocate for bringing in government  and non-profit resources to aid in the recovery…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690691/recognizing-jennifer-mankotya"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Ms. Gavish was a strong advocate for bringing in government and  non-profit resources to aid in the recovery…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691963/recognizing-ruth-gavish"}]