[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "President, first, I want to thank our great Senators  Klobuchar and Kaine and Wyden for leading the charge here on the Senate  floor against Donald Trump's destructive, self-defeating, and often  utterly juvenile trade war.", "title": "Terminating the National Emergency Declared to Impose Duties on Articles Imported From Canada", "date": "2025-10-29"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "If  you want any indication where the current President stands on the  Department of Labor and American workers, all you have to do is walk  down the street and you will see a three-story picture, not of the  American worker on the front of the Department of Labor, but of Donald  Trump's face, who spent American taxpayer, hard-earned dollars to put  his face on the Department of Labor, which is the United States agency  that is supposed to demand protections for our workers.", "title": "Trump's Labor Agenda: Unsafe and Underpaid", "date": null}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "Clearly our ability to advocate for Taiwan at the IMF, to carry out  the purposes of this bill, is undermined by the fact that Donald Trump  is examining withdrawing us from the IMF.", "title": "Taiwan Non-Discrimination Act of 2025", "date": "2025-06-23"}, {"senator": "André Carson", "party": "Democrat", "sentence": "Last, it calls on President Donald Trump to  appoint a Special  Envoy to the Great Lakes region of Africa, which will be vital to  addressing the enduring regional security crisis emanating from eastern  DRC.", "title": "Reintroduction of the Resolution to Condemn the Ethnic Violence in the Democratic Republic of the Congo", "date": "2026-01-30"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "Speaker, as we celebrate Mother's Day this  weekend, I am reminded of a visit that Donald Trump had with Howard  Stern.", "title": "Being A Mom in Trump's America", "date": "2025-05-08"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "Look, Donald Trump couldn't tell you the meaning of the words  ``service'' or ``sacrifice'' if he had a dictionary laying open in  front of him.", "title": "-9999", "date": "2025-04-09"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "Stand with the working men and women  of this country and small businesses or Donald Trump.", "title": "Lower Health Care Premiums for All Americans Act", "date": "2025-12-17"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Bove--Emil Bove--last week, Senate  Republicans on the Judiciary reported out one of Donald Trump's worst  judicial nominees yet, Emil Bove; and that is saying a lot, since there  are so many bad ones.", "title": "Nomination of Emil J. Bove III", "date": "2025-07-21"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Here at home, Donald Trump is following the same playbook.", "title": "Respect for Science and Pursuit of Truth", "date": null}, {"senator": "Al Green", "party": "Democrat", "sentence": "The first dastard to be dealt with is, of course, the President of  the United States, so I have a resolution that condemns President  Donald Trump for ordering an unprecedented midcycle, racist  redistricting effort in Texas--midcycle, racist redistricting in Texas,  President Trump.", "title": "Black History: Stolen Legacies", "date": "2026-02-12"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "We are here because Donald Trump wants a Fourth of July party to  celebrate this garbage bill.", "title": "Providing for Consideration of Senate Amendment to H.R. One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "attorneys who were put in office by President  Trump have both recently been forced out of office--forced out of  office because they wouldn't engage in political persecution of Donald  Trump's enemies.", "title": "Trump Administration", "date": "2025-10-21"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Tomorrow, we will be focused, likewise, as we debate this bill, on  Republicans' morally bankrupt tax breaks for billionaires and on Donald  Trump's dumb and costly tariffs, on the need to stand up for our  veterans and our national security, on the unprecedented corruption  Donald Trump has unleashed in our government, and finally on the  existential fight to protect Social Security from the chain saw of Elon  Musk.", "title": "Establishing the Congressional Budget for the United States Government for Fiscal Year 2025 and Setting Forth the Appropriate Budgetary Levels for Fiscal Years 2026 Through 2034", "date": "2025-04-03"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "I also have to just mention that food banks, which are the next line  of support, are also under threat because DOGE and Elon Musk and Donald  Trump have cut the food going to those food banks, leaving shelves  bearer and leaving food banks having to ration foods.", "title": "Gop Tax Scam Hurts Everyone", "date": "2025-05-20"}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "They don't want people who work for veteran hospitals or  Social Security to have their jobs cut just to pay for Elon Musk and  Donald Trump's tax cuts.", "title": "Listening to Our Constituents", "date": "2025-04-08"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "In December, I am grateful to say to my colleagues that Congress  overwhelmingly passed and President Donald Trump enthusiastically  signed the National Defense Authorization Act.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "I  am a supporter of Donald Trump.", "title": "Terminating the National Emergency Declared to Impose Duties on Articles Imported From Canada", "date": "2025-04-02"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Let's look at the predictions that were made when President Donald  Trump signed the Tax Cuts and Jobs Act around Christmas 2017.", "title": "Providing for Consideration of Senate Amendment to H. Con. Res. Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "James Risch", "party": "Republican", "sentence": "If the  United States or Donald Trump or any other President sought to declare  war on Iran, this would be well-taken.", "title": "Motion to Discharge--S.J. Res. 59", "date": "2025-06-27"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "Speaker, what we have heard today is a continuation of this lame  excuse of politics and on Donald Trump.", "title": "District of Columbia Judicial Nominations Reform Act", "date": null}, {"senator": "Keith Self", "party": "Republican", "sentence": "Rather than Democrats making it their life's mission to  destroy Donald Trump, America would be better served if Members of this  Chamber would help him prevent the flow of illicit drugs.", "title": "Resolution, to Remove United States Armed Forces From Hostilities with Presidentially Designated Terrorist Organizations in the Western Hemisphere", "date": "2025-12-17"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "Michael Cohen was the disgraced former attorney of President Donald  Trump.", "title": "Notice of Intention to Offer Resolution Raising A Question of the Privileges of the House", "date": "2025-11-18"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "Our national security is the mission for the United States  military, and it will stay there with Donald Trump as President.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "First, it has been highly reported and debated about Congresswoman  Stacey Plaskett texting during an Oversight Committee hearing with  Jeffrey Epstein, while trying to conspire with him to hurt or embarrass  Donald Trump.", "title": "Irrefutable Evidence", "date": "2025-11-20"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "Our President; his predecessor, Joe Biden; his predecessor, Donald  Trump; his predecessor, Barack Obama; and his predecessor, George W.", "title": "Department of Defense Appropriations Act, 2026", "date": "2025-07-17"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "They were so honored then-Presidential candidate Donald Trump came  down and spent time in Livingston Parish after this flood to call  attention to it because he felt as if President Obama was not paying  attention.", "title": "Authorizing Representation By the Senate Legal Counsel in the Case of Desmond Bellard V. Ronald Wyden, U.S. Senator", "date": "2025-04-10"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "The emails reveal that a journalist coached Epstein to  blackmail then-Presidential candidate Donald Trump.", "title": "Epstein Files Transparency Act", "date": "2025-11-18"}]