[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Ms. BONAMICI. Mr. Speaker, I rise to share the story of a Federal  scientist in Oregon who was recently fired by Donald Trump and Elon  Musk.\n\nIn Oregon, we experience seasons with drought and wildfires, and  lives depend on accurate research of water sources. Mr. Speaker, 60 to  70 percent of…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688208/fired-by-president-trump"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…to prevent something like this from ever  happening again: Did Federal funding cuts hinder rescue efforts? Did  staffing shortages make it harder to respond?\n\nOf course, Donald Trump didn't like these questions. He threw a fit,  a tantrum. He called them lies. He said they were inappropriate. That  is how he talks.\n\nWe know now why he threw a fit and…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693517/central-texas-floods"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…neighborhoods less safe, and I heard how his attacks on  unions at the VA and FEMA will ripple right into the private sector,  hurting working men and women everywhere.\n\nDonald Trump's latest stunt, firing Federal Reserve Governor Lisa  Cook, is illegal, reckless, and a straight-up power grab designed to  give him control of the Fed and raise costs for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694808/northeast-ohioans-are-getting-squeezed"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…merits, so rather than  changing their policies, they are seeking to change the rules.\n\nJohn Lewis was not bludgeoned on a bridge in my hometown for the  Republicans and Donald Trump to take these freedoms away from us. This  is a blatant power grab, and Democrats will not stand for it.\n\nVote ``no'' on this disastrous legislation.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700009/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Republican colleagues are  pushing a bill that would throw their constituents under the bus, a  bill that flies in the face of everything they claim to stand for, all  because Donald Trump wants a bill-signing photo op by the Fourth of  July.\n\nMy Republican colleagues know that this bill will cost 17 million  Americans their health insurance. They know that…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693238/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…a strong Federal system to oversee this type  of crypto market that protected consumers, our national security, and  financial stability.\n\nUnfortunately, the election of Donald Trump ended those bipartisan  efforts and brought a significant new challenge to stablecoins. That  challenge was the Trump family's brazen corruption using crypto to sell  access…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Ms. KLOBUCHAR. Mr. President, on January 20, 2025, the Joint  Congressional Committee on Inaugural Ceremonies--JCCIC--hosted the  inauguration of President Donald Trump.\n\nThis year, I chaired the joint committee with Senator Fischer, my  counterpart on the Senate Committee on Rules and Administration. I  thank her and the rest of the committee…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Mr. RASKIN. Mr. Speaker, thousands of my constituents have been  illegally fired by Elon Musk and by Donald Trump. One of them was with  me last night, Dr. Lauren McGee, who was an NIH pediatric cancer  specialist heading up a team looking into osteosarcoma, bone cancer for  children.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688507/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "Mr. BELL. Mr. Speaker, we are debating this bill because Donald Trump  is still trying to overturn an election that he lost 6 years ago. Some  in this body are helping him do it.\n\nThe SAVE America Act is built on the lie that the 2020 election…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699997/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…already been made public. The public has seen it.  I find it a profoundly offensive letter.\n\nAnd as I passed by a stack of newspapers today, I saw a series of  examples of Donald Trump's signature because Trump has said to the  world, ``That is not my signature.'' But, of course, the experts say  that is not true.\n\nThe birthday book contains another photo…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…excerpt from the actual story reads: California Governor Gavin  Newsom should be arrested.\n\nThis is something that President Trump said.\n\nThis is from the story:\n\nPresident Donald Trump said that he thought California       Governor Gavin Newsom should be arrested, a claim that Newsom       described as an unmistakable step toward authoritarianism.\n\nI concur…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692296/and-still-i-rise-denouncing-the-presidents-authoritar-ianism-and-recognizing-the-impeachment-warriors"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…jobs creation that the  Tax Cuts and Jobs Act are supposed to have, note that this is going to  add $7 trillion to our national debt. It will blow up our deficit. In  fact, Donald Trump is responsible for roughly 40 percent of the  national debt just in the 4 years in which he was in office.\n\nHe oversaw, of course, the worst jobs record of any President…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…House Foreign Affairs Committee, said that this  program was going to be restarted.\n\nElon Musk, when he was still in the administration before he had his  big break up with Donald Trump, even tweeted the name of the factory in  my district and said that they were going to get their funding.\n\nTime and time again when we have inquired with the administration,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694157/plumpynut-saves-lives"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Mr. Speaker, I rise to call attention to the brazen  firing of our respected Librarian of Congress, Dr. Carla Hayden.\n\nLast week, she was ruthlessly fired by President Donald J. Trump. Dr.  Hayden is a model public servant who led the Library with dignity and  professionalism for 8 years.\n\nDr. Hayden was the first professional librarian to oversee our…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691312/recognizing-dr-carla-hayden"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "Mr. WELCH. Mr. President, we are 1 year into President Donald Trump's  second term and 1 year into Secretary Kristi Noem's tenure as head of  the Department of Homeland Security, which includes Immigration and  Customs Enforcement, or ICE.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700023/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Oversight and Government Reform from Kentucky (Mr. Comer)  for yielding time.\n\nMr. Speaker, what we have heard today is a continuation of this lame  excuse of politics and on Donald Trump. The gentleman from California  did allude to it but really did not get into much more of the data.\n\nThe bottom line is from 9/30/20, 2/25/23, 6/30/23, 7/28/23, 3/22/24,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695616/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…government services it applies, together with the  change in culture in the United States away from the culture that we  have had that has allowed America to go so long.\n\nI thank Donald Trump and Kristi Noem.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698323/nations-arent-nations-without-borders"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…though, is  that Congress has abdicated their power--not just recently, not just  for this President. This is a bipartisan problem. I am a Republican. I  am a supporter of Donald Trump. But this is a bipartisan problem.\n\nI don't care if the President is a Republican or a Democrat. I don't  want to live under emergency rule. I don't want to live where my…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…crutch.\n\nThis is the kind of person the Republicans want to defend.\n\nEnrique Tarrio, a former national leader of the Proud Boys and a  domestic terrorist, was pardoned by Donald Trump.\n\nGuy Reffitt, somebody who brought a gun, zip ties, and body armor,  was pardoned by Donald Trump.\n\nNot only that, they have gone after their pardons, and they haven't…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691168/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…during an Oversight Committee  hearing featuring testimony from Michael Cohen.\n\nNow, who is Michael Cohen?\n\nMichael Cohen was the disgraced former attorney of President Donald  Trump.\n\nShe was asking input from Jeffrey Epstein on how to best question  Cohen, and Cohen was himself at that time a convicted felon from 2018.\n\nSo now that Republicans are…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696888/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Mr. Speaker, we are heading into what many people hope  is the finishing stretch of our legislature, putting through what  Donald Trump calls the big, beautiful bill.\n\nThere are a lot of issues yet to be decided, and I would like to  address some of those issues today.\n\nThe first issue I have talked about…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…growing  national security threat from Venezuela.\n\nHundreds of Americans die each day due to illegal drugs. Rather than  Democrats making it their life's mission to destroy Donald Trump,  America would be better served by Members of this Chamber if we helped  him prevent the flow of illicit drugs that are killing our citizens.\n\nMr. SELF. Mr. Speaker, I…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698450/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…produce, I just had some thoughts. My  first thought seems probably pretty basic, and it is to the Democrats  in the Chamber--specifically, their leadership.\n\nBreaking news: Donald Trump won the election. He is the President of  the United States. You don't have to like it, but he did. He won.\n\nWhat got me a little bit ramped up this morning was I started…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694711/9999"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…when America has a  competent and respected leader who understands the unique role that our  great Nation should fill on the world stage.\n\nI am grateful to have President Donald J. Trump back in the White  House with the strength and vision needed to be the leader of the free  world. One of the things I have admired most about the President is  that he…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699279/highlighting-republican-successes-in-2025"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…this issue. It has been a passion of  mine for the past 5 years, and I hope that we can finally get this  signed into law. Maybe we were waiting all along for President Donald  J. Trump's signature on this bill.\n\nI thank Chairman Comer for his support of this, and I urge my  colleagues to vote in favor of H.R. 3095.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…4,586       cases have been documented in 2024 and 2025, while Mexico has       confirmed 3,911 cases to date.\n\nAnd, on Jan. 17, 2025, just three days before President       Donald Trump assumed office, the Houston Health Department       reported two confirmed measles cases, marking the first case       in Texas since 2023. While left-leaning media outlets…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696063/texas-measles-outbreak"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…communities.\n\nOur Nation's prayers remain with all of these victims and with their  families and those that experience these tragedies.\n\nWe can all be grateful that, in Donald J. Trump, we have a President  who is committed to serving that justice when it is needed. Terrorism  will not have the last word.\n\nAnd we have seen how the FBI has worked to thwart…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…who have achieved  early career success and made a positive impact in their communities.\n\nToday, Bryan continues to serve our country as a Special Assistant to  President Donald J. Trump. In this role, he will continue to fight for  our America First agenda and the hardworking men and women of this  great Nation.\n\nAlthough Bryan has taken on new challenges,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697548/recognizing-and-expressing-gratitude-to-former-chief-of-staff-bryan-brody"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…watch their behavior. And they mean what they say. And don't be like  the people in the thirties that got it wrong. Israel is not going to  get it wrong the second time.\n\nDonald Trump. God bless President Donald J. Trump. I am so glad he  won. What has he tried to do? Make peace, not war. He gave the  Ayatollah 60 days to find a peaceful settlement regarding…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…country.\n\nLo and behold, we are advancing bipartisan work to address a  bipartisan problem that Democrats have very clearly identified. The  only difference now is that Donald Trump is in the White House instead  of Joe Biden.\n\nMr. ROY. Mr. Speaker, I thank the gentlewoman from North Carolina  (Ms. Foxx) for yielding additional time.\n\nMr. Speaker, again,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689708/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}]