[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…intended to maintain significant control over Venezuela's oil industry,  including by overseeing the sale of the country's production  indefinitely--indefinitely--and Donald Trump has promised to use the  revenue from these oil sales to create a fund that he would control. He  is literally meeting with oil executives on Friday to try to divide up  the spoils…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698678/venezuela"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…administration made clear that there is  another purpose for seizing the oil, and that is nation building.\n\nThis is the business we thought we were getting out of. Donald Trump  promised the country that he wasn't going to repeat the mistakes that  we made in the past in which we tried to impose our will on a foreign  country through military intervention…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…chaotic tariffs and save our economy, or will they  continue bending the knee to Donald Trump? That is the vote that we are  forcing tonight.\n\nWhen he ran for office, Donald Trump promised, over and over and  over, that he would lower costs on day one. Those were his words: Lower  costs on day one. In fact, he said after he was elected that it was one…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690534/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…democracy. So we will take to the floor and expose Donald  Trump as a disastrous President in his first 100 days. We ask America  to listen.\n\nOn the day he became President, Donald Trump promised a golden age  for America. Today, that seems laughable. Instead of a golden age, what  Americans have gotten is one of the most chaotic, corrupt, and harmful  starts…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690262/trump-administration-first-100-days"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Donald Trump has done to rising costs. After all, those tariffs have  raised prices across the board on groceries, on clothing, on energy.\n\nWhose tariffs are they? Donald Trump's.\n\nWho promised to bring costs down on day one and then turned around  and cut healthcare, cut SNAP benefits, closed rural hospitals, and axed  good-paying energy jobs in red and…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697574/department-of-defense"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…clear that I am going to take  my time and ensure that the American people fully understand how  damaging this bill will be to their quality of life.\n\nRepublicans and Donald Trump promised that costs would go down on day  one. Costs haven't gone down under Donald Trump and House Republicans  here in the United States of America. In fact, costs have gone…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…but his  Speaker of the House just blocked critical IVF expansion for military  families.\n\nThe American people overwhelmingly want to expand access to IVF. It  is what Donald Trump promised them as he was running for President last  year. I quote word for word: ``Under the Trump administration, we are  going to be paying for that treatment, or we are going…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697966/expanding-access-to-ivf-for-military-families"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…ongoing violation of human rights  and law by ICE. They have turned into thugs, and it has turned our  country, America, into a place that many of us don't recognize.\n\nDonald Trump promised to take violent criminals off the streets.  Instead, his immigration enforcement has become a campaign of cruelty  against peaceful people, tearing families apart,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Committee Minority, Nov. 2025]\n\nState-by-State Data: Annual Electricity Bills Up $100 Per Family in                                    2025\n\nLast year, President Donald Trump repeatedly promised that       energy bills across the country would be ``cut in half''       within 12 months. However, this new Joint Economic       Committee--Minority analysis…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…think  this is going to be seen very positively by the American people.\n\nNow let's talk about 1 month into the Trump administration. So, on  his first day in office, Donald Trump promised a golden age was coming  over the horizon. But when Donald Trump speaks tonight, his promise of  a golden age will feel like ancient history.\n\nSo this morning, let's…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…Heinrich's  resolution to terminate Donald Trump's Executive order declaring a  national energy emergency.\n\nI just want to start by being clear about what is going on here.  Donald Trump promised to gut our environmental laws if Big Oil CEOs  gave him a billion dollars for his campaign. He was quite open about  this. How could he do that? Well, he has figured…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688155/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "Ms. ESCOBAR. Mr. Speaker, Republicans spent the last 4 years telling  Americans to trust them on the economy, and Donald Trump promised to  lower costs for Americans on day one.\n\nMonths into this administration, with Republicans in complete  control, prices are up, inflation is up, joblessness is up,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689917/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…need--healthcare,  above all.\n\nDonald Trump and Republicans, meanwhile, have intentionally sent  people's costs up and up and up. The idea of reducing costs on day one,  which Donald Trump promised in the campaign and many people voted for  because of that promise, is out the window. No one is even paying any  attention to it. Donald Trump really is not paying…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698199/new-york"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Americans and exploding the debt and the  deficit at the same period of time.\n\nNothing has been done by this Republican-led Congress to lower the  high cost of living. Donald Trump promised that costs would go down on  day one. Costs have not gone down. They are going up. Inflation is on  the way up. Life has gotten more expensive. Electricity bills are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695292/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…of five of our law enforcement officers and the injuries to  approximately 140 others, many of whom are still paying the price for  that day.\n\nOn the campaign trail, Donald Trump promised that he would pardon  January 6 insurrectionists--but it still came as a shock when, on the  first day of his second Presidential term, he issued a blanket pardon…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688828/january-6-pardons"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…That  doesn't make me a progressive.\n\nIf the last election made anything clear, it is high costs and  economic pain are first and foremost on our constituents' minds.\n\nDonald Trump promised to help with that. He has not unequivocally. In  fact, everything he has done in office has helped his billionaire  cronies, who, by the way, gave hundreds of millions…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689084/economic-populism"}, {"senator": "James Risch", "party": "Republican", "sentence": "…iceberg. Everybody wants the same outcome and that is to have  peace in Ukraine.\n\nThere is one man on this planet--one man--that can make that happen,  and that is Donald J. Trump. He promised he would do that in the  election. He is making very significant strides in that regard.\n\nAnd to my good friend Senator Sanders, this is not helpful to the  activities…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688569/9999"}]