[{"senator": "Greg Stanton", "party": "Democrat", "sentence": "…and I served on the Phoenix City Council. She was a singularly talented  leader, brilliant and tough as nails, with the rare gift for bringing  people together. There is no doubt in my mind that if it were not for  that day, Gabby Giffords would be sitting in the United States Senate  right now or the Governor's office, maybe even the White House.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698819/fifteenth-anniversary-of-arizona-mass-shooting"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…foreign wars has begun a new one. A President who had decried  the use of force for regime change or to engage in nation building has  just committed our country to both.\n\nNo doubt Russia and China see opportunity in this American about- face, with Russia to indict Ukrainian leaders and to seize them and  with China to do the same in Taiwan. We are not…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698678/venezuela"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…According to reports, this next round of cancellations could involve  another 260 awards and $13 billion in revoked funds. Whether that  happens or not, I can tell you, without a doubt, that the harm done  from the first round will be irreparable.\n\nThe cancellations will mean lost jobs for Americans, lost educational  opportunities for students. It will mean…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…that meet the moment of this climate crisis, at least let  California protect Californians.\n\nI am realistic with the times that we are living in. Under this  administration, I doubt we will get the assist from the Federal  Government over the course of the next 3\\1/2\\ years.\n\nI want to acknowledge that it was former President Ronald Reagan,  when he was…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…Vought does not again have the legal  authority to pick and choose what projects to fund, robbing blue States  of funding and using Federal dollars for political retribution.\n\nNo doubt, there is a lot more I would have liked to do in these bills  to rein in an out-of-control administration. While I wish Republicans  would have been willing to do more on that…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…this bill is that it demands the study  not be done by the Department of Energy but by the National Petroleum  Council, an industry advisory body for Big Oil and Gas. I have no doubt  that the National Petroleum Council will produce a biased report that  will likely complain about every environmental regulation that they  don't like, but that protects the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…United  States. And so maybe more than any of the other reasons that people  should care about this plan to nation-build in Venezuela is that it is  just even more reason to doubt that this President is sincere at all  about doing what he said he was going to do, which is lower costs for  people.\n\nCosts are going up. Healthcare insurance is disappearing.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…terrible idea and that, in fact, the central  bank should issue currency, which is one of the reasons we are who we  are today. You might give the CBDC at least some benefit of the doubt  instead of being ignorant about whether we want to know the truth.\n\nWe need to stop this. We held this institution up for 2 days over a  bizarre MAGA obsession which is rooted…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693726/anti-cbdc-surveillance-state-act"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "…ourselves with tariffs. If we are interested in keeping the  cost to individuals down, then don't go to tariffs. There is a need for  balance here, and tariffs have a role. No doubt about it. The use of  tariffs being proposed by the President will raise costs and will not  enhance because the other elements that we need--a well-educated  society, infrastructure,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688232/democratic-proposals"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…lawlessness; it is a golden age for billionaires and  their club. It is not a golden age for Americans who work hard every  day to live an honest life to make ends meet. But I doubt we will hear  any of that from Donald Trump tonight.\n\nFinally, I am proud to welcome seven New Yorkers to tonight's joint  meeting of Congress. These New Yorkers are examples…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…clearest demonstrations of our strength and  resolve. The fact that this amendment has even been made in order  undermines us. Just giving this amendment airtime sows seeds of doubt  in Taiwan as to our support and further emboldens Beijing. This is not,  by any means, a serious amendment.\n\nIn this very same bill that we are debating, we are considering…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695235/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…we will deeply miss her at New Dems, I am so proud and excited  to see her step into  a new opportunity with Chairman Pete Aguilar and the House Democratic  Caucus. I have no doubt Emma will bring the same compassion,  professionalism, and excellence to the House Democratic Caucus that  made her so effective with the New Dems.\n\nEmma's tenure with the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695553/recognizing-emma-weir"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…fields, including field  hockey. I congratulate them on their State title there.\n\nThey have impressed the community with their art galleries and  theater performances. Without a doubt, they have excelled academically.\n\nThe students have left their mark on Loudoun Valley, and I look  forward to watching all that they accomplish in the future. Go Vikings.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…PADILLA. Mr. President, I rise today with my colleagues to make  very, very clear--not just to our Republican colleagues but to  history--exactly what is at stake. Let there be no doubt. Senate  Republicans are threatening to go nuclear on Senate procedure to gut  California's Clean Air Act waivers.\n\nBut this isn't just about California's climate policies,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…money by capturing       vessels that were sneaking stuff in and not paying duty,''       Abbass said. ``And yes, of course we were smugglers [in Rhode       Island]--there's no doubt about that.''\n\nCommanded by Lieutenant William Dudingston, a Scottish       naval officer, the Gaspee sailed into Narragansett Bay in       early 1772, seeking to enforce trade…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…this resolution. If anybody has a better alternative, they need to  bring it to a vote in both Houses this week. Otherwise, let us take a  little of Benjamin Franklin's advice, doubt a little of our own  infallibility, and get on with the work we were elected to do and upon  which the prosperity of our people and the future of our Nation  depends.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689900/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…reality is we don't have the guts, Mr. Speaker--to  sacrifice their own bottom line for the good of the country. I hope I  am surprised, and I hope that Congress takes action. I doubt we will,  seriously.\n\nMr. Speaker, we are public servants. We serve the people who we  represent. We aren't elected to come up to Washington and get rich  while our constituents…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691219/stock-trading-ban-for-members-of-congress"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…for this moment.\n\nThere has been a lot of talk, Mr. Speaker, made in this term of  Congress about the One Big Beautiful Bill Act. It is a historic piece  of legislation, no doubt. It is going to supercharge our economy. It is  jet fuel for our economy. They are the biggest tax cuts we have ever  seen in this country's history. Yet, I would argue, with…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693841/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…Coyotes in February 2022 demonstrates his exceptional skating skills,  his ability to deke defenders, and his knack for burying the puck in  the back of the net. There is no doubt in my mind that J.T. will do  everything in his power to ensure that the United States men's hockey  team brings home gold at the Olympics in Milan.\n\nI invite my colleagues…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699838/congratulating-jt-miller-on-his-selection-to-the-team-usa-hockey-roster-for-the-2026-winter-olympics"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…sure that our  citizens are safe throughout all of our jurisdictions. If there are  some abilities for some measures of flexibility, Florida has proven,  beyond a shadow of a doubt, that it knows how to keep its people safe,  which is very different with respect to the D.C. Council and with  respect to escalated crime here in the Nation's Capital.\n\nOur…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695561/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…sake. That will be in court. I will  have to prove that. I will make sure--and I will have that in just a  minute. There is a provision to change the law so that there is no  doubt that I and the eight others won't get a benefit from the  $500,000. It won't be personal. But we do want to proceed with our  case, and I want other people to proceed with…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699105/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…glimpse  into the life of a professional musician. Over 8 weeks, Sorren  rehearsed and performed with the Pittsburgh Symphony Orchestra, gaining  valuable experience. This, no doubt, will shape his bright future in  music education and conducting.\n\nThrough his dedication to the Brookfield orchestra, the PMEA  festivals, and the Venango Symphony, Sorren…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689957/recognizing-sorren-morelli"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…out in  response to some of the comments of my colleague from Maryland, I  wasn't here in 2004 during the debates that he cited over the original  LEOSA. I have no reason to doubt the accuracy of what he said, but I  would say this: It is now 20 years later, and I think that history has  shown us that many of the concerns presented in 2004 were not,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691241/leosa-reform-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…and law enforcement, Mr. Speaker, to  defend our sovereignty, protect our citizens, and secure our border  after years of neglect and lawlessness.\n\nWhile more work remains no doubt to rein in Washington's out-of- control spending and put our Nation on a more sustainable fiscal path,  I am confident that H.R. 1 will make America safe, strong, and  prosperous…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693192/one-big-beautiful-bill-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…does so  economically and efficiently, and it does so in a way that, honestly,  should make every member of the committee proud.\n\nThis is a difficult bill to bring forward, no doubt about that. Each  side has struggled with it over the years. I am very proud that the  ranking member and the chairman worked together to bring a bill to the  floor. That has…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699354/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…a list of lawmakers. I am grateful for the actions of  the brave law enforcement officers who ran toward the danger and saved  lives on the ball field that day and saved no doubt many lives in  Minnesota on that day just a few days ago.\n\nThis was a methodically planned attack on the people's right to be  governed by their duly-elected Representatives…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692853/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Jim's family, and God bless Molly and  his entire family.\n\nMr. Speaker, on the legislation that is before us, I know that my  colleagues on the other side of the aisle are, no doubt, about to  launch into how we have had an ineffective first 100 days and Congress  is not doing anything.\n\nLet me put in perspective for the American people what we are  focusing…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…backbone of our country. They  are the farmers, ranchers, teachers, and parents, and they are being  crushed by the costly and out-of-touch policies from Washington.\n\nThere is no doubt EV mandates only add further financial strain to  hardworking Americans, especially in my district.\n\nHave you seen an electric tractor, baler, or plow? I haven't because  they…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690386/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…again, the budget  is the first step in the process, not the last. Many of these  amendments will have the opportunity to be debated thoughtfully and ad  nauseam, I have no doubt, in the authorizing committees.\n\nThe Democrats are speaking fear, not facts. Saying something that is  false over and over again does not make it true. These amendments can…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Palmdale.\n\nFor those who don't know California geography, where are these  places? Neither is especially close to San Francisco or Los Angeles.\n\nLet's give him the benefit of the doubt. Let's assume this actually  happens. By 2045, we have Palmdale to Gilroy. There is no reason to  believe that will be true since every single other deadline has been  missed…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}]