[{"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…Republicans passed that bill and  the President signed it into law, 83 percent of the benefits went to  the top 1 percent, adding $2 trillion to the national debt. They are  doubling down on that, adding almost $4 trillion to the national debt  and saying: We have got to give all this money to billionaires and call  children waste, fraud, and abuse in…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691417/gop-tax-scam-hurts-everyone"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…try to lower people's healthcare costs.\n\nWhile they sat on their couch for 8 weeks, we were working. We  listened to people who told us their health insurance premiums are  doubling and tripling. We heard from people who don't understand why  you guys moved at the speed of light to give tax breaks to billionaires  but won't lift a damn finger to extend…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…for  yielding me the customary 30 minutes, and I yield myself such time as I  may consume.\n\nMr. Speaker, we are here today for a rule on two measures, two lousy  measures doubling down on the Republicans' agenda to help big banks and  big polluters.\n\nS.J. Res. 13 is a gift-wrapped giveaway to Wall Street, plain and  simple. It would make it easier for…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…the rich that gave 83 percent of  the benefits to the wealthiest people, the top 1 percent in our  country, and added $2 trillion to the national debt.\n\nThis year, they are doubling down on that, $4 trillion to the  national debt, and they call that fiscal sanity. They are doing it by  steering taxpayer dollars from Medicaid to give additional tax breaks…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688094/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…crisis.\n\nInstead of fixing any of this, President Trump's Executive order  makes it worse. Here is what his order actually does: hikes energy  costs for millions of Americans by doubling down on expensive fossil  fuels when it makes no economic sense, sends hundreds of thousands of  American jobs overseas as other countries continue to develop their  next-generation…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…promised it  would raise wages, pay for itself, and boost the economy. It didn't.\n\nInstead, it made the rich richer while working people fell further  behind.\n\nNow they are doubling down, making America sicker, poorer, and  hungrier just to funnel more money to their billionaire donors.\n\nThis isn't fiscal responsibility. It is economic cruelty. Vote…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688073/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…businesses who are  struggling to afford healthcare for 2026.\n\nI am thinking of the parents I have talked to who will drop coverage  for their families because their premiums are doubling and tripling,  the nonprofits who won't be able to cover employees anymore, the  manufacturer that is now paying more for health insurance than most of  their raw materials.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698696/supporting-families-and-small-businesses-struggling-to-afford-health-care"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…things  that are holding them back from living their best and most free life.\n\nThink about what he promised. On healthcare, our premiums have gone  up, for many Americans, doubling and tripling as of January 1; housing  prices, up; energy costs, up; jobs, down with cuts, particularly in  places like Michigan, in manufacturing. All the things he said…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698619/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…this  government shutdown is all about. It is about their bottom line, their  home budget, their healthcare, their insurance costs.\n\nIn my State--typical--people are seeing a doubling of their health  insurance premiums as of January 1 and, in some parts of my State,  tripling. In other parts of the country, it is even more. Why is this  happening? Because…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…talking about Venezuela. Venezuela isn't terribly  relevant for the people I represent, who are worried about an economy  that seems to be stagnant; healthcare premiums that are doubling,  tripling for many people in my State; prices that are going up on all  the stuff that you need to afford to live. And, all of a sudden, the  President is talking only about…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…they are MAHA-- Make America Healthy Again--and then immediately cutting kids' access  to fresh, healthy fruits and vegetables.\n\nI love this doctor. It is almost like you are doubling down on the  injury to our children. We are cheapening highly processed and sugar- filled, nutritionally empty foods, denying access to fresh, healthy  fruits and vegetables,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the shelves in the  grocery store because they can't afford them. Parents can't go back to  work because they can't afford childcare. People's health insurance  premiums are doubling and tripling because this majority has failed to  act.\n\nDuring election season, we heard from Trump and Republicans who swore  up and down they would bring down prices. They…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696904/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…even catch the wind that they can  actually try to figure out and have meetings and say: Hey, wait a  minute, what can we do about this?\n\nThat is because their prices are doubling across our State and  region.  Families notice the increase. One constituent even told me that her  family's bill increased from $230 a month to $494 in July. That is a  huge…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700228/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…hubs, like Hong  Kong and Shanghai, is not just one set of regulations. It is the  transparency and openness of our capital markets, and transparency  strengthens markets.\n\nBy doubling down on our strengths, this bill will further cement our  competitive lead and aid investors along the way.\n\nMr. Speaker, I call on my colleagues to support my legislation.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693912/enhancing-multi-class-share-disclosures-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…skyrocketed  because of Republican inaction and indifference.\n\nWhen I was home during the holidays, all I heard from my constituents  was that their healthcare premiums were doubling and tripling in the  State of New Jersey.\n\nThis bill is a godsend. I am not exaggerating. This bill is a godsend  for people who are concerned that they are not going to have…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698589/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…behind these microphones and actually talk about things that are truly  terrifying?\n\nAre we really going to avoid dealing with our actual jobs? Are we  going to allow the doubling of senior poverty in America in 7 years at  the same time we are bankrupting much of the medical system?\n\nIn 7 years, grandma gets a 24 percent cut in her check and our model…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…healthcare dollars. It is not a  radical concept. It is how markets work. It is how innovation happens.  It is how costs come down.\n\nThe choice is simple. We can continue doubling down on a failing  system that promises coverage but little care, or we can offer  Americans a new path, one grounded in freedom, responsibility, and  trust in the people…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…receipts from FICA taxes don't match the checks going  out the door.\n\nHere is the punch line. It took us 240 years to get to that $28  trillion. We are basically talking about doubling it in 10 years. The  publicly held debt is not exact, but it is close. It is math I can do  in my head. We are talking about almost doubling the publicly held debt  in the…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…appropriations bills. As a consequence, the looting of the American  taxpayer continues.\n\nBy promising yet another so-called clean continuing resolution,  Republicans are doubling down on embracing what they once considered to  be reckless spending levels.\n\nToday, I propose a clear path back towards fiscal responsibility. I  urge the Senate to adopt…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…provisions could have been repealed in 2021 and 2022, when Democrats  had the White House, House, and Senate. None of them were because  Democrats recognized deep down that doubling the child tax credit,  doubling the standard deduction, encouraging increased wage growth  without the inflation that came from the American Rescue Plan, which we  saw the…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…America.  President Trump has provided for an all-of-the-above energy policy  which will create jobs.\n\nIt is also encouraging that Boeing Aircraft Company in Charleston is  doubling its size. It has already been announced that there was the  sale of $39 billion of 787-10 jets to Saudi, Arabia, as Saudi Arabia is  developing a new airline, Riyadh Airways,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…debate over       whether--and how--it should be extended and reformed. A       failure to extend AGOA could have larger ramifications at a       time when the United States is doubling down on its       commercial diplomacy--and more specifically, its mineral       diplomacy efforts--with Africa.\n\nQ1: What is the strategic role of AGOA nations in reshaping…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…average  of nearly $11 million per year to support wetland and waterfowl  conservation across North America. That funding is leveraged by  nonprofit and State partners, often doubling or tripling the Federal  investment, delivering high-impact results.\n\nThis bill is about safeguarding that model. It is about making sure  that the dollars contributed by…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693492/wetlands-conservation-and-access-improvement-act-of-2025"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…budget resolution unlocks the next step in the reconciliation  process to deliver on our priorities. That includes extending key  provisions of the Tax Cuts and Jobs Act, like doubling the standard  deduction, expanding the child tax credit, and maintaining the death  tax exemption. These policies make a real difference for working  families, farmers, and…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688025/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…place. We didn't hear a peep from our  colleagues then. In fact, many of them advocated for keeping those  tariffs and embraced the Biden decision.\n\nPresident Trump is simply doubling down on that successful approach.  It seems the deciding factor for Democrats' newfound opposition is  grounded in Trump derangement syndrome.\n\nMs. FOXX. Mr. Speaker, I also…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699311/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…best tax  benefit. It is the wealthy folks who itemize, for the most part. Right  there, we are already targeting middle- and lower-income Americans.\n\nThe second piece is doubling the child tax credit. In 2017,  Republicans doubled the child tax credit from $1,000 to $2,000. That is  something that has been incredibly bipartisan. Democrats, in their…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…7 years, the math right now says a 24 percent cut.\n\nIn 7 years, we double senior poverty in America. In 7 years, the math  says: You are going to start to see baby boomers doubling homelessness.  In 7 years, the Medicare trust fund is empty. Hospitals right now and  others who are part of the Medicare part A cash flow take about 11  percent cuts. In…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…actually just  try to get the most basic facts correct here.\n\nMr. SCHWEIKERT. Madam Chair, apparently, the Democratic position is  the $2,000 you get per child, which was the doubling of the child tax  credit in 2017, should go away and go back to the $1,000? Wow. I think  that is what I just heard.\n\nThose of us who have adopted kids, those who have children,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…small business owners at a Sanpete County  Chamber of Commerce to talk about what this bill means to Main Street.  From making the small business tax deductions permanent to doubling  expensing for equipment, this bill gives Utah entrepreneurs the freedom  to grow, hire, and thrive.\n\nOver 70,000 small businesses stand to benefit. With our Rural  Advisory…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694790/promises-made-promises-kept"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…exponentially over the past several years. In fact, in 2022, the  Treasury Department's Financial Crimes Enforcement Network reported  over 680,000 instances of check fraud, doubling the previous year's  total. In such an environment, it is unacceptable that at this moment  the IRS does not have processes and procedures in place for taxpayers  to request…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689291/recovery-of-stolen-checks-act"}]