[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…cost families an average of $4,700 annually? Is it that  CEOs and business owners are warning about rising costs, empty shelves,  and an economic downturn? Maybe it is that the Dow Jones is on track  for its worst April since 1932.\n\nThe truth is, Donald Trump's Presidency is no golden age; it is a  disaster--the worst start to a new administration in modern…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690262/trump-administration-first-100-days"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…has been created since he announced we were going into a trade war  with virtually every nation on Earth--they watched carefully as the  stock market reacted to it today.\n\nThe Dow Jones Average, which is supposed to be an indicator of the  state of the economy, lost 4 percent of its value today. I don't know  what that means for most people, but I know…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689510/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "Ms. JAYAPAL. Mr. Speaker, I rise today to recognize and honor Dow  Constantine, who is stepping down after 16 years of service as King  County Executive. Throughout his tenure, Dow has been a transformative  leader, driving significant progress…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691034/recognizing-the-contributions-of-dow-constantine"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…this Congress, led by Mr.  Trump's party, grabs the steering wheel and listens to the people who  are out there on the front lines of our economy and says: Stop. Enough.\n\nThe Dow tanked on Friday, dropping 700 points. Futures opened today  down 400 points. The warning lights are everywhere. Liberation day is  just going to worsen the situation that we…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689376/cost-of-living-still-high"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…many workers have  worked so hard to achieve is being undermined, as I speak.\n\nNow, today's news that the stock market took a major nosedive across  the board is serious. The Dow is down 900 points, the worst market  outcome of this year. But it isn't just this year. If you look back,  the plummet that happened today is not pretty. Perhaps the President…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688734/americans-are-in-for-a-rough-ride"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…enemies are applauding.\n\nCongress needs to act to rein in this chaos. Trump tariffs of this  magnitude equate to new taxes on everything the American people buy or  own. Today, the Dow Jones and Standard & Poor's continued their  nosedive with the worst 3-day performance in nearly a half a century.\n\nThese are not just numbers. They represent people losing…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689621/quelling-us-financial-markets"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…coordinate       with you to determine whether the national security threats       posed by this project can be adequately mitigated.\n\nIn November 2025, the Department of War (DoW) completed an       additional assessment regarding the national security       implications of offshore wind projects, and provided senior       leadership at the Department…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…and  staff can thrive.\n\nThis achievement reflects the collective teamwork at Mary Lee Clark  Elementary where everyone works together to ensure student success.\n\nPrincipal Rika Dow has praised Marlon for his unwavering dedication  and innovative approach, making him a model for others to follow.\n\nOn behalf of the community and as his Congressman, I commend…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "John Thune", "party": "Republican", "sentence": "…He was 25 years old. Lieutenant Earl Ferguson, from  Philip, who died when his B-24 bomber was shot down while targeting an  oilfield in Romania. He was 26. And Private Glenn Dow, from Sioux  Falls, who was killed on Omaha Beach on D-Day. Private Dow was 19.\n\nThese men gave their entire lives to defend our freedom and secure  peace for us. They entrusted…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691674/memorial-day"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Farnoush: Associated Press;       Anastacio, Nicholas: National Journal; Anderson, Zachary: USA       Today; Andrea, Lawrence: USA Today; Andrews, Natalie: Wall       Street Journal/Dow Jones; Anglin, Tara: New York Times;       Aoyama, Ryo: Asahi Shimbun; Appelbaum, Binyamin: New York       Times; Appleby, Julie: KFF Health News; Aratani, Lori:       Washington…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}]