[{"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…my mother was working and then had the chance to work at  other schools as the schools integrated.\n\nI knew that the connection was the civil rights movement that was led  by Dr. Martin Luther King, and Dr. Martin Luther King had preached at  that gymnasium at the Booker T. Washington High School a few years  earlier. I was probably too young to remember…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699200/building-a-beloved-community"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Barbara E. Swan; Bonnie Harris; Carmen       Bolt; Cassandra Lyons; Cassaundra Coleman; Catherine Quinn;       Christian Constantine; Crystal Jones Nieves; David J.       Cynamon; Dr. Kirstin A. Morgan; Elisa Ortiz; Elizabeth Field;       Emily Karandy; Erin Eife; Fabian Lucero, Esq.\n\nGabby Mulnick Majewski; Gabriel Goldberg; George Derek       Musgrove;…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696958/opposition-letter-led-by-tzedek-dc-on-the-district-of-columbia-cash-bail-reform-act-of-2025-hr-november-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…that was content to let these lifesaving tax  credits expire until Democrats had to force them to vote on a clean 3- year extension. That is the shame and the sham of it all.\n\nDr. King once profoundly said: ``Of all the forms of inequality,  injustice in health is the most shocking and inhumane because it often  results in physical death.'' His words…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698836/aca-tax-credits-extension"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Angelica.\n\nMrs. RAMIREZ. Mr. Speaker, I rise to commemorate Women's History  Month and to celebrate the rich contributions of Ukrainians in  Illinois-03 by uplifting my constituent, Dr. Mariya Dmytriv-Kapeniak,  for her work to honor our shared humanity.\n\nA family medicine doctor, Dr. Dmytriv-Kapeniak exemplifies putting  together our vocation into service…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688474/womens-history-month"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "Ms. McBRIDE. Mr. Speaker, I rise today to congratulate Lieutenant  Colonel Chaplain Reverend Dr. A'Shellarien Addison on her recent  promotion at the Delaware Army National Guard.\n\nEarlier this month, I was honored to attend her promotion ceremony  and celebrate her historic…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699001/recognizing-ashellarien-addison"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…Speaker, I rise in strong support of H.R. 6504, the  Haiti Economic Lift Program Extension Act.\n\nFirst, as all have done, I thank the distinguished gentleman from  North Carolina, Dr. Murphy, for his leadership in bringing this bill to  the floor and for his partnership because we worked closely together to  try to make sure that Haiti is given an opportunity…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698851/haiti-economic-lift-program-extension-act"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…Undignified Praise,  Pastor Chris serves as Director of EMERGE, the Next Generation  Department of the National Baptist Convention of America, Incorporated,  under the leadership of Dr. Samuel C. Tolbert. He also serves in  various community leadership and service roles, including work with the  Fellowship of Christian Athletes, and other organizations committed…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699828/recognizing-pastor-christopher-chris-k-wesley-on-six-years-of-servant-leadership"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "Ms. TORRES of California. Mr. Speaker, I rise today to recognize the  75th birthday of Dr. Huu Vo and his 50 years of service to the Inland  Empire, our Nation, and beyond.\n\nDr. Vo has led a life of service to his community. He was born on  April 4, 1950, in Hue,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691324/recognizing-dr-huu-vo"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…bilateral relationship between our countries       and advance our Alliance collaboration at a critical       strategic moment. He is a much-valued friend of Australia.\n\nH.E. Dr. Kevin Rudd AC, Australia's Ambassador to the       United States.\n\nAs Phil departs, it can truly be said that his work here on Capitol  Hill made a difference, and over time…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699522/9999"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Dr. Kiara  Kuenzler of Denver, Colorado for being named the Nexstar 2025  Remarkable Woman of Denver.\n\nDuring her 7-year tenure as President and CEO, Dr. Kuenzler  positioned the…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692052/recognizing-dr-kiara-kuenzler"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…perhaps in the newer generations don't understand  what Russia is capable of, so I refer them to two books if they are  interested, and I hope they are. One is ``Bloodlands'' by Dr. Timothy  Snyder, now at Yale University, who discusses the history of the region  that we are talking about and what happened yesterday at the United  Nations. Another book…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687991/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Dr. Angela  ``Angie'' Paccione for her service to constituents in Colorado as  Executive Director of the Colorado Department of Higher Education  (CDHE).\n\nDr. Paccione has been…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698659/recognizing-dr-angela-angie-paccione"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Robinson, Jr. Secondary School\n\nBrigadier General Charles Young Military Leadership Award:       Major Justin Brown, Engineer, U.S. Army Reserves\n\nCitizen of the Year Award: Dr. Mamie Parker, PhD\n\nDr. Ronald E. McNair Award for Excellence in Aerospace and       the Arts: Imani C.O. Nzekwe, Thomas A. Edison High School\n\nDr. Charles R. Drew Award for…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697131/recognizing-omicron-kappa-kappa-chapter-of-omega-psi-phi-fraternity-inc-for-its-achievement-week-and-honorees"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…This tweet, Mr. Speaker, indicated, in essence, that this is the time  for all persons of good will to take a stand against violence and that  persons should do this because Dr. King was right, and his words are  right today:\n\n``We must all learn to live together as brothers,'' he said. I would  add: and sisters.\n\nWe must all learn to live together…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…with youth specialists. These resources restore dignity and  stability, ensuring that every student has the opportunity to thrive.\n\nI want to especially recognize Superintendent Dr. Alejandro Ruvalcaba  for his outstanding leadership in overseeing this project. His  dedication, and the dedication of the entire district, has made this  Center a reality and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695914/congratulating-the-moreno-valley-unified-school-district-health-and-wellness-center"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…going to make this criminal because it is a  criminal act that is being done on the most vulnerable people in our  society.\n\nI point to a longitudinal study that was done by a Dr. Zucker years  and years ago in Canada. They took minors who were looking at  transitioning and actually gave them mental health counseling. By the  end of that, at the age of…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698346/protect-childrens-innocence-act"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…new cures  and therapies for ALS.\n\nWe will never forget Alex and Jaci, and we will continue to fight to  find a cure for this tragic disease.                     congratulating dr. wendy wintersteen\n\nMr. FEENSTRA. Mr. Speaker, I rise today to congratulate my friend,  Dr. Wendy Wintersteen, on announcing her retirement as president of  Iowa State University.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691604/als-awareness-month"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…entity at Redstone Arsenal in Huntsville,  Alabama, the prototype integration facility, also known as the PIF.\n\nI would be remiss if I didn't mention this facility is named after  Dr. Larry O. Daniel, the beloved late grandfather of one of my district  staffers.\n\nOperating out of the DEVCOM Aviation and Missile Center, the PIF has  been the Army's premier…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691922/9999"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Mr. BEAN of Florida. Mr. Speaker, I rise to celebrate a milestone  that truly brings a smile. This week, Dr. William Stewart Mitchell III  of Fleming Island, Florida, marks his 100th birthday, a century defined  by faith, family, and devoted service to our Nation.\n\nDr. Mitchell graduated…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698093/9999"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…most dedicated  grassroots movement in America, 97 Milk, including the leadership of  Bernie Morrissey and Sherry Bunting, Nelson Troutman, Krista Byler,  Christine Ebersole, Dr. Edward Silverman, and a host of parents and  dairy farmers. I thank each and every one of these individuals who  put their mark on this bill in a meaningful way.\n\nI encourage…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698178/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "Mr. BUCHANAN. Mr. Speaker, I rise to recognize Dr. John Cross, who  just delivered this morning's opening prayer.\n\nJohn is the senior pastor of First Baptist Church of Sarasota and has  been the pastor for many, many years.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691358/welcoming-dr-john-cross"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…consideration of this       legislation.            Respectfully,      Susie Hughes,\n\nExecutive Director, International Coalition to End       Transplant Abuse in China.      Dr. Katrina Lantos Swett,\n\nPresident, Lantos Foundation.      Kristina Olney,\n\nExecutive Director, The Remembrance Society.      Dr. Ellen Kennedy,\n\nExecutive Director, World Without…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…support and strengthen small businesses  in the Pueblo community.\n\nI congratulate this year's awardees: Caitlin Alcon, for the Victor  Navarro Outstanding Board Member of the Year; Dr. Chato Hazelbaker for  the Gil Sanchez Outstanding Professional of the Year; Pueblo City- County Library District, for the Lorraine K. Salas Outstanding  Community Partner of…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700094/congratulating-the-latino-chamber-of-commerce-of-pueblo-dinner-dance-awardees"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to recognize Dr. Tim  Connelly, an internal medicine physician at Memorial Health University  Medical Center, who has been named the 2025 Physician Hero Award  recipient by the Georgia Hospital…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699008/dr-tim-connelly-receives-2025-georgia-physician-hero-award"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "Mr. ROGERS of Alabama. Mr. Speaker, I rise to recognize and honor Dr.  Ken Bodiford. Dr. Bodiford served as Director of Bands at my alma  mater, Jacksonville State University. During his 32-year tenure, he  transformed the Marching Southerners…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696619/recognizing-dr-kenneth-g-ken-bodiford-for-his-extraordinary-service-to-jacksonville-state-university-and-the-field-of-music-education"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…all comes from our own civil rights  movement, a time when America confronted its deepest flaws, yet emerged  stronger, more just, and more faithful to its founding ideals.\n\nDr. Martin Luther King, Jr., once said: ``The arc of the moral  universe is long, but it bends toward justice.''\n\nThat arc bends when brave people stand up. It bends when people…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…and textile imports  from Haiti.\n\nHaiti has endured years of profound hardship, political instability,  economic collapse, and repeated natural disasters. As our bill author,  Dr. Murphy, shares from his time serving as a medical missionary in  Haiti, these trade programs represent an economic lifeline that  supports tens of thousands of jobs and sustain…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698853/haiti-economic-lift-program-extension-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…organization that has made a profound and enduring impact on  communities in Pennsylvania and across our Nation.\n\nThe Foundation carries forward the extraordinary legacy of Dr. Philip  Jaisohn. He was a visionary leader, physician, journalist, educator,  and the first Korean-born naturalized citizen of the United States. Dr.  Jaisohn dedicated his…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696635/recognizing-the-50th-anniversary-of-the-philip-jaisohn-memorial-foundation"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…now, I truly understand the need for this position to be  filled immediately, and we are fortunate that President Trump nominated  a highly qualified individual for this role.\n\nDr. Casey Mulligan's unique mix of academic success and real-world  small business experience makes him the best candidate for the job. A  Harvard graduate, Dr. Mulligan received…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690896/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "Mr. MOORE of Alabama. Mr. Speaker, today, I rise to recognize the  inauguration of the Sixth President of the University of Mobile, Dr.  Charles Smith, who was unanimously elected to be inaugurated on May 1st  and has taken charge of leading the university.\n\nDr. Smith was born and raised in Montgomery before…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691962/recognizing-dr-charles-smith"}]