[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…executive branch does not deprive Congress  of its vital role in approving the use of force, but such a list kept  hidden from the American people, if used as a justification, may drag  our Nation into an unintended war.\n\nIf it were as simple for a President--any President--to claim that  war power for himself by placing an individual or a group of  individuals…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…make life even more expensive for  everybody back home.\n\nCongress is not a rubberstamp. It should not be a rubberstamp. The  Constitution does not give one man the power to drag this country into  another war on a whim.\n\nDe-escalate. Get serious about diplomacy. Tell the truth. If the  President thinks he needs a war, then he can come to the people's…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700195/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Columbia's right to self-govern       and on decades of evidence-based progress in public safety.       Far from addressing genuine community needs, these proposals       would drag the District backward into punitive ``tough on       crime'' strategies that have already devastated Black and       Brown communities nationwide while failing to make anyone…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Noem must resign. That is what you do with $75  billion? You put bounties on legal citizens? You break out windows of  people with disabilities who are born in this country and drag them to  a detention center? That is what you do with $75 billion of taxpayer  money?\n\nYou take Hmong elders and throw them out of their house in their  underwear with their…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…number of working families losing healthcare.  What is worse is that you are fooling yourselves into believing it is  paid for. Instead, it adds trillions to our debt that will drag down  our economy and our credibility.\n\nRather than negotiating with Democrats, Republicans are just  placating the President.\n\nI am voting ``no,'' Mr. Speaker, on this partisan…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693168/one-big-beautiful-bill-act"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…factories without clear  authority or regard for court orders, they send a message to everyone  that their rights are conditional.\n\nWhen agents run into a daycare center and drag out a teacher in front  of the children and parents, they are not following the law. They are  using gestapo tactics.\n\nNone of this is about public safety. More than 4,000 people…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697451/fighting-dhs-immigration-raids"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…401(k)s. The turmoil in the market driven by tariff uncertainty  is hammering retirees more than just about any other group of people in  this country.\n\nThe new sales tax is also a drag on economic growth--we saw this in  the announcement this morning--but not just economic growth in the  United States. I am on the Armed Services Committee, and I had a chance…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…vengeance.\n\nPresident Trump is firing public servants, slashing critical  programs, and enacting chaotic tariffs that will raise costs. This  chaotic administration is trying to drag us into a recession. Instead  of stopping it, congressional Republicans are acting as willing  accomplices.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689893/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…Democrats on the other side. But they knew, having watched  the course of human history, that Executives--in their day, mostly all  Monarchs and Kings--had all sorts of reasons to drag their Nation into  war. Power often came from war, the funding that could be raised for  war, the loyalty commanded by war, the glory that occasionally came to  the leader,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693125/motion-to-discharge-sj-res-59"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Rubio and Hegseth on the  administration's recent military action in the Caribbean. I wanted to  know: What are their plans? How far are they going? Is Donald Trump  about to drag America into another endless war?\n\nAnd again, I didn't get any satisfying answers.\n\nWhen it comes to matters of war and peace, Congress needs the truth;  the American people…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697769/caribbean-boat-strike"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…legislation to  help diversify clinical trials so medical breakthroughs can reach the  patients who need treatment the most.\n\nPresident Trump's agenda, however, is determined to drag us backward.  He has declared an end to so-called woke research and programs. These  programs are meant to help women, veterans, Black people, members of  the LGBTQ+ community,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690242/health-disparities-in-minority-communities"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…``no'' on the previous question.\n\nMr. Speaker, shortly on the floor, Republicans are about to finally  bring up the Massie-Khanna bill to release the Epstein files. We had to  drag this leadership here kicking and screaming.\n\nI appreciate their sudden and stunning change of heart on this issue,  but I state for the record that the Republican leadership…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696904/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…appropriated by Congress. Since  then, despite saying all the right things, that the funding is going to  be restored, that the shipments are going to start again, they continue  to drag their feet.\n\nEdesia Nutrition, in my district, manufactures some of that food aid  designed to help starving children get back to health. After 8 months,  thousands of boxes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694817/restoring-food-aid"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…America, Trump says that he  will run Venezuela.\n\nUnwilling to provide help to Americans facing soaring health  premiums, he offers new tax subsidies to Big Oil.\n\nLong eager to drag America back to the ugly glory days of White  nationalism under his hero, President William McKinley, Trump now is  apparently going to make imperialism great again, also.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698602/war-for-oil"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…2 weeks old when your  father was taken by ICE. In the precious days he spent with you, he  cared for you  with so much love and devotion. I am heartbroken that as the days drag  on you are missing out on his voice soothing you, his arms cradling you  back to sleep. There is no doubt he loves you deeply. His absence has  nothing to do with you.\n\nInstead,…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700186/state-of-our-union-is-traumatizing-our-children"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…transgender, intersex, and queer global movements. I don't  know what those global movements are. I think they can do that without  taxpayer money. Then, of course, there was funding drag shows in  Ecuador.\n\nThe list goes on and on, Mr. Speaker.\n\nLet's finally get control over waste, fraud, and abuse. We started it  in the One Big Beautiful Bill Act. We are continuing…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693719/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…Mr. Speaker, this hypocrisy is evident in the message coming from  congressional Democrats. Earlier this month, Chuck Schumer stated that  President Trump ``seems content to drag our country . . . into an  endless war with no plan, no transparency, and nothing but wishful  thinking.'' Nothing could be further from the truth.\n\nOperation Absolute Resolve…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699371/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "…Secretary Hegseth have taken office, the woke  infiltration of our military, even its highest leaders, continues to be  exposed.\n\nThe embarrassment of these flags is hard to grasp: drag shows on  ships and military installations; base security training teaching  guards that pro-life bumper stickers were indicators of possible  terrorism; and taxpayer-funded…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695264/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…inaugural address, when President Trump said:\n\n[W]e will measure our success by the wars we never get       into.\n\nPresident Trump, do not allow the warmongers in Washington to drag  you into an unnecessary war of choice. Washington has spent decades,  trillions of dollars, and thousands of lives trying to remake other  countries in our image. The American…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "John Thune", "party": "Republican", "sentence": "…floor.\n\nThe American people gave President Trump a mandate, and he deserves  to have his team in place to execute that mandate for the American  people. Democrats can continue to drag this process out, but  Republicans are going to get these nominees confirmed.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693870/trump-administration"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…knows this person is going to be voted on and is  going to be approved because there is such wide bipartisan support, but  for my Democratic colleagues to say: Nope, we want to drag this out for  weeks, I just don't think it is the right thing to do. Clearly, they  disagree, but I don't think it is the right thing to do.                  30th Anniversary…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690112/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…system that actually they get rewarded for helping populations be  healthier and the technology they are using to do it.\n\nThe fact of the matter is that we are finally trying to drag the  conversation around this place from being financial engineering is the  future of healthcare, ``Let's subsidize more populations,'' even though  I am going to show you…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…congratulate them for standing strong.\n\nI have always wondered: Where were the Republican men during this  battle?\n\nWe have taken 5 months. These three women and I have had to drag our  party to this floor today to even vote on this.\n\nRo Khanna is the most to be thanked here. In an extraordinary display  of bipartisanship, he did not hesitate when I asked…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696903/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "James Risch", "party": "Republican", "sentence": "…is a 500 lb JDAM, consisting of a KMU-572       tail kit and BLU-111 or MK-82 bomb body.\n\n4. The MK-82 general purpose (GP) bomb is a 500 lb, free-      fall, unguided, low-drag weapon. The MK-82 is designed for       soft, fragment-sensitive targets and is not intended for hard       targets or penetrations. The explosive filling is usually       tritonal,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696967/arms-sales-notification"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…President Kennedy warned:  ``The largest single barrier to full employment of our manpower and  resources and to a higher rate of economic growth is the  unrealistically heavy drag of Federal income taxes on private  purchasing power, initiative, and incentive.''\n\nIndeed, I have little doubt that President Kennedy would be a big fan  of the big, beautiful…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693226/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…President Trump's peace deal.\n\nSo this is a pivotal week. I look forward to the President's  decision. I would remind him and my fellow colleagues: Putin cannot be  allowed to drag the United States along.\n\nThe U.S. Senate is ready to back President Trump as he stands up to  Putin, on a bipartisan basis; 50 Senators--25 Republicans and 25  Democrats--recently…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690223/ukraine"}, {"senator": "James Risch", "party": "Republican", "sentence": "…used by the United States Navy, Marine       Corps, and Air Force, as well as foreign partners. The MK 83       series is used for unguided delivery in either low or high       drag mode, or guided delivery when a guidance kit is       attached. It is designed for soft, fragment-sensitive targets       and is not intended for hard targets or penetrations.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "John Thune", "party": "Republican", "sentence": "…President  Trump in his first term in office.\n\nAnd as I said, this is serving no one, nor is this going to prevent  the President's nominees from getting confirmed. Democrats can drag out  nominations all they want, but we are going to fill out the President's  administration and ensure that his nominees get into place so that they  can do their job and that…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690974/business-before-the-senate"}]