[{"senator": "Ro Khanna", "party": "Democrat", "sentence": "Mr. KHANNA. Mr. Speaker, President Trump campaigned around the  country to drain the swamp. Yet, one of the first things he did was to  reverse President Biden's executive order that banned White House  officials from accepting gifts from lobbyists.\n\nToday,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688124/ban-on-acceptance-of-gifts-from-lobbyists"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…This is not about making government more efficient.  In fact, they want to replace many of these jobs with loyalists, even  setting up loyalty tests. They are driving a brain drain in our Federal  Government by choosing loyalty to the President over merit and  competence, creating less efficiency and more waste, fraud, and abuse,  and opportunities for…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692238/backlog-in-irs"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Donald Trump stormed into office on the promise to lower  costs, to fight for ordinary Americans, to unrig a rigged system. He  ran, in other words, as a populist who promised to drain the swamp and  end inflation.\n\nBut Donald Trump is not a populist; he is a posturer. He throws out  these populist ideas to try to persuade people he is on their side, but…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…clarity, and respect. But across agencies, this  administration continues to blindly and abruptly fire Federal workers.  What do we have to show for it? A complete and total brain drain.\n\nWe are losing talent and expertise in our Federal Government, all  while the administration prioritizes tax cuts and handouts to the  biggest corporations.\n\nTo my constituents…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694177/demanding-answers"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…and flaring to meet the energy demand of 14 million households  every year. In other words, the oil and gas industry is throwing $2  billion worth of American energy down the drain every year, which  Americans then have to pay for.\n\nThat wasted methane has grave consequences for our environment and  for public health. Methane is an extremely dangerous…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "…so  many young people who today are able to achieve that education and  power our economy in California, which powers the United States'  economy, just leaves us with a brain drain that will keep us from being  competitive with other nations.\n\nWhy is this happening?\n\nIt is just to pad the pockets of the wealthiest Americans, the same  people who don't…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688232/democratic-proposals"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Here is the way you should think about it. We need big electrical  generating facilities all across the country. Everyone knows right now  that AI is now going to be a huge drain on all of the electricity that  we have in our country. So how do we handle that problem? Well, one of  the ways of handling that problem is to say that refrigerators have…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690527/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…that neither the American people nor the elected representatives whom  they sent here to Washington have authorized and one that risks yet  another endless conflict that will drain our coffers and cost American  lives.\n\nPresident Trump took military action against Venezuela without the  express consent of Congress. The Constitution is clear: The power…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698823/9999"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…cuts. They have seen harassment, intimidation, and firings. They  are losing the ability to help Americans stay safe and healthy.\n\nWhat is happening is that there is a brain drain of science and  technology innovators in our country because of these cuts. One of my  constituents is a graduate student in astrophysics. She  is pretty smart. Their research…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691395/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…it now  costs more than his rent.\n\nHere is a fact. When people lose health insurance, the consequences  are real, and they are devastating. Medical debt piles up. Families  drain their savings. They face bankruptcy.\n\nUntreated illnesses force workers out of their jobs. When people lose  their coverage, it affects all of us. Hospitals are strained.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Ms. JOHNSON of Texas. Mr. Speaker, I rise today to sound an alarm on  a crisis threatening America's future. I am talking about the Trump  brain drain.\n\nDonald Trump and Republicans in this House are launching a full scale  assault on our Nation's ability to think, learn, and to innovate.\n\nLet's look at the facts. Trump's…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692286/sounding-the-alarm-on-a-crisis-threatening-americas-future"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…indefinitely.\n\nIt seems there are no exceptions to this ban. It is just a straight- up ban, and the reason seems kind of flimsy, to be honest. It is  apparently because they are a drain on our social system. I will just  say that the only drain on our social system has been Congress, with  cuts to Medicaid and SNAP.\n\nIn any case, I would love to see the math…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699204/ongoing-protests-in-iran"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Medicaid. Health costs will go up.\n\nIf you fire half the people who administer Social Security and  undermine it for our seniors, costs will go up. If you continue the  brain drain in our government and fire Federal workers who protect  consumers or do critical safety or health research, you will make us  less safe and costs will go up.\n\nMr. Speaker,…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688637/the-actions-of-this-administration-will-actually-raise-costs-for-every-american"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…district, it also impacts our number one economy, which is healthcare  systems and hospitals.\n\nAdditionally, I introduced legislation to crack down on junk fees  that would drain family budgets, and I have worked in a bipartisan  manner to lower costs and improve clean water infrastructure in  communities that need it the most.\n\nI have stood up for…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699255/2025-final-priority-results-survey"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Services, Energy, Interior, all led by  billionaires.\n\nThese people don't shop for themselves or they don't worry about  paying rent. They don't care about us. Trump said he would drain the  swamp. What a bunch of BS. He moved the swamp into the Lincoln bedroom  for God's sake.\n\nThe bottom line is simple: He has not done a single damn thing that  he promised…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…once intended as a shield for vulnerable  wildlife, has morphed into a weapon wielded by radical activists and  unelected bureaucrats that cripple our military's readiness and drain  billions from our defense budget.\n\nMadam Chair, consider this. The War Department manages nearly 27  million acres of land, waters, and airspace, which are vital for  testing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695254/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…earned through service. Too many veterans, along with  their families, caregivers, and survivors, are being hit with savvy  fraud schemes designed to steal personal information, drain bank  accounts, and even redirect VA benefits to bad actors. When these scams  happen, veterans often don't know where to turn inside the Federal  system.\n\nThe VSAFE Act would…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699191/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…commonsense fix. HPSP scholarship  recipients will be given offers of jobs within 90 days post-graduation.  They will not wait. Veterans will not be forgotten. We are going to  drain the VA swamp one regulation at a time.\n\nOur bill also requires an annual report to Congress on hire dates and  placement rates. Transparency generates performance.\n\nWe are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695432/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…lawsuit, affecting entire populations and jurisdictions  not involved in the original dispute. These overreaching rulings create  significant uncertainty about Federal policies, drain taxpayer  resources, and embolden unelected judges to subvert the will of the  American people by thwarting the democratically elected President and  Congress.\n\nArticle III…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…a serious threat to public  safety.\n\nSinkholes occur when there is a lack of proper external surface  drainage so when a heavy rainstorm comes through and the ground cannot  drain the water properly a void may form underground. From that point  on, it is often simply a waiting game until the ground gives out and a  dangerous sinkhole develops.\n\nThis…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693479/sinkhole-mapping-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…net-worth individuals leaving, they are, of course, taking all of the  taxes that they pay with them, so the State Treasury no longer receives  anything.\n\nNow, obviously, this is a drain on the Treasury. It would be in any  State, but in particular in California because of the unusual extent to  which our State relies on the highest earners.\n\nIn some years,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…that many children prefer and  are more likely to drink. When kids enjoy milk, they are more likely to  drink it and get the nutrition it offers instead of pouring it down the  drain.\n\nThe Whole Milk for Healthy Kids Act supports healthier kids and gives  schools the flexibility to meet students where they are, allowing them  to nurture healthy habits that…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698184/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…problems, not just all  of a sudden spends not only more money than they have to fix their  problem, but creating a problem for other veterans because Democrats  are going to drain this system.\n\nNow, I welcome the ranking member and other colleagues on the other  side of the aisle to cosponsor Mr. Van Orden's legislation and get it  out of the House to…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689695/montgomery-gi-bill-selected-reserves-tuition-fairness-act-of-2025"}]