[{"senator": "Mike Thompson", "party": "Democrat", "sentence": "…tax credit nearly cut child poverty in  our country in half. We also made historic expansions to both the  earned income tax credit and the dependent care credit which  dramatically cut child poverty. In other words, when Democrats do tax  cuts, we focus those tax cuts on those who need it the most.\n\nThe Republicans on the other hand are looking to…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…Daleville, Alabama, home to 5,000, 100 members of the community showed  up and spoke out.\n\nHere in Washington, D.C., as the National Guard is patrolling, and  ICE agents are dramatically ramping up raids across the city, citizens  are starting Instagram pages and Facebook groups to inform fellow  citizens of their rights. Parents are patrolling schoolyards…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…EU and Japan, but let's be  clear about what those deals mean because even after those deals--those  agreements, trade agreements--Americans are going to be left paying  dramatically higher tariffs.\n\nA new analysis this week found that we will be paying the highest  tariffs since the Great Depression, and we saw what those tariffs  before the Great Depression…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694454/9999"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…cake of consequences to these healthcare bills.  That is consequence one, people lose insurance.\n\nConsequence two is people who have insurance see their premiums go up  dramatically. Premium notices are coming out from insurance companies  in Virginia, and they are suggesting that premiums this year in  Virginia will go up by at least 20 percent.\n\nWhy…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…limits  providers and grantees from using a different tool in the future if it  is determined to be more effective.\n\nFinally, I remain concerned about language that would dramatically  alter the entities that would be eligible to receive grants.  Specifically, we oppose language that would add ``healthcare  providers'' as eligible grantees. The Fox grant…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691508/no-wrong-door-for-veterans-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…women's medical  needs seriously and acts before it is too late. Here is why this  matters: Ovarian cancer is often caught too late, but when detected  early, survival rates dramatically increase. Early detection isn't just  good medical practice; it is the difference between life and death.\n\nToday, I carry the Johnsons' story with me to Congress. Their…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699001/recognizing-ashellarien-addison"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…that we have really spent little time studying  the paths that democracies take when they collapse. Most of the time,  there is not a singular moment when the Executive dramatically seizes  power. There is not normally a brazen attempt to burn down the  Parliament building. No, instead, democracies die when gradually, often  quietly and methodically,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…example, in Texas, in the summer, 80 percent of peak demand for  electricity is air conditioning. So if you increase the efficiency by a  third in air conditioners, you are dramatically reducing the need to  have to build more electrical generating facilities in the country. Or  maybe there is more electricity left over for the AI industry if you  are working…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690527/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…The President sees the writing on the  wall, and he is scrambling to undo the damage he has caused, but it is  too little, too late, unless he moves quickly and changes dramatically.\n\nThe damage goes beyond food prices. Thanks to this President,  Americans are now confronting higher utility bills. Just ask them. On  the campaign trail, the President…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…needy families. This is       the party that shut the government down because they were       unwilling to save 22 million people from having their health       care costs dramatically rise or are lost. These pieces of       legislation do not represent any serious effort at curbing       costs or making life better for everyday people.\n\nThe bills are…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…to speak up in Congress, in the Senate, in the House,  Democrats and Republicans. Silence is not acceptable. The amount of  funding awarded in Trump's first 100 days is dramatically lower than  past years, with more than $2 billion in research funding being held up  so far this year. Two billion dollars isn't just lost opportunity, but  it discourages…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690656/national-institutes-of-health"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Republican colleagues are being coy about the  specifics, but Americans can connect the dots. There can't be a tax cut  for billionaires of that magnitude without either dramatically slashing  Medicaid and maybe Social Security and Medicare while you are at it, or  dramatically exploding the deficit.\n\nJust like every other action before us, the Republicans'…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688067/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…Investing in Main Street Act of 2025 simply amends this outdated  law to align these caps by allowing banks to invest a full 15 percent  in SBICs. Raising this cap would dramatically increase the amount of  investment capital available to our country's small businesses for whom  even small investments can mean so much.\n\nAlready SBICs have helped marquee…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687919/investing-in-main-street-act-of-2025"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…license and regulate  private-sector parties to operate commercial remote sensing space  systems. Since that time, the commercial remote sensing industry has  changed quite dramatically.\n\nToday, companies from across the world are launching commercial  remote sensing systems and selling the data. We must ensure that the  United States remains at the forefront…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688973/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…a bipartisan  motion to discharge legislation to extend the Affordable Care Act tax  credits to make sure that tens of millions of everyday Americans do not  experience dramatically increased premiums, copays, and deductibles  that will prevent them from being able to go see a doctor when they  need one.\n\nI strongly urge a ``yes'' vote on this bipartisan…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698592/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…their American comrades, NATO's newest  members, Sweden and Finland, are each on track to meet the alliance's  new spending target years ahead of schedule.\n\nGermany has dramatically increased defense spending, and the Germans  have even amended their Constitution--amended their Constitution--to  allow for deficit spending on defense. Whether Europe's…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…as has been highlighted by Mr. Mackenzie and others tonight,  the regulatory burden on the Federal, State, and local levels were so  duplicative that you had costs rising dramatically.\n\nThis bill tackles each of those issues. We are tackling illegal  immigration. We are tackling the interest rate issue, which is finally  coming down. Finally, the regulatory…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699813/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "Mr. FEENSTRA. Mr. Speaker, I thank Chairman Smith for yielding.\n\nMr. Speaker, President Trump's One Big Beautiful Bill Act will  dramatically grow our economy and reduce our deficit. It is the largest  tax cut in American history for families, farmers, workers, and small  businesses.\n\nThis bill will help our Main…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693183/one-big-beautiful-bill-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Many of you are the ones that went to war 25 years ago when President  Bush said: Could we take a little tiny  piece and put it into the markets? Today, you would have dramatically  greater wealth. That decision was made. The public spoke--actually, the  leftist unions spoke and scared the crap out of people.\n\nThe real battle is that we are almost…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…provisions. They voted  against these protections that we had against the fraud. And now  Democrats, with what they want to do for the next 3 years, want to make  the fraud dramatically worse.\n\nThis needs to end. The American people deserve the care they need  from a doctor that they choose at a price they can afford. ObamaCare  absolutely failed to deliver…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…technologies. They  are mature. They are widely developed. Wind and solar now account for  17 percent of our electric generation.\n\nThe cost of these technologies has also dropped dramatically, and  this is the seventh reason to phase them out. Wind and solar  technologies have less overhead, longer lifespans, and higher profits  than they did when these credits…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690785/big-beautiful-bill"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…found in the Fix Our Forests Act, which  was passed on a bipartisan basis this past January.\n\nAdditionally, I applaud the recent actions by the Trump  administration to dramatically scale up the management across the  National Forest System.\n\nEncouraging this ramp-up will enable the Forest Service to better  manage, support local counties and economies…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691520/recognition-of-may-as-wildfire-awareness-month"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…California such as CARB, the  California Air Resources Board.\n\nThese are just a few suggestions, but our State has absolutely  enormous potential that currently is being dramatically underutilized.  It is truly a sad thing as we see it in every community in this State.  You see your favorite restaurant or another cherished small business  that suddenly…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…My wife Barbara is a 38-year breast cancer survivor. We are fortunate  that her breast cancer was detected very early. We know with certainty  that early detection can dramatically increase a woman's chance of  defeating breast cancer.\n\nA regular mammogram is the best way to find breast cancer early. As  screening and treatment have improved, we have…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696323/breast-cancer-awareness-month"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Federal  Government.\n\nSo the employer market, particularly the small business market, is  shrinking. At the same time, the ObamaCare market is expanding--and  expanding pretty dramatically--and premiums cost about double what you  would see in the employer marketplace.\n\nSo let's go to the next chart.\n\nAnd the thing that you have got to remember here is, if…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…your maximization of growth.\n\nTurns out, if you don't do it, you actually get probably a small  retraction, maybe a small recession, because people's taxes go up  rather dramatically.\n\nRemember, for the average family, didn't I just show you--$2,853. In  a district like mine, it is somewhere in the $3,000 range. I have a  higher income district. You…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…are just not that  much. It is just the insanity of what is going on.\n\nLook, I am trying to help you understand wages.\n\nLet's back up.\n\nTax receipts are up. Spending is up dramatically more, but most of  the tax receipts that we are gaining are almost all capital gains. So,  of the increased tax receipts, only about 5.5 percent of it is actually  the growth…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…a third time  and passed; and that the motion to reconsider be considered made and  laid upon the table.\n\nAgain, I came down here 2 weeks ago. I modified my bill quite  dramatically. We entered talks immediately with the  Senator from Delaware and the Senator from Michigan. Within those  talks--again, 2 weeks ago--they were accusing my bill of giving…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…This  is the baseline fact. Baseline, we are set to spend $86 trillion over  the next 10 years, and all we are trying to do is reduce $2 trillion.\n\nI think we should reduce dramatically more, but I think you can do it  through policy, the adoption of technology, and the alignment of  incentives, and we can make the delivery of government services work.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…by their radical Islamic faiths, but they have done it  to other people around the world. They are the leading sponsor of  terrorism around the world.\n\nWe saw this most dramatically just a little over 18 months ago when,  on October 7, 2023, 1,200 people, most of which were Jews, but not all,  people from dozens of countries, including Americans, were…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691211/supporting-a-free-democratic-and-secular-iran"}]