[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…our votes without jeopardizing all of  the important Democratic priorities I just laid out and more. We will  be in the strongest possible position to fight for and win the drastic  changes we all know are needed to protect our communities: judicial  warrant requirements, no more detentions or deportations of United  States citizens, an enforceable code…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…Prevention, CDC. All of this represents more  Republican broken promises.\n\nRemember last month when Trump was going to drastically bring down  grocery prices? The only thing that is drastic is the pain of this  Republican budget. Now Trump tells us we will have a golden age in  America. With this budget imposing so many burdens on our finances, the  sick, the…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688064/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…something we should do every 5 to 10 years. The world is constantly  changing, and our priorities and funding decisions need to adapt. But  for an administration to take such a drastic, unilateral step is  unprecedented, short-sighted, and certain to weaken U.S. global  leadership and U.S. national security.\n\nAmong the organizations and programs the President…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699129/us-withdrawal-from-united-nations-organizations-and-programs"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…their workforce  quits? This is something to be proud of? It is unconscionable. What is  worse are the absurd assertions that veterans won't be negatively  affected by such drastic reductions.\n\nThere is simply no way that the delivery of veteran care and benefits  will not be affected by Secretary Collins' continued efforts to  demonize and demoralize…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693968/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…for violating basic due process.  Basically, he said it could not be more obvious than this, that a  person should have a chance to have his day in court before something  as drastic as deportation happens to him.\n\nNot only did Trump ignore that but he talked about deporting American  citizens when he was sitting there with the President of El Salvador.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…all-out  assault on the health and well-being of everyday Americans. That is not  what we should be doing here in the United States House of  Representatives.\n\nBecause of the drastic cuts that are made to healthcare in this one  big, ugly bill, people with private insurance all across America are  going to experience increases in their premiums, co-pays,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…subscribe to the notion that no one should be left without access  to a doctor, a hospital, or an ambulance simply because of where they  are from. The disparities should not be as drastic as they are for  people of color. Yet, in places like Barbour County and Washington  County and Conecuh County across my district, the data tells the  devastating story about…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690245/health-disparities-in-minority-communities"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…exacerbate an already dire problem and  would lead to more unwanted and high-risk pregnancies, unsafe  abortions, and higher maternal mortality rates. The administration's  other drastic cuts to foreign aid have already reduced or eliminated  food aid for many families, forcing parents to remove their young  daughters from school and into child marriage, increasing…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696465/womens-health"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…military ID to register to vote.\n\nMr. Speaker, do you remember the SAVE Act's requirement that  Americans show their documentation in person at an election office?\n\nIt will have drastic consequences. The SAVE Act will prevent members  of our Armed Forces from registering to vote while deployed overseas.\n\nMoreover, the SAVE Act is not actually meant to prevent…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…increasing health risks from smog, which is  why California took such a step 60 years ago to become the first State  to tackle air pollution caused by automobiles head-on, to take drastic  generational action to clean up our air.\n\nBut the steps that my colleagues in the Republican Party are taking  tonight aren't going to make America healthy again. They are…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…oversight is       crucial to preventing and holding officers accountable for       misconduct against the very people they have sworn to       protect.\n\nH.R. 5214 proposes drastic, harmful changes to D.C.'s       pretrial laws, which ensure that pretrial release decisions       are based on assessments of true risk, rather than wealth. It       would…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696914/letter-led-by-the-leadership-conference-on-civil-and-human-rights-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…much precipitation into our region is going  to cause the need for evacuations.\n\nDo not tarry in the evacuation. If evacuations are requested, please  comply. These are very drastic situations, and we need the public to  understand that. So I am sure you are going to hear a lot more from  your local forecasters, your county executives, your emergency…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697849/national-weather-service"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…doesn't come, and we will be okay.\n\nMr. Chairman, that is not what happens. The reality is that places  like the Jersey shore need protection from the next big storm and  making drastic cuts like these are simply dangerous.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694863/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…unwarranted  tax hike on the middle class.\n\nAllowing these subsidies to lapse will cause out-of-pocket premiums  for enrolled Americans to soar by an astounding 93 percent.\n\nThis drastic reduction in subsidies will also compel many healthy  individuals to forgo insurance altogether, leaving a sicker population  behind and forcing insurers to raise premiums…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695661/healthcare-subsidies-and-rescissions"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Management, BOEM,  has provided absolutely no description or detail of what exactly are  the national security concerns that at this late hour could possibly  justify such a drastic action.\n\nThe closest thing to an explanation came in a CNN interview with the  Secretary of the Interior a few days ago, who cited ``radar  interference'' and possible swarm…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695066/halt-work-orders"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…affecting millions of Americans each year.\n\nThe good news is that many heart conditions are preventable through  small everyday choices. Taking care of our hearts doesn't require  drastic changes. It is about simple, constant, consistent habits:  staying active, eating a balanced diet, managing stress, and keeping up  with regular checkups.\n\nBeyond personal…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688152/recognizing-heart-health-month"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Mr. Speaker, today, I call upon the Trump  administration to abandon the drastic Biden-Harris 14(c) rule. The  14(c) rule is with regard to allowing certain people with handicaps to  work for under minimum wage.\n\nI have toured many work centers or shelter…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689252/abandon-biden-administration-rule"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…have jurisdiction to review. In some past cases,  Congress has exercised this power by stripping Federal courts of  jurisdiction to hear certain classes of cases, but that drastic action  is avoided in this legislation. Instead, it takes a very measured  approach. The bill would curtail the scope of injunctive relief but  still allow for nationwide…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "John Rose", "party": "Republican", "sentence": "…from the last White House.\n\nS.J. Res. 18 puts us one step closer to cleaning up this mess. It  calls the Consumer Financial Protection Bureau's overdraft rule what it  is: drastic, punitive, and harmful to banks and credit unions. It also  stands to harm the very people it purports to protect.\n\nMr. Speaker, I share with you today a story of a lady in…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689836/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…congressional Republicans are partnering with them through my  bill, the American Entrepreneurs First Act.\n\nWe have heard this bill described this morning as complicated and as  taking drastic measures. Drastic measures mean that the SBA is going to  need new resources to be able to actually do their job.\n\nSimply put, all this does is say that when they are giving…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692123/american-entrepreneurs-first-act-of-2025"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…grow baseload in this country. The only way to reduce  energy prices is competition and more energy.\n\nEvery Member in this Chamber and the American people have witnessed  the drastic consequence of this antidomestic energy policy championed  by the previous administration, which led to record-high gas prices,  severe job loss, and dependence on foreign…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695690/promoting-cross-border-energy-infrastructure-act"}]