[{"senator": "George Whitesides", "party": "Democrat", "sentence": "…similar scientific  backgrounds to let the administration know exactly what will happen to  our Nation if they gut these science agencies. A letter was sent to the  President drawing on our diverse backgrounds and constituencies to let  him know exactly why science is a good investment for the future of our  children and for our country.\n\nMake no mistake,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691391/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…fiscal pragmatism in painting a clear picture of  what is going on right now.\n\nBalint).\n\nMs. SCHRIER. Mr. Speaker, I thank Representative Balint for that  clarity. I appreciate drawing that distinction that Speaker Emerita  Pelosi referred to as reverse Robin Hood. That is exactly what is going  on here.\n\nWho are you standing up for? We saw with the Republican…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…courts don't generally do this. They don't provide that  injunctive relief. They give deference to the State legislators because  they are charged with the responsibility of drawing the maps, so they  give them sort of the benefit of the doubt as it were, and they go on  to allow us to litigate. We have been litigating against the last maps  for more…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…indiscriminately kidnapping people off the  streets, and sowing terror in our communities. This is not how a  civilized Nation treats its people.\n\nThere are countless stories of ICE drawing their weapons and pointing  them at bystanders, driving into oncoming traffic to deter bystanders  from filming them. To make matters worse, now the Trump administration…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696911/aggressive-immigration-enforcement-tactics-in-oregon"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…on a letter allegedly  written by Trump to Epstein as part of a birthday book for his 50th  birthday in 2003. The letter is signed at the bottom ``Donald.'' It  features a drawing of a woman's body with very suggestive text.\n\nI debated putting that letter up. There is a chart of it in the door  behind me. But it has already been made public. The public…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…thinking. Using the U.S. military to conduct unchecked strikes in the  Caribbean risks destabilizing the region, provoking confrontation with  neighboring governments, and drawing our forces into yet another open- ended conflict without a clear mission or exit strategy.\n\nConflict in the Caribbean or with Venezuela is entirely avoidable,  but the risk…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Education Award--Kayla Diaz: Kayla Diaz has  dedicated her career to breaking down language and cultural barriers  for students and families at Colonial Heights Public Schools. Drawing  from her own experiences navigating a new language and school system,  Kayla became a tireless advocate for better support services, leading  to the creation of a full-time…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690568/virginias-fourth-district-women-in-excellence-awards"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…President doesn't like it. No, this is not how this works. It  is not how it works under the Constitution. It is not how it works  under the law.\n\nThis resolution is about drawing a line in the sand and saying you  cannot abuse your emergency powers to start an unjustified trade war;  you cannot abuse your emergency powers to hurt one of the finest…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…helped evacuate a wounded resident to safety.\n\nAt the same time, Trooper Nieto made a split-second decision. Knowing  an officer was pinned down, he maneuvered into harm's way, drawing the  suspect's attention and likely saving Lieutenant Moyer's life.\n\nThese are not routine acts of bravery. They are rare, decisive  moments that speak to the highest ideals…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695077/recognizing-trivits-family"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…specific needs no matter the size of the program.\n\nFor those reasons and more, I am in opposition to the rule and the  bill, and I encourage my colleagues to get back to the drawing board  and do something that actually works for student athletes and allows  them to be paid equitably and fairly and collectively bargain.", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697301/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…mitigation are found to be ineffective.\n\nThrough activity-based mitigation, FSOC will work with firms and  their primary regulators to address risks more quickly and effectively,  drawing on the expertise of the regulatory bodies who work most closely  with the specific firms and industries.\n\nImportantly, this legislation fully preserves FSOC's authority to…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699823/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…that is a terrible look for  America. And by ``look,'' I don't mean the atmospherics of it; I mean  that is the wrong mission in a republic.\n\nAnd the connection I have been drawing between Trump's authoritarian  personality and tendencies is that an authoritarian feels that people  are accountable to him so he can do any damn thing he wants and control…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…weaving together Rochester's histories with the lived experiences of  its people. His work reflects on how communities preserve memory,  identity, and family history, often drawing inspiration from our city's  legacy as the birthplace of modern photography through Kodak Park.\n\nBeyond his artistic practice, Jason manages the International Plaza,  a vibrant…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695841/recognizing-jason-barber"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…changed this business so much, I am not sure we can  ever reclaim the kind of idealism that we all aspire to as public  servants in this institution.\n\nI thank the Senator for drawing us to the floor today. There is a lot  of work to be done, and I may not be around for some of it. But I will  still remember that $800,000 when I first ran was a record.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…World, and both of my amendments uphold that legacy by  investing in American manufacturing to ensure this vital industry  remains globally competitive in the United States.\n\nDrawing from the Retreaded Tire Jobs, Supply Chain Security and  Sustainability Act of 2025, this amendment would ensure that the U.S.  Government uses retreaded tires wherever possible…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697853/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…establish Victor Six Health and  Fitness, an innovative program designed to combat the mental and  emotional struggles afflicting so many of our returning servicemembers.\n\nDrawing upon groundbreaking research from institutions such as Johns  Hopkins, the Cleveland Clinic, and Mount Sinai Hospital, Diane  developed a 12-week program focused on the critical…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688923/recognizing-diane-reitz-a-light-of-service-a-heart-of-strength-and-a-legacy-of-honor"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Training Center at Savannah Air National Guard Base.\n\nSince assuming command in 2023, Colonel Thomas has led this premier  training hub with unmatched commitment and devotion.\n\nDrawing on nearly two decades of combined Active-Duty and Air  National Guard service, he elevated the CRTC's role in preparing  warfighters for great power competition.\n\nUnder his…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699886/mark-burns-inducted-into-living-legends-of-aviation"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…the bleak economic conditions and  the daily hardships imposed on their families by the Iranian regime.  Local protests have spread across the country to all 31 Provinces,  drawing tens of thousands of citizens into the streets. These men and  women are rightfully calling for accountability, freedom, and an end to  authoritarian rule.\n\nI stand in solidarity…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699103/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…Oregon is a single  objection, not on the merits, not on any legitimate procedural ground  to any of the bills that I just mentioned--not a single one. No, these  bills are drawing an objection today, not allowed to pass the Senate  today--even though they passed in the past unanimously, and they don't  have any substantive objection.\n\nThey are objecting…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691666/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Mr. Speaker, in 2010, California voters overwhelmingly voted to  establish the Citizens Redistricting Commission. The voters said that  they wanted to take the process of drawing district lines out of the  hands of politicians. They said that voters should choose their  politicians, that politicians shouldn't choose their voters.\n\nThat commission has…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694130/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…true sense of community.\n\nAt the heart of the community is the director, Lora Benzinger, who  has led the pantry for a little over a year after years and years of  service. Drawing on her background in social services, she has made it  her mission to ensure the pantry nourishes not only families' tables  but also a sense of belonging.\n\nFamilies come…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698960/recognizing-eastern-washington-universitys-adaptive-athletics-program"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…retired reserves of the U.S. Army, ready to  serve her country again if needed. Throughout her journey, Kathy has  remained deeply committed to education and community service. Drawing  on her experiences as a teacher, she has dedicated her retirement years  to volunteering and substitute teaching in local schools. Additionally,  Kathy has been actively…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691195/recognizing-kathy-logue"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…neutralizing  deadly sea mines.\n\nIn one remarkable mission, the USS Moreno captured a German one-man  submarine armed with a torpedo. The vessel was brought aboard for  inspection, drawing the attention of senior military leadership eager  to study its design.\n\nRadioman Scarpelli also served alongside his three brothers: Frank,  who fought in the Pacific with…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695850/recognizing-united-states-navy-radioman-petty-officer-3rd-class-natale-nate-john-scarpelli"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…state of Georgia: the Savannah Christmas  Market at Plant Riverside District.\n\nThis year, it was ranked as one of the top holiday markets in the  entire country by USA Today, drawing visitors from all over and  spotlighting the rich culture and community spirit of Savannah.\n\nThe market transforms historic River Street into a festive  destination filled…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698573/recognizing-the-savannah-christmas-market"}, {"senator": "John Thune", "party": "Republican", "sentence": "…of the game. I  certainly understand that Democrats are not going to support all the  President's nominees; that is their prerogative as Senators. But the  way that they are drawing out this process on even noncontroversial  nominations is serving no one.\n\nMr. President, 57 out of 58 of the President's civilian nominees have  required cloture votes, an…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690974/business-before-the-senate"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…jobs, investment, and innovation offshore  while leaving American consumers exposed.\n\nThe CLARITY Act fixes this. It establishes clear, functional rules  for digital assets, drawing a bright line between the SEC and the CFTC  and creating strong, enforceable protections for consumers.\n\nIt ensures the digital assets developers and consumer-facing firms…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693792/digital-asset-market-clarity-act-of-2025"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…said he didn't have the  authority to do things and then did them later and dared the Court to  stop him.\n\nI think we have to come here and realize if we do our job, we are  drawing the appropriate balance on one of the two branches that we do  have an obligation to keep an eye on. We keep an eye on the executive  branch, and the minority being the branch…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…quickly rallied a  team of dedicated volunteers around her dream. From that vision, the  RAP River Run was born. Today, it stands as one of Tampa Bay's premier  running events, drawing thousands of participants and volunteers each  year. Thanks to the continued enthusiasm and support behind this event,  the team is excitedly preparing for the 2025 RAP River…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692476/recognizing-victoria-barley"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…why today I am calling for a prompt vote on H. Res. 4889.\n\nOn three separate occasions, California voters have deliberately  chosen to remove politicians from the process of drawing the lines for  legislative districts. Voters have empowered an independent citizens  redistricting commission to set the boundaries of representation so  that free and fair…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694777/protecting-representative-form-of-government"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…to get that power  back?\n\nBy a 2-1 margin, over 60 percent of Democrats, over 60 percent of  Republicans, and over 70 percent of Independents said: We want the  commission drawing district lines. We don't think politicians should  draw their own district lines.\n\nTo solve this problem, that is to say, the public overwhelmingly  opposing his plan which…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}]