[{"senator": "Shontel Brown", "party": "Democrat", "sentence": "…deserved their  success.\n\nLet's call this what it is: Trump's resegregation agenda.\n\nWe know what happens when prejudice prevails. Opportunity is  obstructed, and red lines are drawn with Federal funds. We have seen  this story before.\n\nYet despite the dark clouds gathering above 1600 Pennsylvania Avenue,  Black Americans have long battled bigotry, broken…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688144/recognizing-resilience-resistance-and-relentless-struggle-lessons-of-black-history"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…strongly they felt about  their shared responsibility to manage the power of the purse.\n\nThe power of the purse--article I, section 9, of the Constitution  says:\n\nNo Money shall be drawn from the Treasury but in       Consequence of Appropriations made by Law.\n\nAnd here is the thing. The Congress is vested with that power, but  when you decide how to spend…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…how that could escalate, I didn't believe it was  happening. I didn't believe it was happening.\n\nI was seeing it. I was hearing it. I was witnessing officers with  their guns drawn, but I said to myself: Peter, this is the United  States of America. We have a peaceful transfer of power. We win  elections. We lose elections, but it is the people of this…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698518/anniversary-of-january-6"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…regardless of race,  gender, or background, has the opportunity to thrive.\n\nIt reflects the notion that our strength as a nation lies in our  diversity, that our success is drawn from the breadth of our collective  experiences, and that our unity can be found not in the erasure of  differences but in the celebration of them. Today, this fundamental…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Frederica Wilson", "party": "Democrat", "sentence": "…vibrant cultural,       historical, and social framework of American life; and\n\nWhereas, the greatness in American democracy and the       promise of liberty and opportunity have drawn countless       Jewish individuals to these shores, including those escaping       from oppressive regimes in Europe, survivors of the       Holocaust, and those seeking a…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690399/proclaiming-this-and-every-april-29th-as-endjewhatred-day"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…bus stops and having coffee  when they were then surrounded by ICE agents in unmarked vehicles that  sped up in their direction. They leapt out with masks on and their guns  drawn and ran immediately toward these individuals. They then  handcuffed these individuals and forced them into vehicles and drove  them away. All of this was done before they had…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693662/weaponization-of-ice"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…impeachment for, and conviction of, treason,  bribery, or other high crimes and misdemeanors.\n\nFurther, Section 9 of Article I of the Constitution states that no  money shall be drawn from the Treasury but in consequence of  appropriations made by the law.\n\nIn his conduct of the Office of the President of the United States,  and in violation of his constitutional…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…get rid of those atomic weapons, here and everywhere. We       cannot live with them.''\n\nDuring the past several years, accelerating work by       activists for abolition has drawn inspiration from the Treaty       on the Prohibition of Nuclear Weapons, now signed by 94       countries, and visionary organizations like the International       Campaign…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693757/marking-80-years-after-trinity-the-dangers-of-nuclear-war-have-never-been-higher"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…Artist: Paul Collins has spent his life using his  artistic talents to tell the stories of those often overlooked.\n\nBorn in Muskegon and raised in Grand Rapids, Collins was drawn to art  from a young age. Despite initial discouragement, he pursued his  passion, eventually traveling to West Africa to immerse himself in his  cultural roots.\n\nCollins'…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…who could and would pay, we should not  allow this great and solemn power to make war to be usurped any longer.  The only way for us to know whether the United States might be drawn  into a broader conflict is if we exercise our authority to prevent it  or to determine that the Congress wants to affirmatively provide a  President with the authorization…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…alive today, and as we honor their  memories, I am on the floor again today following the administration's  announcement of its plan to finally end Operation Metro Surge and drawn  down the thousands of federalized agents that aren't just in  Minneapolis or St. Paul--that, actually, I don't think people quite  understand. They are all over our State.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…shutting  down in Black neighborhoods. We have long lines in indigenous  communities that stretch around the corner and throughout the night. We  have purges, ID laws, and maps drawn to divide rather than to unite.\n\nMr. Speaker, we have courts gutting the Civil Rights Act, statehouses  cooking up new restrictions, and a President threatening to override…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…neutral up front and that you  couldn't prove the cost savings over time.\n\nWhat this language will do, it will take our ability in Colorado away  to utilize this waiver that has drawn down hundreds of millions of  dollars for substance use disorder treatment. In fact, we were the  second in the Nation to implement this waiver, and a total of 37 States  now…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691883/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Ryan Lizza called a ``broken''       OGE.\n\nPresident Trump's behavior toward the courts, law       enforcement and intelligence bodies, and other independent       agencies was drawn from an authoritarian playbook. He openly       spoke of using the Justice Department and the FBI to go after       Democrats, including Hillary Clinton. And in late 2017,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…care provider, you       will never think will happen to you. Because all you're doing       is taking care of the children and educating them, right?''\n\nThe harassment has drawn attention from local Democratic       leaders.\n\n``What the hell are we doing here where children, at day       care, might be subjected to extremists showing up at the door…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…Expedited reviews are essential to avoid prolonged, costly merger  review processes that hinder banks from maintaining their employee base  or investing in technology. Instead, long-drawn-out application  processes create an environment of uncertainty due to regulatory  delays, even when the proposed transaction is relatively simple.\n\nAt the end of the day,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…the hunting grounds of the Native American Tribes. The  very first house that laid the foundation for a permanent community was  built in 1780 by a Wabanki known as Pierpole. Drawn by the rich natural  resources, other settlers followed, and at the dawn of the 19th  century, the town was established by Massachusetts Governor Caleb  Strong.\n\nThe rich soil…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699397/225th-anniversary-of-the-town-of-strong"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…against  gerrymandering everywhere. I am against it in California. I am against  it in Texas. I am against it in every State, Republican or Democrat.\n\nMy district, the currently drawn Third Congressional District, did  indeed vote against Prop 50, and if it had its way, it would remain one  contiguous district.\n\nUnfortunately, this was not decided on a district-by-district…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…inaction, or outright  obstruction by States and relevant Federal agencies.\n\nSection 401 of the Clean Water Act has turned into a procedural  chokepoint with varying application and drawn-out State reviews,  undermining otherwise federally authorized projects.\n\nThis has resulted in energy shortages in certain areas of the  country, exposing consumers to high…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698073/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…abilities in the field.\n\nEvery attendee, including EMS clinicians, medical experts, first  responders, agency administrators, and educators, is truly selfless and  caring. They are drawn to making a tangible difference and have an  incredible passion for saving lives. I applaud each and every one of  them for their hard work and commitment.\n\nIt is an honor…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694419/50th-anniversary-of-the-wyoming-trauma-and-emergency-medical-services-conference"}, {"senator": "James Risch", "party": "Republican", "sentence": "…47 minutes this  last weekend, but he is not in the process of doing this. And the  resolution says that he should stop it. He is not doing it.\n\nNow, if the resolution were drawn to say, ``Mr. President, you can't  do this  anymore,'' that would actually have some effect or attempt to have some  effect. It would be unconstitutional, unenforceable. But…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698707/venezuela"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…once per decade after the Census.\n\nThe legislature is barred from participating.\n\nThe members of the citizens commission may not run for public office.\n\nDistricts are to be drawn in an open process based on extensive  public input.\n\nBoundaries are to be set based on neutral criteria like keeping  communities together.\n\nDistrict lines cannot be influenced…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694777/protecting-representative-form-of-government"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…people,  but 50 years ago, the U.S. Senate and the U.S. House and the President  of the United States came to a compromise agreement over the issue of  abortion. It was a long, drawn-out process. At the end of that long,  drawn-out debate, they came to a compromise agreement that Americans  would not have to pay for elective abortions. It didn't outlaw…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…the  survivors of Captain John Flint's brigade of American Revolution  soldiers. Shortly thereafter, the town was named Baldwin and saw an  influx of lumberjacks and woodsmen drawn by the abundant forests.  Despite difficult growing conditions, residents were successful in  farming, and in establishing factories to produce lumber, boots, shoes,  and barrel…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699146/town-of-sebago-200th-anniversary"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…criminal illegal immigrant, as required by Federal  law, they should go to jail.\n\nI want a vote. I want a debate. I am not going to let this go. The  battle lines have been drawn.", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…district lines out of the  hands of politicians. They said that voters should choose their  politicians, that politicians shouldn't choose their voters.\n\nThat commission has drawn our district lines through the last two  rounds of redistricting. Yet, the Governor of California has now  announced a plan to abolish the Citizens Redistricting Commission…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694130/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…other,  or do we stand for something? Do we truly see ourselves as  Representatives of the people of the United States?\n\nSomething has to change. It truly does. A line has to be drawn. Not  all of us on either side of the aisle are perfect examples of what we  could or should be, but certainly, as I mentioned before, in my career  here, I have never ever…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688496/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…California. Mr. Speaker, I rise today to congratulate  the Tahoe Yacht Club as they celebrate their 100-year anniversary.\n\nIn 1925, many San Francisco families discovered and became drawn to  the beauty of Lake Tahoe. A small group of individuals formed the Tahoe  Power Boat Club to organize seasonal boat regattas, which quickly  became a highlight of the Tahoe…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…station replaced the Old Carver Fire Hall, which originally opened  for service around 1880.\n\nThe Old Carver Fire Hall stored the volunteer Carver Fire  Department's one horse-drawn hook and ladder wagon and one horse cart.  Now, the department serves the community with three fire engines, one  rescue truck, one tanker, one brush utility vehicle, one command…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696511/recognizing-carver-fire-chief-cally-trimbo-after-22-years-of-service"}, {"senator": "James Risch", "party": "Republican", "sentence": "…if there were hostilities against Iran, but we are not, and we do not  intend to. You can't terminate something that is not going on. Every  American is opposed to the long, drawn-out conflicts that we have, in  our history, from time to time, experienced. I assure you that  President Trump feels exactly the same way. He hates those long, drawn- out…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693132/motion-to-discharge-sj-res-59"}]