[{"senator": "Patty Murray", "party": "Democrat", "sentence": "…mistake, this was an uphill battle given the really tough  funding constraints we faced this year, but I fought hard, and we got  this done.\n\nThis bill also rejects Trump's dream of slashing public education  funding and instead provides a bit more for our K-through-12 schools.\n\nAll told, we rejected $12 billion in proposed cuts at the Department  of…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…mention, of course, the title track.\n\nWhether from a turntable, cassette, the radio, or your phone, ``the  Boss'' sings for us all when chasing after that ``runaway American  Dream,'' ``baby, we were born to run.''", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694961/50th-anniversary-of-born-to-run"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Ohio's 13th Congressional District need access to care.  The people in Ohio's 13th District need opportunity, opportunity to  work, to buy a house, and to live their American Dream. Yet, this bill  does none of that.\n\nInstead, it kicks 17 million people off their healthcare and makes  life more expensive. People don't have extra money to pay for  billionaires'…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693216/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…postpartum care to newborns and  mothers. These are programs that help families and children. Medicaid  works.\n\nElon Musk is only interested in helping the richest among us. His  dream is to fully extend more than $4.5 trillion worth of tax breaks to  his billionaire friends and the wealthiest corporations in the world.\n\nHow will they pay for these tax cuts…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688072/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…Sunday, 6 days after being shot while responding to a road- rage incident, Officer Facio passed away from his injuries at just 47  years old.\n\nOfficer Facio lived the American Dream. Born in Mexico, Officer Facio  earned his U.S. citizenship and dedicated his life to serving the  community that welcomed him with open arms.\n\nHe began his law enforcement…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692251/mourning-loss-of-officer-gabriel-facio"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…aisle when we have something to say.\n\nOur party needs to change, and economic populism and patriotism  should be where we go, standing up for people to revive the American  Dream.\n\nDemocrats should be fighting hard against corruption and the giant  corporations who fund so much of that. We should be fighting against  anyone else, any force, any company,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…want them as my neighbors.\n\nIf they are hardworking, honest individuals, taxpayers, what is wrong  with giving them the opportunity to be American, to pursue that  American Dream, and to be legalized? That is what America is all about.\n\nI ask my colleagues to strongly consider their ``yes'' vote and  please vote ``no.'' We are talking about Federal…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692099/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…budget doesn't just threaten programs. It threatens progress.  We must fight back.\n\nLet's protect our students, support our researchers, and defend the  right for everyone to dream big and achieve greatness in the United  States of America.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692286/sounding-the-alarm-on-a-crisis-threatening-americas-future"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…HUD, where he has helped victims of domestic abuse in Louisville  find safety, helped veterans get off the streets, and helped first-time  home buyers achieve their American Dream.\n\nA few weeks ago, Tim was fired with no notice and no severance or  compassion.\n\nAs we speak, the Trump administration is carrying out the biggest  layoff of veterans in history,…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688676/veterans-deserve-better"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…wondering if they will be picked up  next by ICE.\n\nThis is not who we are as a nation. We are supposed to uphold the  values of freedom, the values of democracy, and the American Dream.  Instead, the very people who came here in pursuit of that dream are  afraid to attend school, go to their jobs, go to church, and even leave  their homes for fear of being…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699664/horrific-ice-abuses"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…special congratulations to Coachella Football Club owner Luis  Bustillos, who founded the team with a vision to help players turn  their dreams into reality. He calls the club a dream factory and  continues to inspire his players to dream big.\n\nI thank every Coachella Football Club player and coach for  representing our district with grit, heart, and pride.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692140/recognizing-coachella-football-club"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…what this President is doing  with his reckless trade war, this small business owner might go out of  business.\n\nMr. Chatila said to me:\n\nWhen I came, this was the American dream, which is why we       built it. But now, you see it in front of yours eyes. It's       just melted, like ice.\n\nI asked him what he would like to ask President Trump if he…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689483/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…and  denied to the many. We are marching forward with ballots, not bullets;  love, not fear; and with hope, not hate.\n\nWhen you suppress the vote, you suppress the American Dream. You  suppress the worker, the teacher, the farm laborer, the preacher, the  nurse, the single mom juggling three jobs just to make it to election  day. You suppress the very…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…enacted by the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Dream Act of 2025''.       SEC. 2. DEFINITIONS.\n\nIn this Act:\n\n(1) In general.--Except as otherwise specifically provided,       any term used in this Act that is used in the immigration…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…the American  leading AI companies, just as a few examples.\n\nWe are shooting ourselves in the foot. Instead, why don't we go back  to being a place that welcomes students to dream big and conduct  groundbreaking research no matter where they are coming from?\n\nWhy don't we become a place that unites people of all backgrounds and  welcomes the best and…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693005/student-visa-process"}, {"senator": "John Thune", "party": "Republican", "sentence": "…the  farmers and ranchers, the sons and daughters carrying on the family  business. These hard-working Americans are the backbone of our economy  and a sign that the American dream is alive and working.\n\nSmall business is a big deal, and the Trump administration and  Republicans in Congress are working hard to deliver for American small  business owners.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690626/national-small-business-week"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…20-year law enforcement career.\n\nDr. Johnson's leadership has not only transformed Lamar State College  Orange but has paved the way for future generations to pursue the  American Dream right here in Texas.\n\nOn behalf of Texas' 14th Congressional District and this great  Nation, I want to thank Dr. Johnson for his service and dedication. His  hard work and…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694750/recognizing-the-retirement-of-dr-tom-johnson"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…creating a more focused regulatory approach for small  entities, the Small Entity Update Act will make it easier for  entrepreneurs across the country to achieve the American Dream.\n\nMr. Speaker, I urge all of my colleagues to vote for this bill, H.R.  3382.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693958/small-entity-update-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…are voting on today. We are attempting to direct the  President to terminate the use of the U.S. Armed Forces for hostilities  within or against Venezuela. Only Congress can dream this up.\n\nNow, I know there are a lot of people who think this is a very  powerful institution, and it is, indeed, but even this institution  cannot stop something that isn't…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699089/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…citizen,  Mr. David Cook of Huntsville, Alabama, on his well-deserved retirement  from Torch Technologies. Dave Cook's distinguished career is a powerful  testament to the American dream, and a lifetime dedicated to the  service and protection of our Nation.\n\nDave began his service to our Nation by enlisting in the United  States Army. His exceptional potential…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697622/congratulating-mr-david-cook-of-huntsville-alabama-on-his-retirement"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…worked with President Trump to secure  historic SALT relief for Californians. That relief, combined with the  provisions in the Housing for the 21st Century Act, will bring the  dream of homeownership closer to reality for working families in my  district.\n\nFor far too long, working-class Americans have been priced out of the  housing market. The Housing…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699800/housing-for-the-21st-century-act"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "Mr. STUTZMAN. Mr. Speaker, while I am happy to say that Indiana is  one of the most affordable States for homeownership in the country, I  know the dream of owning a home is still far off for many Hoosiers.\n\nWe have a serious housing shortage in this country. A key reason for  this is outdated and obstructive government regulations…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697479/making-homes-affordable"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…to start  and grow. This legislation will spur further investment in our business  community and assist businessowners in accessing the capital needed to  pursue the American Dream of owning and operating a small business.\n\nMr. Speaker, I thank Representative Chu for partnering with me on  this important legislation, and I urge my colleagues to vote in…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687920/investing-in-main-street-act-of-2025"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…aisle do recognize that we have a real  big problem with compliance burdens and the costs associated with that,  and how that prevents Americans from realizing the American Dream of  homeownership. As they raise the point of affordability, they neglect  the fact that we can address affordability by reducing costs to  potential homeowners.\n\nAt least…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698040/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Washington. They want a government that works for them,  not against them. These five bills deliver on our promise to cut red  tape, empower families, and protect the American Dream.\n\nMs. LEGER FERNANDEZ.\n\nMr. Speaker, America is suffering. Americans don't recognize the  country we live in. Trump's tariffs have caused prices to soar. We have  the highest…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…beginning. As we  move to 2026, Republicans are focused on expanding opportunity even  further, bringing jobs back home, growing domestic manufacturing, and  ensuring the American Dream is within reach for every person willing to  work hard, especially our young people.\n\nThe key to Republicans' success is that we govern by a simple  concept, common sense.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699063/how-republicans-have-delivered-for-americans"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…programs, which provide Tribes greater autonomy when  using Federal resources for housing projects on Tribal lands.\n\nMr. Speaker, homeownership is a cornerstone of the American Dream.  Families should not have to wait decades before buying their first  house. Kids should grow up playing in the living room of their  childhood home, not a rental.\n\nSadly,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699815/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…I congratulate the local leaders whose dedication made this  recognition possible. Flower Mound isn't just the best place to live in  America, it is proof that the American Dream lives right here in north  Texas.", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690708/flower-mound-texas-named-best-place-to-live-in-america"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…America's strength comes from our enduring belief that freedom is  worth fighting for and from our commitment to protect and empower the  hardworking families who make the American Dream possible.\n\nMy commitment is simple: Lower prices for Tennesseans, bring down  healthcare costs, protect communities, and restore American energy  independence and economic…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697494/welcoming-the-honorable-matt-van-epps-to-the-house-of-representatives"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…business, the Sloan family sold Grider Hill Dock in 2007, however,  Tony's passion for Lake Cumberland was far from gone. While the sun set  on his family-owned marina, a new dream was soon born to bring a  historic plan to life for a new marina at Rowena.\n\nTony came to me with a vision--to bring world-class recreational  facilities to Lake Cumberland.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689657/tribute-in-memory-of-tony-sloan"}]