[{"senator": "Val Hoyle", "party": "Democrat", "sentence": "…reality  for too many Americans.\n\nThat is what Democrats should stand for and be working for every day.  Our party must embrace economic populism and fight to revive the  American Dream, standing up for working people and giving them a chance  to succeed.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689078/economic-populism"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…We see it now in the battles over school curriculum, in sanitized  histories where the enslaved become mere workers and civil rights are a  footnote to a fabled color-blind dream.\n\nWhen we allow erasure to masquerade as reform, we not only assault  those who live the truth but endanger the consciousness of a nation  already prone to moral amnesia.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…preserved.\n\nMr. Speaker, we have to get serious about housing and focus our  attention on lowering the cost of housing and keeping housing  accessible to everyone. The American Dream depends on it.\n\nEvery family deserves a safe and affordable place to call home, and  this House has a responsibility to help make that possible. Until  housing costs come down,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699021/rising-housing-costs"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…administration treats the U.S. Treasury Department like  Make-A-Wish for corporations and private equity. Any giveaway or  special treatment an ultrawealthy corporate executive can dream of, the  Treasury Secretary and his crew are there to move Heaven and Earth to  make it happen.\n\nWith respect to the resolution we are voting on today, the question  is whether…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699925/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…the Congressional Progressive Caucus, and  so many others, to mourn the loss of a political and social justice  giant, Congressman Raul Grijalva.\n\nRaul's story is the American Dream. He was the proud son of a bracero  cowboy from Mexico who went on to become the president of the Tucson  Unified School District Governing Board, chairman of the Pima County…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688943/in-memory-of-congressman-raul-grijalva"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…aisle when we have something to say.\n\nOur party needs to change, and economic populism and patriotism  should be where we go, standing up for people to revive the American  Dream.\n\nDemocrats should be fighting hard against corruption and the giant  corporations who fund so much of that. We should be fighting against  anyone else, any force, any company,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…starting or owning a small business.\n\nStarting a small business is not a one-size-fits-all process. Each  individual encounters unique challenges when striving to open their  dream business. That is why it is essential that, as Members of  Congress, we support legislative initiatives aimed at identifying and  addressing the obstacles that small business…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687889/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…business owners.\n\nI will never forget visiting one of these businesses in Santa Monica,  California. It was a salad-based restaurant owned by two young Hispanic  men who had this dream of expanding their restaurant, but they were  turned away by every traditional bank due to a lack of assets and  credit history. Finally, they were able to get a $250,000 Community…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692070/capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…the gentleman for yielding.\n\nMadam Speaker, Georgia has long been a great friend to the United  States. I went to Georgia for their election when they elected the  Georgian Dream ticket about 12 years ago, but the Georgian Dream party  has turned into the Georgian nightmare.\n\nIn America, Dr. King had a dream, and that dream still lives. Yet,  the dream…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690701/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "Mr. CROW. Mr. Speaker, 75 years ago, a group of visionary educators,  parents, and community members came together with a common dream: to  create a district where every child would have the opportunity to  learn, grow, and succeed. I rise today to congratulate the Cherry Creek  School District on celebrating…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697488/recognizing-cherry-creek-school-districts-75th-anniversary"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…our  skies, and care for our veterans, our children, and our seniors. They  are our neighbors.\n\nMany people in this Chamber know that a union may have helped them  achieve the dream that they have of serving, as well as being able to  take care of their families. Many of us are recipients indirectly or  directly because of unions.\n\nCollective bargaining…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697997/protect-americas-workforce-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…the American  leading AI companies, just as a few examples.\n\nWe are shooting ourselves in the foot. Instead, why don't we go back  to being a place that welcomes students to dream big and conduct  groundbreaking research no matter where they are coming from?\n\nWhy don't we become a place that unites people of all backgrounds and  welcomes the best and…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693005/student-visa-process"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Year.                            Honoring Alicia Garcia\n\nMr. CORREA. Mr. Speaker, I rise today to honor Alicia Garcia, a  mother and community leader who embodies the American Dream.\n\nAlicia was born in 1961 in Durango, Mexico, and made the brave  decision to immigrate to the United States in search of the American  Dream.\n\nIn the early 1990s, Alicia earned…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692112/recognizing-diana-anahi-barrios"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…drugs that will help people all around the world and that has  defined America for decades.\n\nWe can't let the Trump administration kill off medical research and  kill off that dream that people keep alive every single day.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698206/nih-funding"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…from the family farm that my  great-grandfather built when he came to this country. He was 16 years  old. He didn't speak a word of English, but he believed in the American  Dream. He raised my grandfather, Sam, on that farm.\n\nMy grandfather, Sam, was an economic patriot. He really believed that  your word is your bond. He believed that hustle was the…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689083/economic-populism"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…the  America First agenda. It is the people's bill. It is made for and  shaped by the most diverse coalition of American voters in American  history.\n\nToday, we are making the dream of a government that puts the American  people first a reality.\n\nI would need this entire notebook to tell you all the great things in  the One Big Beautiful Bill Act. It is…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…creating a more focused regulatory approach for small  entities, the Small Entity Update Act will make it easier for  entrepreneurs across the country to achieve the American Dream.\n\nMr. Speaker, I urge all of my colleagues to vote for this bill, H.R.  3382.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693958/small-entity-update-act"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…business, the Sloan family sold Grider Hill Dock in 2007, however,  Tony's passion for Lake Cumberland was far from gone. While the sun set  on his family-owned marina, a new dream was soon born to bring a  historic plan to life for a new marina at Rowena.\n\nTony came to me with a vision--to bring world-class recreational  facilities to Lake Cumberland.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689657/tribute-in-memory-of-tony-sloan"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…matter to Americans.\n\nThank God for a landslide victory. We can only imagine the dreadful  consequences if Kamala would have been our President. I am afraid that  Barack Obama's dream of fundamentally transforming our country would  have been complete.\n\nPresident Trump is getting it done for the American people, America  first as every President should have…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688490/president-trump-is-getting-it-done-for-the-american-people"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…I congratulate the local leaders whose dedication made this  recognition possible. Flower Mound isn't just the best place to live in  America, it is proof that the American Dream lives right here in north  Texas.", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690708/flower-mound-texas-named-best-place-to-live-in-america"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Road Church, Gateway Prayer Garden, World Prayer Center,  Awakening Church, Iglesia Venga tu Reino, Living Hope Church, Cross  Fellowship Church, Revival Springs International, Dream Centers,  Academy Christian Church, Zeal Church, COSILoveYou, and Springs First  Church of the Nazarene for joining in hosting these 10 Days of Prayer  as well.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695195/recognizing-pastor-stewart-mcwilliams"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Washington. They want a government that works for them,  not against them. These five bills deliver on our promise to cut red  tape, empower families, and protect the American Dream.\n\nMs. LEGER FERNANDEZ.\n\nMr. Speaker, America is suffering. Americans don't recognize the  country we live in. Trump's tariffs have caused prices to soar. We have  the highest…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…organizing this evening's event.\n\nI am proud to say that this body just passed the Housing for the 21st  Century Act in a strong bipartisan manner. Owning a home is the  American Dream. It is one of the best investments any person can  possibly make here in America.\n\nAt a time when too many American families are struggling to afford a  home, House Republicans…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699812/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…passthrough entities. And these are the folks--these local  entrepreneurs are the ones--that create jobs and help employ hard- working Americans who are pursuing their American dream.\n\nRepublicans, it is good to announce or report or reassure that we are  united against these defenseless claims coming from the other side.  That doesn't mean they will stop.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…my team as the Press Assistant where she became a valuable team  member in keeping the American public updated on what our committee has  been doing to restore the American Dream.\n\nRecently, Kaley departed the House Committee on Energy and Commerce  to take on a new role as the Communications Director for Congresswoman  Kat Cammack (FL-03). While she…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691969/recognizing-kaley-stidham"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…advanced important provisions that drive  economic growth, uphold consumer freedom, and support entrepreneurship  and small businesses, reinforcing the foundations of the American Dream  for people and job creators nationwide.\n\nIt also advances needed government efficiencies by cutting waste,  modernizing technology and cybersecurity, and addressing unused…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Stevens have made to our  community as volunteers with Hope Services. Ralph and Stephanie have  gone above and beyond to support Hope Services as part of the  organization's Dream Team. They are always committed to helping others  and are a wealth of support to those in need. They give generously of  their time, talents and treasure. Their kindness,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691801/recognizing-ralph-and-stephanie-stevens"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…had done to the purchasing power of everyday Americans' accounts.\n\nPeople in probably both of our districts said the same exact thing,  that they were watching the American Dream slip away from our kids and  grandkids because we couldn't necessarily be certain that the future  would be brighter under the current trajectory of this country.\n\nWe have…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…worked with President Trump to secure  historic SALT relief for Californians. That relief, combined with the  provisions in the Housing for the 21st Century Act, will bring the  dream of homeownership closer to reality for working families in my  district.\n\nFor far too long, working-class Americans have been priced out of the  housing market. The Housing…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699800/housing-for-the-21st-century-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…and ends the ZIP Code lottery.\n\nIt even helps families build for the future, establishing newborn  investment accounts to grow generational wealth from day one.\n\nThe American Dream is alive and well in Utah, and the One Big  Beautiful Bill Act is how we keep it that way.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694790/promises-made-promises-kept"}]