[{"senator": "Jared Huffman", "party": "Democrat", "sentence": "…health of the entire bay- delta, the largest estuary on the West Coast of the Americas. This  delta is the heart of California's water system. Its health underpins  clean drinking water for millions, healthy soil for agriculture, and  waterfowl populations that hunters depend on.\n\nIt is so important, and it requires a broad ecological balance to  sustain…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Lakes, communities use these funds to intercept plastic  before it reaches open water, cleaning up shorelines, restoring  habitats, and keeping microplastics out of the drinking water systems  that serve millions of people.\n\nThis program doesn't stop at cleanup. It fuels economies and  strengthens resilience. Since its creation in 2006, the Marine Debris…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698190/save-our-seas-amendments-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…country's population experiences life-threatening levels of hunger.  Diseases such as cholera have spread as an increasing number of  Haitians lack adequate access to drinking water, food, and healthcare.\n\nEvery family that is employed through the HOPE/HELP trade preference  before us today for extension is a family less vulnerable to gang  coercion,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698851/haiti-economic-lift-program-extension-act"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…financially under the  policies of the current administration.\n\nThis bill shifts the cost of pollution from polluters to American  families who will have to spend more for safe drinking water and access  to water-related recreational areas if such resources are even still  available.\n\nMembers of this committee on a bipartisan basis have supported  predictability…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698022/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Water Act has provided the  federal government with the means to hold polluters accountable for  contaminating our Nation's wetlands, rivers, lakes, and sources of  drinking water. The Clean Water Act, in many cases, has been the sole  reason why decades of pollution threatening the health of our  communities has been reversed and why countless bodies of…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698148/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…a vital investment that has  brought over $3.7 billion to our complex ecosystem to restore our  wetlands, to clean up toxic waste in hotspots, and to protect our fresh  drinking water. It is complex with lots of industry, lots of  agriculture, lots of people, and lots of freshwater.\n\nWe must fully fund the GLRI. Every dollar brings back four to our…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690375/great-lakes-tariffs-and-trade"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…before the Senate  Committee on Indian Affairs to remind Congress of the Federal  Government's responsibility to ensure all of Indian Country has access  to clean, reliable drinking water.\n\nChairman Heart also understood that the strength of a sovereign  Tribal nation lies in the preservation and vitality of culture and  language for future generations.…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696559/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Southwest Georgia Regional  Hospital closed, the nearest ER became 40 miles away, a life or death  distance.\n\nRural healthcare is not just about hospitals and doctors. Clean  drinking water, wastewater upgrades, and broadband are necessary for  health and survival. Rural areas simply don't have the tax base to  modernize these systems alone, so Congress must…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696850/national-rural-healthcare-week"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…upgrade that  infrastructure so they would know that when there is a natural disaster  the water infrastructure will survive it and the people in the region  will have clean drinking water. The Department of Homeland Security  canceled that grant, saying it had nothing to do with natural  disasters.\n\nMr. Speaker, I think we all want to be sure that a water…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…life design. Some of these tanks are leaking over 1,000 gallons of  waste in a year into the ground. So this waste is making its way to the  Columbia River, which supplies drinking water to nearly 30,000  residents in the Tri-Cities.\n\nThe Federal Government, as I mentioned, is legally and morally  obligated to clean up the dangerous mess it left on the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695342/hanford-site-cleanup"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…the very lands that  represent the anvil on which our Nation's character was forged.\n\nThe truth is that the roadless rule protects us from wildfires; it  ensures clean drinking water for communities; and it sustains wildlife  habitat for wildlife and for sportsmen.\n\nWildfire prevention is at the heart of why the roadless rule is so  important. Eighty-eight…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…landscape. They are part of our economy, our identity, and our  heritage. They are more than 20 percent of the world's freshwater and  must be protected.\n\nThey provide drinking water to millions. They are home to a thriving  ecosystem for a wide breadth of species. They support countless jobs.  Our Great Lakes' fishing economy alone is worth more than…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698194/great-lakes-fishery-research-reauthorization-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…substances known as PFAS. Exposure to small amounts has been  linked to cancer, fertility issues, and immune system failure.\n\nThis year alone, the EPA has delayed enforcement on drinking water  limits for PFAS, fired EPA scientists researching new forever  chemicals, terminated grants for PFAS studies, and approved pesticides  known to have PFAS.\n\nAcross the…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697919/making-americans-less-healthy"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…was a postdoctoral researcher at the       EPA Office of Research and Development. Most of my research       focused on clean water and human health, such as drinking       water, recreational water, and efforts to prevent pollution.       My research projects included the impact that wildfires have       on drinking water quality. My work is not political,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688224/fired-by-president-trump"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…going to increase the burdens on Louisville taxpayers  and everyone who is downstream on the river.\n\nThe second article today is from The Washington Post. Mothers whose  drinking water was downstream of sites contaminated with PFOA and PFOS,  both of which are considered likely carcinogens, were much more likely  to lose their babies and more likely to…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698038/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…made possible include investment in  community and educational facilities, transportation infrastructure,  and initiatives to protect the environment and access to clean drinking  water, all while ensuring accountability and preventing waste of  taxpayer funds.\n\nMr. Speaker, I ask my colleagues to join me today in celebrating the  lifetime of work that…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688911/recognizing-mr-bill-ellis-for-his-contributions-to-long-island"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…occurring heavy metals and radionuclides. According to the Southeastern  Colorado Water Conservancy District, 18 of those communities are  currently failing to meet Federal drinking water standards due to these  contaminants.\n\nH.R. 131 passed the House Committee on Natural Resources and then the  House of Representatives in July 2025. However, President…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698703/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…spotted crawling out of  faucets and creeping across the floors of another. While some have been  described as cold, gray eyesores, others are literally deathtraps. The  drinking water in many sat stagnant for so long that it turned into a  deadly potion of toxic metals and biohazards.\n\nRenovations and upgrades to make the horrifying offices habitable…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696486/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…streams across Iowa. This year alone, the Raccoon and  Des Moines Rivers exceeded Federal nitrate limits multiple times,  requiring expensive water treatment to provide safe drinking water for  more than 600,000 Iowans.\n\nMore than 600 water segments across Iowa are now listed as impaired,  with just over 60 percent of our nutrient-impaired watersheds remaining…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698032/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…hazardous or toxic       materials, including--\n\n(i) lead-based paint;\n\n(ii) asbestos or products that contain asbestos;\n\n(iii) black mold;\n\n(iv) radon; and\n\n(v) contaminated drinking water; and\n\n(H) an assessment of the need for, and estimated cost of,       remediation of such toxic materials.\n\n(2) An evaluation of the process used by the Coast Guard to…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…introduced by Representative  Titus.\n\nSouthern Nevada is one of the fastest growing regions in the country,  and with growth comes increased demand for critical resources like  drinking water.\n\nRight now, nearly 40 percent of the Las Vegas Valley's water is  carried through a single pipeline that was built in the 1990s. That is  a huge vulnerability. If that…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698162/sloan-canyon-conservation-and-lateral-pipeline-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…the result is we have a measure that will strengthen our  energy security, our mineral security, and our national security.\n\nIt will continue to facilitate clean and safe drinking water. This is  a priority that so many of our colleagues have emphasized.\n\nIt will protect our public lands, and it will ensure that we are as  ready as we can be for the upcoming…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…Member  requests.\n\nThe bill invests $1.74 billion in 1,277 Community Project Funding and  Congressionally Directed Spending projects. These projects will improve  clean and drinking water infrastructure throughout this country.\n\nThis bill also fully funds all of our, what I call, must-pays, such  as PILT payments--payments in lieu of taxes--to States and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698758/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…legislation,  H.R. 655, the Dalles Watershed Development Act.\n\nThe City of The Dalles, located in my district, depends on its  municipal watershed for almost all of its supply of drinking water.  Protecting and managing this watershed is vital to the health, safety,  and future of The Dalles community.\n\nToday, that task is complicated by the fact that critical…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697752/dalles-watershed-development-act"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…including the COVID-19 pandemic. At a time when basic  services could not be taken for granted, he made certain that more than  500,000 Iowans continued to receive safe drinking water without  interruption. His leadership during that period and beyond earned the  Water Works national recognition, including the 2024 Gold Award for  Exceptional Utility…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694988/recognizing-the-retirement-of-ted-corrigan-after-35-years-of-public-service"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…understand something instinctively: When the government  makes a water promise, it should keep it.\n\nIn 1962, Congress authorized the Arkansas Valley Conduit to deliver  safe drinking water to rural communities in southeastern Colorado.  These communities grow amazing watermelons, cantaloupes, and chilies,  and support families who ranch and raise livestock.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698701/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…hardness, and manganese levels.\n\nThe Bureau of Reclamation has found that these contamination levels  are so severe that local communities could see the costs of their  drinking water triple without this legislation.\n\nContrary to what the veto message states, my bill does not authorize  any additional Federal funding. It simply modifies the repayment…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698700/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Members of Congress  but also communities throughout Texas. Under her direction, the Fort  Worth District's 25 reservoirs, which provide over one-third of Texas'  surface drinking water, are effectively managed.\n\nI am very proud of the years Kathy has spent not only with the Corps  but in service to the people of the United States of America and, in  particular,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691207/recognizing-kathleen-spillane"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…is  putting water back where it belongs. I would argue water, whole milk-- those are your one-two drink alternatives, and certainly not sugary  sodas. We all should be drinking more water. If you want to drink  something besides water, I would suggest whole milk. A big point about  whole milk to me is it satisfies one's appetite longer. You drink a  sugary…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…Gothenburg, Genoa, Shelby, Valparaiso that were beginning to require  really costly repairs--taxpayer dollars going home.\n\nThese projects are going to help secure safe drinking water and  sustainable infrastructure for residents across these counties.\n\nAnd after the EPA deemed the Santee Sioux Nation's water source ``not  consumable,'' I secured $8.25…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699921/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}]