[{"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…LNG export is good for America. That assumption is not only  irresponsible, but it is also dangerous and absolutely false.\n\nAnalyses have shown that increasing LNG exports drives up natural gas  prices here at home. DOE's own review last year could not have been  clearer: Unconstrained LNG exports will raise costs for American  families and harm our…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697083/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Health Month.\n\nMr. Speaker, I am a nerd. I am a proud nerd. Whenever there is an  awareness month, one of the first things I like to do is figure out, is  there a theme. It drives my staff crazy. There is a theme, as you have  heard, for 2025 for Men's Health Month, and it is very enlightening:  Closing the empathy gaps in men's health.\n\nNow, this theme…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692205/raising-awareness-about-mens-health"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…but the Trump administration has closed even that door,  turning off a basic level of dialogue.\n\nNone of this makes sense. Tightening sanctions increases suffering,  which drives people to our shores and to the border, but the  administration won't even talk to Cubans about migration. How do they  plan to return those they want to deport? Do they think…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692909/do-not-forget-the-crisis-in-cuba"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Americans and their pocketbooks.  At a time when Oregonians and Americans are already struggling with  rising costs, this bill locks in devastating cuts to health care and  drives up the cost of health insurance--in many cases significantly.\n\nJust a few months ago the Republicans passed a cruel budget in which  they paid for tax cuts for billionaires…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696722/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…identifications would not satisfy the bill's requirements.\n\nThe SAVE Act would severely restrict online voter registration and  mail-in registration and eliminate voter registration drives  altogether. It would make it harder or even impossible for up to 69  million married American women who have changed their names, because  their last name doesn't match the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690528/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…on Americans and their pocketbooks. At a time when  Oregonians and Americans are already struggling with rising costs, this  bill locks in devastating cuts to healthcare and drives up the cost, in  many cases, significantly.\n\nThe assault on healthcare and the Republican shutdown more broadly  are further proof that the first 10 months of this Trump administration…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696695/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…federalizing voter suppression.  The SAVE Act is nothing more than Jim Crow 2.0. If the SAVE Act were to  become law, online registration, registration by mail, and registration  drives become a thing of the past. If you are one of tens of millions  of Americans who does not have access to your birth certificate or if  you are one of the 50 percent of Americans…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699484/government-funding"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…making money from it.\n\nOverall, the Methane Emissions Reduction Program recognizes the  cleanest performers, holds companies responsible for their own leaks  and wasted methane, drives innovation, and creates a lot of jobs. The  whole idea is to get them to do the right thing. We even give them  money in order to accomplish that with their equipment, and…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…America must invest in innovation and  convene our best and brightest to map the road ahead.\n\nThis is increasingly true as artificial intelligence redefines our  society and drives rapid change, including in our communications  infrastructure.\n\nMr. Speaker, 6G networks will leverage AI to meet the connectivity  demand of American consumers and businesses.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690227/future-uses-of-technology-upholding-reliable-and-enhanced-networks-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…than a serious attempt to secure our elections. The SAVE Act  would make easy methods of voter registration--like online  registration, registration by mail, and registration drives--a thing of  the past.\n\nMassive purges would inevitably remove many American citizens from  the voter rolls, and it is already wholly unnecessary. Federal law  prohibits noncitizens…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690523/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…takes food away from the hungry, healthcare away from the sick,  and takes working people and makes their challenges harder, all to give  more tax cuts to billionaires and drives up our deficit by the  trillions--that should be the central conversation in our country.\n\nBut this President, almost as if he knows the unpopularity of his  bill, the betrayal…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692454/alex-padilla"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…reaches audiences worldwide, sharing stories of strength and  hope. Claudia also founded Rena's New Life Ministry, supporting  underprivileged families through school supply drives, Secret Santa  programs, and scholarships. She preserves gospel music through Quartet  Unstoppable and advocates for the elderly through Patience for  Patients, LLC. Her dedication…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690568/virginias-fourth-district-women-in-excellence-awards"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…note. Teachers all over our country: Don't expect just  the Government of the United States to do this. The American people are  powerful in their own right.\n\nIf you do shoe drives where you have a school or a company and you  see that everybody has some pairs of shoes that don't fit them that  still have a lot of good wear, then put them in a box and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…we should forgive him. We didn't  make a big deal out of that.\n\nWe have a law right now which allows for the deportation and the  inadmissibility of anybody who goes out and drives drunk and injures  somebody. If they are here unlawfully, they are kicked out anyway. We  are talking about permanent residents to the country. If they go out  and get a DUI…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693082/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…microbiologist and inventor before  finding her way to the law and federal service. She has dedicated her  professional life to making government a force for good, one that  drives progress and innovation and provides exceptional care to our  Nation's veterans.\n\nFor nearly 20 years at the Department of Veterans Affairs (VA),  Maryam brought her expertise…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695862/congratulating-ms-maryam-azarion-on-her-retirement-after-more-than-25-years-of-federal-service"}, {"senator": "John Boozman", "party": "Republican", "sentence": "…that their time in  the chapter helped prepare them to pursue service and leadership, and I  know that is the case for countless of their peers.\n\nFrom organizing defense stamp drives during World War II to  supporting literacy and mental health initiatives today, the women of  Gamma Nu have consistently demonstrated a deep commitment to uplifting  and giving…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695796/recognizing-100-years-of-the-gamma-nu-chapter-of-kappa-kappa-gamma"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…today to highlight an issue of  national importance: Our commitment to space exploration and Alaska's  vital role in securing America's presence in space.\n\nSpace exploration drives innovation, strengthens our economy, and  enhances national security. The investments we make today will shape  our future strength and prosperity as a Nation.\n\nAlaska, the…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687923/space-dominance"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…happening globally is the world's most successful  companies are investing in America, and $10 trillion is coming to our  shores. Record investment is driving job growth. It drives innovation  and drives opportunity.\n\nWe passed a comprehensive economic plan called the working families  tax cut law. It is the central part of our economic plan. I really…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698252/nominations"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…America's truckers work tirelessly to keep our  grocery stores stocked, our packages delivered, and our supply chains  moving. Ensuring they have a safe place to park between long drives is  common sense, and this bill delivers on that promise.\n\nAt the same time, we preserve housing assistance for the most  vulnerable, such as youth aging out of our Nation's…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699577/consolidated-appropriations-act-2026"}, {"senator": "Jim Banks", "party": "Republican", "sentence": "…now that this is not my grandpa's Democrat Party.\n\nMy brother Bradley who works for the Columbia City Street Department,  gets up every morning. He happens to have a CDL. He drives the  snowplow. He works hard to keep our small hometown in northeast Indiana  clean and the streets taken care of.\n\nHe doesn't wake up like you and I do every day and think…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700296/state-of-the-union-address"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…rural housing projects in Indiana and across the country that  rely on both HUD and USDA programs must undergo two separate  environmental reviews. This duplicative process drives up costs for  developers, delays construction, and discourages the very investment we  need to expand affordable rural housing.\n\nMy bill requires HUD and USDA to establish…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699812/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…and hands-on learning  experiences.\n\nThe students, faculty, and families at Hanford Christian are  dedicated to serving their community. Every year, they contribute to  food drives and volunteer with the Salvation Army and Gleanings for the  Hungry. Their community service impacts the community all year long,  including during the holiday season when…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698331/recognizing-hanford-christian-school"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…LANKFORD. Mr. President, I join my colleague in expressing some  frustration that we can't vote on the Chairman of the Joint Chiefs of  Staff. It is the kind of stuff that drives people crazy back home for  an individual that is the Chairman of the Joint Chiefs. Most people  back in my State of Oklahoma think this has already been done. But to  not…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690112/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…State  agency, it can still be forced through an additional duplicate  permitting process with the Office of National Marine Sanctuaries.\n\nThat extra layer adds years of delay, drives up costs, and  discourages investment without providing meaningful environmental  protection. H.R. 261 clarifies that once a project has been lawfully  approved at the State…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699956/undersea-cable-protection-act-of-2025"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…opportunity to save our  country from fiscal ruin. The formula is all there in the House budget  resolution.\n\nMr. Speaker, I urge my colleagues to demand that that is what drives  the bill at the end of the day. God bless America, and I yield back the  balance of my time.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Communist Party stays in power and expands its power base at home and  abroad through any means necessary, including coercion and violence.  This is the goal that we all know drives his decision making.\n\nLike many in the Senate, I frequently attend classified briefings on  China. We just had the INDOPACOM Commander testify today, Admiral  Paparo, who,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…national security, strengthen our economy, and improve the  lives of our citizens.\n\nOur unique research ecosystem, which combines Federal, academic, and  private R&D efforts, drives America's advancement in science and  technology. However, for this system to work, we need a degree of open  science that facilitates collaboration and transparency. The challenge…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688931/united-states-research-protection-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…large that 40 percent of all personal income taxes  go to paying interest on the Federal debt. Think about that. We have  over a trillion dollars a year in interest.\n\nSpending drives inflation. In 2024, the typical American family  needed an extra $17,000 a year to maintain the same standard of living  as January 2021.\n\nWe have increased spending, our budget,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "Mr. BEGICH. Mr. Speaker, I rise today in strong support of H.J. Res.  35, which repeals the Biden administration's natural gas tax, a  misguided policy that drives up costs, stifles investment, and weakens  our energy security. This so-called waste emissions charge won't reduce  methane emissions, but it will punish American producers,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688188/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…were called to serve in the  U.S. Armed Forces. Those who remained in Grass Valley continued to  support the war effort through various initiatives, such as organizing  blood drives, collecting scrap metal, and helping military families.\n\nThe history of the Rotary Club of Grass Valley is a testament to the  power of community spirit and collective action.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}]