[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…amphibious assault ship equipped with a flight deck for F-35s,  Ospreys, and attack helicopters; the MV Ocean Trader, a floating base  designed for special operations; reaper drones, Harriet jets, and fifth  generation fighters--incredibly lethal aircraft.\n\nBut this is not all. The largest aircraft carrier ever built, the USS  Gerald R. Ford is on its…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696564/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…foreign powers, who have increasingly spread their       influence in Libya.\n\nFor the Government of National Unity, this includes Turkey,       which deployed personnel and drones among other assets to aid       the Tripoli-based administration against the Libyan National       Army's advances in 2020. Ankara's role is defended by the       Government…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…and grit of the Ukrainian people.\n\nTheir success will go down as one of the most important feats of  modern warfare in this century, and their accomplishments in the use of  drones--an inventive use of drones--in their use of intelligence--our  intelligence and their intelligence--in their success in the  destruction of half or more of the Russian fleet…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688568/9999"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…reauthorization. Those are important to meet our national  security needs, as well.\n\nThere is also a very important component on countering UAS  domestically. The threat the drones pose to many of our military  installations and other sensitive areas in the country is a real  problem. This bill takes a step toward trying to address that. I am  also very…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…drone in  the area, and it punctured a hole in the plane.\n\nOur historic fire crews cannot afford this delay. It is not just  happening in Oregon. There has been an increase in drones interfering  with fire responses across the country. We know that a quick response  is critical to containing wildfire and saving homes and lives. That is  why I introduced…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698693/delayed-wildfire-response-efforts"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…is an easy task for our great military. But let's keep in mind that we  live in a world where there is asymmetric power. What am I talking  about? Take a look at what the drones--many of them pretty cheap pieces  of equipment--have wrought in countries like Ukraine in the midst of  their war. What would turn out to be a mass of force by the United…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696557/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…thing to an explanation came in a CNN interview with the  Secretary of the Interior a few days ago, who cited ``radar  interference'' and possible swarm attacks from undersea drones at the  wind farm as potential threats.\n\nMadam Speaker, here is the thing: During the yearslong permitting  process, BOEM meticulously investigated all national security concerns,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695066/halt-work-orders"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…technology into the Middle East.\n\nGuess what. They got what they wanted. The President has agreed to  move forward with sending our most sensitive drone technology, the  Predator drones, into the Middle East, selling them to Qatar. It is not  a coincidence that they are also willing to send him this jet.\n\nI had the chance this morning to talk to the Secretary…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Ecosystem Engineers, was pitched as an  aerospace technology company to manage and remove space debris, which  is a big problem right now. The technology used includes satellites,  drones, and AI to find the best route to locate debris and the focus of  the power of the Sun's rays to destroy the debris.\n\nI am eager to see what our students continue to do with…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691559/protect-the-afghans-who-served-us"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…determination to lead the people of  Ukraine, to push back the Russians; and in Odessa, the frontline forces  on the Black Sea who are not only detecting but destroying the invading  drones and missiles; and the faith community there who have remained so  absolutely supportive.\n\nThe fact is that Putin is bombing not only Ukraine--civilians in  their hospitals,…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700241/9999"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…law enforcement       support, paving the way for the incorporation of firearm       technology into ``less-than-lethal'' area denial devices,       robotics, and even armed drones. While some of these weapon       systems already exist--such as the TASER Shockwave,       effectively a TASER claymore that can shoot dozens, or even       hundreds, of projectiles…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…war on Zelenskyy and Ukraine,  Putin has ramped up the war, launching more aggressive attacks than he  ever has in the 3\\1/2\\ years of the war, and most recently, sending  drones over Poland, as well.\n\nWeakness invites aggression, and I know the proponent of this  amendment has said this many, many times, but apparently she doesn't  recognize weakness…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…metrics for the adoption of  critical emerging technology.\n\nFinally, it provides a narrowly tailored authority to the CIA to  protect its domestic facilities from unmanned drones, a gap in the law  that we have been seeking to close for more than 5 years.\n\nOnce again, I appreciate the strong bipartisan efforts on the IAA, as  well as the NDAA, and I…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697797/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…vote that Iran launched a set of attacks against Israel.\n\nThe defense aid that the United States provided enabled us to knock  down and assist Israel in knocking down Iranian drones and missiles.  That was a good thing. Had those drones and  missiles landed in Israel, they would have not only killed and wounded  tons of civilians, but they would have led…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Mr. DURBIN. Mr. President, last week, the world witnessed an  unprovoked violation of NATO airspace by Russia. Nearly 20 Russian  drones entered Polish airspace, some traveling up to 300 miles in the  country. For nearly 6 hours, NATO aircraft sought out and destroyed  these Russian intruders.\n\nThen this weekend,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695519/north-atlantic-treaty-organization"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…conduct suppression  activities, and support ground operations. As unmanned aircraft systems  continue to mature, they present new opportunities to strengthen aerial  operations. Drones can map fire perimeters, assist with suppression  efforts, enhance communications across large or remote areas, and even  deliver equipment. In the future, some missions currently…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700124/advanced-capabilities-for-emergency-response-operations-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…with the drug  cartels in Mexico, which they are.\n\nDrug cartels have better technology today than America's Border  Patrol agents. That is a disgrace. Mr. Speaker, you can see drones, and  you can see night vision goggles not with our Border Patrol agents. Do  you know who has got them? It is the Mexican drug cartels. Our Border  Patrol agents who risk…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…adversaries.\n\nIran has a well-established record of destabilizing the Middle East  and threatening its neighbors.\n\nThe Government of Iran is manufacturing weapons, including drones,  acquiring conventional weapons through malign actors, and supporting  those actors around the world by funneling weapons and financial  support. They do it through their…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690689/solidify-iran-sanctions-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…militarized. They are  terrorist networks that have convinced my colleagues they are nothing  more than small street gangs.\n\nThey control territory, run armed convoys, use drones for  surveillance, and communicate through encrypted networks like the  military. They terrorize entire countries with extreme violence, and  they terrorize the United States…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…over the Easter holiday, Russia then proceeded to launch  attacks into Ukraine that killed innocent civilians. More recently,  Russia launched two ballistic missiles and 165 drones, wounding 11  people, including 2 children.\n\nOne 54-year-old Kyiv resident, whose car caught fire during the  attack, expressed frustration at the lack of progress for peace,…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…carriers are  maybe not entirely obsolete but are not as valuable as they were 30  years ago. That should be obvious from what happened over the weekend  when Ukraine used drones to wipe out some aircraft thousands of miles  away in the Soviet Union, showing that the nature of warfare is  changing rapidly. Our defense budget should change rapidly with…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692064/monitoring-big-beautiful-bill-provisions"}, {"senator": "Mike Turner", "party": "Republican", "sentence": "…murderous aggression. Ukraine  is fighting on the front lines against Russian aggression. Vladimir  Putin is threatening NATO's eastern flank, including the Balkans.  Russian drones have flown over Poland. It is unbelievable that, after  Poland has been threatened, we are even debating this amendment today.\n\nIt has been warned that U.S. disengagement in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695258/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Department assessed that in the second half of  2023 alone, China supported the transfer of nearly $300 million worth  of semiconductors to Russia, including for use in missiles and drones.\n\nThe CCP's actions are blatant violations of U.S. export controls and  detrimental to our ongoing peace efforts. China's economic and  industrial support for Russia is a critical…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690679/economic-espionage-prevention-act"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…recorded at       or near the land and maritime borders of the United States,       which present a vulnerability in national security. With the       proliferation of affordable drones, a wide range of       groups, including malign actors, have sought to make use       of this capability. It is critical that the U.S.       Government has full situational…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698262/explanatory-statement-for-the-intelligence-authorization-act-for-fiscal-year-2026"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Marine safety or security entities.\n\n``(B) Vessel design and construction entities.\n\n``(C) Entities engaged in the production or research of       uncrewed vehicles, including drones, autonomous or semi-      autonomous vehicles, or any other product or service integral       to the provision, maintenance, or management of such products       or services.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…professor of pharmacy,  Dr. Shamly Abdelfattah); and\n\nJack Kennedy, Clerk of the Wise County Circuit Court, who was  instrumental in pioneering and championing the concept of using drones  for rural medical delivery in the Appalachian region.\n\nOther Notable Partners: Shelcy Mullins, Sr. Fairgrounds; Lonesome  Pine Airport manager, Jarrod Powers; RX Partnership…", "date": "2026-01-16", "source_url": "https://justfacts.votesmart.org/public-statement/1699162/recognizing-the-10th-anniversary-of-the-first-faa-approved-drone-delivery-in-the-united-states-commending-lets-fly-wisely"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…colleagues  participated in, just as it has been sponsoring Hezbollah and the  Houthis to attack Israel just over this past weekend, amassing  ballistic missiles, building armed drones, and expanding its nuclear  weapon program at an alarming rate.\n\nThe Iran threat is wide-ranging and multifaceted, and the Iran  Sanctions Act is the foundation of our tools…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690688/solidify-iran-sanctions-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…our national defense  and build a military that can defeat the threats of today and tomorrow.  We are boosting shipbuilding, expanding our Air Force fleet, and  investing in drones and counterdrone technology. We are restoring our  defense production capacity so that we can make more munitions here in  America. We are protecting the homeland with missile…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693279/one-big-beautiful-bill-act"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…The Advanced Capabilities for Emergency Response Operations Act, also  known as the ACERO Act, which I introduced earlier this year,  authorizes NASA to leverage the use of drones to fight wildfires. This  project is especially helpful when there is low visibility, heavy  smoke, or unsafe conditions for our firefighters to fly. This piece of  legislation…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687922/space-dominance"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…Congress, have an obligation to fully understand the  impacts of utilizing the LPTA.\n\nOne example of when the LPTA may not be appropriate relates to the  procurement of Chinese drones.\n\nChinese drone maker, DJI, is the world's largest manufacturer of  personal and professional drones, and Federal agencies to this day  utilize DJI drones, which present a…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688341/safe-and-smart-federal-purchasing-act"}]