[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…country, now wants to turn the  metaphorical war on drugs into an actual, physical war on drugs.\n\nWell, Donald Trump's real interests in supporting dictators and big- time drug dealers were made clear with a series of Presidential pardons  of major drug dealers, including the former President of Honduras, Juan  Orlando Hernandez. The guy was sentenced…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698444/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…they were, an intentional  decision was made not to stop the ship and, instead, to kill the people  on it.\n\nThere is no congressional authorization for a President to kill drug  dealers at home or abroad. This killing on the high seas is not  authorized by international law.\n\nThe President cannot declare anyone he wants to be a criminal or an  enemy combatant…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…offers.\n\nCryptocurrency literally means hidden money, and these stablecoins  are exempt from the anti-money laundering provisions. Thus, it meets  the needs perfectly of drug dealers, human traffickers, sanctions  evaders, those who are hiding assets from their former spouses, and tax  evaders.\n\nJust to be clear, the Republicans rejected unanimously…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693831/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "Mrs. TORRES of California. Mr. Speaker, I rise today to speak out  against the narrative being promoted about immigrants, portraying them  as rapists, drug dealers, and murderers.\n\nThese claims are nothing more than a self-reflection of our country's  leaders who promised to protect Americans and enforce the law, yet  whose actions…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697448/fighting-dhs-immigration-raids"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…that we were on  this floor. If he were so serious about drugs, I asked the chairman  previously: Why would the President of the United States pardon one of  the biggest drug dealers who was killing Americans, Juan Orlando  Hernandez. The last time, the gentleman said that he hadn't spoken to  the President and didn't know why.\n\nMr. Speaker, if he is…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…perhaps, the logic that these really  aren't military operations or hostilities; they are premeditated  attacks to produce lethal effects on people who may or may not be drug  dealers.\n\nThis new interpretation creates a dangerous precedent. If standoff  weapons exempt military operations from congressional oversight, we  have effectively granted the…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…and Trump has  announced that he is going to do just that with our tax dollars going  into his crypto.\n\nMr. SHERMAN. Finally, this creates the perfect financial tool for  drug dealers and for tax evaders because every time a billionaire  cheats on his taxes, a member of the Freedom Caucus earns his wings.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693774/digital-asset-market-clarity-act-of-2025"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…walked here from Venezuela. They went  through the Darien Gap. They dealt with the forest. They dealt with the  snakes. They dealt with the predators. They dealt with the drug  dealers.\n\nThey came into our country at great personal risk. They are going to  see a 30-second ad praising Donald Trump and decide to walk back or  even fly back? What a stupid…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…friends, classmates, and neighbors did not have to either.  Thanks for your time.''\n\nMr. Speaker, this administration said they were going to go after  dangerous criminals and drug dealers, but what they are doing instead  with this disastrous mass deportation effort is creating fear and  stress across the country including among young children.\n\n``I wish…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689733/challenges-facing-our-students"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…the floor being told that Venmo and its competitors  are so wonderful that there should be absolutely no regulation.\n\nOn the one hand, we have to create a new currency for drug dealers,  and, on the other hand, the current system using the U.S. dollar  shouldn't even be regulated because it is perfect.\n\nWhy do we need to regulate here? First, to prevent…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689952/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…courts and in jail, be pardoned if this is about drugs. I  am waiting for an answer. I haven't heard that yet.\n\nMr. MEEKS. Mr. Speaker, I am still waiting to hear why major drug  dealers, two major drug dealers, were pardoned by the President of the  United States. I will wait.\n\nNothing?\n\nKamlager-Dove), the ranking member on the Subcommittee  on South…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…the socialists are still in power. Delcy  Rodriguez is a true believer in the same ideology and party that Hugo  Chavez and Nicolas Maduro championed.\n\nWas it to remove drug dealers in the hemisphere? No, the same  Venezuelan Government that he says is dealing drugs is still in charge  because of him.\n\nSo clearly this is not about socialists, and it…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699362/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…make hundreds of millions for his campaign and  billions for his family by signing up with the crypto bros.\n\nThis is crypto week. It is also tax evaders month, national drug  dealers' day, and human traffickers Tuesday.\n\nVote ``no'' on this rule. Release the Epstein files. Don't try to  distract us and say that the reason we can't protect girls in this…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693548/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…Mr. Speaker, I didn't come here with prop photos because I am here to  debate substance. I am here to find out why the President of the United  States pardoned convicted drug dealers. I have not gotten an answer to  that yet.\n\nIf we are talking about pictures, I could have come with pictures of  President Trump with his arm around Kim Jong Un. I could…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…submarine,  and dozens of F-35s already in the Caribbean, the USS Gerald Ford  strike group surging toward the region, the stage for folly is set. We  are told that only drug dealers are the target of U.S. operations, but  the consolidation of the largest U.S. force in the Caribbean in 35  years suggests that regime change may very well be the intended…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…traffickers, drug runners,  child predators, murderers, and thugs. Now thugs are rioting and  burning Los Angeles, all because ICE is arresting and deporting  killers, rapists, and drug dealers.\n\nThey are attacking local police, Federal agents, and the rule of law.\n\nI think they would have learned, but they have doubled down. They are  supporting mayhem, burning…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692194/los-angeles-protests"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…with  them in the morning. And we wonder why our children have mental health  concerns at such an increasing rate.\n\nDrugs, lethal drugs, fentanyl--more children meet their drug dealers  online.\n\nSexual exploitation, where our kids are meeting traffickers and  predators and pedophiles online.\n\nHuman trafficking; and the list goes on and on.\n\nThe reason…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…delivered the largest tax cut for middle- and working-class  Americans in history, like no tax on tips and no tax on overtime.\n\nIt is a fact that the southern border is closed. Drug dealers, sexual  predators, human traffickers, and those who illegally invaded our  country during the Biden administration from over 160 countries are  being returned to the country…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…unprecedented invasion of illegal       immigration, resulting in the influx of limitless criminal       aliens--including murderers, rapists, child traffickers and       smugglers, drug dealers, and more--entering the United States       and further enriching foreign terrorist cartels. President       Trump took immediate action to seal and secure the border.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695364/stop-illegal-entry-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…began deporting criminal illegal  immigrants. They are here in the country illegally, and they were  criminals--heinous crimes. We are talking about murderers, rapists,  drug dealers. The word got out around the world. Illegal border  crossings in February dropped to an alltime low.\n\nPresident Trump said he would unleash American energy. He has kept…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688471/joint-session-of-congress"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…struck 35 drug boats smuggling drugs that kill Americans.  They have seized seven oil tankers attempting to evade sanctions.\n\nIt is very simple. Let's not protect those drug dealers, those  cartels. Let's protect the American people. The way to do that is to  vote ``no'' on this resolution.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699368/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…President Trump made those words real. He used military force in the  advancement of a national security interest of this country: to stop  Venezuela from being a safe haven for drug dealers and international  terrorists.\n\nHe has a plan to rebuild the country and eventually transition it,  through an election, to a new regime. Regime change will come to  Venezuela…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…to force Canada to stop the flow of illicit  drugs. In fact, one of the social media posts today said there was  going to be a tariff on fentanyl. Really? You think the drug dealers  are going to pay a tariff on fentanyl? Fentanyl is not being tariffed.  That is some kind of mistaken notion. This isn't going to happen. As I  have stated, there is more…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}]