[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…authorize the use of power has been usurped by the Executive. This  administration has carried out at least four military strikes against  vessels that it asserts have ties to drug trafficking organizations.  These strikes were not authorized by Congress. Congress has not been  shown the evidence of who exactly was on board these ships, whether  they were all…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…invest in the people we serve, or we can let  Republicans burn it down.\n\nI am fighting for $2 million to help our Dallas Police Officers  tackle violent crime, gangs, and drug trafficking. I am working to  secure over $1 million to upgrade security at Dallas Fort Worth  International Airport because keeping Americans safe should not be up  for debate.…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688712/dont-vote-for-a-bill-that-dismantles-the-government"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…months, President Trump has  ordered 16 airstrikes in the Caribbean and eastern Pacific, killing  more than 65 people. His administration boasts that they are targeting  drug-trafficking organizations. Yet Congress and the American people  have received minimal information about the intelligence supporting  these strikes, the legal framework governing…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…fishing  vessels?\n\nWe all need to see that this has quickly become so much bigger and so  much more dangerous. And maybe that was the point, to focus the  narrative on drug trafficking so we don't recoil from what may be right  around the corner with Venezuela, and that is the use of force to  achieve the goal of regime change.\n\nI understand the President,…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696564/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…one of those that I would like to discuss, where we should  see more involvement from the Coast Guard, is what we are currently  seeing in the Caribbean with regards to drug trafficking, which is a  problem and presents a clear and present danger to the citizens of this  country, and it is something we need to do more about.\n\nI was on one of the cable…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696346/trump-administration"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…hands on guns; putting in a short but meaningful waiting  period when young people are hastily buying an assault weapon; making  it easier for law enforcement to go after drug trafficking rings. It  was five meaningful changes, but it was also a big investment, a big  investment in the kind of services that can help interrupt violence.\n\nA lot of my Republican…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…their constitutional war  powers authority, allowing the Trump administration to carry out  extrajudicial killings off the coast of Venezuela under the guise of  stopping drug trafficking. Meanwhile, Trump just pardoned the President  of Honduras, who was convicted of helping to move 400 tons of cocaine  into the United States. My colleagues need to square…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697771/intervening-in-gops-relationship-with-president-trump"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "Mr. NADLER. Mr. Speaker, prior to the Trump Administration, the  United States followed a policy of interdiction to combat drug  trafficking in the Caribbean. Over the past decade, that approach led  to a steady decline in Venezuela's role as a major drug transit route.  It relied on stopping vessels, inspecting…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698324/supporting-the-war-powers-resolutions"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…said he would  give a full and complete pardon to Juan Orlando Hernandez, the corrupt  former President of Honduras. It is disgusting.\n\nTrump is going to erase a major drug trafficking conviction against  Hernandez, who is serving 45 years in Federal prison for his crimes. He  was convicted by an American jury for working with drug cartels to move  400…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697176/juan-orlando-hernandez-former-president-of-honduras"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…NED exposes Russian propaganda, counters Chinese Communist Party  censorship, circumvents the Iranian regime's efforts to silence  critics, and highlights corruption and drug trafficking in Venezuela.  And it does all of that for a fraction of a penny on the dollar.\n\nLet's be perfectly clear. Letting authoritarians go unchecked  directly undermines our…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699435/consolidated-appropriations-act-2026"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…tyranny and establishing a democracy since Trump outright dismissed any  possibility of helping the opposition party to build a true democracy.  And it is clearly not about drug trafficking. After all, not even a  month before this, President Trump pardoned the former President of  Honduras who was convicted of the same crime. But the real reason--it  is…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698684/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…an egregious  abuse of power by the Secretary of Defense. Back in September, an order  was reportedly carried out to eliminate all remaining survivors on a  suspected drug trafficking boat sailing through the Caribbean.\n\nPete Hegseth, who now calls himself Secretary of War, issued an order  to kill everybody who survived the first strike. Kill everybody.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…strikes and Trump's naval blockade represent appalling  violations of international law and Congress' constitutional authority  to authorize the use of military force.\n\nDrug trafficking is a serious offense. Communities across the United  States have seen the devastating impact of addiction. But that does not  give Donald Trump the right to go to war,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698246/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…people is  a joke.\n\nIf this were about drugs, why seize an oil tanker and threaten an  illegal Navy blockade? If this were about drugs, why would the  President pardon a drug-trafficking former President of Honduras?\n\nThis is not about drugs. This is about regime change and control of  Venezuela's resources.\n\nNicolas Maduro is a dictator, and you don't…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698448/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…stopping drug traffickers, I don't think there would  be disagreement or objection here to a law enforcement-based approach  to do exactly that. Of course, we want to stop drug trafficking. But  the Trump administration seemingly can't decide if it wants to be crime  fighters or warmongers, and they have decided to use the U.S. military  to bomb their way…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…truckdrivers who were arrested in Northwest Indiana during Operation  Midway Blitz. These aliens were found guilty of numerous crimes,  including driving under the influence, drug trafficking, theft,  burglary, assault, child abuse, domestic battery, prostitution, and  fraud. More than 40 of them had been issued a commercial driver's  license by States like…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…bring to  justice a murderous dictator and an indicted drug trafficker. Maduro is  an outlaw, and he is now in custody. The Trump administration indicted  him in 2020 on drug trafficking charges. President Trump put a $15  million bounty on him. The Biden administration agreed, and they  actually increased that amount to $25 million. Neither the first…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698571/venezuela"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…offices and police  departments in Kansas and across the country. The legislation also  equips the Drug Enforcement Agency and the FBI with resources necessary  to dismantle drug trafficking networks that have gained, unfortunately,  a stronghold and a foothold in the United States and to combat the  fentanyl crisis that continues to claim way too many American…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…would be voting against for the FY26 Defense  Appropriations Act.\n\nThey would be voting against a pay raise for American troops and  border security investments to counter drug trafficking.\n\nThey would be voting against investments for critical ships and  aircraft, against modernization of America's nuclear triad, against  missile warning systems and technology,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693646/department-of-defense-appropriations-act-2026"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…poison.\n\nVenezuela has been taken over. The Venezuelan people are held hostage  by a foreign terrorist regime that uses their land as an operating base  for international drug trafficking, fueling a crisis that has cost  nearly 400,000 Americans their lives since 2021.\n\nThis resolution would have us pull back from the fight against  designated terrorist…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698445/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…and  space exploration, the CJS bill before us puts the Nation on a path to  greatness while reinforcing President Trump's bold agenda on trade and  combating illicit drug trafficking.\n\nTo continue the fight against the drug cartels that are ravaging  American communities, the Drug Enforcement Administration receives an  increase of $63 million in this…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698761/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…future of Venezuela, well, of course, it is ultimately up  to the Venezuelans. The interim authorities in charge in Venezuela  today know what we expect of them: Stop the drug trafficking and the  weapons trafficking. Accept the return of their refugees and migrants.  Release political prisoners. Expel the Iranians, the Cubans, the  Islamic terrorists,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…national emergency that--\n\n``(i) the President has declared, within the preceding 5-      year period, with respect to any national emergency regarding       international drug trafficking; and\n\n``(ii) has not terminated.''.\n\n(b) Consultation and Reports.--Section 204 of the       International Emergency Economic Powers Act (50 U.S.C. 1703)       is amended--…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694826/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…doing. They arrested a  criminal illegal alien from Somalia with a record of multiple counts of  credit card fraud, drug possession, controlled substance possession,  and drug trafficking. This criminal was issued a final order of removal  in 2022.\n\nICE also arrested a criminal illegal alien from Laos with three prior  convictions for selling drugs as well…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699072/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Working Families Tax Cut law signed by the  President on July 4, securing historic support for the Byrne JAG and  COPS Programs for local police as well as efforts to combat drug  trafficking.\n\nAdditionally, four bipartisan bills the Judiciary Committee passed  during Police Week in May became law with the passage of the National  Defense Authorization Act.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698692/national-law-enforcement-appreciation-day"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…a war against a  sovereign nation or a legitimate President.\n\nThis resolution presented by the Democratic Party would tie President  Trump's hands in the fight against drug-trafficking terrorists. Every  Venezuelan knows that Maduro is just a thug and a delinquent who has  been in the drug-trafficking business for 27 years since he took over  the country.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698241/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the anti- American rhetoric and strategy by adding the goal of becoming a  narcostate.\n\nFrom 2014 to 2015, the United States began to sanction Venezuelan  officials for drug trafficking.\n\nIn 2017, the United States escalated sanctions against the Maduro  government for its links to the illicit drug trade.\n\nIn 2019, the United States no longer recognized…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698884/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Res. 90.\n\nWithout going into all the details, they say that S.J. Res. 90 fails  to account for the extraordinary national security threat posed by  transnational violent drug-trafficking cartels and narcoterrorists  operating in and around the Caribbean Sea. That really says it all, and  not much more needs to be said, but I do have a few comments on this.…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696565/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…exercising their First Amendment rights.\n\nThe bill also strengthens our defenses against foreign criminal  networks. In addition to nearly $300 million for the High Intensity  Drug Trafficking Areas program, the bill strengthens the Treasury's  counterterrorism and financial intelligence efforts, cutting off  funding streams used by cartels, traffickers, and…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699046/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Ted Budd", "party": "Republican", "sentence": "…Carolina for their role in the success of Operation Uptown Funk. Now,  that is a pretty creative name, but it is a very serious issue. It was  a yearlong investigation into drug trafficking in Appalachia.\n\nThis coordinated operation has involved law enforcement agencies from  Buncombe, Henderson, Haywood, and Transylvania Counties in North  Carolina as well…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693099/operation-uptown-funk"}]