[{"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…strong opposition to H.R. 875.\n\nI, too, take DUIs extremely seriously. According to the National  Highway Traffic Safety Administration, approximately 37 people die in  drunk driving incidents every day in the United States. As the ranking  member has just been noting, there are many things that we can and  should do to prevent driving under the influence.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693080/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…often driven by union       intervention. Even more troubling, the department made no       attempt to fire more than 40 officers involved in criminal       conduct such as drunk driving, harassment, property damage,       theft, and stalking. Every officer credibly accused of       domestic violence remained on the force, including one       officer who…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "Mr. CLYBURN. Mr. Chair, I rise in opposition to the amendment.\n\nMr. CLYBURN. Mr. Chair, the bipartisan infrastructure law requires  drunk and impaired driving technology to become standard equipment in  new cars once a rule has been finalized by the Department of  Transportation.\n\nMore than 30 people in the United States…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699287/amendment-no-1-offered-by-mr-massie"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…the MN  Chiefs of Police Association ``President's Award'' and the MN  Department of Public Safety's ``Distinguished Public Leadership  Award''. Last year, Mothers Against Drunk Driving awarded Chief Tate  and the Shakopee PD their ``Outstanding Law Enforcement Agency Award''.\n\nI am grateful for Chief Tate's public service and share his love of  country…", "date": "2026-02-13", "source_url": "https://justfacts.votesmart.org/public-statement/1700084/congratulating-chief-jeff-tate-on-his-retirement"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…misconduct.\n\nLet me provide examples of the types of officers the department had  to rehire: officers convicted or arrested for child abuse, sexual  assault, indecent exposure, drunk driving causing injuries, domestic  violence, and assaults while off-duty. D.C. also had to provide  millions of dollars in backpay to those officers it was forced to  rehire.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. PALLONE. Mr. Chairman, I rise also in strong opposition to this  amendment.\n\nIn 2023, 12,429 people died in drunk driving crashes nationwide. In  Kentucky alone, 198 people were killed. In  Pennsylvania, 321 people lost their lives. These deaths were  preventable.\n\nAdvanced drunk and impaired…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699286/amendment-no-1-offered-by-mr-massie"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…These grants are the primary source of Federal funding for thousands  of victim service providers across America, including programs serving  victims of human trafficking, drunk driving, domestic violence, sexual  assault, and child abuse. These are our people, our family members, and  our community members who are suffering who need the help.\n\nVOCA grants…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698843/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "With this strained legislation, we are bumping into two major social  problems: deadly drunk driving on our roads and a broken immigration  system. Alas, we are not doing anything to solve either problem. The  bill pretends to do something about both of them, but it really…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693082/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "Ms. GILLEN. Mr. Chair, I rise in strong opposition to this amendment.\n\nEvery day, 34 families lose a loved one to a drunk driving crash.  Drunk driving remains the leading cause of death on our highways.  Unfortunately, the problem is getting worse every year, despite  interlock devices.\n\nFar too many Long Island…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699283/amendment-no-1-offered-by-mr-massie"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…of making a terrorist threat. He was deported, and he came  back. In the years that ensued, he encountered law enforcement when he  committed battery, when he committed drunk driving, and when he  committed traffic infractions. He came back, and he stayed.\n\nI can't say with certainty that if ICE had done their job and shown  up, if the prosecutors had…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695358/stop-illegal-entry-act-of-2025"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…countless hours, having the same discussion over  the same people, the same people in this picture, over and over. There  are countless others that aren't here who died from drunk driving  incidents, died from drug overdose, human trafficked, lives destroyed  forever. If only they got to stay alive, if they even had that  opportunity to stay alive.\n\nThere…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…often someone in the United States dies  in a crash involving an alcohol-impaired driver.\n\nIn 2022 alone, there were 13,524 alcohol-impaired driving fatalities.  In 2020, drunk driving crashes led to nearly 400,000 injuries.\n\nThose crashes do not discriminate, Mr. Speaker. The victim could be  me, it could be you, it could be anyone in our families or…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693084/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…involving foreign nationals.\n\nThen gentleman from Alabama (Mr. Moore) and the gentleman from  Georgia (Mr. Carter) mentioned a few of the cases of aliens with  multiple drunk driving offenses released time and time again and not  deported, while the butcher's bill steadily grows.\n\nWhy are such people allowed to remain in our country? The Democrats…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693083/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…the mainstream media outlets  refuse to report on the many heinous crimes committed by illegal aliens  each year. These are individuals who have endangered Americans by drunk  driving.\n\nEvery 42 minutes, someone dies in a crash involving alcohol. As we  have seen in the news, many of these crashes  have been caused by illegal aliens who jeopardize the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Donner Summit. During this time, Lieutenant Doolittle developed  strong self-reliance and proficiency, and his work did not go  unnoticed. He received the Mothers Against Drunk Driving Award in both  2006 and 2008 for the most DUI arrests in the department and was  awarded the Sheriff's Pin by then-Undersheriff D'Arcy.\n\nWhile on patrol, Lieutenant Doolittle…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…highway funds that come with a  number of strings attached, a number of conditions. For example, States  have to abide by the 21-year-old minimum age for alcohol, various drunk  driving laws, and various vehicle weight laws, all of which are a  condition of receiving Federal highway funds.\n\nThe mechanism here is exactly the same, that States, as a condition…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…process, asking for feedback on how this thing could even  exist. It is just a bad idea, but it is in law, so our amendment would  defund that.\n\nMr. MASSIE. Mr. Chairman, drunk driving is a serious problem, but 31  States already have the technology to keep drunk drivers off the road  with ignition interlock devices that they can mandate. This technology…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699290/amendment-no-1-offered-by-mr-massie"}]