[{"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "\"Our state and local public health departments are at the forefront of this crisis and this federal funding will help them continue their critical work of mitigating and preventing further spread of coronavirus,\" Durbin said."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "We need the help of the Army Corps of Engineers right away, and I will continue to work with them to ensure key Illinois water infrastructure projects have the federal funding they need,\" Durbin said."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "\"Our first order of business must be the safety of our military and civilian personnel in Iraq and the region, and I call on the Trump Administration to make that the highest priority,\" Durbin said."}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "I will continue to work on a bipartisan basis to bolster the health care workforce, expand our testing capacity, and provide the direct assistance our hospitals throughout Illinois need to do their jobs safely,\" Durbin said."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "It will be absolutely critical for strong federal investments and a commitment to maintain the infrastructure for future generations of Illinoisans to enjoy,\" Durbin said."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "As we learn more about the situation in Illinois, specifically the racial disparities we are seeing in infections and death, we must adapt our strategies to ensure we are protecting those most at-risk and in-need,\" Durbin said."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "\"This federal funding will allow more patients to be treated remotely, which will free up space and resources and reduce the spread of coronavirus,\" Durbin said."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "I will continue to push the VA to act immediately to address any possible shortages of resources,\" Durbin said."}, {"senator": "Doug Jones", "party": "Democrat", "sentence": "Rick Scott in introducing this resolution calling on the International Olympic Committee to move the 2022 Winter Olympics out of Communist China, and relocate the games to a country where the government respects the dignity and human rights of all people.\"\n\n \n\nSenator Dick Durbin said, \"During the Olympics, the eyes of the world are on the country who hosts the Games."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "\"I urge communities throughout Illinois to take advantage of this funding opportunity, particularly those with concerns about ethylene oxide and similarly harmful emissions,\" Durbin said."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "\"The bill the Senate passed this week was historic in its scope and size, and thankfully much-needed financial relief will be coming to Illinois,\" Durbin said."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "\"Investments in early childhood education and parental support programs go a long way towards helping all children access their full potential and I'm proud to continue supporting this program.\"\n\n\"Head Start and Early Head Start programs are sources of countless success stories in our state and remain crucial for the healthy development of young children,\" Durbin said."}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "I look forward to continuing to work with Senator Duckworth and Congresswoman Bustos to bring these federal investments to Rockford,\" Durbin said."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "\"On my call with CDC Director Redfield, I expressed my concern over the drastic racial and ethnic disparities in COVID-19 cases and deaths, and emphasized the need to tackle the underlying public health gaps that are magnifying these health consequences,\" Durbin said."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "This has to be priority number one, period,\" Durbin said."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "\"I'm grateful to IG Horowitz for his commitment to expand his investigation and make his findings public so the American people can have an independent assessment of what is being done to stem COVID-19 outbreaks in federal prisons, which are hotbeds for infection,\" Durbin said."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "\"Reforming the H-1B and L-1 visa programs is a critical component of fixing our broken immigration system,\" Durbin said."}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "Durbin said."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "These teams are cherished parts of their communities and towns, and as a baseball fan myself, I'm proud to join this bipartisan resolution supporting our minor league teams,\" Durbin said."}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "Our modest, bipartisan bill, which passed the Senate this week, will help protect the right of the accused to any exculpatory evidence without placing undue burdens on prosecutors,\" Senator Durbin said."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Our legislation would end these abuses and protect American and foreign workers from exploitation,\" Durbin said."}]