[{"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…homage to the men and women who 5 years  ago risked their lives protecting the lives of those elected officials  who met in this Hall in fulfillment of their constitutional duties to  peacefully transfer Presidential power after the November 2020  elections.\n\nMr. Speaker, January 6, 2021, will be forever remembered for the  vicious unprecedented insurrection…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…struggling with rising mental health issues.\n\nI do not have confidence that, under Mrs. McMahon's leadership, the  Department of Education will continue to perform its core duties and  support students across the country, in all stages of their education.", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688592/confirmation-of-linda-mcmahon"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…the House. His extensive network of  colleagues and friends on Capitol Hill is a testament to the respect he  has earned throughout the institution.\n\nOutside of his official duties, Andrew has remained deeply involved  with the California State University, Northridge Semester in Washington  Program, where he teaches and mentors students pursuing careers…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698824/recognizing-andrew-heineman-and-his-service-to-the-united-states-house-of-representatives"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…constitutional authority over trade.\n\nArticle I, section 8 of the Constitution grants Congress power ``To  regulate Commerce with foreign Nations'' and ``To lay and collect  Taxes, Duties, Imposts and Excises.'' In other words, this is our job.  It is not always pretty, but Congress can provide stability and  certainty on trade that last beyond a single President's…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…office. With the Department  of Energy already struggling to meet its current obligations, how can  we pretend that it is business as usual and justify piling on  additional duties when there is no one to perform them?\n\nUnfortunately, this bill represents much of the same failed energy  policy that we have seen this year from our Republican colleagues.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697891/electric-supply-chain-act"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…forced out of their positions  simply for investigating crimes committed in the January 6  insurrection. These were professionals following the law, performing  their sworn duties, and yet their service was treated as disloyalty.  Careers were ended and decades of expertise were discarded just for  doing the job they were entrusted to do.\n\nWe have seen…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…associated with the government's collection of information       from individuals, small businesses, and state and local       governments, among others. The PRA imposes specific duties on       federal agencies before an agency can collect information       from 10 or more persons through identical questions or       reporting requirements, such as requiring…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…profound  responsibility that accompanies public service.\n\nAs public officials across the country are sworn into office, each  affirms a commitment to faithfully execute the duties of public office  and defend the Constitution of the United States. But more and more  Americans are losing faith that the actions of our public officials are  principally…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690041/valuing-truth-fullness-lessons-from-jury-trials"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…administration to give Members of Congress the full  details in a classified setting.\n\nCanceling or even delaying the briefing is completely unacceptable  and a failure of your duties and responsibilities to this body.\n\nMr. Speaker, the stakes could not be higher.\n\nFor more than 40 years, Iran has threatened its neighbors, threatened  Israel, the United…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692935/cancellation-of-iran-classified-briefing"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…reassert Congress's  constitutional authority. It is unfortunate that Democrats had to force  these votes under the War Powers Resolution just to ensure Congress  carries out its duties, despite Speaker Johnson's best efforts to keep  them off the House floor and avoid accountability.\n\nThe American people do not want another needless war, and I refuse to…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698324/supporting-the-war-powers-resolutions"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…Small  Business Advocacy Improvements Act.\n\nThis bipartisan bill would provide small businesses with improved  access to international markets by expanding the function and duties of  SBA's Office of Advocacy.\n\nIn particular, the bill authorizes the office to represent the views  and interests of small businesses in international discussions and  analyze…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687956/small-business-advocacy-improvements-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…employers to take a tip       credit--if workers receive (1) any amount of tips (2) over a       period of time selected by the employer, (3) regardless of       the employees' duties. Eliminating the requirement that       workers must be ``engaged in an occupation in which he       customarily and regularly receives more than $30 a month in       tips.''…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…need,  ensuring every law enforcement agency has a fair opportunity to secure  funding to support their work, to support the men and women, to support  their sacred and noble duties. We should work in a bipartisan way.\n\nSo I ask that the consent be modified such that my amendments to S.  180, S. 419, S. 539, S. 1316, and S. 1563, which are at the desk,…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…working families, and future  generations.\n\nMy district has asked me: Where is the solution to this?\n\nIt rests right in this Chamber. Let us assume the responsibilities,  the duties, the authority, and the power we have by the Constitution  with the power of the purse placed in our hands here in the House of  Representatives. Let's act accordingly.\n\nThey…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688070/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…them back once they are gone.\n\nI hope my colleagues will slow down on this tariff tirade. Under  article I, section 8 of the U.S. Constitution, Congress has the power  to set duties and regulate foreign commerce. However, Congress has  spent the last 80 years delegating its tariff authority to Presidents.\n\nYou can say, okay, well, that might have been…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Service, Joseph was honored to follow in the footsteps of his father,  Joseph, and his two brothers, Paul and Jeff. His career was defined by  an unwavering commitment to his duties, demonstrating an exemplary work  ethic that inspired colleagues and endeared him to the residents he  served. Regardless of inclement weather or personal hardship, Joseph's…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688925/recognizing-joseph-bongarzones-retirement-with-the-united-states-postal-service-after-37-years"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…many States prohibit public safety officers from using  firearms. In at least 12 States, correctional officers are unable to  carry firearms in the course of their official duties. Many State laws  also prohibit or restrict the use of firearms in schools and hospitals,  meaning security officers would be unable to purchase these devices if  they are…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700039/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…commission.--The Commission shall enforce       this section and any regulations promulgated under this       section by the same means, and with the same jurisdiction,       powers, and duties, as though all applicable terms and       provisions of the Federal Trade Commission Act (15 U.S.C. 41       et seq.) were incorporated into and made a part of this       section,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692751/wastewater-infrastructure-pollution-prevention-and-environmental-safety-act"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…obstruction of our law enforcement officers in the United States of  America.\n\nI just introduced the Halo Act to protect Federal officers while they  conduct their official duties, and I am proud to say that this week,  more of my colleagues have signed up to cosponsor this important  legislation. They have said: No more. Our heroes have to be able to…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697550/halo-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…integrity of and faith in the law  enforcement of the District of Columbia.\n\nFor instance, this law stripped law enforcement officers of many  tools needed to execute their duties safely and without fear of  retribution, as well as limited their options in situations of life or  death.\n\nIt also created new opportunities for antipolice activists to harass…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696934/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…today as the  people's business. We are the people's House. We are here to look after  the American people in the best way that we can. We are fulfilling our  constitutional duties. Unnamed, unaccountable bureaucrats pass rules  and regulations in this city every day that they should not be passing.\n\nCongress gave us the ability to stop them, and my colleagues…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…anyone  actually read the documents?\n\nWe actually start to walk through this. We are actually trying to  build models right now on trying to see what is coming in in custom  duties. That is the tariffs. What is that offsetting? You will see me  over the coming weeks with a couple of charts and start saying: Okay,  here is what we have to plug into our…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…determination       by the law enforcement officer's or first responders'       superior officer or employing law agency that the officer       acted outside of the scope of their duties or not in       accordance with the agency's official policies or procedures.\n\n(c) Commission on Medal of Sacrifice for Law Enforcement       Officers and First Responders.--…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699505/medal-of-sacrifice-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…do presentations. We have too many people, particularly even on my  side, who say things that aren't mathematically true. We hear  something, and we repeat it. The customs duties, tariffs, are helpful.  It is not as much money as so many people think.\n\nMr. Speaker, I am blessed to chair the Joint Economic Committee. I am  number four on Ways and Means.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…under subsection (a) may, as provided in appropriations Acts,       only come from within amounts authorized to be appropriated       to the Secretary to carry out the duties of the Federal Duck       Stamp Office.''.\n\nMr. STAUBER.  1098, the bill now under  consideration.\n\nMr. Speaker, I rise in support of H.R. 1098 to reauthorize the Junior  Duck…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698168/reauthorization-of-junior-duck-stamp-conservation-and-design-program-act-of-1994"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…out       such responsibilities;\n\n(D) describe the level and sources of Federal and State       funding received by each Mid-Atlantic River Basin Commission;\n\n(E) identify duties and responsibilities of each Mid-      Atlantic River Basin Commission that may be duplicative of,       or overlap with, other Federal authorities; and\n\n(F) review policies…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695003/mid-atlantic-river-basin-commissions-review-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…January 1, 1925, near Falmouth,  Kentucky, Anna Kathleen was the seventh of ten children on her parents'  farm. When her mother died at age 12, she immediately assumed the  duties of running the household, caring for her younger brothers,  cooking, and keeping the home, all while continuing her education and  graduating from Falmouth High School in 1942.…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696672/recognizing-anna-kathleen-cummins-kennedy"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…Whereas Representative McIver is alleged to have further interfered  with an Immigration and Customs Enforcement Deportation Officer engaged  in the performance of his official duties;\n\nWhereas body camera and other video evidence support the allegations  made within the Federal indictment;\n\nWhereas such actions constitute a violation of section 111(a)(1)…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694096/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…operational excellence. His assignments included  critical modernization work at Fort Knox, leadership roles at Fort Drum  with the 10th Mountain Division, and recruitment duties where he was  recognized as a top recruiter in the Great Lakes Battalion. His  innovations in integrating advanced battlefield  technologies helped propel the Army into a new…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691145/recognizing-sergeant-first-class-leidlein-as-may-2025-veteran-of-the-month"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Architect of the Capitol, the Secretary of the Smithsonian       Institution, and such other entities of the Federal       Government as the offices consider appropriate.\n\n(c) Duties of Architect.--The Architect of the Capitol       shall--\n\n(1) prepare the Time Capsule to be sealed and buried on the       West Lawn of the Capitol, at a location specified…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688200/semiquincentennial-congressional-time-capsule-act"}]