[{"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…housing crisis. One part  of the solution to that crisis, though, lies right in our backyards.  The solution has many names: granny flats, backyard cottages, or  accessory dwelling units, but all expand our affordable housing supply.\n\nWhen I was mayor of San Jose, we made building backyard apartments  easier by enabling thousands of homeowners to be…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693705/america-faces-a-housing-crisis"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…maintain my lawn in whatever fashion I want. That is  something we do in a free-market economy.\n\nIn a socialist economy, the government runs everything. If I want to  rent a dwelling, I have to rent from the government. If the government  doesn't like me, if I have said the wrong thing, or if I have said  something that is politically incorrect, they may…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…relevant years later for the October 7 much larger calamity,       raising troubling questions about a peaceful future. ``Have       we forgotten that this group of young people dwelling at       Nahal Oz is bearing the heavy gates of Gaza on its shoulders?       Beyond the furrow of the border, a sea of hatred and desire       for revenge is swelling awaiting…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690665/israel-at-77"}, {"senator": "French Hill", "party": "Republican", "sentence": "…requirements       and maximum building heights and the reduction in minimum lot       sizes and set-back requirements;\n\n(iii) the elimination of restrictions against accessory       dwelling units;\n\n(iv) increasing by-right uses, including duplex, triplex,       or quadplex buildings, across cities or metropolitan areas;\n\n(v) mechanisms, including proximity to…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…services that may be       selected by a purchaser of covered services.\n\n(9) Short-term rental.--The term ``short-term rental''       means a property, including a single-family dwelling or a       unit in a condominium, cooperative, or time-share, that       provides covered services (either with respect to the entire       property or a part of the property)…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690200/hotel-fees-transparency-act-of-2025"}]