[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…and our  people.\n\nThose who know him can rest assured they will never ever meet his  likes again. May God protect him, bring him peace, and allow his spirit  to soar with the eagles.\n\nMr. Speaker, thank you for allowing me to enter this into the Record.                      Honoring Robert ``Rex'' Baumgartner\n\nMs. KAPTUR. Mr. Speaker, I rise to honor Robert…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Congratulating Freedom High School Class of 2025\n\nMr. SUBRAMANYAM. Mr. Speaker, I rise today to congratulate the  remarkable Freedom scholars in the class of 2025.\n\nIn their time as Eagles, the graduates have accomplished so much.  From inspiring performances on the stage to hard-fought victories on  the field and a true commitment to serving our community, they…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…only way he knows how:  with heart, with humor, and a can-do spirit.\n\nOther than feeding his neighbors and connecting with those he serves,  Fresh is famously a Philadelphia Eagles fanatic. Pulling up in his  truck, people come out of their homes when they hear him because they  trust him, and they look forward to the playful banter he brings along.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696940/recognizing-shae-parks"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "Mr. CISNEROS. Mr. Speaker, I rise today to recognize the South El  Monte High School Lady Eagles volleyball team on their first-ever CIF  Southern Section Division 9 championship.\n\nIn a hard-fought match, the Lady Eagles fell behind two sets to one  before rallying back…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697339/congratulations-to-the-lady-eagles-volleyball-team"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Liberty High School Class of 2025\n\nMr. SUBRAMANYAM. Mr. Speaker, I rise today to congratulate the 347  graduates of Liberty High School's class of 2025.\n\nThe graduates, as Eagles, have achieved so much and, most  importantly, have learned how to tackle whatever challenges come next.\n\nAs their principal said to them:\n\nYou are bold, you are brilliant,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691978/recognizing-fauquier-high-school-class-of-2025"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…grandchildren and one great-grandchild.\n\nDanny's heart has never left the sky. As a pilot in the Rockdale  Flying Tigers Flight Club, Danny is an EAA member and works with the  Young Eagles Flight Program giving introductory flights. He has been an  instructor pilot for years, serving as a technical, emotional, and  mental mentor to many students who have made…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696328/recognizing-danny-charles-masur-with-a-congressional-veteran-commendation"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…Academy East in Tucson for receiving A+ School of Excellence  Award by the Arizona Educational Foundation, the highest State-Level  recognition given to a public school. Go Eagles.                  Congratulating Village Meadows Elementary\n\nMr. CISCOMANI. Mr. Speaker, I rise today to congratulate Village  Meadows Elementary in Sierra Vista for receiving…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691350/national-police-week"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…discrimination.\n\nI congratulate the Salvation Army of Harrisonburg and Rockingham  County on doing the most good for 100 years.            Congratulating Roanoke Valley Christian Schools Eagles\n\nMr. CLINE. Mr. Speaker, I rise today to congratulate the Roanoke  Valley Christian Schools Eagles varsity boys' basketball team for  winning the 2025 VACA State championship,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689009/recognizing-salvation-army-of-harrisonburg-and-rockingham-countys-100th-anniversary"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…chemistry from the University of  California, Riverside. Barbara is a long-term resident of Big Bear  Lake--and in her spare time--she enjoys observing Big Bear Lake's  resident eagles, Jackie, Shadow, Sunny, and Gizmo.\n\nHeather and I thank Barbara for her years of service and significant  contributions to the scientific community. I ask my colleagues to…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692467/recognizing-the-achievements-of-dr-barbara-j-finlayson-pitts"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…of leaders, young men and women who will one day serve  as firefighters, teachers, doctors, small business owners, and yes,  even Members of Congress.\n\nWe are also hosting Eagles on the Hill, a reception that will bring  together Eagle Scouts and Scouting alumni to celebrate our shared  background in Scouting. Eagles on the Hill serves as a reminder…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694209/recognizing-the-congressional-scouting-caucus"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Volleyball Playoffs, the Calvert  Senecas overcame the challenges posed by intense competition.\n\nIn pursuing the State Championship, Tiffin Calvert defeated the  Monroeville Eagles to win the state volleyball championship. The  members of this very special team have shown that their sport requires  an individual effort for a team result. Their hard work…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697947/recognizing-the-tiffin-calvert-catholic-high-school-on-winning-the-division-vii-state-girls-volleyball-championship"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…school ably on their way  to achieving the Division II State Boys Soccer Title. In their effort  to surpass all other teams in the Division II State Soccer Playoffs,  the Avon Eagles overcame the challenges posed by intense competition.\n\nIn pursuing the State Championship, the Avon Eagles defeated the  Kings Mills Knights to win their first state soccer…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697971/recognizing-avon-high-school-on-winning-the-division-ii-state-boys-soccer-championship"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…Mitchell.\n\nA sincere congratulations to each and every one of them. This is a  wonderful achievement, and our city is very proud of them.                Congratulating Fowler Eagles Girls Basketball\n\nMr. BARRETT. Mr. Speaker, I rise today to recognize the Fowler Eagles  girls' basketball team, who captured the State championship this past  weekend with…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689005/congratulating-east-lansing-trojans"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…school ably on their  way to achieving the Division II State Football Title. In their effort  to surpass all other teams in the Division II State Football Playoffs,  the Avon Eagles overcame the challenges posed by intense competition.\n\nIn pursuing the State Championship, the Avon Eagles defeated the  Cincinnati Anderson Raptors to win their second straight…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698001/recognizing-avon-high-school-on-winning-the-division-ii-state-football-championship"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…Wayne Martin obtained at multiple  institutions. As head coach of the men's basketball team at his alma  mater Morehead State University (MSU) from 1978 to 1987, he led the  Eagles to two NCAA tournaments. During his stent as head coach and  athletic director of then-Pikeville College, his teams earned three  impressive national tournament trips, bringing…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696267/tribute-in-honor-of-wayne-martin"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Coaches Association (PSCA). I am equally pleased to  recognize his colleague, Mrs. Lynn Parmer, for being named the  Assistant Coach of the Year by the PSCA.\n\nThe Cocalico Eagles soared under Hogan and Parmer's leadership.  During their stellar 20-2-3 season, the girls' soccer team won the  Lancaster-Lebanon League section title and advanced to the…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699464/congratulating-coach-dan-hogan-and-coach-lynn-parmer-on-coaching-honors"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…on  their way to achieving the Division II State Girls Volleyball Title. In  their effort to surpass all other teams in the Division II State  Volleyball Playoffs, the Avon Eagles overcame the challenges posed by  intense competition.\n\nIn pursuing the State Championship, the Avon Eagles defeated the  Anthony Wayne Generals to win the state volleyball…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697918/recognizing-avon-high-school-on-winning-the-division-ii-state-girls-volleyball-championship"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…productive society.\n\nI am proud to co-chair the Congressional Scouting Caucus. This past  summer, we welcomed dozens of Scouts from across the country to Camp  Capitol Hill and Eagles on the Hill. This was an opportunity for Scouts  to meet with Representatives and showcase what they have learned or  built as a Scout. It was an honor to see the various projects…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699723/national-scouting-day"}]