[{"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…our  children, healthcare for our people, and the education of our children.\n\nNothing brings more money to the Treasury than the education of the  American people from early childhood through lifetime learning and  every phase of it in between.\n\nYou should be ashamed of yourselves to mock spending on education.  The best dollars we spend are on educating…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693157/one-big-beautiful-bill-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…and  strollers, to those in need across Central Virginia. Focused on  children from birth to age three, Little Hands alleviates financial  stress for families, improves early childhood outcomes, and strengthens  community support systems. In just five years, they have grown from  serving 100 children a month to reaching over 10,000 annually through…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690568/virginias-fourth-district-women-in-excellence-awards"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…the students, such as:  explicit protections under Title IX; nondiscrimination protections at  the State and local level; accessible and affordable childcare; access  to early childhood education and pre-kindergarten services;  transportation services; and others that would actually make a  difference.\n\nMr. Speaker, we have constantly heard that they…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…all-expense-paid trips to  Beijing to discuss further cooperation.\n\nChina is now replacing a canceled American program for child  nutrition in Cambodia, and Beijing just announced an early childhood  project in Rwanda, where the United States recently cut our program.\n\nThey are even moving in, picking up the PEPFAR Program that we have  walked away from in Africa,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690349/9999"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…Republicans in the House and in the Senate and the White  House do not understand that nothing brings more money to the U.S.  Treasury than the education of the American people, early childhood  education, K-12, higher education, post grad, and lifetime learning for  our workers. They are cutting education to give tax breaks to the  richest people at the expense…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693631/layoffs-at-the-department-of-education"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…not touch the Head  Start program. Yet here we are. Nationally, over 800,000 children  receive daycare support from Head Start. Cutting Head Start funding and  stopping early childhood development is not efficiency. It is not  trimming the fat. Cutting programs like Head Start is breaking,  literally, the bones of our Nation and of our future.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691363/vulnerable-children-must-be-supported"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…deficit that  triggers statutory cuts to critical programs supporting children and  families. These Paygo reductions would eliminate funding for the  Maternal Infant and Early Childhood Home Visiting program--known as  MIECHV--that is proven to improve mother and child health, family  safety, and child development. It would eliminate the guaranteed  funding…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693186/one-big-beautiful-bill-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…public education or civil rights or the need to  protect children--because their actions speak as loud as their words-- we do. We believe in investing in education from early childhood  education to higher education, and everything in between, and we will  continue to use every tool at our disposal to fight back at every turn  and honor our commitment…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698935/protecting-education-for-children-with-disabilities"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "Mr. AMO. Mr. Speaker, across the country, Head Start lives up to its  name. It provides quality early childhood education so that working- class families can get ahead. However, right now, Head Start is under  attack from Donald Trump and Republicans in this Chamber. They froze…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689866/protect-head-start"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Disability.--The term ``disability'' has the meaning       given such term in section 3(1) of the Americans with       Disabilities Act of 1990 (42 U.S.C. 12102(1)).\n\n(6) Early childhood education program.--The term ``early       childhood education program'' has the meaning given such term       in section 103 of the Higher Education Act of 1965 (20 U.S.C.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Ms. MORRISON. Mr. Speaker, today, I rise on behalf of the 800,000  children who will lose access to early childhood care, healthcare, and  education because of the Trump administration's budget.\n\nTheir budget proposes to eliminate Head Start, the nationwide program  that provides essential…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690416/eliminating-head-start"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…served as a safe haven for young  people in Wilmington and New Castle County, supporting more than 42,000  youth with after-school programming, summer enrichment, and early  childhood education.\n\nTheir mission, ``building brighter futures, engaging with public  safety and empowering families'' is more than a slogan. It is a daily  practice. Through…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692994/wilmington-police-athletic-league"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, I introduce the Universal  Prekindergarten and Early Childhood Education Act of 2025, which would  establish and expand prekindergarten programs in public and public  charter schools for three- and four-year-olds.\n\nThis bill seeks…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695812/introduction-of-the-universal-prekindergarten-and-early-childhood-education-act-of-2025"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…District 10 Woman of the Year by Senator Bob Wieckowski and also  contributed her expertise as a member of Assemblymember Anthony  Rendon's State Blue Ribbon Commission on Early Childhood.\n\nIt is my honor to recognize Parvin Ahmadi for her decades of service,  leadership, and enduring impact on public education. Her legacy is one  of integrity, dedication,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691728/recognizing-parvin-ahmadi"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…changes       that--\n\n(1) are within the jurisdiction of such committee; and\n\n(2) would protect funding for the production and       distribution of programming to support early childhood       development.\n\nMr. Warnock moves to recommit the bill H.R. 4 to the       Committee on Appropriations of the Senate with instructions       to report the same back…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693634/hr-4"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…Israel Zoberman is founder of Temple Lev Tikvah in Virginia  Beach. He was born in Chu, Kazakhstan (USSR) to Polish Holocaust  survivors who had met in Siberia. He spent his early childhood in  Poland, Austria and Germany before moving to Israel in 1949.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690665/israel-at-77"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…strong performance of the units she served with.\n\nFollowing her honorable discharge in 2005, Mrs. Gramer continued to  pursue excellence. She earned two degrees: one in Early Childhood  Development and another in Business Administration. She successfully  operated a home childcare business while raising her three children.  Once her children reached…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700088/recognizing-united-states-navy-petty-officer-second-class-katrina-gramer"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…improving the quality of life for so many.\n\nSince its founding, ACCAP has provided essential services, ranging  from housing assistance and food programs to transportation and early  childhood literacy initiatives, such as Dolly Parton's Imagination  Library. These programs create pathways to brighter, more stable  futures.\n\nThis anniversary is not just a reflection…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689395/recognition-of-accaps-60th-anniversary"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…operations didn't stop at higher education. In K-12  schools, Confucius classrooms sprang up, aiming to shape the minds of  our youngest learners.\n\nAt a 2023 Subcommittee on Early Childhood, Elementary, and Secondary  Education hearing, Defending Education highlighted a report exposing  nearly two decades of CCP efforts to influence thousands of children.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697532/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…high- performing schools from Governor Newsom and his enablers in the  legislature.\n\nWe also have some good news on this front. I am chair of the House  Subcommittee on Early Childhood, Elementary, and Secondary Education,  and we have been fighting to give Americans school choice. In this  reconciliation bill, H.R. 1, there is a provision that would…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the entire  country.\n\nI have advocated for reforms to our education system in California  that would actually close achievement gaps and serve students. As chair  of the Early Childhood, Elementary, and Secondary Education  Subcommittee here in the House of Representatives, I have advocated for  those reforms not just for our State, but on the national…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…experience as a classroom teacher. It motivated me to become the vice  chair of the California State Assembly Education Committee and now,  here in the House, the chair of the Early Childhood, Elementary, and  Secondary Education Subcommittee.\n\nTFA is an AmeriCorps program. It is one of the professional core  programs for AmeriCorps. What that means is that…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…Education and Workforce  Development Subcommittee.\n\nMr. WALBERG. Mr. Chair, I yield 3 minutes to the gentleman from  California (Mr. Kiley), the subcommittee chair of the Early Childhood,  Elementary, and Secondary Education Subcommittee.\n\nMr. WALBERG. Mr. Chair, I yield myself such time as I may consume. I  know my good friend and colleague's concern…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}]