[{"senator": "Andy Kim", "party": "Democrat", "sentence": "…takes place, mothers receive prenatal care  covered by Medicaid. That means that for millions of parents across the  country, the first images they see of their child in those early  ultrasounds are because of Medicaid. It means that prenatal vitamins  that provide the folic acid necessary to ensure proper development are  because of Medicaid. It means…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689514/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…the most recent is from the International Energy Agency, which has  slashed its forecasts for renewable energy capacity growth in the  United States this decade, citing the early phaseout of the Federal tax  incentives and regulatory shifts under this administration.\n\nMr. President, I ask that the Wall Street Journal article titled  ``IEA Cuts U.S.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…or more months. Unlike GBS, CIDP is chronic,  with symptoms constantly waxing and waning. Left untreated, 30 percent  of CIDP patients will progress to wheelchair dependence. Early  recognition and treatment can avoid a significant amount of disability.  Post-treatment life depends on whether the disease was caught early  enough to benefit from treatment…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691695/recognizing-may-2025-as-gbscidp-awareness-month"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…percent. That is not policy. That is plunder. The  math doesn't lie.\n\nIn North Carolina, it is $400 million. That is more than the entire  State budget for child development and early education. In Georgia, it  is $500 million, double what the State spends on child welfare. In my  State of Ohio, it is $300 million, four times the transportation  budget.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693203/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…locked doors in a massive, climate-controlled vault, the       coins tell the story of civilization, from antiquity to       today.\n\nA Sumerian clay tablet from about 2000 B.C.E. Early Chinese       forms of money shaped like miniature tools. A silver French       penny from the age of Charlemagne. A medal given by the       Lincoln administration to a Native…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "Ms. SEWELL. Mr. Speaker, I rise in support of H.R. 842, the Nancy  Gardner Sewell Medicare Multi-Cancer Early Detection Screening Coverage  Act,  which was included in the funding package being considered by the House  today.\n\nNamed in honor of my mother who lost her battle to pancreatic…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699298/we-will-beat-cancer"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…education in the welcoming community  that Head Start provides.\n\nThis year alone, nearly 750,000 infants, toddlers, and preschoolers  will receive Head Start services, supporting early childhood learning,  development, and health. These centers rely on us to make sure we keep  that Federal funding to provide the care for our children.\n\nAgain, I know earlier…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691869/job-corps-cuts"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…be clear to all of us by now       that outbreaks abroad do not stay overseas. That's why       Congress has appropriated millions and millions of dollars to       shore up early warning systems, surveillance and fragile       health systems around the world so that we can protect and       detect and respond to diseases early and . . . so that we can…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…aid workers worry that the Trump administration will run down  the clock until these contraceptives expire. Most of the products  expire in 2028 or 2029, with some expiring as early as April 2027.  Destination countries often have rules for importing medical supplies  based on remaining shelf life. The administration may exploit these  rules to stop their…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696465/womens-health"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…have stopped programs in countries like  Somalia where USAID is a key partner in counterterrorism efforts with  the U.S. military.\n\nThey would not have shut down the Famine Early Warning System,  risking medicines and American-grown food aid to spoil in the supply  chain.\n\nThey would not have put more than a half dozen USAID lawyers on  leave, including…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…under investigation. We are on track,  yet again, to be one of the deadliest areas for heat exposure in this  country.\n\nThat is why I launched the bipartisan Extreme Heat Caucus early this  year with Congressman Mike Lawler of New York. At one point this  summer, nearly half of the country's population was under an extreme  heat warning. From coast to coast,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695656/extreme-heat-caucus"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Ms. McCOLLUM. Mr. Speaker, Minnesota and our Nation suffered an  unthinkable tragedy in the early hours of January 14th, when our  state's elected officials were attacked in politically-motivated  shootings.\n\nMinnesotans are devastated by the assassinations of Speaker Emerita…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693118/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…is the largest pulsed  superconducting electromagnet ever built, and it is a major step in the  long journey toward commercial fusion energy.\n\nGeneral Atomics was one of the early trailblazers of both nuclear  fission and fusion. Under the leadership of their chairman and CEO,  Neal Blue, General Atomics has pioneered many new innovations, from  groundbreaking…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694165/recognizing-general-atomics"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…to be  able to continue to live at home, nor would we be able to leave home on  weekdays and have a day program to attend.''\n\nPamela writes:\n\nAs his parent, I need to take an early retirement from       public school teaching to care for our son because the       medical coverage he has just isn't enough.\n\nIt doesn't provide for his transportation and…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…Act is yet another important step to support America's  leadership in a secure and reliable future.\n\nBy directing the FCC to engage in the exploration of 6G technology in  the early stages of development, the FUTURE Networks Act will enable  American values to be embedded within the global framework for this  technology and to ensure it will be available…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690230/future-uses-of-technology-upholding-reliable-and-enhanced-networks-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…gathered on the House floor to pay our  respects to Virginia Beach Police Department Officers Cameron Girvin  and Christopher Reese, who were killed in the line of duty in the early  hours of Saturday, February 22.\n\nTragically, our community lost two of our local heroes when a  cowardly criminal gunned down two of Virginia Beach's finest during a  routine…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687949/moment-of-silence-in-honor-of-cameron-girvin-and-christopher-reese"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…Street  businesses across southern Minnesota and across the country.\n\nFrom Winona to Worthington, small business owners across the district  I have the honor to represent rely on early access to capital to start  and grow. This legislation will spur further investment in our business  community and assist businessowners in accessing the capital needed to…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687920/investing-in-main-street-act-of-2025"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…service, holding leadership roles with the Miami  Downtown Development Authority and numerous civic and legal  organizations.\n\nHer dedication to education and public policy began early, with an  appointment by Governor Jeb Bush and her successful advocacy for the  establishment of a public law school at Florida International  University.\n\nThroughout her career,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690947/congratulating-melissa-tapanes"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…was federally  recognized in 1976. The Pit River Tribe consists of 11 different  California Tribal bands and resides on a 100-square-mile reservation.  In the late 1960s and early 1970s, the Tribe aimed to regain control of  the Four Corners property near Burney, California.\n\nOver the years, the Tribe repeatedly tried to regain the Four Corners  land…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698137/pit-river-land-transfer-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…Higher Education and Workforce  Development Subcommittee.\n\nMr. WALBERG. Mr. Chair, I yield 3 minutes to the gentleman from  California (Mr. Kiley), the subcommittee chair of the Early Childhood,  Elementary, and Secondary Education Subcommittee.\n\nMr. WALBERG. Mr. Chair, I yield myself such time as I may consume. I  know my good friend and colleague's concern…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…the Budget  Committee in her hearing to become OMB Director, that was a decision I  never regretted and still do not.\n\nBut I will tell you, this morning, as I stand here in early August on  a Saturday morning, with this circle of zero percent bright-gray, as  though there is such a thing as bright-gray, I am frustrated. This is  the future of this place…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694711/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…past  century, Port Richey has served as a gateway to Florida's Nature Coast,  offering a unique blend of coastal beauty, community spirit, and small- town values.\n\nThe city's early founders envisioned a place where families could  thrive, businesses could grow, and the natural environment could be  cherished. Their vision remains alive today in the city's…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691599/recognizing-100th-anniversary-of-the-city-of-port-richey-fl"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…million. I hope it will quickly move through the Senate  and to President Trump's desk.\n\nMadam Speaker, H.R. 5788 marks a critical step toward identifying and  mitigating risks early, strengthening the long-term viability and  affordability of the 504 loan program and ensuring continued support  for American entrepreneurs.\n\nMadam Speaker, I urge my colleagues…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699188/504-program-risk-oversight-act"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…assistant Federal security director roles to active director  positions, Dave has consistently delivered strong leadership and  results wherever he was placed. Notably, in the early days of TSA, Dave  helped federalize six airports while serving as a crisis management  coordinator.\n\nHis lengthy service record goes on. Prior to joining the TSA, Dave  served…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698763/recognizing-david-mcmahon"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…ago, 1 month ago, that showed if  we went back to a six handle, so it is 6 percent interest rate on U.S.  sovereign debt, which we were right up against in, what, the mid-,  early 2000s, 2005 and 2006. We went to a 6 percent interest rate. About  45-plus percent of all U.S. taxes went just to cover interest. If we go  to 9 percent, it is the majority…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…should be given in this country is based on your ancestry  or your gender.\n\nIt was based on the idea I think largely thought up by a guy by the  name of Herbert Marcuse in the early 1970s that we can destroy America  by dividing it by ethnic group or dividing it by gender. He was a  genuine Communist sort of person.\n\nPrior to this time, people who wanted…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Sheriff's Office with the integrity and devotion of a true public  servant.\n\nHired at the age of 18 as a dispatcher, Sheriff Foster developed  strong ties to those he worked with early in his career and earned high  marks from his community.\n\nAfter more than 30 years serving the Sheriff's Office, Mr. Foster ran  for Wythe County Sheriff in 2021. Given community…", "date": "2025-08-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694755/recognizing-the-dedicated-service-and-leadership-of-sheriff-charles-foster-of-wythe-county-virginia"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…official meeting in 1925, Lady Lake's  story reaches back to the 1880s, when a new railway depot sparked  growth in a community first home to the Seminole Indians.\n\nFrom its early years as a hub for citrus and watermelon growers to  the history now preserved by the Lady Lake Historical Society Museum,  the town's heritage reflects a century of resilience.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697751/recognizing-lady-lake-florida"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…peaceful democracy where violent       rhetoric and acts are not tolerated.\n\nMr. Speaker, on June 14, a horrific tragedy was inflicted on America  and the State of Minnesota.\n\nEarly that morning, a deranged assassin ambushed State Senator John  Hoffman and his wife, Yvette, both of whom were shot multiple times at  their home while bravely defending their…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692859/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…to fill  out this report. ``Who gave you all that cash?'' In fact, if you  deposit more than $10,000, it creates a cash transaction report.\n\nWhen that was first passed in the early 1970s, it was $10,000. Today,  that number adjusted for inflation is over $81,000. That is who they  were looking for. If you look at the last Presidential administration…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}]