[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Madam President, earlier today, we received reports that  Iran has targeted U.S. military bases and U.S. servicemembers in the  Middle East, putting the lives of thousands of Americans at immediate…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692722/iran"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…will be recorded in history with a resolution.\n\nNow, I want to say just a few more words about these people that they  have demeaned. First, you heard me mention Al Edwards earlier. He is  the father of Juneteenth, the father of Juneteenth. We have a  resolution honoring him as such. For Sylvester Turner, a person who  united diverse communities in Houston…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "Ms. HIRONO. Mr. President, earlier this month, the State of Hawaii  officially designated September 2025 as Hawaiian History Month.  Designated on September 2, 2025, the 187th anniversary of the birthday  of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695588/hawaiian-history-month"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…is to help women who are  surviving sexual assault and domestic violence.\n\nWhy would he cut a program like that?\n\nThey cut USAID programs. One of our colleagues referenced earlier  about how that has had a positive impact on the starvation issues, the  USAID efforts. However, they are cutting programs that will to lead to,  I saw one estimate, 1.6 million…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Recognizing Anaheim High's Flag Football Team\n\nMr. CORREA. Mr. Speaker, I rise today to celebrate the Anaheim High  School girls' flag football championship win.\n\nEarlier this month, the Anaheim girls' flag football team brought  home their first-ever division championship. Thanks to their strong  defense, aggressive offense, and dedicated…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697343/recognizing-thanksgiving-food-drives"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…voting rights bill here today. Republicans claim that voting is a  core right or privilege of American citizenship. Not only is that  historically incorrect, but as I described earlier, it is also  hypocritical.\n\nRepublicans have fought tooth and nail to defeat legislation that  would give the American citizens who reside in D.C. voting  representation in…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692318/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Committee. But the impact is enduring because suicide  prevention has to be done in the moment, and suicide  prevention training sessions have been postponed or canceled.\n\nEarlier this month, the Secretary announced he will be abruptly  canceling the VA Servicing Purchase Program, known as VASP, on May 1.  Now, I know very few of my colleagues have…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…Department of Education,  including the staff who oversee these IDEA programs. Now the program is  both underfunded and there is no one there to send the money out.\n\nThat is why earlier this Congress, I introduced the IDEA Full Funding  Act. I urge my colleagues to join me in finally giving our students  with disabilities exactly what they are owed.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698943/protecting-education-for-children-with-disabilities"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…American consumers. So it is  a tax by another name.\n\nAnd the last point I will make is this because it was relevant in the  Environment and Public Works Committee  hearing earlier today when Transportation Secretary Duffy talked about  the concern the administration has about the increased costs and  budgets of a lot of transportation projects compared…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689475/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…President, I rise this evening once again to  highlight the stories of Wisconsinites who would be impacted by cuts to  Medicaid that my Republican colleagues are proposing.\n\nEarlier this evening, I talked about children, babies, our most  vulnerable. Now I would like to talk about older adults.\n\nI rise to share the story of Renee. Renee is a 60-year-old…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689545/h-con-res-14"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…care about your vote. They don't care  about your pocketbook.\n\nWhy does the Congresswoman from California say this? Because I have  receipts, and I am going to share them.\n\nEarlier this year, Republicans voted on a $4.5 trillion tax cut for  the richest of the rich. In order to pay for that, they passed a  honking series of cuts to all the services that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…can pass a joint resolution that does the same  thing. We could even pass a simple Senate resolution.\n\nBut guess what. All of those things are fully debatable. And as I  said earlier, ``fully debatable'' means what? It means 60 votes to end  debate, meaning that the minority party gets a vote, gets  consideration.\n\nThey don't want that. They want to ram…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691447/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…megabill gives the oil  industry what it wants by dropping support for solar and wind. That was  from CNBC in July.\n\nThe story about how this was to benefit Big Oil was revealed earlier  in February, shortly after the emergency order went into effect, in The  Guardian:\n\nHow Trump is targeting wind and solar energy--and       delighting big oil.\n\nThis was…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…administration to be entirely unaccountable.\n\nNotably, the HUD Inspector General this bill would require to testify  before our committee was one of the people Trump arbitrarily fired  earlier this year.\n\nSince that firing, the acting HUD IG has been replaced again, and  there is no one being considered by the Senate for confirmation. As a  result, no one in this…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697210/hud-transparency-act-of-2025"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…they are being forced to raise prices, cut  staff, and halt domestic innovation, all because of a policy that was  supposed to help American manufacturing.\n\nJulie wrote to me earlier this year, and she said: ``Our effective  tax rate has skyrocketed, with no explanation or benefit to us. . . .  Where is the relief for businesses? Does the government truly…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691573/earthquaker-devices-sounds-the-alarm"}, {"senator": "French Hill", "party": "Republican", "sentence": "…(2) that contains an explanation of the reasons therefor.\n\n(d) Sunset.--This Act and the requirements of this Act       shall have no force or effect on the date that is the earlier       of--\n\n(1) 5 years after the date of the enactment of this Act; or\n\n(2) 30 days after the date on which the President notifies       Congress that the termination of…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699846/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}, {"senator": "Jon Husted", "party": "Republican", "sentence": "Mr. HUSTED.  Res. 332, submitted earlier today.", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693975/national-day-of-the-american-cowboy"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…the amazing things that he  had accomplished and who he was, I realized that we are going to hear  that over the next hour.\n\nThe thing that my team and I were reflecting on earlier today, and  all I wanted to share as we kick off this memorial to an amazing man,  was that, as vice chair, I get to, every week, host an evening of floor  time for my colleagues…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698737/9999"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…intelligence sharing to the world's  foremost experts in drone warfare might make it harder for the U.S.  military to achieve drone dominance.\n\nOn that count, I was encouraged earlier this week that the President  himself green-lit an expansion of the intelligence cooperation that  members of his administration had actually wanted to end.\n\nAs our colleagues…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…support of the legislation before us today.\n\nMr. Speaker, I rise in support of H.R. 2988, the Protecting Prudent  Investment of Retirement Savings Act, legislation I introduced earlier  this year to ensure hardworking Americans do not have their retirement  savings jeopardized by politically motivated mismanagement. What I am  hearing is that, I think, this…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699156/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…communities prosper. Time and again, families across Spokane  have been reunited, and lives have been changed for the better, one  dad, one child, and one family at a time.\n\nEarlier this month, my team had the honor of joining the Spokane  Fatherhood Initiative's Building Legacy gala, where our community  rallied to raise nearly $175,000 for life-changing…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697297/recognizing-ron-hauenstein"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "Mr. McCONNELL. Mr. President, I rise today to discuss the original  intent of the 2018 farm bill's Federal hemp legislation and the need to  restore it.\n\nEarlier this year, a report from the University of Kentucky found  that cannabis-related poisonings among Kentuckians under 18 rose by 43  percent between 2023 and 2024. As you can…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694557/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…State's most popular motorized recreation  trails, the National Park Service is shutting down a main engine of  economic growth in some of the poorest, most rural counties.\n\nEarlier this year, Congress passed the first-ever bipartisan,  comprehensive recreation package aimed at growing, not restricting, our  Nation's $1.1 trillion outdoor recreation economy.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…and we are not in college anymore.\n\nIt is significant what we have accomplished. The Energy and Commerce  Committee just finished up, and the House Ways and Means Committee  earlier. We have got 11 or so committees that have contributed to the  one big, beautiful bill, the reconciliation package. We want to see  this thing get advanced as we continue…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…This bill codifies both President Trump's executive order to end  taxpayer subsidization of open borders and Administrator Loeffler's SBA  7(a) program guardrails put in place earlier this year.\n\nMr. WILLIAMS of Texas.  Van  Duyne).\n\nMs. VAN DUYNE. Mr. Speaker, I thank the gentleman for yielding.\n\nMr. Speaker, in the past 107 days since President Trump…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692123/american-entrepreneurs-first-act-of-2025"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…Democrats are once  again putting politics before protecting the American people.\n\nMr. Speaker, this hypocrisy is evident in the message coming from  congressional Democrats. Earlier this month, Chuck Schumer stated that  President Trump ``seems content to drag our country . . . into an  endless war with no plan, no transparency, and nothing but wishful…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699371/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…Speaker, the hot garbage that we are hearing right now from the  other side prompts me to address this. I am vice chair of the Financial  Services Committee. One of our speakers earlier serves on that  committee where we regularly cross swords philosophically about what  the role of ESG is. Environmental, social, and governance has been a  hot topic, Mr.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699155/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…requirements.\n\nThe committee has reported out similar language in the past and a  hearing before the Subcommittee on Economic Development, Public  Buildings, and Emergency Management earlier this year on courthouses  reinforced the need for this legislation.\n\nH.R. 3426, as amended, also incorporates reasonable revisions  recommended by the courts.\n\nMr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695378/courthouse-affordability-and-space-efficiency-act-of-2025"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…why this year's defense bill prohibits  any modifications to defense systems in these spectrums bands unless  top Pentagon leaders themselves deem it absolutely necessary.\n\nEarlier this summer, I led the effort to secure--for the first time  in law--a carve-out that prevents the Federal Communications Commission  from auctioning or reallocating these…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695027/9999"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…market. Eliminating these subsidies would allow private investment to  go toward other technologies that are more in line with what our grid  actually needs.\n\nAs I mentioned earlier, with the rise of AI, we are going to need a  lot more power. We should be sending the right market signals to bring  the power on that will actually meet the demand that…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690785/big-beautiful-bill"}]