[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Isabella Garcia  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nIsabella has overcome many challenges along her journey to success,  demonstrating perseverance at every step.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691774/recognizing-isabella-garcia"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…saving countless lives, Mr. Lomell received  the Distinguished Service Cross. Following the fighting at D-day, Mr.  Lomell continued to serve his country in other battles, earning a  Silver Star. After receiving another injury, he was honorably  discharged in December of 1945.\n\nAfter the war, Mr. Lomell returned to New Jersey, where he settled in  Toms…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693924/leonard-g-bud-lomell-va-clinic"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…Resnick as my  January 2026 Constituent of the Month.\n\nJohn has helped establish Carlsbad as a premier culinary destination  through his leadership of four acclaimed restaurants, earning two  Michelin Stars and national recognition. His commitment to excellence,  sustainability, and community exemplifies the very best of the 49th  Congressional District.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699850/recognizing-john-resnick-as-january-2026-constituent-of-the-month"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Dayanara  Tiscareno Escalera for earning the Arvada Wheat Ridge Service  Ambassadors for Youth Award.\n\nDayanara has overcome many challenges along her journey to success,  demonstrating perseverance at every step.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691002/recognizing-dayanara-tiscareno-escalera"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Abel Harris for  earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nAbel has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689700/recognizing-abel-harris"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Alfonze Romero  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nAlfonze has overcome many challenges along his journey to success,  demonstrating perseverance at every step.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690988/recognizing-alfonze-romero"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Judy Thomas's life began with her birth to the union  of William H. Lt. (Bill) Williams and Alice Williams. She graduated  from Jordan Vocational High School in 1964, later earning her  bachelor's degree in Elementary Education from the Women's College of  Georgia, now Georgia College and State University.\n\nJudy began her teaching career at Bibb Elementary…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690837/in-memory-of-the-honorable-judy-thomas"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Amelia  Ferkuniak for earning the Arvada Wheat Ridge Service Ambassadors for  Youth Award.\n\nAmelia has overcome many challenges along her journey to success,  demonstrating perseverance at every step.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689635/recognizing-amelia-ferkuniak"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Brittamarie  Griffin for earning the Arvada Wheat Ridge Service Ambassadors for  Youth Award.\n\nBrittamarie has overcome many challenges along her journey to  success, demonstrating perseverance at every step.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691805/recognizing-brittamarie-griffin"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…embodies the highest ideals of the American Dream.\n\nBorn in Mexico, Representative Garcia moved to the Little Village  neighborhood of Chicago in the 1960s and never left. After earning his  citizenship in 1977, Representative Garcia graduated from college and  began his career in public service with a community-based housing  initiative.\n\nSince his time…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696785/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Ricky Martinez  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nRicky has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690401/recognizing-ricky-martinez"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Zoe Williams  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nZoe has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689650/recognizing-zoe-williams"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…this  bill. Instead, Republicans are fighting for billionaires like Donald  Trump and the top 0.1 percent who will get an average tax cut of  $309,000 per year, while those earning less than $50,000 get 68 cents a  day.\n\nTo my Republican colleagues, there is still time to join Democrats in  preventing this despicable bill from becoming law.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693164/one-big-beautiful-bill-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Aden Cordova  Rubio for earning the Arvada Wheat Ridge Service Ambassadors for Youth  Award.\n\nAden has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690372/recognizing-aden-cordova-rubio"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Elijah Bertone  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nElijah has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691148/recognizing-elijah-bertone"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…Scouts of Gulf Coast Florida and has exemplified  extraordinary leadership, innovative problem-solving, and a  demonstrated commitment to making a lasting, positive impact, by  earning the most prestigious award in Girl Scouting, the Gold Award.\n\nGold Award Girl Scouts are recognized as trailblazers who are willing  to tackle the most pressing challenges…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690422/recognizing-krysta-fowler-gold-award"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "Mrs. FISCHBACH. Madam Speaker, I rise today to congratulate Chris  Tungseth from Fergus Falls, Minnesota, on earning a golden ticket to  Hollywood on ``American Idol.''\n\nChris proved that the American spirit is built on more than just hard  work. It is built on resilience, faith, and the…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700169/congratulating-chris-tungseth"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…becoming an insurance  agent. Her academic excellence is evident through numerous honors,  including being a Red Hawk Rockstar, a consistent presence on the honor  roll, and earning academic recognition in subjects like English,  Spanish, and Physics.\n\nBeyond her academic achievements, Kacee has demonstrated an  extraordinary commitment to service. She…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689670/recognizing-kacee-gray-as-cass-citys-2025-junior-citizen-of-the-year"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…as a bridge-builder, working  tirelessly to promote peace, dialogue, and respect among all different  faiths. He is also a champion for protecting our natural environment,  earning him the title of the ``Green Patriarch.''\n\nHis leadership is a source of inspiration not only for the Greek  Orthodox community but all those who care about human rights,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695267/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…the law increased the premium tax credit amounts for eligible       individuals and families, resulting in access to plans with       no premium contributions for those earning 100 to 150 percent       of the federal poverty level. It also expanded eligibility       for premium tax credits to include certain individuals and       families with incomes…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Upper Peninsula for the first time  since 2015. In an impressive display of discipline and determination,  the Maroons prevailed with a commanding 34-6 win over Schoolcraft,  earning the program its fourth ever state championship while helping to  restore ``U.P. Power'' by bringing a title home to the Upper Peninsula.  Under the leadership of head coach,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698002/recognizing-the-menominee-maroons-2025-division-7-michigan-state-football-champions"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…congratulating several remarkable Girl Scouts from  Wisconsin's 5th Congressional District for demonstrating leadership,  creativity, and a commitment to making a lasting impact by earning the  most prestigious award in Girl Scouting, the Gold Award.\n\nGold Award Girl Scouts help their communities and the world by  identifying a community need, investigating…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690499/recognizing-gold-award-girl-scout-recipients"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…VR&E benefits being  used in vocational flight training. These benefits are intended, as  currently written, to be used in programs that are degree granting. As  we all know, earning a college degree has nothing to do necessarily  with learning how to fly an aircraft.\n\nThis bill will improve that section by granting the VA the  flexibility to have veterans…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699488/veterans-readiness-and-employment-improvement-act-of-2025"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…individuals--an area I proudly serve and represent.\n\nUltimately, Jenya Rahazhynskaya's story serves as a shining example  of how dedication and ambition lead to success. Through earning her  cosmetology license and owning a successful small business, Jenya sets  a powerful example for others in the beauty industry--especially  through her professionalism,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691903/recognizing-beauty-moods-one-year-anniversary"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…you step through the doors, Mr. Speaker, you are  not just attending a show. You are stepping into a legacy, one that  continues to shine brighter with each curtain call.\n\nEarning this recognition is no small feat. I congratulate Craig and  the entire Alhambra team on this well-deserved honor, and here's to  many more standing ovations.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691576/recognizing-alhambra-theater-dining"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…years;  as well as a profound legacy in service to the State of New York and  our country.\n\nHis wonderful grandson, Mark Fogelson, also served as an intern in my  office.\n\nAfter earning a law degree from Syracuse University and serving in  the United States Army, Tarky returned to New York, dedicating his life  to public service, including 27 years in the…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693663/recognizing-colonel-john-peyton-swain"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…Coast Florida, Troop 5005, and has exemplified extraordinary  leadership, innovative problem-solving, and a demonstrated commitment  to making a lasting, positive impact, by earning the most prestigious  award in Girl Scouting, the Gold Award.\n\nGold Award Girl Scouts are recognized as trailblazers who are willing  to tackle the most pressing challenges…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690443/recognizing-harley-cross-gold-award"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…Labor Standards Act  sets the Federal minimum wage, as well as a separate minimum wage, for  tipped workers. This recognizes the reality that tipped workers have a  higher earning ceiling when tips are combined with base wages,  representing an employee's total compensation.\n\nThere is no limit to the amount one can earn as a tipped worker, so  long…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698965/tipped-employee-protection-act"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…students nationwide. This achievement places  her among the most academically accomplished students in our country  and reflects a level of brilliance that is truly commendable.\n\nEarning a perfect score on the ACT is a testament to remarkable  intellectual ability, diligent preparation, and an unparalleled  commitment to academic excellence. It demonstrates…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700087/recognizing-madeline-brobst-receiving-a-perfect-score-on-the-act"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…on his grandfather's farm in Pomona and  attended Spring Valley High School, where he earned the rank of Eagle  Scout. A talented athlete, he wrestled and played football, earning the  nickname ``Tank,'' and went on to attend Illinois Wesleyan University,  where he played football for 4 years and later earned his MBA from  Washington University.\n\nIt…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699118/recognizing-and-thanking-nate-soule"}]