[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…each of the 3 offenses and imprisoned       for an aggregate of 90 days or more;\n\n(D) the alien--\n\n(i) has been admitted to an institution of higher       education;\n\n(ii) has earned a high school diploma or a commensurate       alternative award from a public or private high school, or       has obtained a general education development certificate…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…School--go Tigers.  Upon completion of my high school education, I was accepted and had the  blessed opportunity to attend the Massachusetts Institute of  Technology, where I earned my degree in mechanical engineering. That  led to a better life and more opportunities--exactly what my parents  worked so hard and sacrificed for. That is the American dream.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688250/nomination-of-linda-mcmahon"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…prescriptions, or care for aging parents.\n\nHouse Democrats are doing everything we can to stop Trump and  Republicans from destroying our economy and to keep their hands off of  earned benefits. We must put hardworking Americans first.                      Assault on Immigration Due Process\n\nMs. BARRAGAN. Mr. Speaker, as the economy is tanking, costs are…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690420/put-hardworking-american-families-first"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…spirit will be missed by all who knew her is  an understatement. I pray for her husband, Gene, and the family. Joyce  will surely be missed. May Poochie rest well. She has earned it.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698559/recognizing-joyce-reid-coleman"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…seen firsthand the impact a VSOC can have. By  expanding who can fill that role, we will give more student veterans  access to the program and help enable them to access their earned  benefits.\n\nWhile I do have concerns that section 4 of the bill requires VA to  adjudicate extension requests within 30 days without addressing the  underlying issue of  staffing,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699487/veterans-readiness-and-employment-improvement-act-of-2025"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "…life  as a mother and trainer at a local gym where she teaches youth  programs.\n\nHer sister, Stephanie Han, has built her own legacy in boxing with an  undefeated record. She earned this year's WBA lightweight title by way  of knockout in the first round in under 2 minutes. She is ranked as  number two in the world, and beyond her success in the sport,…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688664/recognizing-jennifer-and-stephanie-han"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…Merit, the  Meritorious Service Medal, the Air Medal, and the Aerial Achievement  Medal. His professional achievements are matched by his academic  accomplishments, having earned advanced degrees in Military Operational  Art and Science as well as National Resource Strategy.\n\nOn September 30, 2025, Colonel Halasi-Kun completed his final flight  in the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698681/recognizing-colonel-david-moon-halasi-kun"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Security--has been a pillar of middle-class retirement security  and helping children who have lost a parent.\n\nMr. Speaker, it is not an entitlement. It is not welfare. It is an  earned benefit that people pay into. They should get that benefit when  it is their turn to get the help from Social Security that we promised  as Congress.\n\nDefend Social Security.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689134/dont-touch-social-security"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…example, a worker who waits       tables would be paid the full minimum wage for non-tipped       cooking shifts, but under this bill the employer could       average tips earned earlier in the week and use them to       justify paying $2.13 an hour for cooking shifts as well,       which would cut weekly pay. By weakening existing rules that…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699005/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…Championship on December 20, 2025, an extraordinary achievement  for Texas's 29th Congressional District.\n\nOn the biggest stage in Texas high school football, the Mustangs  earned a state championship through discipline, preparation, and belief  in one another. This victory marks the program's sixth state title and  a return to the top, reaffirming North…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698467/congratulating-the-galena-park-north-shore-mustangs"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…West, protecting our environment, or fostering  dialogue between religious faiths.\n\nEcumenical Patriarch Bartholomew is also an international  environmental leader and has earned the title ``Green Patriarch.'' He  consistently used his role to bring people of different faiths together  to discuss how they could be good stewards of the Earth, and he…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695734/recognizing-and-welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…Republicans  did.\n\nThat is why I have been out there raising the alarm. Seniors and  their families deserve what is coming. Seniors built this country. They  paid in, showed up, and earned these benefits.\n\nIf Republicans think they can slash these lifelines without a fight,  they are dead wrong. We put seniors over billionaires.", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690565/district-work-period-regarding-social-security"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…as possible. This is a commonsense, straightforward,  and urgent reform.\n\nEvery year, millions of Americans eagerly await their tax refund,  money that they have rightfully earned. Unfortunately, criminals have  exploited weaknesses in our system, stealing and cashing checks that do  not belong to them. This fraud not only robs individuals of their…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689292/recovery-of-stolen-checks-act"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "Mr. McGARVEY. Mr. Speaker, Louisvillian Tim Nicolazzi has dedicated  his life to service. He served in the Air Force and then Army,  deploying to Kuwait and Iraq, where he earned a Bronze Star.\n\nAfter his honorable discharge, Tim's call to public service brought  him to HUD, where he has helped victims of domestic abuse in Louisville  find safety, helped…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688676/veterans-deserve-better"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…era while striving to maintain the trust and respect  of the public it serves.\n\nEven their uniforms made an impression--most notably in 1986, when  their distinctive attire earned national recognition and was featured  on the David Letterman Show.\n\nOver the course of the agency's esteemed 100 year history, the  dedicated men and women of the Rhode Island…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692219/rhode-island-state-police-centenary"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Area NAACP, where he served for over 10 years. In 2009, he was ordained  as a Deacon at the First Spirit Filled Missionary Baptist Church.\n\nOver the course of his life, Stan earned several meaningful honors  that meant a great deal to him, including the Man of the Year Award  from the Dauphin County Teenage Republicans in 1971, a Resolution of  Recognition…", "date": "2025-12-05", "source_url": "https://justfacts.votesmart.org/public-statement/1697565/recognizing-mr-stanley-r-lawson-sr"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…covered.\n\nIn essence, Jenya's story embodies the American Dream. Hailing from  Minsk, Belarus, she came to the United States with the dream of opening  her own salon. In 2019, she earned her cosmetology license from the  Jean Madeline Aveda Institute. By combining her new certification with  skills cultivated during her upbringing in Eastern Europe, Jenya…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691903/recognizing-beauty-moods-one-year-anniversary"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Bill  Act. This landmark legislation makes the Trump tax cuts permanent,  slashes taxes for working families and seniors, and eliminates taxes on  tips and overtime. If you earned it, you should keep it.\n\nIt secures our border by finishing the wall, funding mass  deportations, and giving our agents the resources they need to stop the  fentanyl crisis…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691982/recognizing-southern-virginia-universitys-ncaa-division-iii-mens-volleyball-national-championship-victory"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…Cahill's leadership in building  Lehigh football and restoring a championship culture. Under his  guidance, the Mountain Hawks captured back-to-back Patriot League  titles, earned consecutive FCS playoff appearances, and completed an  undefeated regular season.\n\nBeyond the wins, Coach Cahill has built a program centered on  discipline, teamwork, and…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699907/recognizing-joshua-hobson"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…Jordan achieved something that's never been  done before in our state. Competing against teams from Peru, the UK,  South Korea, the UAE, and across the United States, they earned first  place with unmatched precision, speed, and teamwork, setting a record  time of 8 minutes and 33 seconds while producing four near-perfect  pizzas, each scoring an impressive…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690075/recognizing-utah-global-pizza-champions"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…providing  thousands of meals every day to needy children. Instead, what we are  learning is they weren't providing those thousands of meals; they were  spending your hard-earned tax dollars on luxury vehicles and on pricey  real estate.\n\nAnd yet millions more were stolen by a single woman who paid parents  to enroll their children in her fraudulent…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698560/fraud-accountability-act"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…manager for the Army's Integrated Battle  Command System and later as the military deputy to the commanding  general of the Army Aviation and Missile Command.\n\nIn 2017, he earned his first star as a deputy program executive  officer at PEO Missiles and Space. His second star came in 2019 when he  took over the PEO role. He is credited as a primary driver…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695727/congratulating-lieutenant-general-robert-a-rasch-jr"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the amount of rent paid by each covered family in accordance       with the provisions of section 3, 8(o), or 8(y), as       applicable, that is attributable to increases in earned       income by the covered family during the participation of such       covered family in the pilot program; and\n\n``(B) notwithstanding any other provision of law, may use…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…there are 200 channels, but they might  only watch 4 or 5 of them. There is still going to be a plethora of  options for the American people, but if they are paying their hard- earned dollars to go get content, why should your tax dollars go to  only one thing that the other side wants to promote?\n\nLet everybody compete on a fair basis. They can still watch…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…entrepreneurs that  they serve.\n\nJeanne Best received the 2025 Administrative Service Award for her  excellence behind the scenes, ensuring operations run smoothly.\n\nAleshia Marshall earned the highest honor in the SBDC system: The  2025 State Star Award, recognizing her outstanding performance, deep  community engagement, and unwavering support for small businesses…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692189/recognizing-pennwest-clarion-small-business-development-center"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…commitment to our Nation's veterans and to our  troops. To honor that commitment, the bill provides full funding for  healthcare and benefits for veterans. Our veterans have earned these  benefits, and we are making good on our promises to them. That includes  fully funding our commitment to the PACT Act.\n\nThe bill continues robust investments in women's…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692959/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…excel--all while maintaining his sense of  humor--is a bold testament to his dedication to the House of  Representatives and the people it serves. I wish Noah the best for his  well-earned retirement.\n\nOn behalf of my colleagues and the entire House community, I thank  him for his leadership and longstanding commitment to serving the  People's House.", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696434/thanking-noah-wofsy-for-his-service-to-the-us-house-of-representatives"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…his life. He enlisted at the age of 17 on August 6, 1946, and received  an honorable discharge on April 29, 1948. He served in the South  Pacific on the USS Whiteside. He earned the China Service Medal, the  World War II Victory Medal and the Navy Occupation Service Medal. Leroy  served in the South Pacific on the USS Whiteside. He took great pride…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699480/recognizing-oscar-leroy-wade"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…and opportunities are increasing. In our  schools and military, the emphasis is, once again, on merit instead of  discriminatory DEI standards. In America, success should be earned and  not engineered by woke bureaucrats. It is called common sense.\n\nEvery day of this last year, the President and House Republicans have  worked to ensure that you keep more…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699279/highlighting-republican-successes-in-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…U.S. Marine Corps, died November 11, 2025, at the age of 87.\n\nJon was a lifelong learner. He started a radio station. He studied  journalism at the University of Missouri, earned a master's degree from  George Washington University and a doctorate in international relations  from the American University. He worked for the New York Times at its  Washington…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697134/recognizing-dr-jon-cozean"}]