[{"senator": "George Latimer", "party": "Democrat", "sentence": "…Washington, D.C., to raise awareness for the bill.\n\nTheir run raised national awareness, and it is now up to us to act.  Together, we can support those workers by ensuring that they earn the  fair pay that they deserve.              Recognizing Rye High School Garnets Football Team\n\nMr. LATIMER. Mr. Speaker, I rise to salute the Rye High School  Garnets football…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697468/recognizing-omayra-andino"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…Obama delivering the  commencement address. The University received its initial regional  accreditation from WSCUC in 2011, and in 2015, UC Merced is the  youngest university to earn national recognition for community  engagement with a Carnegie Research Classification.\n\nUC Merced was the first public research university in the Nation to  reach verified…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695846/recognizing-the-university-of-california-merced"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…behind. They are living paycheck to paycheck, unable  to save for a vacation, retirement, or their children's education  because the cost of living has outpaced what most people earn.\n\nRent keeps climbing. Childcare can cost more than a mortgage. Health  insurance premiums, copays, and deductibles eat up paychecks before  families ever get to groceries.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699588/stop-the-republican-affordability-crisis"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…to join  me in defeating the previous question so that, instead of reducing  workers' wages, we can support this bicameral, bipartisan legislation  to ensure that workers can earn the pay and benefits they are owed for  their hard work.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698950/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…education, that divide is called  the homework gap. It is a fundamental question of equity and fairness  to close that gap. Studies have shown that without broadband at home,  people earn lower grades than their connected classmates--no secret as  to why. It is a resource that enables better learning and more  achievement. That learning loss sets them back in…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690726/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…it, but because they  can't afford it. That is not a healthcare system that works.\n\nHealthcare is a human right, and your ability to get it shouldn't  depend on how much you earn, where you live, or whether your employer  offers coverage. No one should have to choose between paying rent and  seeing a doctor or between putting food on the table and buying…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698673/protecting-healthcare-for-millions-of-americans"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…homelessness. Furthermore, Dr. Paccione helped  implement the Colorado ReEngaged Initiative to allow thousands of  Coloradans who did not finish a four-year degree the opportunity to  earn an associate's degree. And under her leadership, Colorado was  ranked first in the Nation for educational attainment in 2022.\n\nThroughout her tenure, Dr. Paccione has been a…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698659/recognizing-dr-angela-angie-paccione"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…public officials.  While enforcing oaths of office is a big challenge, citizens must  demand truth from public officials in all that we do. And as public  officials, we must earn that trust by honoring our oaths.\n\nThe work of Judge Gregory Mize is exemplary in calling America back  to the bedrock quest for truth. We owe him a debt of gratitude.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690041/valuing-truth-fullness-lessons-from-jury-trials"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…benefits from reaching seniors and eligible recipients.\n\nSocial Security benefits are your hard-earned benefits. They don't  belong to billionaire Elon Musk. Americans work hard to earn their  Social Security retirement and be secure as they  age. Social Security has been around since Franklin Roosevelt created  the program nearly 100 years ago.\n\nSocial Security…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688636/social-security-benefits-are-your-hard-earned-benefits"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…children in the United States are  covered by Medicaid and CHIP. Research shows that when children have  access to care, they are more likely to stay in school, graduate, and  earn more as adults.\n\nThat is not surprising to people just to think it through. It is  true. If kids have access to healthcare, they succeed more in life.  Medicaid helps diagnose…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…swimming, track, basketball, and  soccer.\n\nThen, playing for Howard University, she went on to become the first  soccer player from a historically Black college and university to earn  all-conference honors.\n\nNot long after, Amy was diagnosed with health conditions that  prevented her from continuing to play soccer competitively so she  turned to coaching.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689662/recognizing-amy-cooper"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…member can give a  reason. Not a single witness can give a reason why we should do that.\n\nWe forgo hundreds of millions or billions of dollars in taxes on the  gains people earn on investing in Chinese stocks. We encourage them to  invest in the Chinese economy with our tax dollars. Only one Republican  has stepped forward and cosponsored my legislation…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Musk pay their fair share so that we can give tax relief to the middle  class. It looks like passing the PRO Act so that workers in retail and  fast food can join a union and earn a ticket to the middle class like  my grandfather did in his factory. It looks like universal preschool  and affordable childcare, not just because it is good for kids, but…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689081/economic-populism"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…House  regulatory office right now would likely weaken the rules that prohibit  children from working in particularly dangerous jobs.\n\nAll workers deserve to be paid fairly, earn good benefits, and come  home safely at the end of the day. If we truly want to prioritize  workers, then we  must strengthen the laws, including regulations that protect workers'…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695574/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Dearborn's Divine Child High  School for winning the Division 4 State championship with a thrilling  23-22 win.\n\nAfter a dominant season, they rose to the moment at Ford Field to  earn their first State championship in 40 years. It was an incredible  game and an accomplishment that these players, coaches, and families  will remember forever.\n\nThe Falcon players…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697975/divine-child-championship"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…Big Beautiful Bill Act was written for them and  because of them.\n\nTogether, we are proving that when we keep government out of the way,  Americans can keep more of what they earn, and there is no limit to  what we can achieve.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694794/promises-made-promises-kept"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…Falls is competing in sled hockey. Dan Rose  of Tomah and Matt Thums of Ogema are both competing in wheelchair  curling. They overcame tremendous obstacles and hardships to earn their  position with Team USA. They are role models to young athletes  everywhere, proving that with resilience and determination, Mr.  Speaker, you can achieve any goal you…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699752/congratulating-wisconsins-seventh-district-paralympic-athletes"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…American families with the working families tax cut. Mr.  Speaker, do I need to remind you, it is only the largest tax cut in  U.S. history. Workers can keep more of what they earn with no tax on  tips and no tax on overtime. To our seniors, I have good news for you,  too. With the new deduction, you are not going to pay any tax on Social  Security benefits.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…unfair and robs  women and girls of accomplishments and opportunities.\n\nOver 900 medals in women's sports have been won by biological men,  stolen from women who worked hard to earn them.\n\nWomen have fought hard to earn records that have been shattered by  mediocre men, men pretending to be women, mentally ill men pretending  to be women.\n\nThis is a travesty…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Perhaps this was identity theft, but       it's also possible brokers submitted fake Social Security       numbers to enroll ineligible or phantom people in plans.       Brokers earn more in commissions from insurers if they enroll       more people in ObamaCare.\n\nThe Justice Department has charged numerous brokers with       enrolling people in ObamaCare…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697906/affordable-care-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…horizon, the President and Speaker have  indicated that the best is yet to come.\n\nWe are doing our job to help save the American taxpayers' dollars. We  know how hard it is to earn those dollars, and we don't want to see  them squandered.\n\nMr. Speaker, I urge my colleagues to vote ``yes'' on the previous  question, ``yes'' on the rule, and ``yes'' on the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693717/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…going to give me free medical care? Are you going to give me free  daycare?\n\nIn other words, what they do is they want the government to give them  more money that they didn't earn on their own. That would be the end of  America if these are the type of immigrants we are getting in.\n\nI also want to point out that when we look at the people coming here,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Transportation for over four decades  and served as the director for the last 5 years.\n\nShe began her career at the department as a clerk-typist back in  1982. After taking time away to earn an engineering degree from the  University of Memphis, she returned to the department as a civil  engineer in 1998.\n\nIn 2014, she was promoted to deputy director and chief operating…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688705/recognizing-lorie-tudor-on-her-retirement"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…approximately  five hundred Iowans who came to visit the Nation's capital.\n\nFurther, Nicole proved pivotal in helping the team work with  stakeholders across the state and the aisle to earn our team the Top-10  most bipartisan member of Congress, by focusing on delivering results.\n\nEqually, Nicole helped organize a series of ``after-hours'' Capitol  tours and joined…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688151/recognizing-nicole-schmitt"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…out of the shutdown in  time to be paid.\n\nI am not trying to put down anybody. I am not trying to condemn folks  who have been taking their salary. I am not saying they don't earn  every bit of it. But I am saying what is good for the goose is good for  the gander.\n\nI want to offer up these two bills for the Members' consideration,  starting with my first…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…recognized as trailblazers who are willing  to tackle the most pressing challenges facing their communities and the  world with measurable, sustainable, and far-reaching results. To earn  the Girl  Scout Gold Award, high school-age Girl Scouts must identify and  investigate an issue they care about, devise a plan, and then lead a  team of experts and community…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691494/recognizing-faith-mccrea-gold-award"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…rise to recognize Madison Wasmer.\n\nMadison is a junior at Jackson High School and has recently earned  the Eagle Scout Award, becoming the first female in Jackson County to  earn this distinction. To achieve this, Madison obtained 21 merit  badges, showcasing fundamental skills she learned as a Scout and  commitment to her community.\n\nMadison is a true…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693067/madison-wasmer-earns-eagle-scout-award"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…claim over and over. It is 37/37. Let's be very clear on that  message.\n\nSecond, who is getting the big tax cuts in this resolution? It is  seniors, Social Security, people who earn tips, and people who work  overtime. Those are the hardworking Americans who have supported the  President and want to push this resolution forward so that we all enjoy  economic…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691497/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…every  February. This month allows us to highlight the value of CTE programs,  which help prepare students for the workforce. These are programs that  are about learning to earn.\n\nDuring this month, we can look at the immense impact of CTE programs  on learners and the support that CTE provides to different industries.  CTE does more than support students.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700190/recognizing-career-and-technical-education-month"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…known as the 80/20 rule, which stipulates  that tipped workers can spend no more than 20 percent of their time, or  30 minutes at a stretch, doing tasks that don't directly earn tips. If  that sounds arbitrary, that is because it is.\n\nRestaurants and similar businesses already run on thin margins.  Keeping track of that kind of detail adds unnecessary…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698966/tipped-employee-protection-act"}]