[{"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…big, fancy showers with multiple heads. We  are talking about showers for rich people. These aren't even everyday  showers.\n\nMr. Speaker, my question is: Why on God's green Earth on the first  full day that this Congress is back in 2026 are the Republicans using  their floor time in the midst of armed conflict and daily corruption by  this administration…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698563/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Barbara. Californians rose up and demanded stronger  environmental protections, and this became the birth of the modern-day  environmental movement and eventually the first Earth Day in 1970,  which has grown in its recognition and celebration.\n\nThat same year, Congress passed the Clean Air Act on an overwhelming  bipartisan basis. That original Clean…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Lincoln who came to the House Chamber in the middle of  the Civil War, in the early 1860s, and spoke to the Congress and talked  about America being ``the last best hope on Earth.''\n\nPresident Lincoln said that in the 1860s, a visionary declaration of  the role that America might one day play as the leader of the free  world.\n\nThis legislation, this…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693714/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…our work  is not done. The Senate needs to take up this bill immediately so that  Americans don't have to worry about their premiums skyrocketing. In the  richest country on Earth, no one should have to worry about choosing  between paying for groceries, making rent, or having healthcare.\n\nRandall), my cohost for tonight's Special Order hour and my friend…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698671/protecting-healthcare-for-millions-of-americans"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…foolish it would be for the United  States to resume testing of nuclear weapons.\n\nThe fact is, the United States has the best database of nuclear test  results of any country on Earth by far. If we resume nuclear testing,  we will, as will all the other nuclear-capable countries on Earth, they  will rub their hands with glee, and soon they will have a dataset…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Much remains  to be seen about the shape of this agreement, but we do know it will  take years, if not decades, to see substantial returns.\n\nA large number of Ukraine's rare earth deposits are actually located  in Ukrainian territory that is currently contested or occupied by  Russia. I am not sure how one is to square this agreement with  Secretary…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "Ms. DEAN of Pennsylvania. Mr. Speaker, there are places on this Earth  with unbearable suffering. Right now Gaza is starving. Children are  starving.\n\nThese photographs are very difficult to look at, but I ask you to  look because this is a man-made…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694981/gaza-is-starving"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…serious jeopardy if this resolution passes. The Boundary Waters is a  national treasure, the most visited wilderness area in the United  States. There is no place like it on Earth, and once it is destroyed,  it will be gone forever.\n\nLike many Minnesotans, people around the country and the world, my  husband and I have paddled and camped with our kids…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699272/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…the aisle should have invested more in  developing domestic sources of clean energy, invested more in domestic  manufacturing, and invested more in producing and refining rare earth  minerals, either domestically or with our close allies.\n\nWhat we have before us today is an empty messaging bill with unfunded  mandates for busywork that will not provide…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697891/electric-supply-chain-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…there as well.\n\nAltogether, since 1965, around 3,000 interns have contributed to  scientific projects in research areas of importance to USGS and NAGT to  promote high-quality Earth education.\n\nPrograms like this allow students to contribute to our country's  scientific achievements, energy resource development, and economic  prosperity. However, this…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…nations all around the world.\n\nMr. Speaker, foreign aid is not just charity. It serves our interests  as a country, as well, when we build good will with nations that have  rare earth minerals and can assist us in intelligence gathering against  terrorist organizations and our other adversaries. This is part of how  we build strong relationships around the…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692267/calling-on-trump-administration-to-restore-food-aid"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…expect, less than 1 percent.  That burdened taxpayers with an additional $2 billion in national debt.\n\nWhy? Well, because the Arctic is one of the most expensive places on  Earth to drill, and investors in the oil industry know this. In fact,  BP and Shell already abandoned their Arctic proposals, even paying to  exit those leases. Financing has dried…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696880/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…communities, and our environment,  rollback protections for climate and clean energy, for our air, land,  water, and wildlife.\n\nHere just 1 week after the 55th anniversary of Earth Day, my  colleagues across the aisle are putting forth a set of resolutions to  gut protections for clean air and public lands across the West, while  they prepare a reconciliation…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690326/one-hundred-days-of-chaos-dysfunction-and-attacks"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…alone  can break it,'' the results of the last 100 days would have proven him  correct.\n\nPresident Trump, on Inauguration Day, inherited the strongest economy  on the planet Earth--not a perfect economy but the strongest economy,  the envy of other industrialized nations. That is what he had just 100  days ago. And we know this morning that strong economy,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…issue so important to me that I have  been fighting for it since I got here, because America--this great  Nation, this great land--is one of the leading countries on the planet  Earth, in the Western World--in the leading democracies, I should say-- that has maternal mortality rates that are extraordinarily high.\n\nForty-plus percent of our babies are born…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…lives, that we may speak freely down here, that we may debate  with our colleagues, hopefully in civil tone and purpose but  understanding that this is the last great hope on Earth. With friends  like my friend from Arizona, we will make it an even better place to  live.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…alternate vision: ``War in the name of religion  is war against religion,'' he tells us. He calls on people of faith of  all traditions to be ``peacemakers'' and protectors of the Earth.\n\nThere are thousands of Greek-Americans living in Arizona's 8th  Congressional District, including the hundreds of faithful at St.  Haralambos Greek Orthodox Church in Peoria.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695076/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-the-united-states"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…to do free-market  economics anymore. Remember, we are populists now.\n\nIf you embrace that you are going to drive this country--we will  still be greater than any country on Earth, but we are going to give up  so much.\n\nProsperity is moral. The growth is moral. We are killing ourselves,  but we are making promises that aren't in the data. They are not…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…there is a significant event that is  going to happen all around the country--quite frankly, all around the  world--that some people won't even notice but, quite frankly, is Earth- shattering.\n\nThirty-five years ago, a group of students gathered around a flagpole  early in the morning to be able to pray for their school. It was in  1990. It ended up…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695773/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…of freedom . . .''\n\nMay our Nation always endure, producing patriots like the late  Charlie Kirk whose legacy reminds us that America will thrive and never  perish from the Earth.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695333/never-forget-september-11"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…or United States market access for a  geostationary orbit satellite system or a nongeostationary orbit  satellite system, or an authorization to use an individually licensed  earth station or a blanket-licensed earth station, if the license,  grant of market access, or authorization would be held or controlled by  an entity that produces or provides any…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690259/secure-space-act-of-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…direction for the advancement of tools, technologies, and  methods related to cement, concrete, and asphalt production.\n\nConcrete is the second most commonly used material on Earth,  surpassed only by water. The demand is unlikely to decrease soon,  making it crucial to allocate the Federal Government's top scientific  resources to assist manufacturers…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…wants to speak to this  bill. We will have the last word.\n\nMr. JOHNSON. Mr. President, I am not quite sure what planet the  Senator from Michigan comes from, but here on planet Earth, when you  read the actual language of the bill, none of these phantom provisions  exist in there. But I will go through those point for point before we  call for the final…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…me just set the record straight.\n\nOn October 7, 2023, families, mothers, fathers were sitting at home,  enjoying a peaceful existence in one of the most difficult places on  Earth to live. They had a day planned of joy at a festival.  What happened? People came over and savagely--savagely--murdered  children, raped women, took hundreds of hostages, killed…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690859/gaza"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…probably not very funny.\n\nThe thing about these mines in Minnesota is, they are below-grade  mines. They are not pit mines. They are actually digging tunnels down  into the earth to pull this ore out to take it to the top to refine it.  If there are tailings, these tailings will be placed in a secure area  where there is no way they can be leached back…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…of God, a friend to  the forgotten, and the kind of man who cooked Christmas breakfast for a  house full of grandkids, always reminding them: he was the most blessed  man on earth.\n\nWe grieve his loss, but we celebrate a life well-lived, and we thank  God for the example he gave us.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691931/special-recognition-of-the-life-of-ae-peter-pierce"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…revolutionary promise as well as colossal dark threats to       human life, the painstakingly garnered civilization and the       very survival of all life on our planet Earth. Greenberg       attributes the impetus to writing this inspirational guide--      which aims to reassure readers from all persuasions that       covenantal life of the spirit…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697168/the-triumph-of-life"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…from Lexington to Normandy.\n\nAnd throughout our history, American servicemembers have demonstrated  tremendous courage and strength, beating back tyranny to the ends of  the earth.\n\nI was glad to sponsor Jack's nomination, and I am confident that his  talents will distinguish him among his peers during his time at the  Academy and thereafter.\n\nI congratulate…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692771/congratulating-jack-godbee"}, {"senator": "John James", "party": "Republican", "sentence": "…Americans are able to put more money in their  pockets.\n\nMr. Speaker, this bill could not come at a more important time.  Today, China controls more than 90 percent of global rare earth  refining capacity. Russia maintains roughly 44 percent of the world's  uranium enrichment capacity and supplies a significant share of nuclear  fuel imports to the United…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699991/securing-americas-critical-minerals-supply-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…life  from Lexington to Normandy.\n\nAnd throughout our history, American soldiers have demonstrated  tremendous courage and strength, beating back tyranny to the ends of  the earth.\n\nI was glad to sponsor Tyrone's nomination, and I am confident that  his talents will distinguish him among his peers both during his time  at West Point and thereafter.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692755/congratulating-tyrone-miller"}]