[{"senator": "Jack Reed", "party": "Democrat", "sentence": "Mr. REED. Mr. President, over the past 2 months, President Trump has  ordered 16 airstrikes in the Caribbean and eastern Pacific, killing  more than 65 people. His administration boasts that they are targeting  drug-trafficking organizations. Yet Congress and the American people  have received…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "Mr. WARNOCK. Mr. President, I welcome His All-Holiness Ecumenical  Patriarch Bartholomew of the Eastern Orthodox Church to the United  States of America. Since 1991, Ecumenical Patriarch Bartholomew has  served as the spiritual leader for 300 million Orthodox Christians  across…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695587/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…State of Illinois and the thousands and tens of  thousands of citizens there who so deeply care about victory for  Ukraine.\n\nLet me now move to a highly capable Member from the eastern part of  the great State of Pennsylvania, Congresswoman Madeleine Dean.\n\nMs. KAPTUR. Mr. Speaker, I thank Congresswoman Dean so very much for  joining us and for her firm,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…the  groundbreaking research its students produce every day.\n\nWith her historic donations to Bowie State University, Morgan State  University, and the University of Maryland Eastern Shore, MacKenzie has  proven herself to be an honorary Marylander, an American who cares  about investing in our future, an American who understands the critical  importance…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698077/thanking-mackenzie-scott"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…the National Democratic Institute's  democracy award--have worked at great personal risk to defend those  basic rights. Their fight is part of a larger global struggle.\n\nFrom Eastern Europe to Latin American and Southeast Asia, the pattern  is the same: When authoritarian leaders feel threatened, they silence  critics, shut down independent groups and…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697939/international-human-rights-day"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…seem that sexy or something but that I think is pretty important:  U.S. attorneys and the rule of law. Virginia has two U.S. attorneys,  Western District of Virginia and the Eastern District of Virginia.\n\nAnd those two U.S. attorneys who were put in office by President  Trump have both recently been forced out of office--forced out of  office because…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696334/trump-administration"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Mother Teresa, the Dalai Lama, and Archbishop  Desmond Tutu.\n\nHis All-Holiness has been a pioneer in merging spirituality with  science as a force for change. As head of the Eastern Orthodox church,  he has gathered scientists, scholars, politicians with Catholic,  Jewish, and Muslim clerics. He also became the first Christian hierarch  to visit countries…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695851/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "John Fetterman", "party": "Democrat", "sentence": "…Patriarch Bartholomew is the longest serving Archbishop of  Constantinople in the two millennia history of Christianity. As the  highest spiritual authority for nearly 300 million Eastern Orthodox  Christians, he has cosponsored international peace conferences;  convened Christian, Muslim, and Jewish leaders to promote cooperation  and mutual understanding;…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697378/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…production lines open--and that means aircraft from  Everett, WA, or cars and trucks from Detroit, MI.\n\nAmerican farmers rely on our economy to keep fields planted-- production in eastern Washington and northern and central Iowa depend  on the cost of fertilizer, seed, and equipment.\n\nSmall business owners across the country depend on consumer  confidence in…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689522/klobuchar-ms-murkowski-mr-warner-mr-mcconnell-and-mr2024"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…floor and saying: Hell, no.\n\nWe failed.\n\nSecond is in oversight. It has now been 4 months that the  administration has been preparing their war plan, striking ships in the  Eastern Pacific, striking boats in the Caribbean. Not a single  oversight hearing--not one. That is our responsibility, and we failed  it.\n\nAnd now we are failing on the third key…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "Mr. CONAWAY. Mr. Speaker, I rise today to welcome His All-Holiness  Ecumenical Patriarch Bartholomew to Washington, D.C.\n\nKnown as the ``Patriarch of Peace'' by the Eastern Orthodox Church,  he guides millions of faithful around the world in their spiritual  journey and relationship with God. He has long championed interfaith  dialogue, global…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695506/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…President Donald Trump to  appoint a Special  Envoy to the Great Lakes region of Africa, which will be vital to  addressing the enduring regional security crisis emanating from eastern  DRC.\n\nMr. Speaker, I hope my colleagues will join me in condemning the  ethnic violence in the DRC.", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699456/reintroduction-of-the-resolution-to-condemn-the-ethnic-violence-in-the-democratic-republic-of-the-congo"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…humble  beginnings of this Nation. In the 1800s, there was a development of the  Erie Canal in upstate New York that is still looked to as perhaps the  first tech corridor.\n\nThe eastern mouth of that Erie Canal is included in the geography  that I serve in New York's 20th Congressional District, in the greater  capital region. Along that canal, we not only…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691396/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…few weeks ago, he announced that he was going to  stop the offshore wind projects that were over 90 percent constructed  in Rhode Island. He has done the same throughout the eastern seaboard.\n\nI think it was the gentleman from Kentucky (Mr. Guthrie) who said  that it takes a long time to build these energy facilities, and either  the gentleman or one…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695765/national-coal-council-reestablishment-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…person who had the power to do so to say: Well, it is simply not  classified information, so no big deal.\n\nHere is the big deal. Mr. Goldberg indicates that at 11:44 a.m.  eastern time--he gives the name of the person, it is the Secretary of  Defense, posted in the chat in all caps: ``TEAM UPDATE:'' Then, Mr.  Goldberg indicates that the text beneath…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…salon. In 2019, she earned her cosmetology license from the  Jean Madeline Aveda Institute. By combining her new certification with  skills cultivated during her upbringing in Eastern Europe, Jenya  brought a unique professional expertise to the Greater Philadelphia  area. After obtaining her United States Citizenship, Jenya fulfilled  her dream through…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691903/recognizing-beauty-moods-one-year-anniversary"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "Mr. CALVERT. Mr. Speaker, I rise today to congratulate Eastern  Municipal Water District (EMWD) as it celebrates a major milestone in  the district's history. This year, EMWD will mark its 75th Anniversary  and a proven legacy of service…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696365/congratulating-the-eastern-municipal-water-district"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…development efforts and launched new initiatives aimed at  supporting some of the most vulnerable populations in Central Illinois.\n\nJohnson earned his Bachelor of Science from Eastern Illinois  University and a Master of Science from Western Illinois University.  Before joining Goodwill in 2016, he served as Executive Director of the  Hult Center for Healthy…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693113/congratulating-don-johnson-on-his-retirement-as-the-ceo-of-goodwill-industries-of-central-illinois"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…saw  people needing a hand up.\n\nToday, I rise to celebrate the 40th anniversary of Beaches Emergency  Assistance Ministry, BEAM, a lifeline for families facing hardship in  eastern Duval County, places like: Mayport, Jacksonville Beach, Neptune  Beach, Atlantic Beach. From keeping the lights on to filling the  pantry, supporting seniors and single parents,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694060/may-beam-continue-to-light-the-way"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Mr. BAUMGARTNER. Madam Speaker, I rise today to recognize Marine  Sergeant Joshua Elliott of Stevens County in eastern Washington and to  highlight the incredible work of Homes For Our Troops.\n\nAfter the 9/11 attacks, Josh enlisted in the Marine Corps to serve  his country. During his second…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700140/recognizing-joshua-elliott"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Beautiful Bill Act and its impact on rural communities.\n\nThe House took an important step for rural America by passing the One  Big Beautiful Bill Act. For communities across eastern Washington, the  relief cannot come soon enough.\n\nFor years, rural communities with large amounts of Federal land faced  a structural disadvantage. They can't collect property…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692323/taking-an-important-step-for-rural-america"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…international agreements to       which the United States is a party; and\n\n(2) aim to reduce incentives for illicit maritime drug       trafficking on a global scale, including in the Eastern       Pacific Ocean, the Indo-Pacific region, the Caribbean, and       the Middle East.\n\n(c) Briefing.--Not later than 1 year after the date of       enactment of this Act,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Mike Turner", "party": "Republican", "sentence": "…Ukraine.\n\nOur support to Ukraine opposes Russia's murderous aggression. Ukraine  is fighting on the front lines against Russian aggression. Vladimir  Putin is threatening NATO's eastern flank, including the Balkans.  Russian drones have flown over Poland. It is unbelievable that, after  Poland has been threatened, we are even debating this amendment today.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695258/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Mr. BAUMGARTNER. Mr. Speaker, eastern Washington and Spokane are home  to many heroes and champions, but I would like to speak today of one  particularly exceptional young man, Brycen Phillips of Mt. Spokane High…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694110/recognizing-brycen-phillips"}, {"senator": "James Risch", "party": "Republican", "sentence": "…communities.\n\nThese people have been transmitting drugs into the United States via  a lot of different ways. One of them was by vessels, shipping vessels,  in the Caribbean and the eastern Pacific Ocean.\n\nBut some Democrat Members and members of the media have claimed that  President Trump does not have the authority to conduct these strikes. I  will tell you…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696565/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…Montana's economy. This happened after the election. Biden's  BLM issued an amendment to the Miles City Resource Management Plan that  prohibited all new coal development in Eastern Montana. It shuts it  down. This means that the BLM prohibited all new coal leasing in the  Powder River Basin. By the way, that is the home of the largest coal  reserves…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696095/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…countries: If you hate this country, refuse to go by our laws, and  chant ``Death to America,'' it is time to go home.\n\nThere are a lot of good people that come from Middle Eastern  countries and go by our laws and assimilate with our culture, but if  you come here otherwise, it is time to go home.\n\nThe Trump administration is also prioritizing the deportation…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "French Hill", "party": "Republican", "sentence": "…of Arkansas. It is the oldest and largest national  forest in our southern region. It has origins in my district of central  Arkansas and stretches some 220 miles west into eastern Oklahoma  through my good friend, Mr. Westerman's district.\n\nIt encompasses nearly 10,000 acres of rugged terrain, and the most  treasured views in the Ouachita region are…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…200,000 pages. In my lifetime, the number of  rules and regulations written by unelected Federal bureaucrats, the  people in the real world that we all represent--in my case in eastern  Kansas--must comply with, has quadrupled.\n\nI will guarantee you, Mr. Speaker, that is a silent tax increase on  every American and every small business in all of our States.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697331/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…stationed overseas for  six months. As a result of his meritorious service, he received the  Purple Heart, an Air Medal with Oak Leaf Cluster, the European-African- Middle Eastern Campaign Medal with one silver battle star, and the Good  Conduct Medal with one overseas bar. Johnny completed his service in  1947 and later fulfilled an advertisement recruiting…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690292/recognizing-congressional-patriot-award-recipient-john-johnny-rothfus"}]