[{"senator": "George Latimer", "party": "Democrat", "sentence": "…fresh food is no longer available, our community will suffer.\n\nThese cuts must be reversed and quickly. Time is of the essence when  it comes to our children having enough to eat.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689059/feeding-our-children"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…a $300-million cut to the SNAP  program, yes, on food stamps, which would impact 300,000 people in my  district, many of them children and seniors who rely on the benefit to  eat.\n\nMr. Speaker, 35 percent of them are children.\n\nThis will be the largest cut to the Food Stamp Program in our  Nation's history. In the middle of the night, Republicans will…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691482/medicaid-and-social-security-cuts"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…because the cost of living has outpaced what most people earn.\n\nRent keeps climbing. Childcare can cost more than a mortgage. Health  insurance premiums, copays, and deductibles eat up paychecks before  families ever get to groceries. Too many parents are lying awake at  night running the numbers, wondering which bill they can delay paying  this month.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699588/stop-the-republican-affordability-crisis"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…country. Maybe we will stay in Canada. But we are not going to travel  there.\n\nThe average foreign visitor spends about $4,000 when they come to  America.\n\nWe are not going to eat their food. We are not going to go to their  restaurants. We are not going to stay at their hotels. We are not going  to fish in their lakes.\n\nYou name it, that is what the…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Republican bill cuts Medicaid, forcing states to pay more or  cover fewer people--it cuts benefits.\n\nI think of the 64,000 people in Connecticut, including 27,000  children, who can eat thanks to food stamps.\n\nIf this program is pushed back to the states, who have fewer  resources, the children will go hungry, and their families will not be  able to afford…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691427/supporting-the-democratic-womens-caucus-on-defending-snap-and-medicaid-cuts"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…exactly who gave you that price increase,  exactly who put you in that position, exactly who told you that he was  going to lower your costs, and now  you are going to have to eat that cost starting January 1. That is  Donald Trump. That is my Republican colleagues who sit across the  aisle. That is everyone who said: I am going to do the political thing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695610/healthcare"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…been fortunate enough to visit several food banks across  New Mexico and meet with community members who are working around the  clock to make sure neighbors have something to eat.\n\nTo every one of our community members who have stepped up, I want to  say thank you--not just across New Mexico but across America. I am  proud to represent a community that…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Come, you who are blessed  by my Father; take your inheritance, the kingdom prepared for you since  the creation of the world. For I was hungry and you gave me something  to eat, I was thirsty and you gave me something to drink, I was a  stranger and you invited me in, I needed clothes and you clothed me, I  was sick and you cared for me, I was in prison…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691771/151-days-without-a-vote-to-lower-costs"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…already rich? They want  to give $6 million per billionaire. Think about that. For a  billionaire, $6 million is not even a rounding error. For a hungry  child, it is enough to eat every single day for 34 lifetimes.\n\nInflicting hunger on children to give billionaires money they don't  need and won't even notice, there is no moral code under which that…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688082/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…farmland poses the risks that are being overblown.  I don't think China can ship our topsoil back to China nor do I think  that China can deprive Americans of the ability to eat American food.\n\nH.R. 1713 addresses these concerns, the concerns that people do have,  by providing a path for the Secretary of Agriculture to notify CFIUS  when those transactions,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692798/agricultural-risk-review-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Come you, who are  blessed by my Father; take your inheritance, the kingdom prepared for  you since the creation of the world.\n\nFor I was hungry and you gave me something to eat. I was thirsty and  you gave me something to drink. I was a stranger, and you invited me  in. I needed clothes, and you clothed me. I was sick, and you looked  after me. I was…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…here--there are several of us  who are Hispanics here, Democrats and Republicans. Speak up.\n\nWhen one of my predecessors was here, Dennis Chavez, there were  places he could not eat in this town because of the color of his skin,  because he was from a State called New Mexico.\n\nAre we going to use our voices? Are we better than this in the United  States…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692552/alex-padilla"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…a time when this Nation and this world was experiencing  injustices that we cannot fathom today; and a place where people, based  simply on the color of their skin, could not eat in certain places,  work in certain places, be educated in certain places, or live in  certain places.\n\nThe people of Alabama, particularly Montgomery, Alabama, stood up at…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…that one of David's medications ``can cost up to $1,000 a month.'' She  said that if Republicans are successful in cutting Medicaid, ``we would  have to choose--are we going to eat? pay the bills? or keep him  alive?'' She said, ``It is a life-or-death situation.''\n\nSo when Republicans are talking about cutting Medicaid to hand tax  cuts to the wealthiest…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689514/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…violently, targeting day  laborers, busboys, farmworkers, and some of the hardest-working people  in this country. Not dangerous criminals, but the people who pick the  food we eat and clean the tables we sit at.\n\nThese raids are terrorizing communities and sowing fear in public  spaces across America: in schools, at shopping centers, at grocery  stores,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693156/one-big-beautiful-bill-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…access to  affordable, nutritious food year-around.\n\nBy freezing food at its peak, we preserve both the flavor and  nutrients, making it a smart choice for families looking to eat well  while managing their budgets.\n\nFor millions of Americans, especially those facing time constraints,  frozen food offers an affordable, easy way to enjoy balanced meals.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689069/frozen-food"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…across the way advocated no  mining. In fact, he used a national monument, disgracefully, to  actually bring in a tin-silver mine. Yes, that is bad, but we can have  our cake and eat it too. That is technology.\n\nMr. Speaker, if you look at the Boundary Waters that everyone is  debating, we have Canada actually doing gold mining up here with more  toxic chemicals.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699270/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…between a  child having a full belly, going to sleep, waking up the next morning,  and going to school happy and that same child asking their mom when is  the next time they will eat a meal, going to bed hungry, and doing  poorly the next day.\n\nRepublicans are working to extend the program. I want a bill to fund  SNAP, but it looks like we will not have…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…celebrating achievements that I was not aware of. I will  now share with my family where the slow cooker came from. I didn't  know. It makes sense given the kind of food that we eat at home.\n\nYet, I ask us as we tackle this issue to be focused on solving the  problem and not making it worse by trying to come up with things that  will divide us all.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691193/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…people who have disabilities, but it also provides them with a little  extra money to supplement their SSI income, from which they can buy  clothes, buy gifts, and go out to eat from time to time.\n\nIn order to allow these folks to work, some of them have to be paid  less than minimum wage. Mr. Speaker, if you have never seen one of  these work centers,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694041/opportunities-to-stay-in-place-for-disabled-workers"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…is filled with photographs spanning  generations, each snapshot a testament to traditions, memories, and the  moments shared.\n\nFor many, this hotel is far more than a place to eat or sleep. It is  a community gathering place. It is their own Cheers, as longtime staff  member Dan Collar described. It is a place where locals and visitors  alike return year…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693585/congratulating-the-waterville-hotel"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…are focused on  actually putting the American people first. We are focusing on the  American people whom we represent, not whether the people in Zimbabwe  have vegan food to eat, and not electric buses in Rwanda. This is what  those on the other side of the aisle want to defend: the waste, the  fraud, and the abuse. They actually advocate for it.\n\nMr.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…illegal aliens can get mortgages, bank loans, insurance,  driver's licenses, in-State college tuition, and free healthcare. For  illegal aliens, the U.S. has been an all-you-can-eat buffet. However,  the American taxpayer and innocent women like Laken Riley, Jocelyn  Nungaray, and Rachel Morin have paid the full price of the left's open- border agenda.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…they are genuine, now, when they condemn Maduro as an  illegitimate dictator and a drug trafficker, someone who repressed his  own people, even if they then immediately want to eat their cake and  have it too by saying that President Trump still shouldn't have removed  him. I think it is just that they are so blinded by their hatred of  President Trump…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the  things we do to keep our insured population alive and healthier.\n\nWe do things. We reward them for doing these data rings, or putting  things on their wrists, or how they eat, or we gamify some exercise,  and talk about how much healthier the population is. For them, it is a  profit model. Turns out, if you sell life insurance, the longer someone…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…know, I really hope that people will keep the  doctor they want to keep, have the choices they can have in healthcare,  and their premiums will go down. If that happens, I will eat my words.  I hope I can eat my words because there is no joy in having a bill pass  and see people lose their doctors of choice, lose choice in health  plans because it is consolidating,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698566/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…delivered into Gaza last month than in almost any other  month of the past year. There is no blockade. Food is getting in. Hamas  is stealing it, and what they steal, they either eat or they sell.\n\nThis resolution is incomplete, it is misleading, and unfortunately it  is partisan.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695665/cloture-motion"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…2025, which reinstates the Aquaculture  Depredation Order for double-crested cormorants. The double-crested  cormorant is a nuisance, plain and simple.\n\nA single cormorant can eat up to 1\\1/2\\ pounds of fish every day.  Even the Fish and Wildlife Service has classified them as opportunist  and generalist feeders that prey on a wide range of species.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697639/cormorant-relief-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…store, either through diesel or gasoline.\n\nPrices matter. It hurts families when their electric bills are high  and when their grocery bills are high because people have to eat and  they have to have a safe and clean place to live. This is what this is  about. This is what our struggle is over, and this is what we are going  to accomplish as a committee.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…no field hospitals. There are no trenches  with infantry soldiers shooting at each other. We were not even there  long enough for soldiers to heat up an MRE.\n\nThat is what we eat in the field in the military, guys.\n\nYet, just to give you a level of peace of mind because you are  curious about this, Secretary Rubio confirmed in his letter last week  that…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}]