[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…shortages. Nationally, TPS holders contribute an estimated       $6.9 billion annually in wages and $1.6 billion in state and       local taxes, strengthening local economies and tax bases.\n\nBehind these numbers are families and human lives. Many       Haitian TPS holders have lived in Massachusetts for over a       decade. They are parents of…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…Jamaican, Haitian, Venezuelan, Cuban, and Central-American  communities. They are nurses, doctors, pastors, teachers, small  business owners, and caregivers.\n\nThe reason our economies thrive is because of our immigrant  communities. The attacks on immigrants and Americans exercising their  right to protest must end now.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692239/ice-raids-in-california"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…Manufacturing Finance Act.\n\nSmall manufacturers account for more than 98 percent of U.S.  manufacturing firms and employ 4.8 million Americans. They play a  critical role in regional economies and in maintaining supply chain  resilience.\n\nThere is no doubt that reshoring manufacturing is a top priority. We  all lived through the pandemic and saw the downsides of…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697219/made-in-america-manufacturing-finance-act"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…economics: Again, we are the most economically powerful  nation in the world. We have the largest economy. We benefited the  most. If we can help other countries generate economies, we have access  to those markets. They will buy our stuff. It grows our economy. It has  worked spectacularly well for 80 years.\n\nNumber two, disease and health: Sadly,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…a food assistance  benefit of $2 per meal so people don't go hungry. By the way, that  money not only lifts people out of poverty, it improves health and it  uplifts local economies, too.\n\nHunger costs this country, and food assistance programs save us  money. People who have enough food to eat are more productive at work.  Kids who are not hungry are…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…supports  resilient supply chains, and provides competitively priced apparel that  helps keep costs affordable for American consumers. This partnership  strengthens both of our economies and creates opportunity abroad while  boosting economic activity right here at home.\n\nToday, however, Haiti faces extraordinary political unrest, economic  strain, and humanitarian…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698850/haiti-economic-lift-program-extension-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…U.S. domestic (coastwise) trade  under a limited Jones Act exemption, thereby expanding access to  modern, secure and cost-effective vessels without subsidizing  adversarial economies. Finally, the legislation establishes a regulated  pathway for foreign-built, foreign-crewed vessels operated by companies  from allied nations to participate in the U.S.…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694572/introduction-of-the-merchant-marine-allies-partnership-act"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…policies. I hope my colleagues will stand  with me.\n\nI urge Members to vote ``no'' on the Save SBA from Sanctuary Cities  Act of 2025 to protect the SBA's mission and vibrant economies for all  of our cities.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692101/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…provide a visible  alternative to the PRC by emphasizing economic partnership over debt- trap diplomacy, all while encouraging private-sector-led development,  market-based economies, and goodwill towards the U.S.\n\nThe PROSPER in the Pacific Act would authorize the President to  designate certain articles imported from eligible Pacific Island  countries…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697950/supporting-the-prosper-in-the-pacific-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…80% of the global       increase due to its low costs and faster permitting       processes.\n\n``In addition to growth in established markets, solar is       set to surge in economies such as Saudi Arabia, Pakistan and       several Southeast Asian countries,'' Executive Director Fatih       Birol said. ``As renewables' role in electricity systems…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…Donald John Trump abused trade  powers by imposing unjustifiable and unreasonable tariffs on foreign  nations, causing a sharp decline in the United States economy and the  economies of countries around the world, and declaring the false  existence of a national security emergency to justify his actions.  Donald John Trump's tariffs contradicted trade…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…conserved but are wary of selling the  federal or state governments an easement on their property. Expanding  opportunities to conserve working forestlands will benefit our rural  economies and encourage sustainable forest management practices that  help prevent wildfires.\n\nThis bill maintains the integrity of the Forest Legacy Program by  holding all accredited,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689872/reintroduction-of-the-forest-legacy-management-flexibility-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…McDonald's in East St. Louis  was one of the few restaurants that always had a line.\n\nToday, McDonald's operates 36,000 restaurants in more than 100  nations, and it bolsters economies across the country and world. And  there are few more recognizable logos than the McDonald's Golden  Arches. Crisscrossing the State of Illinois requires driving hundreds…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689830/recognizing-70-years-of-mcdonalds"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…the economic  output of outdoor recreation in 2023 was over $1 trillion.\n\nIf the administration builds roads in these places, we not only lose  these experiences, but our economies lose their customers. It is not  just me saying this; constituents across my State are saying it to me  too. Michael writes from Albuquerque. He says:\n\n[T]his seems to be…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…preserve humane immigration protections like TPS. Without       those protections, the consequences will be severe, forcing       families into crisis, undermining local economies, and       pushing communities into unnecessary instability.\n\nTPS for Haiti was first designated in 2010, after a       catastrophic earthquake. Extensions continued over…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…is it the  time to allow them to continue to benefit from U.S. investment dollars  now that they are no longer a developing country, but they are one of  the most advanced economies in the world and certainly a rising  military power.\n\nWe know that China, Iran, and Russia have conducted joint naval  drills in the Middle East, called the Maritime Security…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688824/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…making sure  that the dollars contributed by sportsmen and sportswomen continue to  be put to work by conserving the wetlands that sustain wildlife,  outdoor access, and rural economies, including in places like  Colorado's San Luis Valley, where thousands of acres of wetlands  benefit from these funds.\n\nThere is no better conservationist than the American…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693492/wetlands-conservation-and-access-improvement-act-of-2025"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…commonsense bill allows  aquaculture producers to effectively manage the overpopulation of  double-crested cormorants, which threatens their way of life and harms  coastal economies. I once again thank Mr. Ezell for his diligent work  and attention to this issue.\n\nMr. Speaker, I urge the passage of H.R. 2293 and yield back the  balance of my time.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697641/cormorant-relief-act-of-2025"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…an end;  that it is going to be replaced by a region that moves together, where  Sunnis and Shias and Israelis and all different groups--Christians-- work together to build economies for all those rights.\n\nWe live in a time of choosing. I choose to stand up to evil.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…management in a way that provides fuel, food,  and fiber for the Nation and conserves our natural resources.\n\nRMPs manage the resources that are the backbone of western rural  economies and support thousands of good-paying jobs. That is what makes  the Miles City Resource Management Plan amendment so egregious.\n\nThis RMP amendment virtually ended future…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…significant economic driver. It is estimated that,  by 2032, it will become a $13.8 billion industry. By enhancing our  promotion of music-related tourism, we can stimulate local economies,  create jobs, and showcase America's rich cultural heritage.\n\nMadam Speaker, I urge my colleagues to join me in voting in favor of  H.R.\n\nMr. BILIRAKIS. Mr. Speaker, let…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690271/american-music-tourism-act-of-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…businesses that are the  backbone of our country can thrive again.\n\nIf we fail to extend the Trump tax cuts, small businesses will see  their tax rates nearly double, harming local economies and Main Street.  This financial burden would limit small businesses' ability to grow and  force some to reduce the size of their staffs or even close their doors  entirely.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690715/help-small-businesses-thrive-again"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…is excited. They are excited for no  tax on tips, tax relief for seniors, the end of the death tax, and  provisions to help small businesses create jobs and grow the local  economies.\n\nThe One Big Beautiful Bill Act truly puts the American person first.\n\nNow, here is the interesting fact. Instead of joining us to put every  American first, I want to remind…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694791/promises-made-promises-kept"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…together elevate U.S.  cooperation with our Indo-Pacific allies.\n\nThe Indo-Pacific is home to over one-half of the world's population,  vital trade routes, and rapidly growing economies and markets. It is a  region that I hold as a key priority as chair of the East Asia and the  Pacific Subcommittee of the House Foreign Affairs Committee due to its  significance…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694824/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…direction.\n\nWayne and Garfield Counties are counties that struggle in a State  that otherwise thrives. Utah has a really strong economy, but these  rural counties have really weak economies. The reason the rural  counties struggle is because almost all of the land in their counties  is managed by the Federal Government. The Federal Government can make  rules…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690403/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Julia Letlow", "party": "Republican", "sentence": "…of collaboration in a  competitive marketplace. Over the decades, this cooperative has grown  to serve more than 200 independent retailers, a model that strengthens  local economies and ensures that consumers have access to fresh,  quality foods, even in rural and underserved areas.\n\nCongratulations to Associated Grocers, Inc. of Baton Rouge on this…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691354/congratulating-associated-grocers-inc-of-baton-rouge-on-their-75th-anniversary"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…the art of self-government is about people's  ability to rely on themselves. There was always trade, of course--this  is a natural and good privilege of productive surplus economies--but in  a republic, there was also trade between sovereign, self-sufficient  communities. The citizen of the classical republic had no need for  cheap trinkets, fashion,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…by foreign direct       investment, particularly acquisitions, in the United States       by State-owned or State-backed enterprises, especially from       State-directed economies, including companies or other       entities owned, directed, supported, or influenced by the       Chinese Communist Party.\n\n(7) Specific information on the prevalence of…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692697/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…hardworking families.\n\nMr. Speaker, the Securing America's Critical Minerals Supply Act  takes an important step towards solidifying the U.S. position as a  global leader in economies and technologies of the future.\n\nMr. Speaker, I urge my colleagues to support this legislation, and I  reserve the balance of my time\n\nMr. Speaker, it is a shame. Instead…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699990/securing-americas-critical-minerals-supply-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…boots, shoes,  and barrel staves.\n\nAs the town grew, so did trade and tourism. The Cumberland and Oxford  Canal opened in 1832, tying together the Sebago Lake and Portland  economies. Later, in the 1870s, the Portland and Ogdensburg Railroad  expanded the town's hospitality industry and encouraged steamboats to  bring visitors to Sebago. What were once…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699146/town-of-sebago-200th-anniversary"}]