[{"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…leaving  manufacturers and suppliers vulnerable. We have a responsibility to  rebuild American manufacturing and protect workers because doing so is  essential to both our economic strength and our national security.\n\nSupply chain legislation is vital to our long-term competitiveness as  a country, and I am glad to see that progress is being made on this…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690189/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…question of whether but how.\n\nHuge trade deficits translate into growing U.S. debt. We hear a lot  on the other side of the aisle about the debt. There would be a lot  more economic strength if we hadn't outsourced so many jobs. With  Canada, our largest fair trade partner, the books look pretty good.\n\nThe Great Lakes folks get along on both sides of the…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…without good  healthcare. The two are incompatible. Widespread sickness, illness, and  disease and people can't get their health issues covered, it takes away  from our economic strength.\n\nIn fact, just cutting Medicaid would cost jobs, nurse's aides,  support staff, medical technicians. Entire communities depend on  funding that Medicare provides. Cutting…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…China is simply an economic competitor. Rather, China has taken an  aggressive adversarial posture toward American  influence and power globally, leveraging its growing economic strength  to do so.\n\nTo address concerns raised by China's conduct in this regard,  American policymakers, including Members of Congress, need accurate  data about the potential…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694120/china-financial-threat-mitigation-act-of-2025"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…express my profound  opposition and disappointment in the recent executive order that strips  away collective bargaining rights for Federal workers.\n\nThe foundation of the economic strength of Indiana's First  Congressional District is our labor workforce. It is only because of  the ability to collectively bargain and form unions that workers in our  Nation…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689606/protecting-federal-employee-unions"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…back home right now, most of the  people who are being rounded up are workers in factories and workers in  farms who are picking our crops.\n\nThat is part of the American economic strength. The President needs  to know that his immigration policies, as being implemented right now,  are not what he is saying and not what he deems is good for this  country.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693071/special-interest-alien-reporting-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Security,  completely inaccurately. Westchester is not and has never been a  sanctuary jurisdiction. In the last 7 years, we have reduced violent  crime, and we have brought economic strength over a period of time that  rivals any county in this Nation.\n\nWestchester County cooperates with Federal immigration law. County  law, however, requires that no administrative…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692104/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…reverse, even if Trump pulls back his tariffs, supply chains are  clogged already.\n\nPutin has long spoken about his interest in reducing the world's  reliance on America's economic strength and the U.S. dollar. Such a  world leaves each American poorer and with fewer economic  opportunities. Just as Russia relies on oil exports to finance and  undercut the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…thousands of good- paying jobs.\n\nThe REFINER Act recognizes that refining isn't an afterthought. It is  a foundational piece of our national security, as well as our economic  strength.\n\nI urge my colleagues to support H.R. 3109.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697030/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…marketplace. It is just that simple, Mr.  Chairman.\n\nThis great Energy and Water Development appropriations bill, let me  tell you what it will do. It will bolster our economic strength. It  will bolster our economic strength, which suffered the last 4 years,  under the current administration. It will create jobs. It will create  jobs that are much needed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694854/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…export sector.\n\nThe island plays a significant role in global supply chains,  particularly in the semiconductor and advanced manufacturing sectors.  Yet, despite its economic strength and proven track record of  responsible financial governance, Taiwan continues to be marginalized  and held to a second-class standard by the IMF.\n\nMake no mistake, Mr.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…reflect their cleaner  operation.\n\nUpon returning to office, President Trump and House Republicans  focused on restoring commonsense governance: prioritizing American  jobs, economic strength, and practical solutions. S.J. Res. 31, like  other measures undoing ill-advised Biden-era policies, represents a  decisive step in the right direction.\n\nLet's get back…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…our military and border security,  and implements the largest spending reduction in American history by  twofold, alongside other generational fiscal reforms.\n\nAmerica's economic strength, Mr. Speaker, is the foundation of our  global leadership and prosperity, but sadly, it has waned, especially  over the last 4 years.\n\nTo preserve our influence abroad…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693192/one-big-beautiful-bill-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…companies and their products;\n\n(4) while foreign direct investment by responsible private-      sector entities based in trusted countries can enhance the       United States economic strength, policies regarding foreign       direct investment should reflect security interests and       should not disadvantage domestic investors or companies;\n\n(5) United States…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692697/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "Mr. HUIZENGA. Mr. Chairman, I rise in strong support of the  Incentivizing New Ventures and Economic Strength Through Capital  Formation, the INVEST Act, and ask for its immediate passage.\n\nMr. Chair, this package of bills before the House today is the  culmination, as the Chair…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697832/increasing-investor-opportunities-act"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…Dream possible.\n\nMy commitment is simple: Lower prices for Tennesseans, bring down  healthcare costs, protect communities, and restore American energy  independence and economic strength.\n\nI will work every day with President Trump and my colleagues in this  House to deliver on the America First agenda.\n\nOur constituents are looking for results. The people…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697494/welcoming-the-honorable-matt-van-epps-to-the-house-of-representatives"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…future.\n\nHe cares about this Nation. He believes that we are on an  unsustainable fiscal path and he believes that if we don't intervene,  we will not only jeopardize our economic strength but our national  security, our global leadership, and God forbid, a sovereign debt  crisis certainly would rob our children of their freedom and  opportunities in this…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}, {"senator": "John Thune", "party": "Republican", "sentence": "…is with a bigger and stronger economy, not bigger tax  bills.\n\nWe have an opportunity to help turn the page on the Biden economy and  set up our country for long-term economic strength, and we can do that  by delivering on the President's tax priorities and making his first  term tax success permanent.\n\nAnother one of our small business priorities is…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690626/national-small-business-week"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…fellow west Texan, August Pfluger, in support of the Unlocking our  Domestic LNG Potential Act. America is the world's top exporter of LNG,  a vital pillar of both our economic strength and national security.\n\nIn an effort to placate the radical left, which I think was primarily  the motivation, the Biden administration, with its whole-of-government…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697087/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…generation of technology, we  must thoroughly assess and protect our supply chain. Any disruption  threatens not only our progress but also our national security, our  economic strength, and our global position in the artificial  intelligence race.\n\nThis amendment strengthens our ability to safeguard America's  advancements in artificial intelligence…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697894/electric-supply-chain-act"}]