[{"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…indiscriminate and chaotic  approach to this economy that is already not working for everyone.\n\nIf these tariffs do depress the economy and a recession comes, which  many, many economists are now predicting, it will not be the  billionaires who are affected the most. It will be American small  businesses that are burdened. It will be American consumers that…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689471/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…companies will have to charge for the methane  they do deliver and the more gas prices will go up for families and  businesses.\n\nThe oil companies, they don't believe in what our economists call  externalities. They think they can just throw methane into the air and  let everyone else pay the price in terms of climate change, in terms of  bad health for people,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688145/methane"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…not because of a  mortgage meltdown or a one-in-a-century virus but because of one man  alone: the President of the United States.\n\nUnless we reverse course quickly, many economists believe that a  recession is inevitable. And like in all recessions, the pain will fall  hardest on working families. Many Americans will face the one-two punch  of job losses…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690534/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…matter of economics. You can go back to the most conservative  economist, Milton Friedman, and he will say: Yes, if your product  causes harm, if it pollutes, that is what economists call a negative  externality. And the cost of that negative externality needs to be in  the price of the product or else it is a subsidy, and it should be  treated as a subsidy.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…exports-- nearly $200 million in sales--are being canceled, thanks to the global  tariffs.\n\nDonald Trump and his advisers claim there is nothing to worry about.  They say the economists and the pundits are overreacting, and  everything is going according to plan. Secretary Bessent is on cable  news so often, trying to calm investors, that it is a wonder…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…means ripping healthcare from the youngest, the  oldest, and the special needs communities, the most vulnerable members  of our community.\n\nNonpartisan health policy experts, economists, and medical groups,  including Healthcare Association of New York State, have already warned  that the impact of gutting this program will be felt by all, including  those…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692748/medicaid-is-a-lifeline"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Act would cost American voters who do not have passports billions  of dollars to secure them.\n\nAmericans are facing rising costs exacerbated by the recent Trump  tariffs. Economists are warning about a looming Trump recession.\n\nLet's face it. The SAVE Act would force U.S. citizens to spend  billions of dollars to register to vote. This includes rural…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Ms. JOHNSON of Texas. Mr. Speaker, I recognize that most Americans  are not economists, trade experts, or well versed in the intricacies of  tax policy. If you will, I want to take this opportunity to sort of  ``Schoolhouse Rock'' tariffs. Let's talk about…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689098/understanding-tariffs"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…First'' trade policy is now delivering real economic damage across the  country.\n\nI want to emphasize that this is not an isolated concern. My  constituents, as well as economists, academicians, and policy experts  across the country have echoed the same worries. The Administration's  recent approach to tariffs has created serious uncertainty for U.S.…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690134/opposing-the-chaotic-and-harmful-trade-policies-of-president-trump"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…contraction of the economy, it is chaos in the  stock market; it is declining consumer confidence; it is projections of  recession by Federal Reserve districts and major economists.\n\nAll of this is happening because Donald Trump has pursued a three- step strategy of his own: massive layoffs of employees, contrary to  congressionally passed appropriations…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…They have caused chaos in the markets and stripped millions from  Americans' retirement plans. Consumer confidence is plummeting,  reaching its lowest level in 12 years, and economists are increasingly  convinced that we are heading for a recession.\n\nThis budget will balloon our deficit, leading to higher interest  rates. It will slash critical investments…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689895/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…that  much. When the numbers really come out, we expect it to be higher, but  $37 trillion more to the debt. That is a much bigger burden on the  future.\n\nAnd what do the economists say about that bigger burden? They said it  will increase interest rates that families have to pay on their  mortgage and on their car loan since it will decrease the capital…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689508/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…to me that amidst skyrocketing electricity costs, the  highest they have been since the 1990s, we are talking about  overturning commonsense energy efficiency standards.\n\nEconomists predict these standards would save American taxpayers  billions of dollars. Mr. Speaker, you don't need to be an economist to  know that a better fridge or freezer will mean…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689261/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…Republicans are going to pass massive tax cuts, with  much of it going to those at the very top of the income scale, those  who don't need our help.\n\nThe nonpartisan professional economists at the Joint Committee on  Taxation and the Congressional Budget Office are going to provide a  score. In other words, they are going to tell us how much it is going  to…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "Mr. BEYER. Mr. Speaker, I include in the Record the following letter  from the National Taxpayers Union, signed by 469 economists, opposing  the Trump Administration's sweeping national tariffs as dangerous  economic policy, for consideration by the Supreme Court as it evaluates  the potential violations…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699566/opposing-the-trump-administrations-sweeping-national-tariffs"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the lobbyists who are making money trying to beat us  up for trying to actually fix it, I will warn you that the legislation  is almost done. We now have to work with the economists and others to  score it. We have been stunned though that it continues. Even last  Thursday, I think, there was another whole set of investigations or  indictments announced.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…through a concept.\n\nWe actually, right now, as a country, are remarkably blessed. The GDP  growth, the economic growth, is actually well beyond almost any of what  even my economists were predicting over the last year.\n\nWe are seeing some data right now--if you actually look at the  Atlanta Fed, GDPNow, nowcasts, some of these--we could hit a five- handle…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…wants to go near it, not even the people in  20-point or 30-point partisan districts. Will anyone here help us plan  for the future?\n\nThis future is coming fast. We have economists now say we have  functionally 3 years before we get in the interest cycle back and  forth. I will try to explain that one of these days.\n\nYou have to understand when we hit…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…through math reality. I am a Ways and Means guy.  I chair Oversight Subcommittee on Ways and Means, but I also chair the  Joint Economic Committee. I have a handful of Ph.D. economists that  work for the committee, and we try so hard to do intellectually honest  math.\n\nMr. Speaker, please don't tell anyone, but I am a dinosaur. I  actually believe in free…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…CBO report. In here, it makes it absolutely clear, and I  have been telling you for 1 year, but the scorekeepers have finally  caught up with my Joint Economic Committee economists. Remember, I  chair the Joint Economic Committee. I chair Oversight Subcommittee in  the Ways and Means Committee, so I am blessed. I have a freaky smart  staff.\n\nIn 2032,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…slightly off the rhythm I wanted to use.\n\nIn the 1970s and 1980s, the world competed for hydrocarbons. In the  last decade, we competed for rare earths. This decade, and the  economists say maybe over the next two decades, the world is going to  knife each other for smart people. In a world that basically is heading  toward flat population growth, maybe…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…sisters because  so much of what we are having to deal with in this reconciliation  budget--look, I hope the scorekeepers are wrong. I hope the Joint  Committee on Taxation economists are wrong. I hope the Ph.D.s over at  CBO are wrong. Because much of it is extending current tax policy--what  we get today--instead of what is in the law, where just individual…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…are able-bodied, able to work to  participate in society.\n\nIf anyone is a geek out there--it is probably 4 or 5 years old--the  University of Chicago, four of their Ph.D. economists wrote a brilliant  paper talking about: If you actually ask people to participate in  society, in the economy, to take a job, even if you give them welfare  or government…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…healthier, and the morality of that.\n\nWe had to do a number of things in design, so we introduced  legislation. This was the preliminary score from the Joint Economic  Committee economists: $1.76 trillion of savings over the 10 years.\n\nMr. Speaker, the fact of the matter is it is only about 10 percent of  the cost of the program over those 10 years, so you…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…contended with  40-year high inflation, after Democrats and President Biden dumped  trillions of dollars into a recovering post-COVID economy, which even  one of their chief economists told us would create massive inflation.  They ignored that guidance.\n\nDid they seek to address everyday Americans' concerns about the  direction of our economy? They did…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…borrow the cash out of those trust  funds, they are paid interest, so it is still an obligation.\n\nIt is one of my great frustrations when you hear some of the  government economists say, Well, publicly borrowed money is this. Yes,  but the internally borrowed money we still owe interest on, are we not  going to pay it back? It is borrowing.\n\nWhen I come…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…may have too high a fertility rate.\n\nThe reason I point that out is we are not having the really difficult  conversation here. What happens in a country this year when my  economists on the Joint Economic Committee are saying that we may have  zero population growth in the United States this year and the fact that  we have fewer 18-year-olds today than…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Friday, the Congressional Budget Office responded to a request I  made in my capacity as chairman of the Joint Economic Committee. I was  trying to get an answer to whether the economists' projections from the  Joint Economic Committee are correct. You have to understand that there  is actually a weird little battle going on here between the Senate and  those…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…have adopted. That is being optimistic about the  future.\n\nWe need a society to get this to work. We have a paper in our office  that was written by a bunch of freaky smart economists out of Cambridge  and Boston saying if you use a 6 percent generational discount rate-- and I said this last week, but I am trying to get it to burn into  people's psyches--for…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Economic Committee and our math is that we are  going to borrow 7.3 percent of the entire economy this fiscal year, the  fiscal year that we are in right now.\n\nWhen you hear the economists both on the Democratic side and the  Republican side running around saying: We should only be borrowing 3  percent, that would mean almost $1.8 trillion of cuts this fiscal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694954/energy-and-water-development-and-related-agencies-appropriations-act-2026"}]