[{"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…It will make it even harder for folks who are already struggling to  make ends meet because of the affordability crisis instigated by this  administration's tariffs and economic policies.\n\nIt will mean less domestic manufacturing and innovation, all while  diminishing America's competitive leadership globally, and it will make  it harder for impacted…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…billions of dollars in  deals and investments with American companies and foreign entities,  Trump has asked Americans to just withstand the ``pain.'' This is from  his economic policies.\n\nWhile Republicans work hard to make room for $7 trillion in tax cuts  for American oligarchs like Elon Musk and Jeff Bezos, Republicans are  cutting $880 billion in…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…begins  today in some jurisdictions.\n\nIt is pretty clear which way the political winds are blowing. The  American people are rightly frustrated by Donald Trump's failed  economic policies that are raising costs for working families, and the  American people are increasingly outraged by the cruel, violent mass  deportation campaign unfolding in communities…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…office promising to lower costs on day one--yet  another lie. It is not happening. More than 250 days later, Americans  are facing the fallout from this regime's reckless economic policies,  including the disastrous tariffs that are decimating small businesses.\n\nSo instead of actually doing anything to lower costs for our hard- working families, the Republicans…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696175/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…that is actually designed to permanently sustain a positive  trajectory for farmers in this country and for everyday Americans.\n\nIn fact, the chaotic uncertainty of the economic policies that have  been unleashed by the Trump administration and complete Republican rule  in Washington, D.C., will have devastating consequences for the  American people and…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…people trillions of dollars. We know that according to the  Joint Economic Committee, the average American family now pays an extra  $1,625 in basic expenses thanks to the economic policies of this  administration.\n\nThe question is why are Republicans hiding from an up-or-down vote on  these tariff policies?\n\nIn the Senate, multiple votes have been held…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699903/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…turkey, mashed potatoes, casserole, cranberry sauce, and more. Except,  this year, the Thanksgiving feast cost more than last year--because of  what? President Trump's economic policies are driving up the prices of  groceries. The President claims the opposite, but that is not a fact.\n\nIn a social media quote, President Trump said, ``Prices for a  Thanksgiving…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…come on bended knee to him to get the relief they need.  And that loyalty pledge could be anything--the purchase of some Trump  crypto coin, public support for Trump's economic policies, donations to  his political campaign. But having watched what Trump has done one by  one to universities and law firms, why would we assume the tariffs  aren't just…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Ted Lieu", "party": "Democrat", "sentence": "Mr. LIEU. Mr. Speaker, under the economic policies of Donald Trump  and Republicans, America is now in decline. For the first time in 3  years, we have negative GDP growth. That means our economy actually  shrank this…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692991/america-in-decline-under-republican-economic-policies"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…so-called big, beautiful bill  terminated the clean hydrogen production tax credit, causing BP to put  the project on indefinite pause for reasons related to economic  uncertainty.\n\nThese policies are conscious decisions to create confusion,  hesitation, and uncertainty, not just in hydrogen production, but also  the challenges for our auto industry to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695607/devastating-harm-caused-by-trump-administration"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…beef from South America.\n\nBombing Venezuela, threatening to invade NATO allies.\n\nMeanwhile, prices are not down. Prices are up because of the stupid  tariffs and lousy economic policies.\n\nThey promised to release all of the Epstein files. They still haven't  done that. In fact, they are covering up for the President of the  United States.\n\nPeople are…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…American small  businesses and manufacturers, solve the Republican healthcare crisis,  or any legislation that allows Americans to afford to live through the  catastrophic economic policies of Trump and the Republicans.\n\nMr. Speaker, instead of doing the work that our constituents  desperately want us to do, Republicans in the House have chosen once  again…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…true for  Senator Wyden and Senator Klobuchar.\n\nThank you so much for your leadership.\n\nAnd I rise to join them in highlighting the devastating impact  President Trump's economic policies are having on small businesses  across our country. Small business owners are struggling in President  Trump's economy.\n\nLet me just say this: 97 percent of all the companies…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…housing,  and to clean up the Superfund site on the Willamette River?\n\nMr. Speaker, if the President actually wants to help Oregonians, then  he should focus on his failing economic policies that are hurting  Americans and raising our costs.\n\nWe got us.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695015/national-guard-in-portland"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…using regulations as a weapon against affordability.\n\nPresident Trump and congressional Republicans are cleaning up the  mess left behind, undoing the damage of the Biden economic policies,  restoring confidence, and rebuilding an economy that works for people  who actually earn a paycheck.\n\nThat brings us to the rule before us today. The three bills under…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…American  families to keep more of their money and to incentivize investment,  growth, job creation, and wage increases. We have been sputtering along  because of the failed economic policies of my Democratic colleagues in  the Biden-Harris administration and their unbridled, reckless spending.\n\nThere is your comparison. One gives you more government with…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…going up. Many of  them have come down. Prices are still going up; they are just not going  up as quickly as they were going up under President Biden, thanks to  the new economic policies adopted by the Trump administration and the  Republican Congress.\n\nOne of the things, though, that hasn't come down in price is housing.  I don't need to tell the American…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…businesses, harms consumers, and drives up  costs, even as many Americans continue to struggle under the long-term  effects of the Biden administration's inflationary economic policies.\n\nThat ends now. I am proud to join my House Republican colleagues in  standing up for America's consumers and small business owners across  the country. With this bill,…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689131/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…will mean stronger borders, safer  Texas communities, and definitely greater peace of mind for our  families.\n\nAmerica's future is shining brighter than ever. With the economic  policies of the One Big Beautiful Bill Act to lower costs, increase  wages, and expand job opportunities, I know America's industrial engine  will be unleashed to deliver a breadth…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694791/promises-made-promises-kept"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…Trump and a Republican-led Congress to  reverse course on the failed policies and the string of self-inflicted  disasters of the past 4 years.\n\nUnbridled spending and bad economic policies have weakened our  economy, created a cost-of-living disaster for working families, and  pushed our Nation ever closer to the precipice of the sovereign debt  crisis.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…available to young families and those just starting out who have  scraped and saved to afford a reasonable downpayment. However, what we  have seen after years of bad economic policies in the Biden  administration, those inflationary prices have actually made it so that  the first-time home buyer has risen to the age of 40.\n\nFor millions of Americans…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699814/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…last year as it has over  the past decade. That is what we have been able to deliver. These are  the facts and figures.\n\nLet me put it in personal terms. Because of the economic policies  enacted in the past year, workers in America now have $1,400 more in  each and every one of their pockets than they did before President  Trump took office. From the…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700171/state-of-the-union-address"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…putting  thousands of dollars back in the pockets of families still recovering  from the crushing inflation and cost-of-living crisis caused by the  Democrats' failed economic policies and unbridled spending.\n\nThere is the complete distortion that Medicaid is being cut when, in  fact, it is being strengthened for our most vulnerable citizens by  eliminating…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693192/one-big-beautiful-bill-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "…finger. It is  clear that the accomplishment was because of the clear leadership of  President Donald J. Trump.\n\nIn Tennessee specifically, President Trump's tariffs and economic  policies have brought about millions of dollars in new investment and  countless new jobs. Cra-Z-Art is moving manufacturing equipment from  Asia back to the United States to…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690428/the-first-100-days"}]