[{"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…difference.\n\nUnfortunately, President Trump has eliminated countless assistance  programs that have kept children alive. His administration hasn't  placed new orders for RUTF at Edesia Nutrition in Rhode Island, causing  production to almost stop.\n\nWe already knew that the promises of waivers for emergency food  assistance were lies, and now we have further…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690808/funding-food-aid-for-malnutrition"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…even though this funding has not been  cut and it is still available, the Trump administration still continues  to hold up the money instead of getting it to companies like Edesia in  North Kingstown, Rhode Island, who manufacture this food aid to ship it  around the world. We continue to have a now 5-month pause in the  delivery of emergency food aid…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692483/funding-for-edesias-plumpynut"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…peanut-based paste that treats malnutrition,  doesn't need to be refrigerated, and can be shipped around the world.  You don't need to add water, and it saves the lives of children.\n\nEdesia Nutrition in North Kingstown, Rhode Island, is one of the  factories that produces Plumpy'Nut. From that factory alone, over the  last decade, 25 million children have been…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691610/global-report-on-food-crisis"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…if we  are able to feed them conventional food, they cannot digest it. It  takes specialized nutrition to bring them back to health, including the  nutrition manufactured by Edesia Nutrition in North Kingstown, Rhode  Island, in my district, where thousands of boxes of emergency food aid  have been sitting in a warehouse since Donald Trump and Elon Musk…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695582/release-food-aid-sitting-for-9-months"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…rise today for the 31st time to call on  the Trump administration to restore lifesaving food aid for  malnourished children.\n\nOver the weekend, I had a chance to visit the Edesia Nutrition  factory in North Kingstown, Rhode Island, one of two factories in the  United States that manufactures this ready-to-use therapeutic food.  This is used to treat…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693908/restore-food-aid-funding"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise for the 43rd time today to call on  the Trump administration to restore lifesaving food aid for starving  children around the world.\n\nEdesia Nutrition, an organization in my district, in North Kingstown,  Rhode Island, manufactures Plumpy'Nut, a nutritional supplement that is  needed to get starving children back…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695817/lifesaving-food-aid"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise for the 42nd time to call on the  Trump administration to restore lifesaving food aid for starving  children. Edesia Nutrition, an organization in my district,  manufactures Plumpy'Nut, a nutritional supplement that helps starving  children get back to health.\n\nTheir production has been largely…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695735/edesia-nutrition"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…they need this: Plumpy'Nut. It is a packet of  fortified paste. They take one of these per day. After a month, they  are back up to normal body weight and healthy once again.\n\nEdesia Nutrition in North Kingstown is one of two places in the  country that produces Plumpy'Nut. All the ingredients, the peanuts,  soybeans, sugar, and dairy, come from American…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692267/calling-on-trump-administration-to-restore-food-aid"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Since  then, despite saying all the right things, that the funding is going to  be restored, that the shipments are going to start again, they continue  to drag their feet.\n\nEdesia Nutrition, in my district, manufactures some of that food aid  designed to help starving children get back to health. After 8 months,  thousands of boxes are still sitting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694817/restoring-food-aid"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…They  haven't done it.\n\nA month ago, they said that they were going to issue an RFP now and  get this aid moving again. The RFP was issued. Nonprofit organizations,  including Edesia Nutrition, have responded to it. The administration  has been sitting on it for a month.\n\nWhat are they waiting for? Every day that they fail to act is a day  that children…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693466/lives-lost-due-to-us-ending-food-aid"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…food is a nutrient-rich  peanut paste that delivers the fat, protein, and vitamins that starving  children need to survive. It can save a child's life in just 8 weeks.\n\nThe Edesia factory in Rhode Island has helped save 25 million lives  with this food, but that work is now in jeopardy because the  administration hasn't followed through on its own promises…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690758/biology-of-hunger"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…the fat, sugar, and protein  that children with malnutrition need to survive and grow. It requires  no refrigeration, and kids show improvement and are saved within weeks.\n\nEdesia Nutrition, based in North Kingstown, Rhode Island, is one of  the two organizations in the United States that manufactures  Plumpy'Nut. From their factory in North Kingstown,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690379/edesia-nutrition-saves-malnourished-children"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…dismantled USAID. As a result, children are starving  around the world.\n\nHere in the United States, the production lines that create this  product are virtually shut down. Edesia Nutrition in my district in  Rhode Island and Mana Nutrition in Georgia get all of their ingredients  from U.S. farmers. This is all produced in the United States. When it…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693021/trump-administration-needs-to-honor-its-word-on-food-aid"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…are walking  for days in search of food, and children collapsing into their arms  from hunger.\n\nFor years, the United States has stepped up in the face of these  tragedies. Edesia, an organization in my district in Rhode Island,  produces ready-made, ready-to-use food therapeutics called Plumpy'Nut  that has saved millions of lives in Sudan and more…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690624/support-for-edesia"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Food Aid\n\nMr. MAGAZINER. Mr. Speaker, I rise for the 41st time to call on the  Trump administration to restore lifesaving food aid for children  starving around the world. Edesia Nutrition in my district is about to  send 15,000 boxes of this lifesaving food aid to children who are  starving in Gaza.\n\nNow, in the past, this would have been done with…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695636/government-funding-and-healthcare"}]