[{"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…resources away from classrooms.  Families, especially those without financial or legal resources, will  pay the highest price.\n\nThe measure of our commitment to public education is how the students  who need us the most are treated, and today, those students are  watching.\n\nI urge my colleagues to reject the efforts to weaken IDEA or  dismantle the Department…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698937/protecting-education-for-children-with-disabilities"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…they have extra  resources to fill these gaps.\n\nAlso, the majority of Federal funding through the Department of  Education is to open doors of opportunity to higher education for  students who choose to attend college but can't afford the cost. This  includes Pell grants, Federal work-study, and low-interest loans to  those who qualify.\n\nI would not…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689037/majority-of-americans-support-department-of-education"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "Ms. BARRAGAN. Mr. Speaker, the Trump administration continues to take  away access to STEM education from students across the country,  including hundreds of middle school students in my district.\n\nFor years, the Long Beach Public Library's Youth SEED program  delivered hundreds…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699137/denouncing-cancellation-of-long-beach-public-library-seed-program"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…than 10,000 Californians who have made it a point  to reach out to me by phone calls, by letters, by emails to say one  thing loud and clear: Stand up for public education.\n\nThere are students throughout California, teachers throughout  California, parents throughout California, and I am sure beyond in all  of our States who are afraid that Donald Trump…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688250/nomination-of-linda-mcmahon"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…providing precision components for multiple markets.\n\nDuring his tenure at RIMA, he championed workforce development  through the expansion of career and technical education for our  students and helped countless small businesses transition to the  future.\n\nAt the height of COVID, he helped the Rhode Island Department of  Business Regulation create the…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697474/recognizing-the-contributions-of-rhode-island-manufacturers-association-executive-director-david-chenevert"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…since the IDEA became Federal law, students, parents,  educators, administrators, and support staff have worked tirelessly to  deliver the promise of a world-class education to millions of students  with disabilities. But far too many students with disabilities are  still waiting for their shot at a meaningful education.\n\nThe Federal Government committed…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697522/50th-anniversary-of-individuals-with-disabilities-education-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Department of Education.\n\nEvery school district in the country has families that have benefited  from the IDEA, and its 50 years of enactment have improved public  education for all students. That is why the Trump administration's  actions to gut staffing at the Department of Education and move the  Office of Special Education programs to the Department…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698936/protecting-education-for-children-with-disabilities"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…the state's  investment in higher education and expand opportunities for students  from low-income backgrounds. Throughout his career, he has prioritized  access to education for students of all ages and backgrounds, fought  for college affordability, and invested in workforce development  efforts to meet the needs of our changing economy. Joe is a true…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689302/recognizing-chancellor-joe-garcia"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…integrated academic support they need to learn English and meet State  standards.\n\nTitle IV, part A grants are designed to give students access to a  well-rounded education. That is what students need: to improve school  safety and to create better conditions for student learning and  engagement. These grants fund critical music and arts programs and  integrate…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693986/withheld-education-funds"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…understanding of how  to use this crucial position to strengthen educational opportunities  and outcomes for every student in this country. We need a Secretary of  Education who will put students first, not billionaires; who will stand  up for our kids--every single one of them--even if it means standing up  to Donald Trump and Elon Musk.\n\nOn each of these…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688363/nomination-of-linda-mcmahon"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…students with disabilities, the IDEA, or Individuals  with Disabilities Education Act, is a landmark civil rights law that  guarantees a free and inclusive public education for all students.\n\nHowever, under the Trump administration, IDEA is under attack, with  the administration announcing at the height of the government shutdown  in October that it…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698935/protecting-education-for-children-with-disabilities"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…of American education'' while the current Administration is actively  discussing how to dismantle the main federal agency responsible for  ensuring safe, quality education for all students. According to polls,  the majority of voters oppose the abolition of the Department of  Education. I also know that I, and every Democrat, will do what we can  to…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…for ongoing Federal  education research, the Trump administration is making it difficult for  the Department to accomplish its goals of ensuring equal access to  education for all students.\n\nThe Department of Education does not influence public school  curriculum, instruction, or instructional materials. Those decisions  are already made at the local…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689644/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…congressional aid.\n\nI wanted to ask Representative Hayes: We have had some conversations,  you and I, where we hear people say: Well, we have to close down the  Department of Education because students aren't doing as well now ever  since the Department of Education existed.\n\nIf you will engage in a brief colloquy with me, and let's talk about  why that is an erroneous…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698126/dismantling-the-department-of-education"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…servant, working in education  for over 27 years before joining CDHE. Since her appointment to this  role in 2019, Dr. Paccione has worked to expand access to higher  education for students of all backgrounds. Dr. Paccione has helped  implement a variety of programs to increase access and affordability  for low-income students, including the FosterED and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698659/recognizing-dr-angela-angie-paccione"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…Confucius Institute or Thousand Talents Program or maintain  relationships with Chinese entities of concern. H.R. 881 also ensures  that universities prioritize the education of their students over any  of their partnerships with these institutions.\n\nThis legislation passed the House last year with bipartisan support,  and this year H.R. 881 passed the…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690828/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…students, but, as a devoted wife and exceptional mother, she  also left behind her husband, Gabe, and their two children: Aidan and  Sydney.\n\nVeena's passion for STEM education and her students was unmistakable  and contagious. Her kindness and the time she gave to everyone who  stepped into our office enriched our team. She was the dependable,  welcoming…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697562/recognizing-albert-einstein-distinguished-educator-fellow-veena-black"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…from Whittier.\n\nIn 1982, Kathy began her service on the Mono County Board of  Education to fulfill her mission of providing what she described as a  ``good solid education'' to the students of her community.\n\nDuring her tenure as a board member, Kathy continuously advocated for  the support and services of the Mono County Office of Education and  Mono…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688154/protect-medicaid-benefits-for-american-citizens"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…our communities. At the  Education and Workforce Committee last week, we just heard about the  exciting new opportunities artificial intelligence presents to advance  education for students with special needs. However, many of those  opportunities will not be realized if Congress does not live up to its  commitment.\n\nThe IDEA Full Funding Act ensures that…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689683/supporting-our-nations-children-with-disabilities"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…educating the  students in her community.\n\nBeginning her career as a fifth grade teacher in 2000, Dr. Sandfort  later earned her doctorate with a focus on inclusive education for  students with autism. Her research has shaped teaching practices both  in her classroom and across the district. Dr. Sandfort has spent the  last 10 years teaching at Empire…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "John Carter", "party": "Republican", "sentence": "…and  leverages his expertise as an Army Acquisitions Officer to deliver  critical capabilities to our warfighters. He is also a champion for  expanding vocational education for all students, ensuring they are job-  or college-ready upon graduation.\n\nCOL Wilson continues to lead with strength, integrity, and dedication  for the betterment of his community.…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689389/saluting-the-service-of-colonel-terry-wilson"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…strings attached, and that  can influence student behavior or gain access to research. The  DETERRENT Act is a crucial step toward transparency and protecting  American education and students from malicious foreign influence. The  current system has allowed our Nation's students to become targets for  our adversaries, and that is unacceptable.\n\nWe must pass…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}]