[{"senator": "Sarah McBride", "party": "Democrat", "sentence": "…Education Teacher Award.\n\nIn her classroom, Ms. Parks is teaching young minds more than just  facts and dates, but the strength and power of our democracy. This  honor recognizes educators who spark curiosity about the Constitution,  government, and civic life.\n\nAt Milford High School, Ms. Parks is shaping the continued strength  of our democracy by preparing…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696940/recognizing-shae-parks"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, to the more than 3.8 million educators  across the country, I wish you a happy National Teacher Appreciation  Day.\n\nI know our teachers work tirelessly to provide our students with an  education that opens the…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690753/national-teacher-appreciation-day"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…responsibility, and a constitutional duty to protect students  with disabilities and ensure they receive the education they deserve.\n\nI will continue to stand with students, families, educators, and  advocates, and I call on this body to do the same.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698937/protecting-education-for-children-with-disabilities"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Education right before our very eyes.\n\nThey have laid off thousands of employees, shuttered offices, carved  up programs and transferred them to other agencies, declassified  educators from getting student loans, threatened schools and  universities, and given their friends contracts to not only rewrite  educational curricula but to even rewrite American…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697300/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…to recognize the tragic  shooting at Evergreen High School in Evergreen, Colorado, that occurred  on September 10, 2025.\n\nThis senseless act of violence has left students, educators, and the  greater Evergreen community in shock and grief. Two victims were  hospitalized, and countless others are coping with the trauma of that  day.\n\nThe courage of first…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695839/recognizing-the-evergreen-high-school-shooting"}, {"senator": "Summer Lee", "party": "Democrat", "sentence": "…Scott would make sure families actually have access to  childcare slots, that no family spends more than 7 percent of their  income on childcare, and that all early childhood educators make a  livable wage.\n\nIf Republicans actually care about children and families, then I  encourage them to pass the Child Care for Working Families Act. I hope  my colleagues…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699007/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Mr. VINDMAN. Mr. Speaker, I rise to congratulate Edie Brooks on being  named Teacher of the Year by the Virginia Business Educators  Association.\n\nEdie is a business and IT career education teacher at Post Oak Middle  School. She was honored for her innovative teaching strategies,  unwavering commitment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695517/constituent-of-the-week-edie-brooks"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…library to every child in America,  and that would occur by extending out the way in which we view this  program so that Wi-Fi hotspots can be provided to students and to  educators so that they can use them even when they are not in the  school, even when they are not in the library.\n\nIf we pass this resolution--the resolution which the Republicans…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…across the country are scrambling to make decisions,  but they have unclear information and severely constrained budgets.  Many districts have already been forced to lay off educators and staff  who will not be paid without the Federal funding.\n\nFor many students across the country, the new school year starts in a  few weeks, and schools are now in an…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693986/withheld-education-funds"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…providing mentorship and developing  participants' literacy skills and interest in public service. Through  programs such as the Little Library Program, they have partnered with  educators and libraries to provide resources for over 500 children to  develop strong literacy skills, It's About the Kids continues to be an  excellent asset to the constituents of…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692965/recognizing-the-work-of-the-its-about-the-kids-mentor-program"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Tennessee did not provide a good education to Black children. Like  his father and his grandfather, my dad became an educator himself,  ultimately teaching the next generation of educators at Virginia State  University.\n\nIn the 1950s, my mother had to move away from her hometown because  the State of Mississippi did not provide a good education for Black  children.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…have risen.\n\nWe celebrate today the trailblazers who have risen from this legacy:  generals and admirals in the U.S. military, award-winning scientists,  titans of business, educators, doctors, and artists. Our community has  nurtured leaders in all walks of life, turning adversity into  opportunity in just five short decades.\n\nMany of these people are…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690347/recognizing-black-april"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…People, Payomkawichum/ the Luiseno Indians; and Yuhaaviatam, clan of Maara'yam/the Serrano.\n\nRiverside is also home to the Sherman Indian High School. I thank all  of the educators and staff who work tirelessly to build an environment  that provides a quality education to hundreds of students and helps  preserve the rich culture of Native peoples from…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696915/recognizing-native-american-heritage-month"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…compassion, and dedication for his  community, all while supporting strong public schools.\n\nFor his outstanding devotion, he earned the respect and esteem of  many students and educators alike. While his character and decisive  leadership will be sorely missed, I am confident that his numerous  contributions will serve as an inspiration for everyone in the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690330/recognizing-superintendent-jeff-wendorf"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Tennessee didn't provide a good education to Black  children. Like his father and grandfather, my dad became an educator  himself, ultimately teaching the next generation of educators at  Virginia State University, which I now represent in Congress.\n\nIn the 1950s, my mother moved away from her hometown because the  State of Mississippi did not provide…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698124/dismantling-the-department-of-education"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…the opportunity  to thrive.\n\nEleven years ago, I established the Congressional Education Awards  program with the aim of providing special acknowledgment to  administrators, educators, and support staff within Florida's 16th  Congressional District for their outstanding achievements in both  teaching and inspiring students.\n\nThe following school employees…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690566/congressional-education-award"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…agricultural education.  Today we share the importance and effectiveness of ag education in the  United States and encourage students to consider careers as  agricultural educators.\n\nMr. Speaker, our ag educators are responsible for cultivating and  inspiring the next generation of agricultural leaders. They prepare  students to be problem solvers,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695790/national-teach-ag-day"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…to the Cocalico School District  have left a lasting impact on both the school district and  Pennsylvania's 11th Congressional District, which has no shortage of  selfless educators.\n\nI thank Dr. Haldeman for her service and wish her all the best in her  new career.", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692885/congratulating-dr-beth-haldeman-on-her-retirement"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…exceptional leadership and lifelong dedication  to the advancement of band music. Beyond his professional achievements,  his greatest legacy lies in the generations of students, educators and  performers he has mentored.\n\nDr. Bodiford's career stands as a testament to the power of vision,  passion and leadership in shaping both institutions and lives. His…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696619/recognizing-dr-kenneth-g-ken-bodiford-for-his-extraordinary-service-to-jacksonville-state-university-and-the-field-of-music-education"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Through education and hands-on experiences, FFA  continues to make a lasting impact on the agriculture industry.\n\nNational FFA Week is also an opportunity to recognize the educators,  advisers, and mentors who guide these young leaders, as well as the  families and communities that support them. Their investment in  agricultural education ensures that…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687891/national-future-farmers-of-america-week"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…underperforming students from low-income backgrounds. These initiatives  benefited over 400 students and helped earn him recognition as runner- up for Association of Texas Professional Educators (ATPE) Elementary  Principal of the Year in 2002. He also helped the district achieve its  first-ever ``Exemplary'' rating and introduced several science-focused  initiatives,…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696269/recognizing-lieutenant-colonel-william-bill-patterson-matthews-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "John Thune", "party": "Republican", "sentence": "…businesses mean a strong America. I will always be  grateful for the lessons I learned getting my start working in small  businesses. During the summers, my parents, who were educators, ran a  motel in my hometown of Murdo, and as is common in a lot of small  businesses, the whole family helped out.\n\nLater on, my first job was as a busboy at the Star Family…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690626/national-small-business-week"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…only the Commonwealth of Pennsylvania but also our Nation.\n\nMr. Speaker, as part of Public Schools Week, I also want to  acknowledge and recognize the tireless efforts of educators and staff  who work each day to inspire and to support our students.\n\nEvery child deserves access to a high-quality education which helps  foster growth and encourages students…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688125/recognizing-public-schools-week"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Iowa started the ``Teacher of the  Year'' award, honoring an exceptional Iowa teacher each year. There is  very tough competition each year among Iowa's many outstanding  educators to find the one who best represents student learning through  evidence-based instruction, empowering students with multiple pathways  to postsecondary success; the teacher…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697231/2026-iowa-teacher-of-the-year"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Madam Speaker, I rise today in honor of  National Teacher Appreciation Week.\n\nThis week, we thank extraordinary educators who shape the next  generation. Across America, communities are celebrating teachers not  just as instructors but as mentors, leaders, and role models.\n\nEvery one of us can…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690925/recognizing-ahslie-crosson-during-national-teacher-appreciation-week"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…Additionally, the district proudly reports a high school  graduation rate of 93 percent, a significant achievement that speaks  volumes about the commitment of the students, educators, and families  of Lake County.\n\nI am pleased to join our community in congratulating the teachers,  administrators, support staff, and especially the students of Lake  County…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694185/recognizing-lake-county-schools-on-earning-an-a-rating-from-the-florida-department-of-education"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…despicable crimes because the CCP  doesn't want them to. This one-sided approach extends beyond K-12  classrooms.\n\nWhile the CCP operates programs in U.S. schools, American educators  are not allowed to expose Chinese students to American culture. The  goal is clear. The Chinese Communist Party wants to control information  and shape young minds.\n\nOver…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697438/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…term ``STEM'' means the academic and       professional disciplines of science, technology, engineering,       and mathematics, including computer science.\n\n(c) Preparing Educators To Engage Students in Mathematical       and Statistical Modeling.--The Director shall make awards on       a merit-reviewed, competitive basis to institutions of higher…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "Mr. OWENS. One of the Merit Caucus' core missions is to spotlight  exceptional educators, and Utah is blessed with so many. My team  recently visited Bluffdale Elementary, a dual language immersion school  where students start learning Portuguese in the first…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691516/recognizing-bluffdale-elementary-school"}, {"senator": "Mike Kelly, Jr.", "party": "Republican", "sentence": "…settlement has grown  into a thriving region rich in culture, industry, and opportunity. Over  the centuries, this county has been home to hardworking farmers,  entrepreneurs, educators, and service members--all of whom have played  a role in shaping its legacy.\n\nWe remember the early settlers who shaped life in this land, facing  hardships with unwavering…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689795/recognizing-mercer-county-pennsylvanias-225th-anniversary"}]