[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Amelia, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Amelia Ferkuniak", "date": "2025-04-07"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Rachelle, develop crucial skills and  a work ethic that will guide them for the rest of their lives.", "title": "Recognizing Rachelle Martinez Marentes", "date": "2025-04-02"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Lilith, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Lilith Roberts-Ruiz", "date": "2025-05-13"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Darci, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Darci Lind Gartman", "date": "2025-05-14"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Fernanda, develop crucial skills and  a work ethic that will guide them for the rest of their lives.", "title": "Recognizing Fernanda Orozco Saenz", "date": "2025-05-13"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Luke, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Luke Setelin", "date": "2025-04-07"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Omar, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Omar Lautenbach", "date": "2025-04-02"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Devonte, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Devonte Bonggas-Ellenburg", "date": "2025-05-14"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Julissa, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Julissa Martinez", "date": "2025-06-03"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Kloey, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Kloey Kehl", "date": "2025-06-04"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Miya, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Miya Atencio", "date": "2025-04-28"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Diego, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Diego Moreno", "date": "2025-04-29"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Abdullahi, develop crucial skills and  a work ethic that will guide them for the rest of their lives.", "title": "Recognizing Abdullahi Ali", "date": "2025-04-28"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Jackson, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Jackson Minor", "date": "2025-04-10"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "opening statement at education and workforce full committee hearing               entitled, ``the state of american education''\n\nI would first like to start with the elephant in the room.", "title": "Education is of Great Importance to Congressional Black Caucus, Congress, and Constituents", "date": "2025-04-07"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "Speaker, I rise today in support of the Pregnant Students' Rights  Act, legislation that affirms a simple but powerful principle:  Expecting mothers should be encouraged to pursue their education like  any other student.", "title": "Pregnant Students' Rights Act", "date": "2026-01-22"}]