[{"senator": "Laura Friedman", "party": "Democrat", "sentence": "…and on many other programs  that help our young people afford a higher education. That will make it  harder for the next generation to afford college. It will also have the  effect of stifling innovation, weakening Americans' ability to lead by  staying on the cutting edge of technology.\n\nNow, in California we very much value our public education system.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688232/democratic-proposals"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Petroleum Reserve  in Alaska, and millions of offshore acres, even when coastal residents  are screaming they don't want these oil rigs off their coast.\n\nSo it isn't producing the effect that some of my colleagues hoped. So  this is not a CRA we should vote for. We should oppose the CRA and keep  the land management that is in place.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697560/hj-res-131"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…acknowledges that there is a lot to fix in healthcare.\n\nMr. Speaker, open enrollment ends on January 15. The new premiums,  without the enhanced premium tax credits, take effect for 22 million  Americans on January 1. Do you know who can't wait 6 months for a  healthcare fix? The 5 million Americans who are estimated to find they  can no longer afford…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…because of the President's tariffs. These tariffs are  attacks on the American people, and they are expected to cost families  more than $2,000 each year when they take full effect.\n\nMeanwhile, prices on everything from utilities to food to energy,  even prices for Thanksgiving dinner next week, are going up.\n\nYou would think that House Republicans would…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…worried for their health, for the health of  their families, and for the health of their parents. They get what will  happen to their local rural hospital if these go into effect.\n\nI will tell you about Kathleen, who graciously shared a story about  her own mother. Kathleen's mother lived to be 92 years old. She was a  widow for 42 of those years and…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…today.\n\nEarlier this year, the Nevada state legislature passed a resolution  urging the federal government to maintain the moratorium on nuclear  weapons testing that went into effect in 1992, citing risks of  environmental damage and health hazards from previous tests at the  Nevada National Security Site.\n\nYou may remember, in 2020 the first Trump Administration…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696948/opposition-to-explosive-nuclear-testing"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…Republicans blocked my amendment to this  bill that would actually help working families across the country. My  amendment would require the official name change to not take effect  until the Department of the Interior can prove that this bill would  lower food prices, including the price of eggs, spur economic growth,  create jobs, and lower  the unemployment…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690944/gulf-of-america-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…graduate school  threatens the very foundation of patient care.''\n\nWell said.\n\nMadam Speaker, ANA is doing more. They have organized a petition  drive because this rule goes into effect next July. As of the middle of  last week, they had 180,000 signatures, and that will grow.\n\nMadam Speaker, it definitely will grow in the coming days. Every  Member of this…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697261/nursing-excluded-as-professional-degree-by-department-of-education"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…retirement benefits, making voluntary  retirement untenable for every Federal law enforcement officer who is  at or near retirement.\n\nCutting the supplement would have an immediate effect on the  retention of overburdened, increasingly demoralized officers across the  Federal Government, creating an overwhelming incentive for tens of  thousands of eligible officers…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…percent of small businesses  reported increased costs due to the administration's policies, both  tariffs and otherwise. I don't think they realized or thought through  the effect of these policies on Main Street America.\n\nOver 45 percent of Americans are employed by small business. They are  the backbone of Main Street and our economy.\n\nThe administration…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691262/rising-costs-for-small-businesses"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…(1) any claim or action that, as of the date of enactment       of this Act, would not have been barred under section 1595(c)       of title 18, United States Code, as in effect on the day       before the date of enactment of this Act; and\n\n(2) any claim or action arising on or after the date of       enactment of this Act.\n\n(b) 1-year Look Back Period.--…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699879/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…have been in place for many years, if not decades, that are       tested, proven, and effective components of our public safety       infrastructure and ecosystem. The effect of these       Congressional repeals would put our legal and Court system       into chaos and directly undermine successful tools that focus       on serious accountability…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…don't defund the Securities and Exchange Commission that oversees  the stock and bond markets.\n\nThe SEC has a budget of $2 billion. It secured over $3.2 billion in  fines, in effect, to those on Wall Street that did the wrong thing. It  more than paid for itself and--no, that was $3.2 billion that went back  to investors, $8.2 billion in fines. The Federal…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…illegal impounding of congressionally authorized and  appropriated research funding, and the future of our STEM student  pipeline jeopardized. Frankly, it has created a chilling effect across  our scientific research enterprise.\n\nFor the science enthusiasts watching at home, allow me to clarify  that, yes, we support our national scientific research enterprise,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691394/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…are going up, housing is going  up; we are about to have these awful tariffs where the price of  vehicles will go up, the price of transportation will go up. So the  ripple effect of an impact on children, just by a fraction of the cuts  that they are proposing--not to mention the grandeur of the $880  billion--would have a devastating impact on millions…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "John Thune", "party": "Republican", "sentence": "…part of the One  Big Beautiful Bill, South Dakotans won't see a tax hike next year.  Instead, they will start seeing tax relief in the new year when the new  tax law takes effect. They will be able to take advantage of a larger  child tax credit, a bigger standard deduction, and a bonus deduction  for seniors this tax season. They will see larger tax…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698212/senate-accomplishments"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…proceedings.\n\n``(2) Limitation.--Nothing in this subsection requires a       court to amend or remove any fine or restitution order in a       criminal or civil proceeding.\n\n``(3) Effect.--If a conviction is vacated under an order       entered under paragraph (1), the conviction shall not be       regarded as a conviction under Federal law and the movant for…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…to combat the Biden rule which was issued  in response to not one but two executive orders on climate change. The  Biden Labor Department expressly stated that the intended effect of the  rule is to loosen restrictions on fiduciaries and encourage them to  consider ESG factors in their decisionmaking; to encourage them, not  simply allow it, but to encourage…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…Army of the Republic. Because organizations chartered       under title 36 of the U.S. Code are not federal agencies, CBO       estimates that enacting this bill would have no effect on the       federal budget.\n\nThe CBO staff contact for this estimate is Matthew       Pickford. The estimate was reviewed by H. Samuel Papenfuss,       Deputy Director of…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699502/moving-national-womans-relief-corps-incorporation-and-domicile-to-illinois-principal-office-to-murphysboro-illinois"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…means the depredation order for double-      crested cormorants at aquaculture facilities contained in       section 21.47 of title 50, Code of Federal Regulations (as in       effect on January 1, 2016).\n\n(3) Pond manager.--The term ``pond manager'' means a person       that is licensed by a State regulatory agency to manage a       private pond.\n\n(4) Secretary.--The…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697641/cormorant-relief-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…any visa or other entry documentation       regardless of when the visa or other entry documentation is       or was issued.\n\n(ii) A revocation under clause (i) shall take effect       immediately and automatically cancel any other valid visa or       entry documentation that is in the foreign person's       possession.\n\n(3) Exception.--Sanctions under…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…taxes, but we factually know that the share of taxes paid  by the top 1 percent of earners actually reached new heights, Mr.  Speaker, after President Trump's tax cuts went into effect. The  outcomes got more progressive.\n\nMr. Speaker, more recently, it has been publicly reported that ads  placed by Democratic-aligned groups had to be taken down because of…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…capabilities are being developed that may increase the       subsurface development possible from the same size drill site       to as much as 150-plus square miles. The net effect is an       everdecreasing impact on surface resources.\n\nThe discovery and development of new oil and gas deposits       will benefit Alaska and local communities. State and…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…California, we have just  learned that CARB, the California Air Resources Board, is plowing ahead  with the imposition of its new so-called low-carbon fuel standard to  take effect in July.\n\nThe board has refused to even say what impact this is going to have  on gas prices, but studies have shown that it could increase gas prices  in California by another…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691570/public-lands-management"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…keep this government shut  down and force the approximately 35,000 military servicemembers in  South Carolina to work without pay.\n\nIn the year before this provision takes effect, I will work  tirelessly to reverse this harmful language and create a common-sense  regulatory framework which protects America's children, ensures product  quality, and preserves…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696735/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…directives and       guidance for the management of BLM-administered lands across       North Dakota.\n\nThe Congressional Review Act (CRA) requires that before a       rule can take effect, an agency must submit the rule to both       the House of Representatives and the Senate, as well as the       Comptroller General. CRA adopts the definition of ``rule''…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…such       an individual; and\n\n(2) that apply to related services, also apply to the       process for receipt of related services by such an       individual.       SEC. 6. EFFECT ON OTHER LAWS.\n\nNothing in this Act shall be construed to supersede any       provision of any State or local law that provides greater       rights to qualified individuals…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692719/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…percent of the hemp products in our country.  That amounts to an effective ban because the limit is so low that the  products intended to manage pain or anxiety will lose their effect.\n\nThe States have done what they are supposed to. The States have  instituted laws. Twenty-three States have instituted laws on hemp. None  of them have limits anywhere close…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696661/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…directives and       guidance for the management of BLM-administered lands across       North Dakota.\n\nThe Congressional Review Act (CRA) requires that before a       rule can take effect, an agency must submit the rule to both       the House of Representatives and the Senate, as well as the       Comptroller General. CRA adopts the definition of ``rule''…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693059/us-government-accountability-office-legal-opinion"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Security benefits and left struggling to  cover rising costs.\n\nThat is finally starting to change. This year, a new $6,000 tax  exemption for taxpayers age 65 and older takes effect.\n\nLast week, I visited a tax preparation site in Pasco County, Florida,  and my constituents confirmed that this provision is helping them.\n\nEnacted as part of the Working…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700050/tax-policy-should-reward-a-lifetime-of-hard-work"}]