[{"senator": "Rick Larsen", "party": "Democrat", "sentence": "…defeated on party-line votes, unfortunately.\n\nHonestly, I do look forward to the Transportation and Infrastructure  Committee returning to its bipartisan work and creating effective  legislation that will upgrade our infrastructure, that will build our  economy and create jobs, all while protecting our waters.\n\nMr. Chair, unfortunately, the outcome of…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698022/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…the overall financial       stability of the U.S. economy. Instead of regulating crypto       currency, these bills will enable the crypto industry to       operate without effective oversight, and this will endanger       the financial health of working people.           Poorly regulated crypto assets are dangerous to pensions\n\nUnions strongly support…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…public  confidence in the CNE's commitment to the integrity of the elections.  It is my understanding that this new electoral transmission system is  considered to be more effective and secure than the systems in place  during previous elections, and it should help counter efforts--already  reportedly underway--to undermine the fairness of the electoral…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696472/honduras"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…into homelessness.\n\nBefore I served as mayor of Phoenix, I chaired Maricopa County's  Continuum of Care. We put our funding  where it made the biggest impact with proven and effective solutions  like permanent supportive housing.\n\nThat model provides stability and access to support services while  people get back on their feet. It helps some of our most…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697137/addressing-the-housing-crisis"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…criminal  networks were arrested, 67 firearms were confiscated, 15 stolen  vehicles were recovered, and more than $350,000 in drug money was  seized. That is the power of an effective partnership.\n\nNow that his term as our United States Attorney has ended, I join  Governor Moore, former Governor Hogan, and law enforcement officials  across our state in…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688210/recognizing-a-trailblazing-career-in-criminal-justice-us-attorney-erek-lawrence-barron"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…handle the economic headwinds and growth opportunities ahead.\n\nBills like H.R. 5214, the District of Columbia Cash Bail       Reform Act, make DC less safe. Replacing our very effective       pre-trial detention regime, which focuses on charged violent       offenses and repeat violent offenders, not just on cash bail.       I credit recent changes to our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…authorization, and in that  debate, Syria stepped forward and said they would give up their  chemical weapons program. Diplomacy achieved a result, just as  diplomacy achieved a more effective control of the Iranian nuclear  program--even than the bombs that we dropped last Saturday--until it  was torn up.\n\nI pray the cease-fire continues, but I fear we are going…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…to America's worst budget ever. They  are doing it in the middle of the night to hide the fact that this bill  will make Americans sicker and poorer.\n\nTake SNAP, the most effective antipoverty tool we have. This bill is  the deepest cut to food assistance in history, making it harder to put  food on the table for seniors, families, and veterans, including…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691426/gop-tax-scam-hurts-women-and-families"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…capabilities, and Russia's national security doctrine declares our  country and our people as its principal foe.\n\nAmerica, pay attention.\n\nPutin has made clear that he wants effective political control in  Ukraine and other free nations that used to be part of the Soviet  Union. Putin also wants a veto over defense measures being taken in the  former Warsaw…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…consumers, and provides much-needed regulatory certainty in the energy  sector.\n\nAddressing methane emissions, especially fugitive emissions from oil  and gas, is one of the most effective ways to combat the climate  crisis, protect public health, and ensure America's energy sector  remains globally competitive.\n\nMethane has a global warming potential 80 times…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688174/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…proceedings.\n\n(b) Interim Regulations.--Notwithstanding section 553 of       title 5, United States Code, the regulations published       pursuant to subsection (a) shall be effective, on an interim       basis, immediately upon publication in the Federal Register,       but may be subject to change and revision after public notice       and opportunity…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…between rhetoric and reality.\n\nSo what do we get for that price?\n\nThe same report concludes that with this unlimited spending, such a  system will still fail to be 100 percent effective.\n\nAre we prepared to spend trillions of dollars on a shield that cannot  be 100 percent effective?\n\nOh, well, only if one or two bombs get through, forget about New York…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699035/expiration-of-new-start"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…part of Local Union 68, he worked tirelessly to ensure his  fellow electricians had safe, rewarding careers. President Buchanan  embodies the qualities essential to being an effective leader. His  union brothers and sisters benefited from his hard work and commitment  to creating a better future for all, and his absence will be felt by  the community he…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695840/recognizing-morgan-jay-buchanan"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…but we won't let them vote. Trump's policy  would also impose unfunded mandates on States. According to the Rhode  Island secretary of state who is one of the most, I think, effective  secretaries of state in the country, the State government would need to  change its voter registration systems and forms. It may need to  purchase new voting machines and…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…strength?\n\nI don't think so, and I don't think anybody else thinks anything has  changed, other than a President who wants to go in a different  direction. That President has no effective check and balance on this  tragic mistake, except for the majority in the House and the Senate.\n\nI really hope for my Republican colleagues in this body because I  don't…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687987/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…based on what consumers need or focused on  affordability. They were rooted in ambitious climate goals.\n\nWhile EPCA requires regulation to be economically justified and cost  effective, the Biden-Harris administration bent the rules so that  households and businesses may not see any efficient savings for  decades.\n\nIn fact, the Biden-Harris Department of…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700166/dont-mess-with-my-home-appliances-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…the reconciliation package. We want to see  this thing get advanced as we continue to make it into law as the  process plays out. We are going to move this conservative and effective  agenda.\n\nMr. Speaker, I am grateful to be a part of this process and for the  work my colleagues here are putting into this, as well.\n\nIn addition to the reconciliation…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "John Rose", "party": "Republican", "sentence": "…chassis. The result has been less  construction, higher costs, and fewer opportunities for working  families to own where they live.\n\nYet, manufactured housing is one of the most effective ways to expand  housing supply quickly and affordably. By removing this outdated  Federal restriction, more homes will be built, and ultimately prices  will come down for…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699802/housing-for-the-21st-century-act"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…Kentucky. He began his broadcast news career as General Sales Manager  and General Manager of WYMT-TV in Hazard, Kentucky. As a former  successful coach, Wayne always had an effective game plan, and he used  it to move up the ranks quickly in the television news industry. He  served as President and General Manager of WKYT-TV from 1993 to 2013,  where…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696267/tribute-in-honor-of-wayne-martin"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…European Disposables       And Nonwovens Association (EDANA), or an otherwise equivalent       symbol adopted by the Commission through rulemaking under       this section.\n\n(h) Effective Date.--This section shall apply to a covered       entity beginning on the date that is 1 year after the date of       the enactment of this Act.\n\nMr. Speaker, I rise today…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692751/wastewater-infrastructure-pollution-prevention-and-environmental-safety-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…solution to help our brothers  and sisters and protect our first responders--because so far, the data  on--let's call it a fentanyl vaccine--is that it is 92 to 98 percent  effective. What if this were worth a few hundred billion dollars in  economic savings to our society in a single year?\n\nRepeatedly, I come here and I talk about helping our brothers…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…national tragedy and a moral call to  action. This bill reauthorizes and strengthens the VA's Staff Sergeant  Parker Gordon Fox Suicide Prevention Grant Program, one of the most  effective tools we have to get local, trusted organizations the funding  they need to help struggling veterans.\n\nIn Iowa, I have seen incredible work being done by people like Shane…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691507/no-wrong-door-for-veterans-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…a cleaner, more  sustainable future, one that supports jobs, growth, and the  environment.\n\nThis should be a no-brainer for my colleagues who claim to be the  champions of effective environmental policy. Let's not be fooled by  their rhetoric. The reality is that many on the other side of the aisle  are beholden to a vocal and uncompromising wing of…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…Personnel Management shall prescribe regulations under       section 4121(f) of title 5, United States Code, as amended by       subsection (a) of this section.\n\n(c) Effective Date and Application.--\n\n(1) In general.--The amendments made by this section shall       take effect 1 year after the date of the enactment of this       Act.\n\n(2) Applicability.--The…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698216/federal-supervisor-education-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…otherwise authorized       by air traffic control.\n\n(2) Compliance deadlines.--In issuing a final rule under       paragraph (1), the Administrator shall--\n\n(A) include an effective date of not later than 60 days       after the date on which such final rule is published in the       Federal Register; and\n\n(B) require aircraft described in paragraph…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…today in support of H.R. 1679, the Global  Investment in American Jobs Act of 2025. This is being led by the  gentleman from Colorado (Mr. Evans), my good friend and a very  effective Member of Congress.\n\nThis bill directs the Secretary of Commerce and the Comptroller  General to conduct a review and report on ways to increase and attract  foreign direct…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692697/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…these fisheries, which are integral to the region's economic and  ecological health. I urge my colleagues to support this bill.\n\nMr. STAUBER. Mr. Speaker, this bill supports effective fishery  management, which starts with accurate data. I thank Representatives  Quigley and Huizenga for their work on this bill.\n\nMr. Speaker, I urge my colleagues to support…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698192/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Farmers turn to growing hemp to mitigate the losses they endured during  this season of hardship. But that lifeline may soon be extinguished by  this very legislation.\n\nThe effective hemp ban included in this spending package is a result,  we are told, of bad actors skirting the legal limits by overly  enhancing the concentration of THC in their products.…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696661/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…or will disclose any information relating       to the investigation or prosecution of a criminal offense       that is required to be kept secret in the interests of       effective law enforcement;\n\n(e) will disclose information relating to the trade secrets       or financial or commercial information pertaining       specifically to a given person…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687982/us-senate-committee-on-rules-and-administration-rules-of-procedure"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Control establishes such program.\n\nMr. Speaker, I rise in strong support of H.R. 1450, the OFAC  Licensure for Investigators Act.\n\nWhen it comes to combating illicit finance, effective public-private  partnerships are critical. Tracking and disrupting sophisticated crime  networks requires cooperation between our government and private-sector  experts.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693944/ofac-licensure-for-investigators-act"}]