[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…pledged  to bring food costs down on day one.\n\nInstead, the opposite has happened. Food costs are rising. His own  USDA, the U.S. Department of Agriculture, recently reported egg prices  could rise 41 percent over the next year. Since taking office, he has  done nothing to help families struggling at the grocery checkout.\n\nAs a result, big corporations…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689082/economic-populism"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…gentleman from Alabama (Mr. Palmer),  who I greatly respect. When he talks about prices, since President  Trump was inaugurated, prices have gone through the roof. Grocery  prices, egg prices, meat prices, fish prices, and poultry prices are  all up even more than ever. Electricity costs are way up, along with  housing prices.\n\nMr. Speaker, the gentleman mentions…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688293/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Musk,  and their secret meat grinder called DOGE hurting working Americans?\n\nInflation is going up, unemployment is up, the stock market is  rickety and went down again today, egg prices are up, and Walmart sales  are down.\n\nSo far, there is little evidence that DOGE is helping families.  Indeed, they are causing more unemployment. They are not keeping…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687903/draconian-doge-cuts"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…the American Dream.\n\nHedge funds, speculators buying up houses, jacking up the cost of  that housing are becoming lousy landlords, pricing people out of what  could be a nest egg for their retirement, their home.\n\nMonopolies are jacking up prices and killing small businesses every  chance they can get. Pharmacy benefit managers, or PBMs, are raising…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…hear from constituents every day about the high cost of  living. Under the Trump administration, healthcare costs are rising,  and putting food on the table is getting harder as egg prices skyrocket  and housing remains unaffordable.\n\nUnfortunately, the Republican rip-off is a slap in the face to  working families.\n\nTrump, Elon Musk, and House Republicans…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688020/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…warning.\n\nDr. Iyengar also mentioned that we now are less safe in protecting  ourselves during the flu season, particularly with bird flu.\n\nI may insert the question: How much are egg prices today in the  United States of America? People are stealing eggs outside of delivery  trucks and engaging in fights in supermarkets across this country. This  is the…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688410/a-serious-and-profound-moment"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…crisis.\n\nPresident Trump campaigned on lowering prices. He pledged to ``bring  food costs down on day one.'' Instead, the opposite has happened. His  own USDA recently reported egg prices could rise 41 percent over the  next year. Since taking office, he has done nothing to help families.\n\nThis is shameful, because the alternative is clear. A few weeks…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691687/providing-for-consideration-of-hr-one-big-beautiful-bill-act"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…a big issue in my district and my State, is the cost of  housing. Young people today cannot afford to buy a house. That means  they are going to struggle to build their nest egg for retirement.\n\nOne of the ways to bring down the cost of housing is to use that 8- inch diameter or smaller timber that the Forest Service brings out of  those national forests,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…offered no vision and no solutions, just grievance after grievance  after grievance. It was 90 minutes of pure propaganda. It made me sick.\n\nHe offered zero ideas to fix the egg shortage, zero solutions for  inflation, zero plans to lower rent, zero about prescription drugs, and  zero about caring for our veterans--he didn't even mention them--and…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688503/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, as Representative of the Ohio region that  produces the most eggs in our Nation, I rise to say happy National Egg  Day: Easter eggs, chocolate eggs, egg yolks, egg whites, egg souffle,  meringue pie, egg salad, and so much more.\n\nEgg prices still cost 25 percent more at the grocery store.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691814/recognizing-national-egg-day"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…453(e)and (f))), meat and       meat food products (as such terms are defined in section 1(j)       of the Federal Meat Inspection Act (21 U.S.C. 601(j))), and       eggs and egg products (as such terms are defined in section 4       of the Egg Products Inspection Act (21 U.S.C. 1033)).\n\n(c) Definitions.--For purposes of this section:\n\n(1) Consumer product.--The…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690219/youth-poisoning-protection-act"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…support vision care, such as an  eyeglasses drive, and engages in a variety of community service and  humanitarian relief efforts.\n\nThese efforts are supported through Easter egg hunts, 5K races, broom  sales, and food stands at the Manheim Farm Show. This does not include  past traditions like car shows at the football field and plastic boat  races…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696418/recognizing-100-years-of-the-manheim-lions-club"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…seconds, but let's break it all down:  border closed; mass deportation of illegal immigrants; fentanyl  smuggling dropping; Laken Riley Act signed into law; inflation cooling;  egg prices down; gas prices falling; astronauts back home; 11 American  hostages freed; reducing the Federal bureaucracy, saving taxpayers  billions of dollars and rooting out waste,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690430/the-first-100-days"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…preceded in death by his son Thomas Danforth and his parents.\n\nJerry lived a life rich with passion and purpose--he loved fishing,  golf, entertaining with his prized green egg grill, red wine,  chocolate, and pie. He cherished winters spent in South Padre Island  with Pam and was happiest when surrounded by family and friends.\n\nMr. Speaker, Gerald…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692114/recognizing-gerald-jerry-danforth"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…in every State--a lot of the people don't want more houses built. Why?  Because they already own a house, and it is worth a lot of money, and  it is a big part of their nest egg. They know that if, in their area,  more houses start being built, then the price of their home is going to  go down and they are going to lose money.\n\nNow, again, I am not…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…enforcement officers, and our Federal  officers, you saw certain irresponsible vainglorious politicians in  California decide that this was their star-making moment, where they  would egg on the violent agitators, where they would try to pick a  fight in every way they could with the President, even going so far as  to file a frivolous lawsuit that was thrown…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "John Thune", "party": "Republican", "sentence": "…conservation programs, and it advances  efforts to help farmers and ranchers get their products to the market.  I am glad to see support for processing capacity for meat, poultry, and  egg products. And I am pleased that this bill also promotes programs  that help State-inspected plants operate across State lines, which  provides producers with more options for…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693501/agriculture-appropriations"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…enforcement roundtable to  discuss how this bill invests billions of dollars in border security to  stem the flow of fentanyl into our communities.\n\nI celebrated 100 years of egg production with Creighton Brothers, a  century of hard work and family enterprise.\n\nThat is just a fraction of the stories I encountered.\n\nEach day on the road, I was reminded…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694794/promises-made-promises-kept"}]