[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…the mayor, and he mentioned government-owned grocery  stores. First of all, my colleague won't admit that groceries are too  high and that families cannot afford the cost of eggs and basic good  foods to have great nutrition for their families.\n\nBy the way, let me remind my colleagues of something. My then-husband  was stationed at Camp Carson in Colorado.…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…President is crashing the global  economy, careening us into recession, destroying retirement plans and  401(k)'s, driving up costs for American families on everything from  cars to eggs to now us being told we may have to ration toys and dolls  this Christmas, as all of that is happening, he is using Congress'  Article I trade and commerce authority to do it.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690937/gulf-of-america-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Minnesotans' energy bills.  Minnesotans and consumers across this country will feel the impact of  Trump's tariffs at the grocery stores when they buy products like pork,  produce, or eggs.\n\nWith the uncertainty of Trump's tariffs, small business owners aren't  able to plan ahead for their businesses. Trump has small business  owners on a rollercoaster, trying…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688917/impact-of-president-trumps-disasterous-tariffs-on-canada"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…ourselves during the flu season, particularly with bird flu.\n\nI may insert the question: How much are egg prices today in the  United States of America? People are stealing eggs outside of delivery  trucks and engaging in fights in supermarkets across this country. This  is the United States of America, and we need an egg price plan.\n\nDr. Iyengar also…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688410/a-serious-and-profound-moment"}, {"senator": "Pete Aguilar", "party": "Democrat", "sentence": "…gentleman for yielding. I rise in  opposition to this Republican budget.\n\nHouse Democrats came to Congress ready to work with our Republican  colleagues to lower the cost of eggs, take on price gouging, expand the  child tax credit, build more housing, and put the pocketbooks of  working families first. This is what the American people told us was  their…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688052/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…yet  our economy shrank in the first 3 months of this year. He imposed  punishing tariffs, then he didn't, wiping out $11 trillion in wealth in  11 weeks. The price of gas, eggs, and other groceries are still too  high.\n\nThe President handed an unelected, unqualified billionaire, Elon  Musk, unfettered access to private data and indiscriminately fired…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690580/100-days-of-chaos-cruelty-and-lawlessness-under-the-trump-administration"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…private schools, the resegregation of public schools, the  erosion of services for students with disabilities, cuts to the student  loan program, and distracts from the price of eggs going up. And while  some folks may be hollering about imagined ``DEI problems,'' many in  the public will fail to notice how the taxpayers' money is being  siphoned away from…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…another.\n\nHowever, too many families are struggling to put food on the table.  They are being priced out of their own grocery store. Food prices have  shot up--meat, milk, bread, eggs--basics that every family depends on.  Households are getting buried under the weight of their grocery bill.\n\nNow, to make matters worse, the Trump administration has unilaterally…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690437/empty-shelves-at-food-banks"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…days where workers  get more tips in order to pay them less.\n\nIn 15 States, that means even more workers will be making just $2.13  an hour. That can't even buy a carton of eggs in Trump's economy, much  less pay the rent. A more accurate name for this would be the employer  profits protection act.\n\nMr. Speaker, I agree with my colleagues on this side…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698969/tipped-employee-protection-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…kitchens that serve the hungry.\n\nWidespread hunger is now on the fast track. Republicans seem to be  saying that the average person who needs food gets only $5 a day. A  dozen eggs cost more than $5 a day.\n\nThat is the price Republicans accept so they can cut taxes on the  wealthy.\n\nRepublicans are stealing from hungry kids, stealing from low-income  families…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…amendment would require the official name change to not take effect  until the Department of the Interior can prove that this bill would  lower food prices, including the price of eggs, spur economic growth,  create jobs, and lower  the unemployment rate, but the Republicans voted it down in committee  and blocked it from getting to the floor today. That shows…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690944/gulf-of-america-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…fixes this problem. We need that now more than ever. Across the  country, families are living paycheck to paycheck while prices for  everyday goods and essential services, from eggs to gasoline to  medicine and childcare, continue to rise.\n\nThis should not be a partisan issue. Republicans like former Senator  Mitt Romney, Senator Josh Hawley, and even Vice…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691687/providing-for-consideration-of-hr-one-big-beautiful-bill-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…gets  elected.\n\nInstead, what has happened? Inflation has gone not down but up. Gas  prices were 2 percent up from the previous month. Chicken, pork, beef-- all more expensive. Eggs, 15 percent higher than last month.\n\nAnd what is Donald Trump's solution to all of this? The Secretary of  Agriculture said yesterday Americans should just buy their own chickens…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…her seven kids. She is  living on the edge--what a horrible story to hear.\n\nCan you imagine those beautiful redheaded kids? And they have to  decide who is going to get the eggs, who is going to get the  vegetables, because she doesn't have enough money, and SNAP doesn't  give her the food she needs to feed her family.\n\nSo here is what I say to you,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698199/new-york"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…that it was  normal to abuse or rape young girls.\n\nThen they say they don't know if they were 18 or 22. Come on. It is  rotten. Then they say to just care about the price of eggs. Care about  the price of healthcare. What is more important than that? American  values are more important. These rich, greedy men abused American  values. They abused what…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696898/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…U.S.C. 453(e)and (f))), meat and       meat food products (as such terms are defined in section 1(j)       of the Federal Meat Inspection Act (21 U.S.C. 601(j))), and       eggs and egg products (as such terms are defined in section 4       of the Egg Products Inspection Act (21 U.S.C. 1033)).\n\n(c) Definitions.--For purposes of this section:\n\n(1) Consumer…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690219/youth-poisoning-protection-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…percent, with an offset from the departmental expenses account.\n\nTo be clear, I am not against renewable energy research. I just  believe we shouldn't be putting all of our eggs in one basket.\n\nI urge my colleagues to support an all-of-the-above energy policy  and,  more importantly, an all-of-the-above research policy at DOE so that we  can expand…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694868/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…But wait, there is more, Mr. Speaker. We have unleashed American  energy, restored our independence, and brought down costs at the pump.\n\nDo you know why we don't hear why eggs cost so much anymore, Mr.  Speaker? Because they don't. Thank you, President Trump.\n\nWe have restored law and order and brought accountability by securing  the border, supporting…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…weight area.\n\nAnd what did we eat? We ate real food. What did that real food look  like? Well, we had whole milk for breakfast and for lunch and for  supper. We had bacon and eggs in the morning. For lunch, we would have  one of the other proteins: turkey or chicken or ham--but vegetables  from our garden. That was it. Fresh vegetables, and we had, I…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…generating more than $11  billion in cash receipts, so the Texas cattle industry is obviously  very concerned about the spread of the New World screwworm.\n\nThis parasite lays its eggs in the wounds of warmblooded animals,  particularly livestock. The larvae burrows into the openings creating  infections that, left untreated, can cause animals to die within…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699770/9999"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…down coal plants. They put regulations on gas- powered generated plants, but then they say there is an electricity  problem.\n\nLet's talk about prices. In my district right now, eggs are $1.29. We  have chicken breast at 99 cents. In Trumbull County, we have gas at  $1.99. I have 45,000 jobs that I cannot fill.\n\nWe are on the ground. We are listening to…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698567/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…held from October 24, 2025 to November 1, 2025, in  Indianapolis, Indiana. During the Poultry Evaluation event, Manor FFA  students evaluated live poultry, graded carcasses and eggs, and  completed a written exam. The Manor FFA team won a gold ranking, and  the students--Anna Frey, Jozie Gilger, Leanna Kneisley, and Misty  Railing--each earned silver.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697257/congratulating-the-manor-future-farmers-of-america"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…the tariffs cause all of your groceries to  go up and cause your electronics to go up, no one is going to help you;  you will just pay higher prices. If you think the cost of eggs is high,  just wait until the tariff hits.\n\nTariffs will raise the price of a car between $5,000 and $15,000.  Despite arguments to the contrary, Americans know that tariffs…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}]