[{"senator": "Chellie Pingree", "party": "Democrat", "sentence": "It was built to  foster national unity, artistic expression, and America's creative  spirit, not to feed the ego of a single individual.", "title": "Changes At the Kennedy Center", "date": "2026-02-04"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "These tariffs are harmful and they will lead to a recession, one  caused not by any outside calamitous event, but by the ego of one man:  Donald Trump.", "title": "Providing for Consideration of Senate Amendment to H. Con. Res. Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "It is about the President's  ego, in my opinion.", "title": "Chair Powell Refuses to Give in to Trump's Demands", "date": "2026-01-12"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Trump is letting his delicate little ego drive U.S.", "title": "Terminating the National Emergency Declared to Impose Duties on Articles Imported From Canada", "date": "2025-10-29"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "To lead our Nation's health system, you must rely on facts and data,  not conspiracy and ego.", "title": "Vaccines Are A Great Invention", "date": "2025-12-09"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "Americans are paying more for healthcare and their daily essentials  during an affordability crisis, all because of a manufactured emergency  and one person's ego.", "title": "Relating to A National Emergency By the President on February 2025", "date": "2026-02-11"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "In mere months, Trump's reckless foreign policy style has unraveled  decades of progress, suddenly slapping India with 50 percent tariffs  because his fragile ego was so triggered.", "title": "Trump Must Reverse Course", "date": null}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "It has been less than 24 hours, and here they are on the  floor with an emergency censure to soothe Donald Trump's fragile ego.", "title": "Raising A Question of the Privileges of the House", "date": "2025-03-05"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "It got so bad that a Federal judge found that the shadowy trade  association was the alter ego of the real coal council, with no clear  lines of separation between the Federal entity and its mirror image.", "title": "National Coal Council Reestablishment Act", "date": null}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "It is because they want  to stroke the ego of Donald Trump.", "title": "Gulf of America Act", "date": "2025-05-08"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "Will his ego stop staining this city by putting his name and his  picture all over banners contemporaneous or similar to Teddy Roosevelt  at the Department of Labor and others?", "title": "United States Institute of Peace", "date": "2025-12-04"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "It is about swelling up his ego.", "title": "Providing for Consideration of Senate Amendment to H.R. One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "Then, he comes up and tells us he wants to have a parade that will  cost over $90 million on his birthday, which happens to coincide with  Flag Day and the birth of the United States Army, neither of which have  ever merited a parade in the past--$90 million with airplanes, tanks,  and troops to appease a man's ego, to let him think for a while that he  is Genghis Khan or Napoleon.", "title": "Comments on President's Statements", "date": "2025-05-05"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Instead,  they are focused on stroking the ego of one man, Donald Trump, the man  who they would make king.", "title": "Gulf of America Act", "date": "2025-05-08"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "The budget       resolution, adopted by the slimmest of margins in the       narrowly divided House, was the delicate product of       negotiations among conservative hard-liners who demand steep       spending cuts and swing-district GOP lawmakers who say they       don't want to slash funding for the health programs their       constituents rely on.", "title": "Privileges of the Floor", "date": "2025-03-31"}]