[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…domestically,       as the minerals will be funneled to a strategic adversary of       the United States.\n\nNotably, the Boundary Waters withdrawal area includes only       four out of eighteen known mineral deposits in the Duluth       Complex, the mineral rich formation found in northern       Minnesota. Neither does the withdrawal affect other mineral       deposits…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…bill will create a National  Commission on Fiscal Responsibility and Reform, similar to other such  commissions past, to serve this function.\n\nThe commission would consist of eighteen members split between  Democrats and Republicans, and would be charged with proposing  recommendations designed to achieve a balanced annual federal budget  within ten years…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689288/introduction-of-the-sustainable-budget-act"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…is--Byron's biggest supporter. At the tender age of just  fourteen years old, he was already pitching jokes to show biz titans  Jay Leno and David Letterman.\n\nBy 1979, at just eighteen years old, Allen had become the youngest  comedian ever to appear on The Tonight Show. Following this historic  and meteoric ascent in the comedy scene, Byron Allen became…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696283/recognizing-a-magnanimous-media-mogul-mr-byron-allen"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…the tenets of the 2050 Strategy for  the Blue Pacific Continent, the guiding framework of the Pacific  Islands Forum, the region's premier multilateral organization with  eighteen members across Oceania.\n\nSpecifically, this bipartisan, bicameral bill would require the  President to develop and submit to Congress a Strategy for Pacific  Partnership,…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693376/introduction-of-the-pacific-partnership-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…religious experience as a UConn fan and a UConn Law  School graduate. That is the same as the Boston Celtics have in the  NBA. The Los Angeles Lakers have 18 titles, as well.\n\nEighteen titles for a land-grant university in rural Connecticut  defies any conventional wisdom about big, high-paying university  programs. They just keep getting it done.\n\nCoach…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689671/congratulating-uconn-womens-basketball-stars"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…from my Pacific Partnership Act, which extends  diplomatic privileges and immunities to the Pacific Islands Forum  (PIF), the region's premier multilateral organization with eighteen  members across Oceania, in the hopes that the PIF will establish a  mission to the U.S.\n\nScattered across the three traditional Pacific subregions of  Melanesia, Micronesia…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694767/supporting-the-partner-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…colonists, itching for independence, stormed a       British vessel. A spark in New England helped ignite a       national revolution.\n\nBut this was not the Boston Tea Party.\n\nEighteen months before colonists dumped tea in Boston       Harbor--an event that marks its 250th anniversary this week--      Rhode Islanders attacked and destroyed a British navy…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "Mr. JACKSON of Texas. Mr. Speaker, I rise to recognize the retirement  of Mr. George Woodward. After eighteen years of dedicated service, Mr.  Woodward is stepping down from his responsibilities as the Director of  Public Affairs for the 82nd Training Wing at Sheppard Air Force Base…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693070/recognizing-the-career-of-mr-george-woodward"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, November is Lung Cancer Awareness Month.  One in eighteen people receives a lung cancer diagnosis during their  lifetime. Twelve percent of the diagnoses have had no tobacco exposure.  This disease impacts hundreds of thousands of…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697020/lung-cancer-awareness-month"}, {"senator": "James Risch", "party": "Republican", "sentence": "…twenty-two (22) T700-GE 70 1D       engines; thirty-six (36) remanufactured T700-GE 701D engines;       twenty-seven (27) AN/AAR-57 Counter Missile Warning Systems       (CMWS); eighteen (18) Embedded Global Position Systems with       Inertial Navigation (EGI) with Multi-Mode Receiver (MMR);       thirty-six (36) remanufactured EGIs with MMR; eight (8) AN/…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699550/arms-sales-notification"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…over what has occurred in  Minnesota, where there has been a lot of vitriol directed at ICE in  Minnesota, let us look at these individuals right here. These represent  about eighteen individuals who are the people that ICE has been  arresting in Minnesota. There has been a lot of news over one incident  in Minnesota.\n\nWhat we have here is a Somalian illegal…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…taxpayer-funded healthcare subsidies paid by the  Federal Government. It is insulting to taxpayers that that is the best  the Democrats can do, that that is what the Democrats offer.\n\nEighteen of the twenty-four fake enrollees--this is even worse--were  still receiving taxpayer-funded subsidies as recently as September.\n\nNow, remember, September--the month of September,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…able to enroll in       subsidized plans despite submitting false or no records to       verify their identities and incomes.\n\nOf GAO's 24 applications, 23 were approved. Eighteen       enrollees were still covered as of September, suggesting that       the exchange and insurers didn't verify information even       after enrollment. The subsidies paid…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697906/affordable-care-act"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…decorations include the Air Force Cross, the Service's second  highest award for valor, along with three Silver Stars, three Legions  of Merit, six Distinguished Flying Crosses, and eighteen Air Medals.\n\nColonel DeBellevue earned a bachelor of science degree in physics  from the University of Southwestern Louisiana and was commissioned as a  second lieutenant…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699080/9999"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Range GMLRS (ER GMLRS) Alternative       Warhead (AW) Missile Pods with IMPS; thirty-six (36) XM404       Extended Range GMLRS (ER GMLRS) Unitary Pods with IMPS; and       eighteen (18) M57 Army Tactical Missile System (ATACMS)       Missile Pods. Also included were M28A2 Low Cost Reduced Range       Practice Rocket (LCRRPR) pods; International Field…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690233/arms-sales-notification"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…just got downgraded by the third major credit  rating agency. Did you know there are 18 States that have a higher  credit rating than the United States Government right now? Eighteen  States have a higher credit rating, yet every dime a Member of Congress  will vote on, every dime of discretionary, nondefense discretionary, as  we call it, is borrowed…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…promise remains unfinished. More than 50,000  Coloradans, across a distance spanning more than some Eastern States,  still rely on contaminated and radioactive groundwater. Eighteen  systems are under enforcement orders for violating EPA standards. These  are real families, real towns, and real public health consequences.\n\nRural Colorado and rural America…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698701/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}]