[{"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…with the average  victim losing $34,000 from these crimes annually, not to mention the  pain you can't put a dollar amount on. What is worse is that the  majority of cases of elder exploitation are not reported.\n\nWe are here today to do something about it by passing my Senior  Security Act to help protect American seniors from these shameless  criminals.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693937/national-senior-investor-initiative-act-of-2025"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…freshmen colleagues and I are focused on  making life better for the American people and driving down grocery  prices, utility bills, rent and mortgage payments, and childcare and  elder care costs so that hardworking people can breathe easier.\n\nTo help working families, especially multigenerational households,  deal with the rising costs of living, I am introducing…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699584/stop-the-republican-affordability-crisis"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…holding  was a cell phone--then show it.\n\nIf you believe in the Fourth Amendment and the right against search  and seizure and that you can't have armed agents ramming through an  elder Hmong man's door, pulling him out in his underwear and throwing  him in a car, only to find out, after they drove him around for an  hour, that they had the wrong guy and that,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…Education Fund; National Advocacy Center of the Sisters of       the Good Shepherd; Nuns Against Gun Violence; Safe Havens       Interfaith Partnership Against Domestic Violence and Elder       Abused; Sisters of Mercy of the Americas Justice Team; Ujima:       The National Center on Violence Against Women in the Black       Community; United Church of Christ.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…making life better for everyday people.\n\nThe bills are as follows: H.R. 2988--Protecting Prudent       Investment of Retirement Savings, H.R. 2270--Empowering Child       and Elder Care Solutions Act, H.R. 4366 Save Local Business       Act, H.R. 2312--Tipped Employee Protection Act, H.R. 2262--      Flexibility for Workers Education Act. Far from making…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…Border Law Group; Center for Biological       Diversity; Center for Civil Rights and Critical Justice;       Center for Civil Rights and Equal Opportunity; Center for       Elder Law & Justice; Center for Gender & Refugee Studies;       Center for HIV Law and Policy; Center for Human Rights and       Constitutional Law; Center for International Environmental…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689713/no-rogue-rulings-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…``Protection''--Bureau rule that caps overdraft  fees by banks at $5.\n\nThe work of CFPB has been cost-saving and life-changing, but this  resolution would undo that progress. Whether it is an elder whose  Social Security  check was delayed into her direct deposit, likely because of Trump's  mass firings, or the young college student who makes the innocent  mistake of…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689838/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…and long-term care facilities. Haitian and other       TPS holders also play critical roles in public       transportation, construction, food services, childcare, and       elder care--industries already experiencing severe labor       shortages. Nationally, TPS holders contribute an estimated       $6.9 billion annually in wages and $1.6 billion in…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…into fall prevention, chronic  disease management, and Alzheimer's disease. They safeguard vulnerable  adults through the Long-Term Care Ombudsman Program, and they address  elder justice issues like abuse, neglect, and exploitation. They  provide legal assistance for disabled people and more.\n\nThese are just some of the reasons that we introduced the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690500/blocking-resolutions-of-inquiry"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Then, it went up strongly under  President Kennedy, down under President Nixon, up in Carter's  administration, down in Reagan's administration, and down again in Bush  the elder's administration. It went up during the Clinton  administration and down strongly during George Bush's administration.  That was, frankly, because of the historic mistake that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695605/devastating-harm-caused-by-trump-administration"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…more  efficiency, have more customer service. There are ways to do that.\n\nBut no, this is folks coming with an ax to cut your healthcare or  your neighbor's healthcare or your elder's healthcare.\n\nIt is not a government program; it is a commitment we make to each  other. In the greatest Nation on the planet Earth, we say we will take  care of our children;…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…Education Fund; National Advocacy Center of the Sisters of       the Good Shepherd; Nuns Against Gun Violence; Safe Havens       Interfaith Partnership Against Domestic Violence and Elder       Abuse; Sisters of Mercy of the Americas Justice Team; Ujima:       The National Center on Violence Against Women in the Black       Community; United Church of Christ.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…$400 Million, and mandated insurance coverage for  mammograms--work that continues to save lives.\n\nAdvanced protections for America's seniors, authoring legislation to  combat elder abuse and later advising President Bill Clinton at the  White House Conference on Aging.\n\nBeyond her legislative record, Congresswoman Oakar was instrumental  in shaping Cleveland's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695548/moment-of-silence-for-mary-rose-oakar"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "Ms. PRESSLEY. Mr. Speaker, I rise today on behalf of every elder who  can't afford their prescriptions and every parent who went to work  hungry so their child could eat. In the United States of America, there  is no lack of resource, only…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696696/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "Mr. Speaker, I rise in opposition to H.R. 2270, the Empowering  Employer Child and Elder Care Solutions Act. Unfortunately, it doesn't  solve anything. It doesn't provide any additional child or elder care.\n\nWhat it does is take money out of people's pockets because,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699005/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…tape and let businesses  invest in the needs of their employees without punishing the company  for doing just that.\n\nThat is why I introduced the Empowering Employer Child and Elder Care  Solutions Act. Hoosiers and all Americans must not be forced to choose  between caring for a loved one and working outside of the home.\n\nBusinesses deserve to be profitable…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699003/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Club, Sea Island Company, and Brunswick Country  Club. Joe later became a top producing realtor, specializing in luxury  properties.\n\nA devoted church leader, Joe served as an elder and deacon,  supporting organizations like Manna House of Brunswick and contributing  to community events. He was known for his generosity, kindness, and  willingness to help…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…James       ``Tommy'' Thomas Clagett Jr., Chris Collins, Casey Laurance       Crafton, Pete \"PJ\" Diaz, Kiah Duggins, Chief Warrant Officer       Andrew Loyd Eaves, Danasia Brown Elder, James ``Brian''       Ellis, Ian Douglas Epstein, Lindsey Denae Fields, Jinna Han,       Jin Han, Cory Haynos, Stephanie Haynos, Roger Haynos,       Alexander ``Alex'' Gordon…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688371/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Victoria Spartz", "party": "Republican", "sentence": "…Deputy of the  Year.'' Deputy Larkin has also been honored for his work with senior  citizens in the community providing them with information on Senior  Crime Prevention and Elder Fraud & Abuse.\n\nOutside of work, Deputy Larkin has been a steadfast Boy Scout Leader  for Troop 132, for over 35 years. An avid sports lover, Deputy Larkin  is also a referee…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689236/recognizing-deputy-jeff-larkin"}, {"senator": "French Hill", "party": "Republican", "sentence": "…appropriate, with other offices within       the Commission, other taskforces that may be established       within the Commission, self-regulatory organizations, and the       Elder Justice Coordinating Council; and\n\n``(D) consult, as appropriate, with State securities and       law enforcement authorities, State insurance regulators, and       other Federal…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693935/national-senior-investor-initiative-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, today, I come to the Senate to recognize  June as National Elder Abuse Awareness Month. I am introducing a  resolution with Democratic Senator Blumenthal for this very purpose.  This is a time to shed light on a crisis that too often remains…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692579/national-elder-abuse-awareness-month"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…immediate  consideration in the House.\n\nThe Clerk read the title of the bill.\n\nMr. WALBERG.  2270.\n\nMr. Speaker, I rise today in strong support of the Empowering  Employer Child and Elder Care Solutions Act, a bipartisan proposal that  meets working families where they are and strengthens our economy at  the same time.\n\nAcross this country, millions of Americans…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699006/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…but also provided over 237,000 meals to individuals and  families in need. The program mobilized $2.4 million and delivered  vital services to shelters, food ministries, and elder care centers  during one of the community's most vulnerable times. Charles also  pioneered the Fighting Human Trafficking (FHT) Program, positioning  UWPC as one of only four…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690203/recognizing-chuck-anderson"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…the Patriot League  this year. Yet, our entire Hudson Valley is rooting for her, and we  cannot wait to see all that she will accomplish.                         recognizing elder jim childs\n\nMr. RYAN. Mr. Speaker, I rise today to honor Elder Jim Childs, a  pillar of our Kingston community, for his decades of service to St.  Clara's Church, to his and…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694021/recognizing-cornwall-cleanup-crew"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Coordinator for SHINE Volunteers within the Area Agency on Aging as  well as a Florida Statewide SHINE Trainor. He has traveled around the  state for the Florida Department of Elder Affairs educating SHINE  Volunteers. Jerry is a true advocate and can be relied on to accept any  challenges that arise.\n\nIn addition to Volunteering with the SHINE program…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690791/recognizing-jerry-phillips"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Speaker, we are here today to debate the rule  providing for consideration of H.R. 2262, the Flexibility for Workers  Education Act; H.R. 2270, the Empowering Employer Child and Elder Care  Solutions Act; H.R. 2312, the Tipped Employee Protection Act; H.R.  4366, the Save Local Business Act, under a closed rule; and H.R. 2988,  the Protecting Prudent Investment…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}]