[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…starvation stuff, I see it,       and you can't fake that.\n\nThe use of food and water and medicine as a weapon of war against  civilians--including against children, the ill, the elderly, the  women--it is unacceptable. It is unacceptable under international law.  It is unacceptable under any religious or moral code.\n\nI have much more to share on this topic,…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694437/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…America.\n\nMedicaid cuts as proposed under the Republican budget threaten  optional benefits the most, including long-term services and supports  that help the disabled and the elderly in home- and community-based  services that help protect these Americans who need our help. They live  with disabilities in their own communities and get the support, love,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691415/gop-tax-scam-hurts-everyone"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…acting as ``villains,'' stripping  away freedoms from Americans. This agency has gone rogue. It is  lawless, and it needs to be reined in.\n\nThe ICE agents who pepper sprayed an elderly couple in Minnesota need  to be arrested and prosecuted. The ICE agents who dragged out a  disabled woman from her car who was going to a doctor's appointment  need to be…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699073/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…people with  disabilities cannot get help by phone due to reduced phone service.  They can't get help by the website that frequently crashes and presents  access barriers to the elderly. Nor can they get help in person given  the increased distance to offices and longer wait times due to dramatic  staff cuts and office closures.\n\nAt the time when the greatest…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690131/opposition-to-president-trumps-and-elon-musks-theft-of-social-security-to-pay-for-handouts-to-billionaires"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…substantive input from relevant medical experts. One  of the vaccines RFK, Jr., downgraded was the flu vaccine.\n\nThe science is clear. This decision will hurt our children, our  elderly, and our families. Science doesn't care about our feelings.  Science doesn't care about our politics. Science is built on data,  evidence, and facts.\n\nRFK, Jr., seems to think…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699142/denouncing-immunization-stance-of-robert-f-kennedy-jr"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…and his wife, Yvette, as they recover.\n\nAs Minnesota's top leader in Human Services, Senator Hoffman  shepherded historic investments for the most vulnerable among us: the  elderly; those with disabilities, both seen and unseen; and those  recovering from addiction.\n\nThe grief that Minnesotans have endured in the days since this  tragedy has been agonizing.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692784/grieving-mark-and-melissa-hortman"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…advancing policies that could disqualify tens of millions of  Americans from voting in elections. If adopted, these policies will  make it harder for low-income individuals, the elderly, women, and even  U.S. servicemembers deployed overseas to cast a ballot. Now, that is  very ironic.\n\nThese men and women in uniform are in dangerous locations to protect…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…Medicare. I talk to young  people in my district, Mr. Speaker. They say: ``I am not on Medicare.''  I say: ``That is right. Maybe you are not, but your grandmother is,  your elderly aunt is, and the doctor you see is able to see you because  of the reimbursement they are getting from a Medicare patient.''\n\nWith these cuts, we are hearing from community…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…American taxpayers. He cheated his employees.  He stole money out of their paychecks and kept it for himself instead  of paying their taxes. He robbed them of their 401(k)'s. Elderly  patients in his care got substandard care.\n\nIn April, this swindler was rightly sentenced to 3 years in prison,  but he didn't stay long thanks to our President. He gave…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697943/another-disgusting-pardon-by-donald-trump"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Means' configuration on Social Security that will benefit the  people.\n\nAs Representative Stansbury has indicated, this is America's number  one antipoverty program for the elderly and number one antipoverty  program for children, and more veterans rely on Social Security  disability than they do the VA.\n\nMr. Speaker, I thank Ms. Stansbury for her efforts…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694190/hands-off-our-social-security"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…halted at the direction of President Donald  Trump. To think, this President, in order to put political pressure on  Congress, is going to cut off the food to disabled people, elderly  people, and children is disgusting.\n\nThe Trump administration has the power to issue 100 percent of  benefits to working families and kids who rely on this program, but the…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…of them?\n\nSecond, given the housing shortages we face--and the tariffs will  make that worse with the wood--isn't it true that many families just  don't have room to take an elderly person, particularly one who needs  care, into their homes and that this would cause chaos to all sorts of  people who are not on Medicaid themselves but who have loved ones…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689304/privileges-of-the-floor"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…were making less than their male  counterparts. No matter how you look at it, it is unfair and unjust.\n\nSocial Security is the Nation's number one antipoverty program for  the elderly, and it is also the number one antipoverty program for  children.\n\nMadam Speaker, more veterans rely on Social Security disability than  they do the VA. Yet, Congress has…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694818/saving-social-security"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…in  2011, when she raised the necessary funds to allow the annual Quincy  MLK breakfast to continue--to what may be seen as more minor acts of  kindness--such as helping an elderly neighbor keep their lights on or a  family receive groceries for the week. Kathy has always made sure that  no one goes without during the holidays, ensuring that thousands…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689332/recognizing-kathy-quigley"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…peaceful protesters, barging into  people's homes without warrants, preventing doctors from treating their  patients, blocking students from their classrooms, snatching children,  elderly people, pregnant women, veterans, active military, and American  citizens from our streets.\n\nRepublicans have been silent while this administration terrorizes  people in communities…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699296/dhs-is-working-with-no-oversight-and-no-accountability"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Housing Trust Fund program under section 1338 of       the Housing and Community Development Act of 1992 (12 U.S.C.       4568);\n\n(VI) the program for supportive housing for the elderly       under section 202 of the Housing Act of 1959 (12 U.S.C.       1701q);\n\n(VII) the program for supportive housing for persons with       disabilities under section 811…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…these programs to actually serve  the most vulnerable communities for generations to come: the single mom  taking care of kids too young to be in school, the disabled, and the  elderly, not the person who wants the government to foot their bill  while they sit at home.\n\nWhy would we willingly jeopardize the benefits of vulnerable  Americans for someone who…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691361/dignity-of-the-american-dream"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…our neighbors, and our veterans. Elder abuse isn't limited by geography  or income. It occurs in nursing homes and private residences, the very  places meant to offer these elderly people care and protection.\n\nWith a fast-growing senior population in our country, the urgency to  act has never been greater. This month, we recommit to building a  society…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692579/national-elder-abuse-awareness-month"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…job and  ultimately get off Medicaid.\n\nOne of the components about Medicaid, we all know, is that it was  formed in favor of pregnant women, disabled people, as well as the  elderly. What the Republicans are trying to do is rightsize the  Medicaid program so that it survives for the long-term, vital needs of  the people of the future.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693220/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…Republicans increase spending in Medicaid by  25 percent over the next 10 years for the people who really need it:  the pregnant women, the children, the disabled, the blind, the elderly,  and we did it eliminating fraud, waste, and abuse.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691335/eliminating-fraud-waste-and-abuse-in-medicaid"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…consistently ensure that all residents of Northern Michigan--especially  the area's most vulnerable individuals, including those with medical  needs, families with children, and the elderly--remain safe and warm  throughout harsh northern winters. Simply put, these cooperatives help  deliver a quality of life to rural areas that might otherwise be left  behind.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690150/thanking-northern-michigan-electric-cooperatives-and-linemen-for-restoring-power-throughout-northern-michigan"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…and businesses in Indiana and across the United States,  which is the expensive, but essential, financial support workers need  to provide care for their young children and elderly parents.\n\nCurrent law discourages employers from helping their workers pay for  onsite childcare or elderly dependent care because of the unreasonable  pay calculations that…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699003/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…strengthens our overall economic resilience.\n\nThis legislation also recognizes that caregiving does not end with  childhood. As our population ages, more workers are caring for elderly  parents or relatives. Eldercare challenges can be just as disruptive  and unpredictable as childcare needs, and yet they are often overlooked  in policy decisions.\n\nThis…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699006/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…talent, and treasure with Gulfside Hospice. With a servant's  heart, Joan quietly, yet passionately finds ways to support one of the  most vulnerable groups in her community--the elderly. Joan's journey  into volunteering began later in life. At nearly 79 years old, instead  of slowing down, she stepped up when she heard Gulfside needed  volunteers. In just…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690776/recognizing-joan-moore"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…and  one of the key components of that was that welfare assistance depended  on work for able-bodied adults.\n\nWe are not talking about children. We are not talking about the  elderly. We are not talking about the disabled. We are talking about  able-bodied adults.\n\nThe Welfare Reform Act of 1996 replaced AFDC, as it was called, with  TANF, or Temporary…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…working class.\n\nThis legislation that we have produced in the Energy and Commerce  Committee will strengthen Medicaid for low-income children, for  pregnant women, for the elderly, and for those with disabilities. For  far too long, illegal immigrants and able-bodied Americans, who can  return to the workforce, have been draining funds from the citizens…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690998/delivering-on-president-trumps-agenda"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…will fight fraud, waste, and abuse. We think the American  people agree that fraud, waste, and abuse robs the Medicaid system from  covering the people like the disabled, the elderly, pregnant women, and  children. It robs money from those programs and wastes it.\n\nEven after we eliminate fraud, waste, and abuse, we have enough to  increase Medicaid expenditures…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690738/republicans-are-not-cutting-medicaid"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Trump and Republicans are reviving the American Dream by  advancing progrowth, proworker, America First policies that help young  people build a future, provide relief for our elderly, and strengthen  the middle class and everyone in between.\n\nI thank the President for his work on our economy.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699063/how-republicans-have-delivered-for-americans"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…46-year-old with a history of erratic behavior. He was  charged with DWI and assault. A few days before the shooting, he had  been arrested for two charges of injury to an elderly person; one  charge of assault, family violence causing bodily injury; and one  charge of driving while intoxicated.\n\nThe Bexar County Magistrate's Office--Bexar County is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…meals, medical transportation, health and wellness  initiatives, caregiver support, and much more. With senior centers  across the county, the Committee has been able to help elderly adults  and their families navigate the challenges that can arise while aging.\n\nMr. Speaker, by celebrating the Fiftieth Anniversary of the Wood  County Committee on Aging,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695853/recognizing-the-semicentennial-of-the-wood-county-committee-on-aging"}]