[{"senator": "Kathy Castor", "party": "Democrat", "sentence": "Speaker, if higher costs  in electric bills are not going to convince you to vote against this  bill, then I hope that America's national security will.", "title": "Unlocking Our Domestic Lng Potential Act of 2025", "date": "2025-11-20"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "This is something I believe everyone in this Chamber, Republicans and  Democrats alike, can agree on: Congress must do more to cover the  crushing costs of electric bills, groceries, prescription drugs,  housing, and more.", "title": "Stop the Republican Affordability Crisis", "date": "2026-02-03"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "The President promised he was going to cut Americans' power bills in  half, but since he took office last year, electric bills are up by 13  percent across the country, and they are much higher in some places.", "title": "Saving Homeowners From Overregulation with Exceptional Rinsing Act", "date": "2026-01-07"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "Families across the country are  opening their electric bills and asking: Why is my bill so high, and is  anyone doing anything to bring down these prices?", "title": "Prices Are Too High", "date": "2026-02-10"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "Meanwhile, utility bills are surging; electric bills are up 13  percent; and residential gas prices are up nearly 60 percent.", "title": "Stop the Republican Affordability Crisis", "date": "2026-02-03"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "It is another  Republican bill that fails to address skyrocketing electric bills that  are a part of the overall affordability squeeze that is gripping the  country right now.", "title": "Reliable Power Act", "date": "2025-12-17"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "I fear that what this is a recipe for is higher  electric bills and higher costs for hardworking Americans who already  are being crushed by higher bills.", "title": "Researching Efficient Federal Improvements for Necessary Energy Refining Act", "date": "2025-11-20"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "I am absolutely disappointed, but not surprised, that the House  majority continues to hide the impacts of their big, ugly bill and  block Americans from seeing how it raises their electric bills.", "title": "Providing for Consideration of H.R. Energy and Water Development and Related Agencies Appropriations Act, Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Miles City Field Office Record of Decision and Approved Resource Management Plan Amendment''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``North Dakota Field Office Record of Decision and Approved Resource Management Plan''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Central Yukon Record of Decision and Approved Resource Management Plan''; and for Other Purposes", "date": null}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "They are scared to talk about the real problems facing  working families across the country: affordability, the escalating  costs of the overheating climate, what that is doing, higher insurance  costs, and higher electric bills because their summers are longer and  more intense.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program for Appliance Standards: Certification Requirements, Labeling Requirements, and Enforcement Provisions for Certain Consumer Products and Commercial Equipment''", "date": "2025-03-05"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "I hope that Republicans join Democrats in trying to reduce electric  bills, but no.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Office of Energy Efficiency and Renewable Energy, Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Commercial Refrigerators, Freezers, and Refrigerator- Freezers''", "date": "2025-03-26"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "Chairman, American families and small business owners deserve  lower electric bills, but Republicans in Congress are really sticking  it to folks with higher costs at every turn, especially in this  spending bill.", "title": "Energy and Water Development and Related Agencies Appropriations Act, 2026", "date": null}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "And people's electric  bills will go up.", "title": "Budget Reconciliation", "date": "2025-05-22"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "Many families, if not most families, are now struggling  to pay their bills, including their electric bills.", "title": "Securing America's Critical Minerals Supply Act", "date": "2026-02-11"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "Insurance rates and electric  bills will spike.", "title": "Extreme Heat Caucus", "date": null}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "Well, more coal power means higher electric bills.", "title": "National Coal Council Reestablishment Act", "date": null}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "That is why these electric bills are  rising.", "title": "Reliable Power Act", "date": "2025-12-17"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "It hurts families when their electric bills are high  and when their grocery bills are high because people have to eat and  they have to have a safe and clean place to live.", "title": "Researching Efficient Federal Improvements for Necessary Energy Refining Act", "date": "2025-11-20"}]