[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…also allows Congress to       select the number of Electors the District may receive,       subject only to a maximum: The District may participate in       the presidential Electoral College through the appointment of       no more electors than those of the smallest State, i.e.,       three. And section 2 of the Amendment grants Congress the       power…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…pardoned more than 1,500 people who  participated in that brutality, in that attempt to overthrow an  election, which Joe Biden won by more than 7 million votes, 306-232 in  the electoral college, not only did they pardon all of those offenders,  whether they were nonviolent or violent--and a lot of them have already  gone on to reoffend since they got their…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…also allows Congress to       select the number of Electors the District may receive,       subject only to a maximum: The District may participate in       the presidential Electoral College through the appointment of       no more electors than those of the smallest State, ie.,       three. And section 2 of the Amendment grants Congress the       power…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…Bureau of Investigation background check.  Colorado has spent years implementing top-tier cyber security measures  and audits to prevent hackers from interfering with our electoral  process.\n\nWe have one of the most secure election systems of any State in the  country, and because Coloradans have trust in our gold standard system,  we have some of the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690528/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…districts, as       well as its State House and State Senate maps. The evidence       at that trial was clear and unequivocal: the Texas       legislature did not pass race-based electoral districts for       any of those three political maps. Texas State Senator Joan       Huffman, who chaired the Senate Redistricting Committee,       testified under oath…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…that the administration has sought from  secretaries of state throughout the United States information about  their voting rolls, which is specifically directed perhaps at electoral  interference.\n\nMr. REED. Well, I concur.\n\nIf I may raise one additional question?\n\nMr. REED. You have seen firsthand what is happening in Portland. It  is outrageous. The…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696343/trump-administration"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…still ongoing. Soon, in the Louisiana v. Callais  case, the Supreme Court will decide whether section 2 of the Voting  Rights Act, which outlaws racial discrimination in our electoral  system, still allows Black and minority voters to challenge racially  discriminatory voting maps in court, making clear that the fight to  protect our democracy is far from…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…officials who were caught engaging in voter fraud, the reason we know  about it because they were caught. The system is working. Stop trying  to sow division and chaos into our electoral system.\n\nMr. Speaker, I ask the gentleman from Texas who wrote this bill: How  the hell are States supposed to implement this new bill in a matter a  few weeks? His original…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…did with January 6. Why? It is because they also defend his lie  that he won the 2020 Presidential election, which he lost by more than  7 million votes, 306 to 232 in the electoral college.\n\nI don't know what the meaning of their totally partisan resolution is  when they won't even stand by the law--it was signed into law by the  President--to put up…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…it at the request of the Republican Party  officials in those States, ahead of the November 4 election.\n\nThose anti-voter campaigns are coupled with efforts to distort the  electoral maps. Since President Trump took office, he has pressured  Republican State legislators to ignore the will of their voters and  effectively elect representatives through…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…have already made their  many threats that have not intimidated me, but there is a new movement  afoot now to do what cannot be done, as they see it, fast enough  through the electoral process, meaning my removal from office.\n\nThey don't think that the electoral process works efficaciously-- effectively, if you will, for them. I was saying efficaciously,…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…constitution must actively       oppose the administration's efforts to undermine our national       security, our freedoms, and our democracy. Waiting passively       for the electoral calendar to fight back does nothing more       than give the administration additional time and running room       to impose its authoritarian stamp ever more securely on…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…itself, and that is precisely the kind of abuse of power for  which impeachment exists, not as a partisan weapon but as a  constitutional safeguard against the usurpation of the electoral  process in our  country by a would-be King, Donald Trump.\n\nThat is what they were protecting against. They anticipated, in  drafting the Constitution, the emergence of Donald…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700022/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…for eligible voters,  grandfather clauses that tied voters' rights to the grandfathers before  the Civil War, all-White primaries to eliminate Black voters' presence  in the electoral process, and now: Show me your papers.\n\nThe SAVE Act is the same trash, just a different day. It is the  Republicans' latest attempt to make clear who the majority believes…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690008/safeguard-american-voter-eligibility-act"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…motivations, I would  argue that the two are connected. Republicans don't want to face  democratic accountability for their governing failures, so they are  trying to curb the electoral power of the struggling Americans who  their destructive economic agenda is harming the most.\n\nI am a little bit of a student of history. What we are seeing right  now evokes…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…license. In the State of Colorado, when you obtain a driver's  license, you register to vote.\n\nThe SAVE Act is a commonsense measure designed to protect the  integrity of our electoral process. At its core, it requires proof of  citizenship to register to vote in Federal elections.\n\nThis isn't radical. It is not extreme. It is a basic safeguard to  ensure…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689994/safeguard-american-voter-eligibility-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…jittery attempt at once again trying to convince  Americans that Trump was somehow a threat to democracy. Democrats lost,  historically, on November 5, 2024. They lost the electoral vote, the  popular vote, and they lost every swing State on the table.\n\nDid Democrats learn from this smarting defeat since President Trump  took office? They clearly have…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…are voting in those elections. In addition, the SAVE America Act  requires individuals to present a valid photo identification before  voting.\n\nOur Founders set forth our electoral processes 250 years ago based  upon the simple and ultimate principle that only Americans should vote.  However, in this age of progressive, suicidal empathy, basic concepts…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…the same tired talking points and hysteria  about President Trump.\n\nVoters saw right through that in the last election, and Democrats  lost the popular vote. They lost the electoral college. They lost every  swing State on the map. Yet, even after that decisive rejection, Trump  derangement syndrome remains completely untreated.\n\nInstead of course correcting,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…that, judges. They are not the President of the United States. They are  not the person who put his name on the ballot and ran nationwide, got  77 million votes, won the electoral college, and is head of the  executive branch. They are judges, district judges.\n\nI said this in committee. The real question ultimately is who gets to  decide: some district…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689717/no-rogue-rulings-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…delivered a clear  message that the Biden administration, which presided over 40-year high  inflation, was taking the country in the wrong direction. President  Trump received the electoral vote and the popular vote, and he won  every swing State. Republicans secured majorities in both the House and  the Senate.\n\nThis year, it has been up to the Republicans…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…worst President in our  country's history decided to institute these programs and destroy the  family. I am not sure that was the motive. I think perhaps the real  motive was electoral.\n\nOur forefathers, when they put together our founding documents,  warned us that there were going to be some politicians who were going  to try to make people dependent…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…Pennsylvania by  950 votes. That is 14 votes per county. I won my second election in  2024 by 15,000 votes--of over 7 million cast. These incredibly narrow  races, each of which had electoral issues of their own, show just how  important it is that our elections run smoothly, fairly, and that only  legitimate votes are counted. And right now, we cannot--we must…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…``Venezuela,  where actors linked to the regime of Nicolas Maduro have engaged in a  sustained and synchronized campaign of disinformation to undermine the  country's 2023-2024 electoral process, invalidate the results of such  elections, and attack Maria Corina Machado and other opposition  leaders.''\n\nMr. Speaker, pointing to the threat closer to home,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…For example, unions can bring removals before private arbitrators  instead of appealing to the Merit Systems Protection Board.\n\nThe Trump administration is exercising its electoral mandate to  address this problem.\n\nFor instance, the President has embarked on an ambitious overhaul of  the performance management system and is pursuing more streamlined…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…somehow had that effect.\n\nNow, our Democratic colleagues are simply unreconciled to the fact  that last November, voters gave Republicans a mandate. President Trump  won the electoral vote, the popular vote, and every single swing State,  and Republicans won the majorities in both Houses--in the Senate and in  the House of Representatives. And passing…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…standing up exclusively for judges, you are not having a checks-and- balances system. You are putting one single judge above the American  public's popular vote, let alone the electoral college.\n\nI am so glad that this House said that we are going to move forward  in a thoughtful way and not allow, again, one single judge, who is not  elected by the people,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690709/constitutional-crisis"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…authorization travel to go down to El Salvador and defend. I think that  she was very factual in everything she said, especially her criticism.\n\nMr. Speaker, President Trump's electoral mandate includes his promise  to the American people that Republicans would resolve the criminal  illegal alien crisis across our Nation.\n\nThis bill is a necessary step in…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692370/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…only 43 days in this office in his historic  Presidency, an incredible comeback victory--the comeback king, as I  call him from his ability to win this election. He won 312 electoral  votes, every one of the battleground States, and this President has not  wasted a second, a minute, an hour, or a day in office because he knows  how important it is to…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688471/joint-session-of-congress"}]