[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…raises the price for everybody.\n\nBy the way, for those of you who are listening, the ISO grid, like  almost all the others--the price at any given minute on the grid for  electricity is set by the highest cost plant that has to operate to  meet that level of demand. So if you can get that 9-cent cost to be the  highest cost, that is it for everybody,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699019/energy-costs"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…that are  going to see massive increases in their healthcare premiums; almost  every American is about to see a spike in their healthcare premiums,  just like they have seen electricity rates going up at double the rate  of inflation, just like they have seen the price of vegetables go up by  39 percent, just like they have seen shortages of lumber and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695916/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…point: The tariffs are not just about  raising the prices on the goods that we import; they are also driving  up prices across the board on all types of goods and services-- electricity costs. If we continue down this path, as I noted, the  average family will likely see a $2,000 increase per year.\n\nThis might not mean a lot to some of the President's friends…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…making.\n\nSince Trump announced his tariffs, the U.S. has lost 42,000  manufacturing jobs, tourism is tanking, and unemployment is on the  rise. Costs for everything from electricity to groceries to health  insurance are up, not down.\n\nIn fact, we are facing the biggest increase in health insurance costs  in 15 years, even as the cuts in this big, bad…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…largest cut to food assistance in U.S. history.  Premium hikes will cost Delawareans an average of $6,000 more a year in  healthcare. Cuts to energy investments are pushing up electricity  bills. New limits on student loan repayment hit working people hardest.  Interest rates are so high that they put the dream of a first home  further out of reach.\n\nDelawareans…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697421/delaware-day"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…home.\n\nThis bill is just another example of how Republicans have not brought  one single bill to the House floor that would lower energy costs for  hardworking families.\n\nElectricity bills are skyrocketing. It is getting harder and harder  for people to pay their utility bills. Now Republicans and the Trump  administration are making it worse. They have…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…direction. Donald Trump and congressional Republicans  have failed the American people. They promised to lower costs. Instead,  costs keep going up. Housing is more expensive. Electricity bills are  through the roof. Childcare costs keep rising.\n\nNow, Republican leadership, who love to extend tax breaks for  billionaires, are making things worse by, for months,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698673/protecting-healthcare-for-millions-of-americans"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…campaign that in  the first year he would cut power bills in half. Instead, they keep  climbing.\n\nRight now, thanks to the congressional Republicans' backward energy  policies, electricity prices are climbing more than twice as fast as  inflation. More than 80 million Americans are struggling to pay their  utility bills, with many having to make the impossible…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…set to surge in economies such as Saudi Arabia, Pakistan and       several Southeast Asian countries,'' Executive Director Fatih       Birol said. ``As renewables' role in electricity systems       rises in many countries, policymakers need to pay close       attention to supply chain security and grid integration       challenges.''\n\nThe report came…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…that quite literally, survive  the day--to find the calories within their $6 or $8 or $12 budget.\n\nFinally, people are going to pay hundreds of dollars more per year in  electricity because this bill throttles the cheapest and most abundant  form of energy in wind and solar. And this is where you have got to  stay with me for a moment.\n\nI am very passionate…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…have not gone down in the United  States of America. Costs have gone up. Inflation is on the way up.  Housing costs are out of control. Childcare costs are out of  control. Electricity bills are out of control. Grocery costs are out of  control. Healthcare costs are skyrocketing out of control because of  the Republican refusal to extend the Affordable…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697994/protect-americas-workforce-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…President  Trump was inaugurated, prices have gone through the roof. Grocery  prices, egg prices, meat prices, fish prices, and poultry prices are  all up even more than ever. Electricity costs are way up, along with  housing prices.\n\nMr. Speaker, the gentleman mentions American jobs. As I mentioned  earlier, I think it needs to be reiterated that American…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688293/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Palestinians a homeland, more specifically a  state. Palestinians have the right to live there with sovereignty, not  to be told what to do by others, not to have the flow of their  electricity controlled by others, not to have others determine whether  they can have ingress and egress. They have got to have a state.\n\nThat means there has to be some negotiation.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…to grow; and 17  years without the roughly $20 billion of economic impact on the  southwestern part of our country that we are finally seeing--because  the reality is that electricity is what powers our communities, our  innovation, our economies, and our lives. And electricity has powered  this country since the 1880s.\n\nBut, right now, we are facing…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698581/permitting-reform"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…beyond food prices. Thanks to this President,  Americans are now confronting higher utility bills. Just ask them. On  the campaign trail, the President promised to slash electricity prices  in half. ``Drill, baby, drill'' will take care of everything. It ain't  working. On average, Illinois households are paying more than $1,500  annually for lights…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life-changing mission.\n\nThe impact of WREC's work goes far beyond electricity; it represents  a bridge to connection, opportunity, and the return of future  generations to their ancestral homes. The emotional moment when power  was turned on for the…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692594/recognizing-clint-jackson"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…floods of 2016 in Louisiana, trying to keep that from happening again.\n\nThe $36 million to Ascension Parish is to fortify electrical  infrastructure. Hurricane comes along; electricity goes out. Of course,  no electricity, the whole community is incapacitated.\n\nTwenty million dollars to Lafourche Parish to strengthen 16 miles of  power lines; $10 million…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life-changing mission.\n\nThe impact of WREC's work goes far beyond electricity; it represents  a bridge to connection, opportunity, and the return of future  generations to their ancestral homes. The emotional moment when power  was turned on for the…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692515/recognizing-cody-thomas"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life-changing mission.\n\nThe impact of WREC's work goes far beyond electricity; it represents  a bridge to connection, opportunity, and the return of future  generations to their ancestral homes. The emotional moment when power  was turned on for the…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692424/recognizing-john-blaho"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…utilities in Colorado,  and that has happened during the last 4 years under Democrat control  both at the Federal and the State level.\n\nColoradans are paying 24 percent more in electricity now than they  were just 4 years ago, and it is easy to see why. The Colorado Public  Utilities Commission and statewide Democrats have been enacting one bad  policy after…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697881/state-planning-for-reliability-and-affordability-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life-changing mission. The impact of WREC's work  goes far beyond electricity; it represents a bridge to connection,  opportunity, and the return of future generations to their ancestral  homes. The emotional moment when power was turned on for the…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692461/recognizing-alan-sowerby"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…active mines.\n\nThe RMP amendment is a death blow to America's energy security,  Wyoming's workers, and the economic backbone of the State itself.\n\nIt is projected that U.S. electricity demand will grow by as much as  128 gigawatts through 2029, and global energy demand is expected to  double by 2050.\n\nCoal is reliable, affordable, and essential to meet…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Alabama and the entire southern United  States.\n\nClasses began on September 16, 1925, with 42 students enrolled in the  inaugural class. Four courses were available: printing, electricity,  bricklaying and cabinetmaking. All students lived in the newly  constructed dormitory equipped with modern conveniences such as steam  heat and plumbing that featured…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696575/recognizing-the-100th-anniversary-of-gadsden-state-community-college"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…electric grid.\n\nThe U.S. grid, commonly referred to as the greatest machine on Earth,  is a complex system compromised of myriad components and infrastructure  to deliver electricity that powers our economy and enables modern life  for households.\n\nTo ensure the timely delivery of electricity at all times of the day,  utilities have historically undergone…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697882/state-planning-for-reliability-and-affordability-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…percent of overall coal production in the entire  United States.\n\nCoal is reliable and affordable, and we know we are going to need  this critical resource of baseload power as electricity demands  continue to skyrocket. If your State has coal, we should be developing  it, not burying it under bureaucracy. No one produces coal cleaner or  more responsibly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Valero, which represent a significant chunk of our State's overall  refining capacity.\n\nNow, we already pay the highest gas prices of any State in the  country. We also have electricity prices that have gone up by 34  percent over the last several years, The New York Times just reported,  far more than any other State. We pay the highest gas prices out…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life-changing mission.\n\nThe impact of WREC's work goes far beyond electricity; it represents  a bridge to connection, opportunity, and the return of future  generations to their ancestral homes. The emotional moment when power  was turned on for the…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692601/recognizing-sean-mckillen"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…and driven economic growth throughout the Tennessee Valley.\n\nLocated in Florence, Alabama, Wilson Dam has 21 generating units,  capable of producing up to 663 megawatts of electricity and powering  over 350,000 homes and businesses in north Alabama.\n\nWilson Dam is a National Historic Landmark and an engineering feat.  It stretches nearly a mile--more…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695404/recognizing-wilson-dam-on-its-100th-anniversary"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…energy of the future, and under  the leadership of President Trump and this Congress, coal is rightfully  back in favor in Washington, D.C.\n\nCoal produced 16 percent of the electricity in this country last  year, and it is one of the most reliable and affordable forms of energy  that we have. It is imperative that we increase domestic production in  order…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695769/national-coal-council-reestablishment-act"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…bring reliable, high- speed fiber internet access to more than 100,000 residents in Northwest  Alabama.\n\nTombigbee Electric Cooperative was established to meet the need for  electricity among citizens in the rural areas of Northwest Alabama.  Since its founding in 1941, Tombigbee has demonstrated an unwavering  dedication to serving its community and strengthening…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696050/recognizing-the-tombigbee-electric-cooperatives-achievements"}]