[{"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "In fact, by  exporting LNG, we could be risking higher domestic natural gas prices,  meaning our constituents and our neighbors would face higher  electricity bills and pay more at the gas pump.", "title": "Unlocking Our Domestic Lng Potential Act of 2025", "date": "2025-11-20"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Electricity bills are  skyrocketing and out of control.", "title": "-9999", "date": null}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "According to the Energy Information Administration, residential  electricity bills have already increased by almost 10 percent since  President Trump took office.", "title": "Terminating the National Emergency Declared with Respect to Energy", "date": "2025-10-08"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Electricity bills are out of control, and the price  of groceries and everyday goods are completely out of control.", "title": "Providing for Consideration of H.R. Law-Enforcement Innovate to De-Escalate Act; Providing for Consideration of H.R. Undersea Cable Protection Act of Providing for Consideration of H.R. Securing America's Critical Minerals Supply Act; and for Other Purposes", "date": "2026-02-10"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "They are using their  power to subsidize dirty, expensive fossil fuel, all at the cost of  American families who are struggling to afford their electricity bills.", "title": "State Planning for Reliability and Affordability Act", "date": "2025-12-10"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "All this from a President who  promised to cut Americans' electricity bills in half.", "title": "Promoting Cross-Border Energy Infrastructure Act", "date": null}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Ripping away these credits means that instead of finishing  construction on clean power plants, Republicans will abandon billions  in sunk costs, leave half-built equipment, and electricity bills will  go up.", "title": "Rescissions Package: Corporation for Public Broadcasting", "date": "2025-06-11"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "Right now, 80 million Americans are struggling to pay their  electricity bills, and according to a recent report in The New York  Times, this bill will make it worse.", "title": "Big, Ugly Bill, Clean Energy Tax Credits.", "date": "2025-06-04"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Speaker, I include in the Record a document from the Joint  Economic Committee, as well as a link to the document located at:  https://www.jec.senate.gov/public/_cache/files/22e24fd6-4db7-44c6-93a9- 9710c6f48b85/electricity-bills-report.pdf          [From the Joint Economic Committee Minority, Nov.", "title": "Researching Efficient Federal Improvements for Necessary Energy Refining Act", "date": "2025-11-20"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "3632 would force old, expensive power plants to stay online for  up to five years after their scheduled retirement date, sending  already-high electricity bills through the roof.", "title": "Opposition to Permitting Bills", "date": "2025-12-12"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "People are paying more in electricity bills while Donald Trump has cut  domestic energy jobs.", "title": "Affordability", "date": "2025-12-10"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Electricity bills are out of control.", "title": "Breaking the Gridlock Act", "date": "2026-01-08"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "Electricity bills are  through the roof.", "title": "Protecting Healthcare for Millions of Americans", "date": "2026-01-08"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Electricity bills are out of control.", "title": "Protect America's Workforce Act", "date": "2025-12-11"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "If my colleagues care about public health, if they care about prices,  if they want to make sure people can breathe and can still pay their  electricity bills, I urge my colleagues to oppose this bill.", "title": "Reliable Power Act", "date": "2025-12-17"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Speaker, I urge my colleagues to support the legislation as it  will make our grid more reliable and lower America's electricity bills.", "title": "Guaranteeing Reliability Through the Interconnection of Dispatchable Power Act", "date": null}]