[{"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…men. It will become clear to you  that Trump and Republicans want to control who votes so they can remain  in power.\n\nThat is not democracy. That is destroying free, fair elections. It is  just another page from the authoritarian playbook, and we must have the  moral clarity in this place to stand against it, just like our  ancestors did.\n\nMr. Speaker,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700017/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…for election security grants by $30  million. I created that program, along with Bob Ney from Ohio, when we  passed the Help America Vote Act. We all want to make sure our  elections are run well. At that point in time, we distributed to the  States over $3 billion. This is $45 million for 50 States, not a lot of  money, but it is proper for the Federal…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699056/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "Ms. SIMON. Mr. Speaker, I thank the ranking member for yielding time.\n\nMr. Speaker, this bill doesn't secure elections. It shrinks the  electorate. I find it so interesting that in real time we are having  this conversation. When we talk about Black voters, we are going to  talk about Black…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699939/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Americans.\n\nIndeed, the Trump administration and congressional Republicans are  now advancing policies that could disqualify tens of millions of  Americans from voting in elections. If adopted, these policies will  make it harder for low-income individuals, the elderly, women, and even  U.S. servicemembers deployed overseas to cast a ballot. Now, that…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…consideration       of H.R. 2096--Protecting Our Nation's Capital Emergency Act;       H.R. 884--To prohibit individuals who are not citizens of the       United States from voting in elections in the District of       Columbia and to repeal the Local Resident Voting Rights       Amendment Act of 2022; H.R. 2056--District of Columbia       Federal Immigration Compliance…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692229/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…hearing it. I was witnessing officers with  their guns drawn, but I said to myself: Peter, this is the United  States of America. We have a peaceful transfer of power. We win  elections. We lose elections, but it is the people of this country who  decide who the winner is--not politicians, not a mob attacking the  Capitol.\n\nThis is a blessing that all of…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698518/anniversary-of-january-6"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "Mr. MULLIN. Mr. Speaker, free and fair elections are the foundation  of any functioning democracy. The SAVE Act is a blatant attempt to  undermine our election system, weaken American democracy, and unfairly  suppress millions…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690013/safeguard-american-voter-eligibility-act"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…today marks 16 years since the Supreme  Court handed down its disastrous Citizens United decision, a ruling  that opened the floodgates to unlimited corporate money in our  elections and fundamentally distorted our democracy.\n\nBy discarding decades of precedent, the Supreme Court declared that  unlimited spending in elections poses no threat to our democratic…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699237/restoring-election-integrity"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…Libyan Prime Minister, the group presented  solid evidence that a new Libya is in the making.\n\nThe new Libya is focused on creating circumstances that will make  free and fair elections a reality. The new Libya is taking concrete  steps to lessen long-standing tribal animosities that have divided the  country. The new Libya is committed to a unified country…", "date": "2025-12-05", "source_url": "https://justfacts.votesmart.org/public-statement/1697566/recognizing-the-importance-of-a-new-libya"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…7--Mr. President, I  ask unanimous consent to have this Brennan Center article printed in  the Record.\n\nDark money groups, nonprofits and shell companies that spend       on elections without revealing their donors, plowed more than       $1.9 billion into last year's election cycle, a dramatic       increase from the prior record of $1 billion in 2020.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…who have voted legally for years to prove  their citizenship if they not only change their name but if they move.  A simple move requires them to drive to a county board of elections and  prove that they are an American citizen when they have proven that over  the course of 20 years or more of voting.\n\nThis bill subjects local officials to hefty criminal…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690010/safeguard-american-voter-eligibility-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…prioritize  their local resources for their local public safety.\n\nSo, for the sake of the American people's safety and well-being, I  object.\n\nMr. PADILLA. Mr. President, elections are the bedrock of our American  democracy, and despite what the President and his big circle of  election-denying, conspiracy theorists would have Americans believe,  the…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…believe it has been 16 years since our politics were  upended, since the floodgates were opened to corporate money in an  unlimited way, in an anonymous way, coming into our elections.\n\nSenator Durbin, of course, has been a hero, as he mentioned spending  much of his career trying to introduce legislation and pass legislation  that would put citizens in…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699117/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Nikema Williams", "party": "Democrat", "sentence": "…is back  before the House today, and right along with it is yet another attempt  at voter suppression. It is no coincidence that this is happening right  before the midterm elections.\n\nIn January, the FBI raided the Fulton County election office, my home  county, where I am a voter. That raid was a bold attempt to intimidate  voters in the Fighting Fifth.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700000/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Nation's Capital to remove bad actors who       undermine that trust.\n\nWe also oppose H.R. 884, which would repeal a 2022 law       extending voting rights in local District elections to non-      citizen residents. Non-citizens enjoy similar voting rights       in 15 other jurisdictions, including San Francisco and       Oakland, California, Montpelier,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Mr. HARIDOPOLOS. Mr. Speaker, elections matter.\n\nIsn't it refreshing to see a President who actually keeps his  campaign promises? He promises not only safety but also economic  opportunity.\n\nOn the safety front,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692814/elections-matter"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…were coming out of Venezuela. It was because of a lot of  things that this took place.\n\nDoes the President have a plan for the future? He does, 100 percent:  free and fair elections, freedom for the people of Venezuela. Ask the  people of Venezuela if that is what they want. Ask the people of  Venezuela if they are better today than they were before…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Anna Luna", "party": "Republican", "sentence": "…and this is  somehow going to fix the midterms. However, the fact is that if we are  going to play that game, then you would want voter ID and you would  want to secure the elections.\n\nSo please support this legislation.\n\nI do not believe that Barack Obama in showing his voter ID was  engaging in Jim Crow-era law or pushing that type of perspective. And…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700010/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…administration.\n\nThey had all the power to make this country move in the right  direction when Democrats controlled all of Congress and the White House  following the 2020 elections. They had the ability to make those  changes, but they took the country in the wrong direction.\n\nThat is why the country, at the ballot box, made the changes that  they made.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…six, the sanctuary State disgrace;  number seven, failing public schools; number eight, manmade water  shortages; number nine, catastrophic wildfires; and number 10, chaotic  elections.\n\nThe good news is we have made significant progress when it comes to  each of those 10 items.\n\nWhen it comes to EV mandates, just about a week and a half ago, the  Senate…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…Florida. Mr. Speaker, I rise today in support of the  Safeguard American Voter Eligibility Act, or the SAVE Act.\n\nThe SAVE Act is an important step forward that will ensure elections  are more secure and accurate across the United States.\n\nThe vast majority of Americans agree that only U.S. citizens should  have the right to vote in our elections. Just…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689997/safeguard-american-voter-eligibility-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Democrats, particularly in the Senate.\n\nHow many Democrats, when we passed it out of the House before, voted  with us?\n\nMr. SCHWEIKERT. Let's save America. Let's protect our elections.\n\nI will give you one last concept, being someone from Arizona. How do  you protect a republic if your citizens don't trust the institutions  and don't trust elections? So…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…example of political expediency  than my Democrat colleagues opposing a voter ID law on the grounds of  States' rights.\n\nFirst, the Constitution is clear. Rules for running elections have  been delegated to the States. But in that same provision, the  Constitution says Congress may at any time alter the process. I  certainly think our Founding Fathers…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700003/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…interesting to see, when  we talk about--look, quite honestly, it is a travesty to me that we  should have to pass such a bill that only American citizens vote in  American elections. That should be obvious.\n\nYou don't invite some person from some other State or some other town  into your home to ask them about your important family decisions. Yet,  somehow…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…increase, trade ties between       Georgia and Russia;\n\n(6) to continue supporting the ongoing development of       democratic values in Georgia, including free and fair       elections, freedom of association, an independent and       accountable judiciary, an independent media, public-sector       transparency and accountability, the rule of law, countering…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…hypothetical concern. It is a matter of  protecting the value of everyone's choice.\n\nThe SAVE America Act is guided by one simple principle: Only  Americans should decide American elections.\n\nAcross this country, we have seen noncitizens identified on voter  rolls. This is a vulnerability we can no longer afford to ignore. By  passing this act, we provide the…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699946/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Glover, Asha: Law360; Godfrey, Elaine:       Atlantic Monthly; Goldberg, Jeffrey: Atlantic Monthly;       Golden, Ryan: Informa TechTarget; Gonzales, Nathan: Inside       Elections; Gonzalez, Gloria: Politico; Goodman, Jasper:       Politico; Goslin, JoAnn: Bloomberg Industry Group; Gould,       Joseph: Politico; Goyal, Raghubir: Asia Today; Graham,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698171/members-entitled-to-admission-to-the-119th-congress-periodical-press-gallery"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…illegal. We don't need another law.\n\nMr. Speaker, it is already illegal for a minor to purchase alcohol.  Yet the clerk says: Please show me your ID.\n\nAmerica is hungry for fair elections. I don't think it is too much to  ask that we show an ID to restore election integrity. Let's give  America what they want.\n\nFor all those who say that it is too much to…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699999/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…as part of a Republican  bill, my colleagues, for some reason, don't remember their position in  2017 and call it trash.\n\nCould it be mere political posturing for November elections? I submit  it is.\n\nMr. GRIFFITH. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, the gentleman is absolutely correct on this one…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…other side of the aisle were searching for a  reason for voters to support them next November. They were searching  for a cause.\n\nWe know this because there were intervening elections and a lot of  rhetoric but no results. We are here right now, with Democrats having  joined Republican Senators to send a bill over here to fund government  through the end…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696681/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}]