[{"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…fueling our adversaries. In fact, by  exporting LNG, we could be risking higher domestic natural gas prices,  meaning our constituents and our neighbors would face higher  electricity bills and pay more at the gas pump.\n\nThat is why I planned on introducing legislation requiring DOE to  certify that LNG exports to our foreign adversaries are actually in…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697082/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…living. Donald Trump promised that costs would go down on  day one. Costs have not gone down. They are going up. Inflation is on  the way up. Life has gotten more expensive. Electricity bills are  skyrocketing and out of control. Now, healthcare premiums are on the  verge of increasing by thousands of dollars a year for 20 million  Americans unless Republicans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695292/9999"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…around in the headlines, the real story,  the real impact is in your budget. It is in your electric bill.\n\nAccording to the Energy Information Administration, residential  electricity bills have already increased by almost 10 percent since  President Trump took office. Household energy costs are expected to  increase by another $170 annually by 2035 thanks…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Mr.  Speaker, costs haven't gone down. Costs have gone up. Housing costs are  out of control. Healthcare costs are out of control. Childcare costs  are out of control. Electricity bills are out of control, and the price  of groceries and everyday goods are completely out of control.\n\nOne of the reasons why the cost of living continues to crush the  American…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699898/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…clean energy to the grid. They are using their  power to subsidize dirty, expensive fossil fuel, all at the cost of  American families who are struggling to afford their electricity bills.\n\nNow, if you don't believe me, just ask Secretary Chris Wright. At an  Energy and Commerce Committee hearing in June, he was blunt. The  Secretary said: ``I have never…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…in  electricity bill rate hikes that utilities have requested just since  the start of President Trump's term. All this from a President who  promised to cut Americans' electricity bills in half. That is just one  of President Trump's broken promises.\n\nPresident Trump and House Republicans also claim to care about China,  particularly about beating China…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…away these credits means that instead of finishing  construction on clean power plants, Republicans will abandon billions  in sunk costs, leave half-built equipment, and electricity bills will  go up. Utility companies are expecting major rate hikes if these  credits vanish because, without them,  they will be forced to rely on more expensive, unstable,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692414/rescissions-package-corporation-for-public-broadcasting"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…like healthcare and food assistance. Perhaps less  discussed is that it will increase your energy bills.\n\nRight now, 80 million Americans are struggling to pay their  electricity bills, and according to a recent report in The New York  Times, this bill will make it worse.\n\nThe big, ugly bill ends tax credits to promote clean energy and will  increase…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691967/big-ugly-bill-clean-energy-tax-credits"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…from the Joint  Economic Committee, as well as a link to the document located at:  https://www.jec.senate.gov/public/_cache/files/22e24fd6-4db7-44c6-93a9- 9710c6f48b85/electricity-bills-report.pdf          [From the Joint Economic Committee Minority, Nov. 2025]\n\nState-by-State Data: Annual Electricity Bills Up $100 Per Family in…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…environmental rules.\n\nH.R. 3632 would force old, expensive power plants to stay online for  up to five years after their scheduled retirement date, sending  already-high electricity bills through the roof.\n\nMr. Speaker, these bills do not exist in a vacuum. We are considering  these bills in the wake of Trump Administration actions to cancel and  stall…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698075/opposition-to-permitting-bills"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…That is an F. Today, Americans pay 40 percent more for a single cup of  coffee on their way to work than they did last year. That is an F.  People are paying more in electricity bills while Donald Trump has cut  domestic energy jobs. That is a massive F. People are paying more for  clothing, more for produce. And this week, our farmers had to be bailed…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697816/affordability"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…together to address the  affordability crisis in this country. It is not a hoax. It is very  real.\n\nHousing costs are out of control. Grocery costs are out of control.  Electricity bills are out of control. Childcare costs are out of  control. Healthcare costs are out of control.\n\nWhat we do here today will not be the end of the effort that is  necessary,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698795/breaking-the-gridlock-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…direction. Donald Trump and congressional Republicans  have failed the American people. They promised to lower costs. Instead,  costs keep going up. Housing is more expensive. Electricity bills are  through the roof. Childcare costs keep rising.\n\nNow, Republican leadership, who love to extend tax breaks for  billionaires, are making things worse by, for months,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698673/protecting-healthcare-for-millions-of-americans"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…not gone down in the United  States of America. Costs have gone up. Inflation is on the way up.  Housing costs are out of control. Childcare costs are out of  control. Electricity bills are out of control. Grocery costs are out of  control. Healthcare costs are skyrocketing out of control because of  the Republican refusal to extend the Affordable Care…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697994/protect-americas-workforce-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…just  one piece of that.\n\nIf my colleagues care about public health, if they care about prices,  if they want to make sure people can breathe and can still pay their  electricity bills, I urge my colleagues to oppose this bill. It just  makes common sense.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…and raise costs on consumers  along the way.\n\nMr. Speaker, I urge my colleagues to support the legislation as it  will make our grid more reliable and lower America's electricity bills.\n\nMr. GUTHRIE. Mr. Speaker, I thank Congressman Balderson for  sponsoring the GRID Power Act.\n\nMr. Speaker, this is part of the strategy we all have to do to  produce…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695753/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}]