[{"senator": "Chris Murphy", "party": "Democrat", "sentence": "…that citizens can no longer hold the  Executive accountable; dismantled so that the political opposition  never has enough room to maneuver meaningfully.\n\nThere are still elections. The Executive doesn't try to stuff the  ballot box. Occasionally, at lower levels, the opposition still wins.  But what happens is that those structures of accountability…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, I introduce the District of Columbia  Special Elections Home Rule Act. This bill would give the District of  Columbia complete authority to set the date of special elections for  local offices, like other jurisdictions. This bill…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697291/introduction-of-the-district-of-columbia-special-elections-home-rule-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…jurisdiction. The Act also repeals the provision of federal       law that establishes the current mechanism for District       residents to participate in presidential elections, pursuant       to Congress's authority under the Twenty-Third Amendment; and       provides for expedited consideration of the repeal of that       Amendment.\n\nThe Admissions…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Ms. JOHNSON of Texas. Mr. Speaker, the SAVE America Act makes it  harder for Americans to vote. As a member of the Subcommittee on  Elections, my responsibility is to protect access at the ballot box,  not to restrict it.\n\nThat is why I offered several comments and amendments to preserve  online voter registration,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699934/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…different ways.\n\nSo I would just ask: Did you hear my distress that Trump could use  this information to attack his opponent? Could he use this information  to disrupt the elections in '26 as a path to further authoritarian  influence in the United States?\n\nMr. REED. If the Senator would yield?\n\nMr. REED. DOGE, it has been my observation, has pilfered…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696343/trump-administration"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…contravenes the purpose  of the Home Rule Act.\n\nD.C.'s Local Resident Voting Rights Amendment Act of 2022 allows D.C.  residents who are not yet U.S. citizens to vote only in local  elections--namely, for Mayor, members of the city council, the State  Board of Education, attorney general, advisory neighborhood  commissioner, and ballot measures.\n\nThe D.C. law…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692318/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…pediatric cancer researchers in my district, Forest  Service, and firefighters. They are getting run out of town now. I  don't hear a lot about Elon Musk. He has lost some elections for my  friends across the aisle, so they are trying to let him sink into  anonymity, but he has done his damage.\n\nOver at the Department of Justice--and I have got to correct…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…today marks 16 years since the Supreme  Court handed down its disastrous Citizens United decision, a ruling  that opened the floodgates to unlimited corporate money in our  elections and fundamentally distorted our democracy.\n\nBy discarding decades of precedent, the Supreme Court declared that  unlimited spending in elections poses no threat to our democratic…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699237/restoring-election-integrity"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…it all is the influence of big money in politics. That is because  Citizens United opened the door for corporations and billionaires to  dump untold sums of money on to our elections anonymously and calling  corporations people.\n\nMr. Speaker, corporations are not people. The American people are  whom we represent. It is not the corporations, not the billionaires,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699236/restoring-election-integrity"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…prioritize  their local resources for their local public safety.\n\nSo, for the sake of the American people's safety and well-being, I  object.\n\nMr. PADILLA. Mr. President, elections are the bedrock of our American  democracy, and despite what the President and his big circle of  election-denying, conspiracy theorists would have Americans believe,  the…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…matter are not the 730,000  constituents that they have but Donald Trump, Stephen Miller, and Elon  Musk, as long as he and Donald Trump are getting along and paying for  elections.\n\nCongress' power is critical in this moment. Congressman Johnson said  it so beautifully. We have to do everything in our power to ensure that  our constituents know who…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…political  spending by corporations and billionaires. We said it at the time, and  it has come true: The decision has unleashed unprecedented spending by  dark money groups on our elections. Now campaigns are often defined not  by a candidate's record or their ideas but, rather, by their access to  dark money.\n\nThe wealthiest individuals and corporations can…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…consideration       of H.R. 2096--Protecting Our Nation's Capital Emergency Act;       H.R. 884--To prohibit individuals who are not citizens of the       United States from voting in elections in the District of       Columbia and to repeal the Local Resident Voting Rights       Amendment Act of 2022; H.R. 2056--District of Columbia       Federal Immigration Compliance…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692229/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…hearing it. I was witnessing officers with  their guns drawn, but I said to myself: Peter, this is the United  States of America. We have a peaceful transfer of power. We win  elections. We lose elections, but it is the people of this country who  decide who the winner is--not politicians, not a mob attacking the  Capitol.\n\nThis is a blessing that all of…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698518/anniversary-of-january-6"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…democracy, and who we are as a people. I thank Senators Klobuchar  and Bennet for participating as well and all the others who did as  well.\n\nWell, we know that free and fair elections are the very wellspring of  American democracy. When you ask people around the world ``What is  great about America?'' this is one of the first things they say: ``They  have…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690523/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Glover, Asha: Law360; Godfrey, Elaine:       Atlantic Monthly; Goldberg, Jeffrey: Atlantic Monthly;       Golden, Ryan: Informa TechTarget; Gonzales, Nathan: Inside       Elections; Gonzalez, Gloria: Politico; Goodman, Jasper:       Politico; Goslin, JoAnn: Bloomberg Industry Group; Gould,       Joseph: Politico; Goyal, Raghubir: Asia Today; Graham,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698171/members-entitled-to-admission-to-the-119th-congress-periodical-press-gallery"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…were coming out of Venezuela. It was because of a lot of  things that this took place.\n\nDoes the President have a plan for the future? He does, 100 percent:  free and fair elections, freedom for the people of Venezuela. Ask the  people of Venezuela if that is what they want. Ask the people of  Venezuela if they are better today than they were before…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Anna Luna", "party": "Republican", "sentence": "…and this is  somehow going to fix the midterms. However, the fact is that if we are  going to play that game, then you would want voter ID and you would  want to secure the elections.\n\nSo please support this legislation.\n\nI do not believe that Barack Obama in showing his voter ID was  engaging in Jim Crow-era law or pushing that type of perspective. And…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700010/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…analyzing surveys and CRM systems, while fostering cooperative  relationships. Her ability to work seamlessly with congressional  offices, staff, constituents, and local boards of elections has made  her an indispensable partner in addressing the needs of the community.\n\nHer dedication has been recognized through multiple awards, including  the USPS Outstanding…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695488/recognizing-the-contributions-of-trellis-maddalena"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…in our State to 3 Members out  of 52, so that Republicans will hold 6 percent of the seats even though  Republicans typically get over 40 percent of the vote in statewide  elections. It could be the single most egregious act of corruption in  the history of our State.\n\nMr. Speaker, you don't need to take my word for that. You can take  the word of Common…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694130/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…with Venezuela. What does that mean?  Our issue is not with Venezuela as a country but with Nicolas Maduro,  the narcotrafficker who hijacked that country after he stole the  elections last year. Under the Law of Armed Conflict, we can use  military force to stop his drug cartel from flooding the streets of the  United States.\n\nAccording to article 29 of…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698241/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Democrats, particularly in the Senate.\n\nHow many Democrats, when we passed it out of the House before, voted  with us?\n\nMr. SCHWEIKERT. Let's save America. Let's protect our elections.\n\nI will give you one last concept, being someone from Arizona. How do  you protect a republic if your citizens don't trust the institutions  and don't trust elections? So…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "Mr. CORNYN. Madam President, America is an exceptional nation:  freedom of religion, freedom of speech and of the press; private  property rights; free and fair elections; the rule of law and an  independent judiciary. All of these help make us exceptional, but we  Americans often take this for granted because these principles, these  values,…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…diluted the voting power that is reserved for only American  citizens. This crisis is not only a national security concern but one  that can seriously alter the outcome of our elections.\n\nJust this past election cycle, both the States of Alabama and  Virginia removed thousands of registered voters who were not American  citizens. Securing our elections is…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690005/safeguard-american-voter-eligibility-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…increase, trade ties between       Georgia and Russia;\n\n(6) to continue supporting the ongoing development of       democratic values in Georgia, including free and fair       elections, freedom of association, an independent and       accountable judiciary, an independent media, public-sector       transparency and accountability, the rule of law, countering…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…as part of a Republican  bill, my colleagues, for some reason, don't remember their position in  2017 and call it trash.\n\nCould it be mere political posturing for November elections? I submit  it is.\n\nMr. GRIFFITH. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, the gentleman is absolutely correct on this one…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…the bill (H.R. 22) to amend       the National Voter Registration Act of 1993 to require proof       of United States citizenship to register an individual to       vote in elections for Federal office, and for other purposes.       All points of order against consideration of the bill are       waived. The bill shall be considered as read. All points…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…illegal. We don't need another law.\n\nMr. Speaker, it is already illegal for a minor to purchase alcohol.  Yet the clerk says: Please show me your ID.\n\nAmerica is hungry for fair elections. I don't think it is too much to  ask that we show an ID to restore election integrity. Let's give  America what they want.\n\nFor all those who say that it is too much to…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699999/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…lawsuits. I find it  ironic because it is Democrats who sue States and sue Republican  parties over congressional lines and apportionment and all those things  that tie our U.S. elections up in lawsuits. It is their party, not  ours. We are just fighting back. We are going to protect every woman  and girl, every single daughter in the United States, but particularly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…fact, Police  Week, but we have been busy this year, this Congress delivering for the  American people.\n\nIn this Congress so far, we have passed legislation to secure our  elections, H.R. 222, the SAVE Act; hold rogue activist judges  accountable, H.R. 1526; bring transparency to institutes of higher  education, H.R. 1048; make changes to our border…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}]