[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…in  premiums and with the rise in inflation we have seen since January of  this year, households are trying to decide whether they take care of  healthcare or groceries or electricity.\n\nAnd the sad truth is that we could have worked this out. We could  have done this in the bill passed earlier this year. Congress could be  working right now, even, on…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696494/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…the  legislation to reopen the government should have included provisions to  lower escalating healthcare costs. Lowering costs overall, from  healthcare to groceries to electricity, is the top priority for  Minnesotans and for me. The Nation is facing a healthcare crisis that  will raise costs and threaten access to healthcare for many Minnesotans…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696995/hr-5371"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…President  Trump was inaugurated, prices have gone through the roof. Grocery  prices, egg prices, meat prices, fish prices, and poultry prices are  all up even more than ever. Electricity costs are way up, along with  housing prices.\n\nMr. Speaker, the gentleman mentions American jobs. As I mentioned  earlier, I think it needs to be reiterated that American…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688293/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…discussing how we could lower the cost of living. I wish in the Energy  and Commerce Committee, where we are controlling the time, we could  discuss a bill that will lower electricity prices for our neighbors  back home. Or even as the title of this bill suggests, it is related to  critical minerals, but when you read the bill, Mr. Speaker, the text of…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…that are  going to see massive increases in their healthcare premiums; almost  every American is about to see a spike in their healthcare premiums,  just like they have seen electricity rates going up at double the rate  of inflation, just like they have seen the price of vegetables go up by  39 percent, just like they have seen shortages of lumber and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695916/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…campaign that in  the first year he would cut power bills in half. Instead, they keep  climbing.\n\nRight now, thanks to the congressional Republicans' backward energy  policies, electricity prices are climbing more than twice as fast as  inflation. More than 80 million Americans are struggling to pay their  utility bills, with many having to make the impossible…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…back home, to  hardworking American families. If you haven't ordered your gas turbine  now, you are not getting it this decade.\n\nThe only way we are going to meet growing electricity demand in the  next few years is through cleaner, cheaper power that is waiting to  come onto the grid--wind, batteries, distributed energy sources, demand  response, grid-enhancing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695752/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…3628. I think we all know  that our neighbors are really struggling with higher electric bills.  They are really grappling with how to pay these higher costs.\n\nHousehold electricity prices across America are up by 13 percent this  year--17 percent in North Carolina and 15 percent in the State of  Georgia. Folks really are at their wits' end because…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697883/state-planning-for-reliability-and-affordability-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…Canadians do not want  to come to the United States of America.\n\nWhat are the people getting in return? I will tell my colleagues what  they are getting. They are getting higher electricity costs during one  of the coldest winters in modern history. They are getting higher food  prices and higher costs for industrial goods and healthcare.\n\nMr. Speaker, this…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…and keep their  lights on and all the rest of it.\n\nAll of that is out the window. Why? Because clean is cheap and cheap  is clean. Clean energy is now the cheapest kind of electricity that we  can get on the grid in any kind of reasonable timeframe.\n\nThere was a time where it was coal. That is definitely more expensive  now. There was a time where it…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699020/energy-costs"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…in air  transportation.\n\nFor millions of Americans, it is a crisis of affordability. Nobody in  America needed Tuesday's elections to tell them that the cost of rent  and electricity and food and all the other necessities in life are  spiraling out of control.\n\nAnd, yes, healthcare costs are spiraling out of control. They are at  the kitchen table right…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696612/9999"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…be able to discriminate against  renewable power, continuing Trump's war against clean, cheap energy,  and Republicans are trying to kill off the only realistic source of  electricity growth and of our Nation. That is clean energy. There is  nothing here more complicated than that. That is what they are trying  to do, kill clean energy.\n\nIt is a real…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695754/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…to grow; and 17  years without the roughly $20 billion of economic impact on the  southwestern part of our country that we are finally seeing--because  the reality is that electricity is what powers our communities, our  innovation, our economies, and our lives. And electricity has powered  this country since the 1880s.\n\nBut, right now, we are facing…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698581/permitting-reform"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…making it more difficult for them to  access what is now one of the cheapest forms of energy.\n\nOh, yes, there was a prediction. We predicted it on the floor in  March that electricity prices were going to go up, and then others,  when the bill passed, predicted it, but by July 24, it wasn't just a  prediction.\n\nNewsweek:\n\nElectricity prices are soaring…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the decisions made  by the signing of this bill.\n\nThis bill kills solar, wind, and EV tax credits enjoyed by companies  and consumers alike, all but ceding the future of electricity to China  and risking billions of dollars of investments in renewable energy-- ironically, mostly in Republican States.\n\nWhile working families grapple with the consequences…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693251/one-big-beautiful-bill-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…from buying up America's farmland.\n\nIt also makes investments in rural development programs at USDA. In  South Dakota, that money goes far in supporting water programs,  electricity, and broadband programs in rural areas.\n\nThis bill also invests in conservation programs, and it advances  efforts to help farmers and ranchers get their products to the…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693501/agriculture-appropriations"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…and in illiteracy. In  the achievement gaps at our schools, we are among the very worse. We  are number one in gas prices. We are number one, or near it, in the  cost of electricity and the cost of water.\n\nThese things don't happen just randomly or by accident. They are the  result of failed policy choices. If this redistricting sham moves  forward,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life-changing mission.\n\nThe impact of WREC's work goes far beyond electricity; it represents  a bridge to connection, opportunity, and the return of future  generations to their ancestral homes. The emotional moment when power  was turned on for the…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692601/recognizing-sean-mckillen"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…annually.\n\nTo put this in perspective, North Dakota produces enough natural gas  to heat 15 million homes for an entire year, equivalent to 100 billion  kilowatt hours of electricity.\n\nU.S. electricity consumption is projected to hit an all-time high  this year, and electricity demand will grow by as much as 128 gigawatts  through 2029. Fueled by new…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…in the United States. We have the highest taxes. We have the highest  cost of housing of any State other than Hawaii. We have the highest gas  prices. We have the highest electricity prices, including the highest  increase in electricity prices during Newsom's tenure as Governor  compared to any other State. We are among the top two or three in the…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…floods of 2016 in Louisiana, trying to keep that from happening again.\n\nThe $36 million to Ascension Parish is to fortify electrical  infrastructure. Hurricane comes along; electricity goes out. Of course,  no electricity, the whole community is incapacitated.\n\nTwenty million dollars to Lafourche Parish to strengthen 16 miles of  power lines; $10 million…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…transportation, and energy. It all exploded on their  watch when they ran three Houses of government.\n\nEnergy prices surged roughly 20 percent. In many parts of the  country, electricity rates rose 30 percent. Democrats didn't just miss  the problem. They caused it, and then they put their hands over their  face and pretended like everything was okay.\n\nThose…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…energy strategy.\n\nI am proud to be the original author of the wind production tax  credit. When Congress enacted that credit in 1993, less than one-tenth  of 1 percent of U.S. electricity production came from wind. Today, it  is over 10 percent. And in my home State of Iowa, it is over 60  percent. Wind development has been an unquestionable success.\n\nMy…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694089/one-big-beautiful-bill-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…supply, we risk ceding leadership in  the next-generation economy to China, while raising costs on American  households along the way.\n\nWe are seeing the demand for reliable electricity affect nearly every  industry. At the end of the day, electricity policy is technology  policy, and electricity policy is manufacturing policy.\n\nThere is one source of reliable…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life-changing mission.\n\nThe impact of WREC's work goes far beyond electricity; it represents  a bridge to connection, opportunity and the return of future  generations to their ancestral homes. The emotional moment when power  was turned on for the…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692641/recognizing-jose-santiago"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…it comes to  powering our future. This pivotal moment will shape our economic  trajectory, national security, and global competitiveness.\n\nAfter years of modest growth in electricity consumption, the next 5  years could see upwards of 128 gigawatts of new demand. The vast  majority of this demand growth will require new, baseload, dispatchable  power,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698073/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life-changing mission. The impact of WREC's work  goes far beyond electricity; it represents a bridge to connection,  opportunity, and the return of future generations to their ancestral  homes. The emotional moment when power was turned on for the…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692461/recognizing-alan-sowerby"}, {"senator": "John Thune", "party": "Republican", "sentence": "…we simply don't have the supply to meet the demand.\n\nThe Washington Post noted last March:\n\nVast swaths of the United States are at risk of running       short of power as electricity-hungry data centers and clean-      technology factories proliferate around the country, leaving       utilities and regulators grasping for credible plans to       expand…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688403/joint-session-of-congress"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…natural gas.\n\nOver 60 percent of Americans every day heat their homes, their water,  or their food with natural gas. Natural gas is responsible for over 40  percent of the electricity generation and fuels more than half of our  industrial sector's process heat.\n\nWhile the natural gas tax fails to recognize this reality, let's look  at what is  true. Fracking…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688160/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…Speaker, I rise in support of the bipartisan Tennessee Valley  Authority Transparency Act.\n\nTVA is a congressionally chartered American public power company that  provides electricity to over 10 million people in Tennessee and six  surrounding States.\n\nDespite TVA's significant role in our daily lives, it holds most of  its meetings behind closed doors.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692212/tennessee-valley-authority-transparency-act-of-2025"}]