[{"senator": "Kathy Castor", "party": "Democrat", "sentence": "…combustion, costs go up, and so do pollution and health risks,  especially along the Gulf Coast.\n\nNow, let's talk about point number two. Mr. Speaker, if higher costs  in electric bills are not going to convince you to vote against this  bill, then I hope that America's national security will. Republicans  and the gas industry and their lobbyists want…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…two decades.\n\nThis is something I believe everyone in this Chamber, Republicans and  Democrats alike, can agree on: Congress must do more to cover the  crushing costs of electric bills, groceries, prescription drugs,  housing, and more.\n\nWhile I would love to take a full hour today running through what we  can and should do on all these crises, I have…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699582/stop-the-republican-affordability-crisis"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…right. It is ridiculous, isn't it? It is so out of touch.\n\nThe President promised he was going to cut Americans' power bills in  half, but since he took office last year, electric bills are up by 13  percent across the country, and they are much higher in some places.  There are 80 million Americans who are struggling just to pay their  electric bills.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698568/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…households are paying a thousand dollars more in  2025, and it is going to go up in 2026.\n\nLet's talk about electricity prices. Families across the country are  opening their electric bills and asking: Why is my bill so high, and is  anyone doing anything to bring down these prices?\n\nThe Trump administration promised Americans they would cut costs,  including…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699895/prices-are-too-high"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…speculators and billionaires, not our families living on Main Streets  and in our barrios. He is not even trying to hide it anymore.\n\nMeanwhile, utility bills are surging; electric bills are up 13  percent; and residential gas prices are up nearly 60 percent. This  administration canceled clean energy projects that could have powered  13 million homes,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699586/stop-the-republican-affordability-crisis"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…thank Ranking Member Pallone  for yielding the time.\n\nMr. Speaker, I rise in opposition to H.R. 3616. It is another  Republican bill that fails to address skyrocketing electric bills that  are a part of the overall affordability squeeze that is gripping the  country right now.\n\nWhat should we be doing on the floor of the House right now?\n\nWe should…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…of members from the oil  and gas industry, to create a report that says that the United States  needs more oil and gas. I fear that what this is a recipe for is higher  electric bills and higher costs for hardworking Americans who already  are being crushed by higher bills.\n\nThere are unbiased public servants who could write this report--for  example,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697027/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…absolutely disappointed, but not surprised, that the House  majority continues to hide the impacts of their big, ugly bill and  block Americans from seeing how it raises their electric bills.\n\nI came to Congress to lower high costs, and I will not stop working  to lower energy costs for hardworking Americans.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694884/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…problems facing  working families across the country: affordability, the escalating  costs of the overheating climate, what that is doing, higher insurance  costs, and higher electric bills because their summers are longer and  more intense. Back in the Tampa Bay area, we are trying to rebuild from  the most devastating hurricane season that we have ever experienced.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688544/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…getting  jostled, and then you reach back and your wallet is gone? That is  exactly what is happening right here.\n\nI hope that Republicans join Democrats in trying to reduce electric  bills, but no. I hope that Republicans are going to stand up to Elon  Musk as he takes a chain saw to Social Security, but no. Today, the  Republicans don't even want to address…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…time and thank her for everything that she does to protect  the pocketbooks of American families.\n\nMr. Chairman, American families and small business owners deserve  lower electric bills, but Republicans in Congress are really sticking  it to folks with higher costs at every turn, especially in this  spending bill.\n\nMr. Chairman, Representative Kaptur is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694853/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…energy kill switch. Solar jobs will vanish. Wind  jobs will vanish. Manufacturing jobs will go to China, just the  opposite of what the President says he wants. And people's electric  bills will go up.\n\nSo America, when your electric bill starts going up, talk to Donald  Trump, talk to the Republicans in the House, and please talk to the  Republicans in the…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…LANDSMAN. Mr. Speaker, America has become unaffordable for so  many Americans. Many families, if not most families, are now struggling  to pay their bills, including their electric bills. Congress should be  focused entirely on lowering costs.\n\nThe bill does not do that, unfortunately. It is not about securing  critical minerals. It gives the Department…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699995/securing-americas-critical-minerals-supply-act"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…health, but it also threatens our  very way of life. As heat waves get worse, roadways will crack, energy  grids will falter, and crops will dry out. Insurance rates and electric  bills will spike.\n\nSome Arizonans saw triple-digit increases on their electric bills  this summer. More evictions will follow. Frontline workers will stay  home or end up hospitalized.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695656/extreme-heat-caucus"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…expensive, and we have cheaper, cleaner options.\n\nI really thought that President Trump and Republicans campaigned on  lowering costs. Well, more coal power means higher electric bills. I  don't know about you, but I think Americans are already paying too much  for electricity.\n\nOnce again, Republicans are selling out their own constituents to  boost…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695768/national-coal-council-reestablishment-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…nothing more costly than green visions that drive out  affordable power for expensive overbuilding of weather-dependent  generation and backup power. That is why these electric bills are  rising.\n\nMr. Speaker, we cannot afford to let radical rules destroy  reliability in our great Nation. H.R. 3616 provides a way to adjust  proposed rules to absolutely…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698274/reliable-power-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…but ample  and safe fuel for this country in order to get groceries to the grocery  store, either through diesel or gasoline.\n\nPrices matter. It hurts families when their electric bills are high  and when their grocery bills are high because people have to eat and  they have to have a safe and clean place to live. This is what this is  about. This is what…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}]