[{"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…time for our country, and it comes at a time of increasing  political violence. There have been assassination attempts, kidnapping  plots, arson, and insurrection.\n\nAs elected Representatives for the people of the United States of  America, we have to take responsibility for our roles in this moment.  As elected leaders, we play a prominent role in setting…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692862/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…trial detention system has been effectively prioritizing       safety since 1992; if the current system begins failing       District residents, DC's democratically elected       representatives are well-positioned to respond. H.R. 5214       would also bring increased costs to DC taxpayers.       Incarcerating someone at the DC jail can cost $241 a day;…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696958/opposition-letter-led-by-tzedek-dc-on-the-district-of-columbia-cash-bail-reform-act-of-2025-hr-november-2025"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…hiding in France during World       War II, could I have possibly dreamed of standing where I am       now. Never could I have imagined addressing democratically       elected representatives, in a country where people can live       freely, a country that I love.\n\nMy name is Rose-Helene Spreiregen. I was born in Paris in       1931 into a family that fled…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690804/rose-helene-spreiregen"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…in strong opposition to these bills. They address inherently       local issues and laws that were passed after careful       consideration by the District's elected representatives, who       are directly accountable to District residents. Members of       this very Committee have long advocated for the principles of       federalism on which…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…pass these bills, protect the funding that our families count on,  reject Trump's heartless cuts, and put power back in the hands of the  American people and their elected representatives where it belongs.  That is what this package does and what I am intent on doing with the  rest of our bills as well.\n\nMy North Star is always, what can I do that does…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698874/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…silly, small-minded,  and sycophantic piece of legislation. When the American people woke up  this morning, they could reasonably ask the question: What are their  elected Representatives on the floor of the House of Representatives  going to be debating?\n\nIn an environment where the Trump tariffs are costing them thousands  of dollars more per year,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690933/gulf-of-america-act"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…corruption, we  should be calling it out. We should be fighting it. We should take it  on. Our democracy turns on public trust and people having some faith in  their elected Representatives.\n\nWhat we are railing against here, Members trading stock based on  information we learn, that erodes that public trust. Let's be smart.  Let's come together. Let's…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691217/stock-trading-ban-for-members-of-congress"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…that  is an authoritarian statement because it is not the President's  prerogative to decide how to spend that money; it is the power of the  people, through their elected representatives in the House and Senate.\n\nThen, in addition, Mr. Vought has coordinated a series of strategies  to essentially cancel programs by slow-walking the disbursal of funds;…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…in strong opposition to these bills. They address inherently       local issues and laws that were passed after careful       consideration by the District's elected representatives, who       are directly accountable to District residents. Members of       this very Committee have long advocated for the principles of       federalism on which…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…White  House. Only Congress, under the Constitution, has the power to declare  war. Article I, section 8 is clear on this issue--and for good reason.  Only the people's elected representatives should have the awesome power  to send our sons and daughters into armed conflict.\n\nI remember thinking about this in personal terms during the era of  the Vietnam…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696557/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…for by the taxpayers, for  a select--a select--group of eight Senators. That policy is simply  wrong. It goes against everything that we are supposed to be doing as  elected representatives to make life better for the people who live in  our States and in the country.\n\nWe have all heard a lot of excuses trying to justify why a handful of  Senators deserves…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699110/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…opportunity to break this cycle, but Republicans need to be part of the  solution. This is a chance to stand up for our constituents, who  deserve to know that their elected Representatives really work for  them.\n\nIf my colleagues think these sweeping tariffs are such a good idea,  then vote for it, but stop hiding. We are not elected to dodge  important…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699902/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…President, I rise today because the United States,  once again, stands on the brink of a dangerous and unnecessary war, one  that neither the American people nor the elected representatives whom  they sent here to Washington have authorized and one that risks yet  another endless conflict that will drain our coffers and cost American  lives.\n\nPresident…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698823/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…in strong opposition to these bills. They address inherently       local issues and laws that were passed after careful       consideration by the District's elected representatives, who       are directly accountable to District residents. Members of       this very Committee have long advocated for the principles of       federalism on which…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…legislature to make the decisions about whether you and your fellow  citizens, the folks who made the decision to step forward and serve our  country--whether we, as elected representatives, have the  responsibility to make the decision whether they have to go into harm's  way--you have inspired us every day.\n\nIf you are ordered to go, you go; you report…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696567/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…clause gives us broad constitutional  protection from executive branch interference. This is what you call  keeping the executive branch from running over the people's elected  representatives. But the Biden DOJ--they were out for Donald Trump.  They wanted to block him from ever being President. They wanted to go  get him six ways from Sunday. They were…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700058/9999"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…own hard-earned money? Further, should the  Federal Government be allowed to make such sweeping decisions behind  closed doors without input from the public or their elected  representatives?\n\nAt its core, this bill is about ensuring the preservation of personal  financial freedom. The American people have a basic right to financial  privacy. They have…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…that has been signed by at least 30 Senators. Either way, the process  allows the Senators to vote on whether the rule should go into effect,  providing a method for elected Representatives to have oversight over  unelected bureaucracies.\n\nI decided to use the CRA process and introduce this resolution  against EPA's approval of the California electric…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…saved no doubt many lives in  Minnesota on that day just a few days ago.\n\nThis was a methodically planned attack on the people's right to be  governed by their duly-elected Representatives and should be  universally condemned, Mr. Speaker.\n\nAmerica's differences must be resolved through debate and democracy,  not through violence.\n\nThe resolution we…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692853/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "French Hill", "party": "Republican", "sentence": "…conditions to do their rulemakings, how to  evaluate their rulemakings, and what is a reasonable amount of time to  get public input.\n\nWe have the right, on behalf of the elected Representatives of the  American people, to let our voices be known when a nonelected, to quote  my good friend, the gentlewoman from California (Ms. Waters), unelected  bureaucrat…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689950/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…or four times as many rules and  requirements on Main Street businesses written by people nobody out in  the real world ever voted for as opposed to laws that their elected  Representatives are accountable for.\n\nBy the way, this chart is not current. It doesn't include those  regulations piled on top of this last tallest bar. Since this chart was  compiled,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690784/big-beautiful-bill"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Washington has spent decades,  trillions of dollars, and thousands of lives trying to remake other  countries in our image. The American people are sick and tired of their  elected representatives in Congress standing idly by saying: Nothing to  see here; the President can do whatever he wants, while their sons and  daughters are sent to fight wars in distant…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…A major opportunity that we have right now is to modernize our  government and to rein in the inexorable growth of the administrative  state, restoring power to our elected representatives, States, local  communities, and the American people themselves.\n\nWhen we think about the administrative state, we think about all the  regulations that are churned…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688392/guidance-out-of-darkness-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…for how long, it will be  because Congress is too feeble to stand up for the interests and bank  accounts of the people.\n\nIf Americans live in a country where their elected representatives in  the legislature cannot or will not speak for them, it will be because  those representatives silenced themselves. They gave in. They did not  stand up and do their…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…table from representatives of businessowners.  However, Federal unions are not negotiating with a profit-seeking  corporation. They are negotiating with the public's elected  representatives.\n\nAs FDR put it in the case of the public sector, the employer is the  whole people. Federal unions, in other words, seek concessions not from  private owners but…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…back in people's  pockets when pressure is so high, and that matters.\n\nIn closing, there is so much power now in the voices of our  communities, but only if we, their elected Representatives, listen and  act and elevate it. That is economic patriotism.\n\nI am proud that as a Democrat our party stands with law enforcement  and police officers, stands with…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689084/economic-populism"}]