[{"senator": "Bill Foster", "party": "Democrat", "sentence": "…recently fired without cause by President Trump and Elon Musk.\n\nThis engineer's job was:\n\nCo-leading a project developing software for critical       mineral and rare earth element extraction, while also playing       a lead technical role in computer modeling of desalination       and water treatment processes and supporting U.S. industrial       partners…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688240/fired-by-president-trump"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…years of work are being trashed with bogus  claims of fraud and corruption. The ax falls regardless of skill,  merit, or accomplishment. It falls without regard to the human element  of people, not merely statistics, who serve the public. It is heartless  and cruel.\n\nMost corporations, even when downsizing, take into account the most  productive employees…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688724/considering-the-painful-toll"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…VA employees are  trying hard to continue to deliver for veterans. We should not lose  sight of that. Even with the promise of evolving technologies, we know  that the human element is still the most important when delivering  world-class care and service to veterans. It is what veterans want, and  it is what serves them best.\n\nMr. TAKANO.  Morrison),…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695486/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…social group, or political opinion; and\n\n(iii) has not been convicted of--\n\n(I) any offense under Federal or State law, other than a       State offense for which an essential element is the alien's       immigration status, that is punishable by a maximum term of       imprisonment of more than 1 year; or\n\n(II) 3 or more offenses under Federal or State…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…So we are headed back to the book, and the  book is this book, ``How Democracies Die.'' And with each chapter, I am  trying to give some sense of the chapter but not every element of it.  So I will read some of the pages, maybe scan through some others, and  try to address a few of the issues that I will raise.\n\nThis particular chapter addresses President…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…where if these healthcare premium supports expire,  every American who has come to depend on access to healthcare through  ObamaCare, which is now accepted as an important element in our  healthcare system, every person on that is in incredible jeopardy.\n\nAnd I know that every single Member of this Senate is very concerned  about access to healthcare…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…children has recently been cut.\n\nThese Russian abductions represent a deliberate effort to eliminate  Ukrainian national identity, destroy family ties, and are a specific  element of a genocide crime under international criminal law. The  Russians claim, further, that 700,000 children have been seized. None  of this can stand.\n\nAs someone who has traveled…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691141/peace-talks-with-ukraine"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…evaluate       applications under the program and changes program       requirements, as established by the BEAD NOFO. As a result,       the Policy Notice also satisfies this element of the APA       definition.      CRA Exceptions\n\nWe must next determine whether any of CRA's three       exceptions apply. CRA provides for three types of rules that…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698437/us-government-accountability-office-opinion-letter"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…the problem. And these tariffs aggravate the  problem. There is absolutely no denying that. This is just the wrong  thing at the wrong time for the wrong reasons.\n\nAnother element of this is, what is the purpose of these tariffs?  President Trump won't give a clear answer. It is to make us rich. They  will pay; we won't. It is to bring manufacturing…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…generally requiring such procedures.\n\nHowever, the 2025 Policy Statement substantially affects       the rights or obligations of non-agency parties. To satisfy       this element of the exception, a rule must not alter the       rights or interests of non-agency parties, though it may       alter the manner in which parties present themselves or their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…want  your permission not to spend it--$9 billion.\n\nThat is what we voted on and the House voted on last week. What was  in this bill were primarily two major elements. One element was foreign  aid, humanitarian assistance around the world paid for by the United  States. The other element was public broadcasting--National Public  Radio, for example.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693932/rescissions"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…requires the NSA to notify Congress of  significant changes in its collection posture, and improves our  visibility in counter-narcotics-related operations.\n\nIt requires each IC element to designate a senior official to oversee  work on biotechnology issues, an emerging priority.\n\nIt also extends the requirement that there be an IC coordinator to  ensure…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697797/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…mother to students  and follows their careers with pride. In a statement released by the  University, Dean McClellan said: ``I've always felt that listening is  such a critical element of building a relationship. And relationships  are what all of this is built upon.''\n\nI congratulate Dean McClellan for a stellar career advancing legal  education and helping…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693637/congratulating-sue-ann-mcclellan-on-her-retirement"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…County Executive Bruce Blakeman setting up systems  on the border between Nassau County and neighboring New York City,  ostensibly to protect Nassau residents from the criminal element coming  from their city neighbors.\n\nThat is one way for a suburb to act toward the city next door,  although it may make it more difficult for the Long Island Mets fans to…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697353/america-needs-unity"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…and rule-making that established American markets as the       envied, disciplined, safe, and largest in the world. Once the       crypto craze dissolves and/or crashes, this element of the       bill, if it becomes law, will constitute one of the greatest       deteriorations of sound securities law ever. The Securities       Industry and Financial Markets…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…the streets. There is this notion that we can somehow  enforce criminal law with social vagaries; this idea that somehow if we  will just be very, very nice to the criminal element, they will just  stop committing crimes upon the law-abiding of our country.\n\nWe have to stand against the existence of that concept, certainly in  this body that is responsible…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…training new deputies in  law, policy, tactics, and procedures. In 2009, he joined the special  enforcement team, which is the equivalent of a SWAT team, and was  selected as the element leader for the chemical agents unit.\n\nThat year, Lieutenant Doolittle was also assigned as a detective to  the investigations unit. He handled cases involving burglary, theft,…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Bill Hagerty", "party": "Republican", "sentence": "…process over commonsense policy and political optics over  operational necessity.\n\nIf the President had been forced to act in accordance with this  resolution last week, the element of surprise would have been entirely  lost, and the successful mission flown by our brave airmen would have  been much different and, likely, much costlier.\n\nOf course, Congress…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693130/motion-to-discharge-sj-res-59"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…the Department of Defense,       as identified by the Under Secretary of Defense for       Intelligence and Security, for any systems used by an       Intelligence Community element of the Department of Defense.\n\nSection 6602 also requires the head of each Intelligence       Community element to track and evaluate the performance of       procured and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698262/explanatory-statement-for-the-intelligence-authorization-act-for-fiscal-year-2026"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…illegally.\n\nI think it is important that we educate the American public on that  because we are soon going to have to start the next phase where we not  only get rid of the criminal element that came in here, but we have to  get rid of the 10 million people who may not have broken a horrible law  but broke the law just by coming here.\n\nIt is a complete kick in…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690195/wisconsin-in-the-news"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…Congress exclusive authority to  coin money, regulate the value thereof, and of foreign coin.\n\nThis is a clear provision of the United States Constitution. It is a  foundational element of our constitutional Republic designed to keep  such important authority over our Nation's currency issuance within the  hands of the people's Representatives.\n\nA central…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693733/anti-cbdc-surveillance-state-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…tremendous stress had a chance to decompress over a period  of time with each other and share their experiences, cry, hug, laugh,  but work through it in a way that used the element of time together to,  again, work through the challenges of the horrific events that they had  experienced.\n\nIn Vietnam, the timeline shortened a little bit, and please don't…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692714/recognizing-national-post-traumatic-growth-day"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…classifying a digital asset, either as a security or  a commodity, has led to confusion, legal uncertainty, and, ultimately,  consumer harm.\n\nAmerican innovation is a critical element in job creation and  economic opportunity here in the United States. Congress must look to  preserve this competitive advantage and not let it leave our shores.\n\nBy passing…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693769/digital-asset-market-clarity-act-of-2025"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…of the Committee sponsorship of the staff person's security       clearance and immediate dismissal from the Committee staff.\n\n10.9. Within the Committee staff shall be an element with       the capability to perform audits of programs and activities       undertaken by departments and agencies with intelligence       functions. The audit element shall…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…tools necessary to remove  noncitizens from their voter rolls. Right now States don't have free  access to the Federal data that tracks citizenship status.\n\nAnother crucial element of the SAVE Act will provide States with  cost-free access to existing Federal and State databases so they can  perform this important voter list maintenance.\n\nIn recent years…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…including  Executive Officer of the 2-107th Cavalry in Kettering, Ohio, Assistant  Chief of Staff at Headquarters State Area Command, Deputy Chief of  Staff for Personnel OHARNG Element, and Chief of Staff, Ohio Army  National Guard in Columbus, Ohio. In 2011, General Harris was appointed  Assistant Adjutant General for Army by Governor John Kasich. On  December…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691689/special-recognition-of-major-general-john-c-harris-jr-upon-his-retirement-as-adjutant-general-of-the-ohio-national-guard"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…affects so many other  problems that we have in America.\n\nThe crime problem is a family breakdown problem. The drug problem is  certainly not exclusive, but it is a strong element of the family  breakdown problem. In talking to teachers, particularly in the area of  special education, frequently the problems stem from a breakdown in the  family.\n\nWe…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…and prescribes policy by       designating or foreclosing specific activities or land use on       BLM-administer land. As such, the North Dakota RMP meets the       third element of APA's definition of a rule. Having satisfied       all the required elements, the North Dakota RMP meets the APA       definition of rule.      CRA Exceptions\n\nWe must…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693059/us-government-accountability-office-legal-opinion"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…deported and they come  back, a prosecutor would have the discretion to charge the 10-year  minimum. It is not compulsory. It is within the discretion but, yes, he  would meet the element.\n\nMr. KNOTT. Madam Speaker, I yield myself the balance of my time.\n\nMadam Speaker, I have heard a lot from the other side about costs,  whether it be costs to law enforcement,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…and prescribes policy by       designating or foreclosing specific activities or land use on       BLM-administer land. As such, the North Dakota RMP meets the       third element of APA's definition of a rule. Having satisfied       all the required elements, the North Dakota RMP meets the APA       definition of rule.      CRA Exceptions\n\nWe must…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}]