[{"senator": "Emily Randall", "party": "Democrat", "sentence": "…healthcare sector already. We  should not be adding to it by cutting $1 trillion from poor people and  people with disabilities, from children, and from seniors who are often  dual eligible for Medicare and Medicaid who are able to live in dignity  until the end of their days because of this important program. It will  keep long-term care programs open if we…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688135/republican-budget-betrayal"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…grocery costs and helping families get  ahead, they are prioritizing a bill that disenfranchises millions of  American women.\n\nRoughly 69 million women, about 25 percent of eligible voters in our  country, have IDs that do not match their birth certificates, usually  because they changed their name once they got married. Under this bill,  if they don't…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689394/gop-creating-chaos-in-electoral-system"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…protect access at the ballot box,  not to restrict it.\n\nThat is why I offered several comments and amendments to preserve  online voter registration, ensure due process when an eligible citizen  is denied the right to vote, mandate that citizenship only needs to be  proven once, and allow the use of an expired passport to register to  vote.\n\nMy amendments…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699934/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…has written to Congress begging us not to pass this  awful bill. They have made it very clear that if this bill goes  through, States will be forced to cut benefits, kick eligible people  off of food assistance entirely, or raise taxes to pay for this massive  new bureaucracy that Republicans are creating in every State in this  country.\n\nThe chairman…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…each block grant).\n\n5. The above will leave a total of $4.65 billion in the       contingency fund for November SNAP benefits that will all be       obligated to cover 50% of eligible households' current       allotments.\n\n6. This means that no funds will remain for new SNAP       applicants certified in November, disaster assistance, or as       a cushion…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…committed any violent crime or any other offense.  It becomes a felony under the legislation. Now you have a felony  because you have reentered, and at that point you are eligible for up  to 20 years or even a life sentence.\n\nAm I understanding that correctly? There are people whose only  offense could be reentering without anything else who would be…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…the fact of the matter is, widespread voter fraud, even  significant voter fraud by noncitizens, is an imaginary, delusional  issue. Some 21 million U.S. citizens who are eligible to vote don't  have the requisite documentation that would be required under the SAVE  Act. To solve the delusional nonproblem, the SAVE Act would deprive  real citizens of…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690539/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…January 6, 2021.  They shouldn't waste the House's time on this legislation.\n\nWorse than a waste of time, the bill being brought to the floor this  week would disenfranchise eligible citizens by imposing onerous  requirements that many could not meet.\n\nFor example, as you just heard, married women who have changed their  last names could not use their…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…fossil fuel  industry is outrageous.\n\nAnd we just heard in response to my inquiry just now that the  Parliamentarian affirmed this, that these California waivers are not-- not--eligible for the expedited procedures that the CRA affords.\n\nThat means that legislation to repeal these waivers should be subject  to a 60-vote threshold in the Senate. To use the…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691448/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…harm's way as  it relates to their healthcare, put that money in.\n\nWhen I say people who need it, I am talking about people who have  long-term illnesses and seniors, dual-eligible persons who may qualify  for Medicaid and Medicare, so they need these long-term hospitalization  programs available to them. That can be cut.\n\nWe are talking about the approximately…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…of an individual looking for medical care.  Pile it up. Make it hard. Pitched by the Republicans as just simply  ``work requirements,'' this policy withholds healthcare for eligible  patients until they meet overly complex paperwork requirements. It is a  failing strategy.\n\nIn the States that have tried the so-called work requirements, there  has been…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690984/medicaid"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…exemptions have never worked.\n\nWe have the example from the State of Georgia, which admitted that  there were 300,000 to 400,000 people under expanded Medicaid that were  eligible for Medicaid under the State program, but only 4,500 of those  300,000 to 400,000 qualified because of the paperwork.\n\nIt doesn't matter what you say. Eliminating these people…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…Instead of  working to meet the needs of the American people, House Republicans are  busy spreading fear and lies to justify their attempts to  disenfranchise millions of eligible voters.\n\nLet's be clear: It is already against the law for non-Americans to  vote. This bill is a solution in search of a problem. The SAVE Act  would create new barriers…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690004/safeguard-american-voter-eligibility-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…D.C. has  no authority over Federal matters and has only limited local self- government.\n\nIn D.C., the penalty for voter fraud includes imprisonment for up to  5 years. To be eligible to vote in D.C., a person must maintain their  residency in D.C. for at least 30 days before the election and cannot  claim voting residence or the right to vote in any State,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692318/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…One of the primary goals of the PACT Act was to recognize the  sacrifice of so many more veterans who were injured during their time  serving our Nation and to make them eligible for many of the programs  offered to help them find meaningful employment such as VR&E. Now the  VR&E program must keep pace with this new influx of veterans and ensure  that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695411/focused-assistance-and-skills-training-for-veterans-employment-and-transition-success-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…reduce direct spending on federal benefits (emergency       Medicaid or federal subsidies for health insurance, for       example) for which those people might otherwise be eligible.\n\nAs a result of the determinations required by the bill,       transactions involving certain assets either in the United       States or under the control of people or entities…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699831/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…down to and being insulted repeatedly with the  fear-mongering tactics of the left. It is disingenuous for them to  stand there and to continue to say that women will not be eligible to  vote.\n\nThis is about protecting one of our most sacred rights that we have  as Americans, and I am so proud to stand here as a woman, as a married  woman, and, again,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690009/safeguard-american-voter-eligibility-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…overtime provision  in this bill.\n\nAccording to the Council of Economic Advisers, an even larger 65  percent of workers in North Dakota are in occupations that are likely  eligible for overtime and could also benefit.\n\nWe cut taxes on up to $12,500 of overtime pay for more than 80  million hourly workers. This is estimated to increase yearly take-home…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694173/benefits-of-one-big-beautiful-bill"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…to property held in trust by the United States for an Indian       Tribe.\n\n(c) Gaming Prohibited.--The land taken into trust under       subsection (a) shall not be eligible for gaming under the       Indian Gaming Regulatory Act (25 U.S.C. 2701 et seq.).\n\n(d) No Impact on Treaty Rights.--Nothing in this Act       affects treaty rights under the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697703/quinault-indian-nation-land-transfer-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…enrolled in a plan or had their plan       changed without their consent. Such practices can result in       wasteful federal spending on APTC for enrollees who are not       eligible. Further, such practices can result in harm and       unexpected costs for consumers. These can include loss of       access to medical providers and medications, higher…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…valuable resources for families who otherwise would not have the funds  to do so. Gender transitioning is not covered under any of the criteria  for identifying individuals eligible for the EFMP.\n\nMr. Chair, I ask for adoption of this amendment, and I reserve the  balance of my time.\n\nMr. NORMAN. Mr. Chair, all I would add to that is we have got an  obligation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695252/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…Alaska.\n\nMr. BEGICH. Mr. Speaker, fewer than 20 Alaska native Vietnam-era  veterans have received their conveyances. A big part of the reason why  so few of the more than 2,000 eligible Vietnam-era veterans or their  heirs have received those lands is because they were delayed or  outright blocked by the previous administration.\n\nThe previous administration…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694897/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…immigrants' access to taxpayer-funded  healthcare benefits, then eliminated over $185 billion worth of fraud  and waste in the ObamaCare marketplace. For Americans who are eligible,  Republicans actually lowered ObamaCare premiums and expanded access to  health savings accounts, direct primary care, and telehealth for  millions, including ObamaCare enrollees,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…an  appellant may submit a request that requires the IBLA to decide the  case within 6 months.\n\nIf the IBLA fails to meet the new deadline, the case automatically  becomes eligible for de novo judicial review outside of the Department.  This solution will reduce the existing backlog while ensuring  stakeholders receive their day in court.\n\nMr. Speaker,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691038/expedited-appeals-review-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…ID before you cast your ballot.\n\nMr. Speaker, I have heard on the other side of the aisle in this very  debate that it is already illegal to cast a ballot when you are not  eligible to vote. It is already illegal. We don't need another law.\n\nMr. Speaker, it is already illegal for a minor to purchase alcohol.  Yet the clerk says: Please show me your ID.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699999/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…incomes weren't later verified for       enrollees who received $21 billion in subsidies in 2023. That       means they might have received bigger subsidies than they       were eligible for. The Paragon Health Institute's Brian Blase       has warned that ObamaCare's lax verification controls       encourage people to understate income to get bigger…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697906/affordable-care-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…practice under subsection (c).       SEC. 102. ACCELERATING HOME BUILDING GRANT PROGRAM.\n\n(a) In General.--The Secretary may establish a pilot       program to award grants to eligible entities to review       designs of covered structures of mixed-income housing and       designate such reviewed designs to be included in pattern       books for use in the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…strengthen law enforcement's ability to prosecute fentanyl traffickers  and act as a deterrent.\n\nThe HALT Fentanyl Act promotes research by improving the registration  process so eligible individuals can conduct studies on schedule I  substances  with the appropriate safeguards. In the Energy and Commerce Committee,  we have heard there may be as many as 4,800…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…company or companies or       $125,000,000.''; and\n\n(D) by amending clause (iii) to read as follows:\n\n``(iii) Prospective applicability.--An investment by a       licensee is eligible for exclusion from the calculation of       outstanding leverage under clause (i) only if such investment       is made by such licensee after the date of enactment of this…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697259/investing-in-all-of-america-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…report directly to the       Director of the Breast and Gynecologic Oncology System of       Excellence (hereinafter in this section referred to as the       ``BGOSoE'').\n\n(b) Eligible Veterans.--A veteran is eligible to receive       care coordination provided by a Care Coordinator hired or       designated under subsection (a) if the veteran--\n\n(1) is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695420/women-veterans-cancer-care-coordination-act"}]