[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…accurately reflect our veteran  population.\n\nBy making this change, we acknowledge the challenges that veterans  with service-connected disabilities often face in the job market.  Eliminating the stigma associated with these disabilities will  encourage more veterans to participate in the VR&E program, ultimately  assisting them in preparing for and securing…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693934/veterans-employment-readiness-yield-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Chairman, I know that we can all agree that every student  in this country should have access to a safe, welcoming, and well- funded learning environment. That begins with eliminating disparities  in education with sustained federal funding. This Congress, Committee  Democrats will reintroduce legislation such as:\n\nthe Rebuild America's Schools Act, which…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…Start help keep your family's head  above water during tough times, you are feeling frustrated that this  administration is so out of touch that they would even consider  eliminating this critical funding.\n\nThese emotions run deep nationally, and I have seen them felt  locally. Somerset County, for example, is one of the poorest counties  in my State,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…we are seeing rural hospitals struggling and not  just in my district. Rural hospitals across the United States of  America are struggling. Many of them are closing or are eliminating  critical services.\n\nThese hospitals, every one of them, are heavily reliant on  reimbursement from Medicare and Medicaid. Any cut in Medicaid funding  would lead to catastrophic…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Taxation, the JCT, this new tax  break on silencers alone will increase our Nation's deficit by $1.5  billion. That is more than the $1.1 billion Republicans are ``saving''  by eliminating all funding for public TV and radio.\n\nMr. Speaker, let me ask the American people and my Republican  colleagues: Is this whole tradeoff worth it? Public broadcasting in…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…electricity costs that are a direct  byproduct of the bill that Republicans passed earlier this summer, then  a good way to start would be to tell the Department of Energy to stop  eliminating energy projects in Brighton, in Fort Lupton, in Fort  Collins, and in Longmont, the communities I represent and the  communities that my colleague from Colorado represents.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697884/state-planning-for-reliability-and-affordability-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…of these bills is       remarkable, and if passed, would result in an erosion of       accountability and public safety for the District of       Columbia. They range from eliminating and replacing our       elected and accountable Attorney General for the District of       Columbia with a President's hand-picked and unaccountable       associate requiring…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…majority is preparing today a budget that offers American taxpayer  dollars to give massive tax breaks for millionaires and billionaires. I  hope that my colleagues can justify eliminating a $40,000 Federal job  at a national park for wildfire prevention so that a millionaire can  take another summer vacation to Aruba.\n\nI urge my colleagues to recognize the…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687984/dire-consequences-of-funding-freeze-and-mass-firings"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…considering voting for this own the reckless cuts done by  Elon Musk.\n\nThis is a bill to shut down rural television and radio stations,  cutting off coverage of local news, eliminating emergency information  like severe weather alerts, and jeopardizing access to PBS KIDS  children's programs like ``Sesame Street.''\n\nThis is a bill to rip lifesaving support…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…sure we have Pell grants and student loans so that people  can go.\n\nWhen we dismantle the Department of Education, we are not returning  anything to the States. We are just eliminating civil rights. It is no  surprise that the first victim in the dismantling of the Department has  been the Office of Civil Rights. The Office of Civil Rights enforces  civil…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698125/dismantling-the-department-of-education"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…areas to  glass for these deer that Jack O'Connor made famous when he referred to  them in his writings as ``the gray ghost.''\n\nSo when the Trump administration advocates for eliminating the  roadless rule, they are talking about endangering some of the last  great wild game habitat on our national forests. These are the back- country places where we sit…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…to build.\n\nInstead of accepting this reality, President Trump and congressional  Republicans are flailing, and it is leaving everyday Americans to  shoulder the costs.\n\nBy eliminating energy sources instead of adding more, this  administration is raising your energy prices, raising your electricity  bill, not lowering it. The impacts are real, and they…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…must forsake the       other.\n\nThe answer--\n\nHe said--       is not to abandon growth, but to redirect it. For example, we       should turn toward ending congestion and eliminating smog       with the same reservoir of inventive genius that created them       in the first place.\n\nNow, Richard Nixon--that was in January of 1970.\n\nThis was Richard Nixon…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Act       demonstrates, regulators were slow to implement rules, and       those rules reflected intense Wall Street lobbying. With the       U.S. Supreme Court decision eliminating Chevron deference,       rules that industry finds inconvenient now may perish at the       whim of cherry-picked courts.\n\nThird, the bill fails to provide speedy resolution…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…citizens during Hurricane Helene.\n\nThe Trump administration is attacking Federal research offices  because they expose disastrous policies and hold polluters accountable.  Eliminating the Office of Research and Development not only violates  the law, it puts our people, public health, and the environment in  danger.\n\nI will fight this dangerous plan to…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689045/expressing-concern-regarding-job-cuts"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Beautiful Bill Act  protects and strengthens Medicaid for those who rely on it--pregnant  women, children, seniors, people with disabilities, and low-income  families--while eliminating waste, fraud, and abuse.\n\nThe One Big Beautiful Bill Act removes illegal aliens, enforces work  requirements, and protects Medicaid for the truly vulnerable.\n\nFor our colleagues…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…permanent law. The original act mandates sanctions on  individuals and entities involved in Iran's energy sector in its  efforts to develop weapons of mass destruction. By eliminating the  expiration date, we ensure that these sanctions remain a steadfast  component of our national security strategy.\n\nThe Iran Sanctions Act has been a cornerstone in our…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690689/solidify-iran-sanctions-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Medicaid bill  because it protects Medicaid for those who really need it most,  pregnant women, children, seniors, people with disabilities, and low- income families, by eliminating waste, fraud, and abuse.\n\nMr. Speaker, I can't deny that a crowd favorite is calling it the  working families tax cut bill because it delivers the largest tax cut  in American…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695114/launching-golden-age-of-america"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…rural veterans in Arizona's  Sixth Congressional District face in getting their medical exams  completed in a timely manner.\n\nThis bill takes an essential first step toward eliminating these  regional healthcare disparities and ensures that all veterans receive  the quality care they deserve.\n\nMr. Speaker, I encourage all my colleagues to vote in support…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695498/rural-veterans-improved-access-to-benefits-act-of-2025"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…is popular on that side of the  aisle--you can see that Medicaid expenditures of the Federal Government  go up over the next 10 years with the Republican plan, even after  eliminating fraud, waste, and abuse, which a clear majority of  Americans agree we should eliminate across the Federal Government. We  spend $656 billion in fiscal year 2025 and, again,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690515/republicans-are-protecting-and-preserving-medicaid-for-the-truly-needy"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Missouri.  Malliotakis), the sponsor  of this legislation.\n\nThis legislation will not only help taxpayers who have been victims  of fraud, but it will also help combat fraud by eliminating  opportunities for criminals to strike a second time.\n\nCheck fraud is a major challenge in this country, and it has grown  exponentially over the past several years. In…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689291/recovery-of-stolen-checks-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Additionally, Jeffrey acts as the founding co-chair of Hep B United,  a national coalition to unify and enhance local coalitions and  community health centers dedicated to eliminating Hepatitis B virus  infections and its complications. Hep B United was founded in 2013 as a  partnership between the Hepatitis B Foundation and AAPCHO and has done  incredible…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694737/recognizing-jeffrey-b-caballero-mph-executive-director-of-the-association-of-asian-pacific-community-health-organizations-aapcho"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…shed light on what  Republicans are doing to fix the Democrats' affordability crisis, with  policies that deliver real, lasting relief to the American people.  These include eliminating health plan gimmicks like silver loading,  which will lower ACA premiums by 11 percent; increasing transparency  for pharmacy benefit managers, the middlemen that will lower…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…important than ever as the LAF works to  permanently disarm and destroy Hezbollah's presence in Lebanon.\n\nBuilding on the tremendous success of Israel in weakening Iran and  eliminating Hezbollah's terrorist leader network, Hezbollah is now at  its weakest point. This is a tremendous opportunity for the LAF and for  the people of Lebanon to root out terror…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693688/department-of-defense-appropriations-act-2026"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…overtime pay. It lowers taxes on Social  Security benefits and expands the child tax credit for working-class  families.\n\nOur bill helps keep American family farms afloat by eliminating the  death tax for most, saving 2 million family farms. The family farmers  and ranchers in my district are hardworking men and women who are up  and moving by sunrise and…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…3617 is important. You can't make this stuff up,  what they are saying across the aisle.\n\nH.R. 3617 is important to securing our critical energy resource  supply chains and eliminating our dependence on foreign adversaries  like we have been talking about, Communist Red China.\n\nThis bill takes a holistic approach, Mr. Speaker, in ensuring  vulnerable supply…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699990/securing-americas-critical-minerals-supply-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…Program is in danger. And it is  being endangered, I gather, because of the effort to eliminate  government waste. Now, there is a lot of government waste, and I am all  for eliminating that waste. If there is fraud, we should eliminate it.  If there is waste, we should eliminate it.\n\nBut preventing homes from flooding, that if they do flood will cost…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…policies and unbridled spending.\n\nThere is the complete distortion that Medicaid is being cut when, in  fact, it is being strengthened for our most vulnerable citizens by  eliminating hundreds of billions of dollars of waste, fraud, and abuse.\n\nThere is the fallacy that work requirements are somehow punitive when  we know that they restore the dignity…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693192/one-big-beautiful-bill-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…for AI against China and power our future.\n\nI am proud to report that the One Big Beautiful Bill Act unleashes  American energy dominance through strategic investments and eliminating  wasteful subsidies. Our bill begins to refill our dangerously low  Strategic Petroleum Reserve and creates new investments to generate  reliable energy that will secure…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694788/promises-made-promises-kept"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…down on misleading ticket sites. It is a  great bill.\n\nThis bill further prohibits the sale of tickets the seller doesn't  yet have, a practice known as speculative selling. Eliminating this  tactic helps level the playing field so more fans have a fair shot at  attending events. They deserve that.\n\nI urge my colleagues to join me in voting in favor of…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690175/transparency-in-charges-for-key-events-ticketing-act"}]