[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…I will join Senator Gillibrand, Representatives Goldman  and Garbarino to reintroduce the bipartisan 9/11 World Trade Center  Health Program reintroduction, 2 months after Elon Musk killed this  program when he tanked the bipartisan funding bill in December.\n\nMr. President, 9/11 families deserve to be treated with dignity, with  respect, not with the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688202/department-of-government-efficiency"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…Americans across our country enrolled in  Medicaid is at risk. They are at risk because Republicans in the House  and the Senate have chosen to take away their care so that Elon Musk  and the very richest Americans can pay a little less in taxes.\n\nThat is the choice they have thrust upon the American people. It is a  choice that I don't believe they truly…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689514/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…Congress is looking at doing, because of Musk and Trump and  the Republican colleagues here that I share this floor with, is cutting  programs that help the public.\n\nIn October, Elon Musk incorporated United States of America, Inc., in  Texas. What that means is it shows his mentality. He thinks he owns  this government. He has bought it. He has been given…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688101/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…work has been largely halted because  the Trump administration has frozen new orders for RUTF, grinding  production nearly to a halt. This is despite Secretary Rubio and Elon  Musk promising publicly that emergency food aid would be continued.  That has not been the case so far, and relief for starving children is  now uncertain.\n\nUSAID's Office of…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690379/edesia-nutrition-saves-malnourished-children"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…Their objective of suppressing the vote was made even more clear last  week, Mr. Speaker, when President Trump signed an executive order to  erode voting rights and gave Elon Musk, an unelected, unconfirmed  person, the right to access Americans' personal voter information.\n\nMr. Speaker, as elected officials in this House, we should be  fighting to…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689343/fighting-voter-suppression"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…has a  right to review and realign programs funded by Congress, but only if  the President acts in a way that complies with the law.\n\nIn the past 5 weeks, President Trump, Elon Musk, and Secretary of  State Rubio have done away with even the pretense that they are  conducting a review of programs administered by the U.S. Agency for  International Development.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…military.\n\nMoreover, the bill weakens the department by continuing the  administration's reckless and indiscriminate cuts to vital civilian  personnel and yielding to DOGE and Elon Musk.\n\nIn further conceding Congress' prerogative over funding the  Department of Defense to DOGE, the majority directs the Department to  find nearly $8 billion in undetermined…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693648/department-of-defense-appropriations-act-2026"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…range of unlawful powers, effectively granting this  flagrantly unconstitutional creation significant control over the  executive branch.\n\nDonald John Trump has appointed Mr. Elon Musk as the de facto head of  this contrived entity, which was not created or funded by any law,  without a formal title or office. These actions have been in direct  violation…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…for fossil  fuels over clean, cheap energy.\n\nH.R. 3638 would require the Department of Energy (DOE) to issue a  supply chain report, asking DOE to do more with less after Elon Musk  and DOGE forced out 3,500 DOE employees and put the agency's capacity  to write such a report in doubt. If Republicans are concerned about  energy supply chains, they should…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698075/opposition-to-permitting-bills"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…tables of  families who are just trying to get by.\n\nThis isn't about fiscal responsibility. It is about cruelty. It is  about choosing hedge fund managers and people like Elon Musk over  hungry kids.\n\nBudgets are moral documents, and this one being put up by House  Republicans is morally bankrupt. I will not vote for a bill that  abandons families like…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691436/republican-budget-bill"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Mr. DURBIN. Mr. President, since he took office, President Trump, his  unelected billionaire buddy Elon Musk, and their DOGE bros have begun  to systematically dismantle the Federal Government. In their efforts to  root out so-called ``government waste,'' President Trump and Elon…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688591/recognizing-federal-employees"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Speaker, more than any other day I have been in  Congress, the cruelty of the Trump administration and the Republican  majority is on display. They are asking us to rubber-stamp Elon Musk's  cuts to PEPFAR, which saves millions of lives treating people with HIV,  funding for clean water, funding to fight malaria, funding to help  people starving from famine.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692518/rescissions-act-of-2025"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…not dismantle it. This will save more money than  DOGE ever would.                           Russell Vought and DOGE\n\nMr. SUBRAMANYAM. Mr. Speaker, many people think after Elon Musk left  his post and is taking shots at the administration that DOGE is over,  but that is simply not true.\n\nThe real architect of DOGE is Russell Vought. Vought is the co-author…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692238/backlog-in-irs"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…and Medicaid and only get to $200 billion. Where does the other $600  billion-plus come from?\n\nIt can only come from kicking people off of their health insurance so  that Elon Musk and the billionaires can get another tax cut that they  don't need. It is unconscionable.\n\nMr. Speaker, I urge my colleagues to vote ``no.''", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689865/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…committed to continuing the work to make sure that these cuts do not go  unchallenged because if they were as good as the President and his  cohorts, Secretary McMahon and Elon Musk, say they are, then they would  be here before Congress with a detailed plan to share with the American  people of how this will work and what happens next.\n\nMr. Speaker,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689644/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…the chair of the subcommittee that wrote  the appropriations bill. Roughly, $32 billion went to USAID--an Agency  that no longer exists. Some of you may remember DOGE--an Elon Musk-led  effort to get into and tear up and, in the case of USAID, to tear apart  our longstanding, decades-old, U.S. foreign assistance program. It did  a lot more damage than…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696237/9999"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…government until I transmitted  whistleblower disclosures to that same executive branch, the most  recent being the email about an FBI agent wanting to criminally  investigate Elon Musk. This, too, is not a scandal that the Times would  like to imply because that is called good government oversight, and I  have done good government oversight all of my career…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…these famous words, ``We could say they spend money like drunken  sailors, but that would be unfair to drunken sailors,'' which just  about sums it up.\n\nFor somebody like Elon Musk, who is reportedly one of the most  wealthy--maybe, the most wealthy person--on the planet to spend his  time and effort and to assemble a team like he has to work with the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…money is their money, that you  shouldn't know where it is spent in any shape, form, or fashion.\n\nWhere they want to spend our tax dollars, which is now being  uncovered by Elon Musk, is on a variety of things, but it began 4 years  ago with the invasion of the border.\n\nMy friends from the left, the minute the Biden administration took  office, opened…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688091/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…implementation of a natural gas tax that would harm our  Nation's energy producers and consumers.\n\nThe Democratic Party is busy pulling their hair out over President  Trump, Elon Musk, DOGE, whatever else is their outrage of the day.  However, they have lost sight of the kitchen-table issues affecting  everyday Americans. They ignore the rising costs hurting…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…a red or a blue issue. Everyone, on both sides of  the aisle, should want our government to operate as effectively and  efficiently as possible.''\n\nHe adds: ``Outrage over Elon Musk's email surprised me.\n\n``I couldn't believe the outrage on social media and broadcast news  because DOGE asked government employees to write down five things they  did at…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688492/demanding-transparency-efficiency-and-accountability-from-our-government-is-not-extreme"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…use the hard-earned money that  taxpayers have had to cough up to promote evil in our country and to  fund terrorists around the world, it is unbelievable.\n\nThank God for Elon Musk and for DOGE to uncover all the waste, fraud,  and abuse. I thank President Trump for securing our border and  deporting the murderers, rapists, terrorists, and gang members.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688490/president-trump-is-getting-it-done-for-the-american-people"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…families and taxpayers.\n\nMr. Speaker, I am just a little confused. My colleague mentioned  ``whiplash,'' and I am feeling a little whiplash over here because  Democrats liked Elon Musk. Then, the minority hated Elon Musk. Now, my  Democratic colleagues like him again?\n\nI am just a bit confused and ask that maybe someone can clear that up  for me because…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…onslaught, more than 10 million illegals, many of them actually here  from terrorist gangs, and he is trying to protect our Nation.\n\nI would hope that instead of talking about Elon Musk and others, we  would come together to do something that we know if the next President  is of the other party, my colleagues will be supporting something that  looks amazingly…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…be found. Where were your solutions? You didn't have any because we  have got two worldviews. You think taxes paid by Americans is your  money to spend like you want.\n\nWhat Elon Musk and Donald Trump are doing is identifying the waste.  Let the American people judge. Seventy-seven million Americans judged  on who they thought could lead this country,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688063/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…passed a  defense authorization bill last week that I think had a serious  problem. I would hope our slumbering press corps would do a little bit  more work on the problem.\n\nElon Musk and DOGE were here. They did a good job pointing out that  there were some, particularly in offices, Federal employees in the  District of Columbia, or even around the country,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Ms. WASSERMAN SCHULTZ. Mr. Chairman, I yield myself such time as I  may consume.\n\nI would certainly agree with the gentleman from Missouri if the Trump  administration under Elon Musk's DOGE effort hadn't actually fired  employees and interrupted the ability of employees of the Veterans  Crisis Line from actually doing their job.\n\nWe have no idea how many…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692959/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Let's remember that is on a tax you have already paid.\n\nSecond, he talked about the idea of no tax on tips. Again, this is in  the proposal we are putting forth. That is not Elon Musk getting  breaks. That is not some rich billionaire getting a break. These are  everyday, working Americans who make this country operate every single  day.\n\nIt is a welcome…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691176/president-trumps-delivery-on-his-promises"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…America at  the forefront of the global space race.\n\nCommercial space is the free market revolution. If you haven't  already done so, read the recent book by Isaacson about Elon Musk. He  basically looked at NASA, saw some of the challenges they faced after  the Apollo program, the cancellation of our shuttle program, and even  the challenges we face…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "Mr. BURLISON. Mr. Chairman, I rise today in support of this amendment  that ends Federal funding for the National Endowment for Democracy, a  program that Elon Musk, while leading DOGE, publicly said was a scam,  that it was rife with corruption and an evil organization that should  be dissolved. President Trump and his administration…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699049/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}]