[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…incredible thing about democracies: People  write  in, they send emails, they call our offices, they show up at townhall  meetings, and they tell us what they think.\n\nIn this email, she said:\n\nWe need to draw the line and say this is enough.\n\nI couldn't agree more.\n\nToday, the day has been a really hard time. I was on a TV program  earlier, and there…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689542/h-con-res-14"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…person who has become a scientist, helping us  on very important research that is really good for the American people.\n\nBoom. They go to work, or they are at home. They get an email, and  they say: Don't show up for work; you are fired.\n\nThere is a certain cruelty in a lot of these notices because it also  has an assertion that your performance has been…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688257/department-of-health-and-human-services"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…breaking that promise.\n\nIn the last month, thousands of VA employees, people who care for our  Nation's veterans, were fired with no warning, no phone call, no  meeting--just an email telling them that they no longer had a job, that  they were no longer wanted. These aren't just nameless, faceless  bureaucrats; these are Americans who signed up to serve…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688446/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…deal with several, you would  call several.\n\nWhen you seek a mortgage loan, of course the mortgage lender has to  look at your credit report, so they call Equifax or whoever or email  Equifax and get your credit report. Then the credit bureau sells that  information--which you don't want divulged and which the lender doesn't  want divulged--to other financial…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692804/homebuyers-privacy-protection-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…resolution, and it  is a whopper. The CBO estimates that this resolution would cost  American taxpayers $7.2 billion over the next 10 years.\n\nMr. Speaker, I include in the Record an email from CBO regarding  this.\n\nH.J. Res. 35 would disapprove a final rule published by the       Environmental Protection Agency in November 2024 that       implemented a requirement…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…employee, a woman who worked at the Marion VA  Medical Center in southern Illinois. Every year, this facility serves  43,000 veterans.\n\nLike many VA employees, she received an email in the middle of the  night informing her that she was fired from her logistical job that  ensured the rural hospital's lab had what it needed for patient care.  Her supervisor…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688591/recognizing-federal-employees"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…required to provide weekly accounts of ``five things'' we       accomplished, as though our decades of service meant nothing.       They dictated what we could use in our email signatures and       instilled paranoia in every aspect of our jobs--all with the       support of the man elected to lead our country.\n\nIn a shocking turn of events, Musk…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…DHS.gov.''\n\nHe told four Members of Congress, including a Member of Congress who  is the Member of Congress in that jurisdiction of where that holding  center is: ``Just send an email.''\n\nMr. Speaker, I want to make sure that people understand. We have sent  emails, and we have sent letters. I want to make sure that the American  people understand what is…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…the--now  former--headquarters.\n\nIf this was an honest review, the Trump administration would not have  recalled 95 percent of USAID's global workforce after cutting off their  email access without warning and putting their security at risk, while  those staff were waiting for instructions to conduct the so-called  ``review.''\n\nThey would not have, prior…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…the moon. We invented the polio vaccine and  DNA sequencing. We invented the microchip, the internet, and GPS.  Americans invented the airplane, the lightbulb, television, and email,  and we fed the world with our innovations in food and agriculture.\n\nOver the last 3\\1/2\\ months, we have seen an unprecedented attack on  our Nation's science and technology,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691393/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…actions of President Trump are a direct threat  to making good on that promise, specifically for children with  disabilities.\n\nIn February, parents in Georgia received this exact email, telling  them that year-round counseling and support services meant to assist  them and their disabled child in transitioning from high school to  adulthood have been discontinued--overnight,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689642/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…by New York  law enforcement of multiple bomb threats made against my offices in  Rochester, Binghamton, and Long Island. The bomb threats against my  offices came with the email subject line ``MAGA'' and from an email  address alleging the ``2020 election was rigged.''\n\nLocal and Federal law enforcement responded immediately and are  conducting full…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697230/political-violence"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…sick veterans.\n\nDebbie loved her job, she was good at her job, and she went to work  every day to serve her community and to help our veterans. A week ago,  Debbie received an email telling her she no longer had a job. She  wasn't fired because veterans were suddenly cured or because her work  was no longer needed. Donald Trump and his unelected tech billionaire,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687961/debbie-va-employee"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…unneeded, even if you feel that way, I think we can all  agree that there is a better way to treat somebody than sending a 20- year worker, a 15-year worker, a 10-year worker an email on a Saturday  night saying you are out of a job on Monday morning.\n\nThere are better ways to run a country. There are better ways to run  a business. It is not necessary to…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688514/people-not-statistics"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…they are at a holding center where they should have been going  through due process.\n\nUnfortunately, there is no transparency there because what they end  up saying is, send an email or transparency only works when it is  convenient to the Republicans.\n\nI just want to say it is really hypocritical to hear my colleagues  here talk about transparency when…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693072/special-interest-alien-reporting-act-of-2025"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…Securities and  Exchange Commission to promulgate rules with respect to electronic  delivery of certain required disclosures to investors.\n\nHere is what that means: If you have an email, you are able to  receive these documents electronically. You are not forced, but you are  able to get it. If you don't have an email, by definition you don't  even qualify.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697832/increasing-investor-opportunities-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…with a discredited witness with a vendetta  against President Trump. Unsurprisingly, Democrats have been silent  about their colleague's coordination with Epstein.\n\nAnother email shows Democrat fundraisers invited Epstein to an event  or to meet privately with Hakeem Jeffries as part of their 2013 effort  to win a majority. Hakeem Jeffries' campaign…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696808/epstein-files-transparency-act"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Democratic managers of the resolution, while  seated or standing at the managers' desk, to be permitted to deliver  floor remarks, retrieve, review, and edit documents, and send email and  other data communications from text displayed on wireless personal  assistant devices and tablet devices.\n\nCon. Res. 14.\n\nMadam President, I call up my amendment No. 1717.…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689515/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…released 65,000 pages of files in just 10 months.\n\nMeanwhile, my colleagues on the other side of the aisle have largely  ignored this issue. It was Democrats who redacted an email to mislead  the American people about the truth of a witness that exonerated  President Trump. It was a Democrat, Representative Plaskett, who  literally texted with Jeffrey…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696812/epstein-files-transparency-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…state offices, and Senate       committees; and 1 private sector ethics briefing.\n\nIn 2025, the Committee staff handled approximately 12,974       inquiries (via telephone and email) for ethics advice and       guidance.\n\nIn 2025, the Committee wrote approximately 1,023 ethics       advisory letters and responses including, but not limited to,       822…", "date": "2026-01-29", "source_url": "https://justfacts.votesmart.org/public-statement/1699425/us-senate-select-committee-on-ethics-annual-report"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Undersea Cable Protection Act of 2025. This bill is about  infrastructure most Americans will never see but every single one of us  rely on every single day. From sending an email to making a phone call  to moving money across the globe, undersea cables are the backbone of  the modern world.\n\nIn fact, undersea cables carry more than 95 percent of global…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…do a  chat, like a ChatGPT, that picks up the phone 24 hours a day, will stay  on the phone as long as the caller needs, will help them fill out the  tax forms, will actually email or text the PDF of the form, and maybe  even send the YouTube video on how to fill out the form.\n\nWhy does this scare the hell out of the IRS? It is because the IRS is  the…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…blue issue. Everyone, on both sides of  the aisle, should want our government to operate as effectively and  efficiently as possible.''\n\nHe adds: ``Outrage over Elon Musk's email surprised me.\n\n``I couldn't believe the outrage on social media and broadcast news  because DOGE asked government employees to write down five things they  did at work the…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688492/demanding-transparency-efficiency-and-accountability-from-our-government-is-not-extreme"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…committee meetings will normally be       sent by the committee's staff director to all members at       least three days in advance. In addition, the committee staff       will email or telephone reminders of committee meetings to       all members of the committee or to the appropriate staff       assistants in their offices.\n\n(d) A copy of the committee's…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688786/joint-committee-of-congress-on-the-library-rules-of-procedure"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…to be scrutinized and publicized.\n\nRegarding privacy concerns, I do want to point out that these  individuals are often happy to voluntarily publish their own names,  their email addresses, and their donors when it comes to their own  published works. Many universities have open directories on their  websites. However, the DETERRENT Act does have a…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…what records were  in the files of the executive branch of government until I transmitted  whistleblower disclosures to that same executive branch, the most  recent being the email about an FBI agent wanting to criminally  investigate Elon Musk. This, too, is not a scandal that the Times would  like to imply because that is called good government oversight,…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…syndrome that the left has, but I know  one thing: It is real.\n\nWhich brings me to last week.\n\nLet's think about what the Democrats did last week. The Democrats  released an email that the Oversight Committee had obtained from the  estate, an email from Mr. Epstein to Ms. Maxwell. When the Democrats  released it, they redacted the victim's name. That…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696818/epstein-files-transparency-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…us. We do know that 34 percent  of National Park Service employees across the country were still  working from home in 2023. Need to find the nearest unlocked restroom?  Just email them.\n\nIndeed, the employees who provide most of the visitor amenities, such  as the hotels, shops, and restaurants, don't even work for the Park  Service. They work for the…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688585/yosemite-belongs-to-the-people"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…dating service provider.\n\n(3) Manner and timing.--\n\n(A) Manner.--A fraud ban notification under paragraph (1)       shall be--\n\n(i) clear and conspicuous; and\n\n(ii) provided by email, text message, or, if consented to       by the member receiving the fraud ban notification, other       appropriate means of communication.\n\n(B) Timing.--\n\n(i) In general.--Except…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692730/romance-scam-prevention-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…services provided under this chapter. Each       regional office of the Department shall include, on the       website of the regional office, a name, telephone number, and       email address, through which veterans may receive information       about services provided under this chapter.''.\n\n(b) Requests for Extensions of Programs: Timely       Consideration;…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699486/veterans-readiness-and-employment-improvement-act-of-2025"}]