[{"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…for recognition but because  she believes in the power of community.\n\nSouthern Arizona is stronger because of people like Rose. Her  determination, compassion, and service embody the very best of us.\n\nMr. Speaker, I thank Rose for everything she does for Tucson. We are  grateful beyond words. I congratulate her on her new grandbaby.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699984/recognizing-rose-taulton-volunteer-of-the-year"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…construction and voyages of the Hokule`a,  reawakened the ancient art of navigation and connected Native Hawaiians  with their voyaging ancestors.\n\nToday, Native Hawaiians continue to embody resilience and leadership.  Their revival across all enriches not only Hawaii but also the entire  Nation, offering a living example of perseverance, identity and  contribution.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695915/recognizing-hawaiian-history-month"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Instead of being defined by the discrimination and the doubts of  those around them, they became one of the most successful pursuit  squadrons in our military. They went on to embody the true meaning of  Black excellence.\n\nThey left a segregated country to fight in a segregated Army and  painfully returned to a country that still did not treat them with…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…benefitted countless families  across Hampton Roads.\n\nToday, under the leadership of Senior Pastor Reverend Charles Ricks,  Jr., and Pastor Lori Ricks, Bethel Temple continues to embody faith in  action. Through partnerships with local organizations and tireless  service for the Hampton community during the COVID-19 pandemic, they  have strengthened the church's…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696401/recognizing-the-70th-anniversary-of-bethel-temple-church-in-hampton-virginia"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…Award  Girl Scouts demonstrate significant initiative, commitment, and  leadership, distinguishing them from their peers. Through their  resourcefulness and perseverance, they embody the Girl Scout Law to  truly make the world a better place.\n\nPaige's project, ``Growing Hope'', in partnership with Growing Roots,  addressed the challenge of finding accessible…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694162/recognizing-paige-kitts"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…the graduates have accomplished so much.  From inspiring performances on the stage to hard-fought victories on  the field and a true commitment to serving our community, they embody  what it means to be a Freedom Eagle.\n\nTheir passion for change and dedication to making a difference is  clear, especially through the efforts of their JROTC cadets, who have…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…basic fundamental rights, demonstrate independence and  integrity, and remain faithful to the Constitution and the rule of law.  Neither of these nominees has proven that they embody these attributes.\n\nI will vote against both of these nominees. I urge my colleagues to  do the same.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693940/judicial-nominations"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Christian  community. Parishes such as Saint Andrew Orthodox Church remind us of  the enduring presence of Eastern Orthodox faith in Southern California.  These communities embody the values Patriarch Bartholomew champions-- reverence, beauty, responsibility, and peace.\n\nHis visit to our Nation's capital is not just a symbolic moment; it  is an opportunity…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695408/recognizing-the-accomplishments-of-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…stories  of women and people of color aren't skipped over because they are  inconvenient.\n\nThis is all critical to our national security and strong democratic  principles that we embody abroad. It is for these women and the  hundreds of thousands of women serving our Nation at home and abroad  that I am here today.", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689167/womens-history-month"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, I rise today to recognize the recent  Valor Award winners and honorees from Fauquier County, individuals who  embody courage and service.\n\nSponsored by the Fauquier Chamber of Commerce, the Valor Awards  highlight the critical work local law enforcement and first responders  do every day…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690556/recognizing-valor-award-winners-and-honorees-from-fauquier-county"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…the community's  appreciation for the arts, outdoor recreation opportunities, and small  community feel, along with the work of the more than 70 nonprofit  organizations that embody the town's attitude of ``taking care of  ourselves and our neighbors.''\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to celebrate…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692111/recognizing-evergreen-colorado"}, {"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "…Senior Hall of Fame honors exemplary residents  aged 60 and older who have selflessly dedicated five or more years to  volunteer service in Broward County. These individuals embody the  spirit of civic engagement and community service that strengthens the  social fabric of our region.\n\nThis year's distinguished honorees are Linda Hill Anderson, Sandra…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691691/recognizing-the-2025-honorees-of-the-broward-county-florida-senior-hall-of-fame"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…Award Girl Scouts demonstrate  significant initiative, commitment, and leadership, distinguishing them  from their peers. Through their resourcefulness and perseverance, they  embody the Girl Scout Law to truly make the world a better place.\n\nI congratulate and include in the Record the following outstanding  young women:\n\nElizabeth Babcock, Troop 3230…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694102/recognizing-gold-award-girl-scouts-from-eastern-missouri"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…focus on locally-rooted  leadership. TFA Hawaii has recruited 259 corps members and alumni who  are kama`aina, born and raised in our islands, including 89 Kanaka  Maoli. They embody the sense of kuleana and community responsibility  necessary to provide critical education support for our keiki.\n\nThe impacts of our TFA Hawaii kumu--or teachers--have lasted…", "date": "2025-10-14", "source_url": "https://justfacts.votesmart.org/public-statement/1696215/congratulating-hawaii-teach-for-america-teachers"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…integrity to America's patent system.\n\nInnovation is the beating heart of American progress. From workshops  and factories to classrooms and garages, inventors across our Nation  embody the creativity, determination, and optimism that define the  American spirit. They turn ideas into opportunities and dreams into  progress.\n\nYet too many inventors face an…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696400/reintroduction-of-the-balancing-incentives-act-of-2025"}, {"senator": "John Rose", "party": "Republican", "sentence": "…prestige, history,  and continued relevance.\n\nThere are fewer than 100 members of the Grand Ole Opry. It is indeed  an elite crowd of men and women who made the world better, who embody  country music, and who are part of our shared heritage as Americans. In  fact, that membership sits at the top of dozens of obituaries among  some of our Nation's finest performers.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689807/congratulating-the-grand-ole-opry"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…change.  Eagle Scouts demonstrate significant initiative, commitment, and  leadership, distinguishing them from their peers. Through their  resourcefulness and perseverance, they embody the Scout's Oath to `help  other people at all times.'\n\nWyatt's project, ``Blessing Bags'', was an excellent endeavor to  address homelessness in our community. Wyatt acted…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693623/recognizing-wyatt-dickinson-eagle-scout"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Iowans face to face. No topic is off limit, and Iowans set the agenda.\n\nEach year, the Drake University Ray Center celebrates ``Iowa  Character Awards'' to recognize those who embody civic values. The  people of Spencer, IA, will receive the ``Community Character Award''  of 2025 in recognition of their efforts to recover from devastating  floods the summer…", "date": "2025-10-20", "source_url": "https://justfacts.votesmart.org/public-statement/1696289/national-character-counts-week"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…finish line with their hands joined  together, marking an astounding new achievement that has been a goal of  theirs for over two decades.\n\nTogether, Heather and Jeremy Reynolds embody perseverance, teamwork,  and competitive excellence. Their achievement serves not just as  personal fulfillment but also as an inspiration to their peers, fellow  competitors,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694130/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…to enshrine one of America's most extraordinary  minds and consequential patriots in the heart of our Nation's Capitol.\n\nMadam Speaker, few figures in our history so fully embody the spirit  of American ingenuity, perseverance, and democratic virtue as Benjamin  Franklin. He was a statesman whose diplomacy secured our independence,  a philosopher whose…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688220/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "Mr. DOWNING. Mr. Speaker, in honor of America's 250th birthday,  Members of Congress from the Treasure State are highlighting  exceptional Montanans each month who embody the spirit of our great  state and Nation.\n\nLast year, rodeo was officially recognized as Montana's state sport.  It's only fitting that the first Montanan I honor is Havre…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699393/recognizing-rodeo-hall-of-fame-member-flint-rasmussen"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…only serve with dedication but inspire everyone around them. Martha  and Vincent are such a team. Partners in life and in service, this  dynamic Army Veteran duo continues to embody the very best of the  American Red Cross. After a lifetime of service in the military, they  chose to extend that calling with the American Red Cross for the last  five years--and…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691268/recognizing-martha-narvaez-and-vincent-leandry"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…during medical  emergencies. The squad has logged thousands of hours administering  emergency assistance to others exemplifying the spirit of sacrifice and  volunteerism that embody New Jersey's 7th Congressional District.\n\nI ask my colleagues today to join me in commending this exemplary  organization and congratulating them on 80 years of extraordinary…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695189/recognizing-chester-first-aid-squads-80th-anniversary"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Veteran of the Month for July  2025 from Michigan's 9th Congressional District. His exceptional  military career and steadfast commitment to duty, excellence, and  patriotism embody the very best of American service.\n\nRichard Loughran answered the call to serve his country at the young  age of 17--with his father's permission--when he enlisted in the United…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693382/recognizing-united-states-marine-sgt-richard-loughran-as-july-2025-veteran-of-the-month"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "Mr. OWENS. Mr. Speaker, I rise today to recognize the Utah Pipe Band  and the Barclay School of Highland Dance--two groups that embody the  spirit of tradition, excellence, and service.\n\nFor over a century, the Utah Pipe Band has honored our heroes,  playing at Memorial Day events across our great state, competing…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690066/recognizing-the-utah-pipe-band"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…of the Month for  September 2025 from Michigan's 9th Congressional District. His  exceptional military career and steadfast commitment to duty,  excellence, and patriotism embody the very best of American service.\n\nMaster Sergeant King is a native of Houston, Texas, who answered the  call to serve his country in February of 1994 at the young age of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695000/recognizing-united-states-army-master-sergeant-tommy-j-king-as-september-2025-veteran-of-the-month"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…Award Girl  Scouts demonstrate significant initiative, commitment, and leadership,  distinguishing them from their peers. Through their resourcefulness and  perseverance, they embody the Girl Scout Law to truly make the world a  better place.\n\nVictoria's project, ``Pet Resource Central,'' in partnership with the  Community Resource Center of Punta Gorda,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690466/recognizing-victoria-morton-gold-award"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…Award Girl  Scouts demonstrate significant initiative, commitment, and leadership,  distinguishing them from their peers. Through their resourcefulness and  perseverance, they embody the Girl Scout Law to truly make the world a  better place.\n\nHarley's project, Community Food Pantry, in partnership with the  DeSoto County Sheriff's Office, Stamp Our Hunger,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690443/recognizing-harley-cross-gold-award"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…support for those living with  autism. In 2023, he was appointed to the New York State Council on  Developmental Disabilities because of his advocacy and dedication,  which embody the spirit of community involvement and empowerment.\n\nVincent's selfless efforts make a difference every day, and I am  grateful for his dedication and friendship.\n\nAs we observe…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689495/recognizing-april-as-national-autism-awareness-month"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…Award Girl  Scouts demonstrate significant initiative, commitment, and leadership,  distinguishing them from their peers. Through their resourcefulness and  perseverance, they embody the Girl Scout Law to truly make the world a  better place.\n\nDakota's project in partnership with Valerie House was an excellent  endeavor to address youth mental health and…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690441/recognizing-dakota-partelow-gold-award"}]