[{"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "Mr. Speaker, as a special accommodation for their smaller size and to  reduce their regulatory burden, emerging growth companies, known as  EGCs, are typically only required to provide 2 years of audited  financials when they first go public. Other public companies, on the  other hand,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693856/greenlighting-growth-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…those that involve accounting and auditing.\n\nMr. Speaker, I rise in support of H.R. 3301, the ELEVATE Act of 2025,  sponsored by the gentlewoman from Iowa (Mr. Nunn).\n\nEmerging growth companies, also known as EGCs, are a special type of  public company that we created during the bipartisan JOBS Act of 2012.  Unlike full-fledged public companies, EGCs…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692760/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…(15 U.S.C.       77e(d)) is amended--\n\n(1) by striking ``Notwithstanding'' and inserting the       following:\n\n``(1) In general.--Notwithstanding'';\n\n(2) by striking ``an emerging growth company or any person       authorized to act on behalf of an emerging growth company''       and inserting ``an issuer or any person authorized to act on       behalf…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692737/encouraging-public-offerings-act-of-2025"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…that is a year's worth of  an entire payroll for multiple employees.\n\nMy ELEVATE Act, included in this package, fixes this challenge. It  reduces auditing requirements for emerging growth companies from 3  years to 2 years, cutting costs while protecting investors.\n\nIowa's innovators and America's innovators are creators of solutions  that help feed the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697824/increasing-investor-opportunities-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the rules and  pass the bill (H.R. 3343) to amend the Federal securities laws to  specify the periods for which financial statements are required to be  provided by an emerging growth company, and for other purposes, as  amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 3343\n\nBe…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693855/greenlighting-growth-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…Speaker, I move to suspend the rules and pass the  bill (H.R. 3301) to amend the Securities Exchange Act of 1934 to  specify certain registration statement contents for emerging growth  companies, to permit issuers to file draft registration statements with  the Securities and Exchange Commission for confidential review, and for  other purposes, as amended.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692762/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…the bipartisan work of this very Chamber, particularly with the  passage of the JOBS Act 13 years ago.\n\nOne of the biggest successes of that law was the creation of the  emerging growth companies, or EGCs, to encourage smaller companies to  go public here right in the United States.\n\nThe JOBS Act didn't expand just that opportunity, it created new  jobs.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692761/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}]