[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…giving legal advice about research agreements,  intellectual property licensing and smart phone application  submissions.\n\nAfter her first five years at the VA, Maryam saw an emerging need to  create a legal team devoted to health research and innovation. Maryam  was entrusted with the responsibility of nurturing the VA's first  Specialty Team Advising…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695862/congratulating-ms-maryam-azarion-on-her-retirement-after-more-than-25-years-of-federal-service"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…battle to pancreatic cancer  in 2021, this legislation would expand access to cutting-edge cancer  screenings for America's seniors, ensuring Medicare coverage for these  emerging tools once they become FDA approved.\n\nI am immensely grateful that this bill was led by Republican sponsor,  Congressman Jodey Arrington, and the many organizations and patient…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699298/we-will-beat-cancer"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…businesses who will be potentially  impacted.\n\nWhat we need is a measured, transparent approach that prioritizes  public safety while preserving a viable path forward for an emerging  American industry. Once the government is reopened, I look forward to  working with my colleagues to restore certainty and stability for  farmers in North Carolina and throughout…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696722/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…broadened  opportunities and raised the profile of women's sports. As a resident  of the Bay Area for over three decades, Michelle also has celebrated  and supported the talent emerging from local programs like Stanford,  Cal, and the newly launched Golden State Valkyries of the WNBA.\n\nIt is my honor to acknowledge Michelle Smith-McDonald's induction  into…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689730/9999"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…abandoning our values. We are surrendering  one of the world's fastest growing marketplaces to China.\n\nLet's be clear: Regions we assist aren't just aid recipients. They  are emerging economies and future trading partners. Pulling back opens  the door for authoritarian regimes like China to dominate the future,  commerce, connectivity, and development.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…Gene also spearheaded the creation of GAO's Innovation Lab,  which has strengthened oversight capacity through the use of data  science, artificial intelligence, and other emerging technologies.\n\nThroughout his career, Gene has been a steadfast defender of  Congress' power of the purse. His work has been especially important to  the Budget Committee,…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698464/commending-the-honorable-gene-dodaro"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…joint address to Congress. I will take my time and my  privilege as a duly elected Member of this Chamber to share some of the  sentiments about the state of the Union that is emerging very clearly  and loudly from Michigan and on behalf of my constituents.\n\nFirst and foremost, tariffs that are coming down today on Canada are  wreaking havoc on autoworkers,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688410/a-serious-and-profound-moment"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…deeper collaboration  between these two agencies, enabling our research and agriculture  communities to fully utilize the opportunities presented by a broad  range of new emerging technologies.\n\nWith this, I encourage all my colleagues to support this bill.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689015/doe-and-usda-interagency-research-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…financial risk.\n\nDodd-Frank created the Financial Stability Oversight Council, or  FSOC, to identify risks to financial stability, promote market  discipline, and respond to emerging threats to our economy.\n\nFSOC brings together the heads of 15 financial regulatory bodies,  giving it a unique, systemwide view of the American financial system.  Among its…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699823/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…reflecting the       pioneering innovation and transportation legacy of the       region; and\n\nWhereas, Fulton County was one of the last counties       organized in Ohio, emerging from the resolution of the Toledo       War and the shifting of state lines that helped shape the       boundaries of Northwest Ohio; and\n\nWhereas, from its early seat in…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693801/proclamation-for-fulton-countys-demisemiseptcentennial"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…stress some of these agencies may  face in being underfunded and understaffed.\n\nH.R. 1770 would require the Consumer Product Safety Commission to  stay up-to-date on new and emerging technologies by integrating them  into their daily agency functions. It also requires the Federal Trade  Commission to study blockchain technologies and tokens.\n\nThe CPSC…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693412/consumer-safety-technology-act"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…U.S.-based nonprofit  organizations, local partners, and frontline democracy defenders in  dangerous contexts will be put in immediate jeopardy, undermining  efforts to support emerging democracies and those resisting  authoritarian rule like the brave protesters in Iran.\n\nIn places like Nicaragua, Venezuela, Cuba, North Korea, Hong Kong,  Tibet, Burma and,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699042/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…such places as former Yugoslavia, advocating for peace-building  measures to diffuse global conflict in the region, while supporting  many traditionally Orthodox countries emerging from decades of wide  scale religious persecution and oppression behind the Iron Curtain.  Moreover, he has initiated international meetings and theological  conversations…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695051/recognizing-his-all-holiness-bartholomew"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…minority in any  way, there is nothing, nothing potentially divisive about a swastika.  It is just about the most unmistakable hate symbol in existence.\n\nNow, this is part of an emerging pattern on the right. Young  Republicans were texting about gas chambers. Trump officials were  talking about having a Nazi streak. Tucker Carlson interviews Nick  Fuentes,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Group,  led by the Assistant Secretary, to prepare for and respond to supply  chain shocks by mapping, monitoring, and modeling U.S. supply chains  for critical industries and emerging technologies in consultation with  the private sector. The group will identify any gaps or vulnerabilities  for critical goods, including any gaps in manufacturing, warehousing,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692997/promoting-resilient-supply-chains-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Act, which  provides long-overdue updates aimed at protecting the future of digital  assets, encouraging growth, and protecting American consumers.\n\nThe days of stifling this emerging industry through litigation and  rogue rulemaking must end. The Securities and Exchange Commission under  former Chair Gary Gensler went far outside the agency's statutory…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693772/digital-asset-market-clarity-act-of-2025"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…sales on Federal lands.\n\nIt authorizes the sale of expanded spectrum megahertz to strengthen  rural broadband and secure America's technological dominance in AI and  other emerging technology.\n\nIt creates permanent fees that illegal immigrants must pay for their  applications so American taxpayers aren't saddled with covering these  costs.\n\nIt protects…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…possible picture of AI- related terror threats.\n\nThis is an issue that requires us to be proactive and outmaneuver any  group or individual seeking to do us harm with this emerging  technology. The Generative AI Terrorism Risk Assessment Act ensures  that our homeland security and capabilities remain ahead of adversary  tactics.\n\nOur response cannot…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696918/generative-ai-terrorism-risk-assessment-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…errors in data, recognize and quantify       uncertainty in data, visualize and analyze data, and use data       to develop understanding or make predictions.\n\n(7) Rapidly emerging fields, such as artificial       intelligence, machine learning, quantum computing and quantum       information, all rely on mathematical and statistical       concepts,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…resources, law enforcement was  able to focus on our region's most violent and repeat offenders;  strengthening public safety, national security, and our ability to  respond to emerging threats.\n\nThis kind of success doesn't happen by accident. It takes planning,  trust, and exceptional teamwork. I commend the U.S. Marshals, Spokane  County Sheriff's Office,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695071/operation-rolling-thunder"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…Deploying American  Blockchains Act of 2025, bipartisan legislation that I am proud to lead  alongside my colleague Representative Darren Soto.\n\nThis bill is about far more than emerging technology. It is about  securing America's future, economically, strategically, and  technologically, in an increasingly digital world.\n\nBlockchain technology is not a passing…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692731/deploying-american-blockchains-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…carrying out the assessment under       subsection (a), the National Academy of Sciences shall--\n\n(1) describe the potential benefits and limitations of       current and emerging unmanned, autonomous, or remotely       controlled systems used in the maritime domain for--\n\n(A) ocean observation;\n\n(B) vessel monitoring and identification;\n\n(C) weather…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…our systems, particularly for small and rural utilities.\n\nThe Electric Supply Chain Act will boost these efforts by putting DOE  in the driver's seat to attentively monitor emerging threats and allow  the Department to utilize their existing authorities to address  vulnerabilities.\n\nIn recent years, we have seen how supply chain constraints and  bottlenecks…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697897/electric-supply-chain-act"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…from the bipartisan work of this very Chamber, particularly with the  passage of the JOBS Act 13 years ago.\n\nOne of the biggest successes of that law was the creation of the  emerging growth companies, or EGCs, to encourage smaller companies to  go public here right in the United States.\n\nThe JOBS Act didn't expand just that opportunity, it created new…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692761/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…on politically motivated       grounds and drop any pending charges against them;\n\n(11) to call on the Government of Georgia to thoroughly       investigate all allegations emerging from the recent national       elections, which took place on October 2024, make a       determination whether the elections should be judged as       illegitimate and hold…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…bill (H.R. 2444) to establish a critical supply chain resiliency and  crisis response program in the Department of Commerce, and to secure  American leadership in deploying emerging technologies, and for other  purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 2444\n\nBe it enacted…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…Intelligence, Foreign Affairs, and Agriculture Committees.\n\nHis accomplishments continue to be recognized by his alma mater,  receiving the 2024 Houston Christian University Emerging Leader Award,  an honor bestowed upon alumni from the past decade who have achieved  early career success and made a positive impact in their communities.\n\nToday, Bryan continues…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697548/recognizing-and-expressing-gratitude-to-former-chief-of-staff-bryan-brody"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…invisible wounds. While traditional treatments work for some, far too  many are left cycling through ineffective medications, suffering in  silence, or worse, giving up entirely.\n\nEmerging VA studies involving MDMA and psilocybin show remarkable  potential not just for improvement but for truly lasting healing. They  offer hope, but hope alone doesn't heal.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692940/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "Mr. GARBARINO. Madam Speaker, I move to suspend the rules and pass  the bill (H.R. 1608) to require the Secretary of Homeland Security to  produce a report on emerging threats and countermeasures related to  vehicular terrorism, and for other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…mandate still exist today. Don't just take my word for it. Listen to  the words of an NTSB Board member, who said in their final report:  ``While we laud ADS-B systems as an emerging technology in commercial  fixed-wing and rotorcraft aviation that could have prevented this  accident, it is still exactly that, an emerging technology. There are  still technological…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}]