[{"senator": "Judy Chu", "party": "Democrat", "sentence": "…partnership on this bipartisan bill, which was reported out of the Ways  and Means Committee unanimously last month.\n\nEach year, States like California declare State-level emergencies for  disasters like wildfires, hurricanes, floods, or earthquakes. Under  current law, disaster victims can only receive Federal filing relief if  and when the President…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689384/filing-relief-for-natural-disasters-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…alongside with Congresswoman Stephanie  Bice of Oklahoma. Our goal is to ensure our officers have the tools  they need to effectively and safely respond to mental health  emergencies.\n\nEvery day, law enforcement officers across our Nation are called to  situations where individuals are experiencing mental health crises.  These moments can be unpredictable,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689347/help-our-country-become-a-safer-healthier-place-for-all"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…headquarters in North Scituate, where they remain to this day.\n\nDuring their 100 years, they have been known for excellence in  disrupting organized crime, responding to emergencies, solving complex  financial and cybercrimes, and keeping the roads safe and traffic  moving. They also have a history of lending a hand to other States in  their times of…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689770/hands-off-social-security"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…be cut.\n\nAcross Delaware, rural hospitals are doing more than just providing  care. They are holding communities together. They are delivering  babies. They are treating emergencies. They are caring for aging  parents. They are anchors of both health and economic stability.\n\nUnder this budget, all of that is at risk. For rural hospitals, it  means more…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692901/keep-rural-hospitals-open-as-lifeline"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…organization located in the heart of my district in  Alexandria, Virginia. This organization plays a vital, yet often  overlooked, role in reducing the impact of large-scale emergencies and  disasters across the United States.\n\nAs the second largest nonprofit in the Nation, Good360 is leading the  way in providing responsible and efficient distribution…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694807/recognizing-good360-in-honor-of-national-preparedness-month"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…proven treatment to save the lives of malnourished children: ready-to- use therapeutic food, or RUTF. RUTF is the go-to treatment for  malnutrition in hard-to-reach areas and emergencies because it doesn't  require refrigeration, preparation, or any training to deliver. It is  nutrient rich, delivering essential nutrients and calories so people  can recover…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690808/funding-food-aid-for-malnutrition"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…bill that clarifies how  the agency is to implement a regulatory budget, and it is therefore  impractical.\n\nFinally, the bill does not include an exception for national  emergencies, meaning that if this bill had been enacted before the  pandemic, small businesses across the country might not have received  PPP assistance in a timely manner, if they…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697332/small-business-regulatory-reduction-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…their own healthcare  decisions. Since overturning Roe v. Wade, women across this country  have struggled, suffered, and even died. Doctors are forced to hesitate  even in emergencies, fearing prosecution, and State legislatures have  been emboldened to threaten medical practitioners in other States.\n\nAs Westchester County executive, I signed legislation…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692893/third-anniversary-of-dobbs-decision"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…funding for the Corporation for Public Broadcasting for any       broadcasts and media stations that disseminate information       during natural disasters and national emergencies.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693627/hr-4"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…vital role in ensuring the United States' strong  technological leadership.\n\nThis Federal agency is integral for getting people connected,  ensuring we can communicate in emergencies, and bolstering our  cybersecurity infrastructure. Yet, Congress has not reauthorized NTIA  in over 30 years.\n\nThe pace of innovation and demand for connectivity has increased…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690255/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Ami Bera", "party": "Democrat", "sentence": "…720,000 people across 359 square  miles. With 41 fire stations and more than 700 dedicated members, they  stand ready around the clock to respond to fires, rescues, medical  emergencies, and more to save lives and protect property.\n\nTheir mission says it best: ``professional and compassionate  protection,  education, and service to the community.'' That…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700044/recognizing-sacramento-metropolitan-fire-district"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Manager of the Year Award.\n\nAs the Jefferson County Sheriff's Office's Emergency Manager, Nathan  leads coordination and response plans during natural disasters and  other emergencies. He was instrumental in developing Jeffco's new  Emergency Operations Center. During the Quarry Fire in 2024, Nathan  managed the EOC and re-entry plans--ensuring all evacuees…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689320/recognizing-nathan-whittington"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…equipment and medications to make living at home  possible, seek mental health care due to the toll of living with this  disease, and receive treatment for any potential emergencies.\n\nDominique gets to live knowing the care she deserves is within her  reach, in her own words, thanks to Medicaid.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691523/gop-tax-scam-hurts-women-and-families"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…Canada and its eloquent Prime Minister Carney is both embarrassing and  alarming. Our country could not have a better neighbor or trading  partner than Canada.\n\nDeclaring emergencies where none exist, Trump delights in these  executive decrees for tariffs. He can act like a king, and he is  enabled to be a king-like figure on this issue by Republicans,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699975/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…spend their days  picking up trash at a cost of millions to the taxpayer.\n\nOur National Guard is designed and trained, indeed purpose-built, to  serve key roles in domestic emergencies, natural disasters, and in  deployment overseas. When we stray from that mission, we put our  national security at risk, and we disrespect these men and women.\n\nFor these…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695246/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…our local economies. They know their customers. They serve their  neighbors. They provide trusted financial tools like overdraft  protection to help families manage their emergencies.\n\nOverdraft protection is a critical tool that helps families avoid  declined transactions, bounced checks, and costly disruptions. It does  so transparently with clear…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689839/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Officer in several major ports, supervising cutters  and crews responsible for maintaining critical waterways and restoring  navigation systems following hurricanes and other emergencies.\n\nIn the later years of his career, CWO4 McInnis returned to senior sea  and staff assignments, conducting offshore buoy tending, environmental  response, and complex recovery…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698462/recognizing-united-states-coast-guard-cwo4-james-mcinnis-as-december-2025-veteran-of-the-month"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…whatever. We will just let the President  do whatever.\n\nLook, I supported President Trump. I still support President Trump on  many things. But I am not for a country run by emergencies. Even if the  person was doing what I wanted and was, you know, making every day my  birthday, I would not be for that unless we deliberated upon that.  There are constitutional…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…firefighters who have dedicated themselves to keeping our village safe.\n\nFor 150 years, these brave men and women have put their lives on the  line, responding to countless emergencies with unwavering courage.  Beyond their role as first responders, they connect with our community  daily and strengthen the bonds that make East Palestine a special place…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693528/congratulating-the-east-palestine-fire-department-for-150-years-of-service"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…critical  work of our Nation's emergency medical services professionals. These  brave men and women are often the first line of defense in moments of  crisis, responding to emergencies with speed, skill, and selflessness.\n\nWhether it is an accident on a rural road or a medical emergency in a  busy town center, EMS professionals are there to ensure that…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691586/recognizing-national-ems-week"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…funding, targeted training, disaster responsiveness, and  enhanced workplace safety. It empowers us to stand behind the men and  women who respond to more than 22 million emergencies each year.\n\nMr. Speaker, passing the EMS Counts Act is a decisive step toward  recognizing and strengthening this indispensable part of our public  safety infrastructure.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693039/supporting-our-first-responders"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…2.  Each day during the period from April 9, 2025,       through September 30, 2025, shall not constitute a calendar       day for purposes of section 202 of the National Emergencies       Act (50 U.S.C. 1622) with respect to a joint resolution       terminating a national emergency declared by the President on       April 2, 2025.\n\nMs. FOXX. Mr. Speaker,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…emergency.  The times are dire.\n\nThe Supreme Court has repeatedly said: There are no exemptions for  emergency.\n\nThere was no exemption for a pandemic. There was no exemption for  emergencies. The taxation clause stands.\n\nIt is an important part of the Constitution: Taxes must originate in  the House. They must be voted on in Congress. No one man can raise  taxes…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…careers. By allowing these brave men and  women the opportunity to conceal carry where it is normally restricted,  these local heroes will have the ability to respond to emergencies  whether they are on duty or not.\n\nLast Congress, I proudly supported this legislation on the House  floor, and this Congress I look forward to seeing this commonsense…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690998/delivering-on-president-trumps-agenda"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…in Congress  reevaluate how money is being spent in Washington and across the  Nation? Of course we should.\n\nFor far too long, our government has put the cost of not just  emergencies but everyday expenses on our Nation's credit card. Now, as  a result, our national debt is a staggering $36 trillion and growing  every day.\n\nMr. Speaker, I am willing to…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688322/putting-your-money-where-your-mouth-is"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…to reaffirm our  support for the law enforcement officers, from Utah to D.C., who put  their lives on the line every single day.\n\nThese officers aren't just responding to emergencies. They are  neighbors, trusted members of our communities, and our role models.\n\nToday, I also want to honor a fallen hero from my home State of Utah,  Sergeant Bill Hooser…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691165/events-this-week"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…to emergency spending. This is an addiction that needs to  be remedied. Shockingly, money used on emergency spending is rarely  paid back and most is never used for actual emergencies.\n\nFor example, emergency spending during the COVID-19 pandemic spent  $70 million on tourism marketing campaigns in Puerto Rico and another  $6 million to replace irrigation…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692496/rescissions-package-is-first-step"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…that said this: ``Each day for the remainder of the first session  of the 119th Congress shall not constitute a calendar day for the  purposes of section 202 of the National Emergencies Act.''\n\nMr. Speaker, I offered an amendment last night. I offered an  amendment last time we met in rules. We will keep offering amendments  to say you can't stop time.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the way out to July 31.\n\nLet's go out further in the text here. It says that these months  shall not constitute a calendar day for purposes of section 202 of the  National Emergencies Act with respect to various resolutions declaring  a national emergency. The National Emergencies Act is a statute that  gives the President the power to declare a state…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Res. 88\n\nResolved by the Senate and House of Representatives of the       United States of America in Congress assembled, That,       pursuant to section 202 of the National Emergencies Act (50       U.S.C. 1622), the national emergency declared on April 2,       2025, by the President in Executive Order 14257 (90 Fed. Reg.       15041) is terminated effective…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696492/terminating-the-national-emergency-declared-to-impose-global-tariffs"}]