[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…murmur, blood pressure issues, and constant bronchitis.  She was recently diagnosed with glaucoma and cataracts that are getting  worse.\n\nFor years, Gloria had to rely on emergency care at the hospital  because she was uninsured. Because she has Medicaid, she can have the  surgery she needs and see again. Don't take Gloria's healthcare away.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691506/gop-tax-scam-hurts-women-and-families"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…there is a rural hospital and that is the flagship hospital for a small  town, that might not be available to you. You might have to drive 2 or  3 hours for care, even emergency care.\n\nNo. 3, starting next year, tens of millions of people are going to  pay hundreds of dollars a month more for health insurance.\n\nThis is what, I think, we should linger…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…especially for critical-access  hospitals in our rural communities.\n\nI am proud of our work because I know what a lifeline our rural  hospitals are for Wisconsinites, from emergency care to having a place  to get regular checkups. But I know we have work to do.\n\nIn the past 10 years, 120 rural hospitals have either closed or  ceased offering inpatient services…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689545/h-con-res-14"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…self-employed and not yet eligible for Medicare. She has  relied on ACA coverage for 8 years, paying $350 a month.\n\nLast year, she suffered a head injury that required emergency care,  and ACA kept her bill around $1,000 instead of $10,000, saving her from  potential bankruptcy. She fears rising premiums. The ACA is her  lifeline, and without it, she…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698672/protecting-healthcare-for-millions-of-americans"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…to serve an entire community, regardless of their  income, regardless of insurance status, and regardless of immigration  status. Many of the services they provide, like emergency care, like  vaccinations, and public health outreach serve the public good.  Providing these services broadly in our communities keep us all  healthy.\n\nCommunity health centers…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…invest in cutting-edge medical technology.\n\nSo let's be clear. Let's be clear. Children from low-income families  would lose access to routine checkups, vaccinations, and emergency  care. Seniors who depend on Medicaid for long-term care, many of whom  are already exhausting their life savings, would be left without  options. People with disabilities who…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Speaker, I rise to celebrate what matters in America:  good character in the personhood of a remarkable woman, Heidi Hess,  whose quiet strength has shaped the very heart of emergency care in  northwestern Ohio. I thank Heidi for 36 years.\n\nHeidi stood at the front of the classroom at Owens Community College,  and she prepared over 1,000 men and women to…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698529/recognizing-heidi-hess"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…health deserts, mental health deserts, worker shortages, and more limit  people's access to care, sometimes forcing residents to travel 1 hour  or longer for primary and emergency care.\n\nThese communities that already need help accessing affordable,  quality care now face a growing crisis due to draconian cuts to  Medicaid and the big, ugly law signed…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697097/national-rural-health-month"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…primary care pediatrician, and get  diagnosed early with a mild pneumonia or an ear infection or whatever  the case may be, they would be forced to go to the emergency department  for that care.\n\nIt is not like they are not going to get sick. They are going to get  sicker, and they are going to go later when things are more expensive  and more complicated.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…set in motion a wave of chaos, cruelty, and control. What followed was  a full-scale assault on reproductive healthcare: abortion,  contraception, IVF, and even access to emergency care.\n\nIn Ohio, we felt the effects immediately. Just hours after the Dobbs  decision was handed down, an extreme and deeply unpopular 6-week  abortion ban went into effect,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692969/dobbs-decision-anniversary"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…normal amounts of pain because the staff  members they saw were not actual, qualified medical professionals.\n\nAs a result, these women ended up in the hospital, needing emergency  care and surgery to save their lives.\n\nIn Illinois, a woman seeking an abortion was deliberately misled by a  fake clinic. She was subjected to graphic videos and told that…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…and innovative care.\n\nStead is home to Iowa's only level 4 Neonatal Intensive Care Unit and  level 1 Pediatric Trauma Center, offering the highest levels of  critical and emergency care.\n\nIn 2020, Stead Family also earned the Gold Beacon Award for  excellence from the American Association of Critical-Care Nurses, the  world's largest specialty nursing…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696467/recognizing-stead-family-childrens-hospital"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Wagner observed a skier collapsed along the side  of the trail. Without hesitation, he stepped in to assist Nub's Nob ski  patroller Steve Biggs, who had begun providing emergency care. Sergeant  Wagner helped roll the  skier onto his back, positioned the head to open the airway, and  immediately initiated chest compressions.\n\nMembers of the Nub's Nob…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699808/recognizing-michigan-state-police-sergeant-dennis-wagner"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…treated for breast or       gynecologic cancer.\n\n(5) Providing particular information to veterans with       breast or gynecologic cancer, including--\n\n(A) how to seek emergency care at the emergency department       closest to the residence of the veteran, including that it is       generally advisable for veterans to notify the Department of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695420/women-veterans-cancer-care-coordination-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Speaker, in small towns and communities across  America, rural hospitals are critical lifelines. They provide emergency  care, support seniors and veterans, deliver behavioral health services,  assist mothers who are giving birth, supply pharmacy services, and  serve as major local employers.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696877/national-rural-health-day"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…$50 billion commitment to rural health  transformation.\n\nThis is $181 million to keep our rural hospitals' doors open, upgrade  critical infrastructure, expand access to emergency care, protect  maternal health, and strengthen Tribal health services.\n\nRural Washington is one of the best places in America to live, work,  and raise a family, and this investment…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698645/tax-relief-for-working-families"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…receiving $207 million  in first-year funding, the first of 5 years of support, to strengthen  rural healthcare statewide.\n\nThis funding will support hospitals and strengthen emergency care for  Hoosiers who can get that care close to home. For communities from  Connersville to Richmond and across Rush, Shelby, and Henry Counties,  this means quality care…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698777/rural-health-transformation-program"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…American.\n\nUnder the Biden-Harris years, Medicaid spending on illegal immigrants  surged 124 percent higher than under President Trump. In 2021 alone, $7  billion was spent on emergency care for illegal immigrants. Meanwhile,  Democrats in Washington and blue States are demanding we actually pay  even more.\n\nTo put this into perspective, as the Congressman…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}]