[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…position of Fire  Chief. While in this position of leadership, he did a commendable job  modernizing and expanding North Metro Fire, and he improved  collaboration for emergency services in surrounding communities.\n\nChief Ramos honorably served this community for decades through  numerous challenges, and he has been widely regarded as a mentor and a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695834/recognizing-fire-chief-david-ramos"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…injury.\n\nThe Secure Rural Schools program has been a lifeline for our rural  communities. It supports basic public services like keeping roads  paved, schools open, and emergency services running. Secure Rural  Schools was meant to be a bridge and not the final answer for our rural  communities.\n\nMr. Speaker, we still have a long way to go to deliver on…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697662/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…freeze,  put our servicemembers in harm's way.\n\nIt is why Congresswoman Kiggans and I wrote to the Secretaries of the  Army, the Navy, and the Air Force to ensure robust emergency services  that maintain safety and mission readiness across the Force.\n\nAcross the DOD, more than 8,800 civilian firefighters respond to  structural fires, aircraft emergencies,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695629/filling-firefighter-positions-on-military-installations"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…because the need would still be there.  The hunger would still be there. The poverty would still be there. It  would shift the cost onto our hospitals, our schools, and emergency  services.\n\nAlabama SNAP does more than just provide food for people. It also  supports, as it does across this country, our local grocers and grocery  stores. All of the statistics…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692812/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…in foreign assistance funding already appropriated by  Congress on a bipartisan basis. The recissions in this bill will cut  lifesaving  food assistance for families, emergency services for families fleeing  conflict, agriculture development programs, and core nutrition services  for children under five--just to name a few. This bill even goes as far…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692634/rescissions-act-of-2025"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…residents who do not  have representation in this body. They are our friends and our  neighbors. Beyond those who work in DC, Maryland partners with DC on  resources like emergency services, police, water, and more. This  bipartisan, stand-alone bill ensures that DC tax dollars stay in DC.  Again, these funds that have been cut are tax dollars that have…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688850/district-of-columbia-local-funds-act-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Americans support the ACA because it protects people with  preexisting conditions, provides free preventative care, and requires  coverage for essential health benefits like emergency services and  maternity care.\n\nThe ACA gave health insurance to millions of people, and improvements  made to the law made premiums more affordable. Failing to act and  failing…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698593/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Vista, Colorado for her 42 years of service with the Chaffee  County Communications Center.\n\nAnnette began her career as a public safety dispatcher in 1983 before  911 emergency services were available. Over the next 40 years, Annette  helped countless Chaffee County residents in their time of need. The  Chaffee County community will remember Annette's…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688126/recognizing-annette-stolba"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…They have already weathered the storm of COVID.  With new GOP-led cuts to provider fees, they may be forced to shut down  essential services--obstetrics, pediatrics, and emergency services,  care that literally keeps babies and people alive.\n\nThis is not just about one hospital in Hawaii. This is a national  crisis. Rural Americans face significantly worse…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691418/gop-tax-scam-hurts-everyone"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Fire Protection District.\n\nDeputy Chief Jeremy Metz has served the West Metro Fire Protection  District for over 27 years. In his previous roles, Jeremy oversaw  emergency medical services, administration, special teams operations,  and strategic planning for personal safety and benefit. He has over  three decades of on-the-ground experience in fire…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694725/recognizing-jeremy-metz"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…benefit our Nation but  will also help further the United States' ability to protect our  allies, as they, too, rely on these global satellite networks for  broadband and emergency services.\n\nI thank Chair Guthrie for working with me on this bipartisan bill.\n\nMr. Speaker, I urge all of my colleagues to support this timely  legislation to protect Americans…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690258/secure-space-act-of-2025"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…for the American people.\n\nSupporting the PILLAR Act is about more than technology. It is about  public trust. When a local government falls victim to ransomware and  emergency services are delayed, when a school district loses student  records, or when basic services are interrupted, citizens lose  confidence in those institutions.\n\nThis bill helps…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696789/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…its creation, Wyoming communities have received vital funding  to support infrastructure projects, public education, search and rescue  operations, and other critical emergency services. The program's lapse  in authorization has since threatened these essential functions, and  its successful reauthorization will assist countless Wyoming  communities…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697661/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Keokuk Area Hospital  project.\n\nSince Keokuk lost its hospital in 2022, residents have faced delays  in emergency and specialty care. No community should be left without  emergency services or forced to travel over an hour for lifesaving  treatment.\n\nThis funding will help reopen emergency services and create  outpatient specialty care, closing a major gap…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696794/highlighting-critical-investments"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…is a lifeline for rural  Utah communities.\n\nWhen timber revenues from Federal lands declined, it threatened the  ability of counties to fund their schools, roads, and emergency  services.\n\nCounties are responsible for providing these basic services, but what  if they can't?\n\nSRS steps in to fill that gap in counties with overwhelming Federal  land ownership,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697663/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…the resources, and the respect that  they rightfully deserve. Let us ensure that every town has the tools it  needs to thrive, from accurate mail delivery to reliable emergency  services to robust economic growth.\n\nThis is a moment to act with purpose.\n\nLet's be the bridge that heals this divide and make a meaningful  difference in the lives of our constituents.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}, {"senator": "Russ Fulcher", "party": "Republican", "sentence": "…portions of land in  their jurisdiction.\n\nWith this funding reauthorization, rural communities across Idaho  will be able to keep classrooms open, roads maintained, and emergency  services operating. However, a long-term solution is necessary, and I  will continue to advocate for one in Congress that ensures Idahoans  dictate Idaho affairs--not the federal…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697656/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…and a deep devotion to  protecting and serving his community.\n\nMr. Oltman began his service as a senior at Roanoke Benson High  School when the agency was known as the Emergency Services and Disaster  Agency. Throughout his career, he has held key roles in emergency  preparedness and response, including serving as Deputy Director, chief  storm spotter,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697208/congratulating-mike-oltman-on-his-retirement-with-the-woodford-county-emergency-management-agency"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…support and represent his  community with dedication, integrity, and care.\n\nHis commitment extends beyond the city limits. He serves as secretary  of the Rockwall County Emergency Services Corporation and represents  Royse City and Precinct 4 on the Rockwall County Transportation  Consortium Board, providing a strong and reliable voice for the people  he…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698298/recognizing-the-success-of-james-branch"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…support resources, as well as  a hotline for those without internet access. In under 30 seconds, a  victim can quickly connect to confidential help, shelter options, and  emergency services.\n\nWith the support from the Burleson Police Officers Association and  dedicated community stakeholders, this initiative has expanded,  reaching neighboring cities, rural…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693641/congratulating-aledo-bearcats"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…the world.\n\nAmerica led the way in the development and the deployment of 5G, an  important tool in our communications arsenal that connects millions to  everyday needs, emergency services when needed, and to one another.\n\nMake no mistake, our adversaries are aggressively working to exert  their own influence, their own values, and their own interests on…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693510/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…District, these funds support essential  water and public safety projects including a new EMS base in Swannanoa,  water and sewer upgrades at Swain Middle School, an emergency services  hub in Madison County, upgraded water lines in Robbinsville, and a new  taxiway on the west side at Asheville Regional Airport.\n\nFollowing Hurricane Helene, these investments…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699305/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…then goes on to explain how the impacts of the 2022 plan  ``are especially severe for the North Slope. Oil and gas development in  the NPR-A funds the Borough's schools, emergency services, and  infrastructure. It supports jobs for Inupiaq shareholders and  residents. It underwrites the continuation of our communities, even as  we maintain our subsistence…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…National Capital Region, the       Nation, and the multiple countries who grieve for the       victims; and\n\n(4) commends the heroic actions of the first responders,       emergency services personnel, and all those who aided in the       recovery efforts in freezing waters.\n\nMr. MANN.  Res. 153.\n\nMr. Speaker, I rise today in support of H. Res. 153, which…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688371/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Pennsylvania's 15th Congressional District, are located within national  forest lands, declining timber harvests can lead to chronic  underfunding of local schools, emergency services, and other projects  that rely on a strong tax base. As a result, Congress made a commitment  to provide resources to rural communities and schools that have tracts…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697653/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…across the country.\n\nHere is the gall of it all. New York even promotes free medical care  for illegal immigrants with official State flyers, encouraging them to  use emergency services. That is pretty rich.\n\nI mean, think about it. They are saying they are just using their  State tax dollars. That is not the truth. They are promoting, with  taxpayer…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}]