[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…provide votes. That is what we do in  the U.S. Senate--we vote. And on these votes, the Constitution is  involved. The provision of the Constitution commonly known as the  emoluments clause enables officials of the Federal Government--from a  sergeant in the Air Force or some other military branch to the  President of the United States--to accept payments…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…billions in Medicaid cuts.''\n\nThe New York Post continues: ``That not only looks bad; it creates  all kinds of conflicts of interest and runs smack into the  Constitution's Emoluments Clause, which prohibits foreign gifts.''\n\nThe Post Editorial closes: `` . . . but given all the foreign  investments and conflicts of interests--and now a $400 million plane--…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691089/new-york-post-editorial-on-qatari-jet"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…the aisle say nothing. Worse, some of them defend this conduct,  notwithstanding that they know it is unlawful, that it is violative of  our Constitution.\n\nWe have an Emoluments Clause, Mr. Speaker, for a reason. The Foreign  Emoluments Clause was one of the few provisions to survive and be  transferred from the Articles of Confederation to the Constitution…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699746/it-is-time-for-the-corruption-to-end"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…but know--that their representatives  are focused on them and this country only; that our loyalties are not  divided; that our minds are not wandering elsewhere.\n\nThe emoluments clause in the Constitution--it is a fancy phrase but a  simple idea: no foreign gifts. If a foreign government offers you  anything but especially something worth close to half…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690968/qatar"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…officials, including gifts. Although the president may       receive gifts, he or she may not ``solicit'' gifts. These       prohibitions begin with the Constitution's Emoluments Clause       and are reiterated in the U.S.'s anti-bribery statute, 18       U.S.C. Sec. 201, and federal regulations, 5 C.F.R. Sec. 2635.       Although section 2635.205 lists…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…$400- million plane from a country like Qatar, which is not exactly an  adversary country but certainly it is not an ally country. It is a  foreign country. The reason the Emoluments Clause was put in place in  the Constitution was to make sure that Presidents of the United States  of America, whether it is number one or number 47, are not tempted or  tested…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…benefit and use?\n\nAnd the answer to the American people is, yes, there is a law. In  fact, it is in the Constitution. It is a specific clause. It is called  the foreign emoluments clause. It states:\n\n[N]o person holding any Office of Profit or Trust under       them, shall, without the Consent of the Congress, accept of       any present, Emolument, Office,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691071/9999"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…everything, but instead it is the President of  the United States doing it.\n\nOur Founders said this should never be allowed. Hamilton noted the  reason that there is an emoluments clause in the Constitution. In  Federalist 22, he  said ``many mortifying examples of the prevalency of foreign corruption  in republican governments.''\n\nSo here were our Founders,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692355/motion-to-discharge-sj-res-54"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…unleashing terror on our streets, Trump's brazenly corrupt  decision to accept a $400 million Boeing 747 jet from Qatar for his  personal use is a direct violation of the Emoluments Clause of our  Constitution, and it has caused a firestorm of controversy.\n\nYet, MAGA Republicans in control of Congress turn a blind eye to it.  My Republican colleagues are…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692929/holding-power-accountable"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…our Nation are outraged at the  $400 million luxury airplane, the palace in the sky, that President  Trump just accepted from the Nation of Qatar. That is against the  Emoluments Clause of the Constitution. He took the bribe in plain  sight.\n\nMeanwhile, our Nation is very short on air controllers who are  trained. Look at Newark, New Jersey. They have…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691012/troubling-situation-in-newark"}]