[{"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…here. I also thank my colleagues and my dear  friends, Majority Leader Scalise and Majority Whip Emmer, for being  here.\n\nMr. Speaker, I rise today with, obviously, mixed emotions and  reluctant conviction. There is a true story I have told many times over  the past 60 years. It is about a young man--myself--who was a student  at the University of Maryland,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698817/retirement-announcement-of-steny-hoyer"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…function of the NTSB and invaluable to those mourning the loss of one  or more of their loved ones.\n\nIn times of tragedy, it can be difficult to sort through the torrent  of emotions--sadness, rage, loneliness, and regret. While counseling  cannot bring back the loved ones lost, it can help survivors process  the storm and maybe, just a little bit, blunt…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688369/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…water during tough times, you are feeling frustrated that this  administration is so out of touch that they would even consider  eliminating this critical funding.\n\nThese emotions run deep nationally, and I have seen them felt  locally. Somerset County, for example, is one of the poorest counties  in my State, the State of Maryland. If that is not enough,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…addressing the  real crises facing American families.\n\nI want to paint a picture as to what happens to a young woman who  suspects that she may be pregnant. She has a mix of emotions. She may  have overwhelming fear and anxiety, especially if she has few  resources. She goes to what she thinks is a medical center or clinic,  and it is called a pregnancy…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…level.\n\nHuntington's disease is a rare genetic disorder that slowly damages  the brain over time. It leads to a progressive loss of control over  movements, thoughts, and emotions. There is currently no cure. However,  there is hope. Because of ongoing advancements in medical research and  continued investments in biomedical science, we are closer than…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691197/recognizing-may-as-huntingtons-disease-awareness-month"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…more to be done,  and vulnerable consumers need a strong and independent Federal Trade  Commission to prosecute fraudsters and scammers and to protect them  from having their emotions exploited for financial gain.\n\nI encourage my Republican colleagues to support this legislation as  well as the bipartisan FTC that ensures consumer protection measures  like…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692728/romance-scam-prevention-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "Ms. RANDALL. Mr. Speaker, I thank the gentleman from California for  leading us in this Special Order hour today.\n\nMr. Speaker, fear, anger, terror, sadness, these are the emotions  that just scratch the surface of what my community and our immigrant  neighbors are feeling. Why should we expect anything less? This is  exactly what this administration…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690510/trump-immigration-policies"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…come from him three times--all       occurring in the last 12 months. He receives speech therapy       five days a week to learn how to express himself, [to]       process emotions, and [to] regulate. This has changed his       life. And these therapies are paid for by Medicaid. Don't       allow people like me to only hear ``love you'' a handful of…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689511/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…address, Mr. Speaker, I do  dare say, Mr. Speaker, that this is something that we can all agree on,  that we can all work on, and that approaches, sentiments, and certainly  emotions that run high in politics, of course, might differ.\n\nThe idea that America should and must win and must continue to propel  and to inspire as a vibrant, growing economy and…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Speaker, yesterday I had the privilege of spending some time with  several of the victims of this terrible attack. It is hard for me to  describe in words, Mr. Speaker, the emotions I felt in seeing their  resilience, their strength, their humanity under such incredibly trying  circumstances.\n\nIt is hard to describe in words, Mr. Speaker, the emotions…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692173/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…winners of this  year's Congressional Art Competition.\n\nArt is a cornerstone of educational success for our students, giving  them a healthy, creative outlet to process their emotions and share  their stories with the world.\n\nWe had over 80 talented young artists submit their work to my  Congressional Art Competition as the California 31st Congressional…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690755/congratulations-to-marely-gutierrez"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Jersey. We need to get at the root causes.\n\nFor too many of our young people, the root causes are that access to  guns is very easy and that they weren't taught to regulate emotions.  Things that in my age were settled on the playground with a fist are  now settled with a gun. Mr. Speaker, you can call someone a name on  social media, and the next thing…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…hesitation  that our State was better served due to her leadership. The halls of  the Minnesota State Capitol will be a lot less bright without her.\n\nWords cannot express the emotions that all of us across Minnesota  have experienced in the wake of this tragic event: devastation, fear,  grief, and outrage.\n\nWhether we agree or disagree on policy issues,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692856/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…and this is not  personal to Mr. Green, who is a very amiable fellow, but we must, as  Members of this institution, leave our rhetoric, calm our energy, and  make sure our emotions do not take over and conduct ourselves in a way  that all of us, not just here in this room but across the country, can  be proud of because we truly are on display to the…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688496/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…every Member of this Chamber wants to see.\n\nI share the frustrations of many that the Senate altered our deal at  the last minute. However, our obligation is not to these emotions. It  is to the American people.\n\nWhile we all worked hard, especially our cardinals, to ensure that  all 12 bills would be signed into law before the January 30 deadline,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…suggestive and/or explicit content is posted without consent,  algorithms promote and normalize suicide and self-harm, and chatbots  tell children how to cope with their emotions. All of these things are  harming our vulnerable and impressionable youth. Chatbot usage is now  so widespread that nearly three quarters of teens have used AI  companions,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…capturing the killer  and finding a list of more than 45 lawmakers and potential targets.\n\nAs someone who has experienced political violence firsthand, this  brings back a lot of emotions. The man who shot me on the ball field  that day also had a list of lawmakers. I am grateful for the actions of  the brave law enforcement officers who ran toward the danger…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692853/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…distinguishing them from their peers. Through their  resourcefulness and perseverance, they embody the Girl Scout Law to  truly make the world a better place.\n\nFaith McCrea created ``Emotions through Art,'' designed to help  students who experience anxiety and depression when dealing with the  pressures of school. Faith began by researching art therapy and how…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691494/recognizing-faith-mccrea-gold-award"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…for all Americans when I say that this is a day that we  will never ever forget.\n\nWhen we celebrate Kansas Day in years to come, we will also feel the  nudging of the somber emotions aroused by this tragic accident. We will  remember our fellow Americans whose lives were tragically lost:  farmers, parents, professors, college students with bright futures…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688371/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}]