[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…safe life.\n\nI sincerely urge the United States Department of Homeland       Security (DHS) to consider extending Temporary Protected       Status for Haitians to remain safe, employed, and united with       their families.            Sincerely,                                                 Ruthzee Louijeune,                                    Boston City…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…Speaker, in recognition of their dedicated service and long hours  on behalf of the people of North Carolina, I wish to include in the  Record the names of each staffer currently employed by my office:\n\nPuj Adusumilli, Kimberly Moore, Nadia Alston, Samantha Crane,  Caroline Spencer Sparks, Josie Feron, Maura Haydin Thompson, Walker  Beard, Tom Koester, Matthew…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688691/recognizing-my-congressional-staff-in-honor-of-national-employee-appreciation-day"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…2966, a bill  that does not serve our small business community, despite its name.\n\nAt a time when local businesses are working hard to keep their doors  open and their workers employed, this bill would make it even harder to  access the capital they need to survive.\n\nBy adding new documentation requirements around age and citizenship,  it slows down the…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692124/american-entrepreneurs-first-act-of-2025"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…forced to make the  difficult decision to insure only his daughter.\n\nHe's one of over 300,000 Wisconsinites covered by the ACA.\n\nAnother is Jeffrey from Milwaukee:\n\nI am self-employed and completely count on these credits in       order to afford my own health insurance, without them I may       be uninsured. The anxiety that I, and I'm sure others are…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696975/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…dedicated to uplifting minority businesses. This agency helped  entrepreneurs all across the country, including in my own district,  keep their doors open and their workers employed. Now, it is under  attack.\n\nWhile all of this is happening, they are dismantling environmental  protections in environmental justice, slashing funding for HBCUs, and  rolling…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…Nation's Capital           Emergency Act Which Would Allow Dangerous Officers Who           Have Been Terminated for Criminal Conduct or Police           Misconduct to Remain Employed as D.C. Metropolitan Police           Officers Endangering Public Safety, Evading           Accountability, and Eroding Public Trust.\n\nDear Representative: The American Civil…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…participating in a Deferred Resignation Program or who have       left Federal service under a Voluntary Early Retirement       Authority; and the number of veterans employed by contractors       or subcontractors performing work for the Federal government       who have seen their working hours, wages, or employment       reduced or terminated.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692948/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…amplifying the stories of our constituents, and tonight we do the same,  amplifying the stories of people whether they are small business  owners, they are employees, they are self-employed, farmers, or others,  who could find themselves unable to afford healthcare without an  extension of the enhanced premium tax credit.\n\nWe know that there is a healthcare crisis…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…starters to make it very concrete about Vermonters.  A woman named Sarah is going to see her premium go from $217 a month to  $1,200 a month. This is a person who is 63, self-employed, and might  have to go without healthcare for the first time in her life.\n\nCara, also self-employed, has had the same income for 20 years,  really scraping by. She pays about…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…levels of hunger.  Diseases such as cholera have spread as an increasing number of  Haitians lack adequate access to drinking water, food, and healthcare.\n\nEvery family that is employed through the HOPE/HELP trade preference  before us today for extension is a family less vulnerable to gang  coercion, extortion, or recruitment.\n\nThere is no path to stability…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698851/haiti-economic-lift-program-extension-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…a new election of a  citizen to administer the executive government of the United States  being not far distant, and the time actually arrived when your thoughts  must be employed in designating the person who is to be clothed with  that important trust, it appears to me proper, especially as it may  conduce to a more distinct expression of the public…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…those  subsidies, we are going to go back to the bad old days of pre- ObamaCare, when people would pay absurd amounts of money for their  healthcare insurance even if they are employed, even if they do have  insurance.\n\nWhat is, I think, underrated, both politically and on policy, is all  of those rates get set in the next couple of months because, in order…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…Georgia from Rich about the impact  that these cost increases would have on his livelihood. I have heard  many stories, but this one really struck me.\n\nHe writes: I am the self-employed, sole provider for a family of four  where two of us have preexisting conditions. If the Republicans get  their way and remove the subsidies, my very basic catastrophe plan-…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697215/medical-bills-are-too-high"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…funded highways to be conducted  by public employees. Our bill would allow State or local transportation  departments lacking sufficient inspectors to contract privately  employed inspectors temporarily. Our bill ensures public safety by  requiring that all federally funded bridges, tunnels, and roadways are  inspected objectively and thoroughly under…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692433/introduction-of-the-public-inspectors-for-safe-infrastructure-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…earn an associate degree in the automotive technology  field.\n\nJoseph's students have a 95 percent job placement rate within six  months of graduation, with many students employed at local auto shops,  dealerships, or starting their own businesses. In the last 3 years,  100% of students enrolled in Joseph's automotive technology classes  have graduated,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695925/recognizing-joseph-drury-conner-as-ohios-13th-congressional-district-champion-of-the-week"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…with public funds.''\n\nWe would have zero job growth and zero recovery if it weren't for  government jobs.\n\nWhat is more, beyond that, even when you look at folks who are  employed, Mr. Speaker, the average number of hours per week is  shrinking in California as well.\n\nThis is truly stunning, Mr. Speaker, when you consider everything  that our State…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…and no doubt disappointed to learn that the very  organization whose mission it is to advocate on behalf of taxpayers  relies on legal advice provided by attorneys who are employed by, and  answer to, the IRS. It is a bizarre arrangement to be sure.\n\nThe National Taxpayer Advocate Enhancement Act will ensure that the  attorneys serving the NTA are hired…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689378/national-taxpayer-advocate-enhancement-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…leave ObamaCare in place? That can sit there and keep doing what it is  doing, but we are going to give people this option, so employers can  put it in there.\n\nIf you are self-employed, you can get the same tax break. It is all  equal tax treatment. Nobody is treated differently. We would have a  product over here that would allow for true catastrophic insurance,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…``(A) The operational details of the Office, including the       name of the Assistant Administrator, the budget of the       Office, and the number of full-time employees employed by or       detailed to the Office.\n\n``(B) A summary of the activities conducted under       subsection (c).\n\n``(C) The number of webinars and outreach events conducted…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697283/office-of-rural-affairs-enhancement-act"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…to communicate with the media       in a manner that does not divulge classified or committee       sensitive information.\n\n10.6. No member of the Committee staff shall be employed by       the Committee unless and until such a member of the Committee       staff agrees in writing, as a condition of employment, to       abide by the conditions of the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…at the Collom & Carney Clinic in Texarkana and  Willis Knighton Health System in Shreveport, Louisiana, before  returning to Collom & Carney Clinic, where he is currently employed.\n\nBeyond his professional career, Gary has demonstrated exceptional  dedication to civic and political engagement. Beginning in the 1980's,  he served as Precinct Chair, later…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696861/recognizing-congressional-patriot-award-recipient-gary-singleton"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…closed for good in 2005. It had begun as a five-story, 92,000-foot  international shoe plant in Cape Girardeau, nicknamed ``the Pride of  Southeast Missouri.'' At one point, it employed 1,200 workers, but  cheaper imports from low-wage countries began to flood the market, and  by 1990, the old factory was razed and replaced with a one-story plant  of, roughly,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…reduce NEPA       litigation, which, according to the Supreme Court, has       ``transformed NEPA from a modest procedural requirement into       a blunt and haphazard tool employed by project opponents.''\n\nCongress should also enact Rep. Pete Stauber's (R., MN),       H.R. 4090, to codify some of the minerals directives in       President Trump's executive…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…amendments, and the Rules Committee may  make them in order, whether there is a formal deadline to submit them  or not. That is a practice that both Republicans and Democrats have  employed.\n\nMr. Speaker, sometimes we get down here and we get all riled up. Been  there, done that. I have been riled up myself before, but I find it  fascinating from a historical…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…enjoy  no tax on tips and no tax on overtime, which will actually incentivize  people to work more, which we need, without seeing their tax bill go  up.\n\nEmployees and self-employed individuals can now deduct up to $25,000  in qualified tip income through 2028.\n\nNext time you go to a restaurant or a bar, why don't you ask the  waitstaff what they think…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "French Hill", "party": "Republican", "sentence": "…guaranteed under section 184 or 184A of the Housing       and Community Development Act of 1992 (12 U.S.C. 1715z-13a,       1715z-13b).\n\n``(B) Comparison.--For each counselor employed by an       organization receiving assistance under this section for pre-      purchase housing counseling, the Secretary may consider the       performance of the counselor…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…pay-as-you-go procedures apply? No.\n\nMandate Effects:\n\nContains intergovernmental mandate? No.\n\nContains private-sector mandate? No.\n\nH.R. 3497 would create a medal for officers employed by       state, local, or tribal law enforcement agencies who are       killed in the line of duty. Officers who were subject to an       official finding of wrongdoing by…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699505/medal-of-sacrifice-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…parents. Coral became an official volunteer at age 6 and  serves as a role model for other camp kids. She participates in local  fundraising activities. Kimberly is still employed as a bank Branch  Manager. She serves on the organization's Advisory Board, actively  participates in fundraising activities and continues to advocate for  Camp Good Hope/Teen…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691047/recognizing-kimberly-godding-brooks"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…and Advanced Education Assistance Pilot                Program. Sec. 251. Recruitment, relocation, and retention incentive program for                civilian firefighters employed by Coast Guard in remote                locations. Sec. 252. Notification.                      Subtitle E--Coast Guard Academy  Sec. 261. Modification of Board of Visitors.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…a new election of a citizen to administer the  executive government of the United States being  not far distant, and the time actually arrived when your thoughts must  be employed in designating the person who is to be clothed with that  important trust, it appears to me proper, especially as it may conduce  to a more distinct expression of the public…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700272/president-washingtons-farewell-address"}]