[{"senator": "Gary Peters", "party": "Democrat", "sentence": "…know  firsthand that veterans are a vital source of talent to our workforce.\n\nSo let's just think for a moment. Let's just think about the  qualities that make a valuable employee: leadership, work ethic,  problem-solving abilities, and of course, integrity. These are not just  abstract qualities; they are tangible assets that veterans bring to our…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688440/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…group has significant domestic business activities if at       least 25 percent of--\n\n``(A) the employees of the group are based in the United       States,\n\n``(B) the employee compensation incurred by the group is       incurred with respect to employees based in the United       States,\n\n``(C) the assets of the group are located in the United…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699933/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…their National Guards.\n\nThe Commanding General of the D.C. National Guard is the top official  in the D.C. National Guard, is appointed by the president and is a  federal employee. There are residency requirements for government  officials in federal law, D.C. law and the laws of jurisdictions  throughout the country. In fact, several states have laws…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694307/introduction-of-the-district-of-columbia-national-guard-commanding-general-residency-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…noted if there were no children present at the time of their       unannounced visits; some reports also noted violations of       state regulations, such as missing child or employee records.\n\nChild care providers have called the claims reckless and       based on false assumptions. ``There are many reasons why       children may not be present when an…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…They are neither federal nor D.C.  government entities, though both were created and are funded by  Congress, and their employees are treated as federal employees for some  employee benefits. This bill would ensure that their employees have  comprehensive protections from and remedies for employment  discrimination.\n\nWhile employees of the local D.C.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698864/introduction-of-the-district-of-columbia-courts-and-public-defender-service-employment-non-discrimination-act"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…fault, too.\n\nMr. Speaker, no parent would accept this behavior from their child,  so why do we accept it from the President? No company would accept this  temperament from an employee, so why do we see this behavior normalized  by Republicans when we see this bad behavior in our Commander in Chief?\n\nMr. Speaker, surely, we can still tell the difference…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690634/trumps-first-100-days"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…telling their truth.\n\nHere is another one:\n\nDear Senator Booker, I am writing you today as a       constituent. In addition to being a concerned citizen, I am a       25-year employee of the local board of education and a parent       of a permanently disabled daughter who has just started       receiving Medicaid. Even with her master's degree, my…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…It is also one of the deadliest. This bill would direct the GAO to  report on key issues relating to esophageal cancer, including Federal  spending for it under the Federal Employee Health Benefit Program and  the screening rates among high-risk individuals within that program.  This bill will hopefully offer some significant amount of help in the  fight…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691833/gerald-e-connolly-esophageal-cancer-awareness-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "Mr. Speaker, I rise in opposition to H.R. 2312, the Tipped Employee  Protection Act. It is actually the tipped employer protection act.\n\nToday, we are discussing one of several bills that House Republicans  claim will benefit workers but ultimately…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…Efficiency, or DOGE, and  appointed Elon Musk in the role related to DOGE, DOGE was created as a  temporary organization.\n\nElon Musk was appointed as a special government employee, and this  was to avoid having any kind of Senate confirmation or congressional  creation of the agency or any confirmation of Elon Musk.\n\nMr. Speaker, I will remind you that…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…pay people less for their work and  to pay them less than $7.25 an hour.\n\nThis bill allows employers to classify anyone who may receive a  seasonal or random tip as a tipped employee, meaning they can now be  paid below minimum wage by their employer. Those tips should be in  addition to a worker's wage.\n\nEmployers should not be able to pay their workers…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698963/tipped-employee-protection-act"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…civil servants are the quiet force behind the  services that hold our communities together.\n\nWhen a farmer in west Michigan loses a season's worth of crops, it is  the USDA employee who helps them adjudicate a crop insurance claim,  making sure they can recover and keep food on our tables.\n\nPublic servants are the problem-solvers, neighbors, and first…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690734/public-service-recognition-week"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…this  country in the defense of slavery.\n\nThis administration has continued to allow its own employees to post  white supremacist language on social media. A 25-year-old DOGE employee  wrote: ``You could not pay me to marry outside my ethnicity,'' and,  ``Normalize Indian hate.'' This came to light a year ago. He is still  employed by the administration.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699711/rewriting-history"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…so they are trying to let him sink into  anonymity, but he has done his damage.\n\nOver at the Department of Justice--and I have got to correct myself.  I was saying that his employee, who I can identify now as Tarak  Makecha, was responsible for slashing more than $500 million in public  safety, local law enforcement, and victim assistance organizations…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…officers of the  United States be commissioned by the President and swear an oath of  office to support the Constitution.\n\nMr. Musk has been designated as a special government employee of the  White House Office, in violation of the statutory authorization and  restrictions of such designations. This false claim has also been used  to commit violations of…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Information.--The       Secretary may disclose information described in subsection       (a)--\n\n``(1) if disclosure is ordered by a court;\n\n``(2) if the information is used by a Federal employee--\n\n``(A) for enforcement; or\n\n``(B) in support of the homeland and national security       missions of the Coast Guard as defined in section 888 of the       Homeland Security…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691006/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "Ms. COLLINS. Mr. President, Members of Congress understand the needs  of our constituents far better than any well-intentioned Federal  employee located here in Washington.\n\nThe CDS projects provide funding for States, communities, and  nonprofit organizations. The process is completely open and  transparent. Senators…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699433/consolidated-appropriations-act-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…would cost $2 million       over the 2025-2030 period. CBO expects that the SEC would       need about five employees, at an average annual cost of       $330,000 for each employee, to carry out the study and amend       the rules. Because the SEC is authorized to collect fees each       year to offset its annual appropriation, CBO expects that the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693957/small-entity-update-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…resulted  in a much more protracted process.\n\nExpedited reviews are essential to avoid prolonged, costly merger  review processes that hinder banks from maintaining their employee base  or investing in technology. Instead, long-drawn-out application  processes create an environment of uncertainty due to regulatory  delays, even when the proposed transaction…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…timely manner.\n\nRight now, an IRS agent can impose a penalty on an American taxpayer  before obtaining a supervisor's approval. Moreover, they can shop  around for any other employee at the agency that they wish to seek  permission from since current law does not require approval from a  direct supervisor.\n\nThese loopholes undermine the no-signature, no-penalty…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697248/fair-and-accountable-irs-reviews-act"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…``(A) a supervisor (as that term is defined in section       7103(a)(10));\n\n``(B) a management official (as that term is defined under       such section); or\n\n``(C) any other employee as the Director of the Office of       Personnel Management may by regulation prescribe.\n\n``(b) Establishment of Training Programs.--In consultation       with the Office…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698216/federal-supervisor-education-act"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…interfering with a Federal officer;\n\nWhereas clause 1 of rule XXIII of the Rules of the House of  Representatives provides, ``A Member, Delegate, Resident Commissioner,  officer, or employee of the House shall behave at all times in a manner  that shall reflect creditably on the House.'';\n\nWhereas such actions of a Member of the House of Representatives do  not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694802/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "John Thune", "party": "Republican", "sentence": "…if you are getting  your insurance from your employer in the marketplace.\n\nSo what has happened? A lot of employers, particularly small  employers--let's take the 25-to-49-employee small business. What is  happening in that marketplace? So a lot of those companies used to  offer their employees insurance. And that insurance, as I pointed out,  is about…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…going to spend 7, could we find 15 percent  savings? Maybe. It would be really hard. People would complain. It will  screw up some people's business models. Some of the public employee  unions will be cranky. If we can find 15 percent, that would be $1  trillion a year.\n\nIt still doesn't get us to 3 percent of the GDP borrowing because,  remember, again,…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…read as follows:\n\n``(b) Appointment of Assistant Administrator.--\n\n``(1) In general.--The Office shall be administered by an       Assistant Administrator, who shall be an employee in the       competitive service.\n\n``(2) Qualifications.--The Assistant Administrator shall--\n\n``(A) have education or professional experience with, or       knowledge of,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697283/office-of-rural-affairs-enhancement-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…Mr. Speaker, pursuant to House Resolution 988, I call up  the bill (H.R. 2312) to amend the Fair Labor Standards Act of 1938 to  revise the definition of the term ``tipped employee'', and for other  purposes, and ask for its immediate consideration in the House.\n\nThe Clerk read the title of the bill.\n\nMr. WALBERG.  2312.\n\nMr. Speaker, I rise in support…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698965/tipped-employee-protection-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…DOGE for the inspiration and what he has brought down  to our State.\n\nOf course, Elon's status within the Federal Government is that of  what is called a special government employee. That means it is for a  period of time--130 days, in this case. And with that date approaching  soon, Mr. Musk indicates he plans to wrap up his work. But I must  emphasize…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…interfering with a Federal officer;\n\nWhereas clause 1 of rule XXIII of the Rules of the House of  Representatives provides, ``A Member, Delegate, Resident Commissioner,  officer, or employee of the House shall behave at all times in a manner  that shall reflect creditably on the House.'';\n\nWhereas such actions of a Member of the House of Representatives do  not…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694096/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "Mr. SIMPSON. Mr. Speaker, I rise today to recognize my longtime  employee, Amy Sorensen, as she prepares to retire at the end of August.\n\nI have often said that a really good staff makes a decent Member of  Congress--and throughout my time in office,…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694716/recognizing-amy-sorensen-as-she-prepares-for-retirement"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…McIntyre (Mac) Tolar for dedicating over three decades of service to  our Nation's military, state, local, and federal governments, including  the past thirteen years as an employee within the United States House  of Representatives.\n\nAfter graduating from the University of South Carolina, Mac enlisted  in the United States Marine Corps as an infantry…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}]