[{"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…The  President does not have the authority to dismantle the Department of  Education, and he signed Executive Order 14242, which aims to  ``Improving Education Outcomes by Empowering Parents, States, and  Communities'' violates the law and the Constitution.\n\nTwo, unlawfully directed the elimination of the United States Agency  for International Development,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…whim he is opposed to. Now he will have a master file that  includes you to persecute and even prosecute.\n\nToo intimidated by this self-proclaimed king, Republicans are  empowering what could become a police state. To shed light on this  descent into authoritarian darkness, to let the American people know  how their own government is centralizing their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695526/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…project would further empower a President whose priorities include  revenge, personal enrichment, and self-glorification to misuse this  data.\n\nBeyond the obvious danger of empowering a surveillance state or  enabling the targeting of political opponents, the other danger  associated with this mass centralization is that this sensitive  information held…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…manage to do that, it is nearly impossible to  get a permit for this work because of the high standards in the Clean  Water Act.\n\nThis bill would address these issues by empowering communities to  help clean up polluted sites.\n\nThis isn't a get out of jail free card for polluting companies. This  is a tool that gives communities more agency to care…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691091/community-reclamation-partnerships-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…than the same period last year.\n\nInstead of doing anything to address this cost-of-living crisis, the  President has stacked his Cabinet with billionaire after billionaire,  empowering them to slash the programs American families rely on with no  oversight and no disclosures about the conflicts of interest. Elon  Musk, the unchecked billionaire leading…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689082/economic-populism"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…it. The Marine Debris  Program and the Marine Debris Foundation are proven tools that make a  difference.\n\nWhen Congress invests in practical solutions to save our seas by  empowering local leaders, scientists, fishers, and cleanup crews, it  makes measurable progress. This bill protects ecosystems, jobs, and  public health.\n\nMr. Speaker, clean water and…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698190/save-our-seas-amendments-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…campaign. Representative Bird spent countless hours  volunteering in students' classrooms, which led to her co-founding the  Adams 12 Community Action Network, dedicated to empowering students by  providing equal learning opportunities at local schools.\n\nOn behalf of the people of Colorado's 7th Congressional District, it  is my honor to thank Representative…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698814/recognizing-colorado-state-representative-shannon-bird"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…recipients, many of whom are  first-generation college students striving for a better future for  themselves, their families, and our Nation . . . If we are serious  about empowering the next generation and strengthening our workforce,  we must facilitate, and not undermine, opportunities that help students  succeed.\n\n``Finally, the House Committee on…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…of faith, empathy and  wisdom. Jim could often be found spending time with his family,  watching a Kansas City Chiefs game or NASCAR race. He spent his life  uplifting and empowering the residents of Grandview through his  leadership and commitment to being a voice for the community. Though  Jim has passed, his legacy and impact on his community will…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696936/recognizing-the-life-and-memory-of-james-jim-neil-crain"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…curbing       costs or making life better for everyday people.\n\nThe bills are as follows: H.R. 2988--Protecting Prudent       Investment of Retirement Savings, H.R. 2270--Empowering Child       and Elder Care Solutions Act, H.R. 4366 Save Local Business       Act, H.R. 2312--Tipped Employee Protection Act, H.R. 2262--      Flexibility for Workers Education…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…to promote water conservation, address food access issues, and  reduce waste and neighborhood emissions. This program has served as a  model for neighborhoods nationwide, empowering residents and their  communities to adopt more sustainable lifestyles and reduce their  ecological footprint.\n\nThe All-America City award from the National Civic League recognizes…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694723/recognizing-the-city-of-lakewood"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…innovation. We are about modern technology. We are not about looking  backwards. If Republicans were serious about meeting energy demand and  keeping customer bills low, empowering artificial intelligence, then  they would look to real solutions, energy efficiency, virtual power  plants, grid-enhancing technologies, batteries, and more.\n\nHowever, Mr.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695767/national-coal-council-reestablishment-act"}, {"senator": "Nikema Williams", "party": "Democrat", "sentence": "…refugees.\n\nIn another life, prior to my congressional service, I was a public  school teacher. I had a student who was a Burmese refugee. Htet-Yet and  his family's story is empowering and a stark reminder that not only do  we have an obligation to help those no matter their ZIP Code, but we  have a duty to help those no matter where they are around the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697197/no-new-burma-funds-act"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…administration about Congress'  intent. So far, the administration has cut congressionally authorized  programs that support human rights in China, including initiatives  empowering Chinese and Uyghur-related diaspora groups to combat  transnational repression and defend religious freedom.\n\nDespite the fact that Radio Free Asia helped break the story…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694800/uyghur-policy-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…opportunity at the heart of our Constitution is under  assault because there seems to be one party that has decided it is  about suppressing citizens' rights rather than empowering and honoring  citizens' opportunity to participate in our government. And they have  this bill that is all about voter suppression.\n\nWell, we have gone through some serious…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690536/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Charges for Key Events Ticketing Act, or the TICKET  Act. I am proud to lead this bill alongside the ranking member, my good  friend, Ms. Schakowsky.\n\nThis legislation is about empowering consumers and ensuring fans can  enjoy live events by improving ticket price transparency.\n\nH.R. 1402 requires all platforms selling event tickets to show the  complete price,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690175/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…gain,  the CCP's actions are not just unfair but are also downright dangerous.  These predatory practices harm American businesses, erode trust in  global markets, and risk empowering China to pressure developing  nations and destabilize debt markets for its own benefit.\n\nWe cannot afford to sit back and take our eyes off the ball. We must  be prepared.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694119/china-financial-threat-mitigation-act-of-2025"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…love this country,  assimilate into American culture, and they have a duty to join in the  fight and speak out against the mainstream media and elected officials  who are empowering radical Islam to take a foothold in the United  States of America.\n\nGovernor Kathy Hochul of New York welcomed in the new year by  declaring January as Muslim American Heritage…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "French Hill", "party": "Republican", "sentence": "…economy.\n\nI commend the vice chairman for his hard work and leadership in  fighting for the humanitarian rights in Burma by cutting off the source  of the funding that is empowering these human rights travesties.\n\nMr. Speaker, I urge my colleagues to support this bill, and I reserve  the balance of my time.\n\nMr. HILL of Arkansas. Mr. Speaker, I include…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699831/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…will not be able to grow,  prosper, or effectively do business until they end their nuclear  ambitions and stop supporting terrorism. Today's legislation achieves  that by empowering our administration during negotiations and putting  Iran on notice.\n\nThis bill removes the sunset clause from the Iran Sanctions Act of  1996, making it permanent law. The…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690689/solidify-iran-sanctions-act-of-2025"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…These three bills are not all of my bills, but I wanted to highlight  those three today because they are about safeguarding public lands,  fostering economic growth, and empowering our communities. They are  about letting ranchers, families, small businesses, and entrepreneurs  benefit from thoughtful and responsive government as opposed to  government…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689196/work-highlights-of-western-caucus"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…non-profit, which promotes and supports the rights and  responsibilities of service dog teams, businesses, and the community.  Merlyn Lewis exemplifies servant leadership by empowering volunteers,  the community, and individuals with disabilities to ensure safe and  unfettered access for service animal handlers. Volunteering more than  10,000 hours, Ms.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691758/recognizing-merlyn-lewis"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Act, as amended. H.R. 4429......................  Developing and      None..............  None.............  ....................                                   Empowering our                                   Aspiring Leaders                                   Act of 2025, as                                   amended. H.R. 4430......................…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697267/expanding-wksi-eligibility-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…years, inspiring the formation of a grassroots  End Jew Hatred civil rights movement to alter public discourse and make  Jew hatred unacceptable in contemporary society, empowering Jews with  positivity and strength to discover and enjoy their heritage in  whichever manner they choose, without fear of attack or persecution;  and\n\nWhereas, we all share…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688926/designating-april-29-as-endjewhatred-day"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Attorneys General at the Department of Justice. As a She Leads  America honoree, Jennifer believes leadership is a calling to serve  others with both truth and compassion, empowering individuals,  strengthening families, and preserving freedom for future generations.\n\nMr. Speaker, I ask my colleagues to join me in congratulating this  outstanding woman…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696133/recognizing-jennifer-sevilla-korn-for-her-public-service-and-leadership"}, {"senator": "French Hill", "party": "Republican", "sentence": "…expertise, resource       challenges, or       limiting criteria with regard to the types of victims they       are permitted to serve;\n\n(D) an analysis of gaps that may exist in empowering       Federal, State, and local agencies to prevent senior       exploitation or respond effectively to suspected senior       financial exploitation; and\n\n(E) an analysis…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693935/national-senior-investor-initiative-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…There is  very tough competition each year among Iowa's many outstanding  educators to find the one who best represents student learning through  evidence-based instruction, empowering students with multiple pathways  to postsecondary success; the teacher who learns from and invests in  other fellow educators and, at the same time, serves students in  partnership…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697231/2026-iowa-teacher-of-the-year"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…working to support the nearly  80,000 veterans in my district that they call home.\n\nJane's exceptional record reaches beyond our veterans. It also  focuses on education and empowering our youth to reach their potential.\n\nAs a trustee of Cochise College's governing board, Jane has been  instrumental in shaping Cochise College into the innovative institution…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691925/jc-flag-football-championship"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…say that Republicans don't  have a plan, it is false. We put out plans. We have put out solutions.  We have solutions.\n\nWe believe in expanding people's access to care by empowering them  with the same tax treatment, equal tax treatment, the corporations get.  Individuals should get the same tax deductions and tax breaks to be  able to have healthcare.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…eradicate this unwarranted red tape and let businesses  invest in the needs of their employees without punishing the company  for doing just that.\n\nThat is why I introduced the Empowering Employer Child and Elder Care  Solutions Act. Hoosiers and all Americans must not be forced to choose  between caring for a loved one and working outside of the home.\n\nBusinesses…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699003/empowering-employer-child-and-elder-care-solutions-act"}]