[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, today, I rise to recognize Akron Fire  Department Lieutenant Dave Ewers, retired Akron Firefighter Mark  Harper, and Lynx EMS worker Dominic Bagnoli as Ohio's 13th  Congressional District champions of the week.\n\nLate last year, a man went into cardiac arrest at a roller skating  rink in Jackson Township,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699148/champions-of-the-week-dave-ewers-mark-harper-dominic-bagnoli"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…450,000 people are now at risk  of losing their healthcare coverage, including children, seniors, and  people with disabilities in our district.\n\nThese cuts will also impact EMS and ambulance services across our  Nation. This budget will shrink the funds available to these  departments and make it impossible for them to keep operating.\n\nThe impact will…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694018/budget-betrayal"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…agencies with an outstanding  ability to quickly recognize a heart attack or stroke and provide high- quality care. In these high-pressure cardiac situations, timely care  from an EMS team can be the difference between life and death.\n\nSince 2014, Evergreen Fire/Rescue (EFR) has been honored with this  award four times. EFR Chief Dave Montesi attributes the…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694726/recognizing-evergreen-firerescue"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…have secured millions for transitional housing for  veterans; a sobering center; behavioral health centers in Albuquerque;  mobile school health centers in APS; and new fire and EMS stations in  Moriarty, Sandia Pueblo, Peralta in Valencia. This is what leadership  looks like.\n\nI will just say this: In New Mexico, we know, of course, that we are  all going…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691917/reconciliation"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…the Stars of Life program to celebrate the  contributions of ambulance professionals who have gone above and beyond  the call of duty in service to their communities and the EMS  profession. By honoring the contributions of these heroes, the Stars of  Life program also highlights the critical role EMS plays in our  healthcare infrastructure.\n\nThe opportunities…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696510/recognizing-the-global-medical-response-2025-stars-of-life-award-recipients"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…subparagraph (B);\n\n(4) by redesignating clauses (i) through (ix) as       subparagraphs (A) through (I), respectively, and moving such       subparagraphs, as so redesignated, two ems to the left;\n\n(5) in the matter preceding subparagraph (A), as so       redesignated, by striking ``directly provided'' and inserting       ``whether directly or indirectly…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688931/united-states-research-protection-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise to recognize  National EMS Week.\n\nSince 1974, we have set time aside each year to honor the critical  work of our Nation's emergency medical services professionals. These  brave men and women are often…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691586/recognizing-national-ems-week"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…stronger  support for our servicemembers and their families.\n\nIn North Carolina's 11th District, these funds support essential  water and public safety projects including a new EMS base in Swannanoa,  water and sewer upgrades at Swain Middle School, an emergency services  hub in Madison County, upgraded water lines in Robbinsville, and a new  taxiway on…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699305/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Helicopter over  the Potomac River showed heroism in the face of tragedy.\n\nWhen the unthinkable happened on that cold January evening, it was  the brave men and women of D.C. Fire and EMS who rushed to the scene.  Without regard for their own safety, these highly trained professionals  entered dangerous, frigid conditions, diving into the depths of the  Potomac…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690276/recognizing-the-heroism-of-the-district-of-columbia-fire-and-emergency-medical-services-department"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…event for first responders  statewide.\n\nIn the 1970s, Wyoming lawmakers recognized the need to create a  statewide system to standardize emergency medical services. The Wyoming  EMS Office was established to provide critical training, support, and  continuing education for first responders. It is also responsible for  EMS licensing across the State.\n\nThe…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694419/50th-anniversary-of-the-wyoming-trauma-and-emergency-medical-services-conference"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…unshakable resolve.\n\nTheir station, nestled on Dailey Hill Road, is home to a well- equipped fleet that reflects their forward-looking mindset. From modern  engines and tankers to EMS response vehicles, Kennedy has made the  investments needed to stay ready, and it shows.\n\nThey are more than just emergency responders. They are leaders,  mentors, and hometown…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693639/hornoring-the-kennedy-fire-department-on-its-100th-anniversary"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…will be a tough day  in the Commonwealth.\n\nBut the people of Louisville are grateful for the swift, lifesaving  efforts of our first responders, from local police, fire, and EMS. They  trust in the prayers of their fellow Americans.\n\nI want them to know that their representatives here in Washington are  making sure that every Federal resource they need…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696544/9999"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "Mr. PATRONIS. Mr. Speaker, in honor of National EMS Week, I rise  today to thank the great men and women of the emergency medical  services.\n\nAs the former CFO and State fire marshal for the State of Florida, I  saw these men…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691470/thanking-emergency-medical-services-personnel"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…served as an EMT with the Bucks County Rescue Squad and  Bensalem Rescue Squad. Two years later, he joined the Bucks County  Department of Communications as a Police, Fire, and EMS dispatcher,  demonstrating his deep commitment to public safety.\n\nIn 1987, Lieutenant Moffett transitioned to a career in law  enforcement as a Deputy Sheriff with the Bucks…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694744/recognizing-buckingham-township-police-department-lieutenant-william-moffetts-35-years-of-service"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  the Susquehanna Regional Emergency Medical Service, which recently  received the 2025 Dick Ferneau Career EMS Service of the Year Award.\n\nThis is one of the top national awards in emergency medical services  and highlights organizations that exemplify outstanding care,  innovation,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699537/recognizing-susquehanna-regional-emergency-medical-service"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "Mr. BUCHANAN. Mr. Speaker, I rise today to recognize fire, rescue and  EMS personnel who have provided distinguished service to the people of  Florida's 16th Congressional District.\n\nFirst responders, fire departments and emergency medical service…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697424/recognizing-floridas-16th-congressional-district-fire-and-rescue-ems-awards-recipients"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Section 372 of the Public Health Service Act (42 U.S.C.       274) is amended--\n\n(1) in subsection (b)(2)--\n\n(A) by moving the margins of subparagraphs (M) through (O)       2 ems to the left;\n\n(B) in subparagraph (A)--\n\n(i) in clause (i), by striking ``, and'' and inserting ``;       and''; and\n\n(ii) in clause (ii), by striking the comma at the end and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…the UMC Emergency Medical Services team.\n\nSince their first 911 response back in November 1975, well before the  University Medical Center Hospital even opened its doors, UMC EMS has  been on the front lines of saving lives and serving our communities in  west Texas.\n\nWe are fortunate to have the highest level of healthcare and  emergency response professionals…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692295/stop-defending-lawlessness"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…graduation of the 500th first  responder from the Centre County Crisis Intervention Team Training  Program.\n\nSince 2011, this initiative has brought together law enforcement,  EMS, corrections officers, and mental health professionals for 40 hours  of specialized training.\n\nThese first responders are now better equipped to recognize mental  health crises,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693519/recognizing-centre-county-crisis-intervention-team"}]