[{"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. Speaker, I appreciate that we are considering H.R. 1107, the  Protecting Veteran Access to Telemedicine Services Act of 2025, as  amended. It will enable VA providers to prescribe substances to  veterans through telemedicine without first conducting an in-person  exam. This bill will make permanent a flexibility that has been…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695455/protecting-veteran-access-to-telemedicine-services-act-of-2025"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…They are asking us to lower costs while House Republicans and this  President get distracted by the wrong fights. They are asking us to  clean up corruption while Republicans enable this President to treat  accountability as optional while he is getting richer and everyone else  is getting poorer.\n\nThat is not what the people sent us here to do, and it…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699255/2025-final-priority-results-survey"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…industry out from current securities laws and  regulations. This would continue to expose consumers to harmful crypto  practices. Additionally, the CLARITY Act would not only enable  conflicts of interest from Trump and his family through meme coins like  $TRUMP, but it would also send the message that Congress approves of  the way President Trump is selling…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694254/9999"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…This university is dependent upon federal grants, a       testament to the world-class quality of our research and its       leadership in the biomedical field. These grants enable       groundbreaking advancements that position the United States       at the forefront of scientific information.\n\nI had planned to apply for a federal grant in 2025 to…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…of the Federal Bar  Association's charter that will give the foundation the flexibility it  needs to advance its significant mission in this century.\n\nThe changes made would enable the foundation to swiftly meet the  needs and priorities of the organization and improve the administration  of Federal justice for all of our citizens.\n\nIt is critical for…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697184/foundation-of-the-federal-bar-association-charter-amendments-act-of-2025"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…expertise and technologies necessary to enhance DHS'  ability to detect, identify, and respond to biological threats much  more effectively. Accessing this valuable research will enable DHS to  modernize its biodetection tools and systems.\n\nThe bill also directs DHS to establish specific programs and  technical requirements essential for advancing biodetection…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688729/dhs-biodetection-improvement-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…have that power to use our military to quell a  genuine rebellion, organized and armed, creating violence that cannot  be contained by local and State police. It should not enable him to  deploy our military willy-nilly because of his unbridled authority  under the current law.\n\nI have the utmost respect for our National Guard, our Connecticut  National…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…longstanding principle       that FLSA requires minimum wage and overtime protections for       all time that employees spend working for the benefit of the       employer, and would enable employers to steal time from       employees by scheduling unpaid--but essential to the job--      training.\n\nAs stated above, these bills would hurt working people by…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…give you some examples.\n\nThe amendment would eliminate funding to Seattle Children's Hospital  for a behavioral health crisis stabilization unit. The underlying  funding would enable Seattle Children's Hospital to create a dedicated  space for children needing immediate, short-term psychiatric care.\n\nMs. DeLAURO. Mr. Chair, I yield myself such time as I…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699285/amendment-no-1-offered-by-mr-massie"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…support of the  President's unlawful efforts to fire inspectors general and heads of  independent Agencies.\n\nHer record makes it clear that, if confirmed, she would continue to  enable, rather than check, an administration that has repeatedly  exceeded its authority.\n\nMs. Hermandorfer also refuses to acknowledge that President Trump  lost the 2020 election.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693415/nomination-of-whitney-d-hermandorfer"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…clear  that they do not want to fight and fund another war.\n\nWith this vote, every Member of Congress has the chance to show the  American people where they stand. Will they enable Trump's illegal  warmaking, or will they stand on the side of the Constitution?\n\nMs. OMAR. Mr. Speaker, stand on the side of the Constitution and put  an end to this unauthorized…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698240/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…extraordinary actions originating  in whole or substantially in part outside the United States that have  been labeled by Presidents an ``international emergency'' under IEEPA  to enable a President to take certain action. President Trump has  stretched this notion of emergency far beyond the language of the  statute and far beyond what anyone contemplated…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…Armed Services Committee  fought hard for oversight in the NDAA. Unfortunately, the price of a  bipartisan bill to support our troops was that Republicans would  continue to enable this administration and many of its worst actions.\n\nMr. Speaker, unfortunately, House Republicans' efforts to turn a  blind eye to the President's apparent misconduct are not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…infrastructure, new technology--to strengthen our NATO alliance, which  means strengthening our own national security.\n\nBut rather than supporting a thriving Canadian economy that would  enable the government to fulfill those goals, the tariffs that the  President keeps slapping on this great ally will hinder our potential  and Canada's. These tariffs also undercut…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…nuclear weapons' sole  dominance on the strategic value ladder could be AI technology. . .  Either AI technology itself will become the primary strategic weapon-- or it will enable the rapid creation of alternatives that render  nuclear arsenals increasingly irrelevant to real-world outcomes.''\n\nIt is only a matter of time--and probably far less time…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699676/the-new-start-treaty"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…or other local government level.\n\n(10) Sector.--The term ``sector'' means a collection of       assets, systems, networks, entities, or organizations that       provide or enable a common function for national security       (including national defense and continuity of Government),       national economic security, national public health or safety,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…administration put the interests of their far-left  base ahead of the needs of the American people.\n\nMr. Speaker, I urge my colleagues to support this legislation that  will enable us to enact President Trump's energy agenda and restore  American energy dominance.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688177/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…will face the largest tax hike in  history. It would be a $4 trillion tax hike.\n\nThat is why, earlier this month, Republicans in Congress passed a  budget resolution that will enable us to extend these expiring cuts. At  the same time, we are advancing other tax priorities that are  championed by the President, including his proposal to cut taxes on  Social…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…exploitation of the Iranian people must end.\n\nThe newly imposed 25-percent tariffs on countries doing business with  Iran are designed to strike at the economic lifelines that enable this  repression. Some of Iran's largest trading partners unsurprisingly are  our adversaries. It is both in the interest of our national security  and in the interest of the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699103/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…I rise in strong support of my bipartisan  bill, H.R. 4090, the Critical Mineral Dominance Act.\n\nThis bill will help strengthen our Nation's critical mineral security  and enable our critical mineral dominance by codifying several of the  policies that President Trump put forth in his hardrock mining  executive orders earlier this year.\n\nThis bill does…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…model weights pertaining to artificial       intelligence systems being considered for use, procurement,       or adoption by an element of the Intelligence Community to       enable such element to make informed decisions regarding the       fitness and reliability of the system and that each element       of the Intelligence Community should, to the greatest…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698262/explanatory-statement-for-the-intelligence-authorization-act-for-fiscal-year-2026"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…Currently, OMB's approval process is prolonged and bureaucratic,  which delays feedback collection from small businesses and their  investors. Preventing these delays will enable the advocate to gather  more effective and timely data.\n\nThe better information that the advocate can gather, the better the  SEC  can respond, and the better off our small…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693953/improving-access-to-small-business-information-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Commissioner of U.S.       Customs and Border Protection not later than 180 days after       the date of the enactment of this Act that contains       sufficient information to enable such Commissioner--\n\n(A) to locate the entry; or\n\n(B) to reconstruct the entry if it cannot be located.\n\n(3) Payment of amounts owed.--Any amounts owed by the       United…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…understand how we got  here. In 2022, the Biden administration heavy-handedly put the  retirement security of over 150 million Americans at risk by issuing a  deeply flawed rule to enable retirement plan fiduciaries to consider or  choose investments based on environmental, social, and governance, or  ESG, factors. That is not free market. That is not capitalism.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699156/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…250 celebrations,  Memorial Day, and Labor Day.\n\nFinally, $2.8 billion is provided for the SEC, FTC, FCC, GSA, SBA,  and more than 20 independent agencies.\n\nThis bill will enable the GSA to reduce the number of Federal  properties on the Federal Government's deferred maintenance list. It  provides critical funding for national security, including the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699055/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…partners in these  efforts as we seek to implement our shared peace through strength  agenda with President Trump. Our reforms, plus our increased defense  investments, will enable us to achieve that vision. Through this bill,  we will continue revitalizing the defense industrial base--an absolute  requirement during these dangerous times.\n\nI am thankful…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698257/nominations"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…FEMA was busy footing the bill for nice hotel stays in New York  for folks who weren't even supposed to be in the country. This was a  willful effort by the other side to just enable this border crisis.\n\nI have to say that Congressman Knott pointed out how the border is  finally secure, and it didn't require a change in law. It simply  required a President…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…good stuff. We don't want the Chinese and our countries of  concern to be using the best American technology remotely to do that.  Nor do we want them to train AI models to enable weapons of mass  destruction, automated cyber attacks, or systems that evade human  oversight. Another final example would be accessing tools designed for  offensive cyber…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698858/remote-access-security-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…included as part of the  budget reconciliation process.\n\nThe first is the Educational Choice for Children Act, which will  provide a tax credit for charitable contributions that enable  scholarships to attend private, parochial, and independent schools.  This could potentially expand  private school choice to millions of families in this country.\n\nSecondly,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…American consumers should not be complicit in human rights  violations. American businesses should not profit from forced labor,  and our government, our tax dollars, must never enable oppression.\n\nMr. Speaker, I urge strong support, and I reserve the balance of my  time.\n\nMr. Speaker, this bill, this debate, and previous bills send a clear  message to the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690654/no-dollars-to-uyghur-forced-labor-act"}]