[{"senator": "Gwen Moore", "party": "Democrat", "sentence": "…the Ways and Means Committee with overwhelming bipartisan support.\n\nI think having a single person to deal with at the Social Security  office is common sense, and it will enable a victim to unravel their  problems a lot sooner.\n\nI just want to make note of the fact that, like some other Social  Security bills that are under consideration today, this…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697187/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…infrastructure, new technology--to strengthen our NATO alliance, which  means strengthening our own national security.\n\nBut rather than supporting a thriving Canadian economy that would  enable the government to fulfill those goals, the tariffs that the  President keeps slapping on this great ally will hinder our potential  and Canada's. These tariffs also undercut…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…activities happening across agencies.\n\nDangerously, Trump's actions, combined with Republican House  leadership who are unwilling to investigate anything Trump's team does,  enable the Trump administration to be entirely unaccountable.\n\nNotably, the HUD Inspector General this bill would require to testify  before our committee was one of the people Trump…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697210/hud-transparency-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…industry out from current securities laws and  regulations. This would continue to expose consumers to harmful crypto  practices. Additionally, the CLARITY Act would not only enable  conflicts of interest from Trump and his family through meme coins like  $TRUMP, but it would also send the message that Congress approves of  the way President Trump is selling…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694254/9999"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…driven disregard for global  public health worldwide is appalling. Contraceptives are legal and  widely used in America. They prevent unwanted pregnancies and  abortions. They enable women to choose when to have a child and grow  their families, by doing so increasing the chances their children will  survive beyond the age of 2.\n\nI urge the White House…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696465/womens-health"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…maximize  their yield profitability.\n\nThe legislation directs the FCC to review its satellite service rules  to assess whether there are any rule changes that could better enable  satellites to deliver precision agriculture solutions.\n\nIf the FCC finds that changes are necessary, the bill requires the  FCC to develop recommendations for implementing…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693468/precision-agriculture-satellite-connectivity-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…biologists with key population characteristics, such as survival,  movement, contribution to fisheries, growth, and their levels of  natural reproduction.\n\nThis legislation would enable the Fish and Wildlife Service to mark  all hatchery-produced fish within the Great Lakes. Currently, we tag  only around 9 to 11 million of the 21 million fish stocked in the…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693994/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…because it was on their website, and we know that  the Department of Agriculture is well aware of its ability to use the  interchange to transfer funds from a program that would enable it to  provide the full SNAP benefits in the month of November. In fact, it  just used this interchange recently in both October and November for  the WIC Program.\n\nRight now,…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…district  because they have seen firsthand the impact a VSOC can have. By  expanding who can fill that role, we will give more student veterans  access to the program and help enable them to access their earned  benefits.\n\nWhile I do have concerns that section 4 of the bill requires VA to  adjudicate extension requests within 30 days without addressing…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699487/veterans-readiness-and-employment-improvement-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…support of the  President's unlawful efforts to fire inspectors general and heads of  independent Agencies.\n\nHer record makes it clear that, if confirmed, she would continue to  enable, rather than check, an administration that has repeatedly  exceeded its authority.\n\nMs. Hermandorfer also refuses to acknowledge that President Trump  lost the 2020 election.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693415/nomination-of-whitney-d-hermandorfer"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…monitoring       for anthrax, monitoring for, African swine fever, which       doesn't necessarily transfer to humans but does devastate our       agricultural sector. And [FAO] enable[s] a response that can       contain matters before they, before they get out of control.       That capability alone . . . is often [the] highest priority       investment…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…This university is dependent upon federal grants, a       testament to the world-class quality of our research and its       leadership in the biomedical field. These grants enable       groundbreaking advancements that position the United States       at the forefront of scientific information.\n\nI had planned to apply for a federal grant in 2025 to…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…In a November 2024 joint  statement, CISA and the Federal Bureau of Investigation confirmed that  the Chinese Government hacked ``multiple telecommunications companies  to enable the theft of customer call records data, the compromise of  private communications of  a limited number of individuals who are primarily involved in  government or political…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689978/nomination-of-sean-plankey"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…regulation that prevents the privatization  of State civil services. They are rolling back the regulation that  strengthens fair wage protections for home care workers that would  enable them to keep minimum wage and other protections. They are  rolling that back.\n\nThe regulation requiring Federal contractors to pay workers at least  $15 an hour. They are rolling…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695574/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…yielding.\n\nMr. Chairman, our waterways and our waters are precious resources,  and we need to advance policies that protect that precious resource and  certainly need policies that enable us to be resourceful in the use of  this commodity.\n\nIn my youth, growing up in my home and hometown of Amsterdam, New  York, if you wanted to know what color the Mohawk Carpet…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698044/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…on the global mineral  marketplace alone. If we are to break their monopoly, we have to  coordinate with our allies. I have also introduced the Finding ORE Act,  which would enable the administration to work in coordination with our  allies to map critical mineral research around the globe.\n\nMadam Speaker, the time is now to act to save our future. Our…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700180/critical-minerals-are-the-backbone-of-our-country"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…model weights pertaining to artificial       intelligence systems being considered for use, procurement,       or adoption by an element of the Intelligence Community to       enable such element to make informed decisions regarding the       fitness and reliability of the system and that each element       of the Intelligence Community should, to the greatest…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698262/explanatory-statement-for-the-intelligence-authorization-act-for-fiscal-year-2026"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…or other local government level.\n\n(10) Sector.--The term ``sector'' means a collection of       assets, systems, networks, entities, or organizations that       provide or enable a common function for national security       (including national defense and continuity of Government),       national economic security, national public health or safety,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…John Rose and his extremely important  bill that would remove the requirement that a manufactured home be  built with a chassis. That saves money. That one change is going to  enable a significant growth for manufactured housing, and it will  reduce the cost of manufactured homes.\n\nFinally, title 6 of this bill adds meaningful community banking  reforms…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699798/housing-for-the-21st-century-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…administration put the interests of their far-left  base ahead of the needs of the American people.\n\nMr. Speaker, I urge my colleagues to support this legislation that  will enable us to enact President Trump's energy agenda and restore  American energy dominance.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688177/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…legislation led by my friend, Congressman Buchanan. I appreciate his  leadership on this, and I was pleased to be able to support the effort,  as well.\n\nThis bipartisan bill would enable hospitals to extend their  successful hospital at home programs for another 5 years. The hospital  at home model gives hospitals the flexibility to treat certain patients…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697170/hospital-inpatient-services-modernization-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…exploitation of the Iranian people must end.\n\nThe newly imposed 25-percent tariffs on countries doing business with  Iran are designed to strike at the economic lifelines that enable this  repression. Some of Iran's largest trading partners unsurprisingly are  our adversaries. It is both in the interest of our national security  and in the interest of the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699103/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…power our  communications devices and back up critical infrastructure such as  hospitals and data centers. Rare earth elements make possible the  cutting-edge technologies that enable our economy to innovate and our  military to keep us safe.\n\nThe global mineral race is not optional. Over the next 15 years,  demand for copper and rare earth elements is expected…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…covered platform to determine       the intimate visual depiction was published without the       consent of the identifiable individual; and\n\n(iv) information sufficient to enable the covered platform       to contact the identifiable individual (or an authorized       person acting on behalf of such individual).\n\n(2) Notice of process.--A covered platform…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690186/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Supporting democratic movements, defending human rights, and  advancing stability in Southeast Asia are in our American interest.  When international institutions inadvertently enable authoritarian  regimes through new financing, our credibility suffers, and in this  case the Burmese people would pay the price.\n\nBy reaffirming and strengthening this pause,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697196/no-new-burma-funds-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…there are insufficient qualified       United States shipyards to meet the national security       interest without such exception; and\n\n(2) actions taken by the President to enable qualified       United States shipyards to meet national security       requirements prior to the issuance of such an exception.\n\n(e) Certifications and Classification.--Notwithstanding…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…addition to the budget resolution, which I  support, I rise today in support of the rule for H.J. Res. 20, a  resolution authorized by the Congressional Review Act that will enable  our Congress to repeal a job-killing Biden administration regulation  that would ban and eliminate noncondensing tankless water heaters, an  American product made by blue-collar…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688098/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…good stuff. We don't want the Chinese and our countries of  concern to be using the best American technology remotely to do that.  Nor do we want them to train AI models to enable weapons of mass  destruction, automated cyber attacks, or systems that evade human  oversight. Another final example would be accessing tools designed for  offensive cyber…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698858/remote-access-security-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…needs to act.  Congress needs to codify it. Congress needs to change it. States and  State leaders need to stand up and use the legislation that we did pass  in January to enable suit against the Federal Government when they  failed to secure the border that we included in the Laken Riley Act  because States can no longer be beholden to a Federal Government…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Founders, and define ways in  order to revive that spirit. The look of a building is a small way, but  I think that it is a reform that, going hand in hand with other ways to  enable greater participation, such as restoring proper civics in our  schools and many other related measures, can be an important part of  restoring that spirit, that civic spirit…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}]