[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…that power, but  when you decide how to spend money, you are really talking about your  values. So those who serve on the Appropriations Committee were doing  their best to enact the values of our country, be they investment in  healthcare, in housing, in education; investments that created good- paying jobs, investments that helped small communities…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…save lives.\n\nBlack Maternal Health Week is not just a time for awareness but a  call to action. We must listen to the voices of Black mothers, amplify  their experiences, and enact meaningful change to ensure that maternal  health equity becomes a reality.", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688983/recognizing-black-maternal-health-week-in-santa-clara-county-california"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…overturn waivers puts polluters in charge of government  policy.\n\nIn 1970, Congress passed the Clean Air Act. The law explicitly states  that individual States like California can enact stricter emission  standards to protect the environment if they receive from the  Environmental Protection Agency a waiver. And States like Oregon can  adopt those standards…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691625/congressional-review-act"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…administrations, including the duly  ratified and binding treaty obligations of the United States, thereby  breaking international laws and norms, leading to countries around the  world to enact damaging tariffs on goods and services originating from  the United States. His Liberation Day scheme, which imposed 10 percent  tariffs on all countries, as well as additional…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…how to govern for  the American people. The Democratic Party philosophy is clear. We are  ready, willing, and able to find bipartisan, common ground, anytime,  anyplace, to enact spending agreements that actually make life better  for the American people.\n\nHowever, in order to do that, we need to have partners on the other  side of the aisle who are…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696738/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…all we heard from her was empty rhetoric and evasive  answers. I would need to see some evidence before accepting her word on  a case such as this.\n\nIf we are being asked to enact such drastic measures without proper  vetting or a thoughtful process, then we need more than her assurances.  We need evidence. We need real facts, not fabricated ones, to…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…out what we are for,  not just what we are opposed to.\n\nIn 1994, Newt Gingrich drew up a Contract with America. It was a  simple set of priorities that Republicans promised to enact if they got  the House majority. Well, it worked; the Republicans took the House in  the 1994 mid-term elections.\n\nI propose a Contract for America, one that reflects who we…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689791/contract-for-america"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…misconduct. D.C., like       many other jurisdictions, initially passed these reforms in       response to the murders of George Floyd and Breonna Taylor       and the need to enact systemic police reform. In the wake of       the deployment of the National Guard and surge of federal law       enforcement in D.C., there has been an increase in instances…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696914/letter-led-by-the-leadership-conference-on-civil-and-human-rights-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…horrific crime.\n\n``President Trump and Congress have a duty to take action       to end this epidemic of gun violence. We cannot once again       wait for another tragedy before we enact common sense gun       safety laws.''", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694811/mourning-the-tragic-shooting-at-annunciation-catholic-church-in-minneapolis-minnesota"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…discuss the Democratic vision for building an affordable economy that  lowers costs and makes life better for the American people and the  Republican budget proposal that would enact the largest Medicaid cut in  American history in order to pass massive tax breaks for Republicans'  billionaire donors like Elon Musk.\n\nMr. Speaker, I am ready to yield. I…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689902/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…the  sick, and from the hungry and gives to the wealthy.\n\nAs our country prepares to celebrate its independence, the extremist  Republican Congress and Trump Administration enact the most cruel,  draconian, inhumane legislation that I've voted on since I've been  here. Government, I seriously believe, should help people and not hurt  them. At a time…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693186/one-big-beautiful-bill-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…would  vote to deny people lifesaving cancer treatment and research.\n\nRepublicans control the House, the Senate, and the White House, and  with a majority they have chosen to enact harm to make people hungry,  poorer, sicker, and less safe.\n\nThe shame and the sham of it all. You the people deserve better. We  the people deserve better, and I won't stop…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696696/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…PETTERSEN. Mr. Speaker, I rise today to recognize and applaud Amy  Zhang of Morrison, Colorado, for winning Best in Show in the 2025  Congressional App Challenge.\n\nAmy built EnAct: AI Guides, Vision-Impaired Act, an assistive  technology app for seeing impaired individuals that describes the  user's environment, helping them avoid pathway collisions.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698677/recognizing-amy-zhang"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…agree our immigration system is broken, cruelty is not the  solution. Harassment is not reform.\n\nWe must continue to shine a light on the Trump administration's  abuses. We must enact legislation that holds ICE accountable and builds  a fair immigration system.\n\nAt the end of the day, this is about who we are as a Nation. True  reform is possible, and I…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697456/fighting-dhs-immigration-raids"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…terminating the       national emergency [declaration on] tariffs (S.J. Res. 88       [and] S.J. Res. 77). The Chamber urges members of Congress to       work across the aisle to enact [this] legislation requiring       an up-or-down vote for any new tariffs and those imposed in       the year to date.\n\nThis is signed by Neil Bradley, Executive Vice President,…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696494/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…United States. He said:  ``You only arrest for the purpose of dealing with a felony that's  committed, and I don't count drunk driving as a felony.''\n\nWhen Republicans tried to enact this law in 2021, then Democratic  Committee on the Judiciary Chairman Jerry Nadler opposed any limit to  DUI convictions. He said that whether someone has 2, 6, 10, or 20…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693083/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…recognized that one of the reasons that some of  these people had to be sought out in the community is that the city of  Los Angeles and the State of California have chosen to enact sanctuary  policies that explicitly forbid ICE from taking custody of these  dangerous individuals in the safest and least disruptive setting, in a  custodial setting, that…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Bruce Westerman       (R., AR) and Rep. Jared Golden (D., ME) recently introduced,       would codify key elements of the Supreme Court's Seven County       Coalition ruling and enact judicial reforms to reduce NEPA       litigation, which, according to the Supreme Court, has       ``transformed NEPA from a modest procedural requirement into       a blunt…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Diego. That is why California had the longest  school shutdown in the entire country during COVID-19.\n\nI would hope that these latest numbers will serve as a wake-up call  to enact the sort of education reforms that have worked well in other  States because we are failing our students right now, and we are  imperiling our State and, increasingly, our…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…17(d)(1) acreages.\n\nWe appreciate your efforts to move forward with disapproval       of the 2024 Central Yukon RMP and we urge Congress and the       President to move quickly to enact this joint resolution.\n\nPlease let us know if you have any questions or if we can       provide any additional information.            Sincerely,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…for the future of finance in the Web3 world.\n\nPayment stablecoin legislation is critical to this foundation. If we  want to become the digital asset hub of the world, we must enact a  comprehensive  framework for the digital asset ecosystem.\n\nI urge my colleagues to support both the GENIUS Act and the CLARITY  Act and send a message that America leads…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693840/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…America fails, and the  world cannot afford that. I recognize that over these next few weeks we  will have very difficult conversations on the best way to extend these  cuts and enact President Trump's agenda, but they are conversations  worth having.\n\nMr. Speaker, America is counting on us.", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690715/help-small-businesses-thrive-again"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…harvesting and mining are desired activities.\n\nDemocratic Congressman Jim Oberstar was so far ahead of his time.  When the wilderness was enacted, he said: Okay, if you are going to  enact the wilderness, don't take our livelihoods away. He was so far  ahead of his time.\n\nToday, we are fighting that fight. I am fighting for my constituents.  I am fighting for…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "French Hill", "party": "Republican", "sentence": "…recommendations with respect to how to reduce the       number of residential heirs properties, including--\n\n(A) by incentivizing States and other jurisdictions which       enact or adopt the Uniform Partition of Heirs Property Act or       similar such reforms;\n\n(B) by awarding grants to States and other jurisdictions to       assist residents of such…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…line.\n\nI want to emphasize that this is going to nullify an executive order.  It is going to attack his agenda, the America First agenda, that he was  overwhelmingly elected to enact.\n\nThese unions are not neutral actors. The word ``billionaires'' was  mentioned by my colleague from California. I am glad he mentioned the  term ``billion,'' because that…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697990/protect-americas-workforce-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…will assess opportunities to expand capacity as  well as current risks to refineries.\n\nH.R. 3109 will provide the Committee on Energy and Commerce the  information we need to enact policies to deliver affordable, reliable,  and clean energy to all Americans.\n\nI thank Representative Latta, the chairman of the Energy  Subcommittee, for his leadership on…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…their wait list. However, the teachers at  those schools are not automatically unionized as a matter of default.\n\nThat is what inspired Gavin Newsom and his enablers to try to enact  and, indeed, succeed in enacting an anti-charter school agenda. Because  TFA placed almost 50 percent of its teachers in charter schools, they  got caught up in it.\n\nFortunately,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…Constitution intended for this House  of Representatives to be the most accountable to the will of the  people, and the will of the people is clear. We must pass this bill  today and enact the SAVE America Act.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699936/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…be able to, but  Californian politicians have no right to remove the choice to buy a  gas-powered vehicle from my constituents.\n\nThe Biden EPA wrongly allowed California to enact an electric vehicle  mandate that will ultimately affect the entire United States.\n\nWhat works in Glendale does not work in Gettysburg. Allowing the  California waiver to stand…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690494/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Texas visitors will enjoy those glad tidings from Flatside.\n\nI include in the Record an article titled: ``Opposites Attract: How a  Conservative Texan Helped a Liberal Arkansan Enact the Sweeping  Arkansas Wilderness Act of 1984.''   Opposites Attract: How a Conservative Texan Helped a Liberal Arkansan             Enact the Sweeping Arkansas Wilderness…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}]