[{"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…of jurisdiction. I  don't understand how my colleagues are giving away all of our  congressional authority to make sure that the children in our  communities are protected.\n\nEnding funding or eliminating the Department does not end our legal  obligation to provide services to kids who rely on public education.  One of two things is going to happen in…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689644/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Potomac rivers,  which surround D.C., are tidally influenced. In addition, the Maryland  and Virginia coastal zones each include the tidal Potomac River, with  Maryland's zone ending at the D.C. line.\n\nI urge my colleagues to support this bill.", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696521/introduction-of-the-district-of-columbia-flood-prevention-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…hunger.\n\nI was joined by my incredible family--my wife, Lisa; my son, Patrick;  Wendy, Bill, and Courtney Talcott; and baby Hazel. Their support and  commitment to the cause of ending hunger means the world to me.\n\nI am grateful to Congressman Richie Neal and former Congressman Joe  Kennedy for joining the march. I thank my colleagues in State  government…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697684/16th-annual-march-for-the-food-bank"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…with Project 2025's  proposals on higher education, it is abundantly clear that this  administration is following Project 2025 to a tee.\n\nProject 2025 lays out a blueprint for ending the Federal Government's  role in public education, starting with dismantling the Department of  Education, so that they can find the money they need to provide tax  breaks…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688251/nomination-of-linda-mcmahon"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…life, so that to have one we must forsake the       other.\n\nThe answer--\n\nHe said--       is not to abandon growth, but to redirect it. For example, we       should turn toward ending congestion and eliminating smog       with the same reservoir of inventive genius that created them       in the first place.\n\nNow, Richard Nixon--that was in January of 1970.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…served honorably for over six years, including  deployments to both Afghanistan and Iraq. His time in uniform coincided  with some of the most dangerous years of conflict, ending in 2011.  During that period, he witnessed the loss of many fellow Marines-- brothers and sisters in arms who gave their lives in service.\n\nIn 2011, while deployed in Afghanistan,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691113/recognizing-the-incredible-service-of-united-states-marine-corporal-joseph-donald"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…opportunity, and  promoting solar and clean energy.\n\nAfter experiencing firsthand, in the most horrific fashion possible,  the horror of a mass shooting, she refocused her efforts on ending the  gun violence epidemic in America once and for all. We honor her and  celebrate her for the transformational work that she has done in the  years that have followed.\n\nHouse…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698770/marking-15-years-since-tucson-shooting"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…conflict.\n\nFor rollcall vote No. 544, On the Cloture Motion (Motion to Invoke  Cloture: Motion to Proceed to S. 2882), a bill making continuing  appropriations for the fiscal year ending September 30, 2026, and for  other purposes, I would have voted yea.\n\nFor rollcall vote No. 545, On the Cloture Motion (Motion to Invoke  Cloture: Motion to Proceed to H.R.…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696064/vote-explanation"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…of the staff it needs to prevent the spread  of food-borne disease.\n\nFinally, I think the withdrawal of the United States from the World  Health Organization and illegally ending American food programs also  exposes the entire world and ultimately the United States to  substantial risks. Remember that when somebody suffers from a disease  abroad, that…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692798/agricultural-risk-review-act-of-2025"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…that during a visit to Kosovo a few years ago.  While standing at Secretary Albright's statue, an older man approached  to thank us for her leadership and for the U.S. role in ending the war  there. It was a clear reminder that when the United States stands with  people fighting for basic rights, it makes a difference.\n\nOn this Human Rights Day, we should…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697939/international-human-rights-day"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…out of  foster care. Now is not the time to raise grocery costs for families  and force states to choose between taking SNAP benefits away from large  numbers of people or ending their SNAP programs entirely. This is  inexcusable in the United States of America. Access to food stamps when  I was in college helped me complete my education, and without…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…of our economy from  Main Street shops to factory floors.\n\nMr. MEEKS. While Trump may have started this, if this Republican  majority chooses to duck a vote on my resolution ending these tariffs,  then they will own this, too. They will own the higher prices. They  will own the jobs lost. They will own the retirement savings erased.  They will own all…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689705/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…can score political points, such as by demonizing  immigrants.\n\nWhere is this passion and work on affordable housing for D.C.  residents? Where is this impassioned work on ending gun violence for  D.C. residents? They only bring it up to the floor when they think they  can score political points, taking away the democratic rights of people  here in…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692318/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…other services.\n\nMy Republican colleagues have thoughtlessly rubberstamped a budget  proposal that accelerates privatization of veterans' healthcare;  threatens progress on ending veteran homelessness; erodes access to  disability benefits; guts VA IT modernization, unless someone happens  to be one of the President's tech friends; and needlessly drags…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692950/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…and so much else. He talks about a lot of things that may sound nice,  but he never follows through or delivers on any of his promises.  Whether it is costs or Epstein or ending forever wars, the pattern is  the same. Donald Trump talks about credit cards one day, food prices  the next, housing the day after, but never actually follows through on…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…pursued the no new leasing  alternative, pulling 481,000 acres of America's largest coal reserves  and resources offline, making 48 billion short tons of coal unavailable  and ending leasing in the Powder River Basin.\n\nSuch a decision cannot be considered a legitimate or legal RMP  pursuant to  FLPMA, and neither does it align with Congress' multiple use…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696878/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…who are no longer living. It is wasteful,  avoidable, and undermines trust in government-run programs.\n\nAs founder and co-chair of the DOGE Caucus, I am proud to support the  Ending Improper Payments to Deceased People Act. It is a commonsense,  bipartisan effort to strengthen the accuracy of the Death Master File,  improve data sharing across Federal…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698919/ending-improper-payments-to-deceased-people-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…Sec. 3. Upon adoption of this resolution it shall be in       order to consider in the House the bill (H.R. 6938) making       consolidated appropriations for the fiscal year ending       September 30, 2026, and for other purposes. All points of       order against consideration of the bill are waived. The bill       shall be considered as read. All points…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Authority.--The period       specified in this subsection is the period beginning on the       date of the enactment of the Aerial Firefighting Enhancement       Act of 2025 and ending on October 1, 2035.''.\n\nMr. Speaker, I am happy to support S. 160, the Aerial Firefighting  Enhancement Act.\n\nThis bill will amend the Wildfire Suppression Aircraft Transfer…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691858/aerial-firefighting-enhancement-act-of-2025"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…after Harvard.\n\nOur President declared war on law firms: revoked security clearances,  threatened their viability by taking away their capacity to walk into  Federal buildings, ending Federal contracts. Why? Because if you can  control who a law firm is willing to represent, you can suppress  dissent.\n\nSome of our Nation's most reputable and accomplished…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…explosions, and       other hazards relating to lithium-ion batteries used in       micromobility products during the period beginning on the       date of enactment of this Act and ending on the report date.\n\n(2) Content.--The report required by paragraph (1) shall       describe, at a minimum--\n\n(A) the source of the information that was provided to the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690261/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…these water heaters the Biden administration attempted to outlaw. The  job-killing regulation we seek to repeal today is another painful  example of the radical left's never-ending war on hydrocarbons and  American energy production.\n\nThe sinister purpose of this regulation was to try to single out and  eliminate an American manufacturer of water heaters…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688294/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…that they know this is going to be a long-term effort to  make certain that we address crime.\n\nNow, in the Senate, we have several bills that are supporting this  effort. My Ending Cashless Bail in our Nation's Capital Act, which  would require Washington, DC, to use the highest level of cash bail  necessary for dangerous offenders as a condition of pretrial…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695666/cloture-motion"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…reporting means the full scope of the problem remains unknown today.  This is money that should have gone to serve the American people, not  to subsidize private union interests.\n\nEnding ``official time'' is a commonsense step to ensure taxpayer  dollars are used responsibly and to increase accountability across the  Federal workforce. Public funds should serve…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689724/congratulating-glenvar-high-school-boys-swim-team"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…this resolution it shall be       in order to take from the Speaker's table the bill (H.R.       7148) making further consolidated appropriations for the       fiscal year ending September 30, 2026, and for other       purposes, with the Senate amendments thereto, and to consider       in the House, without intervention of any point of order, a…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…are missing  the point. It is about people in our country being put first. It is  about putting Americans first. What a concept.\n\nThat is because American citizens support ending the waste, the  fraud, and the abuse in places like USAID.\n\nA ``yes'' vote today will stop wasteful spending on programs like  $500,000 for electric buses in Rwanda, $4 million…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…and makes  permanent the 199A small business deduction to keep our economy  humming. This is a big win for our West Virginia businesses.\n\nIt provides relief to gig workers by ending the Democrats' absurd  $600 1099-K reporting threshold and reverts back to the time-tested  standard of $20,000 and 200 transactions. It will provide economic  relief, secure…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693189/one-big-beautiful-bill-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…proficiency or duty locations.\n\n(g) Period Specified.--The period specified in this       subsection is the period--\n\n(1) beginning on the date of enactment of this Act; and\n\n(2) ending on the later of--\n\n(A) December 31, 2029; or\n\n(B) the date on which the authority under section 352 of       title 37, United States Code, to grant assignment or special…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Colorado Springs.\n\nThe National Day of Remembrance for Aborted Children is focused on  helping to humanize our aborted brothers and sisters and deepening the  commitment to ending the injustice of abortion and providing healing to  those who have experienced an abortion.\n\nI honor the Colorado Springs Diocese and other faith-based  organizations in the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695195/recognizing-pastor-stewart-mcwilliams"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…premiums that everybody faces today are a result of the inaptly named  Affordable Care Act and the many failures associated with it.\n\nMr. Speaker, this bill today is about ending the misery Democrats  created on families. This is not just about funding the government. It  is not just about solving other problems that we should be working to  solve.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696745/continuing-appropriations-and-extensions-act-2026"}]