[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…he said that in many ways the marchers had come to collect  on a promissory note in our Declaration of Independence written 250  years ago, which promised that all men were endowed by their creator  with the inalienable rights of life, liberty, and the pursuit of  happiness. Thomas Jefferson didn't mean all men. He didn't include the  men, women, and…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…it the notion that there  should  be liberty and justice for all. I am proud to know that we have these  words that indicate to all that all persons are created equally and  endowed by the Creator with certain inalienable rights, among them  life, liberty, and the pursuit of happiness.\n\nI am proud that we would receive and have the Statue of Liberty.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Government. This is people are dying, and  our Declaration of Independence that we will celebrate the 250th  anniversary of next year says that: All men--and I would add women--are  endowed by their creator with certain inalienable rights: life,  liberty, and the pursuit of happiness. Life is number one.\n\nWhen the Federal, State, and local governments work together…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…into new foreign wars, especially wars of our own  making, and we have the power to make good on that instruction. We are  a coequal branch of government and the only branch endowed with the  power of the purse and the power to declare war or to refuse to do so.\n\nBut if we do not assert these powers, if we don't stand up not just  for our branch of government…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698678/venezuela"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…of the  governed when we have a President who has sought to overturn the voices  and votes of the people in a bid to stay in power?\n\nNow, our Founders maintained that we are endowed with certain  inalienable rights, but we have a President who routinely attacks the  right to due process and freedom of speech, who has sought to use the  heavy hand of government…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698503/9999"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Hillier.\n\nI just want to say that the Declaration of Independence clearly  states:\n\nWe hold these truths to be self-evident, that all men are       created equal, that they are endowed by their Creator with       certain unalienable Rights, that among these are Life,       Liberty and the pursuit of Happiness.\n\nHow can you have life, liberty, and the pursuit…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…only White  land-owning men could vote; the home, the birthplace, of American  slavery; and the birthplace of Thomas Jefferson, who wrote that all men  are created equal and endowed by their creator with the unalienable  rights of life, liberty, and the pursuit of happiness. He excluded  nearly half a million enslaved men and women, indeed, all the women…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689341/fighting-voter-suppression"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Declaration of Independence, authored by Thomas  Jefferson, makes the famous statement: ``We hold these truths to be  self-evident, that all men are created equal, that they are endowed by  their creator with certain unalienable rights, that among these are  life, liberty and the pursuit of happiness.''\n\nMr. Speaker, I want to lock in for just a moment on…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…member of his  community, as a trustee for the John Randolph Foundation, and as a  member of the city of Hopewell's planning commission.\n\nHe helped establish a permanently endowed scholarship for  Chesterfield, Hopewell, and Prince George students pursuing a medical  career.\n\nI thank Colonel Butler for his service to our Nation and admire all  he has…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696920/recognizing-william-woodard-butler-veteran-of-the-year"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…people and their representatives to  make it less likely that we go to war.\n\nThe founding generation was largely united in the opinion that the  American President would not be endowed with the monarchial powers to  initiate war unilaterally. These Founders were not just engaged in a  sales pitch; they were accurately representing the Constitutional  Convention's…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "French Hill", "party": "Republican", "sentence": "…renamed prelaw  program at Hendrix College in Conway.\n\nThanks to a generous $250,000 donation from George and Sallie Gill in  honor of their brother and brother-in-law, this endowed program will  help prepare Hendrix students for a legal career.\n\nAs a former president of the Arkansas Bar Association and member of  the  American College of Trial Lawyers,…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688705/recognizing-lorie-tudor-on-her-retirement"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…chemistry  equations. Rather, students build their work ethic, establish critical  thinking skills, and learn what it means to be a citizen of our great  country. Teachers are endowed with educating our students, which is why  I am incredibly thankful to all the educators at Carroll High School  for carrying out this mission. Their dedication to teaching…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694841/recognizing-carroll-high-school"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…about the first document that birthed our  Nation, the Declaration of Independence. ``We hold these truths to be  self-evident, that all men are created equal, that they are endowed by  their creator with certain unalienable rights, that among these are  life, liberty, and the pursuit of happiness. That to secure these  rights, governments are instituted…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692892/dobbs-v-jackson-anniversary"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Twin City Lodge  No. 76, Emeritus Certified Municipal Official by League of  Municipalities, National League of Cities Christian Public Officials  Caucus, Julius E. Talton Endowed Program Support Fund and University of  Alabama College of Communication and Information Sciences.\n\nHe received the Rotary International Paul Harris Fellow, Opelika  Exchange…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696582/recognizing-the-retirement-of-mayor-gary-fuller"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Democratic       Republic of the Congo (DRC), Madagascar, Malawi, Mauritania,       Mozambique, Namibia, South Africa, Tanzania, and Zambia--are       among the world's most well endowed with critical minerals.\n\nIn fact, five of the world's top fifteen destinations for       rare earths exploration in the past year were AGOA       beneficiaries: South Africa,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…transact predates any  government. People would transact with one another before we had a  government. It is an inherent natural right. As our Founders  recognized, we are endowed by our creator with certain inalienable  rights, that among them are life, liberty, and the pursuit of  happiness.\n\nOne of the ways we pursue happiness is by transacting with…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…position in  Congress, I can support legislation that protects the defenseless  unborn and can stand up for their God-given right to survive, a gift  that truly should only be endowed upon any of us by the grace of our  creator.\n\nIt is truly inspiring to witness the multitudes of Americans who  journey from far distances across this great country to attend…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699378/march-for-life"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…is a commitment to the founding ideals of our country,  however differently we might conceive of them at any given moment, that  all men and women are created equal and are endowed by their creator  with inalienable rights.\n\nMore basically, we all want to see our economy thrive, our  communities safe, and our families happy and healthy.\n\nThe last time…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695355/tragic-loss-of-charlie-kirk"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…home. Each       generation has a responsibility to instill a love of liberty       and virtue in the hearts of the next generation.\n\nWe affirm that ``All men and women are endowed by their       Creator with certain unalienable rights and to secure these       rights, governments are instituted among men, [receiving]       their just powers from the…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688744/declaration-of-mothers-a-proclamation-and-pledge-for-the-preservation-of-freedom-and-virtue"}]