[{"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…housing development, which stood as a symbol both of the challenges of  poverty and  segregation, and of the enduring hope of working families seeking a  better life. Her name endures in our memory because her legacy endures.\n\nAs we close out Immigrant Heritage Month, Saint Frances Xavier  Cabrini challenges us to stand up to those in power who would seek…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…fellow  soldiers.\n\nAfter years of valiant service, Mauro transitioned out of military  life, recognizing the profound impact of his experiences in Vietnam.  Yet, his legacy endures--not only through his military contributions  but also in the example he sets for future generations about duty,  resilience, and honor.\n\nIt is with great respect and admiration…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689403/congratulating-mauro-reza-boots-on-the-ground-alliances-veteran-of-the-year"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…essential to their community.\n\nDespite the challenges they face as a small business--staffing  shortages, supply chain issues, competition from online retailers--Dan  & Whit's endures. The store represents the best that Vermont has to  offer: a place where the person ringing up your groceries knows your  name and where those running the store care more…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694332/recognizing-dan-whits-general-store"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…fought for--what John Lewis  fought for, and what millions of Americans have fought for--since the  first day in 1619, when Africans were brought to these shores  involuntarily--endures. From day one, through acts of rebellion,  resistance, and self-liberation, fought for an America that included  them, and we the people.\n\nWe carry out that legacy, and we…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…eulogy, to the downfall of DOGE and to the people's movement that  brought about its demise.\n\nAs we say good-bye to the departing, we take solace in knowing that  our democracy endures in our people and our communities.\n\nThe centralized Department of Government Efficiency, imagined in the  insane mind of Elon Musk and empowered by those around him, which…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697304/ode-to-doge"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…she would never meet.\n\nWe honor the strength of her family who made this courageous decision  with love and grace. Sydney's passing reminds us that even in sorrow,  goodness endures. One life lived fully and generously can change the  lives of many.\n\nSydney Boisselle was a shero to working people and to so many who  came to know her. May her name be honored…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…to us to guard and to protect it. We take that  very seriously on this side of the aisle.\n\nIn just a few moments, we will remind the world why the American  experiment still endures today and why its best days are still ahead of  us.\n\nMr. Speaker, with the One Big Beautiful Bill Act we are going to make  this country stronger, safer, and more prosperous…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…than a colleague. He was a friend. He was a brother.  His leadership, his wisdom, and his heart for service will be deeply  missed. Doug's legacy of faith and service and love endures.\n\nLord, accept this gentle giant, this dedicated giant, Doug LaMalfa.  May his family have the goodwill to know that he lies in your comfort.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698721/9999"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Official State Steam Locomotive in 2017, and  added to both the Virginia Landmarks Register and the National Register  of Historic Places in 2023 and 2024, the 611's legacy endures.\n\nMr. Speaker, as we mark this milestone, let us salute 611 and all of  those in Roanoke and beyond who have kept its whistle echoing through  the Blue Ridge and across the…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691982/recognizing-southern-virginia-universitys-ncaa-division-iii-mens-volleyball-national-championship-victory"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…of that early history. My office  will continue working with FEMA and our State, county, and local  partners to assist with the pier's restoration, ensuring this landmark  endures for future generations.\n\nFlagler Beach has always been defined by its close-knit community,  small businesses, and the enduring spirit that makes this city truly  unique.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697751/recognizing-lady-lake-florida"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…American spirit. From humble beginnings to professional achievements,  their legacy is one of faith, family, and community. It is proof that  the American Dream is alive, that it endures, and that the American  Dream can be fulfilled through generations to come through resilience,  devotion, hard work, a love of family, and faith.\n\nMr. Speaker, I thank the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695647/recognizing-the-suarez-delgado-family"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…Point.\n\nThe enduring legacy Captain Carol MacGibbon leaves at West Point  stands as a beacon for those who aspire to lead and serve, ensuring  that the academy's proud tradition endures for generations to come.\n\nMay God bless Captain Carol MacGibbon. May God bless the United  States of America.", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696747/recognizing-veterans-in-texas-third-congressional-district"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…every one of  these folks in mourning and in the pursuit of answers in this tragic  accident.\n\nThis tragedy demands a full and thorough investigation to ensure that  no family endures this kind of heartbreak again. The safety of our  skies and the trust of the American people depend on accountability,  transparency, and action.\n\nMr. Speaker, let us honor…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688370/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…heroes answered the call to defend liberty, knowing it could  cost them their lives. Because of them, we live in a country where  freedom still rings and the American Dream endures.\n\nTheir sacrifice is not just a chapter in our history; it is the  foundation of our Republic. We are duty-bound to remember them, to  honor them, and to ensure that their…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691575/recognizing-the-75th-anniversary-of-james-wood-high-school"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…this bill will be a fitting way to honor the  lives of those lost nearly 1 year ago over the Potomac River.\n\nThe goal of the victims' families is to ensure that no one else  endures a similar, avoidable, completely unnecessary tragedy.\n\nWith that, I yield to Ranking Member Cantwell.\n\nMr. CRUZ. Mr. President, I now yield to Senator Moran, who has been…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698320/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…of Texas. Many of my colleagues have been  affected across the State, but I thank them for their prayers and their  well-wishes.\n\nJust know, Mr. Speaker, that their spirit endures. I cannot tell you  how proud I am of the people of Texas, the people of Kerr County,  Texas, and the first responders who are today back in the floodwaters,  resuming the…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693607/mourning-the-loss-of-life-in-the-state-of-texas"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…soldiers.\n\nI am introducing a resolution to establish September 9 as the  National World War II Italian Campaign Remembrance Day to commemorate  their valor and ensure their legacy endures for generations to come.\n\nEighty-two years ago, Allied forces launched Operation Avalanche,  marking the start of the liberation of the Italian Peninsula from  fascist Nazi…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694990/measure-read-the-first-time-s-res-377"}, {"senator": "Patrick Harrigan", "party": "Republican", "sentence": "…advance  our Nation's security.\n\nAs he transitions to his next assignment, I honor his exemplary  service and wish him, his wife Crystal, and their daughters well. His  legacy endures.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693703/recognizing-sergeant-major-harold-m-watts-iii-service-to-the-national-guard-bureau"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…honor its board members, staff,  volunteers, supporters, and everyone who has worked to carry forward  Dr. Jaisohn's vision. Their dedication ensures that his legacy not only  endures but continues to shape future generations.\n\nMr. Speaker, I offer my congratulations and deepest gratitude. May  the next fifty years be marked by continued growth, service,…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696635/recognizing-the-50th-anniversary-of-the-philip-jaisohn-memorial-foundation"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…President George W. Bush posthumously awarded  him the Medal of Honor in 2008.\n\nToday, the post office in Knox, Pennsylvania, bears his name,  ensuring that his legacy of heroism endures in the community he once  called home.\n\nAnother Pennsylvanian whose bravery is etched in history is Private  First  Class Foster Sayers, a 20-year-old infantryman from my…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689171/national-medal-of-honor-day"}]