[{"senator": "Shontel Brown", "party": "Democrat", "sentence": "…distinguished service and       meaningful impact, and extend heartfelt congratulations on       this historic milestone.\n\nBe it further resolved, this resolution honors the enduring       legacy of the Greater Cleveland Alumnae Chapter and its       commitment to uplifting, empowering, and transforming our       communities for the better.", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691694/recognizing-the-greater-cleveland-alumnae-chapter-of-delta-sigma-theta-sorority-incorporated-on-their-centennial-anniversary"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…the life and legacy of Adrian Earl Jenkins, Sr.  Our city, our Nation and the world are better because he walkdd among  us. We mourn his loss but celebrate a life whose enduring legacy is  written in the lives he touched: teachers inspired to teach, children  who learned they mattered, neighbors who found courage, and a family  that will carry his love…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699459/in-memory-of-mr-adrian-earl-jenkins-sr"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "Mr. MEEKS. Mr. Speaker, I rise today to honor the service and  enduring legacy of Mr. Rick Cotton, one of the most impactful  transportation leaders New York has ever known. His profound career  reflects an unwavering commitment to public service,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699560/recognizing-rick-cotton-for-a-lifetime-of-leadership"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…that every child deserves access to  quality education and a supportive community. Mrs. Booker has been  involved with many social and civic organizations recognizing her  enduring legacy to her community to include Partners in Education  Coordinator, Department of Family and Children Services, Columbus  Community Center, Student Assistant Professional…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694759/recognizing-mrs-juanita-carson-booker"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…here at home.\n\nThere is nothing we can pay them that will ever match their  sacrifice, but voting for this act is a step toward recognizing their  service, courage, and enduring legacy. It is about showing them not  just with words but with action that they are seen and valued and that  they will never ever be forgotten.\n\nMr. Speaker, I support H.R.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688216/medal-of-honor-act"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…portfolio. Rather, it is the voices that may otherwise have gone  unheard and the generations of filmmakers who she has inspired that  will be credited as her most powerful and enduring legacy.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696266/recognizing-ms-ava-duvernay-art-as-a-catalyst-for-change"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…2003, leaving behind a legacy of excellence in both her workplace and  her community.\n\nIt is an honor to recognize Norma Thom during Caribbean American  Heritage Month. Her enduring legacy continues to uplift Rochester and  inspire future generations.", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692568/recognizing-norma-thom"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…capping a distinguished career characterized by integrity,  valor, and commitment to military justice.\n\nI celebrate not only General Hansen's 92nd birthday but also his  enduring legacy of patriotism and exemplary service that continues to  inspire our Nation.\n\nI thank him and wish him a happy birthday.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693452/brigadier-general-donald-wayne-hansen-celebrates-92nd-birthday"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…and community engagement that continues to inspire future generations;  and\n\nWhereas, on this occasion of its demisemiseptcentennial, we celebrate  Defiance College's enduring legacy, its significant contributions to  the educational and civic landscape, and its bright future in the years  ahead;\n\nNow, therefore, I, Congresswoman Marcy Kaptur, proudly…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688913/proclamation-for-defiance-colleges-demisemiseptcentennial"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…of Skagit County.\n\nMr. Speaker, it is an honor to commend Commissioner Janicki for her  outstanding leadership and vision, dedication to serving her community,  and the enduring legacy she has helped to cultivate. I ask my  colleagues to join me in expressing our deepest gratitude for her  service.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698557/recognizing-lisa-janicki"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "Mr. VEASEY. Mr. Speaker, I rise today to recognize the outstanding  contributions and enduring legacy of the Junior League of Arlington  (JLA), an organization that has been empowering women and strengthening  the Arlington community for nearly five decades.\n\nFounded on…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696424/recognizing-the-junior-league-of-arlington-empowering-women-strengthening-community"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…``Lunar Flight'' named in honor of his  call sign, ``Moon.'' Upon his return, he was greeted by family,  friends, and fellow airmen who celebrated his remarkable career and  enduring legacy.\n\nMr. Speaker, Colonel Halasi-Kun embodies the very best of our armed  forces: courage, professionalism, and an unwavering commitment to duty.  His leadership has left…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698681/recognizing-colonel-david-moon-halasi-kun"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…with him.\n\nDoug will be remembered for his deep love for his family, his faith  and core principles, his unwavering dedication to his community, his  humility, and his enduring legacy as a leader and lawmaker.\n\nI am personally grateful for his mentorship and know he will be  profoundly missed by all who knew him.\n\nI certainly will vow to honor Doug's…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698728/9999"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…the South Dayton Depot continues  to thrive as a source of pride for the entire region.\n\nI ask that the United States House of Representatives join me in  honoring the enduring legacy of the South Dayton Depot and congratulate  them on this important milestone.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694965/recognizing-the-south-dayton-depot-on-its-150th-anniversary"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…deeply believed in the  transformative power of higher education, and his stewardship directly  strengthened Georgia for generations.\n\nMr. Speaker, Dr. Adams has left an enduring legacy that will forever  touch the soul of our beloved State.                 Honoring Colonel Stephen ``Tracker'' Thomas\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699886/mark-burns-inducted-into-living-legends-of-aviation"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…recognize the Jewish Community Center  of Greater Buffalo on this important milestone and urge all residents  of New York's 23rd District to join me in honoring the JCC's enduring  legacy of service and its continued contributions to our community.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693643/recognizing-the-jewish-community-center-of-greater-buffalo-on-its-80th-anniversary-of-service-and-community-leadership"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…look forward to hopefully one day being the proud parents of five  Eagle Scouts.\n\nToday, Mr. Speaker, let's honor the Scouts, the volunteer leaders,  the parents, and the enduring legacy of Robert Baden-Powell, whose  vision still calls each new generation to duty, service, and  leadership.\n\nMay we always support this movement so that more young Americans,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697297/recognizing-ron-hauenstein"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…celebrate the achievements of Hoskins Drug Store, Mr. and  Mrs. Hoskins, and the ongoing contributions of Mrs. Dudley Hoskins  Bostic and Mrs. Molly Hoskins Scarbrough. Their enduring legacy is a  testament to the power of family, tradition, and the unwavering  commitment to serving the needs of the community.\n\nAs Hoskins Drug Store enters its 95th year, we…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689423/recognizing-hoskins-drug-stores-95th-anniversary"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…generations of students to face the future  while remaining rooted in their faith.\n\nSt. Theresa continues to shine as a beacon of excellence in Catholic  education, with its enduring legacy carried forward by a community that  fully embodies its mission. Congratulations to St. Theresa Catholic  School on a century of service.        Extraordinary Achievements…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696910/congratulating-st-theresa-catholic-school"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…and a mentor to the next  generation of Air Force leaders. His leadership has been recognized  with the Legion of Merit and many other commendations. However, his  most enduring legacy will be found in the lives he has influenced, the  careers he has shaped, and the high standard of integrity he has upheld  throughout his service.\n\nMr. Speaker, Colonel…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696101/recognizing-the-service-of-colonel-trenton-n-twedt"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…communities.\n\nAs we commemorate this remarkable milestone, we recognize not only  the 250 years of service and sacrifice by the United States Marine  Corps but also the enduring legacy carried forward by the brave men and  women who wear, or have worn, the Eagle, Globe, and Anchor. Their  commitment to God, Country, and Corps remains a model of selfless…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696572/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…leadership in the continuous  struggle for a world where all are free.\n\nMr. Speaker, please join me in recognizing Annie Wilcox Boyajian's  extraordinary service and the enduring legacy of Freedom House--a  legacy that continues to inspire hope and action in the pursuit of  freedom for all.", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700047/recognizing-the-service-of-annie-wilcox-boyajian"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…beginning of  another, but the impact of Dale Greer's work will continue to be felt  for decades to come. His leadership, service, and devotion to Cullman  County have left an enduring legacy that will benefit families,  businesses, and future generations.\n\nMr. Speaker, I would also like to recognize Mr. Greer's family, who  has supported him throughout his…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699608/recognizing-mr-dale-greer"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…countless young  men and women whose lives she has helped shape.\n\nWe extend our gratitude and best wishes upon her retirement as  academy liaison officer for West Point.\n\nThe enduring legacy Captain Carol MacGibbon leaves at West Point  stands as a beacon for those who aspire to lead and serve, ensuring  that the academy's proud tradition endures for generations…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696747/recognizing-veterans-in-texas-third-congressional-district"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…combat.\n\nMr. Speaker, as chairman of the House Committee on Veterans' Affairs,  I ask all of my colleagues to join me in honoring the Chosin Few and in  recognizing the enduring legacy of courage, sacrifice, and freedom that  their service represents.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695858/recognizing-the-75th-anniversary-of-the-battle-of-chosin-reservoir"}]