[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…long struggled to access the VA healthcare they  have earned. This legislation could help reduce the rate at which these  veterans must be referred to community providers or endure lengthy  travel to access services at VA medical facilities thousands and  thousands of miles away from home.\n\nVeterans deserve access to the care and benefits they have earned,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695430/territorial-response-and-access-to-veterans-essential-lifecare-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…given the current  multiyear gas turbine shortage.\n\nGrid reliability regulators have been basically clear: Renewable  energy and batteries were critical in allowing the grid to endure  multiple heat waves this summer.\n\nThat is why Texas has added more solar and wind energy to their power  grid, more than any other State in the country, in the wake of their…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…their compassionate care during Sharon's final days.\n\nSharon Lavonne Harris Rischer was truly a pillar of our community,  and her legacy of kindness, faith, and family will endure in the hearts  of those she leaves behind. May she rest in peace, and may her memory  continue to inspire all who knew her.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687993/recognizing-sharon-lavonne-harris-rischer"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…to construction  workers who could now be forced to operate in unsafe conditions with no  guarantee of adequate lighting or visibility standards; to farmworkers  who already endure grueling conditions are being stripped of hard- fought protections.\n\nNone of this is okay. This is not normal.\n\nAllow me to say this plainly for the second time tonight: If…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…the things that he did manage to do and some  of the havoc that he has managed to wreak.\n\nIn the first 100 days of the Trump administration, we have had to,  unfortunately, endure a lot of pain. This administration clearly is not  ready to lead. They are only here to tear down.\n\nIn just 100 days, we have witnessed an administration hell-bent on  dismantling…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…understood that democracy depends on compassion,  engagement and the courage to speak out.\n\nProfessionally, Rob was an iconic figure in film and television whose  work will endure for generations. And Michele's own leadership--behind  the camera and in support of artistic expression--were integral to the  couple's success. Their partnership was a testament…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698360/rob-and-michele-reiner-tribute"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…She devotes time to teaching young  people how to prepare and appreciate authentic Caribbean dishes,  ensuring that the flavors, stories, and values of our shared heritage  endure.\n\nIt is my distinct honor to recognize Marlene Henry this Caribbean  American Heritage Month. Her deep compassion, cultural pride, and  unwavering service enrich our community…", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692569/recognizing-marlene-henry"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…grid, given the current multiyear gas turbine shortage.\n\nGrid reliability regulators have been clear that renewable energy and  batteries were critical in allowing the grid to endure multiple heat  waves this summer. That is why Texas added more solar and wind energy  to their power grid than any other State in the country in the wake of  the blackouts…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695754/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…indiscriminate gassing of innocent families, including a 1-year-old  just a week ago.\n\nFamilies in my district are living with fear and trauma that no one  should have to endure in our country.\n\nLast week, we returned after 54 days with the House shuttered,  including a 43-day shutdown. We returned hoping for Democratic unity.  Therefore, I was shocked…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696777/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…colleague. She was a mentor and a  friend to many of us. She was a voice of compassion and reason. She  believed in the power of government to do good, and her legacy will  endure through the lives she touched and the barriers she broke. May  her memory be a blessing.\n\nMr. NADLER. Mr. Speaker, I thank Congressman Lawler for those kind  words.\n\nMr. Speaker,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689210/in-memory-of-the-honorable-nita-m-lowey"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Iraq to the  persecution of Ukrainian Christians by Russian occupation forces, so  many of our neighbors at home and abroad live with vulnerability and  insecurity as they endure the dangers of religious and ethnic  persecution within their own communities.\n\nIt is important that these incidents, though only a fraction of the  examples we have of the…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690781/we-have-a-shared-humanity"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…ensure veterans receive the support they deserve, the Department  of Veterans Affairs must provide timely and accurate data on program  outcomes. Veterans should not have to endure excessive wait times  before accessing their critical services. This requires the VA to  report on employment rates, wages, and average wait times, guaranteeing  that veterans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695446/veterans-readiness-and-employment-program-integrity-act"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…histories that  make some people uncomfortable, but discomfort is not a justification  for censorship.\n\nIf we allow history to be erased in our national parks, places meant  to endure beyond political cycles, we normalize the idea that facts are  optional and truth is negotiable.\n\nThat is not just an attack on historians or park rangers. It is an  attack…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699714/rewriting-history"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…included. Our mission has been to destigmatize and normatize       conversations around mental health within the Haitian       community, a community that has long been taught to endure       suffering in silence, to ``be strong,'' and to survive       without support. For many of our clients, seeking mental       health care represents a cultural and emotional…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…On the 80th anniversaries, people of many generations will gather at  Hiroshima and Nagasaki. Very few survivors of those atomic bombings  remain with us, but their stories endure. The disturbing photos of the  burns and the radiation sickness endure.\n\nIn those cities, those gathered will recommit to preserving the  memory of the destruction, and to…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…this heinous attack, as well.\n\nThere is no place in our country for politically motivated violence.  None. The fact that the Hortman and Hoffman families are being forced  to endure the consequences of inexplicable evil is heartbreaking,  devastating, and infuriating for us all, but it is through tragedies  like this that we are reminded that we are stronger…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692785/in-memory-of-mark-and-melissa-hortman"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…sense of humor, collegial manner, and expertise will be sorely  missed. While he is no longer with us, Doug's significant contributions  to agricultural and rural policies will endure long after his passing.\n\nI will very much miss my friend and my colleague. My thoughts and  prayers are with his wife, Jill; the entire LaMalfa family; his  friends; and his…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698725/9999"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…his community, and this great  country of ours. I ask my colleagues to join me in wishing him a happy  100th birthday and thanking him for a legacy of service that will long  endure.\n\nMr. Stevens, here is to many more. God bless you, and God bless  America.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699730/9999"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…lectured, and none of us should be lectured by people  who stood in the way of getting that tax code made permanent.\n\nMr. Speaker, for far too long, Americans have been forced to endure  higher costs, weaker energy security, and rising crime because of  policies pushed by the left.\n\nThe American people rejected that approach last November, and they  elected…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Army's green, and the Marines' red.  Together, they create purple, symbolizing the unity and strength of our  military families.\n\nMilitary children may not enlist, but they endure the impact of  service. Through it all, they develop strength, compassion, and  character that make them leaders in their own right.\n\nMr. Speaker, let's honor not just the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690368/recognizing-april-as-the-month-of-the-military-child"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "Mr. EVANS of Colorado. Mr. Speaker, I rise today in strong support of  this bill, H.R. 1682, the Benefits that Endure for Lifetimes Of Service  Act, or BELO'S Act, named after Marc Belo, a fellow veteran, aviation  legend, and friend with whom I had the great honor of serving.\n\nThis bill would…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691051/benefits-that-endure-for-lifetimes-of-service-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…bipartisan  support for their foreign policies. President Obama ignored Congress in  pursuing a reckless and bad nuclear deal with Iran. Unsurprisingly,  that deal did not endure.\n\nSuccessfully returning Venezuela to its role of stable, prosperous,  democratic neighbor is a noble goal, but an ambitious one. It doesn't  come without risk. And it is worth…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698662/venezuela"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…take our foot off the gas pedal.\n\nHouse Republicans will remain steadfast in maintaining a strong  relationship with Israel to continue to ensure that freedom and  democracy endure.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…and the  United States of America. His lifetime of public service, his  pioneering contributions to civil rights, and his enduring commitment  to community leadership will endure into eternity. Stan's life example  of ``service above self'' set the standard by which all should be  judged.", "date": "2025-12-05", "source_url": "https://justfacts.votesmart.org/public-statement/1697565/recognizing-mr-stanley-r-lawson-sr"}, {"senator": "John Rose", "party": "Republican", "sentence": "…bombarded with hundreds of unwanted solicitations.\n\nThe Homebuyers Privacy Protection Act would dramatically reduce the  number of unwanted calls and messages that millions endure during the  home-buying process.\n\nThe bill prohibits a consumer reporting agency from furnishing a  trigger lead to a third party unless the consumer has opted in. The  third…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692803/homebuyers-privacy-protection-act"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…has such a  tremendous and beautiful spirit, and for their family, whose support  made this remarkable career possible.\n\nAs he moves into his next chapter, his legacy will endure in the  strength of the U.S. Army and in the countless soldiers who are better  leaders and better Americans because they served alongside him and  under him.\n\nGod bless you,…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699779/9999"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…Colonel Shames  represented the very best of the Greatest Generation. Naming this post  office in his honor ensures his legacy of service, leadership, and  patriotism will endure for generations to come.\n\nMr. Speaker, I urge my colleagues to support this bill.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699640/colonel-edward-shames-post-office-building"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…relied  on his accurate stories.\n\nWherever Andrew's next chapter takes him, his integrity, compassion,  and commitment to storytelling have left a mark on our State that will  endure for years to come.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692993/boosting-americas-housing-supply"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…reach their  fullest potential earned her the respect and admiration of her peers,  and many of these professional relationships evolved into lifelong  friendships that will endure in her memory.\n\nBeyond her professional accomplishments, Krista was known for her  kindness, generosity, and deep love for all living creatures. She was  an avid animal lover,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688958/recognizing-the-life-of-krista-wynne-moore"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…timeless words: ``We . . . resolve that these  dead shall not have died in vain--that this nation, under God, shall  have a new birth of freedom . . .''\n\nMay our Nation always endure, producing patriots like the late  Charlie Kirk whose legacy reminds us that America will thrive and never  perish from the Earth.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695333/never-forget-september-11"}]