[{"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…the Department of Energy.\n\nThese funds were not wasteful. They would have been transformative,  reducing emissions for this plant by 99 percent.\n\nThat isn't just about energy policies. It is about protecting  community health, and it is about growing good-paying union jobs.\n\nYet this administration chose to cancel this project, along with  countless…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694953/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…have  jumped 10 percent this year. They are 10 percent more than they were  the year before. People can't afford to pay these utility bills.\n\nJust like SNAP cuts, Trump's energy policies harm those who are  already struggling the most. One example is his budget proposal that  calls to eliminate LIHEAP--a program that helps millions of low-income  Americans…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…strategies_cost-of-federal-mandates-to-retain-fossil- burning-power-plants.pdf\n\nHttps://energyinnovation.org/wp- content/uploads/Coal-Cost-Update.pdf\n\nMr. Speaker, we cannot win the AI race of the 21st century with  energy policies from the 20th century. Not only is it bad policy, but  it is soul crushingly expensive to do so.\n\nHardworking American families are just looking up here to Washington…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695767/national-coal-council-reestablishment-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Parliamentarian who told them they could  not move forward.\n\nSo what Republicans are now trying to do is truly unprecedented, and  it is about far more than simply California's clean energy policies.  Republicans are threatening to vote on whether or not to overrule the  Senate Parliamentarian.\n\nRepublicans are effectively saying that whenever the Parliamentarian…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…projects on Federal land.\n\nSo let us now turn to one of those onshore--or, in this case,  offshore--energy projects: Revolution Wind, just one example of the  reckless energy policies that the Trump administration has implemented.\n\nLet's be very clear. When President Trump came into office, America  was producing more energy than at any point in our…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…course of the campaign that in  the first year he would cut power bills in half. Instead, they keep  climbing.\n\nRight now, thanks to the congressional Republicans' backward energy  policies, electricity prices are climbing more than twice as fast as  inflation. More than 80 million Americans are struggling to pay their  utility bills, with many having to…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…all while the Trump administration blocks and cancels new  clean energy projects across the country.\n\nMr. Speaker, these bills basically double down on failed Republican  energy policies that have already driven up energy bills on American  families and pollution in just the 10 months since Trump took office.\n\nThe President promised to cut Americans' power…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…PALLONE. Madam Speaker, I yield myself such time as I may  consume.\n\nMadam Speaker, I rise to object to the Trump administration and  congressional Republicans' disastrous energy policies and their impacts  on everyday Americans.\n\nWe have a duty to ensure that our power grid can keep the lights on.  That demands an all-of-the-above approach to energy. Given…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…to deliver cheaper electricity are now stalled or  scrapped. The result: higher prices for working families.\n\nHouse Democrats are fighting for affordable clean energy. We believe  energy policies should make life easier, not harder.\n\nMr. Speaker, we believe the way to lower prices is to build more  clean, affordable power, not less.\n\nWe believe that no…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699895/prices-are-too-high"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…1949 today, Unlocking our Domestic LNG Potential Act.\n\nIt has been a long time coming. For 4 years, we suffered as a nation  under the Biden administration's disastrous energy policies that put  our energy security and the security of our allies at serious risk.\n\nThe White House launched a whole-of-government assault on American  energy production: slow-rolling…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697088/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…shocking to me that House Democrats will run to the news  cameras and clamor about the cost of living while they also offered  their full support for reckless anti-domestic energy policies from the  Biden administration that caused prices to skyrocket in the first  place.\n\nI mean, look at the price of gasoline at the pump 2 years ago. Look  at the price…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697085/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Speaker, we have the opportunity today to do just that. By voting  in favor of this CRA, we will be able to roll back the disastrous Biden  administration's anti-American energy policies and keep the Powder  River Basin alive. Through the CRA, we will stop future anti-American  energy administrations from taking similar steps to shut down the  Powder River…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696882/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…can reclaim its place as the world leader in energy for  generations to come.\n\nIn the waning days of the Biden administration, the EPA doubled down  on Biden's disastrous energy policies, imposing a burdensome and  harmful tax on oil and natural gas facilities called the waste  emissions charge, also like we have been discussing, the natural gas  tax or…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688184/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…present a significant opportunity  for States like Wyoming.\n\nI again thank Mr. Rulli for his sponsorship and Chairman Guthrie for  his committee leadership promoting strong energy policies.\n\nMr. Speaker, I urge all my colleagues to support this bill and to  support the coal industry.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695769/national-coal-council-reestablishment-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…committed to unleashing American energy       dominance and Alaska's extraordinary resource potential.       Unlike the short-sighted and completely failed America-Last       energy policies of the Biden Administration, President Trump       prioritizes energy independence, global energy dominance       against our adversaries, and high-paying job creation…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…New York and  California, probably are paying record prices for electricity and other  energy products. That is because of their very own States' unrealistic  and radical energy policies.\n\nI promise, in North Dakota, citizens are not paying record prices. In  fact, they are paying the lowest prices of any other State for  electricity. I know this because,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694907/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…are blessed with abundant resources. We have the  brightest minds, and we maintain the most rigorous and clean production  standards in the world. Yet, the anti-American energy policies pursued  by radical environmentalists in the previous administration crippled  communities reliant on energy jobs, weakened us on the global stage,  and enriched adversarial…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…Air Force Materiel Command at Eglin Air Force Base in Florida.\n\nThe position he is nominated for is essential to ensure our military  installations remain strong, our energy policies support mission  success, and our environmental strategies enhance, not hinder,  operational readiness and support peace through strength.\n\nI urge the Democrats to drop…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691405/motion-to-discharge-s-res-195"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…the transition to the Trump  administration.\n\nLast Congress I was proud to introduce the Alaska's Right to Produce  Act which reversed many of these same anti-American energy policies of  the Biden administration and passed the House with bipartisan support.\n\nAlaska is blessed with a tremendous wealth of natural resources. In  fact, when Alaska was…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696829/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…provisions.\n\nRepealing this misguided rule is an important first step       towards providing industry with relief from one of the       previous Administration's anti-energy policies, and we       appreciate your work to advance a pro-consumer regulatory       environment that embraces U.S. energy.\n\nWe urge Congress to pass H.J. Res. 35 to repeal the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…America.\n\nIt is time to unleash our domestic resources to put this money back  into the pockets of American families by repealing the Biden  administration's anti-American energy policies. What is more, instead  of working with the State, the Biden administration blatantly ignored  local opposition at every stage of this process and rammed this RMP  amendment…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…annual average. Since World War II, the annual average has been  a little over 3 percent.\n\nWe picked a conservative number, but we know we will outperform it  with good energy policies, work incentives, deregulation, America First  trade, and locking in low taxes from TCJA.\n\nThat 2.6 annual average, that conservative growth assumption, will  yield $2.5…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…Californians pay nearly $5 a gallon. In fact, Californians are paying  the highest gas and electricity prices in the Nation, thanks to  Governor Gavin Newsom's radical-left failed energy policies. California  has an affordability crisis that Governor Gavin Newsom created, but  this crisis also goes well beyond the pump.\n\nAs California fuel production declines,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697028/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "…administration's burdensome energy conservation  standards for commercial refrigerators and freezers.\n\nIn the final months, the previous administration prioritized their  energy policies over Americans' prosperity and freedom. This  unnecessary and costly mandate would burden small businesses, increase  red tape, and jeopardize food safety.\n\nThe Department…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689126/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}]