[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…All  of this while summers grow hotter, some winters grow colder, wildfires  rage, hurricanes intensify, and insurance markets collapse. The  President calls this energy dominance, but dominance over what? the  laws of physics? the carbon cycle?\n\nHere is what has actually happened: We are sacrificing long-term  prosperity for short-term profit. We are…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…canceled billions of dollars in investments for our State, including  the hydrogen hub that would expand research and development of hydrogen  fuel, bolster American energy dominance, and bring nearly 10,000 jobs  to the region.\n\nThey have created chaos at critical agencies that keep the lights on  like Bonneville Power Administration. Moreover, with…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697885/state-planning-for-reliability-and-affordability-act"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…$400,000 a year. For an industry with a reported  pretax profit of $83.9 billion in 2024, this has a negligible impact.\n\nThe rule does not negatively impact America's energy dominance and  independence. The U.S. is still the number one producer of oil and gas  in the world and has been since 2009. We are producing more oil than  any country ever.\n\nIn…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688635/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…energy sources, decreases our American-made domestic  energy supplies, forces us to be more reliant on foreign energy  sources, and erodes our economic competitiveness and energy dominance.\n\nIt does not have to be this way. The last time we faced an energy  crisis in the United States, it was the 1970s. Energy prices were  skyrocketing because of the 1973…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…good science to reign and create incentives  for development.\n\nDonald Trump came into office huffing and puffing because he didn't  like that. He didn't like that kind of energy dominance based on  consumer choice and marketplace forces.\n\nHe said our economic problems would go away with one thing: ``Drill,  baby, drill.'' Here is the reality. Like so much…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696128/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…future. But that future is at stake.\n\nThe Arctic Refuge is under threat from the Trump administration's  relentless attacks on public lands, attacks that put so-called energy  dominance above every other use, every other value.\n\nToday, the Senate will vote on a congressional resolution of  disapproval to overturn the management plan for the Arctic Refuge.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697413/9999"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…America has the energy needed to win  the race for AI against China and power our future.\n\nI am proud to report that the One Big Beautiful Bill Act unleashes  American energy dominance through strategic investments and eliminating  wasteful subsidies. Our bill begins to refill our dangerously low  Strategic Petroleum Reserve and creates new investments…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694788/promises-made-promises-kept"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…the Biden's EPA bait and switch on  the implementation of this misguided policy. I encourage my colleagues  to support the CRA that is central to our mission of American energy  dominance and reject this tax that will bolster our adversaries,  increase energy costs on American families, and put our energy future  at risk.\n\nI would like to yield, but before…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688160/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Alaska  Chamber, as well as by the Trump administration.\n\nRes. 80 and H.J. Res. 124.\n\nI urge my colleagues to reject unlawful regulatory overreach,  reinforce American energy dominance, uphold Federal law, and listen to  Alaska Native voices by supporting the Alaska congressional delegation  and voting for this joint resolution of disapproval and rescinding…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…position of strength and confidence. The results  speak for themselves.\n\nWe have a stronger economy, lower inflation, higher wages, lower  energy costs, a secure border, energy dominance, and economic  resurgence. We have a restoration of the American Dream and a  restoration of common sense.\n\nThere are no biological men in the private spaces of our daughters.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…cuts of  wasteful, woke, and fraud in this Federal Government. That is two times  the deepest cut to wasteful spending in the history of our country.\n\nWe can talk about energy dominance, the most significant commitment  to opening up energy resources in this country to bring down the cost  of energy prices for our families and to make American energy…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692295/stop-defending-lawlessness"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Development and  Related Agencies Appropriations Act for fiscal year 2026.\n\nThis appropriations bill funds many programs at the center of helping  to assert our country's energy dominance. The bill cuts $766.4 million,  when compared to last year's funding bill, by focusing our efforts on  energy innovation and water infrastructure.\n\nThis appropriations…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…administration, generated  $4.5 billion in State and local revenue and supported over 69,250  direct and indirect jobs.\n\nAlaska's role as a leader in unleashing American energy dominance  will continue. In the Working Families Tax Cut Act, Congress  highlighted the importance of the NPR-A and required five lease sales  to be held in the area over the next…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…worked diligently to improve grid reliability as well as the permitting  process for Federal projects, ultimately supporting President Trump's  goal of unleashing American energy dominance.\n\nUpcoming legislation that came out of the Committee will ensure that  reliability and affordability are prioritized when making decisions  about our electric grid. These…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697690/letterkenny-army-depot-plays-important-role"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…we  can best reinforce our domestic energy infrastructure and help ensure  fuel costs are low for Americans.\n\nThis bill is an important step toward delivering American energy  dominance. It is something the President has worked on and is diligent  about.\n\nIf we are going to power domestic manufacturing, if we are going to  beat China in the AI race,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697032/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…costs rise; and prices jump at the pump. The whole  region becomes dependent on foreign suppliers.\n\nMr. WEBER of Texas. Mr. Speaker, that is exactly the opposite of the  energy dominance vision that we are working toward under President  Trump.\n\nLet me tell you this, Mr. Speaker--you know this--in Texas, we know  what happens when refineries thrive. We…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697030/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…Act.\n\nAs vice chair of the Energy and Water Development and Related  Agencies Subcommittee, I am encouraged by this bill's historic  commitment to unleashing American energy dominance, while also  responsibly stewarding taxpayer dollars.\n\nWe are at a time when our Nation is at an energy crossroads.  Certainly, as we work to win the AI race against China,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698759/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…to explore for  energy right here in America have gone way up. It has been successful.  The United States has never produced more energy than we are producing  today. Energy dominance is fueling our opportunity economy. It is  making a difference in families and in their lives.\n\nAmerica is standing by our manufacturers and helping them. And, look,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699081/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…energy jobs, weakened us on the global stage,  and enriched adversarial nations that were able to cash in as we took a  back seat in the global energy market.\n\nThe road to energy dominance and meeting this growing demand runs  through North Dakota. Advancing this CRA is the first step in helping  to unleash American energy and reinvigorate America's beautiful…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Appropriations Act, 2026 is bipartisan,  bicameral, and built the right way--from the ground up, from  subcommittees up.\n\nIt strengthens our national security, restores American energy  dominance, backs law enforcement, combats illicit drugs, and supports  responsible land management, all while spending less than the current  continuing resolution.\n\nMr. Speaker,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698747/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…making things affordable in the  first place.\n\nThe National Coal Council plays a critical role in developing a  cohesive national energy strategy that will unleash American energy  dominance to lower costs for hardworking households.\n\nMr. Speaker, I urge my colleagues to support H.R. 3015, and I reserve  the balance of my time.\n\nMr. Speaker, we are absolutely…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}]