[{"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…future. But that future is at stake.\n\nThe Arctic Refuge is under threat from the Trump administration's  relentless attacks on public lands, attacks that put so-called energy  dominance above every other use, every other value.\n\nToday, the Senate will vote on a congressional resolution of  disapproval to overturn the management plan for the Arctic Refuge.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697413/9999"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…$400,000 a year. For an industry with a reported  pretax profit of $83.9 billion in 2024, this has a negligible impact.\n\nThe rule does not negatively impact America's energy dominance and  independence. The U.S. is still the number one producer of oil and gas  in the world and has been since 2009. We are producing more oil than  any country ever.\n\nIn…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688635/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…energy sources, decreases our American-made domestic  energy supplies, forces us to be more reliant on foreign energy  sources, and erodes our economic competitiveness and energy dominance.\n\nIt does not have to be this way. The last time we faced an energy  crisis in the United States, it was the 1970s. Energy prices were  skyrocketing because of the 1973…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…canceled billions of dollars in investments for our State, including  the hydrogen hub that would expand research and development of hydrogen  fuel, bolster American energy dominance, and bring nearly 10,000 jobs  to the region.\n\nThey have created chaos at critical agencies that keep the lights on  like Bonneville Power Administration. Moreover, with…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697885/state-planning-for-reliability-and-affordability-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…good science to reign and create incentives  for development.\n\nDonald Trump came into office huffing and puffing because he didn't  like that. He didn't like that kind of energy dominance based on  consumer choice and marketplace forces.\n\nHe said our economic problems would go away with one thing: ``Drill,  baby, drill.'' Here is the reality. Like so much…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696128/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…to our energy policy, and put the needs of his constituents  and all Americans first.\n\nMr. Speaker, I urge my colleagues to support this resolution to  restore American energy dominance.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694893/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…position of strength and confidence. The results  speak for themselves.\n\nWe have a stronger economy, lower inflation, higher wages, lower  energy costs, a secure border, energy dominance, and economic  resurgence. We have a restoration of the American Dream and a  restoration of common sense.\n\nThere are no biological men in the private spaces of our daughters.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…that I can  count on my colleagues to lend a helping hand.\n\nMr. Speaker, I once again ask my friends to support this legislation,  H.R. 1043, and our Nation's domestic energy dominance, and I reserve  the balance of my time.\n\nMr. Speaker, American energy is America First. My bill means more  American jobs, more American energy, and more American prosperity.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693918/la-paz-county-solar-energy-and-job-creation-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…making things affordable in the  first place.\n\nThe National Coal Council plays a critical role in developing a  cohesive national energy strategy that will unleash American energy  dominance to lower costs for hardworking households.\n\nMr. Speaker, I urge my colleagues to support H.R. 3015, and I reserve  the balance of my time.\n\nMr. Speaker, we are absolutely…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…do this if we are going to survive  this thing.\n\nUnder this House majority and administration, it is just no longer  the American way. We promised the American people energy dominance. We  had that just 6 years ago. Can you imagine? We were energy dominant. We  set the price of a barrel of oil just 6 years ago.\n\nWhat happened?\n\nThe bill before us today…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695690/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…needs these resources  responsibly developed in places like Alaska. Additionally, the area  includes incredible oil and gas resources that help to contribute to  America's energy dominance. Further, this region contains abundant  timberlands and substantial sand and gravel material resources that are  essential for roads, airstrips, and other infrastructure.…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…to meet that demand. With the rise  of data centers and AI fueling this growth, it is more important than  ever that we produce energy here at home rather than ceding energy  dominance to hostile foreign nations like China and Russia.\n\nOnce online, the project will produce 3.5 billion cubic feet of  natural gas daily and sustain more than 10,000 jobs.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…agenda so that our energy producers can unleash domestic  production, lower costs for all American consumers, and further support  our allies abroad on our pathway to energy dominance.               Honoring Our Brave Border Patrol and ICE Agents\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, I rise today to speak in  support of our brave Border Patrol and…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693885/unleashing-american-energy"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…Act.\n\nAs vice chair of the Energy and Water Development and Related  Agencies Subcommittee, I am encouraged by this bill's historic  commitment to unleashing American energy dominance, while also  responsibly stewarding taxpayer dollars.\n\nWe are at a time when our Nation is at an energy crossroads.  Certainly, as we work to win the AI race against China,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698759/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…we  can best reinforce our domestic energy infrastructure and help ensure  fuel costs are low for Americans.\n\nThis bill is an important step toward delivering American energy  dominance. It is something the President has worked on and is diligent  about.\n\nIf we are going to power domestic manufacturing, if we are going to  beat China in the AI race,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697032/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…border is  closed, and America is once again protecting our citizens.\n\nToday, our communities are safer, and the economic turnaround has  been equally dramatic. America's energy dominance is back. Gas prices  have dropped to the lowest point in 4 years. AAA reports prices are  expected to continue to fall and perhaps stay low over the busy  Thanksgiving…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…energy jobs, weakened us on the global stage,  and enriched adversarial nations that were able to cash in as we took a  back seat in the global energy market.\n\nThe road to energy dominance and meeting this growing demand runs  through North Dakota. Advancing this CRA is the first step in helping  to unleash American energy and reinvigorate America's beautiful…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…identify ways to expand  refining capacity, protect our energy infrastructure, and strengthen  our national security.\n\nMr. Speaker, we must act now to restore American energy dominance,  secure affordable fuel for families, and protect our Nation's military  defense. I urge my colleagues to support H.R. 3109.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697028/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…the American people.\n\nMr. Speaker, I urge my colleagues to support this legislation that  will enable us to enact President Trump's energy agenda and restore  American energy dominance.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688177/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…programs.\n\nWe prioritize public safety by supporting law enforcement and  stopping the flow of fentanyl into our communities. We advance American  strength by unleashing energy dominance, securing critical minerals,  and investing in nuclear power. We uphold stewardship by protecting  public lands, supporting wildland firefighters, ensuring responsible…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698749/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]