[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…countries have countless trade and investment agreements, and  cross-border projects such as communications, highways, bridges, and  pipelines  have resulted in integrated energy networks and transportation systems.  We have a longstanding defense and security partnership providing us  with greater security than we could have alone.\n\nAnd we share a…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689487/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jake Auchincloss", "party": "Democrat", "sentence": "…today to advocate against the  funding cuts to the Medicaid program that have been proposed for  consideration during the budget reconciliation process.\n\nSpecifically, the Energy and Commerce Committee, of which I am a  member, has been tasked with cutting $880 billion of Federal spending  across the healthcare programs it oversees, a vast majority…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690834/advocating-against-medicaid-cuts"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…President's speech last night, and it is  clear to me that neither he, nor the Republicans in the House, have  found a way to lower grocery prices. They haven't found a way to lower  energy prices. They haven't found a way to fund the government. Now  they are on the cusp of stripping millions of people of their  healthcare, all so they can shower these giant…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688531/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…today to remind  everyone in the United States of America that we have a cleanup  obligation at the Hanford Site in the State of Washington and to remind  the Secretary of Energy and the Trump administration of a commitment to  that part of the United States, to our Nation, and to the cleanup of  the most contaminated nuclear site in our Nation. We…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695342/hanford-site-cleanup"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…and to relinquish its nuclear arsenal was an act of profound global  importance. By ratifying the Strategic Arms Reduction Treaty (START I),  joining the International Atomic Energy Agency, acceding to the Treaty  on the Non-Proliferation of Nuclear Weapons, signing the Comprehensive  Nuclear-Test-Ban Treaty, and working with the United States through…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694763/marking-the-15th-annual-international-day-against-nuclear-tests"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…Speaker, I thank the gentleman from California for  yielding time.\n\nMr. Speaker, I rise in opposition to this bill. Critical minerals are  essential building blocks for a clean energy economy and many other  technologies central to our everyday lives. I do not dispute that, but  how we source and process these materials matters just as much as how  quickly…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699692/critical-mineral-dominance-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…especially for our most  vulnerable citizens. It is why I voted against the big, ugly bill that  is now putting healthcare coverage at risk for millions of Americans  while raising energy costs for families.\n\nIn fact, just today there is a report that came out that showed over  120,000 Ohioans chose to forgo their healthcare because they simply  couldn't afford…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699255/2025-final-priority-results-survey"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. Speaker, I rise in opposition to this bill.\n\nAfter their big, ugly bill made energy more expensive for American  families already struggling to make ends meet, Republicans are  attempting to finish the job by further continuing their nonsensical  attack on…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695754/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "Mr. McGARVEY. Mr. Speaker, I thank the chairman of the Committee on  Energy and Commerce. This is my first time to publicly congratulate him  on the House floor on assuming the chairmanship of the Energy and  Commerce Committee.\n\nWhat I can tell you…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695763/national-coal-council-reestablishment-act"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…year.\n\nThe bill also protects funding for programs important to combating  and adapting to climate change. It rejects House Republicans' effort to  gut funding for renewable energy and funds USGS climate science.\n\nFunding for the Environmental Protection Agency's environmental  justice, a top target for this administration, is included at $30  million.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698754/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…counting any day on       which the Senate is not in session, with changes that--\n\n(1) are within the jurisdiction of such committee; and\n\n(2) would preserve investments in a just energy transition       and in clean, reliable, and affordable energy buildout       through development finance investments in Africa that       maximize market opportunities for…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693615/hr-4"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…committee is so critical to the economic success of our Nation  and the safety of our communities.\n\nThis focus and interest are also what led me to choose to be a member  of the Energy and Water Development and Related Agencies Subcommittee  and the Commerce, Justice, Science, and Related Agencies Subcommittee.  I am so pleased today that a reasonable and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698753/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…H.R. 1047. It is a bill that will give  polluting gas plants an unfair and costly shortcut to the electric grid  while doing nothing to protect working families from rising energy  costs.\n\nThis is an unfortunate theme this Congress. Despite the promises of  the President and my Republican colleagues in Congress, they haven't  brought any bill that will…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695752/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…prescription drugs.  All are going up because of Donald Trump and his administration. Every  price is going up. It betrays every rural community from the benefits  of good-paying energy jobs. Republicans' supposed signature bill  betrays everyone outside of the billionaire class and the special  interests.\n\nNow, Republicans are going to spin the mother of…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693882/budget"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…Project and the DRCC properties, which include four city-owned  parcels the city is exploring for a new community campus. He is also an  avid cyclist, a hobby he pursues with energy and enthusiasm. His  collaborative approach within Snohomish County has strengthened  regional partnerships while keeping Mill Creek's unique identity  intact.\n\nMr. Speaker,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697194/recognizing-mayor-brian-holtzclaw-for-twelve-years-of-leadership-in-mill-creek"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "Mr. FONG. Mr. Speaker, I rise today in strong support of H.R. 3109,  the REFINER Act.\n\nThis legislation is critical to unleashing our energy potential,  lowering costs for hardworking families, and protecting our national  security.\n\nU.S. refineries are vital to our energy ecosystem. They convert crude  oil into…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697028/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…of  Representatives by a voice vote in the last Congress. I urge my  colleagues to support H.R.\n\nMr. LATTA. Mr. Speaker, as you can see from today's bills coming from  the Energy and Commerce Committee, cybersecurity is high on our list to  make sure we are protecting the American public. I strongly ask my  colleagues to support this legislation of…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693497/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…affectionately known as RCCTO.\n\nIn this role, he has overseen the rapid prototyping and fielding of  several key  programs, including the mid-range capability program, Army directed  energy systems, and the long-range hypersonic weapon as a first-of-its- kind capability.\n\nGeneral Rasch served in both Desert Storm and the global war on  terrorism. Over his 36 years…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695727/congratulating-lieutenant-general-robert-a-rasch-jr"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker. I wish to include in the Record the  following letters of exchange between the House Committee on Energy and  Commerce and the House Committee on Foreign Affairs with respect to  H.R. 1765, the Promoting United States Wireless Leadership Act of 2025.  By these letters, the Chairman…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693668/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "Mr. BABIN. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 1368) to provide for Department of Energy and National  Aeronautics and Space Administration research and development  coordination, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688985/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…for more government spending, more government action, and  more government bureaucracy.\n\nI would note that the other colleague who came down and talked about  high and rising energy prices, I too share some frustration about  foreign-owned energy companies and utility companies.\n\nI would remind my colleagues on the other side of the aisle that our  energy…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "John Thune", "party": "Republican", "sentence": "…considers an alternative to the Biden administration's WOTUS rule, or  waters of the United States.\n\nAnd the administration and Congress have been working to repeal anti- energy Biden regulations and unleash American energy dominance to  ensure we have an affordable and reliable energy supply for years to  come.\n\nStrong small businesses mean a strong…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690626/national-small-business-week"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Center for Hospice Care will provide 24-hour support for  patients in their final days, meeting a critical need, thanks in part  to donors, like Joan. Now nearly 82, Joan's energy, wit, and compassion  continue to inspire everyone she meets. While many her age focus on  slowing down, Joan stays energized and youthful by serving others. Her  mind is always…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690776/recognizing-joan-moore"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…from the United Arab Emirates.  This investment will support American artificial intelligence  infrastructure. It will support semiconductors made in America. It will  support energy production from America. It will support American  manufacturing.\n\nOur two nations worked closely together during President Trump's  first term to bring peace to the Middle…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688957/president-trump-bringing-back-investments"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "Mr. HARRIS of Maryland. Mr. Speaker, this week, the Energy and  Commerce Committee finally attacked fraud, waste, and abuse in the  Medicaid system.\n\nI think every American knows that when government runs a program,  there is fraud,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691335/eliminating-fraud-waste-and-abuse-in-medicaid"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…announcement from General Motors about increasing its  production in the Fort Wayne truck plant.\n\nHe has brought gas prices to their lowest point since 2021 by  unleashing American energy independence.\n\nOutside of the economic impacts that have saved money for everyday  Americans, President Trump has kept his commitment to protect American  children and families…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694059/six-months-of-america-first-leadership"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…resolution, which is a critical step needed to unlock a  reconciliation bill that is going to help secure our border and  revitalize our military. It is going to unleash American energy  independence and extend tax cuts for American families and small  businesses.\n\nSimply put, this budget delivers on all of President Trump's America  First  agenda by prioritizing…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688038/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…State. It regulates its businesses more than any State. It has the  worst litigation environment of any State. It has the most onerous  regulations on gas, electricity and energy. It has failed to build  adequate water storage in many decades, although we are, thankfully,  changing that. It places tremendous restrictions and frivolous  litigation on…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700217/prices-in-california-are-too-high"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…always in'' rule, which  was finalized in the final months of the previous administration.\n\nSimply put, the ``once in, always in'' policy hurts America's  manufacturing and energy sectors while doing nothing to actually  improve air pollution.\n\nIn 2020, the Trump administration first reversed this policy, which  encouraged businesses to lower their emissions…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691594/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…of this very important legislation.\n\nThe United States is already the world's leading producer of oil and  natural gas and also the top exporter of LNG. A whole lot of that  energy comes straight out of my district in the great State of Texas.\n\nThat is why it is long past time that we repeal the harmful,  politically motivated Biden-era restrictions that…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697084/unlocking-our-domestic-lng-potential-act-of-2025"}]