[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Be honest. Put these price increases into the bill.  Tell the American people what you really stand for, because when  Americans wonder why their grocery bills and their energy bills and all  their other bills go up, they deserve to know why, and they deserve to  know who caused it.\n\nAnd then we will see who is really on the side of the working class.…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689475/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…extract gas and coal from our public  lands.\n\nIt attacks our federal investments in clean energy, which will cost  over 790,000 jobs over the next decade and raise household energy  bills, all while adding to air pollution and worsening our climate  crisis.\n\nAnd even after all that, it will add $4 trillion dollars to the  national debt with interest costs…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693153/one-big-beautiful-bill-act"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…big, ugly bill undermines the programs millions of Americans rely  on to survive, like healthcare and food assistance. Perhaps less  discussed is that it will increase your energy bills.\n\nRight now, 80 million Americans are struggling to pay their  electricity bills, and according to a recent report in The New York  Times, this bill will make it worse.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691967/big-ugly-bill-clean-energy-tax-credits"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…for water heaters. Energy efficiency  standards are popular, and it is a commonsense tool and, again, the  fastest way to save taxpayers and American people money on their energy  bills.\n\nThis resolution targets these standards, not realizing that these  standards will save consumers $3.1 billion and are good for the  environment because they cut 32 million…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688290/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…energy and made electricity more expensive for everyone. They  have tried to kill every wind or solar project on Federal lands and in  Federal waters, driving up people's energy bills even further. Now,  they are trying to put another thumb on the scale in favor of dirty  fossil energy by pushing a bill with a fake definition of ``reliable  generation.''…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…state  of Connecticut, were ready to begin an ambitious and collaborative  effort to increase energy transmission capacity across our region, to  build resiliency and lower energy bills.\n\nNearly $400 million was going to be invested through the Department  of Energy's Grid Innovation Program to provide onshore connections for  offshore wind power, improve…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694862/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…electric bill. Already,  this year, household electricity prices are up 10 percent. One in three  households is cutting back on necessities, like groceries, to afford  their energy bills.\n\nThree in four Americans are concerned with their utility bills  increasing, and they should be because at least 102 gas and electric  utilities have either raised or proposed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695692/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…does is hand out tax breaks  to billionaires while making it harder for working people to get by.\n\nAs we know, the bill canceled tax credits designed to lower people's  energy bills, transform our Nation's clean energy economy, and create  thousands of good-paying union jobs.\n\nThe administration called these investments wasteful spending. I am  here…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695602/devastating-harm-caused-by-trump-administration"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the United States unable to meet growing power demand or to  compete with China.\n\nAll this doesn't factor in the enormous toll that Trump's tariffs  will take on America's energy bills. A recent analysis found that  Trump's tariffs will cost your average American family $2,300 each  year. That is $2,300 that families need to pay rent, to buy groceries,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…million new jobs in just 2 years. The  Federal Government set standards that will save money.\n\nMr. Speaker, I conclude by saying that Americans will save $1  trillion on their energy bills over the next 30 years under the  previous policies. That is $1 trillion. We will continue to fight for  commonsense policies for everyday people, and that is why I oppose…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689261/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…today.\n\nAcross central New York and the Mohawk Valley, people are worried,  and they have every reason to be. Grocery prices are going up.  Healthcare costs are rising. Energy bills are spiking. Too many  families feel like they are being asked to absorb the hit while  Washington does nothing to make their lives better or more affordable.\n\nOn healthcare,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699587/stop-the-republican-affordability-crisis"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…paid more than 13 percent for  their electricity bills compared to the previous year. The big reason  is that the big, ugly bill added about $250 billion to Americans'  energy bills by picking energy favorites and slowing down new  technology, so energy prices continue to rise for Americans.\n\nSomething the President said is that the data centers will…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700227/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…our veterans, all so  Republicans can give tax breaks to their billionaire buddies.\n\nMr. Speaker, H.J. Res. 35 is just another giveaway that saddles  Americans with higher energy bills, plain and simple, all to help  Republicans' corporate polluter friends. What is more, repealing the  Environmental Protection Agency's methane polluter fee slashes revenue…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Canada. In retaliation, Ontario imposed a twenty-five  percent surcharge on electricity exported to Minnesota, Michigan, and  New York. This will directly impact Minnesotans' energy bills.  Minnesotans and consumers across this country will feel the impact of  Trump's tariffs at the grocery stores when they buy products like pork,  produce, or eggs.\n\nWith…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688917/impact-of-president-trumps-disasterous-tariffs-on-canada"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "Mr. RUIZ. Mr. Speaker, I rise today on behalf of the residents of  California's 25th Congressional District against H.R. 1949, which would  increase their energy bills.\n\nThe desert communities I serve are already bearing the brunt of high  energy bills and underinvestment in infrastructure. They simply cannot  afford this bill.\n\nUnder…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697083/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…won't stop the use of all natural gas. It will  simply stop the use of American natural gas. This tax will make it  harder for hardworking Americans to pay for their soaring energy bills  and force us to utilize more natural gas and energy produced by foreign  adversarial nations  who have far inferior environmental and labor standards.\n\nA natural gas tax…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688187/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…46 years to see efficiency benefits, even though  household appliances are replaced every 8 to 9 years on average.\n\nAmericans are already paying 34 percent more for their energy bills  than they were in 2010. Households simply cannot afford more expensive  mandates coming out of Washington.\n\nAt a time when Americans are struggling to pay their bills because…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700166/dont-mess-with-my-home-appliances-act"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…the highest levels in history, and inflation reached the  highest levels in decades.\n\nDue to this, nearly a third of Americans were forced to choose  between paying their energy bills or for their groceries.\n\nMr. Speaker, America is and will continue to be a beacon for free  enterprise, innovation, and competition. I applaud President Trump for  his pledge…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688641/deregulation-empowers-free-enterprise"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…American people.  Look at the numbers.\n\nThe costs associated with IRA programs this bill seeks to repeal  significantly add to the price of new homes and lead to higher energy  bills for the American people.\n\nAccording to the Federal Reserve, median home prices have skyrocketed  over the past decade, with the largest increase from 2020 to 2022,  which…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700222/homeowner-energy-freedom-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…more of it.\n\nNo one unable to work will lose their Medicaid benefits. Their  neighborhoods will be safer as criminal illegals are deported and not  allowed to return. Their energy bills will be lower.\n\nIf all this relief creates just average economic growth, the deficit  will begin to shrink, which brings us back to the simple question that  we will put…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693629/democrats-big-mistake"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…the middle of an electric  reliability crisis that is threatening the integrity of our bulk power  systems and an affordability crisis that burdens households with higher  energy bills.\n\nUnfortunately, 4 years of the Biden-Harris administration and  excessive litigation, permitting delays, and far-left regulatory  decisions to attack baseload power sources…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…dedicated service to our country.               Energy and Commerce Committee Working Diligently\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, I rise today to highlight the  great energy bills that will come to the House floor later this week.\n\nThis Congress, Republicans on the Energy and Commerce Committee have  worked diligently to improve grid reliability as…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697690/letterkenny-army-depot-plays-important-role"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…California,  New York, New Jersey, Massachusetts, Connecticut. That is where energy  costs have gone up the most. That is where people are struggling the  most to pay their energy bills.\n\nMr. Speaker, I would like to speak in support of H.R. 3617,  introduced by the gentleman from Michigan (Mr. James), my friend and  colleague. If the United States hasn't…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699994/securing-americas-critical-minerals-supply-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…grid, delivers reliable, affordable power that  families and businesses can count on, and creates jobs in the process.  That is exactly what this rule is about.\n\nThe three energy bills before us are straightforward. They support  family-sustaining energy jobs. They streamline approvals for cross- border infrastructure and ensure reliable and dispatchable…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}]