[{"senator": "Scott Peters", "party": "Democrat", "sentence": "…remotely operated  aircraft, and electromagnetic systems.\n\nFusion energy will provide a source of virtually limitless baseload  power and a clean and safe pathway for true energy security. It is no  wonder countries across the globe are racing to achieve fusion first,  and San Diego is leading the way with the leadership of companies like  General Atomics…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694165/recognizing-general-atomics"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…strengthen our defense relations with  Taiwan, expanding DOD's annual readiness assessments, even Republican- led amendments to invite Taiwan into RIMPAC and bolster its energy  security. These are the kinds of amendments that are aligned with the  United States' interests. These are the kinds of amendments that foster  deterrence, not instigate and facilitate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695235/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…modernization  and bring an end to Trump's manufactured energy crisis. This is a  chance for the Senate to use innovation to fight for lower prices, more  jobs, and greater energy security, while Donald Trump stands in  contrast trying to undermine all that.\n\nI urge my colleagues, when we vote, to strongly support Senator  Kaine's resolution.", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696128/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…to 2023. Democrats  tried to right the ship by passing the Inflation Reduction Act, which  made a nearly $250 billion downpayment on our national debt while  improving energy security, lowering prescription drug costs, and  creating a more equitable tax code.\n\nThis was the first legitimate effort to reduce the deficit since the  Budget Control Act passed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695675/cloture-motion"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…the Republicans' big, ugly bill says to pack it up and go  home.\n\nI won't stand for that, and neither should anyone who claims to care  about jobs, economic growth, or energy security.", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692414/rescissions-package-corporation-for-public-broadcasting"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…technology.\n\nChina, under Xi, has long positioned EVs as a technological       priority, while in Washington, concerns have grown among       officials and lawmakers about energy security.\n\nCATL is now responsible for making more than one-third of       the EV batteries on the global market, including those inside       made-in-China Teslas.\n\nCATL and BYD's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…energy wasted, being dumped into the lake. We  have to capture it.\n\nBy investing in geothermal technology, communities across our country  and the world can strengthen energy security; reduce reliance on dirty  fuels; create good-paying jobs in engineering, drilling, and  maintenance; and lower energy costs for industry, public facilities,  neighborhoods,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…democracies of  the world. That alliance is our insurance in war. America must not be  sucked down into unstable situations.\n\nThe lingering challenge of our own future energy security here at  home is real. The solution demands the brilliance of invention inside  our own borders, and we must never tie our future to imports or foreign  crude.\n\nThe good…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…the National Science Foundation, she has  seen labs at Scripps shut down and watched her coworkers lose their  jobs.\n\nAnother scientist whose research focuses on ensuring energy security  has felt the consequences of this administration's policy. She has had  her research censored by an administration that is indifferent to and  may be hostile to scientific…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695749/funding-cuts-to-science"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…back Biden-era rules targeting coal-fired power plants, and  restored commonsense permitting.\n\nCoal remains critical for grid reliability, baseload power, and  national energy security. I am proud to fight side by side with  President Trump to ensure that our miners can go back to work, our  lights can stay on, and our energy stays American so that we…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…country. Without repeal, the  RMP amendment will end coal production in the region entirely by 2041  and close 12 active mines.\n\nThe RMP amendment is a death blow to America's energy security,  Wyoming's workers, and the economic backbone of the State itself.\n\nIt is projected that U.S. electricity demand will grow by as much as  128 gigawatts through 2029,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…rules and regulations of the Biden  administration.\n\nThe Unlocking Our Domestic LNG Potential Act stands as a pivotal  piece of legislation poised to bolster United States energy security,  foster economic growth, and promote environmental sustainability. At  its very core, the bill aims to streamline the regulatory process  surrounding the exportation…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697086/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…America's national security through energy resources,       and it is an asset to the State of Alaska. Responsible       development in the NPR-A supports our nation's energy       security, well-paying jobs and economic benefits for local       Alaska Native communities and the state as a whole. The 2022       BLM ROD improperly limits future oil and…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…democracy. Our  collaboration continues to play a vital role in addressing global  challenges--from counterterrorism and defense cooperation to  humanitarian efforts and energy security.\n\nOur bilateral economic relationship is also significant and growing.  Trade between the United States and Turkiye reached nearly $33 billion  in 2024, underscoring the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696871/recognizing-the-102nd-anniversary-of-the-founding-of-the-republic-of-turkiye"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…States, hostile policies are pushing refineries out so  fast that families are now facing higher prices and increased  dependence on foreign fuel.\n\nThat is not how you build energy security, Mr. Speaker. That is how  you weaken it.\n\nMeanwhile, global demand for fuels is still rising and is expected to  grow as much as 20 million barrels a day by 2050.\n\nThe…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697030/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…area. They have directed the  Department of the Interior to ``conduct an expeditious program of  competitive leasing of oil and gas in the Reserve'' to help boost our  energy security.\n\nWhat I just shared there is a word-for-word requirement from existing  Federal law, so this is what is in law: ``to conduct an expeditious  program of competitive leasing…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "John Thune", "party": "Republican", "sentence": "…groundwork for making the tax cuts we passed during the first Trump  administration permanent as well as delivering a transformational  investment in our border, national, and energy security.\n\nOf course, we are currently working to overturn burdensome Biden  administration regulations using the Congressional Review Act.\n\nThis week, we are taking up two rules…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688403/joint-session-of-congress"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…reality is undeniable. The U.S. Geological Survey estimates the coastal  plain contains 10.4 billion barrels of recoverable oil, a resource that  can strengthen America's energy security at a time when geopolitical  instability is rising and global energy demand is surging.\n\nPresident Trump recognized this on day one, issuing executive order  14153, Unleashing…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696831/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…Administration, prioritizing the continued modernization of the nuclear  weapons stockpile and the United States Navy nuclear fleet.\n\nThe bill strengthens our Nation's energy security by advancing  American leadership in deploying new nuclear technologies and  supporting the administration's efforts to make full use of our  Nation's vast fossil fuel…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698750/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…I am proud to represent parts of the Utica and Marcellus shale  formations, where natural gas development has transformed local  economies and strengthened our Nation's energy security. Boosting  natural gas production in Ohio and expanding LNG exports are essential  to our vision of energy dominance.\n\nUnder the last administration, President Biden repeatedly…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697093/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…clear.  Requiring a statutory presumption in favor of exports are in the public  interest.\n\nPlus, the vast majority of studies show that not only do LNG exports  boost our energy security but they also help maintain low domestic  natural gas prices for Americans.\n\nThe Biden-Harris administration's action not only jeopardized our  European allies but it…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697089/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…Trump's vision to  unleash American energy by removing regulatory barriers and  prioritizing domestic production. This resolution ensures our lands are  used to bolster energy security and not obstruct it.\n\nBy passing H.J. Res. 104, we reject bureaucratic overreach and  champion affordable and reliable energy for all Americans. Let's stand  with President…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694890/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…we can build the  pipelines that keep energy affordable, so we can build the pipelines  that power our economy, and so can build the pipelines that strengthen  America's energy security.\n\nMr. Speaker, did I mention that we can build the pipelines that keep  energy available and affordable for Americans?\n\nMr. Speaker, I urge my colleagues to support this…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698057/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…unleash billions of dollars' worth of oil, natural  gas, and critical minerals that are critical not only to Alaska's  economy and security but also to the economic and energy security of  the United States and will extend further to our allies around the  world.\n\nThis is a very important issue. This CRA shifts land management back  to Alaskans and away…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}]