[{"senator": "Doug Jones", "party": "Democrat", "sentence": "\"Our energy producers are facing an unprecedented challenge that will have long-term ramifications for our energy independence and our energy future."}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "Energy producers want the price to be high."}, {"senator": "George Latimer", "party": "Democrat", "sentence": "When will we be asking clean energy producers how the government can  make it easier to bring renewables online and reduce greenhouse gases?"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "The Tenth Circuit ruling found that the EPA had abused the use of small refinery hardship waivers under the RFS, eliminating demand for billions of gallons of demand for renewable fuels and hurting rural communities, farmers, clean energy producers, and agribusinesses."}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "I urge my  colleagues to stand with responsible energy producers and American  consumers to reject efforts that repeal this vital provision."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "Senator, moving the state's application for regulatory primacy forward at the Environmental Protection Agency (EPA) and successfully pressing for its approval.\"Our efforts to advance the development of commercially-viable carbon capture technologies benefit both traditional energy producers and renewable energy, giving companies like Red Trail Energy access to new markets by leveraging their work to capture and store CO2,\" said Hoeven."}, {"senator": "August Pfluger", "party": "Republican", "sentence": "As part of his war on energy, former President Biden took radical  steps to end fossil fuels during his administration, which hurt the  hardworking energy producers not only in my district in the Permian  Basin in Midland and Odessa but also across America."}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "45Q is meant to incentivize investment in carbon sequestration technology, but North Dakota's coal, ethanol, and energy producers have been waiting for this direction so they can invest with confidence."}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "These actions substantially shook energy producers, impacting their bottom line more than two weeks before March 22."}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "This is leading to hundreds of layoffs for workers and significant, long-term damage to American energy producers."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "These agreements provide North Dakota agriculture and energy producers with much-needed access to valuable foreign markets, including our two biggest trading partners, and we continue to be encouraged by the progress being made with Japan and the EU."}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "\"Saudi Arabia and Russia's continued dumping of crude is having lasting and damaging effects on American energy producers."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "Our energy producers operate under the  highest environmental standards in the world."}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "35, legislation I proudly cosponsored to stand up for North  Dakota's energy producers and hardworking families who depend on  affordable, reliable energy."}, {"senator": "James M. Inhofe", "party": "Republican", "sentence": "\"Saudi Arabia and Russia's continued dumping of crude is having lasting and damaging effects on American energy producers."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "Ending this global price war is a critical part of our efforts during the pandemic to support our domestic energy producers in North Dakota, and across the nation, who are vital to our economic and national security.\"\n\nHoeven has been working to stop the global oil price war."}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "\"Saudi Arabia and Russia's continued dumping of crude is having lasting and damaging effects on American energy producers."}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "Ted Cruz (R-Texas) today issued the following statement in support of granting American refineries relief during these three unprecedented crises: the public health crisis caused by the coronavirus pandemic, and the subsequent economic and energy crises, which have been especially devastating for energy producers and blue collar workers in Texas."}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "In Wyoming, we have seen firsthand how State-chartered banks serve  the specific needs of ranchers, energy producers, and Main Street that  might otherwise have been overlooked by larger institutions."}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "31, a  resolution that pushes back on yet another outrageous overreach by the  Biden-Harris EPA which spent the last 4 years tying the hands of  America's energy producers and undermining our position as a global  energy leader."}]