[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…didn't hear anybody  mention that. Republicans have really lost the plot, and I think  Americans are taking notice.\n\nMr. PALLONE.  Castor), the ranking member of our Energy  Subcommittee.\n\nMr. Speaker, I think it is important to clarify some of the numbers  that we are hearing from the Republicans. The chairman keeps mentioning  a 94-year payback period…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689127/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…issue, and I reserve the balance of  my time.\n\nMr. PALLONE.  Castor), who is the Democratic sponsor of the bill and who  is also the ranking member of our committee's Energy Subcommittee.\n\nMr. PALLONE. Mr. Speaker, I urge bipartisan support for this  legislation. It is another consumer protection bill, like the TICKET  Act, that provides transparency…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690199/hotel-fees-transparency-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…opposition to all three bills, including  the one we are debating right now, and I reserve the balance of my  time.\n\nMr. PALLONE.  Castor), the ranking member of our Energy  Subcommittee.\n\nMr. PALLONE.  McClellan), who is a member of the  committee.\n\nMr. Speaker, I want to comment on what the gentleman from Georgia  said. I know he is not here. I don't…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…reduce  prices.\n\nMr. Speaker, I encourage my colleagues to vote ``no,'' and I reserve  the balance of my time.\n\nMr. PALLONE.  Castor), who is the ranking member of the Energy  Subcommittee.\n\nMr. PALLONE. Mr. Speaker, may I inquire as to how much time is  remaining.\n\nMr. PALLONE.  Elfreth).\n\nMr. PALLONE. Mr. Speaker, I will mention to my colleagues on the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…bill does none of that. It simply gives a fast pass to Big Oil  and Gas, and I urge my colleagues to oppose the bill.\n\nMr. PALLONE.  Castor), the ranking member of our Energy  Subcommittee.\n\nMr. Speaker, the Energy and Commerce Committee has jurisdiction over  a number of issues, including energy, but we also have jurisdiction  over the FCC. Beyond that,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695754/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…dangerous, and deeply irresponsible.  Congress should be trying to protect Americans, not trying to make them  sick.\n\nMr. PALLONE.  Castor), the ranking member of the Energy Subcommittee.\n\nMr. PALLONE.  Schrier).\n\nMr. PALLONE.  Matsui), the ranking member of our Communications and  Technology Subcommittee.\n\nMr. Speaker, I would like to talk about the…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691591/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the door by allowing FERC, which has  no expertise in these areas, to just say ``no,'' and FERC doesn't even  want to do it. They told us.\n\nAs the ranking member of the Energy Subcommittee, Ms. Castor, said-- they literally told us at the committee--that they didn't want to do  this and didn't have the capacity to do it.\n\nWe have made so much progress…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Americans money.\n\nMr. Speaker, I urge my colleagues to vote against this bill, and I  reserve the balance of my time.\n\nMr. PALLONE.  Castor), the ranking member of our Energy  Subcommittee.\n\nMr. Speaker, I will say, first of all, that energy conservation  standards are not bans. We have to keep repeating this over and over  because Republicans are adamant…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700165/dont-mess-with-my-home-appliances-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…that is unfair. What they should be doing is speeding the cleaner,  cheaper resources to the grid, giving them a fair shot to do it.\n\nWe had a committee meeting in the Energy Subcommittee this week, and  we had the acting general counsel from the Department of Energy appear  before us. Just to show you the fast-pass that polluters and gas  companies are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695752/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…confusion that it accomplishes  exactly what we should be trying to avoid, and that is increased costs  and delays.\n\nMr. PALLONE.  Castor), the ranking member of our Energy  Subcommittee.\n\nMr. Speaker, as I said before, but I think it bears repeating,  Republicans have cited about $200,000 in costs for manufacturers  associated with this rule that they…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688549/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…oil  was lifted 10 years ago. You don't need a refinery if you can export  the crude, but this report doesn't address that at all.\n\nCastor), the ranking member of our Energy  Subcommittee.\n\nMr. PALLONE. Mr. Speaker, listening to my colleagues on the  Republican side of the aisle, this report obviously does absolutely  nothing to address the prices of…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…something  else.\n\nMr. PALLONE. Mr. Speaker, once again, I yield such time as she may  consume to the gentlewoman from Florida (Ms. Castor), who is our  ranking member of the Energy Subcommittee.\n\nMr. PALLONE.  Matsui), who is the ranking member of  our Subcommittee on Communications and Technology.\n\nMr. Speaker, I have heard my colleagues on the other side…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695765/national-coal-council-reestablishment-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…claims, but hopefully you  get the point that this fictitious figure is just meant to mislead the  public about energy building costs.\n\nCastor), the ranking member of our Energy  Subcommittee.\n\nMr. PALLONE. Mr. Chairman, I yield such time as he may consume to the  gentleman from Maryland (Mr. Hoyer).\n\nMr. PALLONE.  DeLauro), the ranking member of the  Committee…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700221/homeowner-energy-freedom-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…American families.\n\nMr. Speaker, I urge my colleagues to vote ``no'' on this bill, and I  reserve the balance of my time.\n\nMr. PALLONE.  Castor), the ranking member of our Energy Subcommittee.\n\nMr. PALLONE.  Frankel).\n\nMs. LOIS FRANKEL of Florida. Mr. Speaker, my, my, my. I rise today,  amazed that with the healthcare crisis unfolding, the Republican  priority…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…balance of my time.\n\nMr. GUTHRIE. Mr. Chairman, I yield 4 minutes to the gentleman from  Ohio (Mr. Latta), the sponsor of this bill and the distinguished  chairman of the Energy Subcommittee.\n\nMr. GUTHRIE. Mr. Chair, I yield 2 minutes to the gentleman from Texas  (Mr. Weber), the vice chairman of the Energy Subcommittee of the  Committee on Energy and Commerce.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…beginning, that I am willing to work  with the Senator from Florida. In fact, I have offered to place it on  the agenda for the next subcommittee hearing within the Energy  Subcommittee of the Energy and Natural Resources Committee. That would  provide the Trump administration with the opportunity to weigh in with  its views and allow us to hear analysis…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698296/9999"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Commerce the  information we need to enact policies to deliver affordable, reliable,  and clean energy to all Americans.\n\nI thank Representative Latta, the chairman of the Energy  Subcommittee, for his leadership on this issue.\n\nI urge all of my colleagues to support H.R. 3109, and I reserve the  balance of my time.\n\nWhen I was a young man in the 1970s--when…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…is going to  bring the cost up between $450 to $665 per unit.\n\nI think it is also important to note that, in the last Congress, in  the Energy and Commerce Committee's Energy Subcommittee, I asked  everybody who came before us the same question when we had these  testimonies: Do we have to have more energy in this country or less?  Everybody said the…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688289/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…just recently  meeting with friends from Japan and Korea they want the natural gas  that we have in our great State of Alaska. This is important.\n\nThe chairman of the Energy Subcommittee is a leader on this issue and  has fought for reliable and sustainable energy.\n\nMr. GUTHRIE. Mr. Speaker, there are still protections in place so the  President can…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697089/unlocking-our-domestic-lng-potential-act-of-2025"}]