[{"senator": "Scott Peters", "party": "Democrat", "sentence": "…remotely operated  aircraft, and electromagnetic systems.\n\nFusion energy will provide a source of virtually limitless baseload  power and a clean and safe pathway for true energy security. It is no  wonder countries across the globe are racing to achieve fusion first,  and San Diego is leading the way with the leadership of companies like  General Atomics…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694165/recognizing-general-atomics"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…strengthen our defense relations with  Taiwan, expanding DOD's annual readiness assessments, even Republican- led amendments to invite Taiwan into RIMPAC and bolster its energy  security. These are the kinds of amendments that are aligned with the  United States' interests. These are the kinds of amendments that foster  deterrence, not instigate and facilitate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695235/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…their family farms afloat  through droughts, floods, and commodity swings. Veterans and skilled  tradespeople are building the advanced technologies that strengthen our  energy security and reduce our dependence on volatile fuel markets.  This is an American project, happening in every region across every  map.\n\nThe choice before us is simple: Do we want…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700230/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…to 2023. Democrats  tried to right the ship by passing the Inflation Reduction Act, which  made a nearly $250 billion downpayment on our national debt while  improving energy security, lowering prescription drug costs, and  creating a more equitable tax code.\n\nThis was the first legitimate effort to reduce the deficit since the  Budget Control Act passed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695675/cloture-motion"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…the National Science Foundation, she has  seen labs at Scripps shut down and watched her coworkers lose their  jobs.\n\nAnother scientist whose research focuses on ensuring energy security  has felt the consequences of this administration's policy. She has had  her research censored by an administration that is indifferent to and  may be hostile to scientific…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695749/funding-cuts-to-science"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…democracies of  the world. That alliance is our insurance in war. America must not be  sucked down into unstable situations.\n\nThe lingering challenge of our own future energy security here at  home is real. The solution demands the brilliance of invention inside  our own borders, and we must never tie our future to imports or foreign  crude.\n\nThe good…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…the Republicans' big, ugly bill says to pack it up and go  home.\n\nI won't stand for that, and neither should anyone who claims to care  about jobs, economic growth, or energy security.", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692414/rescissions-package-corporation-for-public-broadcasting"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…energy wasted, being dumped into the lake. We  have to capture it.\n\nBy investing in geothermal technology, communities across our country  and the world can strengthen energy security; reduce reliance on dirty  fuels; create good-paying jobs in engineering, drilling, and  maintenance; and lower energy costs for industry, public facilities,  neighborhoods,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…technology.\n\nChina, under Xi, has long positioned EVs as a technological       priority, while in Washington, concerns have grown among       officials and lawmakers about energy security.\n\nCATL is now responsible for making more than one-third of       the EV batteries on the global market, including those inside       made-in-China Teslas.\n\nCATL and BYD's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…modernization  and bring an end to Trump's manufactured energy crisis. This is a  chance for the Senate to use innovation to fight for lower prices, more  jobs, and greater energy security, while Donald Trump stands in  contrast trying to undermine all that.\n\nI urge my colleagues, when we vote, to strongly support Senator  Kaine's resolution.", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696128/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…back Biden-era rules targeting coal-fired power plants, and  restored commonsense permitting.\n\nCoal remains critical for grid reliability, baseload power, and  national energy security. I am proud to fight side by side with  President Trump to ensure that our miners can go back to work, our  lights can stay on, and our energy stays American so that we…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…restrictions that have shackled and  locked down our LNG industry. These restrictions did nothing but  threaten American jobs, drive away investment, and undermine the energy  security of our own allies and friends.\n\nH.R. 1949, led by my friend Representative August Pfluger from Texas,  fixes this. It lifts restrictions on the import and export of natural…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697084/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…we can build the  pipelines that keep energy affordable, so we can build the pipelines  that power our economy, and so can build the pipelines that strengthen  America's energy security.\n\nMr. Speaker, did I mention that we can build the pipelines that keep  energy available and affordable for Americans?\n\nMr. Speaker, I urge my colleagues to support this…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698057/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…dedication to fiscal conservatism. However, with all due respect to  my colleague, this amendment undermines the full bill's central aim to  promote national security, energy security, and economic prosperity.\n\nReducing this bill by $37 billion, or by 65 percent, will make  America less safe, less secure, and less prosperous, in my view.\n\nThe amendment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694951/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…strong support of H.J. Res.  35, which repeals the Biden administration's natural gas tax, a  misguided policy that drives up costs, stifles investment, and weakens  our energy security. This so-called waste emissions charge won't reduce  methane emissions, but it will punish American producers, increase  reliance on foreign energy, and make life more…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688188/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…our hand abroad by ensuring our allies that they can  rely on American energy instead of their adversaries'. Most  importantly, it reinforces a simple truth: Energy security is national  security.\n\nIn southeast Texas, we understand that better than anybody. We  produce it. We refine it. We ship it. We keep America moving every  single day.\n\nH.R. 1949…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697091/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…I am proud to represent parts of the Utica and Marcellus shale  formations, where natural gas development has transformed local  economies and strengthened our Nation's energy security. Boosting  natural gas production in Ohio and expanding LNG exports are essential  to our vision of energy dominance.\n\nUnder the last administration, President Biden repeatedly…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697093/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…can power our economy; we can win  the energy race; we can win the AI, artificial intelligence, race  against communist China.\n\nMore energy secures our Nation. Energy security is national security.  Republicans understand it. President Trump understands it. That is why  he is going to do what he is doing this afternoon at the White House,  and I am delighted…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689762/coal"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "Mr. GOSAR. Mr. Chairman, I yield myself such time as I may consume.\n\nMr. Chairman, energy security is national security. As the 119th  Congress works to protect and strengthen America's energy backbone, we  have a responsibility to ensure our decisions are informed,  transparent,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697892/electric-supply-chain-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…variables--the Inflation Reduction  Act to actually repeal the ridiculous subsidizing, enriching the  Chinese and enriching billion-dollar corporations, and undermining our  energy security.\n\nDo we have the resources necessary to secure the border and the fees  to pay for it? Are we putting in the provisions that we ought to be  putting in there to guarantee…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…and national security of these United States of America.\n\nWhen the Department of Energy was organized in 1977, Mr. Speaker, the  American people were suffering from the energy security fallout of  OPEC's oil embargoes. You may remember prices went up, gas lines  formed, and our Nation's economy was threatened because adversarial  nations took advantage…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699990/securing-americas-critical-minerals-supply-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…with the aftermath of the oil  embargoes that led to mile-long gas lines and fuel rationing. The  initial establishment of energy efficiency regulations was a matter of  energy security.\n\nBy reducing consumption through the use of innovative technologies,  we can insulate families from the harm caused by adversarial nations  restricting access to critical…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700166/dont-mess-with-my-home-appliances-act"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…Trump's vision to  unleash American energy by removing regulatory barriers and  prioritizing domestic production. This resolution ensures our lands are  used to bolster energy security and not obstruct it.\n\nBy passing H.J. Res. 104, we reject bureaucratic overreach and  champion affordable and reliable energy for all Americans. Let's stand  with President…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694890/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…want to change that through  permitting reform. My legislation begins to address that and is a step  in the right direction.\n\nThis bill is about strengthening American energy security, protecting  good-paying jobs, and restoring common sense to a process bogged down  by bureaucratic delays and partisan politics.\n\nFor far too long, energy developers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695691/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…that inflates administrative  burdens. In fact, this resolution could boost Federal revenues by  speeding up leasing and production timelines that are critical to U.S.  energy security.\n\nOffshore oil and gas from the Outer Continental Shelf accounts for 15  percent of U.S. production, supporting jobs, powering homes, fueling  transportation, paying for…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688630/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}]