[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…commonsense measures. First, Federal immigration agents need  to remove their masks, turn on their body cameras, and wear visible,  clear identification. I have met with law enforcement officials--people  who have given their lives to it, career people--and asked them: Why do  you need to be masked? Why do you need to have secret police in the  United States…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699485/department-of-homeland-security"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…deserve better  than this--and we should honor them for their heroic efforts that day,  not excuse the thugs who attacked this body and the ideals it  represents.\n\nLaw enforcement officials should not fear for their safety or that of  their families just for simply doing their jobs.\n\nI hope that all of us, regardless of our political persuasion, can  agree…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688828/january-6-pardons"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "Mr. WYDEN. Mr. President, child sexual abuse materials are a toxic  plague on the internet. Congress should act as soon as possible to give  law enforcement officials the resources they need to find and prosecute  criminals responsible for exploiting children and spreading vile abuse  materials online. In addition, Congress should…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692908/stop-csam-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…``Whereas,  California's leadership has prioritized protecting illegal immigrants  and violent individuals over U.S. citizens.''\n\nThat is just defamation of the law enforcement officials in  California. It is defamation against the Governor of California, the  mayor of Los Angeles, the sheriff in Los Angeles County, the chief of  police in L.A., all…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…incorrect. The statute is  clear. Secondly, there is no evidence, not a shred of evidence, that  has been shared with Members of Congress, the public, the IG, or other  law enforcement officials.\n\nMy colleagues across the aisle keep claiming that the Administrator,  along with DOGE, identified a case wherein an illegal alien--we will  get to my thoughts on…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…seized. That is the power of an effective partnership.\n\nNow that his term as our United States Attorney has ended, I join  Governor Moore, former Governor Hogan, and law enforcement officials  across our state in thanking Mr. Erek Lawrence Barron for his tireless  efforts to make our streets safer and our communities more secure. I  congratulate him on his…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688210/recognizing-a-trailblazing-career-in-criminal-justice-us-attorney-erek-lawrence-barron"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…of the U.S.  Attorney's Office rather than succumb to a politically motivated firing  of a long-time, dedicated prosecutor.\n\nIn two instances, the chief Federal law enforcement officials in  Virginia, installed in their positions by the Trump administration,  were forced to leave because they wouldn't agree to bend the knee and  genuflect to a politically…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696334/trump-administration"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…were able to apprehend him and prevent  him from carrying out that attack.\n\nI am grateful to the Department of Justice, including the FBI, and  our State and local law enforcement officials who prevented this attack  from happening. But the fact that the perpetrator is here in the United  States in the first place underscores yet again the failure to vet…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…In the Homeland Security Committee and on my Subcommittee on  Counterterrorism and Intelligence, we have heard from a wide array of  national security experts and law enforcement officials who have  continuously raised alarms about the CCP's increasing subversive  activities inside our country through organizations like the CCP's  Confucius Institutes,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690828/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…had any role in coercing other victims into criminal offenses.\n\nThis legislation is endorsed by multiple advocacy organizations,  faith-based organizations, and law enforcement officials. This is a  bipartisan, bicameral piece of legislation that unites both law  enforcement and victim organizations. It is a good piece of  legislation.\n\nThere are countless…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…why people who are getting involved in law  enforcement activities don't understand that they are obstructing  justice. Pulling in front of Immigration and Customs Enforcement  officials who are trying to remove people from our country, who are  here illegally and have had their due process, is not acceptable in any  manner, shape, or form.\n\nThere is…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…not just an accident. It is not just one random DA or judge or,  oh, George Soros funded one election. It is a coordinated effort to put  DAs and judges and other law enforcement officials into places in  communities--including in the communities I represent in Austin and San  Antonio and throughout Texas--purposely to then have organizations like  the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…paid.\n\nOf course, Mr. Speaker, if the Democrats had their way, the Federal  Government would still be shut down. People wouldn't be receiving their  SNAP benefits. Law enforcement officials at the Federal level wouldn't  be receiving payments. Air traffic controllers and TSA agents also  wouldn't be paid.\n\nThe good news is, Mr. Speaker, by passage of the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696929/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…steeply risen in  number ever since the left began its dangerous defund the police  rhetoric, and it will begin the process of expanding the resources  available to law enforcement officials.\n\nMr. Speaker, I urge my colleagues today to join me in supporting the  Improving Law Enforcement Officer Safety and Wellness Through Data Act,  and let's ensure that…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…accountability,  and safety to our highways. At the same time, I commend the Trump  administration for taking action on this front, particularly Secretary  Noem and law enforcement officials who recently carried out Operation  Midway Blitz.\n\nThis enforcement action led to the arrest of 223 illegal aliens, 146  of whom were truckdrivers. And just a few weeks…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697478/commercial-drivers-license-system"}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "…masks are necessary to protect the  identities of our law enforcement officers.\n\nFar-left radical people are using face recognition software or use  that to identify law enforcement officials and then dox them. That is a  risk. In fact, we have seen it in Nebraska. I was talking to one of my  county sheriffs about one of his deputies who was doxed; his name…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699924/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…day of the shooting, my oversight unit quickly got to work. They  talked to patriotic whistleblowers. They performed dozens of witness  interviews, including local law enforcement officials, rally goers, and  local businesses. My staff obtained and reviewed weeks' worth of  security footage, text messages, pictures, law enforcement briefing  materials,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693512/one-year-anniversary-of-trump-assassination-attempt"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…Texas and Texas being a border State, we are a hot spot for  human trafficking. We lead the country in that issue. I asked our  elected officials and I asked our law enforcement officials: How do we  combat this? How do we defeat this mechanism? These cartels and these  gangs move these people every day.\n\nIt starts with community awareness. You have…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699002/human-trafficking-awareness-month"}]