[{"senator": "Chris Pappas", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today to urge my colleagues to  support the HALT Fentanyl Act when it comes to the floor tomorrow.\n\nFor the past 5 years, I have engaged with law enforcement, public  health experts, and colleagues across the aisle to ensure the  scheduling of fentanyl analogues doesn't lapse and is finally made  permanent.\n\nPermanent scheduling…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692340/calling-for-permanent-scheduling-for-fentanyl-analogues"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…generally wreak havoc across the  government.\n\nLast month, DOGE decided unilaterally to cancel more than $500  million of Department of Justice grant funding for local law  enforcement, public safety, and crime prevention programs all over the  country in our communities.\n\nWhat did we hear from our colleagues across the aisle?\n\nDid they stand up to DOGE and…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…employees are absolutely  essential to keep our country running.\n\nMrs. DINGELL. They are firefighters, nurses, doctors, air traffic  controllers, food inspectors, law enforcement, and public safety  officials. They impact every part of our lives, and we take them for  granted. We cannot hurt them. We must support them.\n\nMr. Speaker, I thank my Republican…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697987/protect-americas-workforce-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…have a fourth branch of government called Elon Musk or Tarak  Makecha. This guy wrote memos to the deputy attorney general demanding  that all of these grants to law enforcement and public safety and  victim assistance groups across the country in our districts be  deleted. He wouldn't rest until they were deleted. They were deleted so  he said he could…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…for anything that guy is  doing.\n\nThey walked the line behind Elon Musk and Donald Trump, and they just  defunded hundreds of millions of dollars from community law enforcement  and public safety, so don't give me that lecture about defunding the  police, which our side has never supported, but their side has just  colluded in right now in terms of what…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…those who  don't look like him or from countries he doesn't like, has led to a  crackdown that has far exceeded--far exceeded--the stated claim that it  is about law enforcement and public safety. While he and his enablers  claim that they are after the ``worst of the worst'' or that they are  only going after people who are criminals, that is just not…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…$20 million and  a requirement to have body-worn cameras for law enforcement in the bill  that you are blocking. We agree. Body-worn cameras are helpful for law  enforcement and for the public to tell the complete story of what  actually happened.\n\nMy Democratic colleagues have demanded that we get deescalation  training for Federal officers. We as Republicans…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700299/government-funding"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…rise in strong support of H.R. 2189, the Law- Enforcement Innovate to De-Escalate Act.\n\nThis bill will put lifesaving, less-lethal technology in the hands of  more law enforcement and public safety officers.\n\nWhen the Gun Control Act of 1968 was enacted more than 50 years ago,  it was not written with the intent to regulate less-lethal projectile  devices…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700039/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "Mr. NORMAN. Mr. Speaker, I rise today to recognize an exceptional  public servant, David Camhi, whose unwavering dedication to law  enforcement and public safety has made an everlasting impact on his  community.\n\nThroughout his distinguished career, Mr. Camhi has exemplified the  highest standards of service, of leadership,…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689427/recognizing-david-camhi"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…capabilities has the       backing of a wide range of respected organizations       representing both law enforcement and community voices. These       include:\n\nLaw Enforcement & Public Safety Organizations\n\nFraternal Order of Police (FOP)\n\nMajor County Sheriffs of America\n\nNational Organization of Black Law Enforcement Executives       (NOBLE)\n\nHispanic…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…resolution and  in support of H.R. 2189, the Law-Enforcement Innovate to De-Escalate  Act. This bill will put lifesaving, less lethal technology in the hands  of more law enforcement and public safety officers.\n\nWhen the Gun Control Act of 1968 was enacted more than 50 years ago,  it was not written with the intent to regulate less lethal projectile  devices…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699904/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}]