[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…body cameras with strong protocols; protect sensitive  locations, including houses of worship, schools, and hospitals; and  restrict the use of deadly force.\n\nWe also want to enforce humanitarian standards in ICE and CBP  custody, ban military-grade equipment, strengthen civil rights, and the  inspector general's oversight.\n\nWe want to protect whistleblowers…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699655/horrific-ice-abuses"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…bite for rightwing media,  but the fact of the matter is it is not true.\n\nSanctuary policies do not mean that there are no laws or that the  Federal Government can no longer enforce Federal law in those  jurisdictions. What sanctuary policies are is simply an affirmation  that immigration enforcement is the job of the Federal Government and  that State…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…be required to match  the level of financial crimes and noncompliance seen in the industry.  It also does not provide sufficient funds for Federal agencies to  examine and enforce these laws.\n\nMs. WATERS.  Velazquez), who is also the ranking member of the Small  Business Committee.\n\nMs. WATERS.  Pressley), an unapologetic leader for justice.\n\nMs. WATERS.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693777/digital-asset-market-clarity-act-of-2025"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…purpose of terrorizing--to  function as an occupying force in our communities.\n\nReal accountability starts with abolishing ICE, impeaching Kristi  Noem, and rethinking how we enforce immigration policy in this country.  We cannot stop there. We must demand that those who are responsible for  terrorizing our communities are investigated thoroughly, not…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699668/horrific-ice-abuses"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…this bill assigns additional responsibilities to what is left of  the Department of Education. It simply doesn't add up. Who will be left  in the Department of Education to enforce these mandates?\n\nFor these reasons, H.R. 1005 does nothing to improve our schools and  everything to bog down schools in administrative red tape. I strongly  recommend a ``no''…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697410/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…section established to protect and  uplift the vote.\n\nFirst, he decimated the Voting Section staff. In January, it was  estimated that the section had 30 attorneys on staff to enforce voting  rights laws. Today, it is three. Then he decimated its mission,  transforming the section from a bulwark against voting suppression into  its opposite: a mechanism…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…insurrectionists were the ones defending the Capitol on  that day.\n\nLet's get this plaque up. We voted for it on an overwhelmingly  bipartisan basis.\n\nI appeal to Speaker Johnson to enforce the law even if he doesn't  like it anymore and even if he changed his mind about the plaque. This  is the law. Let's get it up there.\n\nNow, secondly, we should be talking…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…flexibility to our States  and schools, while ensuring accountability for our tax dollars. She  couldn't name a single requirement of that law--not one. How is she  supposed to enforce our education laws when she didn't even bother to  study up before her Senate confirmation hearing?\n\nOn fighting for public schools, it is painfully clear that McMahon's…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688363/nomination-of-linda-mcmahon"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…congressional Republicans are creating additional bureaucratic hurdles  for K-12, the Trump administration is actively dismantling the  Department of Education.\n\nWho is going to enforce these mandates anyway?\n\nI challenge my colleagues, many of whom privately acknowledge that  abolishing the Department of Education is a mistake, to actually oppose  those…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697440/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…files must be  released. But it is meaningless if the administration simply chooses  not to comply and then my Republican leadership colleagues proceed to  block the ability to enforce what the Senate agreed to pursue:  accountability, justice for the victims, transparency over this  horrific scandal.\n\nMr. President, I hope my Republican colleagues will…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699772/9999"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…keep saying they will return it back to the States.  What has been taken from the States, and what are the next steps moving  forward?\n\nWe need the Department of Education to enforce Federal law and  protect the civil rights of students across the country.\n\nI thank the nearly 100 Members of Congress who have already  cosponsored my legislation, and I urge…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689051/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…no doubt about that.''\n\nCommanded by Lieutenant William Dudingston, a Scottish       naval officer, the Gaspee sailed into Narragansett Bay in       early 1772, seeking to enforce trade laws that the American       colonists were increasingly flouting. The British ship began       to abruptly board colonial vessels off the coast of Rhode       Island…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…not consistent with the  Constitution or with democracy.\n\nTrump and Musk are asserting the powers of dictatorship.  Unfortunately, our Republican colleagues have refused to enforce the  law or the Constitution when it comes to this administration.\n\nThat is why I, along with Representatives Liccardo and Vindman,  introduced the Protect Our Constitution…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691297/stand-up-for-the-rule-of-law"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…impeachment and a removal of Donald John Trump as  President of the United States of America. It would be the appropriate  thing because he is unfit to be President, unfit to enforce the laws of  the land in such a way as to bring honor to the process--unfit.\n\nWhen you consistently, repeatedly flout the laws, flout the notion of  due process, when you…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…misconduct--complicit because it has failed to provide the right  training and perhaps has recruited people who are wrongly in these  roles, and it has failed to either provide protocols or to enforce  them.\n\nWhat became clear through our interviews and across the stories that  keep emerging is that the Department of Homeland Security does not have  just a few rogue agents.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699087/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…against       unscrupulous companies and individuals that committed unfair       or deceptive acts or practices involving tokens; and\n\n(6) to bolster the Commission's ability to enforce against       unfair or deceptive acts or practices involving tokens, the       Commission should ensure staff have appropriate training and       resources to identify and…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693414/consumer-safety-technology-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…President has the clear authority to federalize the National Guard to  restore order whenever State or local officials are derelict in their  duty to protect the public and enforce the law.\n\nRemember how all this started: ICE agents attempted to execute court- ordered warrants on criminal illegal aliens. When a mob intervened, ICE  called for local law…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693141/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…sells this idea that we are somehow a  less compassionate nation if we do not continually release career  criminals upon the streets. There is this notion that we can somehow  enforce criminal law with social vagaries; this idea that somehow if we  will just be very, very nice to the criminal element, they will just  stop committing crimes upon the law-abiding…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…in funding  negotiations, Chuck Schumer and House Minority Leader Hakeem Jeffries  are demanding that ICE agents show IDs to arrest illegal aliens. They  support photo ID to enforce immigration laws but oppose photo ID to  ensure our elections are secure. This is incredible hypocrisy.\n\nIn Proverbs 11:9, God says: ``The hypocrite with his mouth destroys…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699940/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…criminal behavior, they can go after people getting public benefits,  which is also illegal, and they should be removed immediately.\n\nMr. Speaker, in any event, we should enforce our laws.", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699858/who-should-be-deported"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…needs;\n\n``(B) to provide training to supervisors on the prohibited       personnel practices under section 2302, employee rights, and       the procedures and processes used to enforce employee rights;       and\n\n``(C) under which experienced supervisor mentors are       identified, evaluated, and approved to provide guidance and       advice to new or underperforming…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698216/federal-supervisor-education-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Georgia. FLETC's mission is to facilitate  the training of Federal, State, local, and Tribal law enforcement  officers, as well as international partners that are entrusted to  enforce the laws, treaties, and regulations within the United States  and abroad.\n\nIn the 1960s, studies revealed an urgent need for Federal law  enforcement training by professional…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693004/fletc-celebrates-55-year-anniversary"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…under section 18(a)(1)(B) of the Federal Trade Commission Act       (15 U.S.C. 57a(a)(1)(B)).\n\n(B) Powers of the commission.--\n\n(i) In general.--The Commission shall enforce this section       in the same manner, by the same means, and with the same       jurisdiction, powers, and duties as though all applicable       terms and provisions of the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690200/hotel-fees-transparency-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…side of the aisle? Where are their blue and yellow ribbons  today?\n\nAll the sanctimonious preaching sure is silent because they can't  bear to acknowledge that if you don't enforce the law, if you invite  criminals from around the world into our country with open borders, if  you let criminals on our streets with foolish policies by radical  judges and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…China not only in our words but  through our actions. Failing to do so enables the CCP to grow in  strength and exert its malign influence over the world. It is past time  we enforce accountability against our greatest adversary. The U.S. must  act decisively against the companies that profit from these abuses and  take a firm stand against totalitarian…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690655/no-dollars-to-uyghur-forced-labor-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…employing scores of illegal aliens  to undercut their competition, in flagrant violation of U.S. labor and  immigration laws.\n\nNow, let's start with some simple truths. If we don't enforce our  immigration laws, we have no immigration laws. If we have no  immigration laws, we have no border. If we have no border, we have no  country. We have gotten a glimpse…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694126/sorry-not-sorry-for-immigration-enforcement"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…or practice under section 18(a)(1)(B) of the       Federal Trade Commission Act (15 U.S.C. 57a(a)(1)(B)).\n\n(B) Powers of commission.--\n\n(i) In general.--The Commission shall enforce this section       in the same manner, by the same means, and with the same       jurisdiction, powers, and duties as though all applicable       terms and provisions of the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692730/romance-scam-prevention-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…also illegal to  evade Border Patrol and cross the border illegally into the United  States of America, but enforcement matters.\n\nWe can look at what happens when you don't enforce the law under the  Biden administration and what happens when you do enforce the law under  the Trump administration.\n\nI think back to when I went home to my hometown in Janesville,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…end to our border crisis was going to be at the top of his agenda,  and he has been delivering on that promise.\n\nIn just 2 months, his bold action to secure our border and enforce  our immigration laws has led to a precipitous drop in illegal crossings  at the southern border. U.S. Customs and Border Protection recorded  just 11,709 encounters--apprehensions…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689044/border-security"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…Earlier this year, House Republicans made a once-in-a-generation  investment in our immigration system. We gave our immigration officers  the resources they need to properly enforce our immigration laws and  carry out necessary deportations.\n\nToday, we are building upon that work with this proposed law to  provide a strong deterrent against those coming…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}]