[{"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…transparency is critical for effective congressional  oversight, and Mr. Jackson's bill will allow Congress greater insight  into the license application decisions and enforcement actions taken by  the Bureau of Industry and Security.\n\nNotwithstanding the length of the title, as pointed out by the  chairman, I hope my colleagues will join me and support…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690694/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…Caucus has presented a policy position on  DHS. The Members voted on that position, approved it, and it is the  following:\n\nWe propose to suspend ICE and CBP immigration enforcement actions in  Minnesota. We also propose to end warrantless stops. We also want to  suspend indiscriminate arrests and militarized tactics against  civilians nationwide.\n\nAllow…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699655/horrific-ice-abuses"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Ms. BONAMICI. Mr. Speaker, I rise today to express my profound  opposition to the aggressive, cruel, and dangerous immigration  enforcement actions that are taking place in Oregon and across the  country.\n\nDuring the past few months, we have seen a dramatic increase in  agents from ICE, the Immigration and Customs…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696911/aggressive-immigration-enforcement-tactics-in-oregon"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Ms. BONAMICI. Mr. Speaker, I rise today to express my profound  opposition to this administration's aggressive and cruel immigration  enforcement actions, especially targeting students and parents near  schools.\n\nThroughout the last year, the Trump administration's hard-line  immigration enforcement campaign has terrorized…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698641/immigration-enforcement-and-schools"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…this legislation fully preserves FSOC's authority to  take swift action in emergency situations and does not alter the  authorities of FSOC's member agencies to take enforcement actions. If  an emergency arises, FSOC can march in and, with a few quick votes,  designate a firm.\n\nMr. FOSTER. Mr. Speaker, this bill strengthens FSOC's capability to  execute…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699823/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…hundreds of billions of dollars in  personal profit.\n\nWe need legislation that stops financial abuse, not encourages it,  especially during a time when the SEC has dropped enforcement actions  against major crypto firms and undermined investor safety.\n\nAcross our country, millions of working families are battling rising  costs, our elders are targeted by…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693786/digital-asset-market-clarity-act-of-2025"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…Issaquah,  Washington, agents kidnapped a mother outside her child's preschool and  quickly deported her. This is not unique. Since Trump rescinded the  practice of avoiding enforcement actions at sensitive locations, we  have seen a daycare worker snatched in front of children in Chicago and  a father arrested outside his child's preschool in Oregon.\n\nLet's…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697449/fighting-dhs-immigration-raids"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…pipeline company and key ally of President Trump,  is attempting to declare pipeline safety enforcement unconstitutional  in the courts. This spring, pipeline safety enforcement actions dropped  to a new low. It is just a disaster over at the Department of Energy.  There is nobody doing anything about pipeline safety.\n\nDemocrats wondered if this was…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…Congressional Progressive Caucus for convening this very important  discussion this evening.\n\nOver the past year, the Trump administration has pursued immigration  enforcement actions, actions that are deplorable, inhumane, and,  indeed, deadly.\n\nLast month, in my district in New York's Capital Region, a family of  five, including an 8-month-old who was…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699664/horrific-ice-abuses"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…companies and  enriched himself. Tesla, SpaceX, Starlink have all profited under  Musk's time as a Federal employee. At the same time, he went out of his  way to kill several enforcement actions that were underway by different  Federal agencies against his businesses, allowing his companies and  himself to evade oversight. He was able to help place key personnel…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…enough to do almost everything, but you  can't violate the Constitution. That is different.\n\nCan Secretaries Hegseth and Rubio give us examples of other so-called  law enforcement actions that have cost U.S. taxpayers billions and  billions of dollars? Moreover, this Presidential administration has not  legally appropriated a single dollar. Rather, it…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…amount of collections recovered on such purchases, and       the number and total dollar amount of charge-offs for such       purchases;\n\n``(10) the number and type of enforcement actions with       respect to a loan made by a development company under this       title recommended by the Administrator; and\n\n``(11) the number and dollar amount of any civil…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699188/504-program-risk-oversight-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…excessive blood loss. His immediate response  undoubtedly saved the driver's life.\n\nDeputy Thomas' professionalism, dedication, and courage exemplify the  best of law enforcement. His actions not only protected a life that day  but also set a standard of excellence for his department and  colleagues.\n\nHe was rightfully honored with the lifesaving ribbon…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688323/recognizing-hunter-thomas"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…actions. Agents and brokers       are required to make documentation of consumer consent       available to CMS upon request in response to monitoring,       audit, and enforcement actions.       Fraud Risk Management\n\nThe objective of fraud risk management is to ensure program       integrity by continuously and strategically mitigating both       the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…American entrepreneurs and developers in the digital asset  space have been forced to navigate a regulatory maze marked by  conflicting guidance, shifting definitions, and enforcement actions in  place of actual rules. These inconsistent conditions have stifled  domestic innovation, discouraged responsible market participation, and  driven capital and talent…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…when it is politically inconvenient, is a posture worth fighting for.\n\nMr. Speaker, as I close tonight, I remind the American people that  this administration's law enforcement actions to bring Maduro to  justice have received the full support of Republicans in Congress. I  hope my Democratic colleagues, who were once in favor of such actions,  will…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…due diligence in satisfying the       applicable requirement)''; and\n\n(3) by adding at the end the following:\n\n``(3) Limitation.--The Secretary shall not issue       enforcement actions under section 303 for failures under this       subsection in the case of a drug or biological product that       is no longer marketed.''.\n\n(b) Due Diligence.--Section…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…unique attributes of blockchain technology while giving users  and developers the confidence to engage and innovate in this ecosystem.\n\nGone are the days of arbitrary enforcement actions and regulatory  turf wars that only hindered the development of this groundbreaking  technology and drove capital overseas.\n\nThis bill gives market participants the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693790/digital-asset-market-clarity-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…actions. Agents and brokers       are required to make documentation of consumer consent       available to CMS upon request in response to monitoring,       audit, and enforcement actions.\n\nFraud Risk Management\n\nThe objective of fraud risk management is to ensure program       integrity by continuously and strategically mitigating both       the likelihood…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…related to senior investors;\n\n``(D) key observations, best practices, and areas needing       improvement, involving senior investors identified during       examinations, enforcement actions, and investor education       outreach;\n\n``(E) a summary of the most serious issues encountered by       senior investors, including issues involving financial…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693935/national-senior-investor-initiative-act-of-2025"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…before it reaches our shore.\n\nThe impact of the incredible work of the men and women of CBP's Air  and Marine Operations is undeniable.\n\nIn fiscal year 2025 alone, AMO enforcement actions resulted in the  seizure of more than 500,000 pounds of illegal narcotics. I will say  that again: One-half million pounds of potential deadly contraband were  interdicted.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696951/combatting-international-drug-trafficking-and-human-smuggling-partnership-act-of-2025"}]