[{"senator": "Mark Kelly", "party": "Democrat", "sentence": "…Presiding Officer, I don't think there are any other Republicans  showing outrage for one of their colleagues on the other side of the  aisle being violently handled by law enforcement.\n\nThis is wrong. This is not putting our country first. And I have to  say, I hope we can turn things around here in the coming weeks. But in  my lifetime, and certainly…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692559/alex-padilla"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…currently few meaningful repercussions in the human cell  and tissue products industry. This bill would change that by providing  the Food and Drug Administration with additional enforcement tools to  more quickly and effectively protect the public. It provides a balanced  approach to improving safety of human cell tissue and cellular and  tissue-based products.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692766/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Eric Sorensen", "party": "Democrat", "sentence": "…who serve and protect us every day, but it is  also a good reminder that they deserve our thanks every day. We also  need to thank the spouses and the children of our law enforcement who  deal with the risk of their loved ones who may not come home.\n\nFinally, we remember the family members who made the ultimate  sacrifice for our safety. Serving in the…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691333/thanking-our-law-enforcement-officers-and-their-families"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…affirmative action for  employees and applicants with disabilities, ensuring that they are  hired, retained, and promoted by Federal contractors; they are rolling  that back.\n\nEnforcement of antidiscrimination and affirmative action requirements  that ensure that Federal contractors are for equal employment  opportunities for workers, they are rolling that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695574/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "Mr. VASQUEZ. Mr. Speaker, I rise today during National Police Week to  honor the courageous law enforcement officers from New Mexico who have  made the ultimate sacrifice in service to our communities.\n\nEvery day across our country and in my home State, law enforcement  officers…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691300/national-police-week"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…other peers.\n\nRight now, we are seeing special education under direct and  deliberate attack. We have seen repeated efforts to slash education  funding, weaken civil rights enforcement and chip away at the  protections IDEA guarantees to our students with disabilities.\n\nEvery dollar we fail to invest in IDEA is a cost shifted onto our  schools, our local…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698946/protecting-education-for-children-with-disabilities"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…cancer. He slashed the funding for  child cancer research.\n\nHe says his tariffs are good for farmers. Last time he did this,  farmers lost $27 billion.\n\nHe says he supports law enforcement. He pardoned the people who beat  police officers on January 6. He pardoned them: people who tried to  overturn the election, people who brutally beat the men and women…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688503/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…United States Capitol.\n\nThe deadly insurrection of January 6, 2021, was not merely an attack  on a building, but a direct and violent assault on Members of Congress,  law enforcement, staff, and the very foundations of our democracy.\n\nToday, this evening, we honor the extraordinary bravery of the United  States Capitol Police and other law enforcement…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…America.\n\nEarlier this year, Congress authorized a massive slush fund under  Trump's so-called big, beautiful bill, pouring more than $170 billion  of taxpayer money into enforcement and detention center expansion  without any sort of meaningful oversight.\n\nAt the heart of this system sits a vast network of privatized  detention facilities run by private…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697457/fighting-dhs-immigration-raids"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…today to congratulate Eagan Police  Chief Roger New on his retirement after thirty-one years with the  police force. From a young age, Chief New knew he wanted to be in law  enforcement. After graduating with a social science degree from  Concordia College he joined the Eagan Police Department as a Community  Service Officer in 1994. Over the next two decades,…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696271/congratulating-chief-roger-new-on-his-retirement"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…response to this  senseless tragedy.\n\nWe are grateful to the first responders for their prompt action on  the scene and medical professionals for caring for the wounded.\n\nAs law enforcement continues their work, we thank them for their  efforts and wish them strength in their pursuit to bring to justice  whoever committed this horrific act.\n\nFor the extended…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698196/moment-of-silence-in-honor-of-victims-of-brown-university-mass-shooting"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "Mr. Speaker, I rise in opposition to H.R. 2189, the so-called Law- Enforcement Innovate to De-Escalate Act.\n\nLaw enforcement officers serve a critical role in promoting public  safety. That is why we must give them the tools to do their job  effectively…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…of  a limited number of individuals who are primarily involved in  government or political activity, and the copying of certain  information that was subject to U.S. law enforcement requests pursuant  to court orders.'' Vice President Vance subsequently revealed that his  communications and those of President Trump were compromised in this  hack. This…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689978/nomination-of-sean-plankey"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "Mr. TONKO. Mr. Speaker, I rise today to urge all of us to demand  mental health parity enforcement in honor of a young man that I once  represented, Timothy O'Clair.\n\nI first met Timothy when I served in the State Assembly in New York.  Timothy played Little League and…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692435/timothy-oclair-and-mental-health-parity"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…our communities.\n\nYou need to wear a body camera. You should not be masked, unless it  is for your health. You need to have insignia that shows you are  actually real law enforcement. You need to have a judicial warrant to  come into someone's house, not a warrant signed by some person at the  Department of Homeland Security, who may or may not just…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…cosponsored Mr. Evans' resolution.\n\nNumber three, it says: Be it resolved that the House of  Representatives ``affirms that free and open communication between  State and local law enforcement and their Federal counterparts remains  the bedrock of public safety and is necessary in preventing terrorist  attacks.''\n\nIt seems reasonable to me.\n\nNumber four says:…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692193/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…arrested some of the worst perps  imaginable, including a 20-year-old citizen of Guatemala who was  filming a child being raped.\n\nMr. Speaker, despite all of this, ICE law enforcement is facing a  1,300 percent increase in assaults against them, a 3,200 percent  increase in vehicle attacks, and an 8,000 percent increase in death  threats.\n\nIf Democrats…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699311/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…knows that Congress had the authority, not  them.\n\nDo you remember the night of the invasion, Mr. Speaker?\n\nIt was the Attorney General who explained this was just a law  enforcement action that the military was merely assisting.\n\nThat is the problem we have because then it became obvious that we  were undertaking a military exercise. If the unilateral…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699373/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…long hours,  late nights, and time away from home. The PEARL Act, named after a  special canine that helped our Border Patrol agents through some tough  times, gives our law enforcement one more tool to improve mental health  outcomes at CBP.\n\nIn 2023, CBP launched the Support Canine Program, which aims to  improve mental health resources for CBP personnel.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696972/providing-emotional-assistance-with-relief-and-love-act"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…office  the following month, she went on to serve as Mayor from December 2020  through December 2023. Debra was instrumental in championing Measure P,  which expanded law enforcement, strengthened code enforcement, and led  to the development of a new police station and civic plaza, enhancing  public safety and revitalizing the city's core. She also…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696324/recognizing-the-service-of-debra-jones-on-her-retirement"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…the  Central Texas Narcotics and Organized Crime Task Force. Bill joined the  Milam County Sheriff's office in 1982, where he served the remainder of  his distinguished law enforcement career. Upon his retirement from that  position, he continued to serve as a reserve deputy and as the  Sheriff's office Chaplain until 2023.\n\nBill's commitment to Milam…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696330/recognizing-william-bill-forest-harris-with-a-congressional-veteran-commendation"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…responsibly right here in the United States.\n\nFor too long, innovators have been stuck in a regulatory gray zone  caught between agencies and overlapping authority and subject to  enforcement instead of clear rules.\n\nThe uncertainty has driven jobs, investment, and innovation offshore  while leaving American consumers exposed.\n\nThe CLARITY Act fixes this. It…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693792/digital-asset-market-clarity-act-of-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…pro-Palestine extremist group. The four suspects are  now in Federal custody, and we know they will face the full force of  the law.\n\nGod bless the men and women in Federal law enforcement and in our  armed services who are really working around the clock to restore  safety and security here in our country.\n\nUnder President Trump, we have seen that national…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…move to suspend the rules and pass the  bill (H.R. 183) to amend the Federal Lands Recreation Enhancement Act  to provide for a lifetime National Recreational Pass for law  enforcement officers, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                  H.R. 183\n\nBe it enacted by the Senate…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693931/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…gentleman from Texas, for  yielding me the time.\n\nMr. Speaker, I rise in support of the rule and the three bills it  provides consideration for.\n\nSince 2020 respect for law enforcement around our country has been on  the decline, and we have seen the effects this has had in our  communities.\n\nWe all know the best way to stop a bad guy with a gun is a good…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691170/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…home State of New York.\n\nUnder President Trump, that era of weakness is over. Criminals no  longer get a free pass.\n\nThrough Operation Absolute Resolve, U.S. forces and law enforcement  partners successfully captured Nicolas Maduro and his wife, Cilia  Flores, both tied to narcotics trafficking, in a carefully planned,  coordinated operation, carried out…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698881/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…explanation of how to obtain a refund of the       total event ticket price.       SEC. 6. REPORT BY THE FEDERAL TRADE COMMISSION ON BOTS ACT OF                     2016 ENFORCEMENT.\n\nNot later than 6 months after the date of the enactment of       this Act, the Commission shall submit to Congress a report on       enforcement of the Better Online Ticket…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690175/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…back to the United States, record- low unemployment, record-high wage growth, and the lowest poverty rates  in recorded history.\n\nThis bill also equips our troops and law enforcement, Mr. Speaker, to  defend our sovereignty, protect our citizens, and secure our border  after years of neglect and lawlessness.\n\nWhile more work remains no doubt to rein…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693192/one-big-beautiful-bill-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…contributions that Tami Gaston has made through her work with  Cryoeeze22. Tami is dedicated, driven and determined to provide our  nation's heroes: military, Veterans, law enforcement and first  responders with scientific holistic options to treat an array of  conditions, including: PTSD, Suicide Prevention, inflammation, and many  more. Mrs. Gaston tirelessly…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692210/recognizing-tami-gaston"}, {"senator": "John Carter", "party": "Republican", "sentence": "…example of honor and duty.\n\nDuring his 32 years of military service, MSgt Bygum served in both  the U.S. Marine Corps and the U.S. Air Force in various roles including  Law Enforcement, Security Operation, and Emergency Management. During  his four years in the Marine Corps, he served as an Infantry Corporal  in Subic Bay, Philippines.\n\nUpon transitioning…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689326/saluting-the-service-of-master-sergeant-duane-c-bygum-jr"}]