[{"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…public comment period on August 19 and  will close it Friday. Now, I know how slow and deliberate government  can sometimes be, but there should be no shortcut to public engagement  and to the democratic process. Yet a shortcut--or maybe more accurately  a short circuit--is exactly what this administration has chosen.\n\nWith an underresourced and understaffed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…of God reflected its evolving mission and growing  congregation.\n\nIn the decades that followed, Reverends Ron Johnson and Glenn  Reynolds deepened the church's community engagement through programs  such as the Great Turkey Giveaway, Christmas Toy Giveaway, and weekly  Community Dinner. These initiatives have benefitted countless families  across Hampton…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696401/recognizing-the-70th-anniversary-of-bethel-temple-church-in-hampton-virginia"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…the  Smithsonian Chamber Players.\n\nThe communications team was led by Eliza Duckworth. Eliza, working  closely with my personal office staff, focused on response to and  engagement with national media, while Reilly McBride focused on the  livestream production which reached over 5 million people with the help  of Paul Winston of Razor Management and…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…has served       as a beacon of sisterhood, scholarship, and service in       Northeast Ohio, exemplifying the sorority's mission through       impactful programming, civic engagement, and unwavering       advocacy for social justice and equity;\n\nWhereas, in 2025, the Greater Cleveland Alumnae Chapter       proudly celebrates its Centennial Anniversary,…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691694/recognizing-the-greater-cleveland-alumnae-chapter-of-delta-sigma-theta-sorority-incorporated-on-their-centennial-anniversary"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…University.\n\nWe must condemn political violence in all its forms and in all its  twisted motivations and perverse ideologies.\n\nWe must, instead, commit ourselves to civic engagement and education,  commit ourselves to decency, dignity, and the truth for the good of  this Nation, our neighbors, our families, and most especially our  children.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695813/political-violence"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…organization in my district called the  Unity Council that serves families, parents, seniors, and children,  providing them with affordable housing, career opportunities, community  engagement and, yes, Head Start programs.\n\nI learned from the Unity Council that President Trump and the  administration has stopped funding for the Oakland Head Start program.  This…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691363/vulnerable-children-must-be-supported"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…economic  challenges. It is imperative that we develop, maintain, and grow these  relationships.\n\nRecognizing this, successive administrations have committed to  deepening U.S. engagement in the region, including through trade and  investment. Most recently, the 2025 National Security Strategy asserts  that ``the Indo-Pacific is already and will continue to…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697950/supporting-the-prosper-in-the-pacific-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Boundary Waters and its  headwaters from mining for 20 years through a public land order, a  standard tool and process backed by peer-reviewed science and extensive  public engagement.\n\nThe Congressional Review Act resolution on the floor today would  overturn those protections, once again putting our beloved Boundary  Waters at risk of toxic pollution…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Larry, and Barbara--he was reared in a home firmly rooted in faith,  discipline, and service. Those foundational values shaped a life that  bore fruit in ministry, civic engagement, and community building.\n\nAt an early age, Bishop Williams accepted Jesus Christ as his  personal Savior and was baptized at Antioch Missionary Baptist Church  under Pastor…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…critical partner to the United States and to  our industry and workers.\n\nThus, it seems obvious that such a pivotal part of the global economy  should not be excluded from engagement in one of our most important  international financial institutions.\n\nAs H.R. 910 requires, the U.S. would be an advocate that the IMF  admit Taiwan as a member, allowing…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692795/taiwan-non-discrimination-act-of-2025"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…NOFO also imposes several obligations on Eligible       Entities and subgrantees, such as coordinating with political       subdivisions and Tribal governments; targeting engagement       efforts at underrepresented communities; giving priority to       projects based in part on a demonstrated record of and plans       to be in compliance with federal…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698437/us-government-accountability-office-opinion-letter"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…various community leadership and service roles, including work with the  Fellowship of Christian Athletes, and other organizations committed to  faith, advocacy, and civic engagement.\n\nAt the age of 15, Pastor Chris accepted his call to the preaching  ministry and delivered his first sermon. Since that time, he has  ministered through preaching and song…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699828/recognizing-pastor-christopher-chris-k-wesley-on-six-years-of-servant-leadership"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…University received its initial regional  accreditation from WSCUC in 2011, and in 2015, UC Merced is the  youngest university to earn national recognition for community  engagement with a Carnegie Research Classification.\n\nUC Merced was the first public research university in the Nation to  reach verified operational carbon neutrality in 2018, and in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695846/recognizing-the-university-of-california-merced"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…Speaker, I rise to recognize Mel Vernon as my November  2025 Constituent of the Month.\n\nMel Vernon is an example of what it looks like to dedicate ourselves  to community engagement and cultural preservation. For more than 15  years, he has worked with teachers and educators across Southern  California to ensure the history of the Luiseno people is not…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699866/recognizing-mel-vernon-as-november-2025-constituent-of-the-month"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…call of duty in her illustrious public service career.\n\nThroughout her life, Mrs. Pough remained committed to service by  advocating for causes such as voting rights, civic engagement, and  youth development. Mrs. Pough is truly an example of a life lived  fully. She has been blessed to break bread with First Lady Michelle  Obama and to cast her vote for…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699343/recognizing-mrs-essie-pough"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…years-long wait in  the interconnection queue.\n\nThe bill also promotes transparency by requiring that grid operators  provide opportunities for public comment and stakeholder engagement  before submitting proposals to FERC. Operators must also provide  regular reports to FERC on the state of grid reliability and actions  taken under this bill.\n\nFinally,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695755/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…educators, or local educational       agencies to participate in such research activity.\n\n(3) A description of how such research activity may inform       efforts to promote the engagement and achievement of       students, including students from groups historically       underrepresented in STEM, in prekindergarten through grade 12       in mathematical modeling…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…full weight of the United States stands  firmly and publicly against these provocations.\n\nFor decades, our Nation employed a strategy of opacity, restricting  our formal engagement with Taiwan to avoid upsetting or insulting the  Chinese Communist Party.\n\nIn 2020, this body enacted the Taiwan Assurance Act, and the first  Trump administration moved…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690685/taiwan-assurance-implementation-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…clerk, an emergency  department unit clerk, and as office manager and receptionist for Dr.  Petty's Podiatry.\n\nBeyond her professional career, Lisa's dedication to civic engagement  has been extraordinary. She has been a volunteer with the Bowie County  Republican Party for 35 years, currently serving as Precinct Chair and  Volunteer Coordinator, inspiring…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696870/recognizing-congressional-patriot-award-recipient-lisa-singleton"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Shared Property Agency       Collaboration and Engagement Act of 2025'' or the ``SPACE Act       of 2025''.       SEC. 2. GSA COLLABORATION WITH FEDERAL TENANTS.\n\n(a) In General.--In carrying out section 2302 of the Thomas…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695013/shared-property-agency-collaboration-and-engagement-act-of-2025"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…They are aligned with Russia. The goal  is to make sure that it never happens again, and that will be a process  that involves military force, potentially, and diplomatic engagement.\n\nWhat the Congress, I fear, is going to do is to limit the President's  ability to achieve that national interest by misapplying the War Powers  Act--by substituting our…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…identity.\n\nSince opening its doors in 1925, the Hanford Civic Auditorium has  served as the cornerstone of community life--a vibrant hub for artistic  performances, civic engagement, and social events. From city council  meetings and public forums to receptions, family reunions, and  community celebrations, it has hosted countless gatherings that reflect…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698408/recognizing-the-hanford-civic-auditorium"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…able-bodied adults have a mandatory  work requirement of just less than 20 hours per week. It includes the  ability for participating in education, job search, and community  engagement to all count toward that work requirement.\n\nWhat we were trying to do in the One Big Beautiful Bill Act is ensure  that limited resources are protected for pregnant women,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…threat. I believe invoking the War Powers Act at this moment is  necessary, given the President's comments about the possibility of  ``boots on the ground'' and a sustained engagement ``running''  Venezuela, with which I do not agree.\n\nWhat happens now matters greatly, both in terms of accountability for  Maduro and the future of the Venezuelan people.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698694/venezuela"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…when guided by a mission of service over profit.\n\nKelly has also been a steadfast advocate for the credit union  movement on both state and national levels. Her thoughtful engagement  with policymakers like myself rooted in collaboration, expertise, and  genuine care for people, has advanced the cause of financial inclusion  in the First Congressional…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696273/recognizing-chief-executive-officer-of-trumark-credit-union-ms-kelly-botti"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…manage and grow a community bank.\n\nFor the past 25 years, Mr. Williams has led Upper Peninsula State  Bank with steadfast commitment to both customer service and community  engagement. His passion for serving his community extends beyond his  day-to-day work, as reflected in his advocacy for the industry at both  the state and federal levels. In addition…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695770/recognizing-mr-david-williams-for-receiving-the-best-community-banking-award-for-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…other distributed ledger technology, applications built on       blockchain technology or other distributed ledger technology,       tokens, and tokenization;\n\n(5) supporting engagement with the public to promote the       best practices described in subsection (c);\n\n(6) considering policies and programs to encourage and       improve coordination among…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692733/deploying-american-blockchains-act-of-2025"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…real reform, I believe that my colleagues  would not just resort to political maneuvers.\n\nI am not a fan of tariffs. That is no secret. I am in favor, however,  of robust engagement with our trading partners. Let me be very clear.  In trade, there is no stagnation. If we are not gaining ground, I think  we are losing ground, and data would show that.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699963/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…based on rigorous intelligence  linking these boats with well-known narcoterrorists.\n\nEvery strike undergoes a comprehensive legal review and complies with  defined rules of engagement to ensure innocent civilians are not  harmed. The Armed Services Committee is notified of every strike and  has been briefed on this operation several times. These strikes…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698238/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…the people they serve.\n\nMeals on Wheels delivers care, compassion, and peace of mind to  families in Savannah and beyond. The partnership reflects the power of  community engagement and shows what is possible when local  organizations and volunteers work together to lift others.\n\nI thank Senior Citizens, Inc., Meals on Wheels, and Chef Bailey for  their…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692062/meals-on-wheels-65th-anniversary"}]