[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…war in our hands, not with an Executive  who may grow too fond of using it.\n\nThat is why Senator Kaine and I have introduced a resolution to  direct the President to stop engaging in armed strikes against these  vessels or the country from which they emanate without the explicit  authorization of Congress. We are here today to ask our colleagues to…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…parties involved, and there must be justice  for all parties involved if we are to have genuine peace between  Palestinians and Israelis.\n\nThe President appears to currently be engaging in a process of ethnic  cleansing. This is where his thoughts are. He seems to believe that we  can take Gaza from the Palestinians. He seems to believe that the  Gazans can…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…driving force in advancing our mutual national  interests. During his accomplished career in the Australian Parliament  and as Prime Minister, he understood the importance of engaging  Congress, steadying the Australian relationships through changes in  administrations.\n\nAnd in 3 years, he delivered enduring and positive outcomes for  Americans and Australians…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699544/9999"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…families and new  immigrants.\n\nCaribbean Community Services in my district, a nonprofit  organization, has done an outstanding job in uplifting Caribbean  history. Through their engaging events, Mr. Speaker, they have  celebrated the rich cultural heritage of the Caribbean and its  significant impact on our communities. Please join me in ensuring that  our…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692989/caribbean-american-heritage-month"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…families, we should ask them.\n\nThe result was this bill, which would require States to create a new  family partnership plan to explain how they are identifying, screening,  engaging, and supporting foster and adoptive families, in consultation  with people with lived experience.\n\nTo me, one of the most critical aspects of this will be engaging with  the…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688406/recruiting-families-using-data-act-of-2025"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…people. This  September, His All-Holiness Ecumenical Patriarch Bartholomew visited  our Nation's capital, continuing his longstanding practice of meeting  with the President and engaging with Members of Congress from both  political sides.\n\nHis All-Holiness is the spiritual leader of more than 300 million  Orthodox Christians worldwide, representing faith's…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697433/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-of-constantinople"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…American citizens should not be detained and deported. The people going  about their business should not be kidnapped because of the color of  their skin or because they are engaging in peaceful protests.\n\nFinally, Republicans refused to prioritize the very real work that  DHS does in our communities: stopping fentanyl trafficking, stopping  child trafficking,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699358/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…Castle County, supporting more than 42,000  youth with after-school programming, summer enrichment, and early  childhood education.\n\nTheir mission, ``building brighter futures, engaging with public  safety and empowering families'' is more than a slogan. It is a daily  practice. Through their work, the Wilmington PAL supports children from  infancy through…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692994/wilmington-police-athletic-league"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…banning together to do something and  he turned his back?\n\nDid you speak up when outbreaks of dangerous, infectious diseases are  still  a global threat, yet we have stopped engaging in the efforts necessary  to meet those threats?\n\nWhere were you when the American press was being censored; when  international students were being disappeared from American…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…and all Americans.\n\nMr. Speaker, every year, we recognize the month of June as Men's  Health Month. It is a time to encourage men to set an example for their  families by engaging in preventive healthcare. It is about breaking  harmful habits, making informed decisions, and prioritizing health in a  way that protects not just individuals but the whole…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…education has allowed for more flexible learning  opportunities for all of us, whatever our ages, but most specifically,  for students doing their homework, doing lectures, engaging in  discussions, and so much more--all of it online. It is a different  world, and now S.J. Res. 7 threatens to cut off and constrict that  world.\n\nThe internet can be a tremendous…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690726/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…governments, as well as Tribal nations,  nonprofits, and regional organizations.\n\nThe bill requires the Marine Debris Foundation to develop and  implement best practices for engaging with Tribal Governments to ensure  that they are included in the programs and funding designed to protect  the water resources.\n\nFinally, this legislation extends vital funding…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698191/save-our-seas-amendments-act"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…differences but in the celebration of them. Today, this fundamental  belief is under siege.\n\nWhen President Trump and his allies launched their attacks on DEI,  they were not merely engaging in political rhetoric. They were  dismantling policies designed to correct historical inequities and  promote a more just and inclusive society.\n\nThese efforts, cloaked in…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…be harmed.\n\nThey had been trained, and they had been lectured by Dr. King, who  taught them how to engage in nonviolent, peaceful protest and how it is  necessary to, when engaging in this protest, not engage in acts of  violence because, in so doing, you can harm the actual protest movement  itself.\n\nThey were there, unarmed, marching peacefully from…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…misconduct or charges.\n\nPublic access to police misconduct information is a key       component of accountability and reduces the likelihood that       an individual engaging in criminal behavior or police       misconduct can simply resign and join another law enforcement       agency. A recent study published in The Yale Law Journal       found…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…that has sat in accounts, sometimes for years and years.  My argument is that many of these things I actually don't oppose. You  belong appropriating it again. You belong engaging in the budgetary  discipline.\n\nIf we are truly doing regular order, we should say that this was  originally appropriated in 2015. It is clean coal, which is an actual  one.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694954/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…circumstances.\n\nSince their President was assassinated just a few years ago, the  Haitian people have endured hardship. They have endured political  unrest, and they have endured gangs engaging in kidnapping. The Haitian  people need hope, and they need support from the American people.\n\nThe HOPE/HELP preferential trade program helps do just that. It  lowers costs…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698848/haiti-economic-lift-program-extension-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…know that we are better than this. America is still the  greatest country in the world, and I am hopeful that we will all take  the opportunity to follow Charlie's example by engaging on the issues  with our neighbors and living up to the promise of our great country.                           Return to Regular Order\n\nMr. MANN. Mr. Speaker, today our national…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695600/we-are-better-together"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…willing to pursue truth wherever it may  lead. We need to follow truth wherever it may lead, but you also have  to have the courage to speak truth.\n\nCharlie Kirk, when he was engaging with Bill Maher, a skeptic, just  earlier this year, said: ``In China and, of course, in the Soviet  Union, there was an anti-Christian movement. Very hardcore. What book…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…if you are destroying buildings. It is  not a peaceful protest if you are attacking someone. It is not a  peaceful protest if you are burning buildings, burning cars, and  engaging in violent conduct.\n\nThen we saw from that some of this antipolice that came about, the  calls to defund the police. I am glad to see that I don't hear that  very much anymore.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…veterans. On  August 6, 2025, the VA announced that it is terminating most union  contracts to comply with the executive order.\n\nEmployees at the VA currently spend 750,000 hours engaging not in  care for veterans but in union activities. That is every single year.  The President's executive order will lead VA employees to spend more  time helping veterans…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697995/protect-americas-workforce-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…easier to just keep  borrowing money and borrowing money and borrowing money and say: I am  giving you something, but I am putting it on your credit card. It is  like we are engaging in a level of financial lunacy here.\n\nNow, let's actually go on to the even more difficult part of this  discussion. I am doing this because I want us to start to have a…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…underperforming supervisors to--\n\n``(i) transfer knowledge and advice in areas such as       communication, critical thinking, responsibility,       flexibility, motivating and engaging employees, teamwork,       leadership, and professional development; and\n\n``(ii) identify strengths and areas for development.\n\n``(c) Requirements for Training Design.--Training…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698216/federal-supervisor-education-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…years later, I am sitting here on  the committee particularly regarding the tax policy to be able to bring  it up.\n\nThis is a unique and really special time. We are already engaging  with the Senate to make sure this can adhere to and go through the Byrd  rule, all the specifics of making this a reality.\n\nThis is an exciting moment. It will be monumental,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Military Partnership Grant Program serves 4-H clubs that are  in many military installation youth centers. These programs include 4-H  positive youth development programming, engaging in hands-on learning  in day and overnight summer camps, including military team adventure  camps.\n\nWe, as a nation, ask so much of our military families. Frequent moves…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695237/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…to have taxpayer-funded sex-change operations?  The Senate bill puts that back in.\n\nWhy should we not tax these big university endowments and these  universities that are engaging in political activism and taking massive  Federal money and Federal student loan support? Why shouldn't we tax  them on it? The Senate reduces our tax on university endowments…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…and I  reserve the balance of my time.\n\nMr. WESTERMAN. Mr. Speaker, I have no further requests for time.\n\nI thank my colleagues for supporting this critical legislation and  engaging in this meaningful discussion.\n\nBefore I close, I want to highlight another statement from Director  Leavitt, which she offered during a Natural Resources Committee hearing…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696830/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…people because they were living off of  welfare largely, in a choice between that and a well-run, Western,  honest country like Israel, Greta Thunberg got more joy out of engaging  in protests or whatever these people do to try to help the Hamas group  that brutally killed a thousand people.\n\nOur country has to identify Thunberg syndrome and see what…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…education in       public schools, including statistical modeling, data science,       operations research, and computational thinking, which may       include the following:\n\n(1) Engaging prekindergarten through grade 12 educators in       professional learning opportunities to enhance mathematical       modeling and statistical problem solving knowledge, and…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Granite Bay High School.\n\nNot only does Mr. Dell'Orto have a deep understanding of these  subjects but he also knows how to bring historical events to life. His  integrated and engaging teaching style fosters student success, while  inspiring a lasting passion for history.\n\nBeyond the classroom, he has been recognized by the Daughters of the  American Revolution…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}]