[{"senator": "Ed Case", "party": "Democrat", "sentence": "…China (PRC).\n\nJones Act vessels such as the Daniel K. Inouye, Kaimana Hila and  Manukai have undergone major structural conversions, including  liquefied natural gas (LNG) engine retrofits, at PRC-based shipyards  like COSCO's Nantong facility, which has known ties to the Chinese  government and military-industrial complex. These modifications are…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694572/introduction-of-the-merchant-marine-allies-partnership-act"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…people.\n\nToday, Laredo and its sister city, Nuevo Laredo, form the Dos  Laredos--creating the largest inland port in both the United States and  Mexico. This dynamic economic engine is a hub for land, rail, and air  cargo, driving billions in trade annually and supporting families  across both nations.\n\nBut Laredo is more than just a commercial gateway--it…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691267/recognizing-the-270th-birthday-of-laredo-texas"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…fear that their future has a cloud  over it.\n\nAnd those small businesses, they account for two out of every three  jobs added to our economy in the last 25 years. They are our engine of  growth.\n\nSo I have heard from small businesses all across Massachusetts, all  across our country, about how they are forcing those businesses to lay  off employees, scale…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…helicopters, the best helicopters in the world, are made by Sikorsky  Aircraft in Stratford, Connecticut, in my district.\n\nI am also proud that Pratt & Whitney produces the F135 engine, the  power plant for the F-35 Joint Strike Fighter, in my district. The  highly skilled workers in this plant are critical for our defense  industrial base, and the rising…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693648/department-of-defense-appropriations-act-2026"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…space and parklands now, before they are lost to us.\n\nThe automobile--\n\nNixon said--       is our worst polluter of the air. Adequate control requires       further advances in engine design and fuel composition.\n\nLittle could he have imagined the electric vehicles of today. But he  said:\n\nWe shall intensify our research, set increasingly strict       standards--…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…have an air pollution problem that is a lot  worse than many of the other States.\n\nDespite Republicans' false claims, the California program does not  ban internal combustion engine trucks. Maintaining the California  program is critical to improve public health outcomes and secure the  right to clean air for everyone. Repealing California's Federal  preemption…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690432/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "…education, but they are also to power our  economy through the inventions that the American mind has been able to  create.\n\nWhy would we stop that? Why would we stop the very engine of our  advancement in the world, the thing that makes us the number one Nation  on Earth? Why would we want to cut the funding off for that? It doesn't  make any sense.\n\nPeople…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688232/democratic-proposals"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…battery they claim will be able to go 3,000 kilometers on only a  5-minute charge.\n\nNow, not everyone loves electric vehicles--my car has a traditional  internal combustion engine--but think of the national security  implications of falling behind in batteries and advanced manufacturing.  We see in Ukraine that the future battlefield is electrified.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…within our own country and around the world from  American leadership.\n\nMr. Speaker, think about what we were able to do with the auto  industry, that arsenal of democracy, that engine of our military might,  the Rosies who filled in because the men were away, fighting and  serving in battle. These are unbelievable and historic tales of bravery  that we should…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…for patients battling terminal  diagnoses for cancer. In fiscal year 2023, the NIH generated almost $93  billion in economic activity--nearly twice the Agency's budget.\n\nThe engine behind all of it is, of course, researchers and  scientists. They are dedicated scientists like my grandfather who right  now are worried that their life's work--the work of…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688264/national-institutes-of-health"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…incentives for replacing old trucks and buses.''\n\nThe result: Some of the most problematic pollutants--smog-      forming nitrogen dioxide and fine particles created by       diesel-engine exhaust and other fossil fuels--declined in the       worst neighborhoods by up to 50 percent in 20 years. Maritime       pollution, particularly in neighborhoods near the…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…don't have to choose between a prescription and rent.\n\nThis is about health, but I want to tell you, for all those doing the  math at home, you cannot have a thriving economic engine without good  healthcare. The two are incompatible. Widespread sickness, illness, and  disease and people can't get their health issues covered, it takes away  from our economic…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…international hub for America's small businesses. Businesses in my  district connect with diverse companies and international markets every  day and are a dynamic part of the economic engine driving southern  California. Over 90,000 small businesses call Orange County home,  including many in Little Saigon, where exporting and importing goods  and working with…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687956/small-business-advocacy-improvements-act-of-2025"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "…enrollment, achieved the coveted R1 status, and made investments  that are transforming Charlotte's education landscape and our  community.\n\nUNC Charlotte has become a powerful engine for economic growth,  driving innovation, workforce development, and research partnerships  that benefit Charlotte and North Carolina.\n\nI am also proud to see her work recognized…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699375/recognizing-chancellor-sharon-gaber"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…there will become clear to all.\n\nFriedman continued, Mr. Speaker, writing: ``Israel, instead of being  seen by Jews as a safe haven from anti-Semitism, will be seen as a new  engine generating it; sane Israelis will line up to immigrate to  Australia and America rather than beckon their fellow Jews to come  Israel's way. That dystopian future is not here…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692485/supporting-israeli-security-and-palestinian-freedom"}, {"senator": "Mike Rounds", "party": "Republican", "sentence": "…disapproval under chapter 8 of title 5, United States Code,       of the rule submitted by the Environmental Protection Agency       relating to ``California State Motor Vehicle and Engine       Pollution Control Standards; Advanced Clean Cars II; Waiver       of Preemption; Notice of Decision''.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691571/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…frontier, raised up a great civilization from the  wilderness, and planted our flag on the Moon. It was American genius  that connected the world, first  through the great steam engine, spanning this continent from coast to  coast, then through the miracle of flight. We gave humanity the  telephone, the internet, the skyscraper, modern technology,  electricity,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…H.R. 3383, the  Increasing Investor Opportunities Act.\n\nOur country did not get to the top of the world by playing it safe.  We got here by putting capital to work, the very engine that former Fed  Chair Alan Greenspan wrote about in ``Capitalism in America.''\n\nOur capital markets are the fuel and, ultimately, the rocket boosters  for innovation, and…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697833/increasing-investor-opportunities-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…brighter than ever. With the economic  policies of the One Big Beautiful Bill Act to lower costs, increase  wages, and expand job opportunities, I know America's industrial engine  will be unleashed to deliver a breadth of career empowerment not seen  at any time in our Nation's history.\n\nMadam Speaker, I yield to the gentleman from Georgia  (Mr. Carter).…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694791/promises-made-promises-kept"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…offer critical resources such as training, marketing,  and networking. The Greater Hernando County Chamber of Commerce  embodies these principles and has served as a vital engine of  prosperity for generations.\n\nThe Chamber traces its origins to 1925, when local leaders first  organized a community chamber under the guidance of Frederick  Williamson,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695644/recognizing-the-greater-hernando-county-chamber-of-commerce"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…Potential Act, which will support a robust  natural gas industry in the U.S. and meet President Trump's goal of  achieving American energy dominance.\n\nNatural gas is a major engine of economic growth, particularly in  Oklahoma. LNG exports alone in the U.S. support more than 273,000 U.S.  jobs and contribute $40 billion to our GDP.\n\nThis sector is a lifeline…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697092/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…families' pockets. This is how we need to deal with the  energy crunch that we are facing.\n\nPlus, this creates more American jobs, brings jobs back to our  country. Coal is an engine of our American economy, and the Democrats  continue to treat it as an enemy. Everything we do in this country  relies on energy. We need more energy, not less. Steel producers,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689762/coal"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…Mr. BURLISON. Will the gentleman yield?\n\nMr. BURLISON. Right.\n\nMr. BURLISON. Absolutely. Any kind of reform that we are looking at,  if it doesn't include that as the core engine, we are not getting  anywhere.\n\nMr. BURLISON. Absolutely. I mean, when you give the choice back to  the people, suddenly the doctors are going to start paying attention,  as…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…State- chartered and national banks. There are about 5,000 banks; 4,000 of  them are chartered at the State level and only 1,000 at the Federal  level. This system has been the engine for American economic growth,  providing businesses of all sizes with diverse financial services  tailored to local needs.\n\nIn Wyoming, we have seen firsthand how State-chartered…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691665/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Evacuation System (HERCULES)       recovery vehicles and fifty (50) AGT1500 M1A1 tank engines.       The following non-MDE items will also be included: M88A2 and       tank engine follow-on support; 120 mm ammunition rounds; and       other related elements of logistics and program support. The       estimated total cost of the new items is $5.83 billion.…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694372/arms-sales-notification"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…boldface lie.\n\nFor anyone who is really interested just in sort of the academics of  what goes on here, I talked about this a couple of weeks ago. If you  have your search engine, look up ``AI Review of Congressional  Speeches.'' There is an academic group.\n\nThis is in like Nature, so it is a peer-reviewed article going back  over 140 years of congressional…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…I refer to them--could  program the money so that if you are driving a hybrid vehicle but still  need to buy gas from time to time to keep your hybrid internal  combustion engine running, you could pay $2 a gallon for gas. If you  are driving a pickup truck that is considered a gas guzzler, you could  pay $10 a gallon.\n\nIt is programmable money. You…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…United States remains  the most entrepreneurial country in the world, where the next great  companies are founded and funded.\n\nIt is often said that small businesses are the engine of the American  economy, and that is an absolute truth. Small businesses make up 99  percent of U.S. employers, and they are the driving force behind the  creation of a majority…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697190/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…emergency room visit and all the care and whatnot, so you share  and defray that cost across people often in a faith-based organization,  but sometimes secular.\n\nIsn't that the engine of what we are talking about?\n\nMr. ROY. Then, would it not require us to simply say that you can  leave ObamaCare in place? That can sit there and keep doing what it is  doing,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…addresses that occur in the month of January, including  Greenwood's, where I attended Mayor Mark Myers' 14th state of the city  address.\n\nI visited with the leadership of Cummins Engine Company,  headquartered in the district. I toured their cutting-edge engineering  facility at their Cummins Engine plant.\n\nI toured Rolls Royce and their massive aircraft engine…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688262/return-the-united-states-to-a-balanced-budget"}]