[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…breeze.\n\nA sentry on deck peered into the darkness, catching sight       of the approaching boats.\n\n``Who comes there?'' he called.\n\nThe men in the boats bristled at the sentry's English       accent.\n\n``We mean to come aboard,'' replied a big man in the lead       boat. ``You cannot,'' the sentry shouted back. ``You cannot       come aboard.''\n\nA moment later,…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…Constitution.\n\nI was born and raised down the road from the family farm that my  great-grandfather built when he came to this country. He was 16 years  old. He didn't speak a word of English, but he believed in the American  Dream. He raised my grandfather, Sam, on that farm.\n\nMy grandfather, Sam, was an economic patriot. He really believed that  your word is…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689083/economic-populism"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…In  reality, this bill manipulates labor law to decrease employees' earning  power and allow employers to skirt minimum wage requirements.\n\nMr. Speaker, I was a high school English teacher, and I taught my  students about irony. This bill is more aptly titled the Republican  invent new ways to pay workers less bill.\n\nHere is a closer look at the bill.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698962/tipped-employee-protection-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…rise today to recognize Sarah Dully,  Rhode Island's 2026 Teacher of the Year.\n\nMs. Dully began her work as an educator in 2012. She joined  Narragansett High School as an English language arts teacher in 2020,  where she is admired and respected by her fellow teachers, students,  and administrators alike. At Narragansett, she also serves as the  National…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697432/recognizing-sarah-dully-rhode-island-teacher-of-the-year"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…to go there. My father escaped  Germany in 1935 and came to America after seeing what was to come in  those same Gestapo-type tactics in Germany. He came here speaking no  English, having not much more than the shirt on his back and knowing  virtually no one. If he had stayed in Germany, he would have seen a  paramilitary force going door to door, rounding…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699087/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…which provides funding for schools with  high populations of low-income students; the McKinney-Vento grant  program for youth experiencing homelessness; grant programs for English  learners, rural schools, literary initiatives; and more.\n\nPrograms like TRIO and GEAR UP help underserved students access and  succeed in higher education, and they moved…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697292/trump-administration-dismantling-department-of-education"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…guaranteeing that  low-income areas will be at a disadvantage, so we put money in Title I.  ED helps low-income students, racial minorities, dealing with  achievement gaps, English as a Second Language, and students with  disabilities. On higher education, they deal with access, Pell grants,  and student loans. Some of the proponents of the elimination…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…human cost of these reckless  firings and funding freezes. I am sure the constituents of my  colleagues will make it clear to them even if they don't listen to us  today.\n\n(English translation of the statement made in Spanish by Mr. Vasquez  is as follows:)\n\nMr. Speaker, I want to recognize a group of individuals who are the  life force of our nation:…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687984/dire-consequences-of-funding-freeze-and-mass-firings"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…without prior       notice, causing severe disruption and significant damage to       the affected businesses.\n\nDisturbingly, reports indicate that individuals with       limited English proficiency or those unable to immediately       provide documentation verifying their legal status were       detained or forcibly removed on the spot. These actions have…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…could       have happened to me. I am a mother of two children--one born       in Haiti and one born here in the U.S. As soon as I was able,       I enrolled in school to learn English and began working to       support my family.\n\nI am a Certified Nursing Assistant (CNA), and I care for my       patients with great joy, pride, and dedication. My patients…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…anniversary of Otis P. Graves Elementary School in  my district.\n\nIts dual language model develops bilingual and biliterate students  that can succeed and be proficient in English and Spanish, opening  future opportunities in an increasingly global society.\n\nEven through the challenging moments our community has faced this  year, this school has remained…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697323/9999"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…Since 2023, February has been recognized by the State of Hawaii as  Mahina Olelo Hawaii, or Hawaiian Language Month. Following the  colonization of the Hawaiian Islands by English-speaking westerners,  the Hawaiian language, also known as Olelo Hawaii, was nearly driven to  extinction. After the illegal overthrow of the Hawaiian Kingdom in  1893, a…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700306/hawaiian-language-month"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…they had that capacity amidst this enormous suffering to see a  future and want to be part of it--dead.\n\nMona, who was the woman, was an engineering student, spoke fluent  English, volunteered with orphans, and she was out for a break with her  friend. Mariam Salah, she was a young painter who grew up in a refugee  camp. She painted murals and dreamed…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694438/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…two parts to it. One is insisting  upon legal accountability for people who do wrong. The other part of it  is due process, which may be the two most beautiful words in the  English language, certainly the two most beautiful words in the  Constitution of the United States. It is due process that protects all  of our freedoms and our rights against the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…Education is responsible for protecting the civil  rights of students, supporting students from low-income backgrounds,  developing and preparing educators, providing resources for English  language learners, collecting statistics on enrollment, staffing, and  crime in schools, and for the $1.6 trillion Federal student loan  program.\n\nMany parents are concerned…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689644/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…No offensive  expedition without congressional approval.\n\nSt. George Tucker, a Revolutionary War-era law professor, wrote in  1803 of how our Constitution diverged from the English tradition.\n\nHe wrote:\n\nIn England the right of making war is in the King. . . .       With us, the representatives of the people, have the right to       decide this important…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Aitken.  This Bible became known as the Bible of the Revolution.\n\nThis joint resolution will formally designate September 12 as the day  of the Bible to honor the first complete English-language Bible that  was produced in America. This is a historic moment.\n\nThis resolution also encourages our schools and other institutions to  observe this day and focus…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694805/critical-supply-chains"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…Middle East, throughout Africa, and throughout Asia.  Recently, we relocated several B-2 bombers to respond to Iran's  aggression toward demonstrators.\n\nThere aren't words in English to overstate the importance of the  Diego Garcia military installation.\n\nNow, the United Kingdom owns the Chagos Islands. In 1814, the Chagos  Islands were owned by France,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699482/9999"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…advanced degree, it is easy to see why.\n\nA study conducted by the Naval Postgraduate School, which analyzed 1  million DOD contracts, found less than 3  percent were in plain English. Most were rated difficult or very  difficult to read. There is no other way to describe it. It is  unacceptable.\n\nFurthermore, of the 33 million small businesses operating…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691851/plain-language-in-contracting-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…France, successfully       scaling the cliffs, despite a withering German defensive       barrage.\n\n(6) Pointe du Hoc, a rugged 100-foot-high coastal promenade       along the English Channel was located between the American       landing beaches, Omaha and Utah. It was heavily defended by       the Germans and the mission of Colonel James Earl Rudder's…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…get less trade.\n\nThere was also this idea that you didn't do taxation without  representation. That idea goes not only back to our American  Revolution, it goes back to the English civil war as well.\n\nIt goes back to probably Magna Carta. I mean, for hundreds of years  the English were arguing of the supremacy of Parliament, that  Parliament would be…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…I thank the gentleman for his  remarks.\n\nMr. MOORE of Utah. Mr. Speaker, this is going to be a special hour,  thanks to the gentleman from California.\n\nMr. MOORE of Utah. (English translation of the statements made in  Korean is as follows:)\n\nYoung Oak Kim Sister\n\nThank you!\n\nYou did well!\n\nYou did well!\n\nGim Yeong-ok uiwon-nim\n\nGamsahamnida\n\nSugohasyeosseumnida…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698737/9999"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…their home near  Justin's family farm. Following graduation, Michelle began teaching at  Tipton Elementary, where she has now served for over 29 years. In  addition to teaching English, she offers an agriculture elective that  introduces students to FFA and Supervised Agricultural Experience (SAE)  projects. Her class includes hands-on lessons about dairy…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698441/recognizing-michelle-nuckols"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…voting for the farm bill.\n\nI have got to say there are only a handful of us in this Chamber who  are willing to say no. ``No'' is the most powerful and important word  in the English language when it is used the right way, which I would  say in this body should be used most of the time.\n\nRonald Reagan famously said, I think it was on Johnny Carson's ``The…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…over American companies,  especially when it comes to cloud services for technologies that would  otherwise not be accessible in physical form. In other words, and in  plain English, you can't buy it, so you shouldn't be able to rent it  either.\n\nThe Remote Access Security Act fixes this problem by giving the  administration--all administrations--the…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698859/remote-access-security-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…areas of American life; and\n\nWhereas, the first 42 Jewish immigrants arrived in Savannah, Georgia,  on July 11, 1733, making Savannah the largest Jewish settlement in the  English colonies in North America at the time; and\n\nWhereas, the belief in the greatness of the American way of life, the  freedoms enshrined in American law and jurisprudence, and…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688926/designating-april-29-as-endjewhatred-day"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Republicans and I think the American people know what too often happens  when government decides to get involved.\n\nReagan said 40 years ago:\n\n[T]he nine most terrifying words in the English language       are: I'm from the government, and I'm here to help.\n\nWhen I am talking to business owners in South Dakota, I often tell  them to let me know how we can help,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697344/biden-administration"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…County, Mr. Matthys graduated from El Campo  High School in 1965, later earning degrees from Wharton County Junior  College and the University of Houston, including a BA in English and  Journalism and a master's in Curriculum and Instruction. In 1967, he  married Pamela, his high school sweetheart, and together they built a  loving family and a legacy…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690584/recognizing-the-retirement-of-bill-matthys"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…for Gulf Middle School since  2016. She has helped with the school's tutoring program, volunteers  weekly in the free school store (the Treasure Chest), helped with  securing English as a Second Language tutors for Gulf Middle School  families, and coordinated a free weekly meal to serve families and the  community. Mary has also been a big supporter of…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691273/recognizing-mary-miller"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…academic and personal.  Their work is vital, and their influence extends beyond the classroom.\n\nThis year, Pennsylvania has special reason to celebrate. Ashlie  Crosson, an English teacher of Mifflin County High School, has been  named the 2025 National Teacher of the Year. A first-generation college  student, Ms. Crosson earned degrees from Susquehanna…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690925/recognizing-ahslie-crosson-during-national-teacher-appreciation-week"}]