[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Freddie Mac, from international banking safety reviews, from  international economic magazines, from the chief risk officer of  Goldman Sachs, from the head of the Bank of England. I mean, you can  just go on and on. The warnings are piling, piling, piling up.\n\nAnd as Ernest Hemingway said about going broke, ``it happens  gradually, and then all at…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…COURTNEY. Madam Speaker, on August 22, the Trump administration,  with absolutely no warning, issued a halt work order to an offshore  wind project off the coast of southern New England that has been in the  works for 9 years.\n\nThe developers of this project have invested close to $4 billion,  employed thousands of workers, and installed 45 out of 65 wind…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695066/halt-work-orders"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Article I of the Constitution on its head.\n\nThese cuts are not only felt in Washington, D.C. They affect all of  our constituents.\n\nJust a few months ago, states across New England, including my state  of Connecticut, were ready to begin an ambitious and collaborative  effort to increase energy transmission capacity across our region, to  build resiliency…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694862/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…electricity  prices in the Nation, with an average cost of 28.16 cents per kilowatt- hour, compared to the national average of 16.26 cents per kilowatt- hour. Connecticut and New England as a whole get a significant share of  our electricity from cheaper Eastern Canadian hydropower. The 10- percent tariffs proposed on energy resources from Canada will directly…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689487/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…times, staff       reductions, and the potential closure of programs and       facilities,'' Daniel Keenan, vice president of government       relations at Trinity Health of New England, stated in emailed       comments.\n\nKeenan pointed to emergency rooms as an example. When       people don't have coverage, they turn to emergency       departments for basic…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Parliament was furious. An  enormous bounty on the heads of the men in those longboats was offered  by the King--over $100,000 in today's money.\n\nAnd officials were sent from England to go and put on a trial. Find  these men, try them, and hang them. No one would talk.\n\nAbout 60,000 people lived in Rhode Island back then, but it was a  close community,…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…because it is a landmark  environmental protection law that literally safeguards Massachusetts,  Connecticut, Rhode Island, Pennsylvania, New York, and other States of  New England against the pollution generated in Ohio and other  Midwestern States that is brought by the prevailing winds.\n\nThe polluters didn't create those prevailing winds, but, nonetheless,…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689118/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…enforcement--Deerfield and Springfield Police,  and the Hampden, Hampshire, and Franklin County Sheriff's Departments-- for keeping us safe along the march.\n\nI thank our media sponsors--New England Public Media and WRSI 93.9,  The River--for broadcasting the walk and raising awareness among people  in western Massachusetts.\n\nI am so grateful to my friend, Andrew Morehouse,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697684/16th-annual-march-for-the-food-bank"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…advocate for organized labor and joined the  Laborers' International Union of North America as a field  representative and organizer, eventually becoming administrator of the  New England Laborers' Labor-Management Cooperation Trust.\n\nDonny started his public service long before we linked up again in  the State senate. He began working for the late Lieutenant…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691451/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…billions of dollars of private investment and years of permitting  approval.\n\nTogether, these projects will bring in thousands of new megawatts of  power to consumers in New England, New York, and Virginia. Trump's halt  work order cited vague, nonspecific national security concerns as  justification for this antiworker, anti-ratepayer, and antigrowth…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698954/china-is-not-scamming-europe-and-united-states-on-wind-power"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Prime Minister Neville Chamberlain left his meeting  with Adolf Hitler in Munich. And after surrendering Czechoslovakia in  exchange for a peace pledge, when he returned to England, Chamberlain  waved about a piece of paper with Hitler's promise and declared,  ``Peace in our time.'' In reality, it was the beginning of the  capitulation that would lead…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…wasn't that 100 percent of Americans  believed in democracy. Thirty percent were for tyranny and monarchy. It  was what they knew or they had a financial tie or a family tie to  England or maybe they were worried that democracy would be too messy.  It wasn't a foregone conclusion that democracy would be the choice.\n\nEvery generation has to answer the question…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696334/trump-administration"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…breathing healthier.\n\nLet me read just briefly from their findings, summarized in a  National Geographic article from March of 2015 that said:\n\nIn the study published in the New England Journal of       Medicine, researchers followed 2,000 kids from five southern       California cities with some of the worst air, including Long       Beach, Riverside, San…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…who says he wants to be one.\n\nTurning our back on Ukraine goes against everything Americans have  fought and died for since we declared our independence from a monarch  in England. Supporting Russian aggression against Ukraine sends a  dangerous message to our allies around the world: The United States is  no longer a reliable friend. You are on your…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…during his  youth, Prince Kuhio was also a notable athlete in football, rowing,  track, cycling, horsemanship, and marksmanship. He later studied abroad  in California and England. During his travels, he was hosted as a guest  of the Japanese Government. Following the illegal overthrow of the  Hawaiian Kingdom in 1893, Prince Kuhio joined an unsuccessful…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695588/hawaiian-history-month"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…important to look at this chart. This is from the EIA. If you look at  the top 12--and as the gentleman from North Carolina pointed out about  his legislation, especially in New England, the States up there, look  at what has happened here. Look at California, Hawaii, Maine,  Massachusetts, Connecticut, and Rhode Island in the top six. We can see  these prices…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698073/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…downtown visitors center, and a replica of a famous sailing ship, the  Friendship of Salem. The site attracts over 800,000 visitors annually  and showcases over 600 years of New England's maritime history.\n\nSince most historical sites focus on a singular historical feature,  designating Salem Maritime as a national historic park would align with  the naming…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691015/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…they found it. Scouting  America has helped build future leaders by combining educational  activities and lifelong values with fun. Scouting founder, Lord Baden- Powell of England, defined Scouting as a game with a purpose. Through  over a century of experience, we know that helping youth is a key to  building a more conscientious, responsible, and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699723/national-scouting-day"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…countries of concern and entities of concern. In my  Democratic colleagues' minds, it appears that gifts from Russia, China,  and Iran are the exact same gifts as those from England.\n\nI remind everyone here that the DETERRENT Act uses a tailored list of  countries and individuals pulled from existing law that have a proven  track record of being security…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…gorgeous scenery and  year-round outdoor recreation. The beautifully maintained Union Meeting  House, built nearly two centuries ago, is a wonderful example of  traditional New England church architecture and a worthy addition to  the National Register of Historic Places.\n\nAnother major landmark is the Mill Pond Dam, built in 1830 where the  Orange River…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693257/town-of-whiting-200th-anniversary"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "Ms. COLLINS. Mr. President, in 1925, business and government leaders  from throughout New England came together in Poland Springs, ME, to  develop a strategy to reverse the decline in our traditional industries  and our communities. Today, we celebrate a century of accomplishments…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696025/100th-anniversary-of-the-new-england-council"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…there is a boy competing in a female  category.\n\nThere were 39 times when a girl was denied an opportunity to advance  to finals, 17 times when a girl was denied an All-New England honor, 11  times when a girl lost a meet record, and 23 girls--23--were denied a  Connecticut State Open team championship.\n\nIn other words, allowing these two boys to compete…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…congressional approval.\n\nSt. George Tucker, a Revolutionary War-era law professor, wrote in  1803 of how our Constitution diverged from the English tradition.\n\nHe wrote:\n\nIn England the right of making war is in the King. . . .       With us, the representatives of the people, have the right to       decide this important question.\n\nIt is without question…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…service, in law enforcement, in education, in infrastructure, it is  important that this body do its principal job.\n\nThe power of the purse is something that--going back to old England-- we fought for hundreds of years to wrest away from Kings. When we began  this process, it was not at all clear to me that this article I body  would succeed in exercising…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699444/appropriations"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Once you demonstrate the  capability, you have all the power.\n\nThe reality is that in the fall, I traveled with fellow Financial  Services Committee members to the Bank of England. I met with them, and  they are developing a central bank digital currency. They know that  their legislature would have to act to impose it on the citizens of the  United…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "French Hill", "party": "Republican", "sentence": "…graduated from Catholic High School at age  in 1941 and is currently the school's oldest living alumnus.\n\nHe is a World War II veteran. John was drafted at 18 and served in  England, Belgium, Germany, France, and the Netherlands as an Army  corporal in the field artillery attachment of the 5th Army Division,  the 9th Army spearhead, the 5th Armored Division,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688942/keaton-beasley-teaches-importance-of-financial-literacy"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Franklin County resident Sam Worley as he celebrated  his 104th birthday this past weekend.\n\nIn 1942, Sam was drafted into the U.S. Air Force and by 1943 was  stationed in England as a member of the Eighth Air Force's First Bomb  Group.\n\nSam was tasked with decoding incoming orders for American bombers and  their fighter plane escorts, which is a critical…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692145/doge-rescissions-package"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…the American  Revolution.\n\nThis became the rallying cry of American patriots: No taxation  without representation. The American Patriots thought that a distant  Parliament in England where they had no representation had no right to  tax them.\n\nThis was the rallying cry: ``No taxation without representation.''\n\nOur Founding Fathers believed so strongly…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…inns  evolved into year-round abodes that contribute to Sebago's image as a  well-known resort area in southwestern Maine.\n\nSebago is home to many examples of charming New England architecture  on the National Register of Places. One of the most fascinating is the  Dyke Mountain Annex. It was built between 1906 and 1908 and originally  was part of the…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699146/town-of-sebago-200th-anniversary"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…back to the 55th Pursuit Group which  was first constituted in November of 1940 and later activated at  Hamilton Field, California, in January of 1941. The 55th deployed to  England in 1943 flying P-38 Lightning and P-51 Mustang fighter aircraft  as part of the ``Mighty'' Eighth Air Force. While providing escort for  allied bombing missions during World…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689070/recognizing-the-55th-wing-85th-birthday"}]