[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…prepare and to respond to a crisis that will take  place, when we help implement the Humanitarian Mine Action Program,  this provides significant training, readiness, and enhanced benefits  even to our United States military. It contributes to alleviating the  worldwide problem of explosive remnants of war, which includes  landmines, unexploded ordnance,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…communities in providing care, not less.\n\nMr. Speaker, it's not too late to address this health care crisis of  Republicans' making. We can start by permanently extending the enhanced  premium tax credits under the Affordable Care Act to prevent millions  more from seeing their premiums skyrocket.\n\nThis Rural Health Day, I urge my colleagues on the other…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697097/national-rural-health-month"}, {"senator": "Diana DeGette", "party": "Democrat", "sentence": "…President Trump  and congressional Republicans did nothing. They could have had a vote  in December, yet they blocked Democratic efforts to extend the  Affordable Care Act's enhanced premium tax credits. They looked  Americans in the eye and said no.\n\nWe have an opportunity to fix this right now. This week, we can pass  the bill that would extend the ACA's…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698646/extend-enhanced-premium-tax-credit"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…her husband in  their home, it is tragic; it is unacceptable. And we would be foolish  not to take notice.\n\nThe House acted on a bipartisan basis to provide new funding for  enhanced Member security this past July. Even before the June shooting  of Minnesota State officials, the Senate Sergeant at Arms proposed a  program for enhanced security options…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695686/authorizing-the-use-of-funds-from-the-senators-official-personnel-and-office-expense-account-for-security-enhancements-and-services-provided-to-senators"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Trump let them out of jail.\n\nThen, of course, we have the promise that Trump would replace  ObamaCare with something better. Instead of something better,  Republicans let the enhanced ACA tax credits expire at the end of 2025,  which means that now people are paying more. Tens of thousands of  people in Massachusetts alone have now dropped coverage, meaning…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…single day, and we want to have a vote on extending the tax  credits, but Republicans denied that in the Rules Committee.\n\nRepublicans could be bringing up a bill to make the enhanced premium  tax credits permanent, but they are not. Instead, what they did is they  brought a bill to the floor to make tax cuts for multimillionaires and  billionaires permanent.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Federal workforce, including  many civilian employees at DOD who have long been protected by  collective bargaining. For decades, collective bargaining agreements at  DOD have enhanced transparency and allowed employees to perform their  work free from political interference. The Trump administration's move  to limit these protections undermines employee…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…program for children.\n\nMr. Speaker, as you know, I am talking about Social Security. More  alarming, Mr. Speaker, is that it has been more than 50 years since  Congress has enhanced Social Security for the citizens of this great  country.\n\nWhat does that mean? That means that more than 70 million Social  Security recipients have not seen an enhancement…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690830/enhancing-social-security"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…he has placed on America, one of the most important is in the big,  ugly bill. If you take a look at the big, ugly bill and you get into  the details, well, there are the enhanced tax credits for the  Affordable Care Act, and we will talk about that in a few moments; but  also in the big, ugly bill is the big problem coming up at the end of  this 2026…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698666/protecting-healthcare-for-millions-of-americans"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…Act's marketplace. We know it as  Nevada Health Link. Nearly 95,000 of those families are able to afford  their premiums using Nevada Health Link thanks to what we call the  enhanced premium tax credits.\n\nSo I want to be clear because there is a lot of misunderstanding  here. It is not a handout. It isn't welfare. It is just a tax break  that helps lower…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695919/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…extraction if we invest now. This bill completely ignores the role of  recycling to strengthen our supply chains.\n\nAnother way to strengthen these supply chains is through enhanced  transparency. Last Congress, I introduced the bipartisan Critical  Materials TRACE Act to improve supply chain visibility. Transparency  can help drive responsible sourcing…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699692/critical-mineral-dominance-act"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Dougherty County, and collaborated with the City of Albany to combat  homelessness, successfully transitioning over 15 families to  sustainable living.\n\nOverseer Carter also enhanced economic empowerment through projects  like the Monumental Development Center and Fluff-n-Fold  Laundromat, fostering job creation for local residents. Even amidst  significant…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Pittman-Robertson Wildlife Restoration Act provides funding to  states for five distinct purposes: program administration, wildlife  restoration, basic hunter education and safety, enhanced hunter  education and safety grants and multistate conservation grants. In  general, D.C. is not eligible for funding under this Act.\n\nThe Dingell-Johnson Sport Fish Restoration…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700089/introduction-of-the-pittman-robertson-wildlife-restoration-act-and-dingell-johnson-sport-fish-restoration-act-district-of-columbia-equality-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…health  insurance, that their premiums will get a helping hand.\n\nIt takes 13 Republicans to join the Democrats for that to happen. It  has to be bipartisan.\n\nAs a result of the enhanced premium tax credits, the number of  Americans covered in the ACA marketplace plans has increased from 11  million in the year 2020 to 24 million this year, including my waitress…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Lauren Underwood", "party": "Democrat", "sentence": "…recommit this bill back to committee. If the House rules permitted, I  would have offered the motion with an important amendment to this bill.\n\nMy amendment would extend the enhanced premium tax credits for 3  years to do what this Republican bill fails to do and help American  families afford their healthcare.\n\nMs. UNDERWOOD. Mr. Speaker, I hope my colleagues…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698394/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…chain risk evaluations, supply chain risk       management planning, or risk audits; or\n\n(C) operational best practices, planning, and supplier       partnerships that enable enhanced resilience of a critical       supply chain during a supply chain shock, including response,       repair, recovery, reconstruction, insurance, or continuity.\n\n(10) Domestic…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…War, such as increased coordination between the military and the FAA on  aircraft safety matters, better safety management systems and reporting  for military aircraft, and enhanced training for military pilots  operating in congested airspace.\n\nAll of these flaws can be easily fixed if the committees of  jurisdiction in the House are afforded the opportunity…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700107/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…closed in 1992, she transferred to Davis-Monthan AFB in Tucson,  Arizona. There, she served in leadership roles, completed a Community  College Air Force (CCAF) degree, and enhanced pathology specimen  operations. Following the birth of her second and third child, she  moved to Cannon AFB, New Mexico in January 1996, where she managed the  Drug Urinalysis…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696274/recognizing-technical-sergeant-martha-socorro-ybarra-usaf-retired-with-a-congressional-veteran-commendation"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Most of us know it as  ObamaCare.\n\nThis chart is hard to read from a distance. ACA goes into effect. I  want us to step all the way back out to where we are here when the  enhanced subsidies--these are subsidies on top of subsidies--is $40  billion. Over here, the basic subsidies, the growth of the subsidies  since the pandemic, is another $75 billion.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…worked tirelessly to help  Idahoans where she could and serve their needs. Linda trained under one  of the best caseworkers in Idaho and not only carried on that legacy  but enhanced it. She  never cut corners when it came to constituent service.\n\nAs my Casework Director, she instilled the same standard across my  team. One of the things I'm most proud…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692691/recognizing-linda-culvers-retirement"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…rising unaffordability of coverage. First, in the American  Rescue Plan of 2021 and then again in the Inflation Reduction Act of  2023, Democrats sent temporary taxpayer-funded enhanced premium tax  credits directly to the coffers of big insurance plans.\n\nThey did this without a single Republican vote of support. On both  occasions, Democrats chose to make…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…safety needs of our communities.\n\nAccurate workforce data is not just numbers. It is the foundation for  equitable funding, targeted training, disaster responsiveness, and  enhanced workplace safety. It empowers us to stand behind the men and  women who respond to more than 22 million emergencies each year.\n\nMr. Speaker, passing the EMS Counts Act is…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693039/supporting-our-first-responders"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…will now reap the  benefits of this achievement, including expanded educational  opportunities, strengthened economic development, improved access to  health care, and an enhanced quality of life for countless families and  businesses.\n\nTombigbee Electric Cooperative has demonstrated that when vision,  leadership, and commitment to community are combined,…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696050/recognizing-the-tombigbee-electric-cooperatives-achievements"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Republicans doubled the child tax credit from $1,000 to $2,000. That is  something that has been incredibly bipartisan. Democrats, in their own  version of reconciliation, have enhanced that, as well.\n\nI lead the Family First Act, which is another enhancement of the  child tax credit, and I am looking forward to, hopefully, getting that  passed through. That…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…pretenses. We need to do better for our  constituents who need access to affordable healthcare.\n\nWell, our Democratic colleagues are calling for a clean extension of  the enhanced ObamaCare subsidies because they don't want any changes in  what I have described here, and that is the heart of the problem. We  know there is a whole host of problems with…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697929/healthcare"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…subsidies in the ACA. Let's call it ObamaCare because that is  the common vernacular, but it is the ACA. We are having the debate  because the Democrats actually did these enhanced subsidies on top of  the subsidies and those subsidies expire.\n\nLet me do this one backward, so there is a little more understanding  of the line.\n\nHow much of the healthcare…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…technological and economic       competitiveness of industry and production in the United       States.\n\n``(2) Expand and increase the stability of supply chains       through enhanced domestic production, nearshoring, and       cooperation with allies.\n\n``(3) Achieve measurable greenhouse gas or directly related       copollutant emissions reductions in…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…that their healthcare is now cheaper today than it was when they passed  this disastrous bill. You won't. You won't find one.\n\nIn fact, the sky is falling because of their enhanced premium tax  credits that they made temporary because they decided to make permanent  tax benefits for wealthy environmentalists who support them. That is  why we are where…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Energy Subcommittee of the  Committee on Energy and Commerce.\n\nMr. GUTHRIE. Mr. Chair, I yield myself the balance of my time.\n\nMr. Chair, I appreciate my friend bringing up the enhanced or COVID- era premium tax credits that are expiring at the end of this month.  Since we are talking energy tonight, we need to understand that they  were set to expire, without…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…proud that our bill permanently extends all of the individual  tax relief from the Tax Cuts and Jobs Act. That means lower tax rates  for every income level, permanently, an enhanced $2,200 child tax  credit that is now linked to inflation, and the higher standard  deduction.\n\nAnd we did more than that. We included no tax on overtime, no tax on  tips,…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693279/one-big-beautiful-bill-act"}]