[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Ms. BONAMICI. Mr. Speaker, I thank Representative Figures for  yielding.\n\nI rise today in support of H.R. 3962, the Enhancing, Science,  Treatment, and Upkeep of America's Resilient and Important Estuarine  Systems Act, or ESTUARIES Act.\n\nEstuaries rank among the most productive ecosystems in the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698176/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Committee, and I hope it will be  signed into law this Congress.\n\nPassing this legislation is a proactive step toward safeguarding our  citizens from the unimaginable. By enhancing our detection and response  capabilities, we deter adversaries from contemplating radiological or  nuclear attacks and reassure the public that our commitment to their  safety…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688698/securing-the-cities-improvement-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…their role in  protecting public safety.\n\nIn honor of Pretrial, Probation and Parole Supervision Week 2025,  whose theme is ``Heroes Behind the Mission: Transforming Lives,  Enhancing Public Safety,'' we salute all those who have chosen this  important career. In the District of Columbia, we especially thank the  employees of the Court Services and Offender…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693630/recognizing-the-nations-community-supervision-professionals"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…trade, investment, and connectivity.  The recent summit in Washington underscored the mutual benefits of  deeper cooperation between the United States and Central Asia from  enhancing supply chain resilience and diversifying access to critical  minerals, to fostering people-to-people exchanges and educational  partnerships.\n\nLooking ahead, we hope to build…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696589/welcoming-the-positive-outcomes-of-the-c51-summit-and-us-central-asia-partnership"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…stand here and support this  bill along with my amazing colleagues, Representative LaLota and  Representative Morrison.\n\nMr. Speaker, I recognize the indispensable role in enhancing  collaboration between the Small Business Administration and the  Department of Energy, all in the name of improving research and  development efforts.\n\nLet's not forget…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687907/doe-and-sba-research-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…review that said you are doing a  fantastic job.\n\nOr think about Food and Drug Administration. Their job is to review,  among other things, medications that can provide life-enhancing,  lifesaving, life-extending, pain-relieving medications that Americans  are going to need and can benefit by. The sooner that work of  investigation gets done, the sooner…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688257/department-of-health-and-human-services"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "Mr. MEEKS. Mr. Speaker, I rise today in support of my bill, H.R.  3357, the Enhancing Multi-Class Share Disclosures Act.\n\nMr. Speaker, I thank Chairman Hill and Ranking Member Waters for  their leadership and efforts to bring my bill to the floor today.\n\nPublicly…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693912/enhancing-multi-class-share-disclosures-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…longer able to be  employed.\n\nThe stories are powerful, and they are persuasive. They depict the  scope and impact of this act, if it were passed, in lifesaving and  life-enhancing benefits, and what it will mean to the tens of thousands  of veterans across this great Nation.\n\nIn fact, these veterans and their families--think of their families-- deserve…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…and allow clean energy to compete fairly and fully-- then rising demand can be met with falling costs and less volatility.  Infrastructure will be built more intelligently, enhancing reliability  rather than undermining reliability.\n\nAgain, this is not ideology. It is math. It is common sense.\n\nToday, along with my friend from Illinois (Mr. Casten), with…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700230/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…help out the local grocery store, the  pharmacy, and, most importantly, the individual families in that  region.\n\nMr. Speaker, I ask that Republicans stand up to join us in enhancing  Social Security, not cutting it.", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688950/it-has-been-over-50-years-since-congress-has-enhanced-social-security"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…demand in the  next few years is through cleaner, cheaper power that is waiting to  come onto the grid--wind, batteries, distributed energy sources, demand  response, grid-enhancing technologies, and other solutions.\n\nThis is an incoherent energy policy from the Trump administration.  You say you want more power. We need more power. We have AI data…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695752/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Congress from the Western part of this Nation fully  understand and appreciate what it means to have coordinated interagency  activities on behalf of our competitive abilities. Enhancing this type  of collaboration between the Department of Energy and the National  Aeronautics and Space Administration will have a multiplier effect on  the creative, innovative,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688987/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…solutions that the committee has refused to  take up this year. That is another reason electric bills are so high.  There are solutions like energy storage, demand response, grid- enhancing technologies, and regional and interregional coordination  that can provide reliability at a lower price with less pollution.\n\nRepublicans also don't want us to know that,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…important bipartisan legislation would cement the  responsibilities of the National Telecommunications and Information  Administration, or NTIA, by codifying, renaming, and enhancing the work  of its Office of Policy Analysis and Development, which plays a  critical role in shaping our Nation's telecommunications and  information objectives.\n\nNTIA is…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693498/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…from that  allows the licensee to fund these processes, but new projects are  completely sourced by the developers.\n\nThis commonsense, bipartisan bill takes the first step by enhancing  transparency and tracking progress on any given licensing process for  all parties involved.\n\nI look forward to continuing to work with my colleagues on  comprehensive,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693476/hydropower-licensing-transparency-act"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…contested  and denied battle space by peer adversary capabilities and malign  influence. We will enable leaders to make informed decisions in an  increasingly complex world, enhancing the U.S. military's lethality  across the board.\n\nFinally, this bill, coupled with reconciliation, is just the  beginning of the increased resourcing needed to ensure our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695148/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…professionalism and commitment to service and community.\n\nDeputy Blair is known by others for his expertise and highly trained  skill set, as well as for his dedication to enhancing trust between law  enforcement and community members to prevent crime and promote public  safety. He stands out as a daily example of excellence in law  enforcement and is…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…2659, the Strengthening Cyber Resilience Against State-Sponsored  Threats Act.\n\nI thank Congressman Ogles for his leadership on this legislation and  for his commitment to enhancing the security of our Nation's critical  infrastructure.\n\nIn recent years, the United States has faced an alarming surge in  malicious cyber activity originating from  groups…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696758/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…and educator,  who was recently recognized as a Legacy Leader by the Arkansas  Association of Educational Administrators. The organization is  dedicated to supporting and enhancing educational leadership in  Arkansas through various initiatives and legislative advocacy. This  prestigious award recognizes individuals who have demonstrated  exceptional…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693884/recognizing-lee-vent"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…and that is much-needed. It also  extends special pay authorities to attract and retain the best talent  in some of the most critical career fields.\n\nAdditionally, we are enhancing the subcommittee's oversight of the  Military Health System and remain committed to addressing the  persistent shortage of childcare for our servicemembers through  expansion…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695131/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…counties in east  Tennessee, covering all of Tennessee's Second District.\n\nThroughout his 33-year career, Andy has exemplified the mission of  preserving, protecting, and enhancing the State's fish and wildlife.  Andy knows more about wildlife than anyone I know. As a matter of fact,  he has forgotten more than I will ever know. When I run into a problem…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700233/congratulating-andy-collins-on-his-retirement"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…scope to cover Gold Star Family Members and Active-Duty  Military Spouses, expanding allocations assigned to Member, Committee,  Leadership, and House Officer organizations, enhancing the orientation  program and professional development offerings for the Aides, and  launching the program's social media presence and dynamic website.\n\nMac's impact on the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "French Hill", "party": "Republican", "sentence": "…financial literacy                programs. Sec. 406. Establishment of eviction helpline. Sec. 407. Temperature Sensor pilot program. Sec. 408. GAO studies.             TITLE V--ENHANCING OVERSIGHT OF HOUSING PROVIDERS  Sec. 501. Requirement to testify. Sec. 502. Improving public housing agency accountability.          TITLE VI--STRENGTHENING COMMUNITY BANKS'…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…reflects a shared understanding across       communities, law enforcement, and advocacy groups that       improving access to less-than-lethal tools is essential for       enhancing safety, reducing harm, and achieving better       outcomes in police-community interactions.\n\nGiven the bipartisan support in Congress, the backing of       leading law enforcement…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Espionage  Prevention Act. This bill would provide important sanction authorities  for cutting off the CCP's illegal and industrial supply chains to  America's adversaries. Enhancing U.S. export control enforcement with  economic sanctions will help shut down China's massive support for  Russia's defense industrial base.\n\nThis bill also enhances Congress'…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690679/economic-espionage-prevention-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…is World Autism Month. This month  is a time to recognize the millions of Americans living with autism.\n\nOver the years, we have made progress in increasing awareness and  enhancing resources for individuals living with autism. I have worked  to pass the Kevin and Avonte's Law, which helps families locate missing  loved ones living with autism, Alzheimer's,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690285/world-autism-month"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…investments--including $1 million in new docks and a  seawall--as well as $3.5 million in new pilot boats, demonstrate a  strong commitment to strengthening infrastructure, enhancing  operational capacity, and ensuring long-term service to the region.\n\nThe Lakes Pilots Association maintains a close partnership with the  City of Port Huron and other local…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694741/recognizing-the-lakes-pilots-association-for-over-60-years-of-service-to-the-great-lakes-maritime-community"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…enacted by the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Enhancing Stakeholder       Support and Outreach for Preparedness Grants Act''.       SEC. 2. DHS GRANT OUTREACH.\n\n(a) Urban Area Security Initiative.--Section 2003 of the       Homeland…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696945/enhancing-stakeholder-support-and-outreach-for-preparedness-grants-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…program shall focus on activities that       will maintain, establish, expand, or advance snowpack       measurement and integrated modeling, with an emphasis on--\n\n``(A) enhancing activities to achieve improved snow and       water supply forecasting results that are more responsive to       changing weather and watershed conditions;\n\n``(B) real-time…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697627/snow-water-supply-forecasting-reauthorization-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…competitiveness of the United States  in the development and application of blockchain technology.\n\nBlockchain technology has the potential to revolutionize industries  by enhancing security, transparency, and efficiency. Whether it is used  as a privacy enhancement technology, a supply chain management tool, or  as a method to provide a secure ledger…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692733/deploying-american-blockchains-act-of-2025"}]