[{"senator": "Adam Gray", "party": "Democrat", "sentence": "…and UCSF-Fresno.\n\nTwo years later, the UC Board of Regents held their first-ever full  meeting at UC Merced, and UC Merced was accepted into NCAA Division II  to elevate and enhance intercollegiate athletics and the student  experience.\n\nToday, UC Merced is the only university in California's Central  Valley to attain the Carnegie Classification R1: Very…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695846/recognizing-the-university-of-california-merced"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…and experiences before, during, and shortly after pregnancy. Maternal  care providers rely on that data collected by PRAMS--the sole source of  this type of information--to enhance prenatal and postnatal care. The  United States is in the midst of a mortality crisis, which we mentioned  before. We have the highest rate of maternal deaths of any high-income…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…that is needed is three Republicans to stand up and say: No. Wait  a minute. This is not what the Nation needs. We do not need to cut  Social Security benefits. We need to enhance them.\n\nMr. Speaker, as my colleagues are aware, in the Speaker's district  alone, there are 189,000 Social Security recipients who haven't  received an increase in benefits…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688396/preeminent-antipoverty-program-for-elderly-and-children"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…today in strong support of the ePermit Act  sponsored by my colleague, Representative Dusty Johnson, and co-led by  Representative Scott Peters.\n\nThe ePermit Act will help enhance and deploy technology to improve  permitting processes all across the Federal Government. Perhaps more  importantly, the bill is an example of what can be accomplished with…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697678/epermit-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…of defense against  danger. With this bill, we have an opportunity to equip the Department  of Justice and Congress with very crucial information to better  understand and enhance officer safety.\n\nLaw enforcement officers deserve to return home safely to their  families, knowing their well-being is truly a priority. Federal, State,  local, and Tribal…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…a partnership between the county commissioners and government, the  mayors of the four largest cities in Skagit County, and service  organizations to end homelessness and enhance effective delivery of  crisis response,  recovery and support services countywide. Commissioner Janicki also  oversaw the development of the STAR Center providing acute behavioral…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698557/recognizing-lisa-janicki"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…must return the net proceeds to  the Federal Government. Altogether, this bill provides a commonsense,  bipartisan solution to reduce wildfire risk, improve grid safety, and  enhance coordination between Federal land managers and utility  providers.\n\nThe bill respects environmental protections, avoids unnecessary  bureaucracy, and promotes responsible…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691067/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…efficiency, optimize  networks, and revolutionize industries, it also introduces new  cybersecurity risks.\n\nForeign adversaries and malicious actors are already leveraging AI to  enhance phishing campaigns, automate malware, and exploit zero-day  vulnerabilities faster than ever before. These tools can evade  traditional defenses, manipulate systems, and do…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693498/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…rated which is the highest investment  grade, making them safe investments for all investors.\n\nHarmonizing the exemption regime available for MDBs with that of the  IDA would enhance the IDA's ability to raise capital in the United  States without weakening investor protection. In turn, it will be able  to use these proceeds to provide increased funding…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693972/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…situation has led to  confusion, lost tax dollars, and a diminished sense of unity among  residents and businesses. Aligning the ZIP Code designation within the  city's name will enhance community cohesion and promote a stronger  civic identity.\n\nWhen ZIP Codes were first assigned for this area, Green was a  township, mostly farmland and a few businesses,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693900/single-unique-zip-codes-for-certain-communities"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…competitive grants totaling $811 million. This is  funding that Congress provided to the Justice Department to help  prosecutors, police, and sheriffs' departments protect and enhance  public safety.\n\nWhile the Trump administration and my friends across the aisle call  for law and order and public safety, the Department of Justice is  terminating funding…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691024/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…influence of China.\n\nThere is no credible evidence of any improper influence in K-12  schools, yet this is what the bill is about. It imposes sweeping  penalties that do nothing to enhance national security. It only harms  students. The apparent target of this legislation seems to be the maybe  five school districts that have Confucius Institute programs, but…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697533/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…example, as you have heard, Mr.  Speaker, blockchain analytics firms or the financial intelligence units  within corresponding banks.\n\nThe commonsense legislation seeks to enhance the tools at our  disposal to investigate sanctioned individuals and entities and to hold  bad actors accountable, and that is very important.\n\nThis concept is similar to,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693943/ofac-licensure-for-investigators-act"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…on Social Security. It is the safety net for  capitalism. That is what Roosevelt intended it to be. It is long  overdue that we have a vote in the United States Congress to enhance  Social Security benefits for all Americans.\n\nThere are 10,000 baby boomers who become eligible for Social Security  every day. More than 70 million people receive Social…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687913/social-security-is-an-earned-benefit"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…President Saviano, Village Manager Volpe, and Senators Durbin and  Duckworth have secured $13.1 million for a transformative project that  included grade crossing improvements to enhance resident safety in  Elmwood Park.\n\nI thank all the hardworking employees of the village whose public  service enables residents to access critical services and programs. I…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "French Hill", "party": "Republican", "sentence": "…designated, it could hinder innovation  and make the United States' financial system less competitive as a  result.\n\nThis bill will impose rigorous procedural guardrails and enhance due  diligence protections and a stronger analytic framework before a firm  can be designated as a systemically important financial institution, or  SIFI.\n\nI thank, again,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699822/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…criminal organizations and the deadly flow of  illicit fentanyl.\n\nMy first amendment redirects $2 million to bolster the National Guard  Counterdrug Program. This funding will enhance training and equipment  for our servicemembers, empowering them to disrupt the cartels and  criminal networks fueling this epidemic.\n\nThe National Guard is on the front lines…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693651/department-of-defense-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Not only has Officer Schneider secured equipment for the  department, but he also has established the traffic safety committee to  actively engage with the community and to enhance traffic safety.\n\nOfficer Schneider has harnessed GIS and drone technology to enable  the department to recreate the scenes of accidents, allowing them to  see accurate depictions…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "James Risch", "party": "Republican", "sentence": "…will increase by $1.61       billion, resulting in a revised estimated total case value of       $2.81 billion.\n\n(iv) Significance: This proposed sale will significantly       enhance Japan's intelligence, surveillance, and       reconnaissance (ISR) capabilities and help ensure Japan is       able to continue to monitor and deter regional threats.\n\n(v)…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692321/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Israel       to develop and maintain a strong and ready self-defense       capability. This proposed sale is consistent with those       objectives.\n\nThe proposed sale will enhance Israel's capability to meet       current and future threats by improving its ability to defend       Israel's borders, vital infrastructure, and population       centers.…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693349/arms-sales-notification"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…National  Airport. Sixty-seven souls were tragically lost in an instant.\n\nAfter the crash, it quickly became evident that there were  commonsense changes that would immediately enhance aviation safety.\n\nThe Army helicopter, flying along the Potomac River, had deliberately  chosen not to broadcast its location to other aircraft or to air  traffic control…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698320/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…able to work together on legislation which establishes a pilot program  within the Department of the Treasury to enable private-sector firms to  collaborate with Treasury to enhance our investigative leads. These  teams, working together, fusing the best information, help provide a  vital tool in combating the evolving threats posed by terrorism.\n\nI thank…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693942/ofac-licensure-for-investigators-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…and logistics support services, and       other related elements of logistics and program support. The       estimated total cost is $353 million.\n\nThis proposed sale will enhance the foreign policy and       national security objectives of the United States by       improving the security of a strategic partner that is an       important force for…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696549/arms-sales-notification"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "Mr. BABIN. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 1534) to strengthen and enhance the competitiveness of American  industry through the research and development of advanced technologies  to improve the efficiency of cement, concrete, and asphalt production,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…associated with vehicle-based threats.\n\n(6) Strengthened coordination between Federal, State,       local, Tribal, territorial, and private sector stakeholders       is essential to enhance prevention, preparedness, and       response efforts, ensuring the safety of communities across       the nation.       SEC. 3. REPORT ON EMERGING THREATS AND COUNTERMEASURES…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…SAVE Act is aligned with President Trump's recent  executive order, Preserving and Protecting the Integrity of Elections,  which will help restore trust in American elections, enhance our  election administration, and make our elections secure.\n\nThis legislation is just one step that we can take to ensure  President Trump's executive order could not be…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…banking system or financial       markets as a result of enacting H.R. 3633. Depending on their       individual design and extent of adoption, virtual currencies       could enhance the efficiency of the system, cause disruption,       or reduce bank deposits. Those effects are uncertain and,       given their potential range, CBO cannot currently estimate…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693775/digital-asset-market-clarity-act-of-2025"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…Pennsylvania House Labor and Industry  Committee, I got to see how innovative ideas like these can improve  workplaces. Gaining experience and making contacts across departments  can enhance the efficiency and morale of the organization, helping them  to achieve their objectives.\n\nRotational programs can take employees out of their respective  bubbles, helping…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696796/dhs-intelligence-rotational-assignment-program-and-law-enforcement-support-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…performance during colder months and during inclement  circumstances.\n\nThe Airport Improvement Program was established to fund essential  airport infrastructure projects that enhance safety and mitigate issues  that cold weather can bring.\n\nH.R. 3423 is simple yet effective. It ensures storage facilities for  aircraft deicing fluids and equipment can be…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695010/facility-for-runway-operations-and-safe-transportation-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…will help relieve burdens for Utahns who were harmed during active  nuclear weapons testing.\n\nThe bill will provide funding for technological advancement for our  military and enhance the quality of life for our military personnel by  allocating up to $7.4 billion in benefits for servicemembers across the  country.\n\nUnder this bill, the budget will provide…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694171/benefits-of-one-big-beautiful-bill"}]