[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…your  back. They have no choice. They have to stay open, and they have to  cover their costs.\n\nTo make matters worse, my Republican colleagues refuse to extend the  ACA enhanced premium tax credits. And 112,000 people in Connecticut  rely on these credits to lower their monthly premiums. They are a  lifesaver. They are a lifeline to health insurance coverage.…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694385/9999"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…have very real people behind each  of them, with very real stories.\n\nTake Amanda. Amanda is a broker's assistant in a real estate office  in Wisconsin who relies on the enhanced premium tax credits on the  Affordable Care Act. Amanda, who has lupus, needs weekly shots to  manage the autoimmune disease.\n\nOr take Madison chef and restaurant owner Evan Dannells…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695650/healthcare"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…trillion they  are cutting from Medicaid--5 percent.\n\nIn addition to cutting $1 trillion from Medicaid, congressional  Republicans refused to extend the Affordable Care Act enhanced premium  tax credits under Trump's Big Beautiful Bill. Last year, 22 million  Americans relied on these credits to afford their healthcare, but now  they have expired. Despite pressure…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698601/healthcare"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…sadly, that we have seen coming for more than a year. And if  we are serious about protecting both the physical and financial health  of Americans, we must restore the enhanced premium tax credits that  expired on December 31.\n\nCongress has not fulfilled its duty to protect Americans from rising  healthcare costs. And at a time when so many Americans are…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699085/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…that you hear from our colleagues, they do  propose on Medicaid to really make cuts that will hurt us. This isn't  about waste, fraud, and abuse. Their plan is to allow enhanced premium  tax credits to expire. That has really nothing to do with lowering  costs on average Americans. And this whole idea, in my mind, is a  veiled attempt to repeal the expanded…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Speaker, if we defeat the previous question, I will offer an  amendment to the rule to provide for consideration of H.R. 6074, which  would extend the Affordable Care Act enhanced premium tax credits for 3  years, through 2028.\n\nWe are in the midst of a healthcare crisis. More than 20 million  Americans who get their healthcare on the ACA exchanges are going…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696904/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Republican healthcare crisis is completely and entirely  preventable, and House Democrats and even a few Republicans have a  solution: Extend the Affordable Care Act enhanced premium tax credits.\n\nMr. Speaker, what do House Republicans propose instead?\n\nIt is a collection of failed policies that would raise prices,  leaving an additional 100,000 people…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698303/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…still time to avoid this crisis, and today, this House, led  by the Democrats, took action to solve at least one of the major pieces  of that, the Affordable Care Act enhanced premium tax credits. It is up  to the Senate Republicans now.\n\nHello, where are you, Senate Republicans? Are you paying attention?  It is in your House. You have the opportunity…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698666/protecting-healthcare-for-millions-of-americans"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…are under attack. The cuts in  Medicaid and the Affordable Care Act, as well as SNAP and other  programs, are taking their toll.\n\nTake healthcare as an example. The enhanced premium tax cuts that  help millions afford coverage are now expired. In California, new  enrollments are down 31 percent last year, and nearly 190,000 families  have canceled coverage…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698830/putting-americans-first"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…communities in providing care, not less.\n\nMr. Speaker, it's not too late to address this health care crisis of  Republicans' making. We can start by permanently extending the enhanced  premium tax credits under the Affordable Care Act to prevent millions  more from seeing their premiums skyrocket.\n\nThis Rural Health Day, I urge my colleagues on the other side…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697097/national-rural-health-month"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…that are already  operating on the margins who now are going to have to provide more  uncompensated care.\n\nMr. Speaker, when people come off of Medicaid and when the Enhanced  Premium Tax Credits for purchasing insurance on the Affordable Care Act  Exchange expire if we don't act by the end of this year and more people  become uninsured, they are not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…monthly healthcare premiums  are skyrocketing across the Nation, thanks to the healthcare crisis  Republicans created by failing to extend the Affordable Care Act's  enhanced premium tax credits. As a result of their inaction, more than  20 million Americans are now facing skyrocketing monthly healthcare  premiums. In many cases, and I will say in my…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Ms. McCLELLAN. Mr. Speaker, I rise in strong support of a 3-year  extension of the Affordable Care Act's enhanced premium tax credits.\n\nMillions of Americans who benefited from these credits are now facing  the real prospect of losing their health insurance because they can no  longer afford…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698587/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…busy claiming to fight bureaucracy by creating  new bureaucracy, they are ignoring the real crisis small businesses are  begging us to address: the looming lapse of the enhanced premium tax  credits.\n\nI know this because I have met with small business owners in my  district, like Rachel Rozner, who is the owner of the Elden Tea Shop in  Reston, not far…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697348/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…brought  stories of the 22 million people who will see their health insurance  premiums double or even triple and, for some, spike beyond their  ability to pay when enhanced premium tax credits expire in 22 days. An  estimated 5 million people will lose their health insurance because  they can't afford these new premiums. The Congressional Black Caucus…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…the news closely, but the  insurance companies that the Democrats want to give an additional $85  billion to with their 3-year clean extension of the temporary COVID  enhanced premium tax credits have not been knocking on the doors, Mr.  Speaker, of the United States bankruptcy courts seeking protection or  aid. In fact, they have been making record profits--record…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…$27,000 per year.\n\nA report from the Government Accountability Office confirms what  Republicans have said for years. There is significant fraud associated  with COVID-era enhanced premium tax credits established by the trifecta  of President Joe Biden and majorities in the House and Senate led by  Democrats.\n\nAgain, in 2021, Democrats put in place what is…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…their healthcare is now cheaper today than it was when they passed  this disastrous bill. You won't. You won't find one.\n\nIn fact, the sky is falling because of their enhanced premium tax  credits that they made temporary because they decided to make permanent  tax benefits for wealthy environmentalists who support them. That is  why we are where we are…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…ObamaCare exchanges.\n\nA little bit of history: During the COVID pandemic, health insurance  premiums were going up so much that Democrats passed extended,  temporary, enhanced premium tax credits--if you will, EPTCs--which  helped give more money on top of the original ObamaCare subsidies to  help people afford their premiums.\n\nThe way it works is they…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…than that, it did not make healthcare  affordable.\n\nIn fact, the biggest complaint that my colleagues have had throughout  the course of the last few weeks about the enhanced premium tax credits  was due to a temporary program that they said would end December of  2025, and now they claim nobody can afford it without this temporary  program that was…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…unaffordability of coverage. First, in the American  Rescue Plan of 2021 and then again in the Inflation Reduction Act of  2023, Democrats sent temporary taxpayer-funded enhanced premium tax  credits directly to the coffers of big insurance plans.\n\nThey did this without a single Republican vote of support. On both  occasions, Democrats chose to make these…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…who is in  his early sixties. He runs a small business, works his tail off. His  insurance plan that he has taken on, he took on in the last few years  because of the enhanced premium tax credit subsidies that were added in  2021. Those temporary tax gifts to insurance companies expire in just a  few weeks.\n\nNow, he knew that they would expire. As he…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…for a decade. I will try to go fast enough to touch on it.\n\nI did this board the other day. I just need to show you this is what  they call an economic scoring of the enhanced premium tax credits,  which is basically the subsidies on top of the subsidies.\n\nFunctionally, only 38 percent of that $40 billion is actually going  to cover actual insurance where…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…Mr. Speaker, after the 43-day Democratic-led shutdown, I  agreed to sit down with my Democratic and Republican colleagues to  negotiate in good faith to extend the ACA enhanced premium tax credit  with reforms.\n\nWe negotiated a 2-year extension with income limits, with insurance  reforms, and with the elimination of zero-premium plans. Unfortunately,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698584/providing-for-consideration-of-hr-breaking-the-gridlock-act"}]