[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…increased from just over a hundred million       dollars in 1981 to $620 million in 1985.\n\nAnd by the way, under this ``big, ugly bill,'' the cuts to Superfund  cleanup will be enormous. It will move the country exactly the opposite  direction that Ronald Reagan moved the country back in 1981.\n\nBy the end of this year--\n\nReagan said--       EPA expects to…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…stealing healthcare away from millions of  Americans.\n\nH.R. 1, the ``One Big Ugly Bill,'' isn't about securing the border,  and it never has been.\n\nThe bill recklessly throws an enormous amount of taxpayer money at  the border to buy the votes of Republicans who are reluctant to support  the GOP tax scam and devastating Medicaid cuts.\n\nJust tonight, Republicans…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691679/one-big-beautiful-bill-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Canada--the ``51st State,''  the ``Governor of Canada''--it has had a catastrophic impact on the  tourism Vermont has depended on from our Canadian neighbors with whom  we have enormous respect.\n\nThat is not just true for Vermont. New Hampshire, Maine, Montana are  seeing an incredible drop in tourism that is related to this tariff  battle and the rhetoric…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…insurance and health savings account tax shelters. Keep it focused  on affordability, on providing enrollment periods for those who have  already lost their coverage because of enormous premium hikes.\n\nWe have heard so much about fraud. The only fraud that has been  identified relates to broker fraud that Trump has made worse and  Republicans have ignored.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698798/breaking-the-gridlock-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the laws are exceptional and  thankfully acted as a check on this President, at least at this  preliminary stage.\n\nThe cost of this National Guard operation has already been enormous.  The operations, maintenance, and personnel costs for federalizing the  500 National Guard soldiers for deployment in Illinois reached an  estimated $20 million in a 2-month…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698781/operation-midway-blitz"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…is infuriated that  big, secretive special interests can control our politics from behind  the scenes with massive dark money contributions.\n\nLast point. If you can make an enormous dark money contribution, you  can threaten or promise to make an enormous dark money contribution,  and those threats and promises will never be seen. It is the core of  political…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699104/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…California and the  West because of the Bureau of Reclamation. It is important to  understand what the Bureau of Reclamation does and the fact that places  like I represent have enormous environmental debt because we had to  self-finance our water systems and so forth.\n\nIf I go to the South and I look at the Tennessee Valley Authority,  they take our jobs…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694952/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Mr. President, I thank my colleague from Alaska for  those very powerful words from himself and the Commandant.\n\nAs he has remarked, this Marine Corps birthday always has enormous  personal meaning for all of us who have served in the U.S. Marine  Corps, including for my son Matthew, who was in Helmand Province. I am  hopeful that he will invite his…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696623/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…improve the success and reduce suspensions of Black students, teach  Black history, and recruit teachers who reflect the students they  teach. African Americans have faced enormous challenges in every corner  of life--education, economic security, health care, employment, housing  and the criminal justice system. We are routinely denied opportunity…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692688/commemoration-of-juneteenth-amid-the-erosion-of-black-history"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…nearly half of all the corporate money spent.  Crypto outspent every other business lobby by tens of millions of  dollars.\n\nWhile the crypto industry's political spending is enormous, what  really sets it apart is the brazenness with which the industry buys  influence in Washington. Usually, it is hard to exactly pinpoint a  direct relationship between…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…of the  inventiveness of the American people. The discovery of natural gas in  the Utica and Marcellus shale deposits at the border in Ohio  and Pennsylvania is absolutely enormous, the largest on our entire  continent. We are seeing whole communities changed and revitalized  because of this. That was only made possible by the Department of  Energy's…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…patients in rural America, getting seen by a doctor  requires driving miles to the nearest hospital or health center. Broken  payment systems and workforce challenges have put an enormous strain on  our healthcare system.\n\nIn Congress, I am proud to be leading legislation that will tackle  these challenges. Our Graduate Medical Education bill will add  thousands…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697076/observing-world-pancreatic-cancer-day"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…are in the mood to extend current law.\n\nI will offer them the opportunity to maybe extend the Affordable Care  Act to the 24 million Americans who are facing unprecedented enormous  health insurance premium hikes since we are extending healthcare stuff  today.\n\nIn my own State of Wisconsin, Mr. Speaker, 279,000 people receive  credits to help make insurance…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697171/hospital-inpatient-services-modernization-act"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…people die in their  facilities. Mr. Speaker, three people have died in just the last 6  weeks at a privately run tent camp in El Paso.\n\nFossil fuel and mining companies pour enormous sums into elections to  block climate action while communities like mine in Arizona face record  heat, drought, and wildfires and continue to deal with the devastating  impact…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699240/restoring-election-integrity"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…executing the Foreign Intelligence Surveillance Act , but also  conducts extensive operations outside of FISA and pursuant only to  Executive order. The potential for abuse is enormous, as we saw when  the Agency secretly conducted an illegal, warrantless surveillance  program that it hid not only from the public but from Congress.\n\nOur country faces a dangerous…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700213/nomination-of-ltg-joshua-m-rudd"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…members of our community who had endured  unimaginable suffering and faced an uncertain future with faith and  hope.\n\nIn the shadow of relentless terror and violence, it takes enormous  courage to do many of the things that we take for granted. We can take  inspiration from those who face down the cowardly perpetrators of  destruction with faith and hope…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693108/facing-down-perpetrators-of-destruction"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…the U.S.  Government is capable of doing if it is determined to do so under the  leadership of a decisive, energetic President like President Trump.\n\nAnd I think it sends an enormous message of deterrence to adversaries  around the world and potential adversaries like China, North Korea,  Iran, Russia. When they see a demonstration of competence and  professionalism…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…need, and tonight I want to highlight 10  reasons why. Yes, you heard me right. There are 10 good reasons to  eliminate these incentives.\n\nFirst, the cost to taxpayers is enormous. Over the next decade, these  subsidies are projected to cost up to $900 billion.\n\nSecond, these subsidies are driving instability in our power grid.  Right now two-thirds…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690785/big-beautiful-bill"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…many people died  and they call it a constitutional war because a lot of people died,  wouldn't it then be a little bit late to vote on initiating a war?\n\nSee, this is an enormous debate. This is an important debate, and  this should not be sluffed over as, Oh, no big deal. The war is already  over.\n\nWell, we actually don't even know if the war is already…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699091/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Government away from this fiscal  cliff. History will remember who had the courage to stand up to make  these hard choices. History will remember those who chose not to leave  this enormous bill to their children.\n\nVote yes on this plan. Vote yes on restoring fiscal sanity. Vote yes  on securing the future for our country.                               159, S.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…no less than  $2.32 billion. That raises an important question: Why would a country  that certainly doesn't have the best interests of American students in  mind pay such enormous sums to American universities?\n\nThis bill will get to the bottom of it.\n\nThe DETERRENT Act includes language from my own legislation, the No  Contracts With Foreign Adversaries…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…winners and losers, which is  something that consumers should do, not unelected nameless bureaucrats.\n\nMr. Speaker, our colleagues on the other side of the aisle have spent  an enormous amount of time the past few weeks trying to convince  Americans they are the party of blue-collar American workers.\n\nWell, in the spirit of bipartisanship, I encourage my…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688098/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…Speaker, doing things that are simply not in the  interest of the people of the United States.\n\nUSAID has done some good things, but they have also done things that  were an enormous waste, totally inappropriate, and, in fact, they lost  the trust of the American people. Agencies like this need to be  reformed. The American people aren't going to put up…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693710/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…administrative       action which forbids any mining or exploration activity on       these lands for 20 years, was enacted in an area of the       United States that contains enormous amounts of the critical       minerals our nation needs to achieve its goals of energy       independence, stronger domestic supply chains and American       job creation.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…House  and the Senate Republicans coming together to deliberate on our  reconciliation package. We are trying to get this timeline going as  quickly as possible. There is an enormous amount of good work that is  going on in every committee with respect to this reconciliation  package.\n\nThis is going to be a key factor to making sure that we maintain a…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…certainty for the  continued operation of a critical source of reliable energy. Without an  extension, Southern California Edison will be forced to remove this  infrastructure at enormous expense to their ratepayers.\n\nI thank Representative Valadao for his leadership on this issue. By  championing this bill, he is ensuring that more than 15 million people…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693461/amendment-to-kaweah-project-provision"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…estimated that this unprecedented expansion would  cost just a few billion dollars. It turns out that it is going to cost  $9.5 billion just for this year.\n\nBecause of that enormous cost overrun, because of the resulting  shortfall of some $6 billion, Governor Newsom has just taken out an  emergency loan from the general fund in order to cover payments.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…going to be a lot  more than we have today because our country is facing increased  electricity demand for the first time in 10 years. The appetite of AI  and data centers is enormous. AI needs to be developed, controlled, and  led by the United States of America, not an adversarial or competitive  nation like China.\n\nChina is projected to increase its…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694868/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…LANKFORD. I would ask for Senator Schatz and I to speak for up to  10 minutes of time, equally divided.\n\nMr. LANKFORD. Mr. President, the Senate is stuck. We have had an  enormous number of nominations that have tried to be able to work  through this body. Quite frankly, it is the same number that we have  every time when it is the first term for a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695311/cloture-motion"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…scrubby little tree is now nicknamed ``The Survivor Tree'' now, and it  is the picture of Oklahoma after that bombing. We survived.\n\nThat scrubby little American elm tree is now enormous 30 years later.  Its branches and its leaves spread out over that site. It is the shaded  spot. And on the morning of April 19, there will be survivors and  families that…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690112/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}]