[{"senator": "Brian Schatz", "party": "Democrat", "sentence": "…is, I think, underrated, both politically and on policy, is all  of those rates get set in the next couple of months because, in order  to start paying and in order to start enrolling, you have got to notify  people: Hey, your thing that was $289 a month now is $789 a month. So  sometime in the fall--it depends on the State, in October, November,  and…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…International Brotherhood of Electrical Workers (IBEW), Local Union  68.\n\nPresident Buchanan dedicated his life to service. He served honorably  for 17 years in the U.S. Army before enrolling in the Denver Joint  Electrical Apprenticeship program, and went on to become Vice President  of IBEW 68 and eventually President.\n\nAs a part of Local Union 68, he worked…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695840/recognizing-morgan-jay-buchanan"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…however, there  have been significant problems since this experiment in Medicaid reform  was established two years ago. It is failing to achieve its two primary  objectives of enrolling people in health care and getting them to work.\n\nGeorgia's Pathways to Coverage program is supposed to cover nearly a  quarter-million low-income Georgians who can prove…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689905/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Continuing Resolution's failure to ``continue''  tax credits for health insurance which have been on the books for 4  years, right at the same time 24 million Americans are enrolling for  2026 insurance coverage in the ACA health exchanges. For millions, the  abandonment of premium assistance will result in increases of 100  percent, 200 percent, and…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696732/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…their hope  for a cure. And some of these patients are kids, are children.\n\nLast month, in fact, the National Cancer Institute's Pediatric Brain  Tumor Consortium stopped enrolling kids with brain cancer in clinical  trials that could save their lives, all after Trump and R.F.K., Jr.,  ended Federal funding for that work.\n\nWhat do my colleagues want…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694964/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…land. That is where Brad's fascination with airline flying  began.\n\nA decade later, he achieved what his father couldn't do. Brad earned  his pilot's license in college before enrolling as the only Black  student in Purdue University's aviation program. At a time when Black  pilots were still rare, he became a captain for Delta Air Lines.\n\nThrough it all,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693640/the-story-of-brad-and-donald-lang-sr"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…being forced  to leave the country, students that last academic year contributed $43  billion to the U.S. economy. The administration is trying to prevent  institutions from enrolling top international students altogether.\n\nThe United States has welcomed international students for decades.  Some of them include world leaders, founders of billion-dollar…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693005/student-visa-process"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…larger story about how Biden COVID credits are driving       perverse incentives. Insurers and middlemen are responding to       these incentives, and unscrupulous brokers are enrolling       anyone they can. Evidence shows millions of Americans fell       victim to enrollment in fully subsidized plans without their       knowledge or consent. This fraud…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698438/uncovering-widespread-fraud-in-obamacare"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…rates among  the best in the country. The college generates more than $276 million  annually in economic impact and supports more than 4,000 jobs across  its region, while enrolling nearly 10,000 students each year in credit,  workforce, adult education, and dual enrollment programs.\n\nDr. Karolewics herself has been recognized nationally and statewide…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695474/recognizing-wallace-state-community-college-and-its-president-dr-vicki-p-karolewics"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…within the  ACA marketplace. Her husband has been repeatedly enrolled in an ACA  plan without consent since November 2023 in a scheme where brokers and  agents are fraudulently enrolling individuals to collect commissions  and meet enrollment quotas. This broker gained unauthorized access to  his prescription records and replaced his legitimate employer-sponsored…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698387/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…actually attended their  facilities in order to receive Federal funding. Think about this: They  removed the provision that says you have got to tell us you are  actually enrolling children in your childcare center. So what does that  do? That invites fraud. In total, his administration paid out more than  $19 billion to daycare centers without having…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698560/fraud-accountability-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…federal rules. Agents and brokers are required to, among       other things, obtain and document consumers' consent before       assisting them with applying for and enrolling in coverage       through the federal Marketplace. For example, consumer       consent is required before the agent or broker can\n\ncollect or use any personally identifiable…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…plans.       Brokers earn more in commissions from insurers if they enroll       more people in ObamaCare.\n\nThe Justice Department has charged numerous brokers with       enrolling people in ObamaCare plans, or switching them to new       plans, without their consent. GAO identified at least 30,000       applications in 2023 and 160,000 in 2024 that…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697906/affordable-care-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Congress. Additionally, nearly 80 percent of the Aides built on their  experience by finding new roles in government, transitioning  successfully to the private sector, or enrolling in college to further  their education. These achievements are a true reflection of Mac's  leadership--underscoring not only the strength of the program, but also  the lasting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…continue to rail against  commonsense community engagement requirements, which require able- bodied adults without an exemption to spend 20 hours per week working,  volunteering, enrolling in school, or participating in a work  development program.\n\nLet's be perfectly clear. These work requirements apply only to able- bodied adults without young dependents…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…federal rules. Agents and brokers are required to, among       other things, obtain and document consumers' consent before       assisting them with applying for and enrolling in coverage       through the federal Marketplace. For example, consumer       consent is required before the agent or broker can:\n\ncollect or use any personally identifiable…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…academic programs,  standards, and expectations for all kindergarten students, leading the  continued development of the district's kindergarten programs.\n\nShe is often known for enrolling in classes, programs, and workshops  to further develop her professional skills and for working late to  prepare a special and hands-on learning experience for her students.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…with us. Could we get rid of the way we do risk scoring, the way we do  these star ratings, where you use those things to pump up your  compensation, and actually do it from enrolling? Let's get the actual  models right. We will build a shock absorber if someone gets really  sick. We will share the risk.\n\nThen, the incentive is to help the population get…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…again, that illegal  immigrants cannot access taxpayer-subsidized healthcare. But we know  from the GAO report that there are no mechanisms that prevent an  illegal alien from enrolling in coverage if they have access to  somebody else's Social Security number.\n\nAs if this isn't enough, the list of offenses go on and on and on.\n\nIn 2024, CMS reported approximately…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697929/healthcare"}]