[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Burnes, whose  other landholdings now house the National Mall, the White House and  other notable D.C. landmarks.\n\nThe House was constructed in 1825 by Tench Ringgold using enslaved  individuals. Shortly after being built, the House's boarders included  Chief Justice of the Supreme Court John Marshall and occasionally other  Supreme Court Justices, including…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692257/recognizing-the-dacor-bacon-house"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…struggle and sacrifice, the American people,  acting through the most democratic of means, amended the Constitution  that originally treated slaves''--Americans that had been enslaved-- ``as three-fifths of a person to guarantee equal protection of the  laws. After decades of struggle, Civil Rights and Voting Rights Acts  were finally enacted. Even today,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…in Black  History Month.\n\nMr. Speaker, in speaking of legacies that have been stolen, we  annually honor General Gordon Granger for going into Galveston and  informing the enslaved persons there that the Emancipation Proclamation  applied to them and that they were free people, liberated people.\n\nWhen we do this, however, we do not acknowledge the people…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…that we must continually strive to  form a more perfect union, to learn from the lessons of the past, lest  we repeat them, and to acknowledge the humanity of those who were  enslaved.\n\nTelling the history of George Washington's use of slave labor  reflects a mature choice to own up to past imperfections and mistakes  rather than erasing history and the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699712/rewriting-history"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Government and States from  denying or abridging a citizen's right to vote on the account of race,  color, or previous condition of servitude.\n\nDuring Reconstruction, formerly enslaved and free Black men voted and  got elected to office. When Reconstruction ended, though, the former  Confederate States passed new constitutions, including such things as…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689341/fighting-voter-suppression"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Jefferson died in 1826, a  decade before the word ``socialism'' even existed and was in common  use, but it is also bizarre because Jefferson shamefully owned more  than 600 enslaved people over the course of his lifetime. Whatever his  many other virtues, and he had many, his entire livelihood was based on  appropriating the labor of other people against…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697148/denouncing-the-horrors-of-socialism"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…involves three things:  violence, propaganda, and voter suppression.\n\nMy great-grandfather lived through the first backlash. He was a man  born on a plantation. His parents were enslaved. He exercised his right  to vote after he was given a literacy test. He got all the questions  right, and he heard the registrar say--and this is the only time you  will hear…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…because my ancestors were sacrificed  for more than 240 years  to lay the foundation for the greatness of this country, the economic  foundation. They were sacrificed. They were enslaved. They have never  been given the honor and respect that they merit.\n\nWe have respected days in this country that I appreciate and respect.  We respect Pearl Harbor with a…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…years  of faith and community. This great occasion will be marked by a  celebration at the church on Sunday, August 10, 2025, at the church in  Columbus.\n\nFounded in 1840 by enslaved individuals in the antebellum South,  First African Baptist Church began in a building located at the corner  of Third Avenue and Twelfth Street, just a few blocks from the…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694727/recognizing-first-african-baptist-churchs-185th-anniversary"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…silencing conversations about the  true history of America.\n\nJuneteenth commemorates June 19, 1865, the day Union troops arrived  in Galveston, Texas, and informed over 250,000 enslaved Black people  that they were free--more than two years after the Emancipation  Proclamation. Juneteenth is a reminder that freedom and equality remain  delayed for Black Americans.…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692688/commemoration-of-juneteenth-amid-the-erosion-of-black-history"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…times.\n\nThe second resolution is one that I am very proud to present. This is  a resolution for slavery remembrance month. As you know, August 1619  was the month and year that enslaved persons from Africa were  introduced into the Colonies. Since that time, we have had an adverse  impact on African Americans in the United States of America.\n\nWe need to retrace…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…State of Alabama did not provide a good  education to Black children. As explained in his autobiography, he  wanted to teach children, whose parents and grandparents had been  enslaved on plantations nearby, to be of better service to themselves,  their employers, and the community in which they lived.\n\nIn the 1930s, my father and his sisters attended that…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…offered the Black soldier an  opportunity to gain his stripes, but he could not convince his friend,  Abraham Lincoln, to allow Blacks to serve. In August 1862, a formerly  enslaved Black man from South Carolina came here to Washington and  convinced Lincoln to allow Blacks to serve.\n\nHistory records that 170,000 Blacks joined the Union Army, 19,000…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…Florida, Mr. Donalds.\n\nH. Res. 137 will rename the House Press Gallery for an amazing  American, Frederick Douglass.\n\nMany know Douglass as an abolitionist and orator. Formerly enslaved,  he emancipated himself.\n\nYet many don't know Douglass as a journalist. He first worked with  William Lloyd Garrison's abolitionist newspaper, The Liberator.\n\nThen, he founded…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692225/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…Portsmouth, New Hampshire, in celebration of Black History Month  Dinah Whipple was a monumental figure for educational equality in the  State of New Hampshire.\n\nDinah was enslaved until her emancipation at the age of 21. On  February 12, 1781, Dinah married Prince Whipple, who for many years was  enslaved by William Whipple, one of the signers of the…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688247/recognizing-dinah-whipple"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…nothing could be a  clearer test of our commitment than to pass this rescissions package.\n\nThe time to act is today. If we continue on our track, our  grandchildren will be enslaved to a debt that will dwarf our current  monstrosity.\n\nMrs. McCLAIN. Mr. Speaker, that was fear-mongering at its best.\n\nI yield 1 minute to the gentleman from Ohio (Mr. Davidson).…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…The Clerk read the title of the resolution.\n\nThe text of the resolution is as follows:                                H. Res. 137\n\n[Whereas Frederick Douglass was born to an enslaved family       in 1818;\n\n[Whereas Douglass bravely escaped slavery in 1838, and       spent much of his adult life as a journalist in Rochester,       New York;\n\n[Whereas Douglass…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the warmth of communism has left  people with no rights, no freedom, and driving cars from the 1940s and  1950s; or Xinjiang, China, where the Uyghurs are imprisoned and  enslaved to labor; or certainly no modest case, the Korean Peninsula,  North Korea, where people are in darkness for 12 months a year and  where people are stunted by malnutrition…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698914/warmth-of-collectivism"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…of dollars in economic assistance and encouraged massive  investment of private capital in the hopes that Russia would choose to  live in peace with the nations it formerly enslaved and with the West.\n\nIn other words, the invitation was open to join us and be a part in  what we were doing. Putin has repeatedly rejected such peaceful  coexistence. Instead,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]