[{"senator": "Brad Sherman", "party": "Democrat", "sentence": "…country. The most important thing that our financial  institutions and capital markets do is provide capital for businesses,  particularly small, medium-sized, and growing enterprises.\n\nBusiness Development Companies play a vital role in meeting this  need, and I'm proud to work with a bipartisan group of Members to  remove an outdated and unnecessary…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697831/increasing-investor-opportunities-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…who contribute their work extremely  important.\n\nNYBC has been serving New Yorkers with lifesaving blood products  since 1964. Today, as part of the New York Blood Center Enterprises,  that mission extends far beyond New York. Together, they serve 75  million people and provide 1 million blood products annually to over  400 hospitals.\n\nFrom newborns…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698776/recognizing-national-blood-donor-month"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…States       and localities have a strong interest in knowing which       businesses are operating in their communities, including       street vendors and other informal enterprises. Instead of       supporting these efforts, the legislation would make it       harder to identify and engage such businesses, ultimately       hindering local economic…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…how complex and interconnected it is that in Michigan we  have this rich, unbelievable concentration of suppliers. We call them  suppliers. These are really unbelievable enterprises that put so much  into making door panels, making interiors, and making sure that we have  got the full sweep of mobility opportunities from, of course, the  engines, and…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…bill, and I reserve the  balance of my time.\n\nMs. VELAZQUEZ. Madam Speaker, I commend Ms. Scholten and Mr. Downing  for their dedication to our Nation's innovative small enterprises, and  I urge my colleagues to support H.R. 5784.\n\nMadam Speaker, I yield back the balance of my time.", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699205/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…done.\n\nHow are we to resolve this? My colleagues have no answer. They have  taken us down a path where words have no meaning and where sheer power  by one of the richest enterprises in America--the fossil fuel  industry--is all that matters. They are the puppet masters of my  Republican colleagues. They have pulled the strings, and now we are in  deep…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691625/congressional-review-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…in commercial  banking, investment management, and investment brokerage, and all  through that time, the protection of our seniors was top of mind by  leaders in all those enterprises. Yet, we still have this terrible  problem across our country.\n\nI think having this point person at the SEC will make it more  responsive, more effective, do better training,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693935/national-senior-investor-initiative-act-of-2025"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…nationally in 2024 and that is up from 100 checks in 2022.\n\nThe value stolen has been approximately $1 billion, and this has  become a real business for criminal organizations and enterprises and  the fraudsters who are preying upon American citizens.\n\nIt is very unfortunate that we are seeing this hardship and stress  placed on the intended recipients who have…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689293/recovery-of-stolen-checks-act"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…emissions,  while simultaneously increasing production threefold or fourfold.\n\nToday's vote exemplifies the principles upheld in the Supreme Court's  landmark Loper Bright Enterprises v. Raimondo decision. By overturning  Chevron deference precedent, the court restored the judiciary's  rightful role in interpreting statutes and checking agency overreach.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688184/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Artificial Intelligence       Wisdom for Innovative Small Enterprises Act'' or the ``AI-      WISE Act''.       SEC. 2. ARTIFICIAL INTELLIGENCE EDUCATIONAL RESOURCES AND                     MODULES FOR SMALL BUSINESS CONCERNS.\n\n(a) In General.--The…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699206/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…acquisition activity.\n\n(6) The unique challenges posed by foreign direct       investment, particularly acquisitions, in the United States       by State-owned or State-backed enterprises, especially from       State-directed economies, including companies or other       entities owned, directed, supported, or influenced by the       Chinese Communist Party.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692697/global-investment-in-american-jobs-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the term in       section 901 of title 38, United States Code.       SEC. 402. MILITARY SERVICE QUESTION.\n\n(a) In General.--Subpart A of part 2 of the Federal Housing       Enterprises Financial Safety and Soundness Act of 1992 (12       U.S.C. 4541 et seq.) is amended by adding at the end the       following:       ``SEC. 1329. UNIFORM RESIDENTIAL LOAN…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…networking, and growth. Signature events  such as ribbon cuttings, community festivals, and live music nights not  only highlight the exceptional talent and variety of local enterprises  but also strengthen the bonds among neighbors, business owners, and  civic leaders alike. These events serve as a testament to the Chamber's  unwavering commitment to building…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692437/recognizing-the-75th-anniversary-of-the-orion-area-chamber-of-commerce"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…presented as centers for promoting  Chinese language and culture, it is proven that they have been used to  steal critical research, recruit talent for military-civil fusion  enterprises, conduct espionage, commit transnational repression, and  influence academic institutions to the benefit of the CCP.\n\nAt their peak, the United States hosted approximately…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690828/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…to address the changing       tactics of human traffickers, who are using forced       criminality as a form of force, fraud, and coercion in their       human trafficking enterprises; and\n\n(2) Congress is committed to continuing to find solutions       as needed to thwart human traffickers and protect survivors       of human trafficking.       SEC.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…a Realtor, an insurance agent, and a banker. Yet, his true calling was  entrepreneurship.\n\nJaime ventured into the restaurant business and steadily expanded  into other enterprises, building a foundation of a legacy that his  children will carry forward.\n\nJaime's success was never about business. It was about service.  Together with Patricia, he served…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695647/recognizing-the-suarez-delgado-family"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…millions of dollars are also disbursed annually to private       creditors of all types, including medical providers,       unsecured creditors, small businesses, and micro-enterprises       such as domestic support providers.\n\n(7) Despite the essential role of chapter 7 bankruptcy       trustees, since 1994 the amount of compensation paid to these…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698845/bankruptcy-administration-improvement-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…with the Secretary of State and the       United States Trade Representative, support the availability       of critical goods from domestic manufacturers, domestic       enterprises, and manufacturing operations in countries that       are allies or key international partner nations.\n\n(6) Assist the Federal Government in preparing for and       responding…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…critical assets vulnerable  to geopolitical uncertainty. Increasing the use of Alaska's space  infrastructure will ensure that our national security interests,  commercial enterprises, and scientific missions remain independent and  protected from foreign influence.\n\nMr. Speaker, we cannot discuss the future of space without  acknowledging the transformative…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687923/space-dominance"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…member  from Mexico had illegally entered the country 26 times. He has received  convictions for burglary, tampering with government records, government  witnesses, criminal enterprises, illegal reentry multiple times. When  you look at cases like this that are so voluminous, it is hard to  summarize. Again, the only conclusion--the only conclusion is the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…screw holes in  furnace registers. However, I also support the right of workers not to  join a union.\n\nIowa has many companies, small and large, including many family-run  enterprises, where they care deeply about their employees. So it is  natural that these companies' employees don't feel a need to unionize.\n\nThe Federal Government should not tip the…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693111/project-labor-agreements"}]