[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…come  up to my neighbors when I am walking with them home from the bus stop.  Some of the things I worry about are: Do I hide my friends if they are  getting taken? If ICE enters my school and takes someone, what will the  school do? If ICE takes my classmate, what should I do? Where does ICE  take people? And what do I do if my friends come home to…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689733/challenges-facing-our-students"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…respond more effectively to the  growing threats facing our coastal regions, of which I represent one in  Mobile, Alabama.\n\nEach year, more than 11 million tons of plastic debris enters the  oceans, endangering the livelihood of communities, small businesses,  fishermen, and our food chain that rely on healthy waterways. Along  Alabama's coastal communities,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698191/save-our-seas-amendments-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…day--      but faithful, and near,      and already making a way.                             Moments of Silence                                By Lucas Hogan       A gunman enters the school planning to cause violence      Students try to pretend they aren't there; they pack up their             things      They hold their breath; the school is in a…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…national security.\n\nSo, when we talk about timing, let's recognize that now is the moment  to make clear that Ukraine must be as strong as possible for our  security if it enters these negotiations.\n\nLet me just finish with this thought: You know, I think it is  difficult to describe what it is like to be in Ukraine in the midst of  an air attack. On…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688568/9999"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…and role model for athletes across the  country. Along with the entire State of Minnesota, I am incredibly  proud of her and her accomplishments. We will cheer her on as she  enters the 2025 WNBA draft, and we can't wait to see what is next for  the remarkable Paige Bueckers.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689924/recognizing-paige-bueckers"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…please join me in congratulating Joseph Seebode on his  retirement. It is my privilege to recognize his remarkable  contributions to our Nation and offer my best wishes as he enters this  new stage in life.", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696524/recognizing-joseph-seebode"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…air; 17,000 metric tons of fine particulate  matter, the type of pollution that penetrates deep into your lungs, the  lungs of your children, the lungs of your loved ones, and enters the  bloodstream to wreak havoc on the body in the form of asthma,  respiratory problems, cardiovascular diseases, and more--much, much,  more--all spewed into the air.\n\nAnd…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…the war. The United States  is moving military assets into the region and withdrawing diplomats  from the region.\n\nThe Iranians are acknowledging that: If the United States enters the  war, we have plans to go after U.S. troops, the 40,000 U.S. troops in  the area.\n\nSince Congress clearly wanted a Member to be able to file such a  motion to be heard…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…the holiday season, as a preacher's kid, I  have been thinking a lot about Matthew 25:31-40, where Jesus said:  ``Come, you who are blessed by my Father.'' He said when He enters into  his kingdom, all the nations will come, and He will say: `` `Come, you  who are blessed by my Father; take your inheritance, the kingdom  prepared for you since the creation…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…I  was in the Gallery in the House. I was 30 feet from where the shot was  fired. I was standing there witnessing the mob trying to break down the  doors that the President enters to give the State of the Union Address  and saw the glass and heard the glass shatter.\n\nEven as that was happening, and all of us in the Chamber were  bewildered as to what…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698518/anniversary-of-january-6"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…Forest Service is losing the very employees that provide  Americans access to our national treasures and public lands. These cuts  also threaten wildfire prevention as our State enters another critical  fire season.\n\nThe administration has fired 2,300 Department of the Interior  employees, including 800 from the Bureau of Land Management and another  1,000…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687984/dire-consequences-of-funding-freeze-and-mass-firings"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…or another State, children being destroyed or wounded by something like  the Aurora movie theater shooting or like Columbine or like the  Evergreen shooting, the fear that enters their young lives is whether  they might be next. That is what they carry to school day after day  after day throughout their young lives.\n\nThe result of that and the result…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695673/cloture-motion"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…individuals.\n\n(2) Deadline.--\n\n(A) Date.--The Secretary shall finalize the agreement under       paragraph (1) by not later than 60 days after the date on       which the Secretary enters negotiations with the National       Academies with respect to such agreement.\n\n(B) Report; briefings.--If the Secretary fails to satisfy       the requirement under subparagraph…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690650/aces-act"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…federal  issues to personally attending meetings and events across the district  to supporting veterans, Linda has been far more than an asset--she has  been family. As she enters retirement, Linda will enjoy some well- deserved time with her husband, their dogs Koda and Tessa, and their  children and grandchildren.\n\nI will miss Linda, the rest of my…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692691/recognizing-linda-culvers-retirement"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…policy by a certain percent, there is going to be another  percent of people who just drop their coverage. That means that the  pool of policyholders shrinks, and the program enters into what is  called an actuarial death spiral, which is to say the risk, instead of  being spread out over many, is concentrated in increasingly fewer  people, driving up…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688826/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…out       the purposes described in subsection (c).\n\n``(B) Prohibition.--The Commandant may not charge the Under       Secretary or any other entity with whom the Commandant enters       into a memorandum of agreement under subparagraph (A) any fee       related to use or operation of any vessel acquired under this       section.\n\n``(C) Restriction.--The…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…reliably unpredictable, John was  always a high-pressure system of calm and confidence, helping farmers,  families, and everyone in between plan for a smooth day ahead.\n\nAs John enters retirement, the forecast looks great. I see clear  skies ahead, wind at his back, and hopefully an extended period of  sunshine.\n\nI thank John for helping us weather so many…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691313/congratulating-john-wheeler-on-his-retirement"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…leadership.\n\nDebra has had a profound impact on the Victorville community. Heather  and I deeply appreciate her years of service, and we wish her and her  family well as she enters this next stage of her already eventful and  purposeful life. I ask my colleagues to join me in recognizing  Councilwoman Debra Jones and celebrating her retirement.", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696324/recognizing-the-service-of-debra-jones-on-her-retirement"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Affairs       shall seek to enter into an agreement with an FFRDC for an       assessment of notices that the Secretary sends to claimants.\n\n(b) Assessment.--An FFRDC that enters to an agreement under       subsection (a) shall submit to the Secretary a written       assessment of such notices. The assessment shall include the       following:\n\n(1)…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689678/clear-communication-for-veterans-claims-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…prepared to close, and I reserve the  balance of my time.\n\nMr. KNOTT. Will the gentleman yield?\n\nMr. KNOTT. The issue with your characterization, sir, is number one,  someone who enters illegally must be convicted of illegally entering  the country. Then they must be convicted of illegally reentering the  country to get a felony conviction. There is no compulsion…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…or to even call him a friend agrees with  this sentiment.\n\nMr. Speaker, I congratulate Vance on a well-earned retirement. May  God continue to bless him and his family as he enters a new and  exciting chapter in his life.                           Recognizing Scottie Cook\n\nMs. FOXX. Mr. Speaker, I rise to recognize Mr. Scottie Cook, a career  and technical…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697290/recognizing-valencia-abbott"}, {"senator": "French Hill", "party": "Republican", "sentence": "…unit meets the housing       quality standards under subparagraph (B) shall satisfy the       requirements in this subparagraph and subparagraph (C) if the       new landlord enters into a lease agreement with a family       assisted under this subsection not later than 60 days after       the date of the inspection.\n\n``(IV) Information when family is…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…company  has earned a reputation not only for its design expertise but also for  its enduring client relationships through many generations.\n\nNow, as Bucks Country Gardens enters a new chapter, Mr. Hebel looks  with pride to his sons, Gregory and Ryan Hebel, who together represent  the next generation of leadership. Gregory, who oversees the company's…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696583/recognizing-bucks-country-gardens-president-tom-hebels-retirement-after-years-of-service"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…Even legislation may not stop the encroaching  danger. It will take more.\n\nIn the streets of New York City, a Muslim imam recently proclaimed:  ``We will not stop until Islam enters  every home.'' There is no denying Islam's intent to dominate Western  civilization. Their stated objective is to destroy us from within.\n\nAll who serve in this Congress swore…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697017/sharia-is-dangerous"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Amendment.--Such subsection is further       amended, in paragraph (2)(A), by striking ``or takes a leave       of absence'' and inserting ``, takes a leave of absence, or       enters into an agreement''.\n\n(c) Agreement.--Such section is further amended--\n\n(1) by redesignating subsection (d) as subsection (e); and\n\n(2) by inserting, after subsection (c),…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699511/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…Scarbrough. Their enduring legacy is a  testament to the power of family, tradition, and the unwavering  commitment to serving the needs of the community.\n\nAs Hoskins Drug Store enters its 95th year, we recognize and honor  the Hoskins family for their incredible contributions to the community  and the example they set for future generations of small business…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689423/recognizing-hoskins-drug-stores-95th-anniversary"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…significant contributions to John Deere--which  will leave an indelible mark on a great American and Illinois  manufacturer. I wish John, and his wife Diane, all the best as he  enters the next chapter in his life.", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699462/congratulating-john-w-rauber-jr-on-his-retirement-after-25-years-of-distinguished-service-at-john-deere-company"}]