[{"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…most unqualified individuals that we have seen to hold that position.\n\nSecretary Kennedy took an oath to faithfully discharge the duties of  the office in which he was about to enter, and to this point, he has  utterly failed and is making Americans sicker.\n\nLook at what he has done in just 4 months. We are currently watching  the largest single measles…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691450/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…these exposed, loose cables, taking  down the entire network, destroying equipment, that a small business  fishermen had invested in.\n\nTo this day the fiberoptic company has to enter that sanctuary  regularly in order to repair and rebury the cables that were improperly  installed. All of this would have been an even greater mess had this  bill been law…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "The minute that we passed a 2-week continuing resolution for the  Department of Homeland Security, we knew we were going to have to enter  into some hard discussions about how we can rein in ICE's lawlessness,  which is what the American people demand. And yet during the first week  of that 2-week continuing…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700057/9999"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…America--when missiles began striking Tehran  and Tel Aviv; when the President of the United States, with signature  bombast, began to telegraph the possibility that we would enter the  fray; when countless American families were forced to consider whether  their children would be the next to bear the burden and carry the  sacrifices of another potentially…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "Mrs. BEATTY. Mr. Speaker, I rise today proudly to enter into the  Congressional Record that the Ohio State University Wexner Medical  Center cut the ribbon and opened the University Hospital today with 820  large private rooms sitting…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698915/congratulating-dr-john-j-warner"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…gentleman from New York (Mr. LaLota) and the  gentleman from Michigan (Mr. Thanedar).\n\nThis bill would require the Department of Energy and the Small  Business Administration to enter into a memorandum of understanding  that would improve collaboration between these two agencies. This joint  agency effort would expand opportunities for small businesses to…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687910/doe-and-sba-research-act"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…entirely women-based businesses in opening and operating  family care childcare businesses.\n\nNow, this is a win-win-win. We create more jobs in childcare, allow  more parents to enter the workforce, and lower the cost of care through  increased supply.\n\nAs a Congress, we need to work together to find commonsense policies  that will make it easier for our…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699582/stop-the-republican-affordability-crisis"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…politics  so rocky.\n\nMr. Speaker, I thank you for your generous gavel this evening.\n\nMr. Speaker, I will include in the Record some materials that we were  not able to verbally enter this evening.\n\nMr. Speaker, I will invite Secretary of Energy Wright, President  Trump, and Vice President Vance to come and stand with the workers at  Libbey Glass in Ohio…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695604/devastating-harm-caused-by-trump-administration"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…attend Head Start  are more likely to complete high school and more likely to enroll and  complete college. They are less likely to have run-ins with the law,  less likely to enter foster care, and less likely to experience poor  health.\n\nI am proud to serve in Congress with notable Head Start alumni, such  as my colleagues Representative Tony Gonzales,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691246/9999"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…this one big, ugly bill.\n\nI am going to go through some of the correspondence momentarily that  maybe, at some point, our Republican colleagues can help us figure out.\n\nI will enter into the Record one last story from a farmer. Can we  respect the farmers in the United States of America? Can we respect  them? We began this country as an agrarian economy.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…that the Trump administration has been up to to interfere with clean  energy.\n\nBut that second stop work order kind of tore it for me--because any  negotiation that we would enter into, any good bill that would result  from it, would then have to be implemented by this administration; and  this administration has been found to have illegally stopped…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…including programs to support survivors of gender-based  violence and Women in Apprenticeship and Nontraditional Occupations,  which has successfully expanded pathways for women to enter the  workforce and lead in all industries, including the trades.\n\nA Department of Labor spokesperson claimed that the Women's Bureau  funds discriminatory DEI experiments.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691209/supporting-the-womens-bureau-at-the-department-of-labor"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…installment agreement, an offer in compromise, or otherwise)       which has been approved by the Commissioner of Internal       Revenue; or\n\n(iii) has applied in good faith to enter into an agreement       to resolve any such assessed and undisputed Federal tax       liability, which has not been rejected by the Commissioner of       Internal Revenue.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, I enter a motion to reconsider the failed  cloture vote on the motion to proceed to Calendar No. 167, S. 2882.", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696190/cloture-motion"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Generally, the GENIUS Act includes several foundational       flaws. First, it invites major commercial firms such as       Amazon, Walmart, Twitter/X and/or Facebook/Meta to enter the       banking sector because it lacks provisions under the Banking       Holding Company Act that otherwise prohibit non-financial       firms from entering the banking…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…Secretaries) knows, or has reason to believe, is described in       subsection (a) is--\n\n(i) inadmissible to the United States;\n\n(ii) ineligible for a visa or other documentation to enter       the United States; and\n\n(iii) otherwise ineligible to be admitted or paroled into       the United States or to receive any other benefit under the       Immigration…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692720/sanction-sea-pirates-act-of-2025"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…talking about,  maybe they didn't have enough competition. Maybe they didn't have  enough competition, Mr. Speaker, because we had regulators that  prevented healthy mergers to enter into their market space and actually  compete and take customers who are unsatisfied with that cross-selling.\n\nThe whole point here is that we want a dynamic marketplace so…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…designed in the late  sixties.\n\nI have this weird history. I was a child--in my early twenties. I was  a temporary page at the State legislature. Arizona was the last State  to enter Medicaid. It was bankrupting our counties because up to that  point in the early eighties, the counties were actually the provider of  healthcare. We entered this, but we created…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…completely off the road--a policy decision that has resulted in loss of  life.\n\nMeanwhile, open border policies of prior administrations would have  allowed illegal immigrants to enter the United States freely which,  combined with lax Federal oversight, has let some States issue CDLs  without proper language or competency testing.\n\nA Federal Motor Carrier…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697478/commercial-drivers-license-system"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Service issued a rule  in 2021 that expanded the permissible uses of off-road vehicles  throughout Glen Canyon, but groups quickly sued, leading the Biden  administration to enter into a hasty and secretive settlement against  the wishes of local communities.\n\nUnder that agreement, the Park Service issued a revised rule in the  waning days of the Biden…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…spaces shouldn't be partisan. It should be common  sense. However, under the Biden administration, the Federal Government  decided to abandon common sense. It allowed men to enter women's spaces  and violate their privacy and dignity.\n\nUnder President Trump, the government has restored basic biological  truth: men are men, and women are women. I applaud…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…parole.--In the case of an       individual, that individual is--\n\n(i) inadmissible to the United States;\n\n(ii) ineligible to receive a visa or other documentation to       enter the United States; and\n\n(iii) otherwise ineligible to be admitted or paroled into       the United States or to receive any other benefit under the       Immigration and Nationality…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…be reminded of women like Sally Ride who in 1983 became  the first woman in space, defying conventional expectations set for  women while creating opportunities for women to enter STEM fields.\n\nLet us also be reminded of women like Clara Barton who founded the  American Red Cross in 1881, modeling service and diplomacy in the  presence of conflict. Her…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689363/womens-history-month"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…103(b)(1).\n\n``(3) Agreements and transactions.--In carrying out the       functions described in paragraph (2), the Assistant       Secretary, acting through the head of ITS, may enter into       agreements as provided under the following authorities:\n\n``(A) Sections 11 and 12 of the Stevenson-Wydler Technology       Innovation Act of 1980 (15 U.S.C. 3710;…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693439/institute-for-telecommunication-sciences-codification-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Memorandum of understanding.--Not later than 30 days       after the date on which the rights-of-way are granted under       paragraph (1), the Secretary and the Authority shall enter       into a memorandum of understanding identifying Federal land       on which the Authority may dispose of materials under       subparagraph (A) to further the interests…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698162/sloan-canyon-conservation-and-lateral-pipeline-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…the  Republican vision for a renewed Nation. It is a nation no longer  blighted by the cataclysmic failures of the previous administration,  and a nation primed and ready to enter the golden age.\n\nOne of the many strong reinforced byproducts of our Republican vision  is the One Big Beautiful Bill Act. It is one of the most consequential  pieces of legislation…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…permissible       expenditures detailed in Section 4.0, Members may utilize the       following additional resources:\n\n3.1 Law enforcement coordination. The SAA and USCP may       enter into mutual aid agreements for law enforcement support       for Members.\n\n3.2 SAA Procurement. The SAA may support Members by       providing concierge security management…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697952/us-senate-member-protection-regulations"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…following:\n\n(A) An identification of current and potential criminal       threats posed by members of Tren de Aragua and affiliates       seeking to--\n\n(i) unlawfully enter the United States through the       southwest, northern, or maritime border; or\n\n(ii) exploit any security vulnerabilities along the       southwest, northern, or maritime…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696956/tren-de-aragua-border-security-threat-assessment-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…illegal mass migration in history.\n\nOver 4 years, the Democrats opened our borders and allowed an  unvetted and largely impoverished population of nearly 8 million to  illegally enter our country--a population the size of Washington State.\n\nThis illegal mass migration has overwhelmed our public schools,  public hospitals, homeless shelters, food banks, and…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688130/birthright-citizenship"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…stage and actually establishing  peace through strength. Our border is secure again, and President Trump  is making it clear to the drug cartels and bad actors that if they  enter the United States illegally, they will be deported. During his  first full month in office, there were only 8,326 apprehensions at our  Nation's borders. Compare that to President…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688493/america-is-back"}]