[{"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…eliminated. While it  is not everything we would want, it is a vast improvement over what was  requested.\n\nEven still, Mr. Chair, some of my colleagues may notice my lack of  enthusiasm for this final bill.\n\nThis bill's $1 billion or 9 percent cut to the Internal Revenue  Service below the fiscal year 2025 enacted is particularly concerning  to me. I have…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699056/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…food drive started two decades ago when Terri partnered with her  daughters' Girl Scout troop to create 19 food baskets to deliver to  families in need. Driven by Terri's enthusiasm and hard work, the food  drive blossomed over time to include help from hundreds of volunteers  in the community, including Girl Scout troops, sports teams, students,  and…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699949/recognizing-terri-judah"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…shift or  two. The new workers were often older Vermonters who had been retired  for years, but they stocked shelves, checked out customers, and  prepared sandwiches with enthusiasm. They pitched in not because they  had to--many donated their salaries to charity--but because they felt  the store's survival was essential to their community.\n\nDespite…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694332/recognizing-dan-whits-general-store"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…On  that day and every day, I am grateful that my staff have chosen to  invest so much of their precious time and talent to making a difference  for North Carolina. Their enthusiasm energizes me. Their creativity  inspires me. At this difficult time, their positivity in the face of so  much turmoil fills me with hope for the future.", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688691/recognizing-my-congressional-staff-in-honor-of-national-employee-appreciation-day"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…DRCC properties, which include four city-owned  parcels the city is exploring for a new community campus. He is also an  avid cyclist, a hobby he pursues with energy and enthusiasm. His  collaborative approach within Snohomish County has strengthened  regional partnerships while keeping Mill Creek's unique identity  intact.\n\nMr. Speaker, I ask my colleagues…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697194/recognizing-mayor-brian-holtzclaw-for-twelve-years-of-leadership-in-mill-creek"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…gentlewoman from California and  again thank her for cosponsoring that piece of legislation with me. I  understand that if a child can't see the board, they can't learn. Her  enthusiasm when I brought it to her is exactly why we need people from  diverse perspectives in this Chamber.\n\nI now yield to the gentlewoman from Hawaii (Ms. Tokuda). I thank her…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…expertise and familiarity with the operational requirements of a  multi-campus institution were invaluable to the college.\n\nKathleen's widespread involvement demonstrates her enthusiasm for  public education systems in the Inland Empire. Her hard work has left a  lasting impact on many, as seen by her recognition as Chaffey College's  2002 Alumni of the…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697315/recognizing-chaffey-college-trustee-kathleen-brugger"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Congress hasn't acted on  Social Security and its expansion since 1971. Richard Nixon was  President of the United States.\n\nMr. Speaker, because of the initiative, energy, and enthusiasm of  Members of Congress like Representative Stansbury, people in New Mexico  and all across the country--Mr. Speaker, it might surprise even you, as  well, to know how many…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694190/hands-off-our-social-security"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…effectiveness  of our research collaborations, providing us with the opportunity to  revise and refine strategies as necessary.\n\nI am excited, and I hope my colleagues share my enthusiasm about the  potential growth and broadening capabilities the DOE and SBA Research  Act promise to bring.\n\nLet's always keep sight of the ultimate goal of this legislation…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687907/doe-and-sba-research-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…which would rename a  post office in Rockford, Illinois, for Jay P. Larson.\n\nMr. Larson worked as a letter carrier for the U.S. Postal Service for  25 years. Serving with enthusiasm and commitment, known for his joy and  warmheartedness, Jay Larson was tragically killed in a mass stabbing  spree in March 2024 while delivering the mail.\n\nMr. Larson is…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697604/jay-p-larson-post-office-building"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…businesses--providing education, creating networking  opportunities, and championing advocacy on areas impacting business. It  is a privilege to celebrate someone who brings enthusiasm, good humor,  endless support, and hard work to everything she does. We celebrate  Susan on this incredible milestone and thank her for 45 years of  remarkable commitment…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694735/recognizing-susan-harkins-for-45-years-of-service-with-the-lower-bucks-county-chamber-of-commerce"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…for parent  involvement. He actively supports all parent involvement in evening  events, encouraging other parents to participate and engage with the  school community. His enthusiasm and dedication help to build a sense  of unity and positivity within the school and its surrounding  community. Mr. Robert Ross is a cornerstone of the Paul R. Smith Middle…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691992/recognizing-robert-ross"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…his services. Mr. Lancaster  always says it's his way of giving back to the community. Since his  ``tryout'', Mr. Lancaster has offered his talents, professionalism, and  enthusiasm to every home Boys Basketball game at Springstead High  School. Over the years, he has agreed to do the same for every home  Varsity Football and Baseball game as well. Because…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691109/recognizing-dean-lancaster"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…who has decided to retire at the end of the school  year after 54 years of service to Savannah Country Day School.\n\nMr. Eswine was originally hired in 1972, and through his enthusiasm,  adaptability, and love for teaching has taught science to generations  of children. His impact is visible across the school's campus in the  Savannah community, serving…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699709/retirement-of-judge-ronnie-fender"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…American-owned company. It is a beacon of resilience and prominence, in  no small part due to the company's passionate leaders, who are willing  to take on new opportunities with enthusiasm and trudge through  challenges with tenacity.\n\nWyoming businessmen and -women are a special kind of people. If you  are in business in Wyoming, you are willing to be both…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690788/big-beautiful-bill"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…Toys for Tots on television commercials, firing  up the crowd at Riverside Stadium for the Victoria Generals, or leading  the Christmas parade, Brother Gary shows up with enthusiasm that lifts  the entire community.\n\nAt 73 years young, Brother Gary is always reminding us that, in  Victoria, we are all family. His nickname, Brother Gary, is not just a…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697389/recognizing-brother-gary-moses"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…dedicating countless hours towards promoting the success of his  students. He even extends himself at times to help students that aren't  specifically in his class. He brings enthusiasm, positivity, and  perseverance to the classroom and uses these traits as tools to help  inspire students to learn and apply math and science to their day-to- day lives.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…contributions that  Cindy Gandy Mahon has made to our community as a volunteer with  Brooksville Main Street (BMS). Cindy has demonstrated an exceptional  level of commitment, enthusiasm, and passion for the revitalization and  growth of downtown Brooksville. Her tireless dedication to BMS's  mission and objectives has made a lasting impact, and her unwavering…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690272/recognizing-cindy-mahon"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…and  the nomination by the U.S. Department of the Interior as the next  American World Heritage site.\n\nAfter his successful tenure in this role, Dr. Clark has expressed  enthusiasm for this transition and remains confident in the ongoing  excellence of the Okefenokee Swamp Park board.\n\nMr. Speaker, I thank Dr. Clark for his commitment to improving the…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690751/recognizing-dr-william-clark"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…2016. Monday and Friday mornings at the  Metro Welcome Center are lively and welcoming, thanks to this  remarkable woman. She greets both new and returning volunteers with  enthusiasm, ensuring newcomers feel comfortable and understand the  importance of their roles. Her humor, empathy, and dedication ensure  smooth operations across all areas, from kitchen…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690992/recognizing-judy-salvador"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…because America's spirit is back, the  enlistment numbers are at record levels. A year ago, they were at  record lows. Now, they are at record highs.\n\nThat is the kind of enthusiasm that people have, once again, for  America. The chants of ``USA, USA'' will permeate not just, of course,  at the baseball stadium tonight but across America because we believe…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692334/election-promises-made-promises-kept"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…local leaders so that the flags are all up by Memorial  Day. Marie and David Troy are an  example to New Yorkers and to Americans. I truly respect and admire  them for their enthusiasm and patriotism.\n\nOn behalf of New York's 21st District, I want to thank Marie and  David Troy for being model citizens of our community.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694912/recognizing-marie-and-david-troy"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…2016. Monday and Friday mornings at the  Metro Welcome Center are lively and welcoming, thanks to this  remarkable woman. She greets both new and returning volunteers with  enthusiasm, ensuring newcomers feel comfortable and understand the  importance of their roles. Her humor, empathy, and dedication ensure  smooth operations across all areas, from kitchen…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690680/recognizing-ellen-tantillo"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…2016. Monday and Friday mornings at the  Metro Welcome Center are lively and welcoming, thanks to this  remarkable woman. She greets both new and returning volunteers with  enthusiasm, ensuring newcomers feel comfortable and understand the  importance of their roles. Her humor, empathy, and dedication ensure  smooth operations across all areas, from kitchen…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690148/recognizing-carol-brisbois"}]