[{"senator": "Sharice Davids", "party": "Democrat", "sentence": "Kansas farmers feed not just the Nation but the entire world.", "title": "United States Grain Standards Reauthorization Act of 2025", "date": null}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "When President Trump was impeached a second time  for inciting an insurrection, the House Judiciary Committee completed  an investigative report that documented what Members of Congress and  our entire Nation witnessed on January 6, 2021.", "title": "Concerns with H. Res. 939", "date": "2025-12-12"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "In my own district, an entire county has only one child and  adolescent psychiatrist.", "title": "Rural Mental Healthcare", "date": "2025-11-18"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "We don't need this amendment opening up the Pentagon and  the entire U.S.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "This is insane that we would hold  grants back from the entire State.", "title": "Unanimous Consent Requests", "date": "2025-10-03"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "At Whitworth College, he was the first African American to play  football at the college level in the entire Pacific Northwest.", "title": "Ill-Conceived Budget Resolution", "date": "2025-02-25"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Their revival across all enriches not only Hawaii but also the entire  Nation, offering a living example of perseverance, identity and  contribution.", "title": "Recognizing Hawaiian History Month", "date": null}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Departments are being slashed and eliminated and so are the lives of  professionals who have devoted their entire careers to public service.", "title": "Considering the Painful Toll", "date": "2025-03-10"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "I also note that the entire investigation was based on doctored,  manipulated, and sometimes downright fabricated evidence, much of which  he got from a personal connection.", "title": "-9999", "date": "2025-12-10"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "They are about closing the wealth gap of  which I have been focused on my entire career.", "title": "Increasing Investor Opportunities Act", "date": "2025-12-10"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "I think that the leadership of the gentlewoman has been very  important during this entire period of the war and for all the people  who have died needlessly, as Ukraine is the scrimmage line for liberty  on the European Continent.", "title": "Supporting Ukraine's Independence", "date": "2025-04-28"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "On behalf of the entire Abraham Accords Caucus, I thank Rabbi Ulman  and Mr.", "title": "The Light Will Win", "date": "2026-01-14"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Speaker, I am here today because this administration  is playing games with costs, retirement accounts, and the entire  financial system.", "title": "Chair Powell Refuses to Give in to Trump's Demands", "date": "2026-01-12"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "When my daughter, Rosa, passed away in 2023 and left us four  beautiful young children, it shook our entire world.", "title": "Raising A Question of the Privileges of the House", "date": "2025-11-17"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "To put that in perspective,  this area is larger than the entire State of Rhode Island.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the National Park Service Relating to ``Glen Canyon National Recreation Area: Motor Vehicles''", "date": "2025-04-29"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Right now the entire country has seen what his  failed policies have done to our State.", "title": "Protests in Los Angeles, California", "date": "2025-06-09"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "They not only uplift and  encourage the youth who come here every day but also strengthen the  entire community by shaping the minds of our future leaders and  dedicated public servants.", "title": "Recognizing High Impact Movement", "date": "2025-10-28"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "If that line goes down, whether for repairs or  due to an outage, the entire region could face a water supply crisis.", "title": "Sloan Canyon Conservation and Lateral Pipeline Act", "date": "2025-12-15"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "Florida serves as one of the most veteran-friendly States in the entire  country.", "title": "Congratulating Northwest Florida State Women's Basketball Team", "date": "2025-05-14"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Speaker, I rise today to honor the Georgia  Ports Authority for their decades of servitude to Georgia, the United  States, and the entire world.", "title": "Georgia Ports Authority", "date": null}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "She took it upon herself to create Service  Academy Days for the entire Idaho Delegation--an event for Idaho's high  school students to learn about our Nation's military academies.", "title": "Recognizing Linda Culver's Retirement", "date": "2025-06-20"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "Warren County's students have set a new standard of  excellence, and they remind us that the seeds of leadership, once  planted, can grow into something that lifts up an entire community.", "title": "Recognizing 50th Anniversary of Opera Roanoke", "date": "2025-11-18"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "Speaker, our entire team will miss Emma.", "title": "Recognizing Emma Hall", "date": "2025-12-12"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "I commend the entire team for their efforts on this  worthwhile endeavor and for their ongoing service to our local  community.", "title": "Recognizing Michael Goodwin", "date": "2025-06-12"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "We  grieve her loss deeply, and I ask God to bring comfort and peace to her  family, her loved ones, and entire National Guard community.", "title": "National Guard Shooting", "date": "2025-12-02"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "This is the first time I have seen in my entire time here in the U.S.", "title": "En Bloc Nominations", "date": "2025-10-03"}, {"senator": "James Risch", "party": "Republican", "sentence": "This amendment will cause the case to       exceed the notification threshold, and thus notification of       the entire program is required.", "title": "Arms Sales Notification", "date": "2025-11-19"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "This is a milestone she should be incredibly  proud of, as years of determination and intellectual rigor have led to  this proud moment for Carter and the entire Forrest family.", "title": "Recognizing the Graduation of Carter Forrest", "date": "2025-05-21"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "She will be missed and her voice will  be missed in committee, this Chamber, and the entire institution.", "title": "For America's 250th Act", "date": "2026-02-09"}, {"senator": "French Hill", "party": "Republican", "sentence": "Established in 1923 and dedicated in 1925, Petit Jean was Arkansas'  first State park and helped inspire and initiate the entire Arkansas  State Park System.", "title": "Congratulating Robert Arrington", "date": "2026-02-09"}]