[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…community here in Virginia.\n\nTake the story of a former captain in the Afghan National Army. He  worked with the U.S. military, and his brother was shot by the Taliban.  His entire family now fears for their lives. Abandoning Afghans now not  only turns our back on those who risked their lives to protect us but  puts our current and future global partnerships…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691559/protect-the-afghans-who-served-us"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…I heard from a mom whose son has autism and is terrified for his  future if he doesn't have healthcare and specialized education.\n\nI have heard from another mother whose entire family relies on  Medicaid for lifesaving care.\n\nAs House Republicans attack Medicaid, Elon Musk and his unqualified  team at DOGE have slashed 20,000 jobs at the Department of…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690242/health-disparities-in-minority-communities"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…the precious days of postpartum made nursing  impossible. You were finally seen by a doctor, returned to the baby  prison that is Dilley, and then mere hours later, your entire family,  your parents, and your 1-year-old sister, Mia, were forcefully deported  and left along the side of the road in Mexico.\n\nYou, my sweet boy, are precious and deserving…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700186/state-of-our-union-is-traumatizing-our-children"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…creative  rights of artists. Professionally, he was an iconic figure in film and  made us laugh, cry, and think--and think--with the movies he created.\n\nPaul and I and our entire family mourn the loss of our dear friends  and pray for their loved ones.\n\nHis children, Jake and Romy, put out a statement thanking everyone  for their good wishes but asking…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698360/rob-and-michele-reiner-tribute"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Finally, in the Wizard of Oz, a film my grandmother loved       (which may have something to do with the name of the leading       lady), a love she also passed on to our entire family, the       titular wizard also shares some wisdom about love and       affection.\n\nAs the Tin Man asks him for a heart, the Wizard says,       ``Hearts can never be made…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688362/eulogy-by-sam-iacobellis-for-dorothy-christiana"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…being threatened or silenced, and he was  targeted because of this.\n\nBefore this assassination, in April, Governor Josh Shapiro's house  was set on fire, endangering his entire family. Just 2 months after  that, two Democratic lawmakers, Melissa Hortman and John Hoffman, were  gunned down in their homes. Tragically, Melissa died alongside her  husband,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695732/charlie-kirk"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Minnesota  better than she found it. I will miss her dearly.\n\nAs we mourn the loss of Melissa and Mark, our hearts are with their  children, Sophie and Colin, and their entire family.\n\nWe wish Senator John Hoffman and his wife Yvette a full recovery.\n\nAs we come together as a community to heal, may we find comfort in  the words of Melissa and Mark's…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693118/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…was not detected  until it was stage IV, and therefore, was not treatable.\n\nTragically, the cancer took her life 8 short weeks after her  diagnosis. It was a shock to our entire family, the lingering effects  of which I feel every day.\n\nIn an effort to turn my pain into passion, I made a commitment to do  all that I could to prevent other families from…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695554/american-cancer-society-fly-in"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…who is  battling cancer and now severe back injuries, can't work consistently.  Atalina still works full time and still serves her neighbors and  community.\n\n``If I put my entire family on my employer insurance,'' she told me,  ``it would cost more than half my paycheck.''\n\nMedicaid gave her family access to lifesaving care. SNAP made sure  her kids didn't…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691491/gop-tax-scam-hurts-women-and-families"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…Marine Corps.\n\nOn behalf of a grateful Nation, I offer my deepest thanks and best  wishes to Sergeant Major Troy Black, to 1st Sergeant Major Stacie  Black, and to their entire family as they begin this well-earned new  chapter.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694958/recognizing-the-retirement-of-sergeant-major-troy-e-black"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…subsidies provided through the  Affordable Care Act (ACA). Wesley wrote to me explaining that the  extension of ACA subsidies has allowed him to afford healthcare for his  entire family. Without them, he would likely be forced to make the  difficult decision to insure only his daughter.\n\nHe's one of over 300,000 Wisconsinites covered by the ACA.\n\nAnother…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696975/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…instills in generations to  come.\n\nColorado and the United States owe Chairman Heart a profound  gratitude for his decades of service. We also thank Marie, his wife,  and their entire family.\n\nWorking with him has been one of the greatest honors of my life and  of my time in the Senate, and I wish him well in his retirement as he  enjoys well-deserved time…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696559/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…for the U.S.-Taiwan relationship. It  has been an absolute honor to work with the Congressman on this  legislation and so many other issues.\n\nMr. Speaker, Gerry and his entire family remain in our prayers.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690685/taiwan-assurance-implementation-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…rural Kentucky trying to intimidate  me from the Biden investigation, which, by the way, ended with Joe  Biden's last act as President of the United States to pardon his entire  family.\n\nI know my friends on the other side of the aisle don't like to think  about that, but that is a fact.\n\nAll DOGE is wanting to do is look at spending and see if we can…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688348/draining-the-swamp-in-order-to-put-america-first"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…generously gave his time to strengthening  the lives of others.\n\nMr. Speaker, I thank Judge Worden for his faithful service to the  State of Nebraska. I wish him, Joni, and his entire family all the best  in the years ahead and congratulate him on a career defined by respect,  service, and lasting impact.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699724/recognizing-and-thanking-judge-james-worden-upon-his-retirement"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Jack has all of those qualities.\n\nIt also takes sacrifice, and Jack, his wife, Paige, and their two  boys, Joel and Barrett, know that all too well. I thank Jack and his  entire family for the sacrifices that they have contributed in more  ways than I can describe. Their sacrifices over the last 6\\1/2\\ years  have contributed to the success of the T&I…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…man of principle who is  trying to do the right thing. I don't always agree, but I agree most of  the time.\n\nGod bless him, and God bless the memory of Rhonda and Thomas' entire  family.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…deeply respects  our Armed Forces but also as a parent of a servicemember.\n\nI have watched firsthand what it means to serve, not just for the  person in uniform but for the entire family. I have seen how military  children shoulder more than many adults will ever have to.\n\nAs a parent, I know how hard it is to be away from your child, but I  also know the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690368/recognizing-april-as-the-month-of-the-military-child"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Molly went to Heaven last week while visiting a friend in Italy, and  I think I speak for everybody in this body when we offer our deepest  condolences to Jim and to his entire family and to our colleagues who  were so close with and knew Molly, who, by the way, from memory I  believe worked for Jamie Raskin as an intern, and had her own  engagements…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…VCI founder Tom Caulfield, Tina  was instrumental in supporting numerous aspects of VCI's mission.\n\nAs we pause to remember Tina, we also keep her husband, David, and  her entire family in our prayers. We also express a nation's gratitude  for her passionate commitment that advocates like Tina Pelesky and Tom  Caulfield make each and every day for all…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698913/significant-strides-to-strengthen-united-states-warfighters"}]