[{"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…a Democrat or  Republican to do the same. I say this as someone who represents a  community in the State of Florida, the largest Affordable Care Act  marketplace in the entire country. We have millions of people in the  State of Florida that will be impacted by this, and I encourage  everyone to vote ``yes.''                              Renee Nicole…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698835/americans-in-state-of-desperation"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…the kings were constantly  plunging their entire nations into wars of vanity, of conceit, of  caprice, of mere whimsy.\n\nThey didn't trust one man to be able to take the entire country to  war. They wanted that question proposed in the representatives of the  people because it is our sons and daughters who will go fight, and it  is the whole country's…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698444/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…is better for me to stand alone than not stand  at all. If I have to, it won't be the first time.\n\nI believe that it is a question of conscience because it impacts the  entire country. It impacts the lives of people within the country. The  act that would bring us to the point of impeaching is something that  impacts society in a negative way, impacts…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…lots of different kinds of  medical treatments and procedures. Suddenly, we are going to turn the  United States Congress into a super-medical licensing board for the  entire country?\n\nThis is why our colleague from the other side of the aisle, Mr. Roy,  raised the question of whether this is even constitutional. Where is  the Federal jurisdictional…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698345/protect-childrens-innocence-act"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…all of our Armed Forces.\n\nOn behalf of all Kentuckians, we thank Sergeant Major Black for his  bravery, his patriotism, and his service. He has made Louisville and  our entire country proud.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694976/recognizing-sergeant-major-troy-black"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…east of the Cascade Mountains. Now, we see it in the entire  State.\n\nWe have seen devastating fires in recent years. In fact, six of the  highest risk fire sheds in the entire country are in my district.\n\nNow is the time to strengthen our wildfire mitigation efforts, not  kneecap the agency that is responsible for maintaining forest health.  Firing support…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…incarcerate more people at an even younger age. Of course, the  prison industrial complex will reap the profits.\n\nWhat Republicans do in D.C., they want to apply to the entire  country.\n\nThis Republican bill perpetuates racism. The Department of Justice  statistics show that Black kids are twice as likely to be incarcerated  compared to White kids, despite…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695594/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "Ms. SCHRIER. Madam Speaker, I rise today as families across the  entire country are struggling with rising costs at the grocery store,  on their healthcare, their health insurance, and this year especially,  on their utility bills. In fact, in Washington…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697885/state-planning-for-reliability-and-affordability-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…us that  housing costs are rising faster than wages, making it hard to keep a  roof over their heads.\n\nToday, I rise to bring an issue that plagues my community and the  entire country, which is the rising cost of housing.\n\nIn my district alone, over one hundred thousand households rent their  homes. The median renter household income is just above $40,000…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699021/rising-housing-costs"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…that.\n\nWhile Representative Fitzpatrick and I both are both immensely proud  of Pennsylvania's own Ben Franklin, we know this is not just for  Pennsylvania but for our entire country. I am very grateful to the 77  Members who shared this sentiment last Congress and to our 22 evenly  bipartisan original cosponsors and to the 33 Members who have already…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688221/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…the ongoing effects of climate  change and what is happening in our country.\n\nOver the last decade, we have had more and more intense storms,  unexpected, throughout the entire country, but surely in Texas. We have  had freezes that have killed hundreds of people, and now we had a 1-in- 100-year catastrophic rainstorm that produced horrific floods and…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693655/tragic-storms-in-texas"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…percent to import pineapples, bananas, and foods that we do  not make or grow in the United States. That hurts restaurants and other  small businesses in my district and the entire country. It hurts  consumers as well.\n\nOn top of that, this is summer tourism season in Rhode Island, and we  typically get a lot of tourists from Canada and Europe who come to…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694157/plumpynut-saves-lives"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Union, created as a lifeline to tens  of millions of Americans that, but for programs like this, would be  succumbing to diseases, succumbing to ill health. And we as an entire  country would suffer.\n\nThink about this not as that slur where they try to call this in ways  that try to shift public opinion away from human beings, fellow  Americans, our patriots.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…federally as IDEA. I was proud to vote for that bill,  section 766, as a State representative--one of my first votes in my  career. That bill then became the law for the entire country.\n\nIn the decades since the IDEA became Federal law, students, parents,  educators, administrators, and support staff have worked tirelessly to  deliver the promise of a…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697522/50th-anniversary-of-individuals-with-disabilities-education-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…be able to use our voices and to use our  votes and to ask questions without being forcibly thrown to the ground,  without being arrested by speaking up.\n\nI say to the entire country: We have a democracy. We will lose it if  we can't use our voices. We will lose this democracy. None of us should  be silent. None of us.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692471/alex-padilla"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…communities doing  their part and repaying the government finally access clean water.\n\nThis bill passed both Houses unanimously. Republicans and Democrats  from across the entire country all agreed: This is a project worth  completing, not abandoning.\n\nMr. Speaker, veto overrides are rare, and they should be. However,  the Constitution gave Congress this…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698701/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…long way toward ending the disgrace  of the sanctuary State in California.\n\nWhen it comes to California's failing public schools, which are just  about the worst in the entire country, we have the lowest literacy rate  of any State in the country. We continue to see attacks on high- performing schools from Governor Newsom and his enablers in the  legislature.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…tradition in our home state of Georgia: the Savannah Christmas  Market at Plant Riverside District.\n\nThis year, it was ranked as one of the top holiday markets in the  entire country by USA Today, drawing visitors from all over and  spotlighting the rich culture and community spirit of Savannah.\n\nThe market transforms historic River Street into a festive…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698573/recognizing-the-savannah-christmas-market"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…K-12 classrooms as well as  funding from Qatar ended up at Brown University which developed anti- Israel curricula that then went to 8,000 K-12 schools throughout the  entire country.\n\nThe DETERRENT Act is a much-needed, commonsense piece of legislation  that simply says if you are going to accept funding from foreign  countries, you need to disclose…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689035/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…Teacher of the Year award is the highest State-level  recognition for public school educators. Now, Tiffani will join other  State Teachers of the Year from across the entire country in a year of  professional learning and a once-in-a-lifetime opportunity.\n\nCongratulations to Tiffani. I thank her for all she has done to earn  this prestigious award.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697110/tiffani-jaseph-named-2026-arizona-teacher-of-the-year"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…privileged to represent more than  75,000 veterans that I represent in my district in northwest Florida.  Florida serves as one of the most veteran-friendly States in the entire  country.\n\nMr. Speaker, it is with great sorrow today that I acknowledge the  passing and honor the memory of one of those great heroes, Captain  Allen Colby Brady of Pensacola…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691271/congratulating-northwest-florida-state-womens-basketball-team"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…law enforcement officers,  that are vilifying Federal officials.\n\nThen, worst of all, the Governor is refusing to take action to keep  the community safe. Right now the entire country has seen what his  failed policies have done to our State.", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692164/protests-in-los-angeles-california"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Mr. ROY. Mr. Speaker, I am going to take a few minutes in the time  that I have remaining to talk about another issue that is critical to  the State of Texas and this entire country.\n\nThat is the fact that America, Texas, and Western civilization are  under attack from within. The cheap labor lobby, leftwing NGOs, radical  progressive Democrats, Marxists,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…beautiful State,  she has allowed mining. Why not in my State? Why can't my union workers  make the $135,000-a-year jobs, but in her State it is okay? This bill  is for the entire country.\n\nMr. Speaker, my constituents need good-paying jobs, too. It is good  for our economy and good for our communities. The technology we use is  second to none.\n\nI want to…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…necessary to meet the challenges of feeding, clothing, and  fueling our Nation.\n\nAccess to agricultural education is critical not only for our rural  communities but for the entire country.\n\nAgriculture is the backbone of our economy. As I often say, food  security is national security, and investing in the next generation of  producers ensures that there…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687891/national-future-farmers-of-america-week"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…and internationally  banned.\n\nNational injunctions are being used to halt executive actions and  executive orders not just for plaintiffs before the court but across  the entire country, including individuals and entities that are not  even parties to the litigation and, in many cases, may not favor the  outcome and would not have been willing plaintiffs.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…young man--Ray Curtis of Minot.\n\nOn February 11, Ray will turn 109 years old. He is the oldest living  World War II veteran in North Dakota and one of the oldest in our  entire country.\n\nRay served our Nation during one of the most defining moments in  world history. Like so many from his generation, he answered the call  without hesitation and helped…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699742/recognizing-ray-curtis"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the iconic landscapes of Death  Valley to the ski areas of the High Sierras and the wonder of Lake  Tahoe, we host and steward some of the most magnificent places in the  entire country.\n\nAcross millions of acres of public land, seven national forests, and  countless parks, these wild places are the source of clean water and  air for much of the State,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691570/public-lands-management"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…criminal investigations that are going on, maybe  this place should pay attention.\n\nThe beauty of it is, this type of scale for waste and fraud being the  largest in the entire country--remember, our preliminary score from CBO  of Medicare Advantage is $1.840 trillion, making that bill the single  biggest savings bill for a single bill in U.S. history,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…everyday goods and services, and they cannot afford this  regulation.\n\nLet me be clear. This action is necessary to stop one State from  dictating emission policies for the entire country. Prior to this  waiver being granted, California's own Air Resources Board readily  admitted this action would extend beyond its own State borders, and  several States…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691668/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}]