[{"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Middle East. He  could try to negotiate peace deals in Europe. Oh, wait, no. Actually,  he is cutting funding for NATO. Sorry, I forgot about that. In fact, he  just spent his entire day attacking his aggrieved lover.\n\nDonald Trump--let's see, this is June 5 at 2:37--on Truth Social  says: ``The easiest way to save money in our Budget, Billions and  Billions…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692039/consequences-of-doge"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…adolescents.\n\nRepublicans keep bringing up surgeries to shift attention away from  how extreme this bill is. This bill hypocritically bans safe and  effective medications for an entire group of people just because of who  they are, while still allowing them for everyone else.\n\nThis bill will not lower the cost of your healthcare. It will not  protect children.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698352/protect-childrens-innocence-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Republicans continue to full-scale attempt  to eliminate public education, decimating support for children in K  through 12 elementary schools, and threatening the future of the entire  generation.\n\nThe Labor, Health and Human Services, and Education funding bill was  cut from the same cloth as the agriculture funding bill we are  preparing to conference.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…the best interests of  their own personal finances. When Members of Congress are  able to trade off of our position, it damages the integrity of this  institution and of our entire democracy.\n\nAs Members of Congress, we have access to all sorts of information  that the average member of the public does not: what might be put into  a bill or taken out…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691216/stock-trading-ban-for-members-of-congress"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Trump has declared in order  to slap tariffs on 49 percent of products Americans buy from other  countries. It would terminate that.\n\nAgain, instead of picking a fight with the entire world, Donald Trump  should be focused on going after America's actual adversaries.\n\nThe Senate has the power and authority to stop Donald Trump's tariff  madness. We Senate…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689739/resolution"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…conditions, receive  fewer preventive services, and experience worse outcomes overall. This  must stop.\n\nIt is simply unacceptable. We cannot build a healthy world if we  leave entire communities behind. I hope Secretary Robert F. Kennedy,  Jr., is listening. Healthcare is real.\n\nLet's make America healthy again by keeping programs like Medicaid.  Let's…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…was impeached a second time  for inciting an insurrection, the House Judiciary Committee completed  an investigative report that documented what Members of Congress and  our entire Nation witnessed on January 6, 2021. When the articles of  impeachment were brought to the floor a week later, almost every House  Democrat was a cosponsor. I presided over…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698091/concerns-with-h-res-939"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…to this bill, which is a complete  and utter waste of the House of Representatives' time.\n\nIt asks the National Petroleum Council to do a study, and that is it.  That is the entire bill. In my opinion, to ask the National Petroleum  Council to do something it can already do on its own makes absolutely  no sense.\n\nThe House was out of session for over…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…stock  dividends.\n\nThe through line is clear. These policies have created uncertainty at  every level of our economy. They don't just take away jobs. They  destabilize the entire supply chain and the communities behind it.\n\nOregon workers and businesses deserve better. They deserve policies  that strengthen industries instead of pulling the rug out…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695603/devastating-harm-caused-by-trump-administration"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…American people. The discovery of natural gas in  the Utica and Marcellus shale deposits at the border in Ohio  and Pennsylvania is absolutely enormous, the largest on our entire  continent. We are seeing whole communities changed and revitalized  because of this. That was only made possible by the Department of  Energy's invention of fracking technology…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…for subsistence and they  have been an essential piece of their traditional culture and way of  life.\n\nBecause it is one of the largest remaining untouched ecosystems on  our entire planet, I believe we should strive hard to protect it. It is  so unique. People do want to travel there. But many would like to  ignore the fact that it is a fragile and irreplaceable…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697560/hj-res-131"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…responsibility in managing and  stewarding our national forests, and their kids should not be left  behind because of it.\n\nIt is a recognition that public lands benefit our entire Nation, and  the cost of maintaining essential services like schools and roads  should not fall solely on the shoulders of rural families.\n\nFor New Mexico's Second Congressional…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…are voting ``yes'' because Donald Trump tells  most of them how to vote, and he realized he has lost on this one.\n\nHe says that people who support this bill ``betrayed the entire  Republican Party.'' Really, really? How is accountability for a  pedophile, something Donald Trump campaigned on, how is that now a  betrayal? This was his issue, his idea.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696904/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…educational institutions, threatening their funding  if they do not do what they are told.\n\nThis now is a wannabe what? Taking over the central bank in order to  determine the entire economy.\n\nMr. Speaker, I ask my colleagues to join with me and support Lisa  Cook and Chair Powell at the central bank.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694804/in-defense-of-lisa-cook"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…in our  Nation were able to make progress and have fair wages, safe working  environments, access to affordable healthcare plans, and secure  retirements.\n\nI have spent my entire career as an elected official believing that  every worker should have the ability to form and join a union.\n\nAs a member of the Congressional Labor Caucus, I was proud to…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689606/protecting-federal-employee-unions"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, I rise today to inform folks  throughout California and the entire country of one of the biggest  scandals in our State's history, which is that Governor Newsom is  literally bankrupting Medicaid in our State. He is driving it insolvent  through…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…small street gangs.\n\nThey control territory, run armed convoys, use drones for  surveillance, and communicate through encrypted networks like the  military. They terrorize entire countries with extreme violence, and  they terrorize the United States of America and our people. They spread  carnage wherever they go, not just across the border but on our…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…to disaster relief and from mentoring programs to  feeding the hungry, the church has never wavered in its mission to live  out the love of Christ.\n\nMr. Speaker, I thank the entire church family for their 35 years of  faithful service, and I pray for many more years of impact and growth.\n\nGod bless Abundant Life Evangelistic Church, and God bless the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695571/recognizing-abundant-life-evangelistic-church-in-biloxi-mississippi"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Roosevelt reminded the  American people that despair is never destiny. Let me repeat that.  Despair is never destiny. He told them that courage, unity, and faith  could rebuild an entire nation from the brink of ruin.\n\nMr. Speaker, today the Iranian people are living through their own  era of hardship--economic collapse, political oppression, and constant…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…today to recognize the  unexpected but powerful example of American entrepreneurial spirit.\n\nRecently, Southern Living Magazine named NFA Burger the best  hamburger in the entire State of Georgia.\n\nSometimes, the American Dream looks different from what you would  expect, and in this case it looks like a cheeseburger served from a  Chevron gas station.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691783/recognition-of-richard-dick-wallace"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…It wasn't a drug arrest. It was a  war. It is a mini-war. But it is all over, so the War Powers Resolution  doesn't apply because the war is over.\n\nAnd yet, we still have an entire military blockade of a country, and  that is not a war. This is a real question.\n\nSo we have been given a legal opinion by the current administration,  and we had one of their…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699091/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…quarterfinal loss last season to the national  championship podium this year, this team exemplifies resilience and  heart.\n\nI congratulate the Knights, Coach Peterson, and the entire SVU  community. This championship belongs to all of them.      Honoring 75th Anniversary of Norfolk and Western Class J No. 611                                 Locomotive…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691982/recognizing-southern-virginia-universitys-ncaa-division-iii-mens-volleyball-national-championship-victory"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…seasonal tradition in our home state of Georgia: the Savannah Christmas  Market at Plant Riverside District.\n\nThis year, it was ranked as one of the top holiday markets in the  entire country by USA Today, drawing visitors from all over and  spotlighting the rich culture and community spirit of Savannah.\n\nThe market transforms historic River Street into…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698573/recognizing-the-savannah-christmas-market"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…time to pass the torch.\n\nAs Larry steps into retirement, I thank him for his courage,  dedication, and service, both in uniform and in the courtroom. Spokane  County and our entire region owe Larry Haskell a debt of gratitude.\n\nI congratulate Larry on a job well done and wish him all the best in  his next chapter.                        Firefighters Run…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693542/congratulating-larry-haskell-on-his-retirement"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…necessary to meet the challenges of feeding, clothing, and  fueling our Nation.\n\nAccess to agricultural education is critical not only for our rural  communities but for the entire country.\n\nAgriculture is the backbone of our economy. As I often say, food  security is national security, and investing in the next generation of  producers ensures that there…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687891/national-future-farmers-of-america-week"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…have a profound void in this Chamber. This  body and the Nation will miss him deeply.\n\nMr. Speaker, my prayers are with his wife, Jill; his children; his  grandchildren; the entire LaMalfa family, including his great staff. I  thank them for sharing him with us in service to our country.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698714/9999"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…was a good decision.\n\nThe average amount that a veteran had to pay back in their mortgage  was less than $25,000. Instead of solving the problem, VA chose to  purchase the entire loan, which, on average, was about $321,000. In no  way does this make sense to solve a $25,000 problem with a $320,000  solution. Therein lies the problem with our colleagues…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689695/montgomery-gi-bill-selected-reserves-tuition-fairness-act-of-2025"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…winning the title this week, the Gators ended the season with a  36-4 record making Gainesville, a/k/a Titletown, incredibly proud.\n\nMr. Speaker, I congratulate Coach Golden, the entire team, and, of  course, the Gator nation. These guys are absolutely incredible.\n\nAs always, it is so great and sweet to be a Florida Gator.\n\nGo Gators.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690032/recognizing-the-florida-gators"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…``yes'' on this resolution. I strongly  encourage all my colleagues to vote ``yes'' on H.J. Res. 89. I think it  is the right policy for all the reasons stated throughout this entire  day.\n\nMadam Speaker, I would say to you that if we don't want to see an  increase in the price of trucks, the price of maintenance on trucks,  the price of those trucks then…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690434/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…small businesses  across the Nation.\n\nPennWest Clarion SBDC continues to be a significant force for growth,  innovation, and local prosperity.\n\nMr. Speaker, I congratulate the entire team on their well-deserved  recognition and continued service to the Commonwealth of Pennsylvania.", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692189/recognizing-pennwest-clarion-small-business-development-center"}]