[{"senator": "Brad Sherman", "party": "Democrat", "sentence": "…food-borne disease.\n\nFinally, I think the withdrawal of the United States from the World  Health Organization and illegally ending American food programs also  exposes the entire world and ultimately the United States to  substantial risks. Remember that when somebody suffers from a disease  abroad, that gives a chance for the disease to replicate, mutate,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692798/agricultural-risk-review-act-of-2025"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Given its contribution to the global economy, Taiwan should certainly  not be locked out of membership. Not only will this benefit Taiwan, it  will benefit America and the entire world economy.\n\nIt should be noted, however, that while this legislation will assist  Taiwan, some Republicans are ignoring what the administration is doing  that will hurt our…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692795/taiwan-non-discrimination-act-of-2025"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…protecting more good-paying  manufacturing jobs right here in the United States of America.\n\nI am proud that my district is also home to the most famous airship  in the entire world, and that is the Goodyear Blimp.\n\nThis amendment, which is based on the Airship Improvement Research  for Safety and Humanitarian Innovation Projects Act, or the AIRSHIPS…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695128/my-amendments-to-hr-3838"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…people.\n\nThat is unacceptable by every front. Any way you slice it, it is  unacceptable. We are the richest country in the world. This Nation has  more than anyone else in the entire world. No one should go to bed  hungry. No one should be without a home. No one should fear being sick  because they can't access healthcare, not in America.\n\nThis is not a partisan…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698226/healthcare-affordability-crisis"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…reeducation, and forced labor, this  administration is trying to close Radio Free Asia as we speak. It has  shut down the only independent Uyghur language service in the entire  world.\n\nI thank Representative Kim and Representative Bera for their  leadership on this bill and hope this administration reverses course.  These cuts aid the CCP, not the victims…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694800/uyghur-policy-act-of-2025"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…proudly represent Kansas, often called the Wheat State, where  agriculture plays a critical role in our State's economy.\n\nKansas farmers feed not just the Nation but the entire world. In 2023  alone, Kansas farmers exported $5.2 billion in agricultural products  around the world. Grain farmers in Kansas and across the country  participate in a very competitive…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695052/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…refuge. The Arctic is an extremely remote and harsh environment  requiring specialized equipment and infrastructure, making it one of  the costliest places to drill in the entire world.\n\nThere have been multiple lease sales held in the Arctic National  Wildlife Refuge, which I want to emphasize is a wildlife refuge, and  still no legitimate oil and gas…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…said: No, that is ``physically  impossible'' to have all of the meetings needed to seal the deals. He  should have thought of that before he started a trade war against the  entire world.\n\nNow, he claimed that he was already negotiating with China to lower  tariffs and calm trade tensions, but China and Secretary Bessent said  that talks have not even started.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…has declared in order  to slap tariffs on 49 percent of products Americans buy from other  countries. It would terminate that.\n\nAgain, instead of picking a fight with the entire world, Donald Trump  should be focused on going after America's actual adversaries.\n\nThe Senate has the power and authority to stop Donald Trump's tariff  madness. We Senate Democrats…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689739/resolution"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…of the world convenes to accept the reality of the  climate crisis and to accept the related reality of coal being the  biggest contributor to carbon pollution, and the entire world is  talking about how to phase down our dependence on coal pollution and  fossil fuel pollution, we are here in this alternate reality of the  Republican majority, where…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…funnels billions of new dollars to ICE. This money makes ICE the  largest domestic police force in the United States with more resources  than dozens of militaries around the entire world.\n\nThis funding is unprecedented, and it is a free pass for ICE to ramp  up Trump's cruel and inhumane mass deportation policies.\n\nThey are already building concentration…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694186/pushing-back-against-ices-authoritarian-overreach"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…exclusive  authority to regulate foreign commerce. The Administration's abuse of  emergency powers to give himself authority to regulate foreign trade  and impose tariffs on the entire world bypasses the legislative  process, undermines transparency, and strips away the opportunity for  public accountability.\n\nThis is why, I urge my colleagues, especially Republican…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690134/opposing-the-chaotic-and-harmful-trade-policies-of-president-trump"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…prices and a better economy, are actively jacking up prices and tanking  the economy.\n\nLast year in Ohio, we imported $86 billion in goods. Now, nearly  every country in the entire world is dealing with these tariffs because  of a trade war that no one but one man wanted. The price of all of this  will fall on us.\n\nIt is a tax on nearly everything we buy,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689748/tariffs-lead-to-highest-sales-tax-on-americans-in-history"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…director come out?\n\nAnd they got back to me. And by the way, I was--since I was doing a  live feed, I said: Call me on my phone number. My phone number went out  to the entire world at that moment. And so I enjoyed having hundreds or  thousands of people, seemed like, called for weeks about this.\n\nBut they didn't come out. What they did is they called…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…end of the Second  World War. It also demonstrated to the world that a war between two  nuclear powers would be cataclysmic for both and potentially  apocalyptic for the entire world.\n\nAfter the war ended, Oppenheimer and many of the scientists who  participated in the Manhattan Project, knowing the dangers, spent much  of the remainder of their lives…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…ask for its immediate  consideration in the House.\n\nThe Clerk read the title of the resolution.\n\nMr. KILEY of California.  Res. 516.\n\nMr. Speaker, a couple weeks ago, the entire world witnessed  horrifying scenes out of Los Angeles: Molotov cocktails and bricks  being thrown at officers, Waymo cars being lit on fire, American flags  being burned, and…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…happening to French bonds, British  bonds, Japanese yields on the long end of the curve? When you see the  long end of the curve going up and up, that lets you know the entire  world is getting really nervous about long-term debt.\n\nRay Dalio, the billionaire, has been giving speeches around the  country. He even wrote a book saying you have a math problem.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…the concrete supply that supports our economy continues to  grow and thrive.\n\nThe IMPACT Act positions our country to rise to that challenge and  become a resource for the entire world.\n\nI thank Science, Space, and Technology Committee members, Mr. Miller  and Mrs. Foushee, for cosponsoring this bill and working in a  bipartisan fashion.\n\nMr. BABIN. Mr.…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…finance our debt? We have Ray Dalio, the multibillionaire hedge fund  manager, who is now retired, has actually been coming here to Congress  saying: Warning, warning. The entire world's capital markets--because  China is borrowing, Japan is borrowing, and now Germany is going back  into the debt markets--there is not enough capital in the world.\n\nWhen…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…peace. There was not a part of a country you could  give him to stop him from enacting his sick and twisted agenda. He  didn't want German-speaking populations. He wanted the entire world to  speak German. He wanted the entire world to fall under his Nazi regime.  He was nuts. And it took a bunch of people from all over the world,  particularly America, to…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…American lives were lost, as we learned in our briefing and as we  have seen, and it was a textbook example and demonstration of peace  through strength. The message to the entire world is clear: If you  poison and kill the American people, you are going to be held  accountable.\n\nArresting Maduro also advances America's national security. Maduro's  allies…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698571/venezuela"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Specifically, the  withdrawal itself locks up roughly 11,000 acres for helium exploration,  blocking development of one of the largest and most concentrated helium  deposits in the entire world.\n\nDon't let the rhetoric around this issue confuse what is at stake  here. The resolution before us today is about more than just one  project. There are two options, Mr.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "Mr. KENNEDY. Mr. President, as you well know, the American people are  the most generous people in the entire world. In our country, when you  are hungry, we feed you; when you are homeless, we house you; when you  are too poor to be sick, we will pay for your doctor. We spend  trillions…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…school pep rally, and  that pains me to say that.\n\nWe are all adults here, discussing some of the most important issues  facing the American public, I would daresay the entire world, right  here in this Chamber. The things that happen in this Chamber that  reflect poorly on us reflect poorly on every single one of us.\n\nI would say to you, Mr. Speaker,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688496/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to honor the Georgia  Ports Authority for their decades of servitude to Georgia, the United  States, and the entire world.\n\nGeorgia Ports authority operates the national gateway ports of  Savannah and Brunswick, allowing customers to compete and succeed in  global markets.\n\nThe Savannah Port…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694778/georgia-ports-authority"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…threats of tomorrow. By advancing this legislation, he is not only  helping Alaska, but the entire Nation, by ensuring we have the most  capable, prepared Armed Forces in the entire world.\n\nI also thank the U.S. Army for their continued service to our Nation  and for their collaboration on this effort. They strongly support this  bill, and we were grateful…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697636/public-lands-military-readiness-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…overturn the disastrous Biden administration's natural gas  tax on the hardworking American people.\n\nDuring a time in which energy demand across the United States and the  entire world is growing exponentially, the Federal Government should  make it easier to produce ever cleaner, reliable, and affordable  energy. Rather than supporting domestic energy…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688187/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…United States Congress, engaging in real  time, taking advice from someone that we have been listening to--being  lectured to as someone deserving of all of the scorn of the entire  world. He is. That is why we are here.\n\nIf my colleagues didn't think this was a concern, they would have  simply made a motion to table, but my colleagues decided to refer it…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696887/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…We need to study it first.\n\nAll right. How much do you need for studying it?\n\nI got them that, a quarter of a million. They had data done by a top  IT university in the entire world with 500,000 data points. Across 17  miles of river, it was determined that dredging needed to happen, so  the Corps of Engineers said: Okay, we need $50 million to accomplish…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694867/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…University, for more than a century, has been contributing to  the common good and advancing the goals of faith with purpose. It is  one of the flagship universities in the entire world for the Jewish  faith, and he has brought his aperture there to bring us all together.\n\nFinally, I want to recognize the need to succor. You said: Why are we  here? I am…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695300/dr-rabbi-ari-berman"}]