[{"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…cutting off trade with our closest allies right here  in North America.\n\nI am happy to listen to somebody's explanation here, but I don't  think it makes sense, and it seems entirely contrary to American values  to me. So I hope that my colleagues on the other side of the aisle will  see the folly in what the President is doing, will recognize the impact…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…their healthcare premiums  double, triple, or quadruple, costing them hundreds of additional  dollars a month, and more than 4 million Americans will lose their  coverage entirely. This includes 12,300 Ohioans in my district alone.\n\nThis Republican healthcare crisis is completely and entirely  preventable, and House Democrats and even a few Republicans…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698303/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…first African  American to serve as Maryland's United States Attorney. Despite the  historic nature of his service, Mr. Barron never sought out the  limelight--he focused entirely on doing his job and doing it well,  working closely with state and local law enforcement to implement  crime-fighting strategies that reduced violent crime.\n\nMost importantly,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688210/recognizing-a-trailblazing-career-in-criminal-justice-us-attorney-erek-lawrence-barron"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…corruption? No. But it is meaningful--and, boy, does it matter. That  means that President Trump and his Cabinet Secretaries will not have  the legal authority again to cut or entirely defund programs Congress-- all of us--funded just to free up taxpayer dollars for their own  priorities. It means Russ Vought does not again have the legal  authority to pick…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…the oil exception to the  filibuster rule.\n\nNow, the nuclear option has been used over nominees in the past. And  there has been debate about doing away with the filibuster entirely.  But, today, what we are talking about is only carving out the oil  industry from the filibuster--so not carving out protection for voting  rights; not carving out protection…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691621/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the floor, it is now 16 million people who will lose their health  insurance, primarily because of all this red tape.\n\nTaking health coverage from 16 million Americans is entirely  unacceptable, and there is no amount of rationalizing that Republicans  can do to make it any better. They said they have exemptions from this  paperwork. Those exemptions…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Trump administration and Republicans in both  Chambers have been using the CRA to overturn public lands protections  that have never been considered rules in the past. In an entirely  unprecedented move, they are moving forward, even though the Government  Accountability Office hasn't yet ruled on whether they believe this  public land order constitutes…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…restarted.\n\nIn Pittsburgh, a study for veterans struggling with opioid addiction  stalled out when a hiring freeze hit.\n\nIn Los Angeles, all chemotherapy treatments almost stopped entirely  before the VA reversed course.\n\nThese are not just numbers. These are people. These are veterans who  stepped up for this country, who are now wondering why the country will…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691392/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…maintaining the  enacted funding level for the National Endowment for the Arts and the  National Endowment for the Humanities, which the administration tried  to eliminate entirely. This funding will support the arts in  communities across the country.\n\nFinally, this bill supports Native American families by investing in  a strong and resilient Indian…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698754/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…for new SNAP       applicants certified in November, disaster assistance, or as       a cushion against the potential catastrophic consequences of       shutting down SNAP entirely. See Penn Decl. Doc. No. 14-2 \f       21.    Consideration of Diverting Section 32 Child Nutrition Funds or Other                               Funds to SNAP\n\n7. In addition…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Malnutrition globally is on the  rise. This is a global emergency, one that the United States has the  greatest capacity to help solve.\n\nThe burden should not and cannot fall entirely on us, but leadership  comes with a responsibility. We have the responsibility to continue to  do our part. The moment is calling us.\n\nOnce again, I will rise in this Chamber…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691610/global-report-on-food-crisis"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…extremists.''\n\nThe targeting--plus the potential loss of funding--has       shaken an industry in California that has been historically       underpaid, understaffed and run almost entirely by women,       most of them women of color and many immigrants.\n\nGovernment subsidies for child care cover only some of the       cost of care, despite California's recent…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…the higher equity requirement is the  difference between jumping in headfirst and creating new economic  opportunities for their communities and families or walking away  entirely.\n\nThis way of doing business just doesn't reflect our current economic  or technological realities. This bill offers a new opportunity for  Americans across the country to…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699167/main-street-parity-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…that will be measured in things like  cancer diagnoses. This gets personal pretty quickly when it is clean  air and health matters.\n\nInside the body, we have just opened an entirely new avenue for  mischief. It could be mischief by any 30 of us. Frankly, it could be  mischief by a minority of the majority who want to drive something  through that most…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Mr. DURBIN. Mr. President, I also want to draw attention to the  crisis surrounding medical research in this country, created entirely  by this new Trump administration.\n\nTen years ago, I met with Dr. Francis Collins, then the Director of  the National Institutes of Health, the world's premium biomedical…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698206/nih-funding"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…economy more than $70 million a day, and create  serious consequences for American family farms, our supply chain, and  our international trading partners. These disruptions are entirely  avoidable.\n\nWe are doing our farmers and export partners a disservice if we don't  do our jobs and get this critical piece of legislation across the  finish line. Mr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…economies and Main Street.  This financial burden would limit small businesses' ability to grow and  force some to reduce the size of their staffs or even close their doors  entirely. America can't afford to leave these men and women out to dry.\n\nDuring this National Small Business Week, we thank the hardworking  men and women who make up the more than…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690715/help-small-businesses-thrive-again"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…consumers that  it purports to protect.\n\nOne of the likely outcomes of this rule being fully implemented would  be low-income Americans being expelled from the financial system  entirely due to lack of overdraft protection. It is time that we add  this midnight rule to the burn pile.\n\nS.J. Res. 28, another Congressional Review Act resolution, would  overturn…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…books, I would ask  these two questions: First, if that were so, then where were those laws  under Joe Biden?\n\nSecond, even if their argument was true and the legislation was  entirely unnecessary, then why would they object to sending a strong  message around the world that terrorists will get no quarter here?\n\nMadam Speaker, if you have associated with…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…can look at is what  Pete Hegseth, who I think is going to be a great Secretary of Defense,  has pointed out. He feels, in today's world, aircraft carriers are  maybe not entirely obsolete but are not as valuable as they were 30  years ago. That should be obvious from what happened over the weekend  when Ukraine used drones to wipe out some aircraft…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692064/monitoring-big-beautiful-bill-provisions"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…I have introduced legislation to make the high-speed rail  project ineligible for further Federal funding at any point going  forward, which, again, the rail authority is entirely reliant on the  assumption of Federal funding just to get to a point where there is  only a $7 billion budget gap for just the first next few months.\n\nThe fact of the matter…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "John Thune", "party": "Republican", "sentence": "…individuals that they universally opposed.\n\nNot a single one of President Trump's civilian nominees has been  confirmed by unanimous consent or voice vote--again, something entirely  unprecedented in recent years. No other President since at least 1977  has failed to have civilian nominees confirmed by unanimous consent or  a voice vote at this point…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690974/business-before-the-senate"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…gas-powered vehicles to sell because of the inventory of  unsellable EVs. My constituents simply cannot afford this ridiculous  regulation and should not be forced to purchase entirely unaffordable  vehicles that do not meet their needs.\n\nOur economy was built on an open market and the freedom of consumer  choice. Congress cannot allow California to continue…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690494/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…furnishings industry, working side by  side with both his wife, Nancy, and his daughter, Barbara, he and Nancy  retired in 2008.\n\nIn 2009, they moved to Grass Valley. They were not entirely sure what  they wanted to do in retirement, but they met some wonderful friends  and soon became very involved with the Tea Party, the State of  Jefferson, and the Nevada…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…support, helping meet urgent needs.  What truly sets the Nature Coast Outreach Center apart is the heart  behind the mission. No one is paid--this life-changing work is powered  entirely by a group of selfless, committed volunteers who give their  time, energy, and love every single week. Their unwavering dedication  is a beautiful example of community in…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691893/recognizing-shawn-woodruff"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…where we sit today, is a  tribute not only to the organization but to the ideals it stands for:  duty, service, community, and character.\n\nThat memorial was made possible entirely through Scout-raised funds  in 1960, mostly in the form of dimes. Those Scouts who sent in their  dimes have their names engraved at the base of that statue, reminding  us…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694209/recognizing-the-congressional-scouting-caucus"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…of really key important  progrowth elements: no tax on tips or overtime, an increased child tax  credit, tax relief for seniors, an increased standard deduction  targeted entirely at the middle- and lower-income Americans, investment  in rural America. These are just a few of the reasons Americans will  see significant increases in their upcoming tax…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699064/how-republicans-have-delivered-for-americans"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…Boundary Adjustment Act. This bill, sponsored by Senator Padilla,  passed last year and would make a minor boundary adjustment to the  Golden Gate National Recreation Area. It is entirely noncontroversial.\n\nS. 1016 is the Vicksburg National Military Park Boundary Modification  Act. This bill, sponsored by Senator Wicker, is a minor but important  boundary adjustment…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…hands of a bureaucracy and  the tyranny of government-run health management rather than the ability  to get care.\n\nThe current situation with respect to healthcare exists entirely by  record of vote and a record of policies because my Democrat colleagues  put forward policies that the American people are having to live under  today.\n\nThey broke the…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…this  expiration, those aspects had to go away. Those are things that were on  the chopping block.\n\nAgain, I think when folks understand, the subsidies aren't going away  entirely. If a person is a low-income individual and making 100 percent  of the Federal poverty line--and for a single person, that is maybe  $15,000 or $20,000 a year--that plan will…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}]