[{"senator": "Sam Graves", "party": "Republican", "sentence": "…categories, if--\n\n``(A) submission to such remarks or conduct is made either       explicitly or implicitly a term or condition of employment,       pay, career, benefits, or entitlements of the individual;\n\n``(B) submission to or rejection of such remarks or conduct       by an individual is used as the basis for decisions affecting       that individual's…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…which will  enable the State to satisfy a large portion of its outstanding  statehood land entitlement and unencumber other lands that have been  selected to fulfill the entitlements of Alaska Native Corporations, the  University of Alaska, and Alaska Native Vietnam Veteran land  allotments.\n\nIn 2006, as directed by the Alaska Land Transfer Acceleration…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…2,683.035      15,501.026      36,220.398 ---------------------------------------------------------------------------------------------------------------- Includes entitlements funded in annual appropriations acts. Certain budgetary changes related to reconciliation\n\nlegislation pursuant to section 3001 of H.Can. Res. 14 will be held in reserve…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691578/fiscal-year-2025-enforcement-filing"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Citizenship  and Immigration Service announced improvements to their voter  verification system. Now, States can use a program named the Systematic  Alien Verification for Entitlements to verify that only citizens are  voting in the Federal elections. This is welcome news.\n\nSo here is why it is welcome news: During the 2024 election, Iowa's  election official,…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697595/voting"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…comic book in Peru. This is the low-hanging fruit.  If Congress can't vote to cut this egregious, crazy, leftwing lunacy,  will Congress ever have the courage to tackle entitlements?\n\nYet there does remain a significant constitutional question as to  whether these cuts need a congressional vote to give them permanence.  Today, with my amendment, Congress…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688899/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…but there are a couple of datasets out  there saying we may be up against already having more deaths than  births.\n\nUnderstand the way we deliver and finance the earned entitlements,  the earned benefits. Today's worker pays for today's retirees. Last  week, I showed a number of charts that, those numbers in 10, 20 years,  it is you and your partner,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…software paid for by, in use       at, or deployed throughout the agency, which shall include--\n\n(1) the current software inventory of the agency, including       software entitlements, contracts and other agreements or       arrangements of the agency, and a list of the largest       software entitlements of the agency separated by provider and…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698153/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…actually believes in  law and order.\n\nSo I would hope that city leaders who defy our Federal laws shouldn't  be entitled to Federal tax dollars. Federal grant dollars are not  entitlements. They are not unconditional welfare for far-left  activists. If you want Federal funds, you have to comply with Federal  law.\n\nSanctuary cities are in open defiance of Federal…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696003/unanimous-consent-requests"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…that sets off  fear.\n\nDid I mention in the beginning here, you have got less than 7 years  and the Medicare trust fund is gone. If we are going to preserve these  earned entitlements--these are earned programs. You worked for years.  You earned this. This was part of the societal contract. People like me  here, we have got to figure out how to finance…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…has also served as President of the North Texas Mayors Association  and board member of the Celina Rodeo Foundation Board. In addition, he  has been the Vice President of Entitlements for Centurion American  Development Group since 2013. Under his leadership as Celina's mayor,  the city experienced remarkable economic growth and investments. Sean  also…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690277/recognizing-congressional-patriot-award-recipient-sean-michael-terry"}]