[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…this  abyss of wickedness, let it be that our immigration apparatus needs  bold and systemic change, and may that change be a system centered in  compassion, not cruelty; entrusted to competent officers, not  kidnapping traffickers and killer thugs, and bent toward justice, not  broken by ICE.\n\nMr. ESPAILLAT. Mr. Speaker, may I inquire as to how much…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699655/horrific-ice-abuses"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…for the American people. That is what leaders have  done, particularly those who have served in the White House, when it  comes to actually lifting up the people who we are entrusted to  represent. That is what great leaders do, leaders like FDR, President  Johnson, President Obama, and so many others. That is what the track  record says.\n\nThe American…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…that he intends to seek his payout of tens of millions of dollars from  Federal taxpayers.\n\nIt should be clear to everyone here: Under no circumstances should  the power entrusted to us as Members of Congress be used to line your  own pockets, period, full stop. Anyone who voted for this appalling  provision, including all but two House Republicans…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696924/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…we  can, because we owe it to our constituents to fight every Executive  order that undermines our democracy and to keep demanding answers on  the firing of Federal workers entrusted with safeguarding our  elections.\n\nSo over the course of the next hour, Senate Democrats will lay down a  marker. We will stand strong against the rising tide of attacks…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "The Natural Resources Committee is entrusted with working on behalf  of Indian Country. While we don't always agree on everything, we have a  long history of bipartisan work and a shared commitment to advancing  legislation…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698657/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…held  that Congress can delegate full legislative authority to the District  of Columbia for local matters. However, Republicans choose not to do  so.\n\nPolice officers are entrusted with extraordinary authority to protect  public safety. The vast majority of officers exercise it honorably and  bravely. However, there must be accountability and transparency…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…night to the following morning, such as this one,  after a very long 6 months on this bill.\n\nWhat really matters in these next few moments is that the decision we  have been entrusted by the American people to make will have  ramifications for millions of our fellow Americans and indeed for our  country for decades to come.\n\nThere may not be a lot of people…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693195/one-big-beautiful-bill-act"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…policy advisor, Aleksi  Knepp, for her outstanding service to my office over the past 2\\1/2\\  years.\n\nSince joining my team in 2023 as legislative assistant, Aleksi has  been entrusted with a wide portfolio of issues, but her leadership on  agriculture and education policy has made a lasting mark on my office  and Illinois' 13th district. In these roles,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695855/thanking-aleksi-knepp-for-her-service-to-illinois-13th-congressional-district"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…naysayers that it can be  done.\n\nMr. Chair, I will compliment the chair of the full committee for  understanding the need to reassert the constitutional power of the  purse entrusted to the Congress through the Appropriations Committee  and that we do have to hammer out the bills in a civil way; not for the  purposes of the process but for what the consequences…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…consensus that this is a  mission worth you risking your life?\n\nThat is why that provision is so sacred in the article I branch, and  that is why even George Washington was not entrusted by the Framers of  the Constitution to make a decision like this on his own.\n\nI will finish where I started. This is not about dissatisfaction with  President Trump. I filed…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…the United States of America's  elections will be decided by the voters, not by force.\n\nColleagues, we as a Congress have a responsibility to act to protect  the elections entrusted by the Constitution to us and to the States  before it is too late.\n\nWe have a responsibility to reject this SAVE Act, to keep Federal law  enforcement away from polling…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…more than $8 trillion of American treasure spent.\n\nThat is why the Founders said the consequences of conflict, of  entering into war, are so significant they must never be entrusted to a  single person, not even the person who sits in the Oval Office. That is  why they wrote the Constitution, placing the responsibility for that  here where it can be…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693126/motion-to-discharge-sj-res-59"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…bursting into a flame,  lest instead of warming it should consume.\n\nIt is important, likewise, that the habits of thinking in a free  country should inspire caution in those entrusted with its  administration to confine themselves within their respective  constitutional spheres, avoiding in the exercise of the powers of one  department to encroach upon…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Yet, these protections are meaningless without strong and consistent  enforcement. House Republicans are standing by in silence as the  Federal Trade Commission, the agency entrusted with enforcing this bill  and several others under consideration this afternoon, is compromised  by the Trump administration and the President's illegal political  attempt…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690174/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…performing  their sworn duties, and yet their service was treated as disloyalty.  Careers were ended and decades of expertise were discarded just for  doing the job they were entrusted to do.\n\nWe have seen the Chairman and Deputy Chairman of the National  Intelligence Council dismissed because their well-documented, evidence- based assessment of the Venezuelan…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…and where.\n\nIt is that simple. It will require universities to pick their  partners carefully and make sure they are safeguarding the very  technologies that they are being entrusted to house on behalf of the  U.S. Government and the U.S. people.\n\nWe don't need to enable the Chinese military through modernization,  weaponization, or their attack on us,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689026/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…last year.\n\nFree and fair elections are a prerequisite for the healthy Republic  that our Founding Fathers envisioned in the District of Columbia as the  epicenter, and they entrusted its care to Congress in Article I,  Section 8, Clause 17 of the U.S. Constitution.\n\nOn November 21, 2022, the D.C. City Council made a radical decision  to allow noncitizens,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692315/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…didn't do it so we could  have $50 trillion of debt and destroy our own country from within. That  is what is happening.\n\nThis country is weaker because the very individuals entrusted to  defend her, defend the Constitution, and be responsible stewards of the  Treasury have failed them and continue to fail them.\n\nLet me be very clear about the budget we…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…of this institution is in question.\n\nEvery Member of this House has a duty to uphold the Constitution's  system of checks and balances by exercising its Article I powers  entrusted to us.\n\nThe executive's military exercise to capture the leader of Venezuela  represents one of the most blatant usurpations of congressional  authority we have seen in modern…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699373/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…later  commanded the 4th Ranger Training Battalion, helping to shape the  Army's toughest trainees into elite warriors.\n\nThroughout his career, General Mingus was repeatedly entrusted with  greater responsibility. This was a reflection of the confidence placed  in him by soldiers and senior leaders alike. Over the course of his  career, General Mingus…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699779/9999"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…duty on the part of Congress.\n\nTo commit America's military to fight wars on behalf of the Nation is  the most consequential and humbling responsibility that Congress is  entrusted with. If we are to ask our young men and women to fight and  potentially give their lives, then we in this body can at least muster  the courage to debate if American military…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…Cole for his steady leadership. This has been a  courageous effort on his part and our committee to restore regular  order to the way we apportion taxpayer moneys that are entrusted to us.  This legislation is a product of good faith, bipartisan negotiations.\n\nI thank and recognize Ranking Member Meng and Ranking Member DeLauro  for their partnership…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698761/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…McCLAIN.  Mace).\n\nMrs. McCLAIN. Mr. Speaker, I want to be clear. These rescissions  should get bipartisan support. We, as elected officials on both sides  of the aisle, have been entrusted with the hard-earned tax dollars of  the American people.\n\nThe duly elected President of the United States has asked this  Congress to protect the American people's tax dollars.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…each day, may we too be able to answer that question  with certainty, having served with purpose, led with integrity, and  upheld the ideals that Franklin and our Founders entrusted to us.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688220/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "John Rose", "party": "Republican", "sentence": "…of politically motivated  investigations. However, the solution isn't for aggrieved lawmakers to  get a payday at taxpayer expense.\n\nAs Members of Congress, the people have entrusted us to be a check on  the executive branch. They didn't send us here to collect checks when  the executive oversteps.\n\nAll Members of the House should take issue with Senate…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696927/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…our very own  North Star. Our North Star is governance, Mr. Speaker. Deviating from  governing does not serve the American people, nor does it make good on  the mandate they entrusted us with.\n\nThe compromise agreement of dead pairing that was formulated and led  by the Speaker and others is grounded in existing precedents,  practices, and, ultimately,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Brunswick, Georgia. FLETC's mission is to facilitate  the training of Federal, State, local, and Tribal law enforcement  officers, as well as international partners that are entrusted to  enforce the laws, treaties, and regulations within the United States  and abroad.\n\nIn the 1960s, studies revealed an urgent need for Federal law  enforcement training…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693004/fletc-celebrates-55-year-anniversary"}, {"senator": "French Hill", "party": "Republican", "sentence": "…bursting into  flame, lest instead of warming it should consume.\n\n``It is important, likewise, that the habits of thinking in a free  country should inspire caution in those entrusted with its  administration, to confine themselves within their respective  constitutional spheres, avoiding in the exercise of the powers of one  department to encroach upon…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700272/president-washingtons-farewell-address"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Dow, from Sioux  Falls, who was killed on Omaha Beach on D-Day. Private Dow was 19.\n\nThese men gave their entire lives to defend our freedom and secure  peace for us. They entrusted to us the future they would not see  themselves, and they call on us to defend the peace they won.\n\nIn one of his Memorial Day proclamations, President Reagan wrote:\n\nThe…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691674/memorial-day"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…my colleague  from North Carolina for his leadership in advancing this important  legislation.\n\nProtecting our Nation's children is among the most solemn  responsibilities entrusted to Congress.\n\nOur criminal statutes must be clear and effective so that individuals  who exploit children are held fully accountable under the law. When  ambiguity exists,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698894/child-predators-accountability-act"}]