[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…increase if something  isn't done.\n\nThis will be a massive hit to working families. It will be especially  harmful to middle-class families, small business owners, and  entrepreneurs, seniors, and people living in rural communities. It will  force States to reduce coverage and shift resources away from other  priorities like education and public safety.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695651/healthcare"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…Plain  Language in Contracting Act.\n\nFar too often, bureaucratic barriers and complex government jargon  prevent small business owners, especially veterans and immigrant  entrepreneurs, from accessing and securing Federal contracting  opportunities.\n\nI consistently hear from small business owners in Orange County that  the main reason they do not apply…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691852/plain-language-in-contracting-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…gas.  Every day, it seems more and more people are getting laid off. The  American Dream is increasingly out of reach.\n\nA core engine of our economy has always been the entrepreneurs who  take the risk of starting their own company. By implementing key  changes to the legal definition of a venture capital fund, H.R. 4429  will make it easier for capital…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697193/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…is why it is essential that, as Members of  Congress, we support legislative initiatives aimed at identifying and  addressing the obstacles that small business owners and entrepreneurs  face.\n\nThe SERV Act is one such initiative. It would enhance outreach and  promotion of existing veteran-focused small business programs, ensuring  that veterans can access…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687889/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "Mr. Speaker, I rise in strong opposition to H.R. 2966, the American  Entrepreneurs First Act.\n\nIf we really wanted to put American entrepreneurs first, we would be  debating a bill to strengthen SBA lending and make it easier to access  capital, or we…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…Reservists and Veterans Act, or the SERV Act, which I introduced  alongside Representatives Alford and Conaway. This bill honors our  veterans' service by helping them succeed as entrepreneurs and small  business owners.\n\nMy mom served in the Army for 20 years, and my grandfather served in  the Army, as well. Through them, I learned about service, leadership,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687887/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…bill requires that SBA collaborate with the National  Council on Disability to help employers hire more people with  disabilities and provide much needed support to these entrepreneurs.\n\nMr. Speaker, I thank Mr. Stauber, Ms. Simon, Mr. Alford, and Mr.  Pappas for their bipartisan collaboration on this bill, and I reserve  the balance of my time.\n\nMr.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691776/thinkdifferently-about-disability-employment-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…Business Administration plays a critical role in providing capital to  our small businesses. The Community Advantage program has a  demonstrated track record of helping entrepreneurs who face higher  barriers to accessing capital grow and scale their businesses.\n\nThis is exactly what we should be doing: opening more doors for more  Americans to start…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692067/capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "Mr. Speaker, I am pleased to support H.R. 828, the Successful  Entrepreneurship for Reservists and Veterans Act, also known as the  SERV Act.\n\nVeteran entrepreneurs are powerful economic engines and job creators.  More than 1.6 million veteran businessowners employ nearly 3.3 million  Americans and make approximately $983.9 billion…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687886/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…the Nation's scientific research enterprise and  appropriated dollars.\n\nI have visited my friends in over 250 unique small businesses, small  manufacturers, innovators, entrepreneurs, and training centers. The  innovation story is powered by Michigan's incredible workforce, our  hardworking men and women, and those large concentrations of engineers…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691394/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…operate on the thinnest of margins in the most  uncertain of activities, subject to weather and price fluctuations and  so many other things that make our farmers courageous entrepreneurs.  But why add 25 percent to the cost of fertilizer when that input cost  is already so high? It is mind-boggling to think that this is a  voluntary action by the President.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…telling us that it is immigrants who are taking from the community  and from the people. Well, that is a lie.\n\nIt is a lie because we understand that 23.6 percent of all  entrepreneurs are immigrants. Some undocumented, some are legal  permanent residents, and some are naturalized citizens. Mr. Speaker,  $1.7 trillion in spending power is what immigrants…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…consideration of H.R. 2483, SUPPORT for Patients and  Communities Reauthorization Act of 2025; H.R. 2931, Save SBA from  Sanctuary Cities Act of 2025; H.R. 2966, American Entrepreneurs First  Act of 2025; and H.R. 2987, CEASE Act of 2025.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1692002/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…decades of outsourcing of U.S. production.\n\nI am really shocked at what they have done. This impulsive decision  is a direct blow to family-owned businesses and American entrepreneurs  competing against Communist China, Mexico, and every other low-wage  haven in the world.\n\nThis decision delays critical upgrades, injects uncertainty into  local production…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698082/funding-manufacturing-extension-partnership-offices"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…Act.\n\nI thank Congressman Stauber and Congresswoman Gluesenkamp Perez for  joining me in introducing this bipartisan legislation.\n\nMr. Speaker, small business owners and entrepreneurs take a chance  when they start their ventures, so it is only right that the Federal  Government do what it can to provide them with a greater opportunity to  succeed.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687943/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…and manage risk in today's economy.\n\nThe bill maintains investor protections, while removing arbitrary  barriers that have held back individual investors and early-stage  entrepreneurs alike.\n\nMrs. WAGNER. In closing, Mr. Speaker, the Fair Investment  Opportunities for Professional Experts Act maintains investor  protections while removing arbitrary barriers…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692776/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Act.\n\nMr. Speaker, I rise today in support of H.R. 825, the Assisting Small  Businesses Not Fraudsters Act.\n\nMr. Speaker, SBA financial assistance programs are critical to  entrepreneurs. Unfortunately, fraudsters infiltrated pandemic-era loans  at an alarming rate. An estimated $200 billion was stolen from honest,  hardworking small businesses who needed…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687935/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…deserve access to these services in a  safe, secure environment.\n\nThis bill would codify two of President Trump's executive orders:  Protect SBA employees, and safeguard the entrepreneurs who fuel our  economy.\n\nMr. Speaker, I urge my colleagues to support this rule and the  underlying bill.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691945/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…a  simple truth: A nation that unleashes the talent of its people will  never be left behind.\n\nFor too long, outdated regulations have stood in the way of our  brightest entrepreneurs gaining the capital that they need to build,  grow, and compete.\n\nThe INVEST Act changes that and opens the door for new investment. It  gives small businesses from rural…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697830/increasing-investor-opportunities-act"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…motion in just a moment, but first, let me explain  why I am doing this. This week is National Small Business Week, a week  to recognize the achievements of our Nation's entrepreneurs.\n\nAs chair of the Small Business Committee, I have a front row seat to  the successes and challenges of our small business owners, and I have  the privilege of being a…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690896/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…toward identifying and  mitigating risks early, strengthening the long-term viability and  affordability of the 504 loan program and ensuring continued support  for American entrepreneurs.\n\nMadam Speaker, I urge my colleagues to vote ``yes'' on H.R.\n\nMr. WILLIAMS of Texas. Madam Speaker, I yield such time as he may  consume to the gentleman from Florida…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699188/504-program-risk-oversight-act"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…Association, Governor's Scholars Foundation, Central  Bancshares, Baptist Health, Kentucky-American Water Company, and the  American Heart Association.\n\nWayne has mentored young entrepreneurs, student athletes and  journalists who have become respected leaders in their fields and  established exceptional businesses across the state. His coaching  success and…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696267/tribute-in-honor-of-wayne-martin"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Legends of Aviation.\n\nFounded in 2003, the Living Legends of Aviation awards recognize  individuals who have significantly impacted the aviation industry. This  includes entrepreneurs, innovators, industry leaders, astronauts,  record setters, pilots turned celebrities, and celebrities who have  become pilots.\n\nA Savannah native, Mr. Burns earned his…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699886/mark-burns-inducted-into-living-legends-of-aviation"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…the entire Nation.\n\nThis resolution overturns this waiver, protecting the right of every  American to choose the vehicle that works best for them. For many  consumers and entrepreneurs, they see conventional gas-powered cars as  reliable, affordable, and able to meet the needs of their families and  small businesses. Yet, the Biden administration chose…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690487/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…the  Northern Mariana Islands Small Business Access Act. This bill was  introduced by Delegate King-Hinds and Representative Conaway.\n\nThe SBA microloan program provides entrepreneurs with access to  small-dollar loans through qualified lenders. Sometimes, entrepreneurs  do not need to access large sums of capital for their operations. That  is where…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699176/northern-mariana-islands-small-business-access-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. Mr. President, this is Small Business Week, a time to  celebrate the entrepreneurs and innovators of our communities, the  farmers and ranchers, the sons and daughters carrying on the family  business. These hard-working Americans are the backbone of…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690626/national-small-business-week"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…sure that Federal taxpayer dollars are not  funneled into lawless sanctuary cities that put illegal aliens ahead of  their own citizens.\n\nWhy should hardworking American entrepreneurs in law-abiding  communities be second in line to support from their own government?  They shouldn't be.\n\nThis bill will relocate SBA regional offices from sanctuary  jurisdictions…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692100/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…That kind of momentum deserves our full support. We should be doing  everything we can to encourage investment, foster innovation, and make  it easier, not harder, for entrepreneurs to succeed. That is why I  introduced the Helping Angels Lead Our Startups Act, otherwise known as  the HALOS Act.\n\nThis bipartisan bill, which I am proud to lead alongside…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692723/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "Mr. MEUSER. Mr. Speaker, this week we recognize National Small  Business Week and, with it, the incredible contributions of our many  small business owners, workers, and entrepreneurs across Pennsylvania  and the United States.\n\nThese individuals, Mr. Speaker, deserve more than recognition; they  deserve our support and applause. Small businesses aren't…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690760/national-small-business-week"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Arabs cut us off, we were told we had no energy in this country. What  has happened? If you put the right laws in place and have the  regulations that follow and turn the entrepreneurs and innovators loose  in this country, we are number one in the world--number one in the  world. We produce more natural gas. It is the cleanest.\n\nThis is what we are looking…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698073/improving-interagency-coordination-for-pipeline-reviews-act"}]