[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…of their       pregnancy or parenting status.\n\nStudents who are pregnant and/or parents deserve to       complete their education free from bias and harassment, in       environments that support them on their educational journeys.       Unfortunately, pregnant and parenting students are routinely       stigmatized, discriminated against, and denied…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…didn't become less competitive. They gained access to broader markets  and built the strongest economy in the world.\n\nWhen our universities created more inclusive learning environments,  they didn't sacrifice excellence. Instead, they became global leaders  in research and education.\n\nThe world is always watching us to see what we will accomplish, but…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690322/ending-of-dei-programs-through-executive-order"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…workforce. It is only because of  the ability to collectively bargain and form unions that workers in our  Nation were able to make progress and have fair wages, safe working  environments, access to affordable healthcare plans, and secure  retirements.\n\nI have spent my entire career as an elected official believing that  every worker should have the ability…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689606/protecting-federal-employee-unions"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…Policing Americans  in their own communities is not the National Guard's job. They can't  make arrests, and they are not adequately trained to carry out police  duties in urban environments.\n\nThese deployments are yet another Trump move straight out of the  Authoritarian 101 textbook. They further jeopardize civil rights while  distracting our troops from executing…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696180/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…receive preschool training to get them ready for school.  They would receive medical and dental care. Their parents would receive  counseling on how to provide the best environments for them at home.\n\nMr. Speaker, 60 years later, Head Start's legacy continues to make  America proud. This Federal program has served nearly 40 million  American children.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691246/9999"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…work of our school custodians is immensely important, for  they are the quiet champions of our schools working diligently, day in  and day out, to ensure that our learning environments remain clean,  safe, and welcoming. They are often the first to arrive and the last to  leave, faithfully fulfilling their duties with dedication and pride.  National Custodian…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697118/recognizing-national-custodian-appreciation-day"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…advocacy, Henry devoted 34 years to the Rochester City  School District, most of them as a beloved kindergarten teacher. In his  dual-language classrooms, he cultivated environments where children of  all backgrounds could learn together, honor one another's cultures, and  see themselves reflected in their education. Through his teaching,  Henry inspired…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695845/recognizing-henry-padron-morales"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…lumber markets and supply chains.  Some of it comes through outdoor sports industries--hunting, fishing  and scuba and skiing--as climate disruptions disrupt the natural  environments that they need.\n\nThe first biggest shock will come through insurance markets as  climate risks make real estate uninsurable. This disruption kicks off a  cascade: Climate…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…``front line'' firefighters and advanced rescue  capabilities through the acquisition of cutting-edge thermal imaging  technologies to better locate victims in low-visibility environments.  As we look ahead, I remain committed to working with Metro Fire to keep  them on the frontline of emergency and disaster response, with the  resources necessary for any…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698078/recognizing-sacramento-metropolitan-fire-districts-25th-anniversary"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…the watershed of the Boundary Waters Canoe Area Wilderness.\n\nCopper sulfide mining is the most toxic industry in America, and it  is particularly ill-suited to water-rich environments because it  acidifies the water. It leaches heavy metals like arsenic, lead, and  mercury into that water, which is part of the reason it has never been  done in Minnesota…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699272/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…essential ecosystem services, including clean  air, water, carbon sequestration, and critical wildlife habitat.\n\nProtecting the wilderness is not just about preserving pristine  environments. It is also about safeguarding our national heritage and  ensuring a healthy planet for future generations.\n\nI thank Representative Hill for his work on expanding the wilderness…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691097/flatside-wilderness-additions-act"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…teacher, principal, director, assistant superintendent,  and superintendent--holding the latter position for 15 years.  Throughout her journey, she has built inclusive learning environments  by collaborating with school boards and communities to ensure that  every student has the opportunity to thrive.\n\nSuperintendent Ahmadi holds a bachelor's degree from San…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691728/recognizing-parvin-ahmadi"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…school discipline practices. Make no  mistake: These decisions have a direct impact on Black children,  children who deserve a fair shot to learn in safe and supportive  environments.\n\nLet's talk about housing. HUD announced plans to gut fair housing  rules meant to fight discrimination. Those are the same ones that he  violated back when he was a landlord…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…Mr. Speaker, for the women in your life whose stories  you don't even know, for the women across the country whose lives you  may not even understand--the choices and the environments that they  live in--and for the women in America who have gone through things some  people can never even imagine, I ask my colleagues to vote ``no'' on  this misguided…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699312/pregnant-students-rights-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…the home front, as well.\n\nThese veterans don't just serve alone. Military families sacrifice  right alongside their servicemember. Many are exposed to the same  hazardous environments as those in uniform. They are left to care for  that servicemember when their time is done, and they do so willingly  and with courage.\n\nMr. Speaker, to denigrate them by…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696762/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…the Department's workforce, and I thank Representative  Gonzales for introducing this bill.\n\nIndividuals within the U.S. Customs and Border Protection work in  high-stress environments, protecting our air, land, and sea borders.  One way to help address the stressors that they face and support their  mental health needs is by using therapy dogs.\n\nThat…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696972/providing-emotional-assistance-with-relief-and-love-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…(I) by amending subparagraph (A) to read as follows:\n\n``(A) examine--\n\n``(i) the causes and ecological consequences of hypoxia on       marine and aquatic species in their environments; and\n\n``(ii) the costs of hypoxia, including impacts on food       safety and security;'';\n\n(II) by redesignating subparagraphs (B), (C), and (D) as       subparagraphs…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695277/harmful-algal-bloom-and-hypoxia-research-and-control-amendments-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…emergency communication and       tracking technologies for use in locating trapped individuals       in confined spaces, such as underground mines, and other       shielded environments, such as high-rise buildings or       collapsed structures, where conventional radio communication       is limited.\n\n``(2) Activities.--In order to carry out this subsection,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693439/institute-for-telecommunication-sciences-codification-act"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…on hold in our communities  that they desperately need, like stormwater, schools, and even sewer  treatment plants not under construction, protecting our most precious  environments. But we can't unless the permits can be issued.\n\nThis is about predictability, federalism, and letting the States  manage their own waterways. It is proinfrastructure, prodevelopment,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698027/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Mike Turner", "party": "Republican", "sentence": "…support this American institution and organization, which is based here  in Washington, D.C., that defends our interests around the world in  some of the most challenging environments.\n\nMr. Chairman, I urge my colleagues to support this American-first  legislation.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699043/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…5, 1991, when he enlisted in the United States Army. Over  a remarkable twenty-year career, he rose to the rank of Sergeant First  Class, serving in diverse and demanding environments across the globe.  After completing his initial training at Fort Sill, Oklahoma, he was  assigned to the 4th of the 11th Field Artillery at Fort Richardson,  Alaska, where…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691145/recognizing-sergeant-first-class-leidlein-as-may-2025-veteran-of-the-month"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…customers.  Importantly, this legislation would help identify States that have  caused or contributed to a decline in U.S. petrochemical refinery  capacity.\n\nHostile regulatory environments, like in California, have led to the  shuttering of several refineries. California used to be home to over 40  refineries in the 1980s. This number has now decreased to…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697029/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Headquarters Battalion,  expanding his technical and operational expertise in unmanned aerial  systems.\n\nMr. Moceri's service included multiple overseas assignments in  challenging environments. Early in his career, he joined a Special  Purpose Marine Air-Ground Task Force for operations in Norway, where he  participated in NATO exercises under Operation Thunder…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699292/recognizing-united-states-marine-corps-veteran-domenico-s-moceri"}, {"senator": "James Risch", "party": "Republican", "sentence": "…launch tube assembly. The LwCLU incorporates an integrated       day-night sight that provides a target engagement capability       in adverse weather and countermeasure environments. The LwCLU       may also be used in a stand-alone mode for battlefield       surveillance and target detection. The LwCLU's thermal sight       is a 3rd generation Forward…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692048/arms-sales-notification"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…reduce  regulatory burdens. They protect our national security, and they ensure  that America can lead the way in deploying undersea cables while  protecting our marine environments.\n\nMr. Speaker, I want to thank Congressman Carter for his leadership on  this issue. I urge my colleagues to support this legislation, and I  yield back the balance of my…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…the World Trade Center occurred. Over  a remarkable near-decade career, Scott worked to forge strong  relationships with foreign leaders, serving in diverse and demanding  environments across the globe. Scott and his unit conducted hundreds of  combat missions, demonstrating bravery and commitment.\n\nDuring the intense second Battle of Fallujah, Scott was…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692240/recognizing-scott-gatto-as-june-2025-veteran-of-the-month"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…mental illness are being served in locations that  were not designed for clinical care. That is unacceptable. They deserve  better--safe, dignified, purpose-built treatment environments that  reflect the seriousness of their needs and the inherent dignity of  their lives.\n\nH.R. 3620 clears the way for Southcentral Foundation to build that  future. This…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698112/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…procedure.\n\nI commend perioperative and procedural teams in hospitals across  Texas' 21st Congressional District for their hard work and dedication  every day to ensure safe environments for procedural and surgical  patients. I also applaud their efforts to reduce unnecessary healthcare  costs.\n\nToday, I recognize these efforts on behalf of my constituents,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692335/recognizing-national-time-out-day"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…medical assistance. They  offer calm in chaos, hope in despair, and lifesaving care under  pressure. They work long hours, often in physically and emotionally  demanding environments, yet continue to serve with unwavering  dedication.\n\nThe job requires technical skills, physical strength, deep  compassion, and a calling to serve others.\n\nEMS providers…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691586/recognizing-national-ems-week"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…most of these companies and the people who run  them live in the very communities affected by emissions. They have  every reason to care about cleaner air and healthier environments.\n\nWhat they need is smart, flexible policy, not arbitrary and  capricious restrictions that stifle growth and reduce competitiveness.  S.J. Res. 31 would restore a proven…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}]