[{"senator": "Seth Moulton", "party": "Democrat", "sentence": "…served as the  Archbishop of Constantinople--New Rome and Ecumenical Patriarch, a role  that traces its lineage to the earliest days of Christianity. As the  ``first among equals'' among Orthodox Christian leaders, he has been a  central figure in promoting unity within Orthodoxy, religious freedom  globally, and constructive dialogue among faiths.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695352/welcoming-his-all-holiness-bartholomew-to-washington-dc"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…20th Congressional District, I congratulate His All Holiness  Bartholomew on receiving this great honor.\n\nHe is the spiritual leader, and the Primus inter Pares--First among  Equals--of Orthodox Christianity worldwide, a Church of 300 million  people. Named as one of the world's most influential people by Time  Magazine, His All Holiness is an exemplary…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695852/recognizing-the-ecumenical-patriarch-of-constantinople"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…longstanding precedent rooted on independent  political spending by corporations and billionaires.\n\nThe conservative majority embraced the idea that spending money on  elections equals speech and that corporations are entitled to the same  speech rights as people, giving carte blanche to corporations and  billionaires to spend unlimited money.\n\nWhen money…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699240/restoring-election-integrity"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Yet, we must look for ways to press our case even more forcefully.  Just yesterday, I voted against more blank-check funding for ICE and  CBP. No accountability and no reform equals no taxpayer money.\n\nI call on every Member of this body to hear the cries of communities  from coast to coast: Impeach Kristi Noem, end open-ended DHS funding,  and stop the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699661/horrific-ice-abuses"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…everyday Americans. It is what they  want to see out of this Congress, the people's House, the Article I  branch of government, the House of Representatives, the first amongst  equals coming together today, every single House Democrat and at least  10 House Republicans to extend the Affordable Care Act tax credits.\n\nNow, we believe as House Democrats that…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698795/breaking-the-gridlock-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…doubt even the clear things that you  see with your eyes; that nothing is real; that nothing is true; that if  you are a supporter of the regime and I tell you once plus one equals  three, then one plus one equals three. Those weren't war plans. Those  weren't classified items.\n\nThat is also why the official position of the White House on key  issues…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Church's history and a humbling  opportunity to say thank you for his efforts on behalf of the entire  human family. Since being elevated to primus inter plares (first among  equals) in 1991, he has worked tirelessly to promote religious freedom  and human rights, foster cooperation and understanding among all people  of faith, convene peace conferences…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695860/recognizing-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…Speaker, I rise today to honor the Ecumenical  Patriarch of Constantinople, His All-Holiness Bartholomew I, who is the  spiritual leader and the Primus inter Pares (First among Equals) of  Orthodox Christianity worldwide, a Church of 300 million people. This  September, His All-Holiness Ecumenical Patriarch Bartholomew visited  our Nation's capital, continuing…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697433/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-of-constantinople"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…rise today to honor and welcome His All- Holiness Ecumenical Patriarch Bartholomew to Washington, D.C. He serves  as the spiritual leader and Primus inter Pares (First among Equals) of  Orthodox Christianity worldwide, a Church of 300 million people.\n\nLater this month, His All-Holiness will visit the United States to  receive the Templeton Prize, the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695331/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…The U.S. Department of Energy (DOE) has already approved a       significant volume equal to 48 Bcf/d for shipment to non-free       trade agreement (NFTA) countries, which equals 49 percent of       2024 net supply. Why then is it in the public interest for       Congress to remove consumer protections? This is not a       national security issue. What…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…Templeton Prize, the world's most prestigious award in       Religion and Science;\n\nWhereas, His All-Holiness is the spiritual leader and       Primus inter pares (``Fast among Equals'') of Orthodox       Christianity worldwide--a Church of 30 million individuals--      and is the longest-serving Archbishop of Constantinople;\n\nWhereas, in 1997, His All-Holiness…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694760/recognizing-his-all-holiness-ecumenical-patriarch-bartholomew-i-archbishop-of-constantinople-new-rome"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…should be doing. Then they went further, eliminating incentives for  wind and solar projects, meaning fewer jobs and less power to the grid.  It is supply and demand. Less power equals higher prices. And the  consequences of these policies are already taking effect.\n\nAccording to the Century Foundation, past-due utility balances have  jumped 10 percent this…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…what Senate Republicans did to this  budget resolution. They made a terrible bill that rips off middle-class  Americans even worse.\n\nThey are telling you that two plus two equals zero in this budget  resolution to obfuscate the truth. It will explode our national debt.  It will make the Trump tax scam permanent. It will make devastating and  inhumane…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689898/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…communities with  empathy, and how to live with moral fortitude.\n\nHis ability to unify, to guide anyone and everyone to set aside  differences and divisions and treat each other as equals is deeply  inspiring and is what we should all strive for. Ecumenical Patriarch  Bartholomew's impact on our world is immeasurable, boundless, and  magnified all the more through…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695565/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…ISSA. Mr. Speaker, I rise today to extend a warm welcome to the  Ecumenical Patriarch of Constantinople, His All-Holiness Bartholomew,  the spiritual leader and ``First Among Equals'' of more than 300  million Orthodox Christians worldwide. During this historic visit to  the United States, His All-Holiness will receive the Templeton Prize-- the world's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695541/welcoming-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomews-2025-visit-to-the-united-states"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…virtue, natural law, liberty, life, personal responsibility, et  cetera.\n\n``A servant leader has the ability to build coalitions and inspire  others to follow as first among equals. They see where things are in  their condition, where they should be, and then insert themselves to  voluntarily move self and others to the ideal. They model what they  teach.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…extend a warm welcome  to His All-Holiness Bartholomew, the Ecumenical Patriarch of  Constantinople and spiritual leader of Orthodox Christianity.  Recognized as ``First Among Equals'' among Orthodox bishops, he is  visiting our Nation's Capital to receive the Templeton Prize--the  world's most prestigious award honoring contributions to religion and  science.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694769/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…opportunities to Americans to  invest with not as many regulations in their way. With these  challenging times overseas, it is nice to see that we recognize that  economic security equals national security, and by expanding the  qualified investor rule, which will give exactly that: more opportunity  to others.\n\nThis bill, led by our chairman, expands access…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692777/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…good for the economy, and good for this. It is  the budgetary discipline of: Are we going to tell the truth that we  have something that we call ``forgotten funds,'' and it equals billions  and billions of dollars sitting in accounts?\n\nIf we are going to be adults, be professionals, and do our jobs--I am  sorry--every single one of these line items belongs…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694954/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…Patriarch Bartholomew, the spiritual  leader of Orthodox Christianity worldwide. As Archbishop of  Constantinople--New Rome, His All-Holiness is recognized as the ``first  among equals'' of Orthodox Primates and shepherds more than 300 million  faithful across the globe.\n\nSince his election in 1991, Patriarch Bartholomew has been an  unwavering advocate for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694924/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…Colorado. Mr. Speaker, I rise today to welcome His All- Holiness Ecumenical Patriarch Bartholomew to Washington, D.C.--the  spiritual leader and Primus inter Pares (First among Equals) of more  than 300 million Orthodox Christians worldwide. For decades. he has  been a tireless voice for religious freedom, and as the longest serving  Archbishop of Constantinople…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695856/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…escalating  penalties to counter repeated or hostile intrusions. A slap on the  wrist is not enough when foreign actors surveil U.S. military bases.  Protecting our installations equals protecting readiness, our troops,  and national security.\n\nI urge my colleagues to support this commonsense measure to send a  clear message: Trespassing on U.S. military property…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695145/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…MILLER-MEEKS. Mr. Speaker, I rise today to recognize His All- Holiness Ecumenical Patriarch Bartholomew, who is the spiritual leader  and the ``primus inter pares''; ``first among equals'' of Greek  Orthodox Christianity worldwide, a church of over 300 million people.\n\nHis All-Holiness is visiting the United States to receive the  Templeton Prize, the world's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695074/raising-awareness-of-world-suicide-prevention-day"}]