[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…home. I am trying  to live my values.\n\nI say, ``Hey man, you all right?'' and he sort of waves me off. But,  immediately, I realized my tone wasn't right. This is a man with equal  dignity, God's creation made in God's image, and I said--my words  weren't respectful enough.\n\nSo I lowered my tone, and I said: Excuse me, sir. I am sorry to  bother you,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…1979, they did  so noting that: ``Education is fundamental to the development of  individual citizens and the progress of the Nation;\n\n``There is a continuing need to ensure equal access for all Americans  to educational opportunities of high quality, and such educational  opportunities should not be denied because of race, creed, color,  natural origin,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689641/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, I introduce the Equal Treatment of  the District of Columbia Under the Rural Health Transformation Program  Act of 2025, which would make the District of Columbia eligible for  funding under the…", "date": "2025-08-19", "source_url": "https://justfacts.votesmart.org/public-statement/1694752/introduction-of-the-equal-treatment-of-the-district-of-columbia-under-the-rural-health-transformation-program-act-of-2025"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…through the most democratic of means, amended the Constitution  that originally treated slaves''--Americans that had been enslaved-- ``as three-fifths of a person to guarantee equal protection of the  laws. After decades of struggle, Civil Rights and Voting Rights Acts  were finally enacted. Even today, the journey toward justice is still  not complete,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…Act, an incredible milestone  that serves as a reminder of the promise we make to our Nation's  children that every student, no matter who they are or how they learn,  deserves equal access to a quality education.\n\nYet, this anniversary comes at a time when the Trump administration  continues its systematic efforts to eliminate the Department of  Education,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…of that promise came in 1975 when  Congress passed the Individuals with Disabilities Education Act to  ensure that children with disabilities could receive a free, fair, and  equal education.\n\nThis landmark legislation changed the lives of millions of Americans.  The disabled children's right to an education would not only be  recognized, but it would…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698936/protecting-education-for-children-with-disabilities"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…redact information about  the victims, revictimizing so many?\n\nThis is 1,000 percent unacceptable, and it is unacceptable to our  values as a nation, our values which talk about equal justice under  law. That is why, by unanimous consent, we said those files must be  released. But it is meaningless if the administration simply chooses  not to comply and…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699772/9999"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Congress is a  coequal branch of government, not a ceremonial afterthought, not merely  a suggestion box, and not someone that is along for the ride. We are  constitutionally equal with our powers delineated in Article I of the  United States Constitution.\n\nYet, under the Trump administration, we have witnessed a disturbing  pattern: a blatant disregard…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692931/holding-power-accountable"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…Civil  War veterans.\n\nMore than 140 years later, the organization continues to serve  veterans of all wars and endeavors to ``encourage the spread of  universal liberty and equal rights of everyone.''\n\nI support the National Woman's Relief Corps' work, and I urge my  colleagues to support this legislation.", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699500/moving-national-womans-relief-corps-incorporation-and-domicile-to-illinois-principal-office-to-murphysboro-illinois"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…liberty and justice for all. I  will be voting to protect government of the people, by the people, for  the people. I will be voting to make sure that all persons are created  equal and endowed by their Creator with certain unalienable rights,  among them life, liberty, and the pursuit of happiness.\n\nI will be voting to protect the country I love. I hope…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, I rise today to urge my colleagues to join me  in strengthening and protecting Congress as a separate, independent and  co-equal branch of our government by cosponsoring my Legislative Branch  Independence Act.\n\nMy bill would amend the appointment processes for three key  legislative branch positions--the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697708/supporting-the-legislative-branch-independence-act"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…by Rajiv Malhotra thirty years  ago, has played a pivotal role in championing the rights of Hindu  Americans, advocating against biases and Hinduphobia, and ensuring  their equal protection under civil rights laws. It has contributed  significantly to intellectual diversity in the United States by  fostering rigorous academic inquiry, research, and…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689467/recognizing-the-contributions-of-rajiv-malhotra-and-the-infinity-foundation"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Of course, the Declaration of Independence, authored by Thomas  Jefferson, makes the famous statement: ``We hold these truths to be  self-evident, that all men are created equal, that they are endowed by  their creator with certain unalienable rights, that among these are  life, liberty and the pursuit of happiness.''\n\nMr. Speaker, I want to lock in…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Mr. Speaker, this bill simply exempts IDA securities from SEC  regulations, aligning with other World Bank arms which have been exempt  for decades.\n\nBy making IDA securities equal to similar funds, the World Bank will  have additional funds that can be applied to its mission to help the  poorest of nations.\n\nThe United States has long been a leader in…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693972/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…good trouble in the face of slavery; good people who caused good  trouble in the face of the denial of the right to vote; good people who  caused good trouble in the cause of equal rights; good people who  caused good trouble in the fight against hate; good people who caused  good trouble in the fight against demagogues from McCarthyism to Father  Coughlin,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…housing, healthcare, and education  wherever there are millions and millions of illegal aliens allowed to  come into the country and then placed throughout our country.\n\nOf equal, if not greater, concern to me is the rampant growth and the  effects of transnational criminal organizations that have grown  throughout our country. This is perhaps best…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696955/tren-de-aragua-border-security-threat-assessment-act"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…side. It is one thing when I call out the anti-Semitism of those who do  not stand in my party, who do not agree with me, who do not call  themselves conservatives, but I am an equal opportunist. It is easy to  call it out on the other side. You must do it on your own.\n\nTo those on my side who hate Jews and hate Israel so much that they  are willing to…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692703/thanking-president-trump-for-saving-the-world"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…New York, and launched The North  Star using his own money, giving voice to the voiceless in the years  before the Civil War.\n\nHe fought fiercely against slavery, championed equal rights and  women's suffrage, and became one of the most forceful orators in  American history. During the Civil War, Douglass recruited Black  soldiers, met with President…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692222/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…Think about it. Think about the first document that birthed our  Nation, the Declaration of Independence. ``We hold these truths to be  self-evident, that all men are created equal, that they are endowed by  their creator with certain unalienable rights, that among these are  life, liberty, and the pursuit of happiness. That to secure these  rights, governments…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692892/dobbs-v-jackson-anniversary"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…businesses to offer tax-free benefits so  that their employees can find health coverage that works for them.\n\nThis levels the playing field for small businesses, putting them on  equal footing with large employers when competing for workers. These  arrangements are proven to be successful. In fact, 83 percent of  employers using CHOICE Arrangements are offering…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…lose. It doesn't matter where the money  went; you got your smartphone. You only give money to somebody for  something if you want it. If it is a voluntary trade, it is always  equal. Well, it is, actually, always mutually beneficial.\n\nAnd so when people say: Oh, we have lost, and China is winning, and  China is winning, and we have a trade deficit with…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…there is a provision in the tax code called low-income  housing tax credits, and what it means is that if a developer wants to  build a new development, they would get a credit equal to 10 percent of  the cost of the building over 9 years, which, right off the bat, sounds  like the government is paying for 90 percent of the value of the  building.\n\nThat…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…are supposed  to have under the rule of law.\n\nWe used a lot of big words from the Declaration of Independence all  the way through today. We talk about a lot of great words: ``equal  justice under the law,'' ``liberty,'' ``rights,'' ``freedom,'' but if  you don't have the rule of law, none of it matters.\n\nThe reason people come to the United States, the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…published his first newspaper, The North       Star, using his own money in the pre-Civil War era;\n\n[Whereas Douglass was known for fiercely opposing slavery,       championing equal rights and women's rights, and for being a       forceful speaker;\n\n[Whereas, during the Civil War, Douglass was a recruiter       for the first African-American army regiment;…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…freedom for all people around the  world but freedom of self-determination and to decide what kind of  government we want.\n\nFrankly, we want to allow women to vote, to have equal rights with  men, to live in a society where religion is important but is not a tool  for oppression.\n\nWe care about these issues because they create peace and security in…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691211/supporting-a-free-democratic-and-secular-iran"}, {"senator": "James Risch", "party": "Republican", "sentence": "…hearing is conducted       by the committee or a subcommittee upon any measure or       matter, the ranking member of the committee or subcommittee       may select and call an equal number of non-governmental       witnesses to testify at that hearing.\n\n(d) Public Announcement.--The committee, or any       subcommittee thereof, shall make public announcement…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…course of their service will be required to divest those assets within  90 days of receipt.\n\nViolators of this statute--or bill if it becomes law--will have to  pay an amount equal to 10 percent of the value of covered assets plus  the sale of profits, and it must be paid with personal funds, not  office or campaign funds.\n\nThis is a commonsense measure…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…at the time of the       veteran's death shall be paid to the first living person or       entity listed below:\n\n``(1) The veteran's spouse.\n\n``(2) The veteran's children (in equal shares).\n\n``(3) The veteran's dependent parents (in equal shares).\n\n``(4) The estate of the deceased veteran unless the estate       will escheat.\n\n``(b) Limitation.--In a…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699467/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…to verify that State  elections comply with existing law.\n\nNow, there are other electoral reforms that are also necessary and  critical, including Senator Hagerty's proposed Equal Representation  Act, which I am proud to cosponsor.\n\nIt ensures that the census does not count noncitizens when  determining congressional seats and electoral college votes.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Pensions of the Senate a report containing the       findings of the study conducted under subparagraph (A).       SEC. 3. ENSURING COMPLETION OF PEDIATRIC STUDY REQUIREMENTS.\n\n(a) Equal Accountability for Pediatric Study       Requirements.--Section 505B(d) of the Federal Food, Drug, and       Cosmetic Act (21 U.S.C. 355c(d)) is amended--\n\n(1) in paragraph…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}]