[{"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…citizenship with that crown jewel of the Voting  Rights Act.\n\nI am 59 years of age. I am the first generation in my family, all  born in America--all born in America--who has full equal rights. In my  lifetime, at the age of 59, my children will have fewer rights than I  have had. Those are troubling signs.\n\nIn 1965, the Voting Rights Act became the law of the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…only woman in the Ohio Senate. Can you imagine that?\n\nShe was a champion for working families and labor rights, a defender  of women's rights, and an early advocate for the equal rights  amendment. Her work helped create the Ohio Lottery to support  education. She never wavered in her fight for fairness, dignity, and  opportunity for all.\n\nThough she chose…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…words that are inscribed at the Justice Department  over its entrance?\n\nEqual Justice for All.\n\nDepartment of Justice officials would like us to believe that the  fight for equal rights and the fight for voting rights is already over.  In fact, the Assistant Attorney General for Civil Rights has said that  the Voting Rights Act ``was once necessary to push…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690545/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…grew to be a prominent  abolitionist, public intellectual, journalist, world-renowned orator,  businessman, and statesman.\n\nFrederick Douglass was a courageous advocate for equal rights who  used his journalistic and oratorical skills to advance civil liberties  for all his life.\n\nIt is fitting that we name the House Press Gallery after the first  Black…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692223/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…also recognize other leaders such as Minister Mark McLean, Reverend  Frank Coleman, and Reverend Margaret Fountain-Coleman.\n\nTheir hard work and principled advocacy for equal rights, economic  justice, and education warrants recognition on the floor of the House  of Representatives.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693011/recognizing-local-naacp-leaders"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…celebrate, we also appreciate and commemorate that we stand on  the shoulders of those who got us here. It is with that realization  that we are reinvigorated in our push for equal rights.\n\nWe in Santa Cruz and throughout the 19th Congressional District of  California understand that Pride is more than just flags and parades.  It is also about creating policies,…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692043/recognizing-santa-cruz-pride-parades-50th-anniversary"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…trouble in the face of slavery; good people who caused good  trouble in the face of the denial of the right to vote; good people who  caused good trouble in the cause of equal rights; good people who  caused good trouble in the fight against hate; good people who caused  good trouble in the fight against demagogues from McCarthyism to Father  Coughlin,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Atheists, American Civil Liberties Union, American Humanist       Association, Center for Reproductive Rights, Clearinghouse on       Women's Issues, End Rape On Campus, Equal Rights Advocates,       Feminist Majority, Girls for Gender Equity, Guttmacher       Institute, Healthy Teen Network, Ibis Reproductive Health,       Just Solutions, Justice and…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…be Governor, and I went on to  serve in the city, county, State, and now here in Federal Government.\n\nThat day, we were doing what I am doing right now: fighting for the  equal rights amendment, fighting to guarantee equal rights for all  women under the Constitution.\n\nI still have the ERA pin I wore that day. I have kept it for nearly  50 years because…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689199/fighting-to-guarantee-equal-rights-for-all-women-under-the-constitution"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…PALLONE. Mr. Speaker, I rise today to congratulate the National  Organization for Women of New Jersey (NOW-NJ) as they celebrate their  historic 50-year milestone of promoting equal rights for women and  girls. It is my privilege to recognize the powerful impact made by NOW- NJ to build a New Jersey where everyone, regardless of race, gender  identity, or…", "date": "2025-11-25", "source_url": "https://justfacts.votesmart.org/public-statement/1697164/recognizing-the-50th-anniversary-of-the-national-organization-for-women-of-new-jersey"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Speaker, I rise to oppose this cynical and silly  resolution. I am not a socialist myself, but a Tom Payne Democrat, a  champion of strong democracy, universal freedom, and equal rights for  everybody, but this resolution is ridiculous.\n\nFrom its first paragraph, it promotes the fallacy that socialist  ideology leads  to social collapse. In fact, many of…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697148/denouncing-the-horrors-of-socialism"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…have enjoyed since our  Nation's founding.\n\nOur history is made stronger and more vibrant. Just when Black  Americans think that we are equal, we are still fighting for equal  rights.\n\nHere we are, from chaos and confusion with this administration, but  we are still leading. Former chairs, now ranking members. If I did a  roll call, Mr. Speaker, I would…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687896/black-history-month"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…Civil  War veterans.\n\nMore than 140 years later, the organization continues to serve  veterans of all wars and endeavors to ``encourage the spread of  universal liberty and equal rights of everyone.''\n\nI support the National Woman's Relief Corps' work, and I urge my  colleagues to support this legislation.", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699500/moving-national-womans-relief-corps-incorporation-and-domicile-to-illinois-principal-office-to-murphysboro-illinois"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…organizations.\n\nIt is especially meaningful to celebrate her legacy during Women's  History Month.\n\nAs a leader and influential advocate, she pushed for ratification of  the equal rights amendment and women's full participation in the  political process. She never gave up on her vision of an America where  every woman has a chance to make her voice heard.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689166/womens-history-month"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…P.C.; Electronic Frontier Foundation;       Elias Law Group, LLP; Entre Hermanos; Environmental Integrity       Project; Episcopal Churches of the Big Bend; Equal Justice       Society; Equal Rights Advocates Equality California; Equality       Legal Action Fund; Erie County Bar Association Volunteer       Lawyers Project; Erin B. Shank, P.C.; Experience…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689713/no-rogue-rulings-act-of-2025"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…York, and launched The North  Star using his own money, giving voice to the voiceless in the years  before the Civil War.\n\nHe fought fiercely against slavery, championed equal rights and  women's suffrage, and became one of the most forceful orators in  American history. During the Civil War, Douglass recruited Black  soldiers, met with President Lincoln…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692222/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…published his first newspaper, The North       Star, using his own money in the pre-Civil War era;\n\n[Whereas Douglass was known for fiercely opposing slavery,       championing equal rights and women's rights, and for being a       forceful speaker;\n\n[Whereas, during the Civil War, Douglass was a recruiter       for the first African-American army regiment;…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Jews to become leading  proponents and supporters of the civil rights movement, marching  shoulder to shoulder with African Americans and others, united in  support for equal rights, equal protection under the law, and the  recognition and respect of human dignity; and\n\nWhereas, the Jewish community has prominently participated in  virtually every civil…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688926/designating-april-29-as-endjewhatred-day"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…freedom for all people around the  world but freedom of self-determination and to decide what kind of  government we want.\n\nFrankly, we want to allow women to vote, to have equal rights with  men, to live in a society where religion is important but is not a tool  for oppression.\n\nWe care about these issues because they create peace and security in  the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691211/supporting-a-free-democratic-and-secular-iran"}]