[{"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…deny Ukrainians the freedom to choose their own  future, Russia has bombed hospitals and kindergartens, executed  civilians, and abducted Ukrainian children in an attempt to erase  Ukrainian culture. And Ukraine is not the only place where the Kremlin  uses coercion to control its neighbors and dictate their political  direction.\n\nLast year, the Georgian…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697939/international-human-rights-day"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…allies have frozen funding for programs that address  inequality and support equal opportunity, rolled back decades of civil  rights and discrimination protections, and tried to erase Black history  in our schools. He jumps at every opportunity he gets to attack Black  America, using DEI as a racist dog whistle and pushing false and  offensive ideas that…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688144/recognizing-resilience-resistance-and-relentless-struggle-lessons-of-black-history"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…played the figurative fiddle  as the Capitol was sieged and our Constitution was challenged.\n\nThe same man responsible for the violence that day is now trying to  distort it and erase it. Perhaps, Mr. Speaker, that is why there is no  other Republican on the floor, to try to forget what happened, erase it  from the minds of Americans, and erase it from the…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698552/january-6-attack"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…our country  back in time, the Congressional Black Caucus stands at the front lines  of protecting our communities and calling out these and other thinly  veiled attempts to erase centuries of progress for Black America.\n\nThis administration's recent actions aimed at taking away critical  tools of success and our fundamental freedoms will not go unanswered.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Trump's second term, he pardoned more than 1,500 criminals involved in  that insurrection carried out in his name.\n\nThis is just one action amid a comprehensive campaign to erase the  memory of what happened on that day. It is a slap in the face to law  enforcement who selflessly put their lives at risk to defend all of us.\n\nSome of them lost their…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…to preserve and to learn from.\n\nJapanese incarceration during World War II stands as one of those  uncomfortable chapters that Trump and his administration are attempting  to erase. More than 125,000 Japanese Americans, including my parents  and grandparents, were rounded up and placed in desolate camps at the  hands of their own government.\n\nThere are…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699716/rewriting-history"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…revive a dangerous question: Can we stop the spread of  nuclear weapons through military force? I believe the answer is no. We  cannot destroy knowledge with a bomb. We cannot erase a nuclear program  by targeting one facility.\n\nStrikes might delay a program, but they almost always provoke  retaliation and harden resolve. They do nothing to build the kind…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694115/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…Many of them attacked cops in and around this building. It  is insulting to me and to law enforcement officers across our Nation.\n\nThese pardons, by the way, they do not just erase sentences; they  send a message. And the message is: It is OK for you to commit violent  acts as long as they are to support Donald Trump.\n\nAnd in the years since these pardons,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698511/9999"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…origins coming together to build something bigger than any one  of us.\n\nThat story should be told in its totality, but we have a regime that  fears diversity and is trying to erase it from our history. From  directing the National Park Service to remove aspects of American  history from exhibits, such as slavery, to targeting immigrant  communities across…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700306/hawaiian-language-month"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…American history.\n\nMr. Speaker, let us be clear that America cannot move forward by  erasing the people who propelled it forward. Currently, this  administration is looking to erase the impact of women and Black  Americans from our military. From brutal attacks on Black history to  Secretary Hegseth's attempt to remove women from combat roles, the  message…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…freedom. This is about right versus wrong, point blank. But here is  what they don't understand. We have seen this playbook, and every time  they have attempted to silence us, erase us, and hold us down, we have  resisted and we have pushed this country closer to the ideals it claims  to hold.\n\nThey are trying to bury us, but what they don't realize is…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Republicans are afraid the Trump administration will look at it. It  doesn't do anything except begin a process.\n\nMr. Speaker, as to both of these CRAs, the effect is not only to  erase what was done under the Biden administration but prohibit the new  administration from adopting any consumer protection. That is because  my colleagues on the other side of…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689952/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…history, Latino history is American  history, and women and LGBTQ+ history is American history.\n\nWe will not be silenced.\n\nNo illegal or unconscionable executive orders can erase American  history. No firing of generals or Federal workers, no banning of books  or threats to schools, no purge of websites or removal of artifacts  from the Smithsonian…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690193/american-history"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…and the  President are waging.\n\nDenying the ability of out trans folks to serve in our military isn't  enough for these people. The person from North Carolina is trying to  erase the existence of trans people from forms, from hallways, from our  military, and choosing violence.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695249/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…public services and research--attacks on civil  rights that we have not seen since the 1960's.\n\nDEI, regrettably, has been attacked by the Republicans and this  Administration to erase contributions and accomplishments of so many  Americans. We have seen the Administration remove references to Jackie  Robinson's military participation. References to women…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…family here last year when this  legislation was first considered by the House. This family has been  forever hurt by the loss of Shandra. Her daughter, Amber, said: Nothing  can erase the heartbreak of my mother's passing, but she would be proud  that we have helped make a positive difference in her name.\n\nToday, we are taking concrete action to prevent…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692764/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…single one of my colleagues knows this  truth, even if they are too afraid to say it.\n\nMy colleagues across the aisle have stood silent for too long and  allowed this ideology to erase women and hand over our hard-won  victories to men. This amendment ensures the Department of War  recognizes these biological realities.\n\nThis is more than about forms and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…start of the full-scale invasion,  with many having been adopted into Russian families or sent to camps,  where they are subjected to ideological indoctrination designed to  erase their Ukrainian identity.\n\nThe bombing of Ukraine's power grid, which was part of a state policy  of widespread attacks on the civilian population, further illustrates  the…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…before, now it is. Republicans are  the party that stands for women. We are the party that defends their  right to compete on a level playing field, and while Democrats try to  erase the very definition of womanhood, we will never back down. They  can slow us down, but they will not stop us. We will keep fighting  until every woman and girl in this country…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688462/america-deserves-president-trump"}]