[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…and that transgender servicemembers have served our country with  distinction and honor for almost a decade. They were able to do this  openly.\n\nYet, this amendment seeks to erase the existence of transgender  people, whether they are servicemembers or DOD employees, by  prohibiting the Secretary of Defense from collecting information about  gender identity…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695261/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…opportunity only serves to set us back.\n\nWhen faculty at our five world-class service academies are told to  avoid divisive concepts like racism and sexism, that only threatens to  erase the stories and experiences of these brave women who just wanted  to serve our great Nation.\n\nI strongly believe that we should have a Navy and Marine Corps that  look like…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689167/womens-history-month"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…to preserve and to learn from.\n\nJapanese incarceration during World War II stands as one of those  uncomfortable chapters that Trump and his administration are attempting  to erase. More than 125,000 Japanese Americans, including my parents  and grandparents, were rounded up and placed in desolate camps at the  hands of their own government.\n\nThere are…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699716/rewriting-history"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…funding for programs people need, like SNAP,  Medicaid, and the ACA, keep going down.\n\nIt doesn't stop at the kitchen table. No, we are witnessing a whole- of-government effort to erase Black history, to diminish Black voices,  and to stifle Black progress.\n\nMore than $3 billion in Federal funding has been cut from HBCUs,  Black communities, and Black entrepreneurs.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697467/recognizing-myesha-watkins"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…despite the discrimination they faced. Despite their heroism,  their place in history has not always been respected. Just recently,  sadly, we witnessed a shameful attempt to erase the legacy of Harold  Brown and countless others who fought with him and for this country.\n\nUnder the Trump administration, the U.S. Department of Defense,  following a sweeping…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…impunity.\n\nToday, we are witnessing a genocide in Gaza. Many human rights  organizations, advocacy groups, NGOs, and folks on medical missions  have confirmed, the campaign to erase Palestinians from existence is  happening right now, live-streamed for all of us to see while the world  sits and does nothing.\n\nPalestinians were right. The Nakba never ended.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691384/the-nakba-never-ended"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…freedom. This is about right versus wrong, point blank. But here is  what they don't understand. We have seen this playbook, and every time  they have attempted to silence us, erase us, and hold us down, we have  resisted and we have pushed this country closer to the ideals it claims  to hold.\n\nThey are trying to bury us, but what they don't realize is…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…American history.\n\nMr. Speaker, let us be clear that America cannot move forward by  erasing the people who propelled it forward. Currently, this  administration is looking to erase the impact of women and Black  Americans from our military. From brutal attacks on Black history to  Secretary Hegseth's attempt to remove women from combat roles, the  message…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Republicans are afraid the Trump administration will look at it. It  doesn't do anything except begin a process.\n\nMr. Speaker, as to both of these CRAs, the effect is not only to  erase what was done under the Biden administration but prohibit the new  administration from adopting any consumer protection. That is because  my colleagues on the other side of…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689952/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…Many of them attacked cops in and around this building. It  is insulting to me and to law enforcement officers across our Nation.\n\nThese pardons, by the way, they do not just erase sentences; they  send a message. And the message is: It is OK for you to commit violent  acts as long as they are to support Donald Trump.\n\nAnd in the years since these pardons,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698511/9999"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…extractive industries no matter the  public health or environmental consequences.\n\nRepublicans are attacking bedrock environmental and historic  preservation laws, attempting to erase and rewrite history in our  public lands, and working to turn our public lands into prisons and  detention centers.\n\nAmericans deserve better. They deserve public lands that…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697763/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…public services and research--attacks on civil  rights that we have not seen since the 1960's.\n\nDEI, regrettably, has been attacked by the Republicans and this  Administration to erase contributions and accomplishments of so many  Americans. We have seen the Administration remove references to Jackie  Robinson's military participation. References to women…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…even more sinister  than the heinous violence that occurred that day. Today, we face the  systemic attempt by supposed leaders, by Trump and rightwing MAGA  Republicans, to erase and rewrite the truth of January 6, whitewashing  the violence of the riot and calling it a ``day of love.''\n\nI invite everyone in this Chamber and across the country to watch…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698517/anniversary-of-january-6"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…energy sector  remains globally competitive.\n\nMethane has a global warming potential 80 times higher than carbon  dioxide over a 20-year period, meaning that even small leaks can erase  the climate benefits of utilizing cleaner energy sources.  Unfortunately, methane regulations have been caught in a cycle of  constant change.\n\nThe first Trump administration…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688174/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…history, Latino history is American  history, and women and LGBTQ+ history is American history.\n\nWe will not be silenced.\n\nNo illegal or unconscionable executive orders can erase American  history. No firing of generals or Federal workers, no banning of books  or threats to schools, no purge of websites or removal of artifacts  from the Smithsonian…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690193/american-history"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…family here last year when this  legislation was first considered by the House. This family has been  forever hurt by the loss of Shandra. Her daughter, Amber, said: Nothing  can erase the heartbreak of my mother's passing, but she would be proud  that we have helped make a positive difference in her name.\n\nToday, we are taking concrete action to prevent…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692764/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…single one of my colleagues knows this  truth, even if they are too afraid to say it.\n\nMy colleagues across the aisle have stood silent for too long and  allowed this ideology to erase women and hand over our hard-won  victories to men. This amendment ensures the Department of War  recognizes these biological realities.\n\nThis is more than about forms and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…start of the full-scale invasion,  with many having been adopted into Russian families or sent to camps,  where they are subjected to ideological indoctrination designed to  erase their Ukrainian identity.\n\nThe bombing of Ukraine's power grid, which was part of a state policy  of widespread attacks on the civilian population, further illustrates  the…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…before, now it is. Republicans are  the party that stands for women. We are the party that defends their  right to compete on a level playing field, and while Democrats try to  erase the very definition of womanhood, we will never back down. They  can slow us down, but they will not stop us. We will keep fighting  until every woman and girl in this country…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688462/america-deserves-president-trump"}]