[{"senator": "Mark Takano", "party": "Democrat", "sentence": "Yet, this amendment seeks to erase the existence of transgender  people, whether they are servicemembers or DOD employees, by  prohibiting the Secretary of Defense from collecting information about  gender identity on any form or survey."}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "When faculty at our five world-class service academies are told to  avoid divisive concepts like racism and sexism, that only threatens to  erase the stories and experiences of these brave women who just wanted  to serve our great Nation."}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Japanese incarceration during World War II stands as one of those  uncomfortable chapters that Trump and his administration are attempting  to erase."}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "No, we are witnessing a whole- of-government effort to erase Black history, to diminish Black voices,  and to stifle Black progress."}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Just recently,  sadly, we witnessed a shameful attempt to erase the legacy of Harold  Brown and countless others who fought with him and for this country."}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "We know that thousands of Palestinians were ethnically cleansed  in 1948, and nearly 800,000 were violently removed from over 400  villages, completely erased."}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "We have seen this playbook, and every time  they have attempted to silence us, erase us, and hold us down, we have  resisted and we have pushed this country closer to the ideals it claims  to hold."}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "Let us listen to the stories of Black military  servicepeople, stories too often overlooked or erased."}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "Speaker, as to both of these CRAs, the effect is not only to  erase what was done under the Biden administration but prohibit the new  administration from adopting any consumer protection."}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "These pardons, by the way, they do not just erase sentences; they  send a message."}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "Republicans are attacking bedrock environmental and historic  preservation laws, attempting to erase and rewrite history in our  public lands, and working to turn our public lands into prisons and  detention centers."}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "DEI, regrettably, has been attacked by the Republicans and this  Administration to erase contributions and accomplishments of so many  Americans."}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "Methane has a global warming potential 80 times higher than carbon  dioxide over a 20-year period, meaning that even small leaks can erase  the climate benefits of utilizing cleaner energy sources."}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "No illegal or unconscionable executive orders can erase American  history."}, {"senator": "John Cornyn", "party": "Republican", "sentence": "Thousands of Ukrainian children have  been deported to Russia since the start of the full-scale invasion,  with many having been adopted into Russian families or sent to camps,  where they are subjected to ideological indoctrination designed to  erase their Ukrainian identity."}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "My colleagues across the aisle have stood silent for too long and  allowed this ideology to erase women and hand over our hard-won  victories to men."}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "Her daughter, Amber, said: Nothing  can erase the heartbreak of my mother's passing, but she would be proud  that we have helped make a positive difference in her name."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Passionate protests don't justify  laying hands on law enforcement, and bleeding hearts don't erase  immigration laws critical to our national security."}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "We are the party that defends their  right to compete on a level playing field, and while Democrats try to  erase the very definition of womanhood, we will never back down."}]