[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…the due process rights of someone in our country that was not even a  citizen of this Nation--because in the Constitution, using the words  ``any Person,'' knowing that if you erode the due process rights of  anybody in this Nation, it is a threat to the due process rights of  everyone in this Nation.\n\nInjustice anywhere is a threat to justice everywhere.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692454/alex-padilla"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…the Centers for Disease Control.\n\nHere is the question, and the answer is obvious: If you want to make  a program more efficient, do you fire the people first and essentially  erode any capacity of that program to deliver the services that the  American people need? Or do you study the organization? Do you kick the  tires? Do you investigate and analyze…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688257/department-of-health-and-human-services"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…rights, and that created the foundation of a  more inclusive society. The very principles of DEI stem from these  victories.\n\nWhen we attack diversity, equity, and inclusion, we erode the gains  made through blood, sweat, and tears from the marches in Selma to the  legislative victories in the sixties, seventies, eighties, nineties,  and beyond.\n\nTo push…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…shoved up through his toe, because of a diagnosis of cancer,  because of diabetes, because of things outside of their control--they  rack up medical debt that, as this man, can erode their well-being.\n\nThis data has been known [about how many Americans are       affected] and has continued with the passage of the       Affordable Care Act.\n\nLesser known…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…having military honors.\n\nIf we equate the January 6 insurrection with genuine sacrifice, we  cheapen everything our servicemembers have done in the defense of this  country. We erode trust in our military, and we feed the dangerous lie  that January 6 was anything other than a betrayal of our democracy.\n\nTaxpayer money should not be used to provide a military…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698491/anniversary-of-january-6"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…leader  is accountable to the people. That is the difference.\n\nSo if you are in a situation where you have an authoritarian for the  President, first thing they do is try to erode the checks and balances  of the constitution to concentrate more and more power in the  Executive. Of course, we see that in all kinds of ways we have been  discussing.\n\nThen…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…than $500 billion in exports to the United  States.\n\nHowever, this year, the impact of the reciprocal tariffs, coupled  with the expiration of AGOA on September 30, threaten to erode 25 years  of economic cooperation.\n\nIf we fail to act, we will likely see weakening supply chains and  increased poverty across the continent. Moreover, many industries could…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…ensure that our community members are not approached or detained by  unidentified Federal agents. Without identification, there is no  accountability. That is how democracies erode, and we will not allow  it.\n\nTrump wants America to believe that his cruelty makes us safer. It  does not. When communities live in fear, they cannot trust law  enforcement.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697452/fighting-dhs-immigration-raids"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…17, 2025.\n\nDear Representative: There are currently six bills queued       up for floor votes in the House attacking the District of       Columbia. These bills would severely erode DC's already       limited control over its criminal justice system and leave       individuals and organizations in DC at the mercy of this       administration as they continue…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696946/opposition-letter-led-by-free-dc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…legislation pending before the Senate today would open up a  slippery slope that would undercut Congress's authority, rob our  communities of important resources, and ultimately erode the voice of  the American people who elect their Members of Congress to make these  decisions in their best interests.\n\nWe have to put our foot down because we know it will…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…partisanship. It is about principles. If we  don't draw the line now, we risk losing the rule of law entirely. If we  don't act today, we are complicit in letting democracy erode on our  watch.\n\nThat is why I introduced H. Res. 353 to impeach Donald J. Trump,  outlining seven Articles of Impeachment because when a President  violates the Constitution,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690991/the-truth-still-matters"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…they don't want a handout. We have got the tariff  policies that are wrecking the markets, and then we have got a bailout  that is going to Argentina that is going to further erode the ability  of our farmers to sell their product because, oh, by the way, the  Argentinian farmers are now going into the markets we are helping them  create that have been…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696342/trump-administration"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…were casting  ballots in Virginia, studies found that there were zero instances of  noncitizens illegally voting over the past 20 years.\n\nLet's be honest, these accusations erode public trust and threaten  our democracy.\n\nSome localities are stepping up to fight those accusations. Two of  those localities in my district are Prince William County and…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690520/election-integrity"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…this has not been an isolated incident. Throughout the year,  ICE has carried out aggressive, indiscriminate, and often unjustified  operations across our country, actions that erode our freedom and  undermine our civil rights and public trust in government.\n\nICE claims they need to be aggressive to keep us safe, but how does  harassing law-abiding farmworkers,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697456/fighting-dhs-immigration-raids"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…start of his second term,  President Trump has upended the international world order and America's  leadership on the global stage. He and his allies are working  decisively to erode the values that are central to our Nation. Notably,  retired diplomats, military leaders, national security experts, and  even former Trump administration officials have denounced…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…private-sector banks.\n\nMr. BARR. Just to conclude, we want to avoid eroding the deposit base  and starving the private sector of conventional bank financing. The  GENIUS Act will not erode the deposit base. It will allow banks to  issue and custody stablecoins and participate in this emerging crypto  economy cementing the dollar as the world's reserve currency,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693841/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…Permanent  Select Committee on Intelligence, and raises serious questions about  Delegate Plaskett's judgement, integrity, and fitness to serve; and\n\nWhereas such associations erode public trust in Congress,  particularly when they involve using input from a sex offender to  advance partisan attacks during official proceedings: Now, therefore,  be it…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696890/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…foreign  entity.\n\nThe dangers of foreign influence in American K-12 schools cannot be  overstated. They threaten our national security, compromise our  geopolitical interests, and erode our academic freedom.\n\nAmerican schools are not for sale, and they are for education, not  espionage. We cannot allow our students, the future of our great  Nation, to be corrupted…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…permissionless, and private--``private''  with a capital p--resembling cash, a government-issued CBDC is nothing  more than an Orwellian surveillance tool that will be used to erode the  American way of life.\n\nThe Federal Government has no business monitoring Americans' daily  financial lives. We don't need or want a state-run digital dollar with  Chinese…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693735/anti-cbdc-surveillance-state-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…market  demands, which incentivize banks to offer products that fit the needs  of their consumers at the best price possible.\n\nWe don't want to eliminate that. We don't want to erode the deposit  base with a CBDC.\n\nI ask, Mr. Speaker, would we truly want to lose the benefits of a  diverse banking system that makes the U.S. the global leader in the  financial…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693730/anti-cbdc-surveillance-state-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…prong of the ``clinical superiority'' standard is meant to be a high  bar. We did not intend for minor modifications such as changes in  dosing frequency or formulation to erode the exclusivity protections of  the first innovator drug unless such modifications result in a  significant clinical benefit in treating the underlying conditions. If  we allow…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691696/support-for-the-orphan-drug-act"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…students' global knowledge and growing our Nation's vital national  security workforce.\n\nCongress needs to send a clear message to the CCP that we will not  allow foreign powers to erode national security, steal intellectual  property, or threaten our immigrant population.\n\nThis Congress, I have partnered with my colleagues on other  legislation in this area.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690825/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…and weaponizing finance for geopolitical gain,  the CCP's actions are not just unfair but are also downright dangerous.  These predatory practices harm American businesses, erode trust in  global markets, and risk empowering China to pressure developing  nations and destabilize debt markets for its own benefit.\n\nWe cannot afford to sit back and take…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694119/china-financial-threat-mitigation-act-of-2025"}]