[{"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…program.\n\nThey are even moving in, picking up the PEPFAR Program that we have  walked away from in Africa, after saving millions of lives. These cuts  represent a serious strategic error on behalf of the United States  because for less than 1 percent, about 1 percent of our annual budget,  America has been able to build partnerships around the globe that have…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690349/9999"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…has also shown that the rate of noncitizen voting  is incredibly small, almost too small to measure--roughly 0.0001  percent, according to a reliable estimate. Obviously, that error is so  small that it is hard to measure and would not have any material impact  on our elections.\n\nIf you don't believe me, ask folks over at the libertarian Cato  Institute,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…being a member of a gang does not  deprive one of due process of the law.\n\nIt goes on to indicate here: ``But previously admitted that the  deportation was an administrative error.'' Talk about adding insult to  injury.\n\nThe administration says we deported this person--not to demean him-- Mr. Garcia, deported him by way of an administrative error. Made…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…reality. It was just a hollow campaign slogan. The  Republican energy agenda is a level of economic self-sabotage that  leaves you slack-jawed: How can you make such an unforced error?\n\nIt is going to take a huge toll on the economy. Our people thought  they were voting for cheaper groceries, utilities, gas, and good-paying  jobs and haven't gotten much…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696128/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…are here trying to hold their family together in some  minimal way, them receiving a letter saying that they would be able to  self-deport before it was claimed to be sent in error. In other words,  some person in some agency sent out the wrong letter, which causes even  more anxiety and fear in families who are already suffering.\n\nWhat kind of a country…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…has a  mistake in it.\n\nRepublicans have rushed this process from the very beginning to meet  Trump's artificial July 4 deadline, and this rule is no exception.\n\nWe found an error in the rule at 2 a.m. after the Rules Committee  reported the rule. This is going to sound a little in the weeds, but  they forgot to do something called considering the previous…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…something is deeply wrong. The  Trump administration is gutting our Nation's scientific infrastructure  and doing it with purpose. This isn't some misunderstanding or clerical  error. It is an attack on research, on truth, and on the people who  have dedicated their lives to making our country stronger, smarter, and  healthier.\n\nThousands of scientists…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691392/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…countries, those other markets, find a replacement for  their supply, they are not going to give it up in 2 months, maybe, if  Donald Trump wakes up in a better mood and sees the error of his ways  when it comes to these tariffs--because there is that deadline, right?  We are in a 90-day postponement of a lot of these tariffs, but we don't  know what is coming…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…defenders, justice  could be delayed. Panel attorneys can be hired, but from the panel they  could be more expensive.\n\nIn fiscal year 2024, there was an inadvertent budgeting error that  resulted in initial funding levels that were at least $100 million less  than what the program needed. As a result of underfunding, Federal  Defender Services began fiscal…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699126/fsgg-federal-defenders-funding"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…that is interesting about this bill, it appears to  be part of the deal that was negotiated by the Senator from Alaska, is  that the States apparently that have the highest error rates with  respect to supplemental nutritional assistance are shielded from the  initial impact of the nutritional assistance cuts.\n\nLet's think about that for a moment.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…Speaker, I rise in support of H.R. 998, the Internal Revenue  Service Math and Taxpayer Help Act. This bill will help taxpayers  better understand why they have received a math error notice from the  Internal Revenue Service.\n\nCurrently, math error notices can be vague and confusing. The law  does not specify how the IRS must describe the math error or…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689361/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…control is neither an act of faith nor of naivety. It is an act  of cold logic and discipline, a process that reduces the risk of  miscalculation, escalation, and catastrophic error. The year will not  only keep America and the world safer, but it will also give time to  hammer out a new accord.\n\nAs the U.S. sits across the negotiation table, there should…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699031/expiration-of-new-start"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…interest, there are other steps that we, Russia, and China  should take--short of negotiating a new treaty--to help reduce the risk  of a nuclear war, whether due to a false alarm, error, or other  misperception. For example:\n\n* Creating joint early warning centers to monitor missile       launches;\n\n* De-targeting, so any accidental launch of a nuclear armed…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699676/the-new-start-treaty"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…tax on tea, there was a revolution in our country that began in Boston.\n\nSmall businesses have no lobbyists, no Mar-a-Lago, no golden gifts  for President Trump, no margin for error. There will be no invitations  to the new ballroom, but I am not going to back down. I am going to  continue to stand up for small businesses across the country, across  Massachusetts,…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…tech, but its impact has been  resonating there for sure in a very damaging way for the United States.\n\nWe need to work together to force the Trump administration to see the  error of its ways. We need to make sure that we get back on track so  that we can win the competition with China, preserve our leadership  role in the world, and build on the great…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695606/devastating-harm-caused-by-trump-administration"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "…rightly addressed this issue by codifying an  appropriate list of approved flags that uphold the honor and dignity  that our military is built on.\n\nHowever, there is a glaring error. A caveat built into the list gives  commanders the ability to fly any flag they deem appropriate. Since  President Trump and Secretary Hegseth have taken office, the woke…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695264/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…claiming that they are a citizen, and, boom, they are registered  for Federal elections with no proof and no ID.\n\nThat is not a system built on trust. It is a system vulnerable to  error, fraud, and exploitation.\n\nIn Colorado, the process was just expedited for illegals to receive a  driver's license. In the State of Colorado, when you obtain a driver's  license,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689994/safeguard-american-voter-eligibility-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…the judiciary by turning judges into policymakers. Worst of all, it  cost millions of innocent lives.\n\nIn overturning Roe, the Supreme Court rightly corrected a grave legal  error and returned authority to the States where it belongs. That  restoration of constitutional order was long overdue.\n\nI also bid hello and welcome to my friends from the Center…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699374/roe-v-wade-anniversary"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…fallen       servicemember is honored correctly Enacting H.R. 2701 helps       ensure that the Star of David marks the Jewish graves of       servicemembers, currently marked in error.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695626/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…total cost of non-MDE,       which will remain at $55 million. The estimated total case       value will remain at $495 million.\n\n(iv) Significance: This report corrects an error included       in the original notification and includes additional non-MDE       items that increase the sensitivity of technology. The       proposed sale will improve Lithuania's…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690233/arms-sales-notification"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…back there. It is on the smaller board.\n\nThe fact of the matter is, what they projected and what actually  happened--and this is actually 2018, not 2016, so I found a printing  error--99.5 percent accuracy.\n\nMr. Speaker, they are not always accurate. Of what they projected for  the clean energy tax credits and inflation reduction, they missed by  miles…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Missouri. Mr. Speaker, I move to suspend the rules and  pass the bill (H.R. 998) to amend the Internal Revenue Code of 1986 to  require additional information on math and clerical error notices, as  amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                  H.R. 998\n\nBe it enacted by the Senate and…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689359/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Headgate prevented new development in the area, which would  have required the expansion of Bolts Lake to provide a water supply for  surrounding homes.\n\nCongress corrected this error in 2019 by allowing the town of Minturn  to access Bolts Ditch for maintenance and repairs. H.R. 1729 builds on  this legislation by allowing additional local entities, including…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693454/bolts-ditch-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Representatives Scholten and  Downing.\n\nArtificial intelligence is changing how businesses operate in real  time. While large corporations can afford expensive consultants and  trial-and-error experimentation, many small businesses do not have the  luxury to do that. For a small business owner like myself, every dollar  matters. The AI-WISE Act helps bridge that…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699206/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…with  11 seconds left in overtime, the Mocs' opponent, UC Irvine, launched a  Hail Mary pass to their player on the opposite baseline, who missed his  shot at the buzzer. This error delivered a well-deserved National  Championship to the UTC men's basketball team--the first ever in the  program's history.\n\nThe UTC Mocs have made Chattanooga and all of…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690281/congratulating-the-nit-national-champions-the-utc-mocs"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…alternative       not made available to the public for review and comment and       in not providing the public an opportunity to provide       informed comment after correction of an error in stated ANCSA       17(d)(1) acreages.\n\nWe appreciate your efforts to move forward with disapproval       of the 2024 Central Yukon RMP and we urge Congress and the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…following new subparagraph:\n\n``(C) notify any agency that has a cooperative arrangement       with the Commissioner of Social Security under paragraph (3)       or (11) of the error.''.\n\n(c) Effective Date.--The amendments made by this section       shall take effect on December 27, 2026.\n\nMr. SMITH of Missouri. Madam Speaker, I yield myself such time…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698922/ending-improper-payments-to-deceased-people-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…matter of Federal law. Whatever basis in  science or public health might have ever backed this up has long since  been debunked. I am glad that we are finally correcting this error  today.\n\nWhy should kids have access to whole milk at school? Well, at least  three reasons. Number one is nutrition. The latest science shows that  whole milk actually is…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698180/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…withdrawn for reasons of safety or       effectiveness; or\n\n``(II) the Secretary makes a written determination that the       prior determination must be changed because an error has been       identified.\n\n``(iv) If the Secretary makes a written determination       described in clause (iii)(II), the Secretary shall provide       notice and a copy of…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…policies, and accounting for what we believe will happen, we would have  about an additional $72 billion of deficit spending over 10 years.  Sadly, $72 billion is kind of a rounding error when we are talking  about 10 years.\n\nIn other words, it is close to breakeven. We would cut taxes, we  would reduce spending, and we would get economic growth. We believe…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}]