[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…their head, and if the Social  Security Administration makes a mistake, it can be addressed in time.  However, our seniors can't afford to foot the bill for when they make  errors. With more than 97,000 residents of my district living under the  poverty line and 175,000 residents relying on Social Security, these  payments are, in fact, a lifeline.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690424/social-security-administration-is-there-to-help-not-hurt-americans"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…consequences, and real veterans waiting longer for care.\n\nVA employees have come forward anonymously, warning that these job  cuts are affecting veterans' care and leading to many errors. Some of  the people let go were even working on the veterans suicide crisis  hotline.\n\nVA services are already stretched thin. These job losses are making  it worse. That…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688352/ensuring-veterans-receive-care-they-earned"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…issues for delivery of legal notices, code enforcement  activities, public outreach, and election mail.\n\nEastvale residents have also reported higher insurance rates because  of errors related to another jurisdiction, disrupting their ability to  obtain affordable wildfire insurance.\n\nI appreciate the diligence of Congressman Diaz-Balart, the chair, and…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693861/establishing-new-zip-codes"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…and veterans across the country expect at the VA.\n\nWhen I questioned him at his nomination hearing--just to give you one  example--about a government audit that found extreme errors in his  judgment while he was CEO of a company called Cardinal, he blamed the  Democrats; he blamed others for his own shortfalls. That is not  leadership. That is not what…", "date": "2025-07-24", "source_url": "https://justfacts.votesmart.org/public-statement/1694219/9999"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "Mr. WELCH. Mr. President, of all the uninformed, ill-conceived, and  self-inflicted errors of this administration, the just-announced  decision to withdraw from UNESCO stands out.\n\nThe justification given by the State Department spokeswoman was a  recitation of outdated,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694037/unesco"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…results are  shrouded in secrecy. When they hype their claim on Twitter or the White  House press room, independent review has shown that their claims are  false or riddled with errors.\n\nBuying condoms for Gaza?\n\nIt didn't happen.\n\nSocial Security payments to people who are 150 years old?\n\nNope.\n\nMr. Speaker, $800 billion in savings on one contract?\n\nOops.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687998/department-of-government-inefficiency"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…administration has left America's cyber gates unlocked at a  time when cyberattacks are rapidly on the rise. Putin will make our  Nation pay dearly for that set of serious errors.\n\nFourthly, Trump administration policies threaten U.S. global economic  standing. Through American ingenuity and hard work, the likes of wish  Russia cannot compete against,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…American-Jewish  servicemembers killed in action remain improperly buried under Latin  crosses rather than Stars of David. While some of these improper  burials were due to clerical errors, we have heard many stories of  Jewish war heroes not wanting to display their faith on their dog tags  while fighting against the anti-Semitic and genocidal Nazi regime.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695467/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…how many States will complete       the changes in an automated manner with minimal disruption       versus manual overrides or computations that could lead to       payment errors and significant delays. See Penn Decl. Doc.       No. 14-2 \f 24.\n\n29. For at least some States, USDA's understanding is that       the system changes States must implement…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…``affected parties fair warning of       potential changes in the law and an opportunity to be heard       on those changes--and . . . afford[ing] the agency a chance       to avoid errors and make a more informed decision. Failure to       follow such procedures can result in a reviewing court       setting aside or vacating the rule. And even though APA…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…without a background in veterans law.\n\nWhile we respect the commitment of those entering this workforce, the  reality is that lengthy training periods slow decisions, increase  errors, and leave veterans waiting even longer for answers.\n\nThe Veterans Law Judge Experience Act takes a practical, commonsense,  and targeted step to address this challenge to…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699209/veterans-law-judge-experience-act-of-2025"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…isn't about accountability. It is about taking food and healthcare from  people who need it most.\n\nPeople have seen how these policies fail. In Georgia, red tape and  paperwork errors have already kicked thousands off their healthcare  coverage, even when they are eligible.\n\nThis isn't reform. This is cruelty. My colleagues need to protect  healthcare for…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691502/gop-tax-scam-hurts-women-and-families"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Committee hears often about the complex nature  of the disability compensation system at the Department of Veterans  Affairs. That complexity, unfortunately, leads to mistakes and errors  that cause our veterans' disability claims to be denied prematurely.  Especially now at a time when we have seen that Secretary Collins has  shifted the Department's focus…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699208/veterans-law-judge-experience-act-of-2025"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…government's file against him show no criminal record, but it  also got his name wrong several times and used two different  identification numbers. Those are pretty major errors to make when you  are locking someone away, the kind of errors that due process helps to  avoid.\n\nThat is not some theory. We are seeing it happen in another case  right now.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Some Republicans  didn't even know what was in the bill. They rushed it through so fast  that we are reportedly going to have to revote on it later this week to  fix all the errors in the bill.\n\nWhile we stand here debating three bills to micromanage the affairs  of the District of Columbia, which has its own Mayor and city council,  who are perfectly…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…sustenance and       progress of good character in your family. Ask for a complete       God-given understanding of the nature and importance of truth       and thereby avoid the errors that can set back or thwart your       spiritual goals.", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694761/recognizing-campbell-the-nature-of-truth-odessa-american"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…and the County may, by       mutual agreement--\n\n(A) make minor boundary adjustments to the Federal land to       be conveyed under subsection (a); and\n\n(B) correct any minor errors in the map, an acreage       estimate, or the description of the Federal land.\n\n(f) Withdrawal.--The Federal land is withdrawn from the       operation of the mining and mineral…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693918/la-paz-county-solar-energy-and-job-creation-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…treatment plan are scheduled and provided.\n\n(C) Patient safety associated with such care at Department       facilities or community care providers, including the number       of errors in medical care that rise to the level of ``never       events'' (such as a foreign body left in a veteran during       surgery).\n\n(2) An evaluation of what changes or additional…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695420/women-veterans-cancer-care-coordination-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…science, operations       research, engineering, and medicine, require data savvy,       including the ability to select reliable sources of data,       identify and remove errors in data, recognize and quantify       uncertainty in data, visualize and analyze data, and use data       to develop understanding or make predictions.\n\n(7) Rapidly emerging…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…SEC. 2. IMPROVEMENT OF NOTICES OF MATH OR CLERICAL ERROR.\n\n(a) In General.--Section 6213(b)(1) of the Internal Revenue       Code of 1986 is amended--\n\n(1) by striking ``errors.--If the taxpayer'' and inserting       ``errors.--\n\n``(A) In general.--If the taxpayer'',\n\n(2) by striking ``Each notice'' in the second sentence and       inserting ``Subject…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689359/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Universal Protocol and builds greater awareness among surgical and  procedural team members about the critical steps that keep patients  safe. This initiative's goal is to prevent errors by ensuring that all  members of the surgical team pause before invasive procedures, so they  can communicate as a group and confirm key information about the  patient and…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692335/recognizing-national-time-out-day"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…DHS Secretary Mayorkas's reckless open border policies. This  legislation is an important step in correcting the previous  administration's costly and in some cases deadly errors.\n\nLast November, the voters voted to turn the page on the failed  policies of the Biden administration, and passing this bill was a  critical step in reversing those policies.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…legal       land description of the land described in that subsection as       the Secretary determines to be necessary to correct clerical,       typographical, and surveying errors.\n\n(B) Availability.--A survey conducted under subparagraph       (A) shall be kept on file and available for public inspection       in the appropriate office of the Bureau…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697670/shingle-springs-band-of-miwok-indians-land-transfer-act-of-2025"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…helpful  information, leaving millions of taxpayers confused about how and when  to rectify the issue with the IRS.\n\nThe IRS MATH Act ensures that the IRS clearly spells out errors on  tax forms and helps taxpayers not only understand the mistake but also  allows a challenge if they see fit.\n\nFiling taxes is already burdensome and time consuming. We can…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689360/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…military cemeteries       overseas (ABMC) were mistakenly interred under markers that       do not represent their religion or heritage. JVW recognizes       that most of these errors are unintentional; however, these       mistakes hide the identity and legacy of those who made the       ultimate sacrifice for our country. American-Jewish       servicemembers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695626/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…the Latin Cross, not the Star of David. Many brave  servicemembers made the ultimate sacrifice while defending freedom in  World War I and World War II, but due to clerical errors or concerns  for their safety during service, their religious identities were not  properly recorded.\n\nThis bill is a meaningful step to correct those errors and to ensure…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689753/american-jewish-servicemembers-to-be-buried-under-the-star-of-david"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the map, consisting of approximately 2.5 acres of National       Forest System land located in the Apache-Sitgreaves National       Forests in Arizona.\n\n(2) Map.--\n\n(A) Minor errors.--The Secretary may correct minor errors       in the map.\n\n(B) Availability.--A copy of the map shall be on file and       available for public inspection in the appropriate…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691144/apache-county-and-navajo-county-conveyance-act-of-2025"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…(2) Adjustments.--The Secretary may--\n\n(A) make minor boundary adjustments to the land taken into       and held in trust under subsection (b)(1); and\n\n(B) correct any minor errors in any map, acreage estimate,       or description of that land.\n\n(e) Gaming Prohibition.--No land taken into and held in       trust for the benefit of the Tribe under this…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697609/lower-elwha-klallam-tribe-project-lands-restoration-act"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…Map, consisting of approximately 14 acres       of National Forest System land located in the Chequamegon-      Nicolet National Forest in Wisconsin.\n\n(2) Map.--\n\n(A) Minor errors.--The Secretary may correct minor errors       in the Map.\n\n(B) Availability.--A copy of the Map shall be on file and       available for public inspection in the appropriate…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694030/wabeno-economic-development-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…and  the advance of freedom around the world because, at our core, our  values are built on our faith.\n\nThis Nation is more likely to crumble under its own weight, its own  errors, than it is by invasion unless we meet the moment, unless we  stand up, and unless we say never again.\n\nNever again will we allow the power of government to be rained down…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}]