[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…imminent threat to the United States or our forces? What  were the threats to U.S. personnel and facilities in the region, should  Iran respond? How might Iran and its proxies escalate and harm U.S.  interests, not only in the region but here at home and in other parts  of the world? How much damage could U.S. military action do to the  Iranian nuclear and…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "Mr. FROST. Mr. Speaker, I rise to strongly oppose the Law-Enforcement  Innovate to De-Escalate Act, a very disingenuous title for a bill that  doesn't mention law enforcement through the text of the bill.\n\nThis bill does weaken gun laws in this country. This bill will…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700035/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…vested with this solemn responsibility.\n\nPresident Trump has not requested or received any authorization for  the use of military force against Venezuela. Yet he continues to  escalate the situation by striking speedboats, seizing oil tankers, and  establishing blockades, which is an act of war.\n\nCongress must be consulted. The President is either trying…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698452/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…accountable, we  abdicate our responsibility to be a voice for the American people and  instead embolden Trump to intensify this conflict.\n\nI rise because these actions can quickly escalate into a conflict  that  could destabilize the Western Hemisphere and would put the lives of  American troops on the line.\n\nI rise because as we see this President abuse the…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696566/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…get our  approval.\n\nThe people we represent did not send us here to be potted plants  while the White House sleepwalks us into another mess. If this  administration wants to escalate, make the case to the American people.  Get consent through their elected Representatives. Follow the  Constitution.\n\nLet me tell you what I think. I think this was all so…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699359/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…U.S. kids with stage IV  cancer, pulling women by their hair down the street, and now just  murdering citizens in daylight. We have an unqualified, masked militia  eager to escalate.\n\nOne lady who I met recently in San Jose asked me: We have only been  through 1 year of this. How will we survive 4 years?\n\nWe won't. Not until we do the right thing. No…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699568/no-funding-for-ice"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…Medicaid cuts.\n\nThose fortunate enough to retain their insurance will face a  staggering cost increase. A family of four earning just $90,000  annually could see their premiums escalate by as much as 69 percent.  That is an increase of over $3,000 per year, and that is crushing for a  working family.\n\nThe expiration of these subsidies will also inflict substantial…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695661/healthcare-subsidies-and-rescissions"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…economic and national security. It gives the Federal  Government the tools and the authorities needed to map, monitor, and  respond to supply chain vulnerabilities before they escalate into full- blown crises.\n\nThis legislation includes critical provisions from last Congress'  Supply Chains Act, which I co-led, including a provision to designate  the Assistant…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690189/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…discount  how precarious that situation was for our country. It was the result of  a decision by Iran to turn the other cheek, to disregard the attacks  and basically not escalate. I am so glad they did, and the President  showed temperance there himself. But we can't be putting ourselves in a  position where our future and whether we do get in a war…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693128/motion-to-discharge-sj-res-59"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "Mr. FROST. Mr. Speaker, I oppose the rule because it contains H.R.  2189, the Law-Enforcement Innovate to De-Escalate Act. This is a  terrible bill and a billion-dollar giveaway to gun manufacturers  wrapped in a deceiving title.\n\nThe corporate lobbyists pushing this bill claim it is an effort…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699906/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "Mr. CORREA. Mr. Speaker, I rise today in strong support of the Law- Enforcement Innovate to De-Escalate Act.\n\nSimply put, Mr. Speaker, this legislation will save lives. It is  supported, as my colleague has said, by an unprecedented, historic  coalition. Support spans 95 bipartisan…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700042/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…speed of mobile online banking and instant  communications. Soon, they will move at the speed of agentic AI.\n\nThe bank failures of 2023 showed that liquidity pressures can  escalate in hours, not days, a speed that will only intensify with the  rise of artificial intelligence and autonomous financial agents.\n\nThis legislation will require the Federal…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699860/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…home.\n\nCongress is not a rubberstamp. It should not be a rubberstamp. The  Constitution does not give one man the power to drag this country into  another war on a whim.\n\nDe-escalate. Get serious about diplomacy. Tell the truth. If the  President thinks he needs a war, then he can come to the people's  House, and he can make his case out in the open where…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700195/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Marines  have been deployed into his city, over the objections of the mayor,  over the objections of the Governor, in a historically unprecedented  way and in a way such as to escalate tensions in his town rather than  to reduce them.\n\nSo he decided to go to a peaceful public assembly. It was a press  conference. It wasn't a private meeting to which he was…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692555/alex-padilla"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…government is supposed to help Americans--not go to war with  them. The administration's deployment of the National Guard was  dangerous political theater intended to sow fear and escalate the  President's mass deportation campaign, not to reduce crime.\n\nThe President's false rhetoric about Chicago being ``overrun'' with  chaos was clearly a pretext to intimidate…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698781/operation-midway-blitz"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…consideration in the  House.\n\nThe Clerk read the title of the bill.\n\nMr. FITZGERALD.  2189.\n\nMr. Speaker, I rise in strong support of H.R. 2189, the Law- Enforcement Innovate to De-Escalate Act.\n\nThis bill will put lifesaving, less-lethal technology in the hands of  more law enforcement and public safety officers.\n\nWhen the Gun Control Act of 1968 was enacted…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700039/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…Speaker, I rise today to support my bill, H.R.  1800, the Solidify Iran Sanctions Act of 2025.\n\nMr. Speaker, at a time when our country is working to achieve peace  and de-escalate military conflict in multiple locations around the  world, we must remain vigilant about the ongoing threats posed by some  of our long-term adversaries.\n\nIran has a well-established…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690689/solidify-iran-sanctions-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Administration or  their respective designees and provides for one motion to commit.\n\nThe rule also provides for consideration of H.R. 2189, the Law- Enforcement Innovate to De-Escalate Act, under a closed rule with 1  hour of debate equally divided among and controlled by the chair and  ranking minority member of the Committee on the Judiciary and the  Committee…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Natural Resources, or their designees, and  provides for one motion to recommit.\n\nThe rule also provides for consideration of H.R. 2189, the Law- Enforcement Innovate to De-Escalate Act, under a closed rule, with 1  hour of debate equally divided among and controlled by the chair and  ranking minority member of the Committee on the Judiciary or their…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, the redistricting war in this  country is starting to escalate to an absurd degree. Among the States  now looking at redistricting, or are currently in the process of it, we  have Texas, California, Nebraska, New Hampshire, Ohio, Kentucky,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…classification of modern less-than-lethal technologies and       provide an update on the strong legislative progress of H.R.       2189, the Law Enforcement Innovate to De-Escalate Act, and       H.R. 4242, the Innovate Less Lethal to De-Escalate Tax       Modernization Act. H.R. 2189 has received significant       bipartisan support and was marked up…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "Ms. Tenney. Mr. Speaker, I thank the gentleman for yielding.\n\nIt is about time that we support the Law-Enforcement Innovate to De- Escalate Act. This crucial legislation ensures that law enforcement  officers have access to the best, less-than-lethal technologies for de- escalation.\n\nUnder current law, certain…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700029/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "…professionals who carried out this  operation. Their discipline and professionalism reflect the highest  standards of our Nation.\n\nI thank President Trump for his actions. He did not escalate a  conflict. He enforced the law.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698886/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "Mr. Speaker, I rise today in support of H.R. 2189, which includes the  Innovate Less Lethal to De-Escalate Tax Modernization Act, led by  Congressman   David Schweikert.\n\nThis legislation shines a bright light on how our laws actually work  in the real world, where outdated policy…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700032/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "Mr. EZELL. Mr. Speaker, I rise today in strong support of H.R. 2189,  the Law-Enforcement Innovate to De-Escalate Act of 2025, bipartisan  legislation that modernizes our Federal firearms laws to better align  with 21st century technology and the real-world needs of law  enforcement officers…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699900/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "Mr. FITZGERALD. Mr. Speaker, I rise in support of the resolution and  in support of H.R. 2189, the Law-Enforcement Innovate to De-Escalate  Act. This bill will put lifesaving, less lethal technology in the hands  of more law enforcement and public safety officers.\n\nWhen the Gun Control Act of 1968 was enacted…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699904/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…automotive, and healthcare industries rely on.  Economically, a conflict would disrupt global trade routes, potentially  triggering a global financial crisis. And it would escalate regional  military tensions, risk broader conflict, and cyber attacks.\n\nA strong American presence in the region lowers the odds of conflict  and reassures our allies that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…country and that political violence is on the rise.\n\nWith a loss this profound, with evil this glaring, and with so much  pain, suffering, anger, and fear, this cycle could escalate. A new,  more severe round of accusations and recriminations, of demonization  and dehumanization, could bring our politics and society to a darker  place.\n\nThat isn't where…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695355/tragic-loss-of-charlie-kirk"}]