[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…fiduciaries' consideration of a set of       important financial risks and I opportunities. This bill       misguidedly attacks Environmental, Social, and Governance       (``ESG'') considerations in fiduciary decision-making as       ``woke'' rather than legitimate and important factors to be       considered in decision-making.\n\nH.R. 2270, the Empowering…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…do  is make it harder for shareholders to vote to put even nonbinding items  in front of a board to consider.\n\nI have heard the other side say that this bill does not preclude ESG  factors from being considered if they are material, but that is not  true in practice. What will happen in practice is that SEC bureaucrats  and political appointees will get…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699159/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…first Trump administration that impose first-of-their-kind restrictions  on plan fiduciaries' abilities to consider what are called  environmental, social, and governance, or ESG, factors when making  investment decisions and exercise shareholder rights.\n\nThe appropriate course of action is to permit fiduciaries to consider  ESG factors so long as they…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…and governance are factors that retirement  plan fiduciaries may consider when making investments on behalf of  retirement plans covered by ERISA. Factors that may fall within ESG  include impact of the company's actions on climate change, working  conditions, and employee safety at the company, and its management  structure.\n\nWeighing ESG factors when…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699157/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…vice chair of the Financial  Services Committee. One of our speakers earlier serves on that  committee where we regularly cross swords philosophically about what  the role of ESG is. Environmental, social, and governance has been a  hot topic, Mr. Speaker. I can tell you that.\n\nWhen he is trying to compare what we are talking about today,  regarding…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699155/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…Americans at risk by issuing a  deeply flawed rule to enable retirement plan fiduciaries to consider or  choose investments based on environmental, social, and governance, or  ESG, factors. That is not free market. That is not capitalism.\n\nIt is proven that ESG factors often charge steeper fees, carry higher  risks, have lower returns, and are well-known…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699156/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…agendas.\n\nOver the past several years, the Biden administration pushed a rule  that encouraged retirement plan fiduciaries to consider environmental,  social, and governance--ESG--factors, when making investment decisions.  That might sound harmless, but in practice, it shifts the focus away  from what retirement investing is supposed to be about: maximizing…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}]