[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…medical needs who relies on Medicaid for essential  therapies and care.\n\nOver the years, Suzie has seen firsthand how Medicaid has been a  lifeline for families like hers, especially in rural communities. The  proud mother and daughter of hardworking Missourians, Suzie apparently  has voted for both Democrats and Republicans, and her husband is a  registered…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…reduced the numbers of  Americans without health insurance coverage. They have provided robust  choices for consumers and provided stability for healthcare providers,  especially in rural areas.\n\nAnd I have heard from those providers who are as worried as their  patients about what will happen to this program.\n\nWhat the Republicans are doing is cruel.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695873/9999"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Because these cuts weren't harsh enough for the Senate, they also  slashed hundreds of billions of dollars in critical support that keep  hospitals and nursing homes open, especially in rural and underserved  communities. Roughly one in four nursing homes and hundreds of  hospitals are at risk of closure without those funds. Do any of my  colleagues really…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693153/one-big-beautiful-bill-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…provide abortion services, even  if that funding isn't being used for abortion care.\n\nThis means shuttering access to trusted providers and family planning  clinics, especially in rural areas where options are already scarce.  They are doing all of this while forcing working families to pay more  out of pocket. When you make working people pay more…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691329/nearly-one-in-four-delawareans-rely-on-medicaid"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…decided to get rid of ``Sesame Street.''\n\nI don't know how many people know this, but a lot of people think  that ``Sesame Street'' is about the education of children, especially  in rural areas, and teaching the basics, like reading, writing, and  arithmetic. However, our colleagues on the other side have pointed out  that: No, this is about wokeism,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693050/defunding-sesame-street"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…nurses are needed each year to meet increasing healthcare needs and to  replace retiring nurses. AHECs have continued to work towards  addressing workforce shortage areas, especially in rural and  underserved communities. Just in the past 5 years, the AHEC program has  trained 2 million healthcare professionals.\n\nI have had the opportunity to work closely…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689246/national-ahec-week"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…more affordable.\n\nThese cuts will throw millions of Americans off coverage entirely,  bury families in medical debt, and result in hospitals and nursing  homes closing, especially in rural America.\n\nIn my district, 21,000 people are likely to lose their healthcare. In  the gentleman from Georgia's district, 36,000 people are estimated to  lose their healthcare.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…up for everyone. Uninsured  patients often delay seeing a doctor and end up needing more costly  care at the emergency room. When there are more uninsured, hospitals,  especially in rural areas, face financial hardships and may be forced  to close. In other words, those unpaid bills do not disappear. They are  shifted onto everybody else, and everyone…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698801/breaking-the-gridlock-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…we are actually  capping the amount of money that you can get in student loans and in  grants to maybe go to medical school because Lord knows we need more  doctors, especially in rural communities, willing to help Americans as  they search for healthcare.\n\nOne place, though, that didn't get cut is ICE and Homeland Security  because this is an administration…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…slash Medicaid by $1 trillion with the  passage of the so-called big beautiful budget bill.\n\nBecause of this law, many hospitals across Illinois and across the  country, especially in rural areas, may not survive. Rural hospitals  are the backbone of communities in my State and in many others. They  are the anchors of the local economy. Several hospitals…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698601/healthcare"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…because of this law, but we are going to have fewer hospitals  and doctors to take care of them. Why? Because Medicaid is a big  revenue stream for really all hospitals but especially rural hospitals.  It can be up to about half of the payer mix.\n\nWhat is a payer mix? It just means you might get paid by private  insurance 30 percent, you might get paid by…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…half involved violent  crime. Yet, today, Federal gang data remains fragmented, inconsistent,  and incomplete.\n\nThat gap puts officers at risk and leaves communities, especially in  rural America, without the tools needed to respond effectively. Our  bill would require the Attorney General to submit an annual report to  Congress on gang activity investigations…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698650/reporting-gang-activity"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…because of this chaos are, in fact, the professionals who deliver  medical care--like doctors and nurses--to veterans. These positions are  already facing shortages, especially in rural areas. How will rural  veterans fare between the bleeding out of the VA employees when many  rural hospitals are now set to shutter their doors under the  President's…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693321/9999"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…percent of people who are treated in the rural parts of  Colorado and across the Nation are on Medicaid. This will significantly  impact red States, blue States, and especially the rural places across  the United States.\n\nLike many people, my family has been impacted by the opioid epidemic.  When I was just 6 years old, my mom hurt her back. She was…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691883/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…also supports hospitals and other health       care providers by reducing their uncompensated care costs and       improving their operating margins, especially [especially,       especially] for rural and safety-net hospitals. If all states       [in America] were to drop the Medicaid expansion in response       to a decline in federal support, a recent…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…coordinate real-time alerts with emergency responders.\n\nEarly warning is essential. It gives pilots time to reroute, gives  communities time to prepare, and saves lives, especially in rural,  high-risk States like Alaska where response logistics are already  challenging.\n\nThis is a bipartisan, science-based system that works. I urge my  colleagues to support…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698112/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…understand the long hours, emotional toll,  and deep responsibility, commitment, and gratification that come with  the job.\n\nToday, we face a nationwide shortage of nurses, especially in rural  areas like many in Iowa. This isn't just a workforce issue. It is a  public health crisis.\n\nWe must do more to strengthen nursing by expanding training  opportunities,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690623/recognizing-national-nurses-day"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…particularly for small businesses. As a  small business owner myself, I understand how crushing regulations like  these harm the small businesses that drive our economy, especially in  rural communities like northeast Georgia.\n\nLast November, the American people soundly rejected the Biden-Harris  administration's disastrous policies. Now, as President Trump…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688545/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…SHREVE. Mr. Speaker, a simple principle should guide us: where we  live should not determine the quality of healthcare that we can get,  but for too many Hoosiers, especially in our rural communities, this  isn't the reality.\n\nThat is why the Working Families Tax Cut Act matters. Through the new  Rural Health Transformation Program, Indiana is receiving…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698777/rural-health-transformation-program"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…seniors in our country thrive.\n\nBut, unfortunately, a Federal rule that is still in place from the  Biden era is putting many of America's nursing homes in jeopardy,  especially those in our rural communities. Last year, under President  Biden, the Centers for Medicare and Medicaid Services finalized a rule  that placed strict, unrealistic regulations on…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688195/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…low- and moderate-income individuals who just can't get there in  terms of a downpayment or just can't get there in terms of the monthly  payment. Manufactured housing, especially in rural America, is a great  solution for a lower downpayment and a lower monthly payment.\n\nBurdensome HUD regulations have been an impediment to unleashing more  manufactured…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…of making it harder for banks to merge, we should be  eliminating outside obstacles to mergers, enhancing competition and  innovation, and ensuring that Americans, especially those in rural and  underserved communities, retain access to physical branches with  employees who understand their local economies.\n\nThat is why I introduced H.R. 1900, the Bank…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…Needy Families program was created to  strengthen families, reduce dependency, and ensure children can be  cared for in their own homes.\n\nPregnancy resource centers, especially in rural communities, clearly  advance those goals. However, under the Biden administration, a  proposed rule was issued that singled out pregnancy centers and  preemptively…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699225/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…businesses.\n\nThough the SBIC program is successful, recent studies have shown that  less than 20 percent of SBIC investment reaches low- to middle-income  communities, especially rural communities.\n\nThe Investing in All of America Act encourages additional private  capital investments in parts of America that are often overlooked by  not counting dollars…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697260/investing-in-all-of-america-act-of-2025"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…colleagues may be feeling pressure today to  accept the veto. I get it. However, I would ask every Member to  consider the pressure felt by the communities they represent,  especially those in rural America who need infrastructure built, who  need clean water, and who need Washington to mean what it says.\n\nWhat does it say to them, to all of our constituents,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698701/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…restoring  power to nearly 200,000 families and businesses that lost power. While  we applaud that progress, it may still take another week to fully  connect everyone, especially in more rural counties that lack  resources. Long-term recovery, of course, will take much longer than  that.\n\nI am grateful for the strong response from our State and Federal…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699701/9999"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…requires technical skills, physical strength, deep  compassion, and a calling to serve others.\n\nEMS providers are vital to maintaining the health and safety of the  public, especially in rural communities like my district, where  resources can be limited and the stakes are high.\n\nAs someone who has spent more than three decades on the front lines  as a volunteer…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691586/recognizing-national-ems-week"}]