[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…seen with the Salt Typhoon cyberattack, foreign  adversaries often see our communications networks and devices as the  entry points to disrupt our daily lives and conduct espionage  campaigns.\n\nIn the Salt Typhoon cyberattack, which was backed by China, several  American telecommunications networks were infiltrated to gain access to  detailed information…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693507/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…spyware to targeted devices.''\n\nCISA's multiyear coverup of the phone companies' negligent  cybersecurity enabled foreign hackers to perpetrate one of the most  serious cases of espionage--ever--against our wonderful country. Had  this report been made public when it was first written in 2022,  Congress would have had ample time to demand mandatory cybersecurity…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694259/telecom-cybersecurity-transparency-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…and Vice President Vance were among those  involved in the plans Hegseth shared against DOD policy on a Signal  group chat on unsecured, nongovernment devices vulnerable to espionage.\n\nHegseth failed to notice that the group chat included a news editor  and reporter with no security clearance. Only Lady Luck graced our  Nation as their haphazard approach…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689228/responding-to-signal-chat-leak"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 906, the Foreign Adversary  Communications Transparency Act. At the end of last year, we learned  that Salt Typhoon, a cyber espionage operation backed by the Chinese  Communist Party, infiltrated several American telecommunications  networks to gain access to detailed information on former Vice  President…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690266/foreign-adversary-communications-transparency-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…requests pursuant  to court orders.'' Vice President Vance subsequently revealed that his  communications and those of President Trump were compromised in this  hack. This espionage incident, and the harm to U.S. national security  caused by it, were the direct result of U.S. phone carriers' failure to  follow cybersecurity best practices, such as installing…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689978/nomination-of-sean-plankey"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…support this rule,  which is the first step in ending our universities' appeasement of  China's crimes against the Uyghur people and countering China's malign  influence and espionage at our academic institutions.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690826/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…embarked on an aggressive strategy to acquire  critical American research and intellectual property. We have seen a  troubling pattern of intellectual property theft, economic espionage,  and illicit influence over academic institutions. These efforts are not  just limited to the economic realm. They are a matter of national  security.\n\nThe United States…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688932/united-states-research-protection-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…threaten our national security, compromise our  geopolitical interests, and erode our academic freedom.\n\nAmerican schools are not for sale, and they are for education, not  espionage. We cannot allow our students, the future of our great  Nation, to be corrupted by foreign adversaries who are systematically  and aggressively attempting to influence our…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…close any loophole that lets foreign actors  purchase access or sway our institutions.\n\nThis is not about research. This is about human intelligence  collection and business espionage. Having spent time in the  intelligence community while I was in the military, this is a serious  matter.\n\nI urge my colleagues to support this amendment and ensure full…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689034/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…ship- to-shore cranes manufactured by Chinese state-owned companies with  Chinese-owned software. Reports indicate the software used in these  cranes can be exploited for espionage, potentially transmitting  sensitive data such as the location and movement of cargo back to  Communist China. This information could easily be used to disrupt  trade, track…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692198/maritime-supply-chain-security-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…hindering our  ability to stay at the forefront of discovery.\n\nA 2023 survey by the Center for Strategic and International Studies  found 224 reported instances of Chinese espionage directed at the  United States since 2000.\n\nAfter conducting oversight of recently enacted research security  requirements, the House Science, Space, and Technology Committee…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688931/united-states-research-protection-act"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…promoting  Chinese language and culture, it is proven that they have been used to  steal critical research, recruit talent for military-civil fusion  enterprises, conduct espionage, commit transnational repression, and  influence academic institutions to the benefit of the CCP.\n\nAt their peak, the United States hosted approximately 118 Confucius  Institutes,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690828/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…from the  Uyghur region.\n\nMeanwhile, Uyghur human rights advocates and family members of  detainees are intimidated and harassed by the CCP's transnational  repression and espionage campaigns abroad. The fact that this happens  here on U.S. soil is unacceptable and threatens our homeland.\n\nThe Uyghur Policy Act directs the Secretary of State to lead…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694801/uyghur-policy-act-of-2025"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…that R&D projects and new technologies play in  helping protect our homeland cannot be understated. It is no secret  that Federal R&D projects are a target for foreign theft, espionage,  and influence.\n\nIt is our responsibility to safeguard them from malicious actors and  prevent the unauthorized access to, or disclosure of, sensitive  information.\n\nThis…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688737/research-security-and-accountability-in-dhs-act"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…Institutes  and affiliate programs on U.S. colleges and campuses. These programs,  often cloaked in the promises of language and cultural exchange, have  served as vehicles for espionage, intellectual property theft, and  transnational repression.\n\nWe cannot allow these vulnerabilities to persist. Today, House  Republicans are taking action. Our Nation's…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690825/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "Mr. MAST. Madam Speaker, I move to suspend the rules and pass the  bill (H.R. 1486) to impose sanctions with respect to economic or  industrial espionage by foreign adversarial companies, and for other  purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690679/economic-espionage-prevention-act"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…consider doing. It is  necessary. In the face of increasingly unscrupulous tactics from the  Chinese Communist Party such as rampant intellectual property theft,  corporate espionage, the use of slave labor, and environmentally  reckless energy practices, it is imperative for the United States to  leverage every available tool to bolster American industry,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692695/global-investment-in-american-jobs-act-of-2025"}]