[{"senator": "Ron Wyden", "party": "Democrat", "sentence": "…production by gutting the tax  credits for wind and solar energy in their budget bill. I was struck,  as we were making the decisions, when natural gas leaders came and  essentially told the Energy Committee, which at one point I chaired:  Look, we are for natural gas, but with AI and all the energy needs for  growth, we need solar and wind.\n\nThese…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696128/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…of voter roll data  ever in our history in order to bolster unsubstantiated and false  claims of illegal voting by noncitizens, despite the fact that  noncitizen voting is essentially nonexistent.\n\nThis type of national voter roll collection is totally unprecedented  in our history. Nothing like it has ever been done before. Nothing like  this invasion…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…power. The power situation is not an  emergency. There is power abundance.\n\nNow, second thing, as many of my colleagues are saying, there are  real consequences because, essentially, what the President is doing is  going all in on fossil fuels and casting aside the opportunities that  come--economic opportunities as well as cleaner climate opportunities--…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688164/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…States was designed and embraced by the United  States in 1782. The seal of the United States is also in the skylight  in the ceiling of the Senate Chamber, and that seal has essentially  been constant since 1782. There is a seal of the President of the  United States that has changed a little bit, but the seal of the United  States that Congress has used…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…rates  to combat those higher prices. As interest rates rise, so do Americans'  largest expenses, from their car payments, to their home mortgage, to  their student loans.\n\nEssentially, the longer we go without addressing this national debt,  the purchasing power of Americans' hard-earned money will shrink each  and every day, and families will continue…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698425/unanimous-consent-requests-the-calendar"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…using our process that we created.\n\nHe shows up with his appointment. What happens? He gets interrogated  through the process. His initial screening is positive, and then he  essentially gets taken at the border from that screening directly to a  prison in El Salvador, a country he knows nothing about, in a process  that eliminated his right through the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690508/trump-immigration-policies"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Vought: This package would make  permanent cuts to USAID and the State Department which was put into  motion illegally. They knew it because they were impounding funds. They  essentially admitted that in the rescissions package because they said  it was pursuant to the Budget Control Act. They knew that what they  were doing was illegal.\n\nNow, 5, 6 months…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692386/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…end inflation on day one, costs  have continued to increase, and his tariffs policy is making things  worse. It is crashing the stock market in the process. His policy is  essentially adding a massive tax to everyday items for families.\n\nI find it unconscionable and, frankly, unacceptable that anyone would  make things more expensive right now, and I…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689333/lowering-costs-for-struggling-americans"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…blow up traffickers, then they  need to come to Congress and seek an authorization to use military  force for that purpose because our Constitution is clear.\n\nThere are, essentially, three circumstances in which we can  constitutionally use force. One is if Congress declares war. We have  not declared war on Venezuela. We have not declared a literal…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…term.\n\nWhat we learned today is that this plane that is being gifted  temporarily to the U.S. Government is going to take several years to  retrofit and will become available essentially at the exact same time  that the two Boeing planes are made available.\n\nSo we don't actually need this plane as a new Air Force One because  the Boeings are still under…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…immediately halt and prohibit the United States from  any research and exploration of the benefits of a central bank digital  currency, or CBDC. A central bank digital currency is essentially a  digital version of the dollar, issued by the Federal Government, that  uses crypto technology known as blockchain to record everything and  everybody who owns tokens.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693736/anti-cbdc-surveillance-state-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…support, and they are  cutting the House entirely out of any discussions with regard to any  permitting reform. It is just a shame.\n\nInstead of discussing this bill that essentially pollutes our waters,  we should be discussing legislation that would make it easier to plan,  permit, and pay for an expansion of the power grid. A lot of that could  be…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…canceled $90 million in disaster prevention funding to  Massachusetts alone.\n\nNo. 94, put all staff on the U.S. Interagency Council on Homelessness  on administrative leave, essentially shutting down the Agency that  works on homelessness in our Nation.\n\nNo. 95, suspended food safety inspections after firing the Food and  Drug Administration workers--food…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…employees who supported DEI initiatives,  culminating in the unprecedented firing of EEOC Commissioners. Without  their presence, the EEOC actually lacks a quorum and is essentially  unable to protect the rights of workers whose rights under Title VII of  the Civil Rights Act have been violated.\n\nSimilarly, President Trump rescinded Executive Order…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…American manufacturers--who want to preserve  the standards.\n\nThe Republican resolution before us today completely nullifies these  energy efficiency standards. It steals, essentially, $3.1 billion in  savings from Americans. Because it is a Congressional Review Act  resolution, it goes one step further and prevents DOE from issuing  substantially similar…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688293/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…President expressing that forcefully.\n\nThen, today, GEN Jack Keane, a very respected observer and officer  and official in the Institute for the Study of War, expressed  essentially the same sentiments as Donald Trump expressed the day  before yesterday and as Senator Kennedy expressed yesterday. On FOX  News this morning, General Keane gave the President…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690223/ukraine"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…that  has a very high paper value--based simply upon the way that startups  receive their valuation, for example, based upon a multiple of an  initial seed investment--then essentially you would have startups that  would be forced to liquefy their assets or would simply not be able to  pay this bill. Therefore, it would no longer be viable to be a startup…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…regulate their  industry.\n\nRather than adopt this common-sense regulatory framework to protect  children and allow adults to make informed decisions, Section 781 of  this bill essentially imposes a national ban of all ingestible hemp  products with any ``quantifiable'' level of tetrahydrocannabinol (THC),  which represents between 90 and 95 percent of hemp…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696735/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…real troupers, professionals, and class acts. I  thank them all for their dedication and effort.\n\nI also remind everybody, because we get tied up in a lot of stuff,  that, essentially, the Homeland Security bill is the Coast Guard, FEMA,  TSA, Secret Service, Border Patrol, and ICE. There are other parts in  there, but that is the majority of what we…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699349/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…night, total  darkness, walking up on a car. The police officer has a flashlight, and  had I not been there, that police officer would have been there by  themselves, and essentially they were there by themselves. I  wasn't armed. Imagine doing that for a living day in and day out.  Imagine pulling a car over on the side of the road and not knowing if…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691164/events-this-week"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…for the politicians act in  the 117th Congress, where they basically codified a COVID-era and  fraud-ridden election law. They included, ironically, prohibiting voter  ID essentially. It also included ballot harvesting, promoting mass  voting by mail, and taking taxpayer dollars to fund political  campaigns.\n\nLet's be clear. Democrats believe Congress…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700003/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…United States or the  European Union, China's central bank, most countries have a central  bank. Switzerland has the Bank for International Settlements. Their  central bank is essentially the central banker to the central banks, so  when central banks pay each other, they broker the transaction through  the Bank for International Settlements.\n\nWhat is the…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…facts get in  the way of a good story. He pounds the table over the use of same-day  authority. The reality is that the first rule for Build Back Better  extended what is essentially a martial law procedural lockdown of the  House floor, granting broad, same-day authority that allowed the  majority to jam through changes without proper scrutiny.\n\nLet's…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…possibility  of a preliminary background check coming back clean because there  simply wasn't enough information available to determine whether this  person was safe or not.\n\nEssentially, the policy of the Biden administration was--the default  was, come on into the country, in the absence of derogatory  information. But the fact of the matter is, in war-torn…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…law.\n\nRelating back to the Times article, the third issue to raise is that  Thrush, Feuer, and Goldman did something unforgivable. That  unforgivable thing was their article essentially accusing my  whistleblowers of violating the law. It does so, in part, by citing a  complaint filed by J.P. Cooney and Molly Gaston. These were two of Jack  Smith's partisan…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…before he was brought to the Southern District  of New York.\n\nNarcoterrorism is a serious, serious charge. If you look at the  allegations in there, Maduro and his associates essentially flooded the  United States with thousands and thousands of tons of cocaine.\n\nThe other thing that doesn't get mentioned enough is the fact that  our adversaries--Iran, China,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698885/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…obstruct their activities and, in some  cases, attack them with rocks and Molotov cocktails and other weapons.\n\nWhat makes this all the worse is that this group, CHIRLA, is  essentially a subsidiary of the State of California and received some  $32 million in funding from the State of California just in 1 year, as  well as receiving Federal funding and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…Government to deporting  the millions of illegal alien invaders, we need to make progress.\n\nRight now, a single district court judge can impede this progress on  a whim, essentially holding the America First agenda hostage  indefinitely. This must end.\n\nMr. Speaker, I strongly urge my colleagues to join me in voting  ``yes'' on the No Rogue Rulings…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "John James", "party": "Republican", "sentence": "…assure you that I am not. This Biden-era waiver  allows California to ram its comply-or-die, zero-emission truck rule  down the throat of the American trucking industry, essentially gutting  the trucking industry all across Michigan and across the country.\n\nIt is a Green New Deal mandate that will crush our trucking industry  and drive costs up on everything…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690473/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…understand.\n\nThe truth is, this legislation will help Americans keep more of what  they earn by lowering taxes across the board, and not a single Senate  Democrat voted for it. Essentially, by voting against it, they voted  for a $3,000 tax increase on most families back in Texas.\n\nThe Working Families Tax Cuts Act permanently increased the standard  deduction…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}]