[{"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…there is a very simple way to fix this, and it is  right in front of us: pass the bill that Senator Shaheen and I lead to  make these tax breaks permanent.\n\nTime is of the essence. Families and businesses are going to get  those dreaded letters in the mail any day now saying their premiums are  going up 75 percent. Families will have to make really…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695650/healthcare"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "Mrs. SHAHEEN. Mr. President, I come to the floor this afternoon to  join a number of my colleagues because time is of the essence. If  Congress doesn't act to extend tax credits for the cost of health  insurance, millions of Americans are going to lose their coverage and  many more could see their costs…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695663/cloture-motion"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…never ever forget her.                  Honoring the Life of Lynne Trotter Wagstaff\n\nMr. LATIMER. Mr. Speaker, every now and then, there are people born  who personify the essence of love in action. On November 2, 1946, Lynne  Louise Trotter, later Lynne Louise Trotter Wagstaff, was born in  Harlem, New York. She was one of those people.\n\nLynne attended…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695505/recognizing-the-life-of-millie-ortiz-sheehan"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…manufacturers to ensure that the standards work. After all of this hard  work, Republicans now want to swoop in and repeal these standards on  coolers and freezers. They are, in essence, walking out on the cost  savings at a time our neighbors really expect us to work together to  lower the cost of living.\n\nThere is a larger issue here, and it is the fact…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689260/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…have another chance to deliver relief for the American  people, Republicans, by passing the same bill the House approved last  week with bipartisan support. Time is of the essence.\n\nThe New York Times reported that nearly 1.5 million Americans already  have lost coverage. Americans are in the middle of a healthcare  emergency, all because the tax credits…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…over the  Rubicon with a blindfold over his eyes, and that is a recipe for  catastrophe.\n\nCongress must assert its authority on matters of war and peace, and  time is of the essence. Multiple warships have been moved from other  ports of the world to be just off the coast of Venezuela. By some  estimates, 10 percent of the Navy's deployed assets are now…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696558/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Energy, whose job it is to root out waste, fraud, and abuse; the  firing of experts that oversee the nuclear enterprise and our nuclear  weapons; and tariffs, which are, in essence, new taxes on American  families and businesses, is really socking it to the pocketbooks of  American families and businessowners, except for billionaires like Elon  Musk,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688544/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…I  have done. I was in here, and I called to the attention of the  President that he had no right--I didn't say right. I said that he  didn't have a mandate, but I was, in essence, saying he had no right to  eliminate or to cut Medicaid. Then I went on to talk about Social  Security and Medicare.\n\nI was among the very first to call this to the attention…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692296/and-still-i-rise-denouncing-the-presidents-authoritar-ianism-and-recognizing-the-impeachment-warriors"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…Union. It marks the moment when  Delaware said: ``We can govern ourselves. We can shape our own  future.''\n\nThat commitment to dignity, democracy, to self-determination is the  essence of who we are as Delawareans.\n\nEach June, my neighbors gather in Old New Castle, one of the most  historic towns in America, to honor our legacy with joy and pride.\n\nSeparation…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692377/recognizing-milford-delaware"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…up in this union household. I land on that  moment, and every single one of us as House Democrats have a similar  story to tell about why in our heart, in our soul, in our essence, in  our experience we are so horrified by the attacks on organized labor  because we understand the importance of what organized labor has meant  to the American journey.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…through  the House procedures. What we can do today is vote to defeat this  previous question.\n\nMr. Speaker, I thank the four Republicans who have joined us, but  time is of the essence. They need to go one step further and vote to  defeat the previous question, alongside Democrats, so that we can have  a vote today in this House before we go on break.\n\nCongress…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698301/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…for families and kids in need at the best value.  If fresh food is no longer available, our community will suffer.\n\nThese cuts must be reversed and quickly. Time is of the essence when  it comes to our children having enough to eat.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689059/feeding-our-children"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…of South Carolina  was doing quite well financially as a hedge fund manager doesn't think  the American people care either. To quote him: ``Access to cheap goods  is not the essence of the American Dream.''\n\nClearly, Mr. Trump and Mr. Bessent have never struggled to make ends  meet from paycheck to paycheck and appear to view those who do with  disdain.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Speaker, I wish to address violence. I wish to address violence,  and I wish to start by indicating that, yesterday, I published a tweet.  This tweet, Mr. Speaker, indicated, in essence, that this is the time  for all persons of good will to take a stand against violence and that  persons should do this because Dr. King was right, and his words are  right…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…who are interested in this topic. This message will be sent to  persons. It will be published. It will be on my website. It will be  available to those who desire to know the essence of it.\n\nThe message reads with a reference, and the reference is: ``My reason  for impeaching the President: The threat that we said Donald John Trump  posed to democracy…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…grandchildren: Emma, Anne, Raegan, Kassidy, and Quinn. But Diane's  sense of duty has never stopped at her own front door.\n\nService is not just something Diane does--it is the essence of who  she is. A pillar of our community, she has led Girl Scout troops,  inspired others as a Zumba instructor, and spearheaded efforts that  have uplifted countless lives.…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688923/recognizing-diane-reitz-a-light-of-service-a-heart-of-strength-and-a-legacy-of-honor"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…on the table or to postpone indefinitely.\n\nMr. Speaker, I understand that you have to go back to Jefferson's  Manual and old practices to figure that out. Yet, that is, in essence,  what this rule does in relationship to the resolutions that have been  discussed being laid on the table and not being brought up.\n\nMr. Speaker, I will talk about proxies…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…In sum, Putin does not see this negotiation as a means to bringing  about an end to the conflict in Ukraine; he sees it as a key piece to a  larger war against the West. In essence, this negotiation is much  bigger than Russia and Ukraine. We need to listen to what Putin says  but also watch what he does as he attempts to stall peace negotiations  while…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…the RDDC has been instrumental in promoting  inclusivity in healthcare policy.\n\nThe RDDC proudly awarded Liz this year's RISE Award, as she  consistently embodies the very essence of what RISE stands for  Resilience, Inspiration, Strength, and Empowerment.\n\nAs Liz would say, ``being a patient with a rare disease is the  hardest job in the world,'' a…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688709/recognizing-elizabeth-kennerleys-tireless-rare-disease-advocacy"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…deciding that we don't have to enforce our current  immigration laws. We have people like--I am from Wisconsin--the  Governor of Illinois and the Governor of Minnesota, in essence, saying  that we do not want ICE in our States. Same thing with the ridiculous  mayor of Minnesota.\n\nWhat would happen if the word got out that, if you come illegally  into…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…standards       by which program determinations would be made, thus directly       affecting the area for and number of timber sales that would       result in contracts. In essence the memorandum went beyond       how the Forest Service organized its internal operations.       Similarly, in B-238859, Oct. 23, 2017, we declined to apply       CRA's third…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694269/us-government-accountability-office-legal-opinion"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…laws should be enforced.\n\nIt is very difficult for President Trump to protect our country when  we have elected officials, mayors and Governors from around the  country, in essence saying: We are going to stand in the way of  enforcing our immigration laws.\n\nIt is time for the American people to stand up and tell their local  officials that we want our…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688662/highlight-of-trump-administration"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…standards       by which program determinations would be made, thus directly       affecting the area for and number of timber sales that would       result in contracts. In essence the memorandum went beyond       how the Forest Service organized its internal operations.       Similarly, in B-238859, Oct. 23, 2017, we declined to apply       CRA's third…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…the standards by which program determinations would be made,       thus directly affecting the area for and number of timber       sales that would result in contracts. In essence the       memorandum went beyond how the Forest Service organized its       internal operations.\\48\\ Similarly, in B-238859, Oct. 23,       2017, we declined to apply CRA's…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693085/us-government-accountability-office-legal-opinion"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…the standards by which program determinations would be made,       thus directly affecting the area for and number of timber       sales that would result in contracts. In essence the       memorandum went beyond how the Forest Service organized its       internal operations.\\43\\ Similarly, in B-238859, Oct. 23,       2017, we declined to apply CRA's…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693059/us-government-accountability-office-legal-opinion"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…concerned.\n\nGod bless Charlotte for advocating on behalf of this bill and, of  course, my good friends Mrs. Cammack and Mrs. Dingell. We have to get  this done. Time is of the essence.\n\nMr. Speaker, it is a responsible thing to do, and I yield back the  balance of my time.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692719/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…professional, and always willing to go the extra mile to meet their  clients' needs. Whether you're looking for a quick trim or a complete  makeover, Beauty Mood has you covered.\n\nIn essence, Jenya's story embodies the American Dream. Hailing from  Minsk, Belarus, she came to the United States with the dream of opening  her own salon. In 2019, she earned her cosmetology…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691903/recognizing-beauty-moods-one-year-anniversary"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…been since before 1890.\n\nWe have nothing to apologize for that we are not letting enough  people in this country. However, sadly, there are too many elected  officials who, in essence, want to get rid of the immigration laws. We  saw this in the 2016 election in which way too many Democrats promised  free medical care for people who come here.\n\nIn any event,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699736/america-cannot-have-unlimited-immigration"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…and other  hostile actors for a military parade. They are clearly sending a  message to the United States and our allies that they are more united  than ever.\n\nTime is of the essence. We need to expedite the AUKUS partners'  access to markets and make sure this defense pact is working as  intended.\n\nBureaucratic delays to the AUKUS agreement undermine…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694782/aukus-reform-for-military-optimization-and-review-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…back to the church, getting back to faith, getting  married, having children. That is the type of conservatism that I  represent.''\n\nI got to be honest, that should be the essence of conservatism and  the essence of who we are. What point is there to living free if you  are not advancing toward the kingdom of God?\n\nCharlie had courage to speak to this,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}]