[{"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…honored to be appointed  to the Adams Memorial Commission by Democratic Leader Hakeem Jeffries.  I also recognize and thank the commission chair, Jackie Cushman, who  was essential to this whole process and really was a driving force in  bringing all of us together, as well as Commissioner Major General  Peter Cooke, and Commissioner Richard Houghton…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697631/adams-memorial-great-american-heroes-act"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…administration's plans to raid Social Security.\n\nIf you get your healthcare through Medicaid and Medicare, you are  feeling alarmed at this administration's intent to gut these essential  programs.\n\nIf initiatives like SNAP and Head Start help keep your family's head  above water during tough times, you are feeling frustrated that this  administration is…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…affected by disasters and crises. Good360 is meeting  disaster-driven challenges head-on, heading up a nationwide network of  nonprofit partners and corporate donors to deliver essential products  to individuals and families in times of crisis. Through continuous  coordination and dialogue, Good360 has demonstrated its capacity to  serve as a strategic partner…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694807/recognizing-good360-in-honor-of-national-preparedness-month"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…role in promoting sustainability and resilience in our  environment. They provide critical habitats for wildlife, including  pollinators like bees and butterflies, which are essential for  agricultural productivity. They also help reduce our reliance on  chemical fertilizers and pesticides, prevent soil erosion and improve  water quality. Beyond their…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688920/supporting-the-designation-of-april-2025-as-national-native-plant-month"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…billion from the Bipartisan Infrastructure Law, zeroes out  Army Corps programs that clean up radioactive waste and blocks clean  energy initiatives. My four amendments support essential funding for  our National Labs and our continued goal to restore the Chesapeake Bay.  Specifically, three of my amendments support the Continuous Electron  Beam Accelerator…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694942/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…challenges, my ESOP Funding for SBA Position  Act of 2025 will create a position within the SBA to guide small  businesses through the process of setting up ESOPs, providing essential  support on tax considerations, compliance, stock valuation and securing  funding. This new SBA position will provide businesses with the  resources they need to navigate…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690133/introduction-of-the-esop-funding-for-sba-position-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…energy helps keep the lights on.\n\nUnfortunately, Republicans seem uninterested in acknowledging that  basic reality, that solar and wind, partnered with batteries, can be an  essential part of a reliable power grid. Instead, they have done  everything they can to increase the costs of these technologies and  make it harder to add clean energy to the grid.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…communities across the country, no  matter what city they are located in or what party they belong to.\n\nRather than driving economic growth, this legislation would strip  essential resources from some of our Nation's most vibrant and diverse  communities. This would hurt the livelihoods of hundreds of thousands  of businessowners. If the New York office…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692101/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…funding to immigrant-serving organizations and reinforced King  County's commitment to being a welcoming community. He launched the  Crisis Care Centers initiative, providing essential care and reducing  the burden on emergency rooms and jails. Dow's commitment to  environmental conservation resulted in the protection of 30,000 acres  of land and the restoration…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691034/recognizing-the-contributions-of-dow-constantine"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…Lakes region.\n\nWe know the devastating effects that invasive species, pollution, and  extreme weather have had on the Great Lakes, and the research conducted  at this lab is essential to mitigating these threats and addressing  these issues.\n\nThe work of the GLSC and the Great Lakes Fishery Commission has  reduced the invasive sea lamprey populations in…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698194/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…mass incarceration and toward       education, housing, mental health, and violence prevention.\n\nH.R. 5107 and H.R. 5214 would undo this progress. By       stripping away essential police accountability measures and       re-imposing wealth-based pretrial detention, these bills       would re-entrench systems that have already been proven       ineffective,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Children's hospitals, who depend on Medicaid, can't cost-shift to  older patients on Medicare. They have been blasting this proposal from  day one and they have continued it.\n\nEssential hospitals, which are the safety net hospitals for this  country, have also said that it is going to lead to closures of  hospitals as well as the private-sector hospitals.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690996/budget-reconciliation-bill"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…schools, played with our children, pledged  allegiance to our flag, and made our country, every single day,  strengthened in every way. They are doctors, teachers, lawyers,  essential workers, and businessowners. They pay taxes.\n\nThey keep the American Dream alive, but they still live a life in  limbo.\n\nImagine building a life here only to be told to leave…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688333/providing-security-and-path-to-citizenship-for-dreamers"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…of thousands  of Federal employees will have profound and devastating consequences  across the country.\n\nOur dedicated civil servants work tirelessly each day to deliver  essential services, conduct critical scientific research, and ensure  the safety of our communities. They deserve better.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688136/fired-by-president-trump"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…habitats, improved water quality,  and fostered regional resilience since its creation in 1987.\n\nProtecting and restoring Mobile Bay, which is in the heart of my  district, is essential to Alabama's environment, flood protection, and  seafaring economy as well. Mobile Bay is now home to the deepest port  in the Gulf, so protecting its surrounding estuaries…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698177/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…depends on the same perception for the  legitimacy of their office.\n\nFor centuries, our elections were the gold standard for the world  because they were very hard to cheat in. Essential components of this  process were 30-day registration, in-person election day voting, and  proof of identity.\n\nIn recent years, in many States, the woke left has torn down…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690012/safeguard-american-voter-eligibility-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, if critical minerals like lithium are  essential to our military and to our national security, if that is the  case, then why are we still relying on our number one global adversary  to supply them?\n\nChina is mining about…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698230/application-of-mineral-leasing-act-for-acquired-lands-to-hardrock-minerals"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…today, providing the  telecommunications necessary not only for commercial use but for  military use, as well, to make sure that our men and women are  protected when GPS is essential.\n\nTonight, we will have yet another launch into the sky as SpaceX is  propelling this movement forward.\n\nAs we recognize, space is important for our economy, infrastructure,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…People's Republic of China.\n\nThese actors have demonstrated a level of sophistication and planning  that reflects both significant resources and a deep understanding of  the essential systems that keep our country functioning.\n\nGroups associated with the PRC, including those known as Volt  Typhoon, Salt Typhoon, and others, have directed their attention…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696758/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…or politics over those people who they  represent.\n\nThe most important thing right now is that we get back to work,  making sure that the Federal Government can provide the essential  services that people depend on and that Congress can continue working  to pass full-year funding legislation, providing responsible Federal  spending and funding those essential…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696734/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…October 7, 2023, continuing to impact the survival and       meaning of the Jewish state from within and without. All       those seeking searing reflection should turn to an essential       book of blood, pain and love. Amir Tibon gifted Israeli       author and noted journalist's recent The Gates of Gaza (A       Story of Betrayal, Survival, and Hope…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690665/israel-at-77"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…bipartisan Congressional Agricultural Trade  Caucus.\n\nThe State of Iowa leads the Nation in corn, pork, and soybean  production. Expanding access to international markets is essential for  our rural communities to succeed.\n\nIn the past, bad trade deals and overregulations from Washington have  held our producers back. By joining the Agricultural Trade…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689398/supporting-american-elections"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…it goes down enough,  you can't even travel in China.\n\nThey are linking this digital ID with the payment system, the digital  currency, and in that sense, they are kind of essential components to  the way that it works. The way that Visa or Mastercard establishes who  you are has its own system. Here in the central bank digital currency,  digital ID…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…and one of Congress' most  important duties.\n\nMy CRA will not eliminate the program that collects this tax, but it  will remove the EPA's ability to collect it. This is an essential first  step in eliminating this tax, while we work to undo the underlying  statute: killing the natural gas tax once and for all. It is critical  to negate these punitive…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688184/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…for housing. Their  dedication shone through in rapid response efforts. In the days  immediately following Hurricane Helene, 49 residents received critical  assessments and essential resources. After Hurricane Milton, they  worked with 225 displaced individuals who remained in shelters,  demonstrating their unparalleled ability to adapt and respond under…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691174/recognizing-maria-wilkinson"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…establish  procedures for permitting cross-border infrastructure.\n\nCross-border infrastructure, especially oil and natural gas pipelines  and electrical transmission lines, is essential to American communities  across the Nation.\n\nInstead of a clear statutory process, a myriad of executive orders  over decades have provided the legal context for permitting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695688/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…has done testing, if  you have served along the Panhandle, you know how important the  military training is on the testing there for the Gulf Test Range. This  range is an essential part of the Department of War's military training  and is supported by several military communities along Florida's  Panhandle.\n\nIt is the largest multidomain military training…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698295/9999"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…their organization's values, and  positively impacts student life on campus.\n\nAs president of the Interfraternity Council during the 2024-2025  academic year, he played an essential role in advancing Greek life and  fostering collaboration among Greek organizations. Robert is an  outstanding young man who has consistently excelled in all of the  mentioned…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692245/congratulating-greg-parker-retailer-executive-of-the-year"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Wendelville Volunteer Fire Company.\n\nRandy has been a leader in Fire Prevention, spending many hours with  the Fire Prevention trailer educating the community, and has been an  essential contributor to fundraising events such as chowder-making,  lobster dinners, and the Farmers Breakfast. His dedication extends to  supporting both the operational and social…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699565/recognizing-randy-moje"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…administration's OCC rule  burdened businesses with excessive red tape, particularly targeting  small banks and limited beneficial mergers.\n\nReversing this rule allows for essential mergers that drive  innovation, lower operational costs, and benefit consumers. Remember,  this rule was issued without coordinating with any other Federal  agency.\n\nThis…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691497/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}]