[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Speaker, today I rise in support of H.R. 3095, a  bill that would assign a new ZIP Code to the city of Green, a  municipality within Ohio's 13th Congressional District.\n\nEstablishing unique ZIP Codes may not be what most folks think about  when they are considering Federal legislation; however, for the  citizens and businesses and the economy of the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693900/single-unique-zip-codes-for-certain-communities"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…policy, and that is what the  Congress of the United States does. We create the budget of the United  States. Fiscal policy is here, and monetary policy is at the Fed,  establishing the rates in terms of relating to inflation.\n\nLet's rid ourselves, disabuse ourselves of notions. Instead, we need  serious ideas about how to make our economy work for…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694017/federal-reserve-independence"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…designed to facilitate courtroom  sharing for senior district judges, magistrate judges, and bankruptcy  judges.\n\nThere is still some cause for concern. This legislation, by  establishing sharing guidelines for active district court judges, will  certainly help.\n\nI support this legislation because this is about making the American  taxpayer dollar go further…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695379/courthouse-affordability-and-space-efficiency-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…impartial, thoughtful, and even-handed, evaluating every case from, in  her words, a ``neutral posture.''\n\nSince her confirmation, Justice Jackson made her mark on the Court,  establishing her status as a sharp and inquisitive questioner of the  parties before her. And whether she authors majority opinions or  dissents, she always demonstrates a brilliant…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689666/justice-ketanji-brown-jackson"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…we paying for this?\n\nThere are no serious answers. The only thing we do know is why Trump  is doing this--for oil--because this clearly is not about ending  tyranny and establishing a democracy since Trump outright dismissed any  possibility of helping the opposition party to build a true democracy.  And it is clearly not about drug trafficking. After…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698684/9999"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Ms. McCOLLUM. Mr. Speaker, I rise in opposition to H.R. 3633, the  Digital Asset Market Clarity Act. S. 1582, the Guiding and Establishing  National Innovation in U.S. Stablecoins Act, and H.R. 1919, the Anti- CBDC Surveillance State Act.\n\nWhile I am opposed to these three bills, I am not opposed to the  concept…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694254/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…subject to the  approval of two-thirds of the Council and a 30-day congressional review  and comment period. This bill would help maintain the independence of  the CFO by establishing a permanent floor on the CFO's pay and by  prohibiting the Council from reducing the CFO's pay during the CFO's  term.\n\nAlthough the D.C. CFO is the most powerful non-elected…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698470/introduction-of-the-district-of-columbia-chief-financial-officer-salary-home-rule-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…granting  exclusive favors or preferences; consulting the natural course of  things; diffusing and diversifying by gentle means the streams of  commerce but forcing nothing; establishing with powers so disposed--in  order to give to trade a stable course, to define the rights of our  merchants, and to enable the government to support them--conventional…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…and cost reductions.\n\nMany communities face preventable gaps in health care access that  lead to higher emergency room use, more hospital admissions, and rising  costs. Establishing 10-year health investment zones will help close  these gaps and ensure that underserved areas receive the consistent,  affordable, and high-quality care they need.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699933/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…There is not a bunch of destroyed evidence like the gentleman claims.  That is just not accurate. The select committee complied with the  requirements of the resolution establishing it, in consultation with  the Clerk of the House and the document retention precedents of other  committees of this House. The select committee's final report and its  support…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…the number of staff working on Pacific  Islands issues and in the region, authorizing the Secretaries of State  and Commerce to hire locally employed staff in the region, establishing  a workforce development program, codifying a media program and more.\n\nIt increases U.S. security assistance to address regional maritime  security, transnational crime…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693346/introduction-of-the-blue-pacific-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…to implement       barred owl management and actions are limited to the lands of       willing landowners and land managers, we have previously       concluded that rules establishing requirements for voluntary       programs may still substantially affect non-agency parties       that choose to participate.\n\nIn B-334146, we examined U.S. Department of…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693338/us-government-accountability-office-legal-opinion"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Constitution has been amended specifically to advance inclusion,  equity, and diversity, granting freedom to Black Americans from slavery  and ensuring their right to vote, and establishing the right of women  and those over 18 to vote, as well--free speech, assembly, and  religious practices for all.\n\nEconomic growth recognizes the buying power of all of our…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693593/dei-policies-build-stronger-future"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…pastors, including Reverends Howard S. Ryan,  G.P. Hertweck, Gerald Ogg, Sammy Hayes, and Arnold Brown, the church  grew in both membership and outreach. Expanding facilities,  establishing new ministries, and adopting the name Bethel Temple  Assembly of God reflected its evolving mission and growing  congregation.\n\nIn the decades that followed, Reverends Ron…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696401/recognizing-the-70th-anniversary-of-bethel-temple-church-in-hampton-virginia"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…humor, and stellar insight into human nature. Her hearty  giggle elevated people's spirits, and she suffered no fools. She stood  her ground, and she plowed her own ground, establishing herself as a  preeminent advocate for women's economic rights.\n\nShe championed senior citizens and the refinancing of Social Security  in April of 1983, serving on the House…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695548/moment-of-silence-for-mary-rose-oakar"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…courage but also to the profound sacrifices made in  the defense of our freedoms.\n\nOver 150 years ago, on March 25, 1863, the very first Medals of Honor  were presented, establishing a tradition of recognizing those who  displayed unparalleled bravery in the face of overwhelming danger.\n\nMore than a century later, in 1990, Congress designated March 25…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689171/national-medal-of-honor-day"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "Mr. GARBARINO. Madam Speaker, I move to suspend the rules and pass  the bill (H.R. 2659) to ensure the security and integrity of United  States critical infrastructure by establishing an interagency task  force and requiring a comprehensive report on the targeting of United  States critical infrastructure by Peoples Republic of China state- sponsored…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…de-escalate encounters and reduce the       need for deadly force, an outcome directly at odds with       public safety goals nationwide.\n\nH.R. 2189 corrects this problem by establishing a       modernized definition of a ``less-than-lethal projectile       device'' and creating a DOJ-guided, multi-step classification       process to ensure these devices…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…congratulate Chairman Hill and Chairman  Steil and thank them for their work on the stablecoin legislation.\n\nThe GENIUS Act represents an important step for this Congress in  establishing the United States as a leader in the digital asset space.\n\nThis legislation, together with the market structure bill that we  previously considered, which I have had the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693845/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…along with  its continuity safe harbor, goes back more than a decade.\n\nIt is simply common sense for Congress to look to a well-understood  and long-established term in establishing such a transition period.  After all, the purpose of a transition period is to allow industry time  to adjust to new rules and requirements and avoid market disruptions.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694089/one-big-beautiful-bill-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…and       department procedures, or such legislation or procedures in       an insular area of the United States, enabling local planning       and zoning authorities and establishing and guiding related       policies and programs.\n\n(b) Guidelines on State and Local Zoning Frameworks.--\n\n(1) In general.--Not later than 3 years after the date of…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…advancements in high-performance computing, keeping us at the forefront  of research and development.\n\nAdditionally, their collaborative work on nuclear energy is vital to  establishing a long-term human presence on the Moon and next-generation  in-space propulsion. However, these joint technological breakthroughs  not only aid our space endeavors, but…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688985/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…that have no benefit to taxpayers themselves.\n\nI was excited to see President Trump taking an unprecedented approach  to curb excessive spending by our Federal agencies by establishing the  Department of Government Efficiency. Since established, DOGE has  illuminated the billions of dollars being drained on pointless projects  that do nothing to help the…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692496/rescissions-package-is-first-step"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…then, the university has built a nationally recognized research  park housing over 50 companies and employing nearly 14,000 Utahns.\n\nResearch Park has been instrumental in establishing Utah as a leader  in innovation. Last year, I was proud to welcome my colleagues to the  Ways and Means Committee to Research Park for a field hearing to show  them first-hand…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698134/university-of-utah-research-park-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…their respective  designees, provides one motion to recommit, and makes one amendment in  order.\n\nFurther, the rule provides for consideration of S. 1582, the Guiding  and Establishing National Innovation for U.S. Stablecoins Act, also  known as the GENIUS Act, under a closed rule.\n\nThe rule provides 1 hour of debate, equally divided and controlled by…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…this  initiative is to throw out the map that the independent commission has  drawn for this decade.\n\nThen, to make things even more farcical, it goes on to say that it is  establishing a policy of the State to support independent  redistricting. No, this doesn't. It doesn't establish any policy  supporting independent redistricting. The only thing that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…training over a  dozen volunteers on clothing insecurity among homeless individuals. She  guided them in organizing a clothing drive, collecting over 2,000 pairs  of socks, and establishing a permanent sock closet. Her efforts will  have a lasting positive impact on the community.\n\nOn behalf of the 17th Congressional District of Florida,  congratulations to…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690446/recognizing-reagan-graham-gold-award"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…acquisition process.\n\nIt also cuts through red tape by exempting smaller programs from  cumbersome regulatory burdens. It revitalizes the national defense  industrial base by establishing the defense industrial resiliency  consortium, and it bridges the ``Valley of Death'' by creating the  Bridging Operational Objectives and Support for Transition Program…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695147/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…the United States economy through the use of a       trans-Atlantic submarine fiber optic cable described in       subsection (a);\n\n(7) the value, cost, and feasibility of establishing a data       center and high-security cloud services facility, with       independent power generation, in the United States Virgin       Islands for communications of the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692701/assessment-of-trans-atlantic-submarine-fiber-optic-cable"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…shall not apply to the       Advisory Working Group established under this paragraph.\n\n``(3) Incorporation of information in educational resources       and modules.--In establishing and maintaining the educational       resources and modules under subsection (a), the       Administrator--\n\n``(A) shall consider relevant, existing information       developed…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699206/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}]