[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…the day-to-day operations and upkeep of  the park. She has gone above and beyond to educate and engage young  Coloradans. She spearheaded programming for school groups and  established internships and apprenticeships at the park. The AHRA and  the Salida community are lucky to have Corrine's passion and dedication  as she helps to inspire an appreciation…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687996/recognizing-corrine-servis"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Congress since there is  never justification for Congress to legislate on local D.C. matters,  but I will discuss it.\n\nThe D.C. law, which the D.C. Council unanimously passed, established  a child tax credit, increased an existing earned income tax credit, and  decoupled D.C.'s tax code from some of the tax provisions in the so- called One Big Beautiful Bill…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699680/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…and mission were global in scope--Bishop Williams  traveled extensively to Haiti, Africa, London, Paris, Amsterdam,  Belize, Jamaica, Honduras, Mexico, and beyond, and he established two  ministries in Liberia. He served as Bishop Ordinary for the Diocese of  St. James the Just in Florida, was consecrated to the office of the  bishopric in 2016, served…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…silence by the  threat of a very mean Trump tweet. By its silence, this Republican  white flag surrender caucus is emboldening our adversaries to replace  the world order established by both Democratic and Republican leaders  since World War II.\n\nIf we fail Ukraine, our democratic ally, we fail the rule of law.  Let's unite to resist the appeasement…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688131/ukraine"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…saw students in those so-called hotspots, away  from their homes, because it was the only way they could access their  homework.\n\nNow, to combat that homework gap, Congress established a fund in 2021  for schools and libraries to loan Wi-Fi hotspots to students and  educators. The program was an enormous success, ensuring nearly 18  million students at…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690726/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Public Service Review.\n\nThe Review is a quarterly publication of the Stennis Center for  Public Service. The Stennis Center is a federal, bipartisan legislative  branch agency established by the United States Congress to promote  public service and strengthen the highest ideals of public service in  America. Established in 1988 in honor of the late Senator…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692884/stennis-center-for-public-service-winter-2024-public-service-review"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…Anniversary.\n\nWhereas, Alpha Phi Alpha Fraternity, Inc., founded on       December 4, 1906, at Cornell University, stands as the first       intercollegiate Greek-letter fraternity established for       African American men, committed to developing leaders,       promoting brotherhood and academic excellence, and providing       service and advocacy for communities…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697509/commending-the-mu-mu-lamda-chapter-of-alpha-phi-alpha-fraternity-inc-on-its-50th-anniversary"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…American families struggle to afford the  basics.\n\nIf we defeat the previous question, we can claw back the $75 billion  in the ICE slush fund that Trump and Republicans established with their  big, ugly law and redirect that money to where it belongs: lowering  healthcare costs.\n\nIn that same bill, Republicans cut more than $1 trillion from our  healthcare…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699592/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…join in commemorating an extraordinary  milestone in our shared story--the 175th anniversary of Fulton County.\n\nWhereas, on April 1, 1850, the State of Ohio officially       established Fulton County, carved from portions of Lucas,       Henry, and Williams Counties, as well as territory once       disputed by the State of Michigan; and\n\nWhereas, the county…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693801/proclamation-for-fulton-countys-demisemiseptcentennial"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 4233. The AUKUS Agreement  established by the Biden administration was a historic accomplishment,  and Congress has played an important and constructive role in laying  the legislative foundation for closer cooperation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694780/aukus-reform-for-military-optimization-and-review-act"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…capture  Nicolas Maduro and install the President's hand-picked successor, Delcy  Rodriguez, as the interim president.\n\nPresident Trump went to war, removed a leader, and established a  puppet government.\n\nThe President executed this transition when the most popular  opposition leader, Nobel Prize winner Maria Corina Machado, was out of  the country.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699362/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Seth Moulton", "party": "Democrat", "sentence": "…workout buddy from Arkansas.\n\nI urge support for my bill, H.R. 2215, the Salem Maritime National  Historical Park Redesignation and Boundary Study Act. Salem Maritime  was established in 1938 as the Nation's first national historic site.  It has spent the ensuing 87 years preserving and interpreting over 600  years of American history. This redesignation…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691013/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…renovating the Harvey  House Museum, establishing a Festival of Trees, and providing the long- time display of the Bugg Lights. His work has not only improved the  city but established a community where people can look forward to  raising their children, supporting their neighbors, and being proud to  call Belen home.\n\nOn behalf of the people of New Mexico's…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699893/recognizing-ronnie-torres"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…of  Health and Human Services.\n\nMr. Speaker, this means that Secretary Robert F. Kennedy, Jr., would  be in charge of administering IDEA. This is the man who disregarded  established science to advance policies based on conspiracy theories,  including claiming that Tylenol and vaccines cause autism and that  autism destroys families.\n\nThis agency should…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698934/protecting-education-for-children-with-disabilities"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…views went even  further. In 1912, he called for the repeal of the 15th amendment, which  gave African-American men the right to vote.\n\nThe fountain in Chevy Chase Circle was established in 1932 by  Congress. In 1990, the Chevy Chase Land Company added a plaque with  Newlands' name next to the fountain. A resolution to remove Newlands'  name from the fountain…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694054/francis-g-newlands-memorial-removal-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…those in need.\n\nJust 60 years after the founding of the international movement known  as the Salvation Army, the Salvation Army of Harrisonburg and  Rockingham County was established on June 27, 1925.\n\nSince its founding, the Salvation Army of Harrisonburg and Rockingham  County has partnered with the local community to efficiently and  effectively assist…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689009/recognizing-salvation-army-of-harrisonburg-and-rockingham-countys-100th-anniversary"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…officially became the Tahoe Yacht Club, the name it proudly holds  today.\n\nOver the following decades, membership grew exponentially to around  600. The organization later established the Trans-Tahoe Race, the  organization's largest sailing event, which soon became internationally  acclaimed. It attracted people from across the world. This July will…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…from the Government Accountability Office confirms what  Republicans have said for years. There is significant fraud associated  with COVID-era enhanced premium tax credits established by the trifecta  of President Joe Biden and majorities in the House and Senate led by  Democrats.\n\nAgain, in 2021, Democrats put in place what is called the enhanced  premium…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…for Peace has reached more  than 4 billion people in more than 150 countries using American-grown  commodities.\n\nAnother food aid program, the McGovern-Dole Program, was established  in 2002 through the farm bill. It originated from the partnership  between Senator Bob Dole of Kansas and Senator George McGovern of South  Dakota. Since the beginning,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691403/motion-to-discharge-s-res-195"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…exist. Congress intended orphan exclusivity  to serve as ``a marketplace-oriented solution that provide incentives  for private enterprise to develop orphan drugs.'' FDA established  regulations that aimed to protect this critical economic incentive  while also encouraging continued innovation for a rare disease by  allowing a follow-on product that…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691696/support-for-the-orphan-drug-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…which is broadly supported even among Democrat voters.  Why? Why would they do that? Even though their voters don't want that,  even though their voters want photo ID to be established when you vote,  why would they be opposed to that? Because they want people who  shouldn't be able to vote--illegal immigrants or fraudsters--to vote  for them. That is…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…temporary;\n\n(D) depict or contain images of death, physical abuse, or       injury of any person; or\n\n(E) contain information specifically authorized under       criteria established by an Executive order to be kept secret       in the interest of national defense or foreign policy and are       in fact properly classified pursuant to such Executive…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696818/epstein-files-transparency-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…a medical bill, thanks in large part to the  tireless efforts of Penn State students.\n\nThe foundation itself was born from heartbreak and hope. Charles and  Irma Millard established Four Diamonds in 1972 in honor of their son,  Christopher, who had passed away from cancer at just 11 years old.\n\nBefore his passing, Christopher wrote a story about a brave…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688351/recognizing-thon"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…Council by Congress, and Congress is the seat of authority when it  comes to the Federal enclave.\n\nHe also talked about Florida's laws. Let's be very clear: Florida has  established itself as a beacon of law and order, making sure that our  citizens are safe throughout all of our jurisdictions. If there are  some abilities for some measures of flexibility,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695561/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…and  myself, Seth was an invaluable Professional Staff Member and under his  leadership--our committee strengthened Medicaid through the Working  Families Tax Cuts, which established Medicaid work requirements and  expanded home and community-based services to new beneficiaries.\n\nAfter serving two Chairs and three Subcommittee Chairmen, Seth will  soon…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696705/recognizing-seth-gold"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Semiconductor       Supply Chains Act of 2025''.       SEC. 2. SELECTUSA DEFINED.\n\nIn this Act, the term ``SelectUSA'' means the SelectUSA       program of the Department of Commerce established by       Executive Order No. 13577 (76 Fed. Reg. 35715).       SEC. 3. FINDINGS.\n\nCongress makes the following findings:\n\n(1) Semiconductors underpin the United States and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690162/securing-semiconductor-supply-chains-act-of-2025"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Gadsden State is  currently under the leadership of President Alan Smith.\n\nOne of the initial founding institutions of Gadsden State is the  Alabama School of Trades. It was established in 1925 as the first  state-operated trade school in Alabama and the entire southern United  States.\n\nClasses began on September 16, 1925, with 42 students enrolled in the…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696575/recognizing-the-100th-anniversary-of-gadsden-state-community-college"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…any Federal agency.\n\n``(B) Scorecard.--The term `scorecard' means any summary       using a rating system to evaluate the efforts of a Federal       agency to meet goals established under subsection (g)(1)(B)       that--\n\n``(i) includes the measures described in paragraph (2); and\n\n``(ii) assigns a score to each Federal agency evaluated.''.       SEC.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687942/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…software system developers;\n\n``(E) perform such duties as the Assistant Secretary       considers appropriate relating to the program for preventing       future vulnerabilities established under section 8(a) of the       Secure and Trusted Communications Networks Act of 2019 (47       U.S.C. 1607(a));\n\n``(F) advocate for policies that promote the security…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693497/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…diplomatic       relations with Taiwan) is amended by adding at the end the       following new paragraphs:\n\n``(10) United Nations General Assembly Resolution 2758       (XXVI) established the representatives of the Government of       the People's Republic of China as the only lawful       representatives of China to the United Nations. The       resolution…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690676/taiwan-international-solidarity-act"}]