[{"senator": "Charles E. Schumer", "party": "Democrat", "sentence": "With a total estimated cost of $3 million, this study needs a mere $300,000 to begin to tackle this alarming environmental, health, and economic problem."}, {"senator": "Patrick J. Leahy", "party": "Democrat", "sentence": "The  Administrative Office of the Courts estimated costs to be about  $225,000 a year, which they can pay for out of their discretionary  budget."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "These additional USDA funds became necessary for the completion of the project after the bids received were higher than the engineer's original estimated costs."}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "It provides flexibility for large banks to charge more if  their estimated costs and losses in providing this service are higher  than $5."}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "In its broader  push against fossil fuels, the Biden administration has imposed at  least 31 appliance regulations at an estimated cost of over $60  billion."}, {"senator": "Rob Portman", "party": "Republican", "sentence": "In response to stakeholders' concerns that the target might not be  cost effective--in other words, that DOE would establish a target that  wasn't cost effective for homebuilders, as an example--or that it  wasn't transparent and that what they were doing wasn't open, our bill  also requires DOE to publish its methodology and provide a ``return on  investment'' analysis, not previously required, and the estimated cost  and savings as a result of the target."}, {"senator": "James Risch", "party": "Republican", "sentence": "The total estimated cost was $22.7 million."}, {"senator": "James E. Risch", "party": "Republican", "sentence": "The total       estimated cost is $1.50 billion."}, {"senator": "James E. Risch", "party": "Republican", "sentence": "The total estimated cost is       $1.867 billion."}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "Details of the       estimated costs of each bill are discussed in the text."}, {"senator": "James Risch", "party": "Republican", "sentence": "The total       estimated cost is $1.8 billion."}, {"senator": "Mike Bost", "party": "Republican", "sentence": "Currently, schools are required to give an estimated cost of  education to anyone who potentially will use the GI Bill."}, {"senator": "James E. Risch", "party": "Republican", "sentence": "The       estimated cost is $300 million."}, {"senator": "John Thune", "party": "Republican", "sentence": "``(F) Estimated cost; basis.--When funds are obligated for       a direct loan or loan guarantee, the estimated cost shall be       based on the current assumptions, adjusted to incorporate the       terms of the loan contract, for the fiscal year in which the       funds are obligated."}]