[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Speaker, I thank the distinguished gentleman from  the  great Commonwealth of Massachusetts (Mr."}, {"senator": "John Larson", "party": "Democrat", "sentence": "I applaud Leader Hakeem Jeffries for putting together a plan and for  presenting something to the American people that stands in stark  contrast to nothing being put forward."}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "But  here is what I also observe: The stock market is down since the  beginning of the year."}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "They are the issuers, et cetera, et cetera."}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "(12) Secretary.--Except as otherwise specifically provided,       the term ``Secretary'' means the Secretary of Homeland       Security."}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "Speaker, let me just say maybe I can teach the chairman something  about diplomacy."}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "President, on the methane CRA, today, Senate  Republicans will advance a measure undoing one of the most important  tools we have to lower energy prices and hold Big Oil and Gas  accountable."}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "I thank the sponsors for their good work on this bipartisan bill, and I  appreciate that the House is taking action to improve data privacy, in  this case with respect to the mortgage market."}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "The day will culminate in a global moment of stillness at 10 am ET,  when millions of people across time zones will join a live, guided  meditation led by global humanitarian Gurudev Sri Sri Ravi Shankar,  founder of The Art of Living Foundation."}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "Speaker, last week, I joined Representative Chuy  Garcia, Representative Jonathan Jackson, and Representative   Danny  Davis at the ICE Processing Center in Broadview to investigate ICE's  inhumane and unlawful detention of immigrant families and our  constituents."}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "This bill would  require the Department of Energy to reestablish the National Coal  Council, something that President Trump already did 3 months ago."}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "This resolution is going to cost a lot of money--about $5.8 trillion  with a ``t.''\n\nYesterday, President Trump unveiled his tariff policies and today,  the markets reacted."}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "Let's see whose side he is on."}, {"senator": "Dave Min", "party": "Democrat", "sentence": "Even though Elon  Musk is gone, there are something like a hundred or more DOGE special  governmental employees and other employees scattered around the Federal  Government that are in a position to continue the wreckage that Elon  Musk created."}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "This Act may be cited as the ``Protecting Student Athletes       from Concussions Act of 2025''."}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "1262) to amend the Federal Food, Drug, and Cosmetic  Act with respect to molecularly targeted pediatric cancer  investigations, and for other purposes, as amended."}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "2643) to require the Secretary of State to submit an  annual report to Congress regarding the ties between criminal gangs and  political and economic elites in Haiti and impose sanctions on  political and economic elites involved in such criminal activities, as  amended."}, {"senator": "Blake Moore", "party": "Republican", "sentence": "As the father of four young boys, I know firsthand that those closest  to educating my children--the teachers, administrators, and special  aides--are the ones who know what they need to get ahead academically  and succeed."}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "Well, that is a good question, and a lot of people are asking that  question, and manufacturers are having to think maybe we have got to do  something to be ready for retroactive action."}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "609), is revoked; and\n\n(2) jurisdiction over the land described in the public land       order referred to in paragraph (1) is transferred to the       Secretary."}, {"senator": "Brian Babin", "party": "Republican", "sentence": "1534) to strengthen and enhance the competitiveness of American  industry through the research and development of advanced technologies  to improve the efficiency of cement, concrete, and asphalt production,  and for other purposes."}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "(a) In General.--Not later than 120 days after the date of       the enactment of this Act, the Commission shall publish on       the internet website of the Commission a list of each       entity--\n\n(1) that holds a license issued by the Commission pursuant       to--\n\n(A) section 309(j) of the Communications Act of 1934 (47       U.S.C."}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "2293) to require the Secretary of the Interior to  reissue certain regulations relating to the taking of double-crested  cormorants at aquaculture facilities, as amended."}, {"senator": "Brian Mast", "party": "Republican", "sentence": "(B) In the second half of 2023, China exported between       $25,000,000 and $50,000,000 in additional semiconductors to       Russia every month relative to pre-invasion levels."}, {"senator": "Brian Babin", "party": "Republican", "sentence": "(a) In General.--The Secretary of Energy and the Secretary       of Agriculture (in this section referred to as the       ``Secretaries'') shall carry out cross-cutting and       collaborative research and development activities focused on       the joint advancement of Department of Energy and Department       of Agriculture mission requirements and priorities."}, {"senator": "Bob Latta", "party": "Republican", "sentence": "1455) to codify the Institute for Telecommunication Sciences and  to direct the Assistant Secretary of Commerce for Communications and  Information to establish an initiative to support the development of  emergency communication and tracking technologies, and for other  purposes."}, {"senator": "Mike Bost", "party": "Republican", "sentence": "1107) to amend title 38, United States Code, to authorize certain  heath care professionals employed by the Department of Veterans Affairs  to deliver, distribute, or dispense to veterans certain controlled  medications via telemedicine under certain conditions, and for other  purposes, as amended."}]