[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Crystal, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Crystal Lozano Gutierrez", "date": "2025-04-29"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Devonte, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Devonte Bonggas-Ellenburg", "date": "2025-05-14"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Thomas, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Thomas Dempster", "date": "2025-05-13"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Amelia, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Amelia Brown", "date": "2025-06-03"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Rachelle, develop crucial skills and  a work ethic that will guide them for the rest of their lives.", "title": "Recognizing Rachelle Martinez Marentes", "date": "2025-04-02"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Luke, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Luke Setelin", "date": "2025-04-07"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Caleb, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Caleb Gallegos", "date": "2025-05-14"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Eamon, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Eamon Vandyke", "date": "2025-06-03"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Jackson, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Jackson Minor", "date": "2025-04-10"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Alexis, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "-9999", "date": "2025-04-10"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Emma, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Emma Drumm", "date": "2025-04-07"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Isabella, develop crucial skills and  a work ethic that will guide them for the rest of their lives.", "title": "Recognizing Isabella Ekman", "date": "2025-04-10"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Aden, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Aden Cordova Rubio", "date": "2025-04-29"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Reagan, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Reagan Chessmore", "date": "2025-04-07"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Alicia, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Alicia Montoya", "date": "2025-04-02"}]