[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…part of traditional media.\n\nThird, the Freedom to Vote Act would strengthen rules banning the  coordination between candidates and super PACs to make sure candidates  cannot evade contribution limits by working with their super PACs.\n\nFinally, the Freedom to Vote Act includes important reforms to the  Federal Election Commission to improve the enforcement…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699114/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…the majority has just  opened with this overruling of the Parliamentarian, this establishment  of a new rule.\n\nNow, the other problem with this is that it provides a way to evade  court review. Court review is usually how you check the action of the  executive branch when they are up to no good. But very often, they are  doing perfectly reasonable things,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…that the House is now considering. OMB's  defiance of the norms around review of special messages and the law  mandating disclosure of apportionments appears to be designed to evade  review of the rescission proposals by the Congress, Congress's  watchdog, and the public alike.\n\nUnlike in the past, OMB has refused to make the apportionments for  the accounts…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694158/senate-amendment-to-hr-4"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…happened.\n\nThis bill strengthens our national security by giving regulators the  tools they need to track cross-border transactions and stop digital  assets from being used to evade sanctions or fund our adversaries.\n\nThe bill is not perfect, and it does not resolve every issue. Like  many of my colleagues, I am deeply concerned about the Trump family's…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…of dollars on a shield that cannot protect us all the while  that we are building more and more bombs so that our adversary will  build more and more bombs and find a way to evade the shield.\n\nThey will. We cannot engineer a technological fix for a political  problem. Decades ago we realized the only true shield against nuclear  annihilation is not a…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699035/expiration-of-new-start"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…District to       the sole benefit of those few Metropolitan Police Department       (MPD) officers who engage in egregious, sometimes criminal       misconduct and seek to evade accountability.\n\nA 2022 report by the District of Columbia Auditor       documented the shortcomings of the prior disciplinary       process. It chronicled the cumbersome,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692302/protecting-our-nations-capital-emergency-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…reserve  the balance of my time.\n\nMr. Speaker, cybercriminal syndicates, supported by North Korea and  rogue states like Russia, are already exploiting financial technologies  to evade sanctions, fund war and terrorism, and destabilize  democracies. Ignoring these threats is not an option.\n\nThis working group is an initial robust approach to gain an  understanding…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693962/financial-technology-protection-act-of-2025"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…out every single partisan poison pill  rider that the Republicans tried to jam into the process, including the  pesticide liability shield that would have let chemical giants evade  accountability.\n\nThis bill is significantly better than a continuing resolution. It is  not all that we would want or all that we should be delivering, but its  investments…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698754/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…fees and other burdens imposed by a       British parliament an ocean away. That parliament, meanwhile,       grew frustrated by what leaders saw as Americans' efforts to       evade the responsibilities of being part of the British       Empire.\n\n``The British were trying to raise money by capturing       vessels that were sneaking stuff in and not paying…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…Speaker. You can ignore anyone who says that  this is a tool for legitimate finance. That is because the tool is  overwhelmingly used for crime.\n\nThe Russians use crypto to evade sanctions and fund their war in  Ukraine. The North Koreans use it to fund their nuclear program. Hamas  used it to fund their October 7 attack. Fentanyl traffickers use it…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693618/crypto-used-by-criminals-and-corrupt-politicians"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…security.\n\nJust last week, the former chairman of the Commodity Futures Trading  Commission warned that this bill would allow traditional companies,  like Apple or Google, to evade securities laws. They could walk away  from the disclosure, antifraud, liability, and corporate governance  protections that investors have relied on for 90 years. The bill…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693777/digital-asset-market-clarity-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…treatments for their       well-being, will most likely be forced to forego care. That       is, if they survive the tragic violence engulfing the       country.\n\nFor those who evade deportation and are forced to live       undocumented in the US, the stress of living with fear of       detention and deportation is known to increase risks for       anxiety,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…required  more?\n\nThe properly named Child Predators Accountability Act makes an  important and very necessary clarification for a circuit split that  could allow predators to evade justice. By making it uniformly illegal  to depict a minor in sexually explicit material, regardless of whether  that child appears to be actively participating, this change…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698896/child-predators-accountability-act"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…harm's way.\n\nThen, there is our Director of National Intelligence, who is  supposedly our Nation's most trusted, meticulous secretkeeper, who went  before the Senate to mislead, evade, and perjure herself. What a truly  disgraceful episode.\n\nThis is not a partisan issue. In fact, both the chair and ranking  member of the Senate Armed Services Committee,…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689418/reckless-incompetence-of-signal-chat-put-servicemembers-at-risk"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…he went out of his  way to kill several enforcement actions that were underway by different  Federal agencies against his businesses, allowing his companies and  himself to evade oversight. He was able to help place key personnel in  agencies that now are looking to benefit his companies financially.\n\nMr. Speaker, going back to the data privacy point,…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…using the best American technology remotely to do that.  Nor do we want them to train AI models to enable weapons of mass  destruction, automated cyber attacks, or systems that evade human  oversight. Another final example would be accessing tools designed for  offensive cyber operations.\n\nUnder this bill, if a Chinese firm would like to rent access to…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698858/remote-access-security-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…secretary of state.\n\nMr. STEIL.  Boebert).\n\nMr. Speaker, I am hearing from the other side that it is already  illegal for noncitizens to vote. That is true. It is also illegal to  evade Border Patrol and cross the border illegally into the United  States of America, but enforcement matters.\n\nWe can look at what happens when you don't enforce the law under…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…or any other laws, who authorized the use of the trackers, what  controls exist to protect privacy in California's Affordable Care Act  exchange? How did Covered California evade those controls? How many  people have been impacted? Have they been notified? Has there been any  restitution? Why did Covered California use the trackers contrary to  Linkedin's…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…9-year-old niece. The court ruled that he did not use her under  existing statute because she was passive. That interpretation is  utterly unacceptable.\n\nPredators should not evade justice simply because the child whom they  exploit is unaware. The harm is real. The intent is clear. This  loophole weakens 18 United States Code, section 2251(a), and related…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698897/child-predators-accountability-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…traffic their  illicit fentanyl into our country is by changing one part of fentanyl's  chemical structure to create fentanyl analogues. The cartels did this  in an attempt to evade our criminal laws.\n\nRight now, fentanyl analogues are considered schedule I substances,  but only because of a series of temporary scheduling orders, and that  order is now…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…U.S. casualty.\n\nThis is what peace through strength looks like. This was a lawful  action. This was an act of justice against an indicted narcotrafficker  who believed he could evade accountability while ordinary people paid  the price. President Trump proved him wrong.\n\nThis operation also demonstrated what strong leadership looks like.  Our military,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698881/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…Raider represents the most capable and lethal bomber this  world and this planet has ever known and seen. It is the future of our  long-range strike capability, designed to evade modern air defenses and  deliver both nuclear and conventional payloads across the globe.\n\nDyess, the base in Abilene, Texas, will soon become a key platform  for deploying…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692947/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…potential uses of digital assets and other related       emerging technologies by States, non-State actors, foreign       terrorist organizations, and other terrorist groups to evade       sanctions, finance terrorism, or launder monetary       instruments, and threaten the national security of the United       States; and\n\n(B) a strategy for the United…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693963/financial-technology-protection-act-of-2025"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…and women of the Armed Forces, what they are doing is  they have struck 35 drug boats smuggling drugs that kill Americans.  They have seized seven oil tankers attempting to evade sanctions.\n\nIt is very simple. Let's not protect those drug dealers, those  cartels. Let's protect the American people. The way to do that is to  vote ``no'' on this resolution.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699368/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}]