[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…policing.\n\nNational Police Week offers an opportunity to honor law enforcement  and pay tribute to those who gave their lives serving their  communities. This week, we honor Officer Evan Dunn, who was a member of  the Golden Police Department, who tragically passed away in the line of  duty in November 2024. Officer Dunn joined the Department after serving…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692010/recognizing-the-golden-police-department"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…enhanced premium tax credits on the  Affordable Care Act. Amanda, who has lupus, needs weekly shots to  manage the autoimmune disease.\n\nOr take Madison chef and restaurant owner Evan Dannells who has about  a dozen employees who all get their care from the Affordable Care Act.\n\nHe said that if that weren't an affordable option, his employees  would be looking…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695650/healthcare"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…this crisis with the urgency  of now to end the senseless acts of violence that take thousands of  innocent lives every year. That time for reform is now.\n\nMs. McCLELLAN. De'Evan McFall, he dreamed of being an NFL player  until gun violence took his life at 11.\n\nZahmire Lopez, he had dance moves and rap skills until gun violence  took his life at 8.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…die, too, because when malaria, tuberculosis,  and AIDS infect anyone in the world, those diseases replicate. They  mutate, and they migrate back here in more virulent forms.\n\nEvan Anzoo, a 5-year-old boy, was cut off from his HIV medications in  February and died. He is the first to die at the hands of Elon Musk and  Donald Trump.\n\nLet us remember Evan…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692536/rescissions-act-of-2025"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "Ms. McBRIDE. Mr. Speaker, I rise today to recognize the Trivits  family from Hockessin, Delaware.\n\nRecently, Evan Trivits wrote to me about his wife, Angela, who, last  September, was diagnosed with ALS. The slow and progressive impact of  ALS, paired with our devastating lack of clarity…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695077/recognizing-trivits-family"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Varias, Stelios: Reuters       News Pictures.\n\nVogel, Leigh: Freelance; Voisard, Amanda: Freelance;       Voisin, Sarah: Washington Post; Voss, Stephen: Freelance;       Vucci, Evan: Associated Press Photos; Watkins, Frederick:       Freelance; Watson, James: Agence France-Presse; Wells,       Jonathan: Sipa Press, Inc.; Whitehouse, Raymond: Freelance;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698154/members-entitled-to-admission-to-the-119th-congress-press-photographers-gallery"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Lucy Ariunbayar, Sawyer Ashland,       Kallesh Ashoka, Tristan Barre, Kieran Beckham, Hrishi       Bharath, Haley Blackman, Constantine James Blastos, Michael       Blastos, Evan Bohne, Alexander Bowen, Aneel Brar, Joshua       Brookens, Jackson Bunnin, Asher Bunnin, Alexander Byun,       Wilson Callaway, Kelly Campbell, Gabrielle Campbell, Francine…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692400/congratulating-the-2025-congressional-award-gold-medalists"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Ryan: GRAY TELEVISION; CAROLAN,       Victoria: NBC NEWS; Carou Peon, Maria: RADIO ESPANA       (RTVE); Carpeaux, Emily: PBS NEWSHOUR; Carpenter, Perita:       ABC NEWS.\n\nCarr, Evan: WRC-TV/NBC-4; Carr, Julie: CNN; Carr, Martin:       WETA; Carrick, IV., Kenneth: SPECTRUM NEWS; Carroll, Ernest:       CNN; Carruth, Sydney: NBC NEWS; Carter, David: WRC-TV/NBC-4;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Title. The team overcame the challenges posed  by intense competition in their effort to surpass all other relay teams  in their event.\n\nIn pursuing the State Championship, Evan Schiefer, Bradley Smith,  Ayden Perkins, and Owen Gahring defeated their outstanding competitors  to win with an impressive time of 7:57.32, a new school record. The  members…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693381/special-recognition-of-seneca-east-high-schools-boys-4-x-800-meter-relay-team-for-winning-the-division-iii-state-track-and-field-title"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "Mr. JACKSON of Texas. Mr. Speaker, I rise today to recognize and  express my sincere gratitude to my Defense Fellow, Major Evan Hanson of  the United States Air Force, for his outstanding work in my office and  service to the people of Texas' 13th Congressional District during  2025. Since being assigned…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697563/recognizing-and-expressing-gratitude-to-defense-fellow-major-evan-hanson"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…leadership of their  coaches, and the drive of a team that refused to let up.\n\nI also want to give a special shout-out to three players from the  Millcreek area--Luke Owen, Jack Evan, and Malakai Philip--whose efforts  on the court made a lasting impact.\n\nTheir hard work, and the hard work of the entire team, has brought  pride to their school and to our…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690115/recognizing-the-olympus-high-school-titans"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…News Group;       Novicoff, Marc: Atlantic Monthly; Nwanevu, Ositadinma: New       Republic; Obey, Douglas: Inside Washington Publishers.\n\nO'Brien, Connor: Politico; Ochsner, Evan: Bloomberg       Industry Group; Ogozalek, Samuel: Politico; Ollstein, Alice:       Politico; Olvera, Kaitlyn: Politico; O'Mahony, Olivier: Paris       Match; O'Neal, Adam:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698171/members-entitled-to-admission-to-the-119th-congress-periodical-press-gallery"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…as my fault, not the staff who helped me  assemble that list and the following.\n\nI just wanted to also thank a number of the clerks of the  subcommittees with whom I worked: Evan Schatz, of course, who is  Senator Murray's chief clerk; John Righter; Jo Eckert; Jen Becker; Alex  Carnes, whom I am particularly thankful to for his Johnny-on-the-spot  assistance…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699444/appropriations"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Ruger, Todd: CQ Roll Call;       Rummler, Orion: The 19th.\n\nRusinova, Zoia: Itar-Tass News Agency; Ruthven, Sara:       National (The); Ryan, Timothy: Thomson Reuters; Ryser, Evan:       Market News International; Sabin, Sam: Axios; Sacchetti,       Maria: Washington Post; Sagalow, Zoe: S & P Global; Saheb       Ettaba, Selim: Agence France-Presse; Sakaguchi,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}]