[{"senator": "Haley Stevens", "party": "Democrat", "sentence": "Ms. STEVENS. Mr. Speaker, I rise this evening to say that tariffs on  Canada are going to blow a hole in the United States automotive  industry.\n\nI ask the President to not put 25 percent tariffs on Canadian goods.  Our…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688398/president-trump-tariffs"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…help for families  that will go hungry so that billionaires like Elon Musk get another tax  break they simply don't need.\n\nBut that is not what I am here to talk about this evening. I am here  at this hour, or this morning, because right here, right now, in the  dead of night, Republicans in the Senate are hard at work on another  objective, an unprecedented…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I rise to place remarks on the Record this  evening focusing on liberty versus dictatorship.\n\nWe have several Members who wish to submit comments for the Record.  Congressman   Mike Quigley is here this evening. Congressman…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Mr. President, I, first of all, thank my colleague from  the State of Rhode Island and echo his sentiment and his message that  Senate Republicans have crossed the line this evening. They have chosen  to overrule the Parliamentarian, thrown out some rules, rewritten some  rules, established new precedents for how this body operates, despite  claiming…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…sorters? These are hardworking people who go above and  beyond.\n\nThis weekend, I heard about a Louisville letter carrier who wears a  headlamp because she works well into the evening. She deserves support,  not demonization.\n\nLet's fix this. Let's get our letter carriers the resources they  need. Let's get our sorters the machinery they need. Let's ensure…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688285/protecting-postal-workers"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…discrimination against women and to stop employers from penalizing  women with less experience.\n\nWhen it was time for retirement, Alice saw it as an opportunity to do  her evening tasks full-time. At age 69, she traveled to the Mosquito  Coast of Honduras on a human rights observation mission. She took her  mission on headfirst and investigated bullet…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698825/recognizing-the-life-and-memory-of-alice-kitchen"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, finally, on the nomination of Bedford to  the FAA, later this evening, Senate Republicans will vote to advance  Donald Trump's nominee to lead the FAA, Bryan Bedford.\n\nTo say that Mr. Bedford is a deeply flawed nominee would be putting  it mildly.…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693275/nomination-of-bryan-bedford"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…thank Congresswoman Beatty for joining me in this  Special Order hour. I yield to her now to continue this discussion.\n\nMr. CLYBURN.  Clarke).\n\nMs. CLARKE of New York. Good evening, I am Congresswoman Yvette D.  Clarke, chair of the Congressional Black Caucus, proudly representing  New York's Ninth Congressional District located in Brooklyn, New York.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…from Alabama (Mr.  Figures) and also Congresswoman Bynum from the State of Oregon and the  chair of the Black Caucus, Yvette Clarke of New York, for inviting me  to speak this evening.\n\nMr. Speaker, as we celebrate Black History Month, I rise to honor an  extraordinary American hero that I had the great pleasure to know from  my home community in Ohio,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Vermont.\n\nSeveral weeks ago, several Senators joined me in meeting with the  Ambassador from Israel. It was an effort to discuss many of the things  which we are discussing this evening.\n\nWe asked him why Israel was not providing humanitarian aid in Gaza.  He said: That is not true. We were providing it, but Hamas was stealing  it from us and using it to…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694435/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…for the extension of these critical tax  credits and for the health, well-being, and humanity of every person  who we represent.\n\nMr. Speaker, I hope that these stories this evening drive it home.\n\nMs. McCLELLAN. Mr. Speaker, may I inquire as to how much time is  remaining.\n\nMs. McCLELLAN. Mr. Speaker, Speaker Johnson has called the Affordable  Care Act…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…stability, and lead with  strength, diplomacy, and integrity.\n\nMs. HOULAHAN. Mr. Speaker, I very much thank all of my colleagues for  joining us and meeting here tonight.\n\nThis evening, we heard about the damage that President Trump's  actions have done to our Nation's security. If our Nation turns its  back on Ukraine, we heard about what comes next: Our…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "Mr. BISHOP. Mr. Speaker, the House will vote on the Senate revised  budget resolution this evening.\n\nThe budget resolution requires seven House committees to cut a  minimum of $1.5 trillion in mandatory spending combined over the next  decade. Of that amount, at least $880…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689905/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…legislation and are subject, as a  result, to the legislative filibuster. But if we see what we expect to  see happen today, the status of these same bills--maybe later this  evening--will be very, very different. If Senate Republicans behave the  way that we expect them to, all of a sudden these same measures that  are subject to the legislative filibuster…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691542/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…people who line their pockets off of the sweat of  the hardworking men and women who actually do the work in this country.\n\nUnfortunately, as I look around this floor this evening, I don't see  a single one of them standing in solidarity.\n\nUnder this administration, we have seen an unprecedented attack on  our unions and worker protections. Protections…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695576/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…After a slow start to the season, including a 0-9 start in Big Ten  play, the Nittany Lions persevered to be one of four Big Ten teams in  the tournament. With their win Sunday evening, they are the last Big  Ten team standing.\n\nI congratulate Guy Gadowsky, head coach of the Nittany Lions men's  hockey team, as well as all of the talented athletes who have…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689357/securing-our-elections"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…in the legislative process, which is their  right.\n\nThe same principle applies to the Rules Committee. On this committee  we have a long tradition of meeting late into the evening to complete  our work. This isn't new, and it is not unique to our current majority.  It is simply how the legislative process operates when the House has  its full agenda.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…President Trump's Cabinet.\n\nSenate Republicans have now confirmed 20--20--members of President  Trump's Cabinet. We confirmed President Trump's Education Secretary  just last evening. So compared to previous Presidents, this is a  remarkable pace. More confirmations than President Obama had at this  point in 2009; more confirmations than President Biden…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688471/joint-session-of-congress"}, {"senator": "Russ Fulcher", "party": "Republican", "sentence": "Mr. FULCHER. Mr. Speaker, I am honored to join my colleagues this  evening to honor a dear friend, Congressman Doug LaMalfa. Being from  the great State of Idaho, the land of famous potatoes, I am the one the  good Congressman referred to as ``Mr.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698717/9999"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "Mr. MORAN. Mr. President, this is a solemn occasion for me and for  many people I know, and I rise this evening to recognize and honor the  67 lives we lost, 1 year ago tomorrow, on January 29, 2025.\n\nOn that night, Flight 5342 took off from Wichita, KS, and flew toward  our Nation's…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699417/9999"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "Mr. STUTZMAN. Mr. Speaker, I thank my colleague, Congressman  Haridopolos, for organizing this evening's event.\n\nI am proud to say that this body just passed the Housing for the 21st  Century Act in a strong bipartisan manner. Owning a home is the  American Dream. It is one…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699812/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…our great Republic.\n\nBenjamin Franklin lived his life with a deliberate sense of purpose,  beginning each day by asking: What good shall I do on this day? And  ending every evening in reflection: What good have I done today?\n\nMadam Speaker, that is not just a measure of a life well lived. It is  the measure of leadership, of duty, and of a nation that…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688220/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…work plan and has implemented  worthwhile projects that show impact and results in their community.\n\nCoudersport will be officially recognized during a ceremony on  Wednesday evening at the Wilds Sonshine Factory in Kane. The PA Route 6  Alliance will also present awards in the categories of Heritage  Partnership, Heritage Tourism, Heritage Leadership,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695113/coudersport-2025-heritage-community-of-the-year"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Mr. MOORE of Utah. Mr. Speaker, I appreciate the opportunity to  address the floor this evening and to give that opportunity to some of  my colleagues also, if their schedule permits.\n\nWe don't get enough opportunities to speak to the American people,  and I don't get…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…justified the  $800 billion tax break for multibillion dollar, multinational green  energy corporations.\n\nMr. MOORE of North Carolina. Mr. Speaker, this is an opportunity this  evening to vote for a budget resolution that extends tax relief for  working families.\n\nIf Members want to support working families in America, vote for  this. It makes the Trump…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Mr. MOORE of Utah. Mr. Speaker, I am so glad to be joined by my  colleagues this evening to talk about the historic tax relief we are  providing for working families this tax season. I think it should be on  the mind of every single American, and we are thrilled…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699706/historic-tax-relief-for-families"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…on this really important Police  Week.\n\nMr. SCOTT FRANKLIN of Florida. Mr. Speaker, I thank my well-rested  friend and colleague from Utah for the time.\n\nMr. Speaker, this evening as we recognize National Police Week, I  rise to honor the brave men and women in uniform who serve with  courage, integrity, and selflessness.\n\nEvery day, law enforcement…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…deeply about and is doing quite a lot of good work  on at the State level. I applaud her for that.\n\nMadam Speaker, I thank you and all my colleagues for your comments  this evening. It is very much appreciated.\n\nAs we move into the next couple of weeks when we get to celebrate the  holidays, it is excellent to look back and think about the amazing work…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…directed toward the people of Louisville.\n\nFolks around our county, Jefferson County, need those prayers right  now and in the days and weeks to come. The death toll from last  evening's UPS crash has continued to rise throughout the day. For the  families of these victims and for the injured survivors being treated  at area hospitals, life will never be…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696544/9999"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…H.J. Res. 105, which mirrors our bill, introduced by  Congresswoman Fedorchak, has already passed the House of  Representatives, and final passage is scheduled for later this evening.\n\nThe Bureau of Land Management--or BLM, as we call it--is the landlord  of 745 million acres of land and subsurface deposits nationwide. BLM's  management of these public…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696136/national-defense-authorization-act-for-fiscal-year-2026"}]