[{"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…``Who is going to run the government? You know, provide services that  keep the planes in the sky, the power flowing, the food safe, and warn  of pending major life-threatening events, events like hurricanes and  infectious diseases? Who will want to work for the American people  after this latest attack? Stop abusing us.''\n\nMr. Speaker, I challenge you…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691729/federal-employees"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…her community  and a longtime member of the Co-op City Methodist Church. Although she  is retired, that has not slowed her down, she watches the news, keeps  up with current events, calls family and friends each day, and  sometimes doesn't go to sleep until midnight, almost reverting back to  her teenage self. She loves her shows and loves her family…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698097/recognizing-lois-washingtons-100th-birthday"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…health of our Great Lakes informing policy in my beloved home State  of Michigan and across the basin. These images also provide visibility  and insight into life-threatening events, such as the before and after  observations of the devastating Palisades and Eaton wildfires in  southern California.\n\nIn 1992, Congress, led by the Science, Space, and Technology…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688973/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…technologies. These technologies would then be used to locate  people trapped in areas where wireless connectivity may not be  available due to natural disasters and other devastating events.\n\nI commend Representatives Pettersen and Carter for their bipartisan  work on this bill. It will ensure that one of our Nation's key  telecommunications facilities has the…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693437/institute-for-telecommunication-sciences-codification-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Big, Bad Bill reverses the progress we've made addressing  climate change, resulting in thousands of lost jobs in renewable  energy, dirtier air and water, more extreme heat events, and poorer  health outcomes. At a time when energy demand is surging and clean  technologies are finally delivering lower costs and good-paying jobs,  this bill slams the…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…department and the communities it serves.\n\nBeyond responding to fire and emergency medical calls across south  Minneapolis, the crew makes a diligent effort to attend community  events and ensure young kids see their identities represented in public  service.\n\nI am incredibly grateful for the work they do to keep our city safe  and inspire future generations…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698104/minneapolis-first-all-native-fire-crew"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…escalatory deployment of the National Guard and  active-duty Marines by President Trump to Los Angeles.\n\nWhen the House of Representatives passes a resolution regarding  current events, it should do its due diligence to cite the facts.  Unfortunately, it is clear the Republican majority had no interest in  accurately portraying the protests in Los Angeles…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693150/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…31, 2025, the House Judiciary Committee released the  transcript of its December 17 private 8-hour interview with Special  Counsel Jack Smith, whose investigation into the events of that day led  him to describe January 6 as an event that ``does not happen'' without  President Trump.\n\nSmith testified that Donald Trump is the `` `most culpable and most…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…access healthcare benefits, and reaching out on a routine  basis to encourage them in their daily life. Pat has represented the  MOAA on numerous occasions and spearheaded events to honor surviving  spouses. In one case, Pat established a memorial fund that donated to  family charities identified by each surviving spouse in memory of their  loved one.…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691686/recognizing-patricia-ann-miller-for-her-service-as-surviving-spouse-liaison"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…community. After overcoming many challenges in life, she decided to  channel all of her energy to giving back.\n\nWhile employed at the Siemon Company, she spearheaded many annual  events and programs for employees, including the Haunted Cafe for the  children of employees, a Thanksgiving feast, and a Christmas  extravaganza.\n\nJoyce created Big, Bold and Beautiful…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698559/recognizing-joyce-reid-coleman"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…direct opposition to the values and the professionalism of  many Federal law enforcement officers who follow the law and serve with  integrity every day.\n\nSince these tragic events, people from every corner of America have  made their voices heard. My office has heard from thousands of  Michiganders about their outrage at the fatal shootings of both Renee…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699402/9999"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Co-op City, from the NAACP branch to The American Legion post and every  other group in between.\n\nThe Co-op City Times provides weekly news, free of charge, that  covers the events and information of the individual building  organizations, local arts and performances, and the churches and houses  of worship and all of their events, and they spotlight…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698631/recognizing-co-op-city-times"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…director of education and  programming, the Ocasios have nurtured the museum to become a locally,  nationally, and internationally celebrated institution.\n\nThrough exhibits, events, oral history sharing, and more, the  National Museum of Puerto Rican Arts and Culture does important work to  preserve and uplift the rich culture of Puerto Rican traditions…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Use of Force       Review Board, required robust de-escalation training, and       mandated public release of body-worn camera footage after       shootings and other serious events. Jurisdictions that       release such footage consistently see improved community       trust and enhanced transparency. Body cameras provide an       impartial record, encourage…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…relations.\n\nThrough DACOR and the DACOR Bacon House Foundation, which host  regular educational discussions, policy programs, leadership  development opportunities, and musical events, the House continues to  be a vibrant center of cultural and diplomatic exchange, a museum of  American life, and the home of the foreign affairs community.\n\nTwo hundred years…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692065/recognizing-the-dacor-bacon-house-bicentennial-day"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…nationwide commemoration.  Its new exhibit, ``America 250: A More Perfect Union,'' invites  visitors to walk through the defining chapters of our shared history,  not as distant events, but as living lessons about who we are and who  we aspire to be.\n\nThe Nixon Library has long been a cultural and educational  cornerstone in California's 40th Congressional…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697697/recognizing-richard-nixon-presidential-library-and-museum"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "Mrs. FISCHBACH. Mr. Speaker, I thank Mr. Comer for yielding me the  time.\n\nMr. Speaker, I rise in support of H. Res. 519.\n\nThe events of June 14 were truly horrifying. Those events shocked  Minnesota, and they shocked the country.\n\nWe mourn the loss of Minnesota Speaker Melissa Hortman and her  husband, Mark.…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692863/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…American Electric Reliability Corporation, which is the  Nation's electric reliability organization, shows vast regions of our  Nation are at risk for blackouts when weather events and peak demand  collide. It is only going to get worse.\n\nThe Energy and Commerce Committee has repeatedly heard from grid  authorities about the massive number of premature…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698274/reliable-power-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…various civic  organizations that make Brooksville a better place to live. He is an  active member of multiple local groups, always stepping up to help  organize community events, support charitable initiatives, and lend a  hand wherever needed. His volunteerism  has been instrumental in projects that promote economic growth,  cultural enrichment and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690159/recognizing-casey-thieryung"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…distribution, supporting Downtown Lincoln and our local agricultural  industry, advancing education initiatives and extracurricular  activities for students, organizing tree-planting events, and awarding  scholarships, among many other efforts.\n\nI am grateful for their significant contributions in our community  and am confident that the legacy of service they…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696716/recognizing-the-100th-anniversary-of-the-rotary-club-of-lincoln"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…opening its doors in 1925, the Hanford Civic Auditorium has  served as the cornerstone of community life--a vibrant hub for artistic  performances, civic engagement, and social events. From city council  meetings and public forums to receptions, family reunions, and  community celebrations, it has hosted countless gatherings that reflect  the heart and spirit…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698408/recognizing-the-hanford-civic-auditorium"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Manor Middle School and is a  Corporal with the Young Marines of Lancaster County. As a member of the  organization's color guard, he has spoken and posted the colors for  events such as graduations, sporting events, and a Cold War Veteran  Recognition Ceremony that I held in November 2025. He has also led  community service efforts, such as donation…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699827/recognizing-young-marine-corporal-chase-muchmore-on-being-named-the-pennsylvania-regiment-junior-young-marine-of-the-year"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Generation for five years as a Board member. He tirelessly champions  the cause of A New Generation in the community and within his  professional circles. From volunteering at events, helping to oversee  the bookkeeping and finances to fundraising, Frank does not stop.  Frank's commitment to promoting the many services offered by the  pregnancy center and…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690690/recognizing-frank-cassara"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…feet, 3  inches nabbed the gold medal.\n\nSophia Rivera's two state titles crown a spectacular season and a  complete sweep in the postseason, as Rivera won gold medals in both  events during the Lancaster-Lebanon League championship and the  District Three championship weeks prior.\n\nWith two state titles and a total of 6 gold medals during the track  and…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691701/congratulating-sophia-rivera-girls-shot-put-and-discus-state-champion"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…forbidden.\n\nThe CCP is not interested in genuine cultural exchange or open  dialogue. Its goal is indoctrination, teaching students that China is  benevolent, while erasing events like the Tiananmen Square massacre and  ignoring the ongoing Uyghur genocide and other human rights abuses. By  accepting CCP funding, schools shield students from the truth…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697532/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…specializing in luxury  properties.\n\nA devoted church leader, Joe served as an elder and deacon,  supporting organizations like Manna House of Brunswick and contributing  to community events. He was known for his generosity, kindness, and  willingness to help others, always offering a listening ear and  thoughtful advice.\n\nJoe found joy in family, good friends,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. Mr. President, today I recognize Veblen, SD. The town of  Veblen will be celebrating its quasquicentennial July 18-20, 2025.  Veblen will host quasquicentennial events, which include a parade,  vendor show, street dance, class reunions, fireworks, and much more.\n\nVeblen is located in Marshall County, nestled in the beautiful  rolling hills…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692899/recognizing-the-125th-anniversary-veblen-south-dakota"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…to ensure that the Community       Reclaimer meets the definition under paragraph (3);\n\n``(K) a contingency plan designed to be used in response to       unplanned adverse events that includes emergency actions,       response, and notifications;\n\n``(L) detailed plans for any proposed recycling or       reprocessing of historic mine residue to be conducted…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691092/community-reclamation-partnerships-act-of-2025"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…testament to his deep compassion  and unwavering dedication.\n\nUnder his guidance, Troop 66 has thrived. Ric has led countless  campouts, service projects, and leadership training events, always with  a focus on building resilience, teamwork, and respect.\n\nHis mentorship has helped many Scouts earn the rank of Eagle Scout  and, more importantly, has instilled…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696825/recognizing-colonel-ric-trimillos"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…growth.\n\nToday, with a population exceeding 2,000, Howey-in-the-Hills is a  thriving, family-oriented resort town. The beautifully restored Howey  Mansion hosts custom-designed events, while the town's 1920s mission- style architecture and the Community Church, built in 1949, add  cultural depth to this charming municipality.\n\nWhether it is a leisurely stroll…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694139/recognizing-the-100th-anniversary-of-the-town-of-howey-in-the-hills-florida"}]