[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…found ways to mend ourselves. We have  lost our way before and found somehow the courage to chart a new  course. We have forgotten our highest ideals before and yet always  eventually remembered who we are.\n\nWe cannot think of ``a more perfect Union'' as a destination. ``A  more perfect Union'' is a direction. It is the  choice we make generation after…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…the coast  of Santa Barbara. Californians rose up and demanded stronger  environmental protections, and this became the birth of the modern-day  environmental movement and eventually the first Earth Day in 1970,  which has grown in its recognition and celebration.\n\nThat same year, Congress passed the Clean Air Act on an overwhelming  bipartisan basis.…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…monarch Lydia Liliu Loloku Walania Wewehi  Kamakaeha--Liliuokalani--was born in Honolulu on September 2, 1838.  Liliuokalani was an avid scholar and a talented musician, eventually  composing more than 150 songs throughout her lifetime including the  beloved ``Aloha Oe.'' When her brother, King David Kalakaua, was  appointed to the throne in 1874, Liliu--then…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695588/hawaiian-history-month"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…parents. The man victimized a 12-year-old, her friend, and her 5- year-old sister through Snapchat.\n\nInvestigators obtained an IP address linked to the Snapchat account,  which eventually led them to the perpetrator's house, where they  recovered a laptop, two hard drives, and four iPhones containing  evidence of the coercive treatment of more than 100 different…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698862/combating-online-predators-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Illinoisans, and he developed a  habit of storing them in his now-famous stovepipe hat. As he traversed  the prairies of Sangamon County, he learned about the State that would  eventually be known as the Land of Lincoln. Although postmaster was  just one of the many jobs Lincoln had during his days in New Salem, it  was his first taste of civil service and…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697376/250th-anniversary-of-the-united-states-postal-service"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Educational Excellence Foundation, which  was a special honor for her as this award was named after her close  friend and former Muscogee County School Superintendent.\n\nJudy eventually moved to California to continue her educational  career, but Columbus was never far from her heart. She returned to her  beloved Columbus in 2006 and became actively involved…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690837/in-memory-of-the-honorable-judy-thomas"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…he not consult the Justice Department, but the       pardon was clearly political--it was popular with his base.       The move reinforced fears that the President would eventually       pardon himself and his inner circle--something that was       reportedly explored by his lawyers. Such a move would       constitute an unprecedented attack on judicial…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…and on May 15, he  arrived at the Guam Orote Point Refugee Camp where he volunteered as a  physician at the Army hospital. A month later, he served at Camp  Pendleton and eventually settled in Gardena, California.\n\nIn 1976, he passed the Educational Commission for Foreign Medical  Graduates. Before his eager return to the medical field, he worked a…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691324/recognizing-dr-huu-vo"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…could make,  which is solar and then wind, because, really, what they are doing is  just hugging Big Oil because Big Oil hates clean energy because they  know clean energy eventually means the great reduction of polluting oil  and gas and what they put into our atmosphere.\n\nSenators Kaine, Heinrich, and all Democrats will continue to shine a  spotlight…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688168/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…four-year- olds--and later, with her husband Dan, advising the youth group for  five years. Her sustained commitment and deep sense of purpose led her  to the board in 2010 and eventually to her current leadership role.\n\nA veteran teacher in the Rochester City School District, Monica has  also volunteered extensively throughout the Jewish community, including…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691572/recognizing-monica-gurell"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…last year, the Flat fire burned over  23,000 acres of land in central Oregon, destroying homes and forcing  thousands of people to evacuate.\n\nOur historic fire crews were eventually able to contain the fire, but  they were unnecessarily delayed because someone was flying a drone in  the area, and it punctured a hole in the plane.\n\nOur historic fire crews…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698693/delayed-wildfire-response-efforts"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…sheet or the aptly named ``doomsday  glaciers'' in West Antarctica. Suddenly, the expected sea level rise by  the end of the century doubles or more, and we know that we are  eventually in for between 12 and 36 feet of sea level rise. Market  expectations around the valuations of trillions of dollars of real  estate will suddenly change, provoking massive…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…shortfall. This is  done primarily through issuing government bonds. Additionally, we  borrow from intragovernmental sources such as the Social Security Trust  Fund, which must eventually be repaid in order to fund Social Security  benefits.\n\nWe also pay interest on the money we borrow. The total amount  borrowed, largely to cover accumulated net deficits…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689288/introduction-of-the-sustainable-budget-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…is untold.\n\nSo Dr. King led the boycott. Rosa Parks started the initiative, but  it was Claudette Colvin who took the lawsuit to the Supreme Court, the  lawsuit filed that eventually caused a judge, Frank M. Johnson, Jr., to  rule that that line had to be desegregated.\n\nClaudette Colvin has been denied her place in history. Very little is  said about…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…to the people  of Northwest Washington.\n\nSince 1977, Linda McCarthy has been an advocate for women's health at  Mt. Baker Planned Parenthood, starting as a secretary and eventually  rising to become the CEO for 21 years.\n\nUnder Linda McCarthy's leadership, Mt. Baker Planned Parenthood  expanded access to exceptional and essential health and social services…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689685/recognizing-linda-mccarthy"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…friend and  fellow Iowan, Dan Houston, on his retirement from Principal Financial  Group after 41 years of service.\n\nFrom starting his first job with Principal in 1984 to eventually  becoming chairman, president, and CEO, Dan exemplifies the power of  hard work and dedication. His decisions have helped more families  achieve financial security and plan…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694878/congratulating-dan-houston"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…ounces.\n\nIts origins date back to 1797 when Congress passed legislation  requiring every Member of Congress to be provided with a copy of the  Constitution. These copies were eventually expanded to include Supreme  Court case citations so that Members could see which clauses of the  Constitution the Court used in deciding cases.\n\nHowever, as the number of…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689324/repeal-requirement-for-congressional-research-service-to-prepare-annotated-constitution-and-supplements-in-hardbound-version"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Mr. BEAN of Florida. Mr. Speaker, I thank the chairman for yielding  time.\n\nMr. Speaker, when your old roof keeps leaking, you can keep adding  shingles to it, but eventually you must admit the structure underneath  isn't built to weather the storm. Rather than double down on a problem  that keeps getting more expensive, it is time sometimes to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698784/breaking-the-gridlock-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…better for the American consumer, to make things  more affordable, and to make things just a little bit better. If we can  take a half a step today and a full step tomorrow, eventually we can  get this economy, that was totally screwed up by the previous  administration under Biden and Harris, back on track to serve the  American people.\n\nThe material previously…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700197/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Alaska, began  in 1986 at the tender age of 22 years old when he started a chicken  wing restaurant, expanding his business footprint to other eateries  across Fairbanks and, eventually, purchasing the iconic Fairbanks  landmark called Pike's Landing.\n\nFor anyone going to Fairbanks, you have got to stay at Pike's  Landing.\n\nIt was this purchase that led…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…but also  the backbone of its economy. By the mid-19th century, improved roads  connected Leeds to other surrounding communities that made it a center  for agriculture and, eventually, recreation. Today, Leeds' natural  beauty has led to the rise of boating and fishing on Androscoggin Lake,  turning quaint farmstands into a seasonal retreat in central…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700172/225th-anniversary-of-the-town-of-leeds"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…income tax on manufacturing, as  President Trump tries to bring back American manufacturing jobs from  China, Korea, and Mexico.\n\nWe will not have the money available to do eventually what I would  like to do, and that is have a $5,000 personal exemption to help out  young couples who are just starting out, so they have more income at a  time in their…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…programs, which are all over  our universities: ``The complete destruction of traditional marriage  and the nuclear family is the `revolutionary or utopian' goal of  feminism.''\n\nEventually, Angela Davis, another person prominent in the revolutions  that were taking place in the 1960s, was very antifamily. Even since I  have been in Congress, we had the Black…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…hands of a good leader, it could. The reality is we know, as  our Founders recognized in Federalist Paper after Federalist Paper and  in the very structure of our government, eventually somebody who isn't  benign is going to have the power.\n\nFor ``The Lord of the Rings'' fans, they know that even the best  person, when they put the ring on, it is tempting…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…straightforward proposition. If this goes into  effect, then it will stop this mass exodus because people will not need  to leave California simply based on the threat that this could  eventually go into effect.                        Shutting Down Illegal Biolabs\n\nMr. KILEY of California. Mr. Speaker, I have joined with several of  my colleagues, including the cosponsor…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700217/prices-in-california-are-too-high"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…that Newsom  exaggerated the fire prevention work he had done by a staggering 690  percent and had also slashed the fire prevention budget by $150  million.\n\nNewsom's edict eventually took the form of the regulation that is in  front of us today, and on his way out the door, President Biden gave  him special authority to effectively impose it on the rest…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690484/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…just 20  years old. After meeting his wife and welcoming their first child, they  moved his young family to Southern California. There, he worked for  local dairymen and eventually entered the dairy business himself-- continuing the family tradition dating back to the 1600s.\n\nIn 1994, George Atsma began his own dairy legacy when he started  building…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698674/recognizing-the-atsma-family"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…they already had M1 tanks. At Fort Hood, he was assigned to the  1st Battalion 8th Cavalry Regiment, part of the 1st Cavalry Division.  He served as a Platoon Sergeant, and eventually, as the First Sergeant  for D Company. While serving as the 1st Sergeant, he was notified he'd  be attending the U.S. Army Sergeants Major Academy. It was there, in  January…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694773/recognizing-the-contributions-of-charles-charlie-webb"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…appropriations bills are for what we call  discretionary spending. The reconciliation bills are what are referred  to as mandatory spending. Between the two bills that must eventually  pass or several separate appropriations bills, we will be looking at  virtually all of the Federal Government.\n\nMr. Speaker, different programs have different goals, and…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…continued  attention to this growing public health challenge.\n\nAlzheimer's, the most common form of dementia, impairs memory,  thinking, and behavior, with symptoms that eventually interfere with  daily life. The effects of this disease are not limited to the  individuals diagnosed but, of course, extend to their families,  friends, caregivers, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}]