[{"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…doctrines, and human rights.\n\nFor three years, the Ukrainian people have faced deliberate killings,  rapes, and the abduction of their children.\n\nThe United Nations has found evidence of Russian war crimes, and the  International Criminal Court has issued an arrest warrant for Vladimir  Putin, accusing him of being responsible for the abduction of Ukraine…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687989/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…stay of  execution, Justice Sotomayor, joined by Justices Kagan and Jackson,  concluded, ``Allowing the nitrogen hypoxia experiment to continue  despite mounting and unbroken evidence that it violates the  Constitution by inflicting unnecessary suffering fails to ` ``protec[t]  [the] dignity'' ' of ` ``the Nation we have been, the Nation we are,  and the…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696470/executive-calendar"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…``bad-faith actor'' who ``weaponized and abused'' his  authority--all because Krebs refused to lie and say Trump's 2020  election was rigged. And because Krebs said there was no evidence in  2020 that ``any voting system deleted or lost votes, changed votes, or  was in any way compromised,'' he was attacked, and that Executive order  asked DHS to target him.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…profession, one that will ensure  that all communities can provide modern, state-of-the-art facilities,  one that will ensure that all students have the right to read--with  evidence-based reading instruction, school libraries, books at home,  diverse materials, and the freedom to choose what to read.\n\nToday, we are failing our public schools because we…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…virtually no one trained in financial management and  oversight.\n\nIf there were any truth to their hyperbolic claims of corruption, for  which they have offered no credible evidence, they should have asked  the USAID Inspector General to investigate, rather than fire him  without cause.\n\nAnd if they actually did discover programs they don't support, they…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…that include plotting the murder of FBI agents, violent assault,  strangulation, possession of child sexual abuse material, and reckless  DUI homicide.\n\nDespite the clear evidence of crimes committed by these individuals-- on January 6, 2021, and after--President Trump continues to defend  insurrectionists but demonize immigrant neighbors who have committed…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698532/recognizing-the-5th-anniversary-of-january-2021"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…health advocate organizations, agree that fat-free and low-fat milk are  the healthiest options for children.\n\nThe DGAs must follow the Dietary Guidelines Advisory Committee's  evidence-based recommendations to maintain current limits on saturated  fat, sugars, and sodium. Simply put, nutrition standards must be guided  by scientists, not politicians and…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698183/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…and denied responsibility  for what he had done. In fact, he said Officer Tate had attacked him.\n\nThe judge in that case was appointed by Donald J. Trump. He heard all  the evidence, he heard the guilty plea and the evidence that both sides  presented, and he sentenced Mr. Taake to 6 years in jail. Donald  Trump's pardon wiped that away with the stroke…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698549/january-6-attack"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…D.C. lawmakers.\n\nHealthcare decisions are deeply personal. The confidential  relationship between a patient, their parents, and their physician is  sacred. Physicians follow evidence-based guidelines and use their best  clinical judgment.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698357/protect-childrens-innocence-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Inflation is going up, unemployment is up, the stock market is  rickety and went down again today, egg prices are up, and Walmart sales  are down.\n\nSo far, there is little evidence that DOGE is helping families.  Indeed, they are causing more unemployment. They are not keeping us  safer, and they are not helping anybody.\n\nA young U.S. Department of Agriculture…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687903/draconian-doge-cuts"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Bipartisan Policy Center goes on to say: ``Illegal voting,  including by noncitizens, is routinely investigated and prosecuted by  the appropriate authorities, and there is no evidence that noncitizen  voting has ever been significant enough to impact an election's  outcome.'' That is from The Heritage Foundation.\n\nIf my Republican colleagues are truly concerned…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…by trusted community members who offer job  training, mental health resources, de-escalation tactics, and more to  keep our neighborhoods safe.\n\nCVI strategies are proven, evidence-based solutions to gun violence,  and yet the Trump administration decided they are inefficient.\n\nHouse Republicans are complicit in the Trump agenda to endanger  public safety.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691753/national-gun-violence-awareness-month"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…years ago, the Supreme Court  said that there are a variety of safeguards that have been put in  place: right to counsel, detention hearing, and the chance to offer  opposing evidence and the like, that provides the safeguards that  permit the statute to be found to be constitutional.\n\nHowever, the way this bill is drafted, none of those safeguards could…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696977/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…border is much more secure. I support that.  We must maintain it, and we will.\n\nSo is the deportation policy now about deporting criminals--something  we support? There is evidence, and the evidence of what the policy is  about comes from a Department of Homeland Security report itself. What  it says is that 14 percent--only 14 percent--of the people…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700023/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…risk to  our residents but a direct vulnerability in America's strategic  readiness.\n\nMoreover, while Jones Act supporters continue to claim the law  protects U.S. jobs, the evidence says otherwise. According to the  Grassroot Institute of Hawaii, maritime employment in the U.S.  shipbuilding and repair sector has declined by 15 percent over the past…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694572/introduction-of-the-merchant-marine-allies-partnership-act"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…``Forensic File'' opens like this: All of the witnesses at  the scene of the crime said no crime was committed, right down the  line. In fact, they have even submitted printed evidence. Yet the  prosecutor thinks otherwise.\n\nI don't think that would be a very interesting ``Forensic Files''  because what it says is no crime got committed.\n\nNow, can we talk…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…you why we are here. We are here because  this previous administration, the Biden administration, imported 10 to  15 million illegal aliens who have come here and we have evidence that  they are participating in our elections.\n\nThe next thing you will say is: Did they get Social Security numbers?  Mr. Speaker, they did. The DOGE team just announced…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689995/safeguard-american-voter-eligibility-act"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…significant effect on       those same entities is alarming. If the Bureau believes small       entities will not be significantly affected by the rule, it       should provide the evidence it uses to support that claim.                                digital assets\n\nLastly, we also have concerns regarding the rule's       applicability to digital assets and…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689949/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…academic article. This is one of those  geeky ones that is peer reviewed, all of those things: ``Computational  analysis of U.S. congressional speeches reveals a shift from evidence  to intuition.''\n\nThey basically took 240 years of House floor speeches, ran AI across  them, and said: Guess what has happened? These speeches around here no  longer talk…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…undoing a lot of the damage of the previous administration. We are  seeing that on a daily basis.\n\nMr. Speaker, the gentleman is simply incorrect with respect to the  amount of evidence that has mounted over people who are voting and  should not be. The record is replete. In one example, ICE arrested  criminal illegal alien Ian Andre Roberts, who was serving…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…of the level A offense       was vacated.\n\n``(2) Contents of motion.--A motion described in paragraph       (1) shall--\n\n``(A) be in writing;\n\n``(B) describe any supporting evidence;\n\n``(C) state the offense; and\n\n``(D) include copies of any documents showing that the       movant is entitled to relief under this section.\n\n``(3) Hearing.--\n\n``(A) Mandatory…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…survey[s]'' on operators that are small entities.\n\nThis resolution would end the Biden administration's needless  overreach and return the regulatory regime to a targeted, evidence- based approach.\n\nNotably, this repeal preserves America's ability to tap its offshore  resources efficiently. It will not weaken genuine historic preservation  but will stop…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688630/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…further interfered  with an Immigration and Customs Enforcement Deportation Officer engaged  in the performance of his official duties;\n\nWhereas body camera and other video evidence support the allegations  made within the Federal indictment;\n\nWhereas such actions constitute a violation of section 111(a)(1) of  title 18, United States Code, relating to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694802/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…exercises those nationwide  injunctions, and that wouldn't necessarily be a problem, except he has  repeatedly displayed bias and partisanship.\n\nFor instance, without substance or evidence, he complained to Chief  Justice Roberts that he didn't think President Trump would comply with  judicial orders. That displayed his bias, Mr. Chairman. That displayed  his…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699047/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…and disastrous the foreign policy from the       Democrat President, [the] Democrat Senators don't want the       Senate to exercise its authority.\n\nI would argue today is evidence that both sides are guilty of this. I  would argue that if Gaza was a war, that bombing of the Venezuelan  capital and removal of the President and the blockade of an entire…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699091/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…accordance with generally accepted government       auditing standards. Those standards require that we plan and       perform the audit to obtain sufficient, appropriate evidence       to provide a reasonable basis for our findings and       conclusions based on our audit objectives. We believe that       the evidence obtained provides a reasonable…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…who is a  paramedic and a SWAT medic/firefighter--have the resources that they  need to save lives in the field.\n\nIt doesn't stop there. This bill supports a full range of evidence- based treatment options, from emergency overdose reversal to long-term  recovery tools, like medication-assisted treatment, counseling, and  peer support.\n\nThe SUPPORT for…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691884/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…with me something that he and many of his fellow Democrats-- Democrats like Jamie Raskin, Jasmine Crockett, and Stacey Plaskett-- apparently detest, which is a thing called evidence.\n\nTuesday, I gave a speech on the House floor detailing my House  Oversight Committee's good work to date on our Epstein investigation.  After all, Hakeem Jeffries, the Democrats…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697128/irrefutable-evidence"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…and that it is a drop  in the bucket.\n\nMr. Speaker, which is it?\n\nIt has to be one or the other.\n\nThe fact that our colleagues keep twisting themselves in knots is  simply evidence that they are doing everything in their power to hide  the facts about this vote.\n\nAt one minute, this $10 billion return on taxpayer dollars is not  worth Congress' time.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Compensation Service of the Veterans Benefits       Administration that--\n\n(1) automates the retrieval of the service record or health       records of a veteran;\n\n(2) compiles evidence relevant to the determination of a       claim for benefits under laws administered by the Secretary;\n\n(3) provides automated decision support relevant to such a       determination;…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695487/modernizing-all-veterans-and-survivors-claims-processing-act"}]