[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…history. Black history is American history.\n\nDictators try to shutter museums, censor history, and whitewash the  truth, but we know the truth. We hold these truths to be self-evident,  that centuries of bondage and enslavement brutalized Black bodies and  tore apart Black families, that Black women have been the mothers of  movements, that Black folks…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689876/trumps-attacks-on-black-history"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…the space  that we occupy here on this earth.'' ``CP'' paid his rent and he paid  it well. His commitment to improving lives in the Chattahoochee Valley/ Quitman County was evident through his service on more than 13 boards  and commissions, often as Chairman. He tirelessly advocated for better  education, healthcare, and public services, leaving a lasting…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691304/in-memory-of-the-honorable-curtis-parham-cp-redding-sr"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…visionary organizations like the International       Campaign to Abolish Nuclear Weapons.\n\nUnfortunately, campaigning for abolition of nuclear weapons       does not have any evident capacity to hinder the US       government's leading role in propelling the momentum of the       arms race. No matter how heartfelt and imbued with wisdom,       pleas for…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693757/marking-80-years-after-trinity-the-dangers-of-nuclear-war-have-never-been-higher"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…true today: The United States of America  must always stand with Ukraine against Russian aggression.\n\nBuffalo is known as the City of Good Neighbors, and that spirit has  been evident in the way our community has opened its doors to Ukrainian  refugees, providing shelter, education, and hope for a better future.\n\nMembers of this body, both Democrats and…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…partners, while building enduring partnerships among military commands,  public agencies, and the private sector. His deep commitment to both  the base and our community is evident in his work to ensure that  Ventura County's infrastructure, workforce, and expertise continue to  meet the evolving demands of 21st century national defense.\n\nAmong his many…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700086/recognizing-gene-fisher-and-his-dedicated-service-to-the-county-of-ventura"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…has made numerous  advancements in space operations, infrastructure improvements, and  community partnerships. Her dedication to the men and women of Space  Base Delta 2 is evident in every action she takes on their behalf.\n\nDuring her time at Buckley, Colonel Dexter has worked to bolster the  morale and well-being of the personnel under her charge.…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693378/recognizing-colonel-heidi-dexter"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…crates, was transported to the new location as quietly as can       be done with a police escort.\n\nBoth the appeals and challenges of the society's current       home were evident during a recent tour. An extensive library       all but begged the visitor to pause and flip through a book,       any book: on heraldry or mythology, shipwrecks or excavation.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…served as a  Grandview Alderman for 40 years and remained active on the Parks and  Recreation Commission during his tenure. Jim's dedication to the  constituents of Grandview is evident through the various groups he was  involved in, including serving as Board Director for the Grandview  Assistance Program, and as a founding member of the Grandview Youth…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696936/recognizing-the-life-and-memory-of-james-jim-neil-crain"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Chair for several Council cycles, always  focused on fiscal responsibility while ensuring that the needs of  Columbus citizens were met. Her fingerprints and legacy will be evident  in Columbus for many years to come. Her voice and vote were critical in  efforts to renovate Golden Park, which helped bring the Atlanta Braves  Double-A team to our city.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690837/in-memory-of-the-honorable-judy-thomas"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…legislation are iconic spots off the coast of California: Monterey Bay,  Channel Islands, and the newly created Chumash Heritage National Marine  Sanctuary.\n\nNowhere is this more evident than in the Chumash Heritage National  Marine Sanctuary, a sanctuary that was decades in the making. First  nominated by the Northern Chumash Tribal Council in 2015, the sanctuary…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699957/undersea-cable-protection-act-of-2025"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…the  first same-sex marriages in Washington State, standing at the forefront  of a historic civil rights milestone. Her compassion, warmth and belief  in human dignity are evident in the many cases she has handled.\n\nOff the bench, she has mentored countless law students, new attorneys  and law clerks, taught as Jurist in Residence at Seattle University…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697901/recognizing-the-contributions-of-mary-yu"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…family; Major David Long, U.S. Air Force;  Debora Moritz; Fran Hillier.\n\nI just want to say that the Declaration of Independence clearly  states:\n\nWe hold these truths to be self-evident, that all men are       created equal, that they are endowed by their Creator with       certain unalienable Rights, that among these are Life,       Liberty and the pursuit…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…reminded today of a great speech that President Roosevelt gave  81 years ago. ``The Economic Bill of Rights,'' it has been called. He  talked about economic rights that are self-evident, but, as with all  self-evident rights that we know in this great document, our  Constitution, they aren't self-executing.\n\nI want to focus for a moment on one of the rights…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689083/economic-populism"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…politics to billions and  billions of dollars in dark money, and those billions and billions in  dark money have distorted our political process in ways that are  obvious and evident to everybody who works in this building. Some are  winners from that dark money spent, and some are losers from that dark  money spending, but everybody sees it.\n\nBillionaire…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699104/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…the Founders of our great country.\n\nOf course, the Declaration of Independence, authored by Thomas  Jefferson, makes the famous statement: ``We hold these truths to be  self-evident, that all men are created equal, that they are endowed by  their creator with certain unalienable rights, that among these are  life, liberty and the pursuit of happiness.''…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…country.  Ms. Taibleson's voice during that testimony was courageous and very  instrumental in Justice Kavanaugh's confirmation.\n\nThe same dedication to the rule of law was evident during her time in  the Solicitor General's Office. She raised her hand to handle complex  and important cases on behalf of the United States without regard to  political…", "date": "2025-10-27", "source_url": "https://justfacts.votesmart.org/public-statement/1696407/nomination-of-rebecca-l-taibleson"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…community in  carrying out this historic and heroic effort, House Democrats are once  again putting politics before protecting the American people.\n\nMr. Speaker, this hypocrisy is evident in the message coming from  congressional Democrats. Earlier this month, Chuck Schumer stated that  President Trump ``seems content to drag our country . . . into an  endless…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699371/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…excellent  people-skills and ability to inspire and motivate those around her make  her a trusted leader among students and staff alike.\n\nJayden's commitment to her community is evident both on and off  campus. She has volunteered her time at the local food pantry and  played a key role in a student-led campaign to collect non-perishable  items for blessing…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692255/recognizing-ms-jayden-coffey"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…and the bold declaration that my friend,  Hakeem Jeffries, articulated earlier is true,  we unite under that: the bold declaration that we do hold these truths  to be self-evident.\n\nWhat is a self-evident truth? It is something that is obvious. ``We  hold these truths to be self-evident, that all men are created equal.''  It does not say born equal,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…fundamental  right is the right of life.\n\nThink about it. Think about the first document that birthed our  Nation, the Declaration of Independence. ``We hold these truths to be  self-evident, that all men are created equal, that they are endowed by  their creator with certain unalienable rights, that among these are  life, liberty, and the pursuit of happiness.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692892/dobbs-v-jackson-anniversary"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…tremendous testament to our country coming together to overcome evil.  You have got the Korean War Memorial. For those of you who have been  there, the darkness of that memorial is evident in the expressions on  the faces of those soldiers there at the Korean War Memorial. You have  got the Vietnam Memorial, which has all the 58,000-plus names of the  men and…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692714/recognizing-national-post-traumatic-growth-day"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…lifelong learning, enrichment,  and reading.\n\nIt has often been stated that libraries aren't about the books but  about the people. Nowhere is that perspective more clearly evident, in  form and function, than in the Williamsburg Public Library.\n\nOn behalf of everyone in Pennsylvania's 13th Congressional District,  I congratulate the residents of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695425/president-trumps-peace-through-strength-agenda"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…also contributed to the Rockwall  County Historical Commission, helping preserve the county's heritage  for future generations. Her dedication to children and education is  evident through her service on the Rockwall County Children's Advocacy  Center Board, the Royse City ISD Education Foundation, and her active  role on the RCISD Rebranding Plan Committee,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698359/recognizing-the-success-of-janet-nichol"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…principles are the foundation of the Wellsboro Rotary  Club's work, shaping a century of service that has left a mark on  Wellsboro and the surrounding communities.\n\nTheir impact is evident, from recognizing outstanding students and  supporting local charities to installing bicycle service stations and  funding scholarships.\n\nAt its core, Rotary is about service…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687905/recognizing-wellsboro-rotary-clubs-centennial-anniversary"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…and he served as a senior adviser in my office.\n\nBefore working for Congress, Dale served our country in the Army for  9 years, and his keen strategic eye and leadership are evident in  everything that he does.\n\nDale has served me in building relationships in the business  community, the defense sector, and our district. His extensive  knowledge of the…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693635/recognizing-dale-anderson"}, {"senator": "John Boozman", "party": "Republican", "sentence": "…these levels represents solid  bipartisan work to provide the resources necessary for our veterans,  their families, and the servicemembers defending our Nation, which was  evident with the passage of the measure in the Appropriations Committee  by a vote of 26 to 3.\n\nI want to again thank Senator Ossoff as well as Chair Collins and  Vice Chair Murray…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694207/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…Bank of New York has  already concluded that overdraft fee caps hamper, rather than foster,  financial inclusion. The consequences of the rule have been studied,  and it is evident that this cap would harm consumers by limiting their  access to necessary financial services.\n\nFinally, this idea that smaller banks and credit unions are  unaffected by the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689846/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…generate, sustain, and integrate Army  Reserve capabilities in support of our Nation.\n\nMr. Austin's professionalism, integrity, and tireless commitment to  service have been evident in every role he has held. His legacy is one  of excellence, and his contributions have strengthened the foundation  of our military and its future.\n\nI also want to extend…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696046/recognizing-mr-stephen-d-austin-assistant-chief-of-us-army-reserve"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…LNG in less than a decade.\n\nU.S. LNG has played an undeniably important role in providing  affordable, abundant, and clean energy to the world. This could not  have been more evident than in 2022, when Russia invaded Ukraine,  disrupting global commodity markets and leaving Europe without secure  access to energy.\n\nImmediately, for our friends in Europe,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697089/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…years, 15 of them as  county clerk. He was responsible for numerous innovative services in  the county clerk's office, and his passion for the people who he worked  with was evident in the quality of his work.\n\nMr. Speaker, I encourage my colleagues to support this bill, and I  reserve the balance of my time.\n\nMr. GILL of Texas. Mr. Speaker, I encourage…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697699/paul-piperato-post-office-building"}]