[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…opportunity to explain his history of sexist  and anti-labor comments a few months ago in committee, during the  confirmation hearing, he deflected. He showed no reflection or evolved  thinking, because the truth is Mr. Tung's record and writings reveal a  pattern of ideological extremism that calls into question his ability  to apply the law fully and…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696538/government-funding"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…family  in Oklahoma.\n\nIt strikes me that we are witnessing this evolution of this  administration's policies that began with: We are just going to deport  criminals.\n\nIt then evolved into disappearing people without hearings and  claiming that the people they were disappearing were criminals,  dangerous criminals, members of the Tren de Aragua gang.\n\nThey…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…nearly 3,000 calls from those needing crisis  support and a path to safety--demand for services has more than doubled  during the past decade.\n\nAs the needs of survivors have evolved, The Hotline has implemented  responsible, survivor-centered technology innovations--including  expanded chat and text services and improved resource navigation to  increase…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700099/recognizing-the-30th-anniversary-of-the-national-domestic-violence-hotline"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…providing grants to  priorities such as cancer research, the Red Cross, and a pioneering  project to assist historically Black colleges. Over the years, this  institution has evolved into a much more expansive enterprise, allowing  flexibility to engage in a variety of community issues and inform the  public on responsible governance.\n\nA tireless champion…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695547/recognizing-the-pew-charitable-trusts"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…committed to the  highest standards of public service.\n\nFrom the earliest days of policing rural roads to the current use of  cutting-edge technology, the agency has continually evolved to meet the  challenges of each era while striving to maintain the trust and respect  of the public it serves.\n\nEven their uniforms made an impression--most notably in 1986,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692219/rhode-island-state-police-centenary"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…temperatures  and unpredictable rainfall patterns continue to jeopardize the health  and viability of these plants.\n\nIf we are to preserve the irreplaceable native plants that have  evolved over millennia, it is critical that we take action to protect  them. Recognizing April as Native Plant Month will not only provide an  opportunity to celebrate the diverse…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688920/supporting-the-designation-of-april-2025-as-national-native-plant-month"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…disclose their donors.       Since Citizens United, dark money groups have spent at least       $4.3 billion on federal elections.\n\nAs dark money has proliferated, it has also evolved.       Immediately after Citizens United, many newly empowered       groups purchased their own ads to influence elections. Some       of these purchases were reported to…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…Fire Protection District.\n\nToday, Metro Fire is a vital safeguard for the lives of over 720,000  Sacramentans across a 359-square-mile area. From humble beginnings, it  has evolved into one of the largest and most responsive fire agencies  in California, operating 41 state of the art fire stations  strategically positioned across the region. Sacramentans…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698078/recognizing-sacramento-metropolitan-fire-districts-25th-anniversary"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…together, united by a vision of  faith and service. Their commitment and love for their community  sparked growth, soon reaching 23 members. As the neighborhood around  them evolved, so did the church, embracing change and relocating to a  new home on West McNichols in 1950. By May 27, 1951, Trinity Church  broke ground on their new fellowship hall, proudly…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691231/congratulating-reverend-lydie-ngoie-and-the-members-of-trinity-faith-united-methodist-church-on-35-years-of-worship-and-leadership"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…introducing the AI for ALL Act. The AI for ALL Act  develops a national strategy for the Federal Government to improve AI  literacy in education. By understanding how AI has evolved and is  expected to evolve, we can be better prepared to embrace the  opportunities AI presents and address the challenges that can and will  arise in the future.\n\nAs lawmakers,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696867/artificial-intelligence-is-here"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…announcement of Kazakhstan's  intent to join the Abraham accords and commitments to regional partners  on critical mineral investment.\n\nOver the years, the C5+1 format has evolved into an important  platform for advancing dialogue, strengthening regional cooperation,  and expanding opportunities for trade, investment, and connectivity.  The recent summit…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696589/welcoming-the-positive-outcomes-of-the-c51-summit-and-us-central-asia-partnership"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Applewood Seed has emerged as a top flower seed  supplier in the Nation, all while staying true to its roots as an  employee-owned company.\n\nIn addition, Applewood Seed has evolved into a company dedicated to  innovation within its field with research and development gardens, an  extensive network of seed growers, and a state-of-the-art seed testing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695842/recognizing-applewood-seed-company"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…1945, the Nation first designated a national week to recognize the  contributions of people with physical disabilities. Designated by  Congress as NDEAM in 1988, commemoration evolved to acknowledge the  importance of increasing the number of people with disabilities in the  workforce. In 2001, the Department of Labor's Office of Disability  Employment…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696023/recognizing-national-disability-employment-awareness-month"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…needs across our science agencies, including the Department of Defense  (DOD). So, it is no surprise to me that over the lifetime of the SBIR/ STTR programs, each agency has evolved the particulars of their  individual programs to align with their specific needs. That also  applies to how they approach risk assessment in their due diligence  programs.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695449/extension-of-sbir-and-sttr-authority"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…ecosystems. The striking silversword plant, which grows only on the  volcanic slopes of Hawaii's highlands, is another example of the  island's extraordinary flora, having evolved to withstand harsh,  isolated conditions.\n\nThese species, and so many others, also represent an irreplaceable  part of Hawaii's heritage, not only contributing to the islands'…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688377/the-hawaii-native-species-conservation-and-recovery-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Coast, hosting a wide variety of shows, musicals,  comedies, and tribute acts.\n\nUnder the visionary leadership of my good friend, Managing Partner  Craig Smith, the Alhambra has evolved into a unique destination where  art, entertainment, and culinary excellence converge to create an  unparalleled experience.\n\nMr. Speaker, the Alhambra isn't just a destination.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691576/recognizing-alhambra-theater-dining"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Program. Her commitment to helping colleagues reach their  fullest potential earned her the respect and admiration of her peers,  and many of these professional relationships evolved into lifelong  friendships that will endure in her memory.\n\nBeyond her professional accomplishments, Krista was known for her  kindness, generosity, and deep love for all…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688958/recognizing-the-life-of-krista-wynne-moore"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…``jarheads,'' which was initially due to the  appearance of their high-collared dress uniforms that made their heads  look like a mason jar in the early 1900's and has since evolved to also  reference the popular ``high and tight'' haircut; and ``devil dogs''  from the German nickname given to them during the Battle of Belleau  Wood in World War I. The…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696652/recognizing-the-us-marine-corps-on-its-250th-birthday"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…responsible use of publicly and  commercially available information to support national security  policymaking and informed decisionmaking.\n\nOver the past 85 years, OSINT has evolved alongside changes in media,  technology, and global communications. In recent years, it has played a  critical role in understanding Russia's invasion of Ukraine, conflicts…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700249/recognizing-national-open-source-intelligence-day"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…growing nation.\n\nAt the time, the United States Postal Service envisioned ZIP Codes as  a simple tool to improve sorting and delivery, but over the decades ZIP  Codes have evolved into far more than postal convenience. They have  become integral to how we navigate modern life.\n\nEconomic developers rely on ZIP Codes to attract businesses and plan  growth.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…and its predecessor, the Atomic Energy Commission, have a long  and successful history of interagency collaboration with NASA. Over the  last 60 years, this relationship has evolved from radioisotope power  systems to new areas of research such as quantum information and  environmental sciences.\n\nThis interagency relationship has greatly benefited my…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688986/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Original Western  Stage Show at the Flying W Ranch in Colorado Springs. Flying W Ranch  was opened in 1947 by the Wilson family, who hosted their first potluck  in 1953. It has evolved into the entertaining and iconic dinner and  show that it is today which hosts hundreds of people on a regular  occurrence.\n\nThe Flying W Wranglers band, which was formally…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694939/recognizing-the-flying-w-wranglers"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…quite hazardous to just bypass all of this, because that is  how we legislate, without making sure that we have gone through all the  necessary steps.\n\nThis process that has evolved over the last, roughly, two and a half  centuries allows legislation to be examined in a transparent and a  deliberative  way, with input from affected Agencies, from industries,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698296/9999"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…of  higher education.\n\nCollins earned his Bachelor of Science degree in Finance from Loras  College in 1984. After graduation, what began as a brief visit to his  alma mater evolved into a lifelong career of service. Starting as an  admissions representative in 1984, he advanced through various  leadership positions before being selected as President…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694164/congratulating-loras-college-president-james-collins-on-his-retirement"}, {"senator": "John Boozman", "party": "Republican", "sentence": "…athletics, and representing the  university with distinction. Their chapter house, a landmark on West  Maple Street, stands as a symbol of tradition and transformation,  having evolved to meet the needs of a growing and dynamic membership.\n\nThe chapter's centennial celebration will bring together hundreds of  alumnae and current members to reflect on their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695796/recognizing-100-years-of-the-gamma-nu-chapter-of-kappa-kappa-gamma"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…the Portland and Ogdensburg Railroad  expanded the town's hospitality industry and encouraged steamboats to  bring visitors to Sebago. What were once seasonal homes and inns  evolved into year-round abodes that contribute to Sebago's image as a  well-known resort area in southwestern Maine.\n\nSebago is home to many examples of charming New England architecture…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699146/town-of-sebago-200th-anniversary"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…Fightin' Fifty-Fifth.\n\nOver the last 85 years of war and peace, missions and aircraft have  come and gone, and operating locations have changed as the needs of the  nation have evolved. Throughout it all, the men and women of the 55th  Wing have never wavered in their mission to fly, fight, and win. It is  my great honor to recognize their achievements and…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689070/recognizing-the-55th-wing-85th-birthday"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…community. Their efforts culminated  in the formal establishment of the Greater Hernando County Chamber of  Commerce on December 22, 1992.\n\nOver the past 100 years, the Chamber has evolved and expanded to meet  the changing needs of Hernando County's business community. Guided by  its Pillars of Success--Advocacy, Marketing, Networking, and Training-- the Chamber…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695644/recognizing-the-greater-hernando-county-chamber-of-commerce"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…states: ``Allah has said.'' Followers of sharia believe Muhammad  received a divine legal code that stands supreme over all man-made  laws.\n\nWhile Western civilization has evolved, Islam has not. Islam is stuck  in the eighth century, and if they succeed at imposing their beliefs  upon us, we will be dragged back into the Dark Ages.\n\nThe contrasts are…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697017/sharia-is-dangerous"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…bedrock model for going forward and getting us  out of the continuing resolution rut. Continuing resolutions lock us  into spending levels that are both outdated and have not evolved like,  frankly, the positions on both sides.\n\nThe fiscal year 2026 Homeland Security bill under consideration today  furthers this administration's goals of undoing the damage…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699349/department-of-homeland-security-appropriations-act-2026"}]