[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…here to rule on specific local ordinances  or decisions made by the cities and counties in any of our districts.  Yet Republicans have brought H.J. Res. 142 to the floor to do exactly  that. Republicans want to tell the District of Columbia's 700,000  residents that the laws and policies they have voted for, and that were  crafted by their local elected…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699844/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…this  affordability crisis a hoax. Just last week, he said plainly: ``I don't  want to drive housing prices down. I want to drive housing prices up. .  . .''\n\nThat tells us exactly whom he is fighting for: Wall Street  speculators and billionaires, not our families living on Main Streets  and in our barrios. He is not even trying to hide it anymore.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699586/stop-the-republican-affordability-crisis"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…criminals, our colleagues are just looking for ways to create more  loopholes in the laws for purchasing guns.\n\nMr. Speaker, again, I just wanted to nail down into the weeds here  exactly what the legislation says. The term ``firearm'' is the meaning  given that term in section 921(a) of Title 18, excluding any machine  gun. They have properly decided that…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…allowing page, after page, after  page to be blacked out to protect those powerful men? Why will they not  respond to the fact that when these files were released, they did  exactly the opposite of the law and failed to redact information about  the victims, revictimizing so many?\n\nThis is 1,000 percent unacceptable, and it is unacceptable to our  values…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699772/9999"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…broken system and bad policies, the danger is real, it  is tangible, and it is urgent.\n\nLet me be clear: The last 100 days have not been an accident or a  fluke. He has done exactly what he said he was going to do. He gave us  the blueprint in Project 2025. Some tried to warn us of the dangers  and, well, here we are.\n\nLet's talk about education. Within…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…government  can sometimes be, but there should be no shortcut to public engagement  and to the democratic process. Yet a shortcut--or maybe more accurately  a short circuit--is exactly what this administration has chosen.\n\nWith an underresourced and understaffed Forest Service, I know for a  fact that the resource professionals and the scientists at the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "Mr. WELCH. Mr. President, exactly 2 years ago today, Vermont was  struck with devastating floods. Those floods occurred not only a year  ago today, but 2 years ago today. We had back-to-back floods in 2023…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…Committee on Education and Workforce.\n\nMrs. HAYES. Mr. Speaker, I thank Representative Adams for her  remarks. As she noted, I was a classroom teacher for over 15 years. I  know exactly how important these resources and supports are. I had  students who had severe learning disabilities but who were able to  thrive with the appropriate accommodations and the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Hegseth recently declare, at the Reagan  Defense Forum, an end to what he calls ``idealistic utopianism,'' while  calling for a renewed focus on the Western Hemisphere.\n\nSo what exactly does a renewed focus on the Western Hemisphere look  like for the Trump administration?\n\nSo far it has meant bombing alleged drug traffickers in the Caribbean  and Pacific,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…faces a proceeding where he will face removal. I  have repeatedly requested humanitarian parole on his behalf, and those  requests have gone unanswered.\n\nMr. Speaker, Marwan is exactly the kind of person humanitarian parole  was created for: a dedicated public servant, husband, and father. I  urge DHS to grant him humanitarian parole.", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696969/marwan-marouf-needs-humanitarian-parole-now"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…counter China's influence. We must work to ensure that we  shape these global standards as they will define the future of  telecommunications technologies.\n\nThis bill will do exactly that. It will have a real impact on our  global competitiveness, 6G deployment, and our national security.\n\nMr. Speaker, I am glad to see that today we are making real progress,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693508/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…held.\n\nI know from my days in the Department of Justice--I was the U.S.  attorney for Connecticut--that this kind of disclosure is done not  routinely, not commonly but in exactly this kind of instance when the  credibility of the Department of Justice may be at stake, and people  deserve to know the truth.\n\nAnd here, let's be very blunt. There are…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694635/9999"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…prison while he was saying he was  absolutely trying to stop drugs. You don't send a message about  stopping drugs by taking a kingpin and setting him free, and yet that  is exactly--exactly--what happened.\n\nAnd then we have this issue of the administration saying: Hey, this  isn't a military operation--no, no, no. It is a judicial operation.\n\nIf it is…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "Mr. KELLY. Mr. President, exactly 5 years ago today, I, as well, was  in this Chamber, listening to my colleagues debate something that never  should have been in question--the validity of the electoral votes…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698511/9999"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…news doesn't tell the truth. . . . I       say it doesn't represent the people. It never will represent       the people, and we're going to do something about it.\n\nDo what, exactly? The following month, President Trump       returned to his campaign pledge to ``open up the libel       laws,'' tweeting that the New York Times had ``disgraced the…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…Meanwhile, Washington drags its feet. But these businesses aren't  waiting for permission--they're taking action. And as we refocus on  Making America Healthy Again, this is exactly the kind of leadership we  should be lifting up.\n\nI'm proud to recognize Gateway Parks and Barn Elite Training for  investing in our youth--because a strong America starts…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690045/recognizing-gateway-parks-and-barn-elite-training"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…trying to save money and put America  first, and I respect that, but defunding support to Taiwan that was  requested by the Trump administration has consequences that would do  exactly the opposite of what I believe the gentlewoman is trying to  achieve.\n\nPeace through strength saves money, saves lives, and puts American  interests first. President Trump…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695256/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…think? Well, on Sunday, on ``Face the  Nation,'' CBS asked the junior Senator from Virginia if the vetting  process should be strengthened after the shooting. Now, that is exactly  what President Trump is doing. The Senator refused to answer that  question. Instead, he told a national television audience that having  the National Guard in Washington,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697341/trump-administration"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…released into the country in June alone. Madam Speaker, 1  year later, zero migrants were paroled into the country--again,  promises made, promises kept.\n\nThis leadership is exactly what Americans voted for this past  November, and House Republicans are united in equipping the President  to continue securing our borders for good.\n\nIn our One Big Beautiful…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694111/americas-borders-are-safer"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…have to be negotiated when you  begin running the projects, which obviously means a lot more money for  the lawyers and much more difficulty for the politicians to understand  exactly what is going on.\n\nYou would think, Madam Speaker, that of all the government programs  this would be the easiest to get rid of because we are supposed to be  broke. In fact,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…risk.\n\nAt a time when adversaries are actively probing undersea  infrastructure, Washington should be focused on protection, resilience,  and readiness, not red tape.\n\nThat is exactly what the Undersea Cable Protection Act of 2025 does.  It prevents agencies from piling new permitting requirements onto  projects that have already been reviewed and approved.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…expands experimentation and prototyping authority to all combatant  commands, including U.S. Strategic Command at Offutt Air Force Base in  my home State of Nebraska.\n\nThis is exactly the kind of strategic deterrence that makes our  adversaries think twice and say: Not today.\n\nThis year's NDAA also safeguards critical defense spectrum. Some in  Washington…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695027/9999"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…work to keep everybody  else in the community safe.\n\nDo you know what that is, Representative Roy? I have the definition  right here. That is sedition is what that is. That is exactly what it  is. No one wants to say it, but we are seeing it happen.\n\nThis is among Americans in our country. These are our neighbors.  These are people right here in every town…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…investment in energy infrastructure that bolsters our  energy security.\n\nThe facts are clear: We must reform the broken approval process and  unlock LNG's potential. My bill does exactly that. It eliminates the  politicized DOE, which was weaponized by the previous administration,  and gives FERC sole authority over that authorization process.\n\nThis is common…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697088/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…ruined their way of life. They turned a blind eye, like we are at the  moment, and are going to have to fight in the streets to get their  countries back.\n\nIt is coming. That is exactly what is going to happen in this country  in a few short years if we don't act now to save our country and our  way of life.\n\nI achieved the highest honor of my life this year,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…educational institutions to  clearly provide estimated tuition costs to potential GI Bill students.  If an institution cannot accurately estimate the tuition, they must  explain exactly why, and this transparency ensures veterans aren't  misled by inaccurate information, preventing unnecessary debt that they  would accrue.\n\nThe bill directs the VA to establish…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689602/veterans-education-transparency-and-training-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…bills, cover  medical costs, and support their families. They do not invest their  hard-earned savings so that Federal bureaucrats can push ideological  priorities.\n\nThat is exactly the concern here. ESG investing has become a tool for  advancing a broader political agenda. Instead of asking: Is this the  best investment for the worker, the ESG framework…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…proven, and they have been stable.\n\nIt is long overdue for us to provide Federal legal clarity here, so  why am I speaking in opposition to it? My Republican colleagues are  exactly right about the stablecoins and the need for regulation. That  is why we passed the STABLE Act, but my Democratic colleagues are right  this time to recognize that the legislative…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693835/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…on the regulatory costs imposed by other  Federal agencies on small businesses.\n\nIt is transparency. It is all about transparency. It is going to show  the American people exactly where the Democrat blue tape is strangling  growth in America.\n\nThis legislation supports President Trump's regulatory rightsizing  agenda and gives our job creators the relief…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697329/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…may I inquire as to the time remaining.\n\nMr. BABIN. Mr. Chair, I yield 1\\1/4\\ minutes to the gentleman from  North Carolina (Mr. Rouzer).\n\nMr. BABIN. Mr. Chair, I reiterate exactly what we said in my opening  statement and what Mr. Rouzer has stated. Many times, the opposition  has nothing to do with clean water whatsoever. It has been weaponized.  We…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698037/promoting-efficient-review-for-modern-infrastructure-today-act"}]