[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…simply to highlight the hypocrisy of this  administration. Donald Trump campaigned on a promise to lower prices on  day one of his administration, but he has done  the exact opposite. His policies and his rhetoric are raising the cost  of living for hundreds of millions of Americans.\n\nTo make matters worse, he is simply lying about it. In fact, his…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689475/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…more thinning of our forests. It required  more hiring up of Forest Service staff, which really emphasizes the  point my colleagues have made about how this is doing the exact  opposite.\n\nI wanted to connect a couple other dots for you, just to really bring  home this point. President Trump promised all along the campaign trail  that he was going to bring…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…already working and showing some promise.\n\nThen, Republicans claim the other three bills in this rule support  small businesses. Yet, there is no surprise. They do the exact  opposite.\n\nDOGE already shuttered an SBA office in my district in Massachusetts,  forcing a lot of rural small business owners to have to drive hours to  get to the office in Boston.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…they will impact everyday Americans.\n\nThis administration came in the door saying they would lower costs  and ease burdens on American families. These tariffs would do the exact  opposite. The President readily admits that these tariffs will disrupt  the economy, but he claims two things: that there will only be a minor  disruption and says that they will…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689471/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…will increase by hundreds of  dollars a year. That has nothing to do with lowering the high cost of  living and making this country a more affordable place. It does the  exact opposite.\n\nIt is an all-out and unnecessary assault on the clean energy tax  credits, the clean energy tax credits that many of my Republican  colleagues promised in letter after…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…sort of make  light of the fact that these tariffs that he has put in place are going  to make things more expensive for the American people.\n\nThat is in contrast and the exact opposite of what he promised to do  when he ran for office and was elected. That is not right.\n\nPresident Trump, Elon Musk, and their billionaire buddies have pushed  a budget that…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…want a filibuster-free  pathway to do tax cuts which will increase the deficit. And they  brought in a new Parliamentarian in order to get a ruling that they  could do the exact opposite of what 100 Senators had agreed to. So more  and more payments diverted into interest.\n\nWe had that Big Beautiful Bill, as Trump calls it--or as many of us  call it, the…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…to have something in the stomach of that 7-year-old who  is going to first grade, and to know that their food assistance  programs could get taken away, we are doing the exact opposite of what  Republicans promised that they would do for this country.\n\nThis budget is a statement of where we are at as a country, and this  is the wrong statement that we…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688084/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…technicians are going to lose 4 percent.\n\nThis bill benefits those who are already doing well and ignores those  who are working hard and struggling the most. It is the exact opposite  of what we should be doing.\n\nEven Donald Trump challenged the Congress to say: Raise taxes a bit  on the rich. I am fine with it. Did the Republicans do that? No. They…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691530/tax-cuts"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…make ends meet.\n\nAs a country, we should be doing everything we can to support our  young families and make raising kids more affordable. These policies  are doing the exact opposite.\n\nWith this administration's sweeping tariffs, families will be forced  to pay even more for the products they need to care for their children  such as high chairs, cribs,…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689419/protecting-american-families"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…percent of bipartisan  amendments. Think of that. When a Democrat and a Republican decide to  work together to improve a bill, they are told no.\n\nMr. Speaker, that is the exact opposite of what the people in this  country are asking for.\n\nRepublicans blocked votes on tariffs. We had to move Heaven and  Earth. We had to finally force a vote after months…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700195/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…families experience freezes in critical funding that supports their  households. We are seeing housing costs continue to skyrocket as well.\n\nAgain, we were promised the exact opposite, which is that this  President knew and understood what it was for the average American  family to struggle to afford the cost of housing. He  promised that he had the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…is pushing for them to  have their sentences commuted so ICE can take custody of them and then  remove them from the country more quickly.\n\nThe gentleman's bill does the exact opposite. It requires the  deportable immigrants be held in our prisons at enormous public expense  for 5 years, 10 years, 15 years, in some circumstances even for life,  making…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…an unserious proposal at the eleventh hour. People aren't stupid. They  can see this.\n\nTheir so-called Lower Health Care Premiums for All Americans Act  would have the exact opposite effect than what it claims to do.\n\nMost importantly, it does nothing to extend the ACA tax credits. The  tax credits have been a lifeline for countless hardworking families,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698377/lower-health-care-premiums-for-all-americans-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Executive Steve Neuhaus, a U.S. Naval Reserve  officer, and State and local officials on both sides of the aisle.\n\nThe mission to warehouse large numbers of humans is the exact  opposite of what the President and DHS Secretary  Kristi Noem constantly proclaim: to root out the most dangerous thugs  and criminals. In fact, ICE is targeting the least violent…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699213/in-opposition-to-ice-facility-in-hudson-valley"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…marking up this important legislation in the House  Financial Services Committee this week.\n\nThe OCC's merger rule under the Biden administration would have taken  us in the exact opposite direction. It would have upended decades of  precedent by shifting the burden onto banks to prove their merger  should be approved rather than requiring the OCC to demonstrate…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…not return to Boulder, Colorado, to commemorate the victims who were  the subject of this resolution that he so misguidedly introduced  because this resolution is the exact opposite of Mr. Van Drew's  resolution.\n\nThis resolution uses anti-Semitism, uses Jews, for a political  objective. This was an anti-Semitic attack. The victims were Jewish.  One…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…statement.\n\nHe claims this is his position. It would represent a change of heart,  but it means nothing unless he acts on it if he continues to support  policies that do the exact opposite.\n\nIf the Governor is serious, I am calling on him today to take  executive action to protect women's sports and to get the legislature  to take action as well, so that…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}]