[{"senator": "Steve Cohen", "party": "Democrat", "sentence": "…mater into  the legal profession by keeping a close eye on undergraduate prospects,  encouraging applicants, evaluating candidates and then watching them  mature through the bar exam and on to successful legal careers both  locally and across the country. She was instrumental in the creation of  the Summer Law Intern Program (known as SLIP), which encourages…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693637/congratulating-sue-ann-mcclellan-on-her-retirement"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…of the environment.\n\nThis bill includes provisions that begin addressing the mariner  shortage by updating mariner requirements, updating the merchant  mariner credentialing exam, and expanding the pool of eligible  mariners.\n\nFinally and importantly, the bill includes numerous provisions to  address sexual assault and sexual harassment within the Coast…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694197/coast-guard-authorization-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…assisting students in--\n\n(I) obtaining a regular high school diploma or its       recognized equivalent under State law; or\n\n(II) in passing a general educational development exam, a       high school equivalence diploma examination, or other similar       State-authorized exam; or\n\n(iv)(I) has served, is serving, or has enlisted in the       Armed Forces;…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…wealth or  income tests.\n\nThe Equal Opportunity for All Investors Act addresses this problem by  allowing an individual to qualify as an accredited investor if they  pass an exam that ensures they are properly versed in the risks of  investing in the private markets.\n\nWith this change, ordinary investors who want to invest in private  securities can…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693889/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Telemedicine Services Act of 2025, as  amended. It will enable VA providers to prescribe substances to  veterans through telemedicine without first conducting an in-person  exam. This bill will make permanent a flexibility that has been  extended to VA and non-VA prescribers alike since the COVID-19  pandemic.\n\nThe current waiver, which has been extended…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695455/protecting-veteran-access-to-telemedicine-services-act-of-2025"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…know that that shortage is real. Just go  to any hospital, nursing home, or health clinic in your district, and  you will hear the same thing: they are short-staffed in ERs, exam  rooms, operating rooms, and on the floors. Short-staffing is bad for  patients, and it is bad for nursing burnout.\n\nDespite this blindingly obvious reality, the Education Department's…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697261/nursing-excluded-as-professional-degree-by-department-of-education"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…that loving American  families in our country face. Our colleagues now want to invite the  Federal Government to come barging into the family dining room and in  the doctor's exam room like a raging bull in a china shop.\n\nDoes anyone believe the Freedom Caucus and President Trump love  America's children more than their own parents do or that they can…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698345/protect-childrens-innocence-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Riverside was also named as a platinum member of the 2024 AP School  Honor Roll. This would not have been possible without the 80 percent of  seniors who took at least one AP exam during high school.\n\nCongratulations to the class of 2025 for all of their hard work and  accomplishments. I am looking forward to the next chapter and what it  has in store…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…district, named after my predecessor and  champion of reproductive health and access, Congresswoman and now Mayor  Barbara Lee. The Barbara Lee Oakland Health Center has over 19 exam  rooms and is transit accessible, but the Republican budget bill will  put Planned Parenthood centers like ours across the country at risk.\n\nMr. Speaker, 200 of the 600 Planned…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694154/defunding-planned-parenthood"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…servicemembers' cars. They failed to  submit a credible living will. They overcharged small business  retailers for credit card services. They flunked their Community  Reinvestment Act exam. They discriminated against people of color who  were seeking mortgage loans.\n\nTo top it off, they pressured their employees to cross-sell their  products, which led to the…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…small businesses, shutting out countless Americans, especially  women, veterans, and people of color, based on wealth, not knowledge.\n\nOur bill addresses this by creating an exam to assess your ability to  understand financial risk when investing in private markets, enabling a  more diverse group of people to invest responsibly, regardless of their…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693886/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…accomplishment is nothing short of  extraordinary. His SAT preparation was largely self-directed, relying  on free resources, and using his time and determination to study for  the exam. Beyond  academics, he is deeply involved in extracurricular activities at West  Orange High School. He has been a dedicated member of the cross-country  and track teams since…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688149/recognizing-the-perfect-sat-score-of-sahli-negassi"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Madam Speaker, I rise today to say as clearly as I  possibly can: Politicians have no role in the medical exam rooms.\n\nAs a physician who spent 20 years caring for patients, I know  responsible care requires building trust and understanding between a  patient, their parent, and their…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698347/protect-childrens-innocence-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…reimbursements not to  quality care standards but solely to their own product sales.\n\nWe must protect against VBM schemes that invade the safeguarded  sanctity of a doctor's exam room. Confronting VBM abuses is the central  focus of my bipartisan bill, the DOC Access Act, as well as multiple  active investigations in Congress and by the GAO, FTC, and…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693946/addressing-the-growing-abuses-of-vision-benefit-managers"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…algebra with one goal in mind: to help his students surpass  him, and they do.\n\nOne of his students just ranked number one in Utah and number two in  the Nation in the Trig-Star exam, beating Mr. Otten's own timed score.\n\nSome of Mark's former students are now his doctor, dentist, and even  his mechanic. That is the kind of legacy every teacher hopes for.…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694043/recognizing-mark-otten"}, {"senator": "French Hill", "party": "Republican", "sentence": "…communications of a material supervisory       determination conveyed to the failed insured depository       institution in the previous 3-year period; and\n\n``(III) any additional exam reports and correspondence that       the appropriate Federal banking agency determines may be       relevant to the failure of the insured depository       institution.\n\n``(ii)…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…shall begin the day after the expiration of the active       credential of the credential holder.'; and\n\n``(2) in section 7510(c)--\n\n``(A) in the subsection heading by striking `Exam Review'       and inserting `Working Group';\n\n``(B) in paragraph (1)--\n\n``(i) by striking `90 days' and inserting `180 days';\n\n``(ii) by striking `Coast Guard Authorization…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…Congressman Mike Lawler.\n\nThe Equal Opportunity for All Investors Act would expand the  accredited investor definition to include individuals that are  certified through an exam written by the SEC and administered by FINRA.  Accredited investors are individuals that are allowed to participate in  investment opportunities that are not generally available…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697827/increasing-investor-opportunities-act"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…today to formally recognize an  exceptional young student, Madeline Brobst, a senior at Franklin  Christian Academy who has received a perfect composite score of 36 on  the ACT exam. Through disciplined study, steady composure during  examinations, and unwavering commitment of time and talent, Ms. Brobst  has achieved academic success and joined the ranks…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700087/recognizing-madeline-brobst-receiving-a-perfect-score-on-the-act"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…November 1, 2025, in  Indianapolis, Indiana. During the Poultry Evaluation event, Manor FFA  students evaluated live poultry, graded carcasses and eggs, and  completed a written exam. The Manor FFA team won a gold ranking, and  the students--Anna Frey, Jozie Gilger, Leanna Kneisley, and Misty  Railing--each earned silver.\n\nThe Dairy Cattle Evaluation and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697257/congratulating-the-manor-future-farmers-of-america"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…Fields, for all of his work.\n\nThe Equal Opportunity for All Investors Act would expand the  accredited investor definition to include individuals that are  certified through an exam written by the SEC and administered by FINRA.\n\nAccredited investors are individuals that are allowed to participate  in investment opportunities that are not generally available…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693887/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…University,  she earned a recordbreaking 4.22 GPA. Her professors even wrote to the  Judiciary Committee prior to her hearing to explain that these  professors often thought that her exam answers were better than their  own answer keys.\n\nIt is no surprise, then, that she went on to clerk for two Supreme  Court Justices.\n\nSince her time as a clerk, she has grown…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696138/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…in support of H.R. 1107 offered by  Representative Womack.\n\nThis bill would allow telemedicine prescriptions for controlled  substances at VA even before an in-person medical exam.\n\nDuring the COVID pandemic, VA waived requirements for an in-person  appointment. As a result, providers could prescribe controlled  substances by telemedicine. This waiver…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695456/protecting-veteran-access-to-telemedicine-services-act-of-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…communications of a material supervisory       determination conveyed to the failed insured depository       institution in the previous 3-year period; and\n\n``(III) any additional exam reports and correspondence that       the appropriate Federal banking agency determines may be       relevant to the failure of the insured depository       institution.\n\n``(ii)…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697286/systemic-risk-authority-transparency-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…continued her education,  earning seven more degrees after leaving UACCM, balancing her time  between her studies and raising her 10 children. In 2025, she passed  the State board exam for the credential of family nurse practitioner.\n\nDr. Jackson's story is a story of hard work, perseverance,  determination, and triumph.                    Celebrating Doug…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699816/congratulating-robert-arrington"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…anything--not homework, not  attendance, not midterms, or anything like that. Grades wouldn't be  given at all. The only thing that would actually matter for grades is a  final exam. Even then, a student would get to keep retaking it until  the student got the grade that he or she wanted.\n\nLast week, I raised some concerns about this new initiative. Just…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…that authority to include even more providers who are  eligible for employment at the VA to perform medical disability  examinations. This is a necessary expansion to the VA's exam programs  to get even more qualified people serving veterans.\n\nI thank Representative Ciscomani for his leadership on this bill and  his efforts to increase access to disability…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695499/rural-veterans-improved-access-to-benefits-act-of-2025"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…authority over an amorphous and ill- defined group of firms with payment tools. Given their track record, I  think it is fair to say that we should not be supporting greater exam  reach of the CFPB.\n\nI don't want our concerns to remain abstract. Let's take a look at  some of the practical effects that CFPB examination would have over  these payment firms.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689949/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}]