[{"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…to create a national registry for people with autism  is an example of what happens when incompetent and incapable leadership  is in place.\n\nThis administration is full of examples like this. The callous,  heartless disregard for others comes right from the top, and it is  mirrored in the people who have been nominated to run the government.  So we can't…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…my view--in  the view of the local officials who have ongoing responsibility to get  the community back on its feet. They just couldn't get answers.\n\nLet me just give some examples. When there is a culvert out, there is  a road out, there is a bridge down, the people whose bridge is  affected, the people who are threatened if we have a culvert replaced…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…to actually represent two of the largest manufacturers of  advanced transmission conductors in my district: CTC Global and TS  Conductor. These companies are extraordinary examples of American  innovation and manufacturing which is helping pioneer the grid of the  future and create high-skilled domestic jobs in the process.\n\nMr. Chairman, I urge Members…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697895/electric-supply-chain-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…while today the California waivers may be the target,  we don't know what comes next.\n\nIn previous statements on this issue earlier today and in previous  days, I have given examples of, now that the CRA has been applied in  this fashion, there is a whole host of adjudicatory decisions by a wide  variety of Agencies across the Federal Government that are…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…But it has already been made public. The public has seen it.  I find it a profoundly offensive letter.\n\nAnd as I passed by a stack of newspapers today, I saw a series of  examples of Donald Trump's signature because Trump has said to the  world, ``That is not my signature.'' But, of course, the experts say  that is not true.\n\nThe birthday book contains…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…for here today.\n\nI could go on and on, but those cases I just told you about all came  from Washington State. That is a drop in the bucket. There are several  million more examples just like this in red States across the country.\n\nBob in Idaho told me his premium will jump by nearly $1,900 a month;  Nancy in Florida, $1,000 a month; Cheri in Tennessee…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696460/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…President of the United States and his       administration have taken and a number of statements       targeting lawyers and the legal profession.\n\nThe following are illustrative examples of the concerning       actions and statements:\n\nOn February 25, 2025, the President issued a memo titled       ``Suspension of Security Clearances and Evaluation of…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689713/no-rogue-rulings-act-of-2025"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…insecurity as they endure the dangers of religious and ethnic  persecution within their own communities.\n\nIt is important that these incidents, though only a fraction of the  examples we have of the destructive force of hate are confronted and  placed on the Congressional Record.\n\nCongress must renew its commitment to root out hate-fueled violence  that…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690781/we-have-a-shared-humanity"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…once again, are  attempting to unravel a compromise by slashing funding for healthcare  services and education programs for children and for the needy.\n\nLet me give you some examples.\n\nThe amendment would eliminate funding to Seattle Children's Hospital  for a behavioral health crisis stabilization unit. The underlying  funding would enable Seattle Children's…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699285/amendment-no-1-offered-by-mr-massie"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Secretary Rubio are forging ahead, using Elon  Musk to provide cover through lies and misinformation on the social  media platform he bought and broke.\n\nThey highlight select examples of programs they deem wasteful which  amount to a fraction of a penny of the foreign aid budget--some of  which began under the first Trump administration--and they make…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…electrical equipment that we need to  build housing--at a time when housing is already in short supply--it  will make them more expensive and harder to find.\n\nThose are just a few examples.\n\nThere are countless other imports that American businesses and  families rely on that are going to be hit hard, and these tariffs do  nothing to bring down those costs.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…the weaponization  of the Department of Justice and the United States Treasury to reward  allies and to punish perceived enemies.\n\nLet me briefly highlight just a few other examples.\n\nEarlier this year, the Trump Department of Justice agreed to a $5  million settlement with an estate of a January 6 rioter who was killed  while attempting to violently…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696924/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…become unaffordable for  tens  of thousands of people across our northwest Ohio district, over half a  million Ohioans, and 15 million Americans.\n\nPlease let me share some examples. A constituent from Clyde, Ohio,  said it clearly: High insurance prices will allow people to die by  making healthcare unaffordable. It was terrible before the ACA. We need…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696841/rising-healthcare-costs"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…2018.       Programs slated for elimination include Comprehensive Opioid       Recovery Centers and the Youth Prevention and Recovery       Initiative. These are just two examples of programs that your       committee authorized in 2018 and voted to reauthorize on a       bipartisan basis earlier this year, in addition to other       concerning eliminations…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…doubt we will hear  any of that from Donald Trump tonight.\n\nFinally, I am proud to welcome seven New Yorkers to tonight's joint  meeting of Congress. These New Yorkers are examples of some of the very  people whom Donald Trump promised to help but whom he has left behind.\n\nFirst, I am honored to welcome Emma Larson, a 12-year-old middle  school student…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…reach the barges-- a higher economic, logistic, and environmental impact. Other  stipulations are redundant with existing State requirements. These are  just some of the many examples of 2024 ROD terms that make the program  economically infeasible. These terms and conditions in the 2024 ROD are  part of why the Senate should pass this joint resolution…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…permitting program administered by the States of Florida, Michigan, and  New Jersey, and to provide certainty to the other States lined up to do  the same.\n\nThese States have been examples of cooperation between the State and  Federal Government, and now Congress must provide clarity and  confidence for any additional State interested in joining these three.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the national level, as  well.\n\nWe have seen that when States and districts take a data-based  approach to instruction, they can get tremendous results for students.  We see examples like KIPP or Success Academy. These are charter  networks that have vastly outperformed other public schools, despite  serving students who are well below the poverty level…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…tool for  surveillance. This allows unelected bureaucrats to monitor and  potentially restrict how Americans spend their hard-earned wages.\n\nRecently, we have seen alarming examples of this kind of overreach,  from the Chinese Communist Party using its digital currency to track  and control citizens to Prime Minister Trudeau in Canada freezing the  bank…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693527/congratulating-central-high-school-womens-softball-team"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…classmates, and neighbors, each playing  a role. As one local paper put it, ``lt took all of Ganado.'' And it  did.\n\nIn a time when the spotlight so often falls on the wrong examples,  these young women reminded us what it means to fight for something  bigger than yourself. Their victory is more than a trophy. It's a  testament to hard work, unity, and…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693499/congratulating-the-ganado-maidens-softball-team"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…terrible cases of  fraud and exploitation involving vulnerable children, and the public  needs to know that this is probably just the tip of the iceberg.\n\nI will give you three examples.\n\nOne sponsor allegedly applied to take in two migrant children as  their father--and as I will show you today, I have two other examples  of a person pretending to be a father…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699108/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…include a community meal program with Advocates for  Homeless and Those in Need, and the Change for Life Baby Bottle  Project, which supports families in crisis. And yet, these examples  capture only a fraction of Assumption BVM's deep commitment to serving  those in need.\n\nThe parish's Knights of Columbus chapter provides even more  opportunities for parishioners…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694740/recognizing-assumption-of-the-blessed-virgin-mary-parishs-75th-anniversary"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…people will continue to be educated that America  has a huge race problem and that we should not be adequately proud of  America.\n\nAs I mentioned, right now there are many examples of ethnic groups  who are doing better than the native born today, which puts a lie to  the idea that anybody is not succeeding in this country because their  ancestors did…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…up, forcing families to return to neighborhood  schools that they had chosen not to attend and that, in many cases, are  failing to teach students the basics.\n\nWe have many examples now of high-performing charters in the State  being nonrenewed, but this bill, AB 84, makes things even worse. It  specifically targets independent study and homeschool-based…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…software, institute positive change at  the Congressional Research Service, and provide more opportunities for  Members to engage with their constituents. These are just a few  examples of the many contributions Derek has made to this institution.\n\nAt the start of the 119th Congress, Derek joined Speaker Mike  Johnson's team as Director of House Operations,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696851/thanking-derek-harley-for-his-service-to-the-house"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…a directive implying that State employees ought not be  that gung ho when it came to removing State employees from this country  if they were here illegally.\n\nWe have two examples in Wisconsin alone in which elected officials  aren't on the page of addressing the immigration laws.\n\nI think it is important that we all be articulate enough to explain…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690195/wisconsin-in-the-news"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…called hypothetical expenditures that let States spend Medicaid dollars  on services that were over budget and unrelated to the core functions  of the Medicaid program.\n\nSome examples of this included paying for air conditioning systems  for beneficiaries and for providing payments for legal support for  beneficiaries. This isn't to say that HVAC systems…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…through a multitude of legislative measures.  Just a small subset of this Democrat-led legislation is cited in a  House resolution--H. Res. 987--we have introduced today.\n\nExamples include H.R. 328, a Democratic-sponsored bill that  excoriates the Maduro regime which ``has refused to respect the  overwhelming choice of  the people of Venezuela and subsequently…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…pay to elevate your home if you get the  double whammy of paying to elevate and then your premiums, in some  cases, are higher than when they started?\n\nThese are just two examples of people who did everything right, did  what they were supposed to--they are not going to flood--and yet, after  Risk Rating 2.0, this is what happened. I don't know if people…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691629/risk-rating"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…with unmatched precision and  capability. B-2s launched from Whiteman and executed a long-range  strike against Iran in Operation Midnight Hammer.\n\nThis is one of the best examples of integration of total force that  has come from Whiteman Air Force Base in recent times. Operation  Midnight Hammer is a vivid example of what our long-range strike  capabilities…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692964/taking-a-step-toward-true-energy-dominance"}]