[{"senator": "Angie Craig", "party": "Democrat", "sentence": "…consumer disclosures,  mandatory recordkeeping, and examination by regulators. We do not want  another FTX.\n\nThe 2022 collapse of the world's third largest cryptocurrency  exchange wiped out an estimated $8 billion to $10 billion in value,  leaving American consumers holding the bag. The CLARITY Act would have  largely mitigated or avoided this crisis…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Medicaid  cuts, one in my district that is a healthcare safety net. The closest  hospital if they close is over an hour away.\n\nWe also created our own State-based healthcare exchange, and 573,000  Virginians signed up. Many of them now face the prospect they won't be  able to afford their premiums when their tax credits expire in 17 days.\n\nThis is all…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…written, does nothing to  actually address any national security threats. Instead, it seeks to  punish schools for accepting educational materials or participating in  cultural exchange programs. Actually, our schools would be the victims  of the undue foreign influence, but instead of deterring the bad  actors, the bill seeks to punish the victim and, in…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697533/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…work, Al Green?\n\nHere is how it works. You go to someone who is a principled person,  someone who has been fighting for liberty and justice for all. You do  them a favor. In exchange for that favor, you only require one thing:  Loyalty. Just give me your loyalty. Give me your loyalty in the future.\n\nThe thing that he has done can sometimes be of benefit…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…are usually  found. Usually, a new case of GBS is admitted to ICU (Intensive Care)  to monitor breathing and other body functions until the disease is  stabilized. Plasma exchange (a blood ``cleansing'' procedure) and high  dose intravenous immune globulins are often helpful to shorten the  course of GBS. The acute phase of GBS typically varies in length…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691695/recognizing-may-2025-as-gbscidp-awareness-month"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…Instead, on his watch, prices are rising. According to  multiple press reports, he privately urged oil executives to spend $1  billion in support of his campaign last year in exchange for promoting  their interests as President.\n\nPerhaps it is no surprise we are seeing policies that benefit the  most expensive energy sources instead of the cheapest options…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697888/state-planning-for-reliability-and-affordability-act"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…on the other side of the aisle of the American people with  the recently passed budget resolution that really is going to provide  tax breaks to the wealthiest Americans in exchange for cuts in vital,  essential programs for working- and middle-class families.\n\nMr. Speaker, I am proud to stand here with my colleagues from the  Congressional Hispanic Caucus…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688133/republican-budget-betrayal"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…Epstein files. His DOJ approved  the highly unusual transfer of Epstein's convicted co-conspirator,  Ghislaine Maxwell, to a cushy minimum-security prison, apparently in  exchange for her agreement to distance the President from Epstein's sex  trafficking activities. The President has even threatened members of  his own party with retribution if they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…hospitals' and providers' financial burden from providing  uncompensated care. So there has much been said about these individual  provisions in the Affordable Care Act on the exchange, but the bottom  line is--that ability for the Affordable Care Act to drive the  uninsured rate in half to an alltime low of 7 percent and 4 percent in  my State is a great…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697783/healthcare"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…have written and emailed  what their situations are all about. They are many, and they are  excruciatingly painful to listen to.\n\nOver 1.5 million Georgians are in the health exchange, in the  marketplace, and 340,000 of those, or about one-quarter will lose their  coverage if we don't do something about these expiring tax credits.\n\nA family of four earning…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697217/medical-bills-are-too-high"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…he has sought to dismiss, without prejudice and under  false pretenses, the bribery and fraud charges against New York City  Mayor Eric Adams in an unethical quid pro quo exchange for the  defendant's cooperation with the administration's political priorities,  thus abusing the criminal laws to unconstitutionally commandeer a State  officer and unit…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Clatsop  County. Teresa, a small business owner, runs a small flower and produce  farm. Like many small business owners, she purchases her coverage on  the Oregon health care exchange. Because of Republicans' refusal to  protect health care, her premium will soon be going from $230 a month  to $1,077 a month.\n\nThis is unconscionable, unacceptable, and unnecessary.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696722/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…they aren't actually economic or trade  policy; they are a political tool--this one designed to force every  major company to come before Trump to plead for tariff relief in  exchange for giving Trump the company's political loyalty--no different  than what is happening in the legal profession or in America's  universities.\n\nA tariff can be written very…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…into a lab and cooked up an issue to try  to hijack some unrelated moving legislative vehicle. The reason for  this is that 24 million Americans are specifically on the ACA exchange,  and they are absolutely going to get hosed. And because we are all in  the same risk pool, it is not just people on the ACA exchange that are  going to see massive increases…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695916/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…millions of dollars in a cryptocurrency  bribery scheme; an America where the President is soliciting foreign  governments for private gifts, including a $400 million jet in exchange  for favors; and who is systemically dismantling programs that feed and  house our people? He is trying to gut our healthcare systems and saddle  generations of our people…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692793/we-say-no"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Who Don't Use Their Health Insurance                        Expose Abuse in the Program          (By Niklas Kleinworth, Liam Sigaud, and John R. Graham)\n\nIndividual coverage exchange plans created by the       Affordable Care Act (ACA) have a glaring problem: nearly 12       million enrollees, or 35 percent of all exchange enrollees in       2024, do not…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698438/uncovering-widespread-fraud-in-obamacare"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…reinforce and enhance our  safeguards protecting senior investors from financial fraud and abuse.\n\nH.R. 1469 creates the senior investor task force within the  Securities and Exchange Commission which is tasked with reporting on  industry trends and challenges impacting investors over the age of 65.  The task force will also make recommendations for changes…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693936/national-senior-investor-initiative-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…Fund (IMF) is devoted to promoting       international monetary cooperation, facilitating the       expansion and balanced growth of international trade,       encouraging exchange stability, and avoiding competitive       exchange depreciation.\n\n(2) Taiwan is the 21st largest economy in the world and the       10th largest goods trading partner of the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…credits only relates to the 7 percent of Americans who are  actually enrolled in the ACA, not the other 93 percent of Americans who  are not participants in the failed ACA exchange. Of those 7 percent,  roughly one-half did not even use their coverage once last year. Yet,  the Democrats want to pour more money into a failing ACA program at a  cost of…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698806/breaking-the-gridlock-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…from Mr. Green right now. What I heard was  deliberate, calculated defiance.\n\nThe whole reason for this building to exist and the whole reason for  this House Chamber is to exchange our views, sometimes very sharply  different views, and talk out the differences among us. In order for  that to work, that discussion has to be accompanied by civility and…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688497/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…disturbing when it comes to the  personal health information of Californians.\n\nIt has been revealed that the website of Covered California, which is  the State's ObamaCare exchange, had a tracker that was collecting the  personal health information of Californians, and then transmitting that  information for marketing purposes.\n\nSpecifically, the CalMatters…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "French Hill", "party": "Republican", "sentence": "Mr. HILL of Arkansas. Mr. Speaker, I move to suspend the rules and  pass the bill (H.R. 3357) to amend the Securities Exchange Act of 1934  to require issuers with a multi-class stock structure to make certain  disclosures in any proxy or consent solicitation material, and for  other purposes, as…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693913/enhancing-multi-class-share-disclosures-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…examination shall be administered and       offered free of charge to the public by a registered national       securities association under section 15A of the Securities       Exchange Act of 1934 (15 U.S.C. 78o-3).\n\n(d) Commission Defined.--In this section, the term       ``Commission'' means the Securities and Exchange Commission.\n\nMr. Speaker, I rise…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693888/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…your effort to seek appointments of any appropriate       number of conferees from your committee to any House-Senate       conference of this legislation.\n\nI will submit the exchange of letters to be published in       the Congressional Record. I appreciate your cooperation       regarding this legislation and look forward to continuing to       work together…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692720/sanction-sea-pirates-act-of-2025"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…critical moments in  the Pacific theater.\n\nBart knew from an early age that he wanted to serve his country as a  naval aviator. So eager to learn to fly, Bart washed aircraft in  exchange for 1 hour of flight time while he was in high school. He also  served as a cadet in the Civil Air Patrol, the civilian auxiliary of  the United States Air Force.\n\nBart attended…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698432/republicans-have-delivered-in-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…cooperative, or time-share, that       provides covered services (either with respect to the entire       property or a part of the property) to the general public--\n\n(A) in exchange for a fee;\n\n(B) for periods shorter than 30 consecutive days; and\n\n(C) is promoted, advertised, or marketed in interstate       commerce or for which such property's services…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690200/hotel-fees-transparency-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Securities       Commissions.\n\n(b) Policy Advancement.--The Secretary of the Treasury, the       Board of Governors of the Federal Reserve System, and the       Securities and Exchange Commission shall take all necessary       steps to advance the policy set forth in subsection (a).\n\n(c) Waiver.--The President may waive the application of       subsection…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699846/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "Mr. SMITH of Nebraska. Mr. Chair, the American people want us to have  a thoughtful exchange here. I will hopefully contribute to that,  especially when I hear some of the accusations made that are just off  base, misleading, and false.\n\nWarren Buffett has paid a…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688061/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Endowed Program Support Fund and University of  Alabama College of Communication and Information Sciences.\n\nHe received the Rotary International Paul Harris Fellow, Opelika  Exchange Club Book of Golden Deeds Award, Opelika Chamber of Commerce,  ``Small Businessperson of the Year'' and Chancellor's Award Outstanding  Alumni--Southern Union State Community…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696582/recognizing-the-retirement-of-mayor-gary-fuller"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…your effort to seek appointments of any appropriate       number of conferees from your committee to any House-Senate       conference of this legislation.\n\nI will submit the exchange of letters to be published in       the Congressional Record. I appreciate your cooperation       regarding this legislation and look forward to continuing to       work together…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}]