[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Charge, a Canadian team, a women's professional hockey team. It was a  joyous event with our Canadian neighbors.\n\nYou see, we know now, the World Series, one of the most exciting  World Series between the Toronto Blue Jays and the Los Angeles Dodgers.\n\nThis isn't just some faraway place to us. These are our friends and  neighbors. But yet, despite…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…bill also requires the Department of Commerce and other agencies  to study blockchain technology in the context of consumer products and  safety. Right now, blockchain is an exciting technology. It is new  technology that can be used for data storage and helping AI to analyze  major issues. In addition, it could be in the digital currency form.\n\nThe next…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693413/consumer-safety-technology-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…percent when we hit the mid-21st century  mark.\n\nWe here in the United States of America are building roads, bridges,  factories, schools, so many things. It is really quite exciting, and  the IMPACT Act can play a role. The bill will improve cost- effectiveness, durability, and material demand efficiency of widely  used cement, and similar materials while…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688940/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…This legislation will allow CERN to send its scientists who have been  working on the DUNE project to assist in person as these experiments  come online.\n\nOne of the most exciting things about the DUNE project is we don't  know what it will discover. When we built our proton decay detector  many moons ago, we did not know that 160,000 years ago a star…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694825/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…again, thank her for her leadership and tireless efforts.                      Honoring 2026 Teachers of the Year\n\nMr. CISNEROS. Mr. Speaker, I rise today to recognize the exciting  achievement of two dedicated educators in California's 31st District.\n\nMr. Rene Romero and Dr. Heather Povinelli were both named 2026  California Teachers of the Year.\n\nMr.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696998/small-business-saturday"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…dedicated to the contributions to our Nation by John and Abigail  Adams, John Quincy and Louisa Catherine Adams, Charles Francis Adams  and Henry Adams and their family.\n\nThe exciting part of this is that while efforts have been made in the  past, we have finally arrived upon what I think is a suitable location  for this memorial. It is shown in this small…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697631/adams-memorial-great-american-heroes-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…President, and finally, a very good day. I just got  in from Albany in New York State. It was a very good day for Upstate  New York. This morning, I was up in Albany to make a very exciting  announcement years in the making. America's first ever national  semiconductor technology center is now officially open for business in  Albany, NY, in Upstate New York.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693456/national-semiconductor-technology-center"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…this so much it might drive some  people crazy, but it is important to realize where we are standing and  what moment we are in because it is the mid-2020s.\n\nIt is a really exciting and inspiring time. I remember getting into  Congress in the year 2019, and, of course, I was on the Science, Space,  and Technology Committee. We were recognizing in a committee…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…amazing university campus and stores and also Avery Point.\n\nWell done, bravo, and kudos to all of them. Just watching them  celebrate on the court last night was really so exciting for all of us  from Connecticut and from all across the country where many of these  players come from.\n\nI was texting with the Governor of Minnesota, Tim Walz, which is the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689671/congratulating-uconn-womens-basketball-stars"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…United States. Where is the emergency? We were producing  more oil, gas, and coal than at any time in the history of the United  States. Where is the emergency?\n\nEven more exciting to me because of its tremendous acceleration, we  were producing more alternative energy--low-carbon energy, geothermal,  wind, solar--than at any time in the history of the…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…is  important that our students get the education and training they will  need to succeed.\n\nThis is why recognizing March 14 as Pi Day is important. It shows the  fun and exciting side to math and other STEM subjects, and will  hopefully lead to a crop of students developing an interest in becoming  the next generation's mathematicians, engineers, and…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688887/recognizing-pi-day"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…my bill, H.R. 1318, alongside  Congressman Kennedy of Utah, the United States Research Protection Act.  I certainly thank Mr. Kennedy for his bipartisan leadership on this  exciting and important topic and, frankly, an essential topic.\n\nIn the 117th Congress, we got the CHIPS and Science Act done. It  included a lot of provisions focused on improving…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688933/united-states-research-protection-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…nation of privileges  denied to others, which is apt doubly to injure the nation making the  concessions, by unnecessarily parting with what ought to have been  retained and by exciting jealousy, ill will, and a disposition to  retaliate in  the parties from whom equal privileges are withheld. And it gives to  ambitious, corrupted, or deluded citizens (who…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…criticizes       but also accepts, and just plain muddling through to chip       away at problems and to keep our enemies from doing their       worst aren't glamorous or exciting. It doesn't feel like a       political triumph. It is usually the most we can expect from       our system of government, operating in a country as diverse,       quarrelsome,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…quantum information sciences as potential  areas for joint activity.\n\nI only hope that the citizens of America are tuned into this debate  in this moment because this is really exciting.\n\nThe bill directs DOE and NASA to coordinate activities through MOUs,  memorandum of understanding. The legislation authorizes the use of  reimbursable and nonreimbursable…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688987/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…bipartisan bill that is long  overdue and is based on that bipartisan work in both Chambers. Wow, we  are actually legislating. We are seeing bills passed in both Chambers.  It is exciting for me to see the good work of my friend, Chairman Tim  Scott of the Banking Committee, in leading a policy-driven effort to  put America's financial leadership first. S.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693834/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Unfortunately, lingering Federal interest in the property dating back  to the city's involvement in the Federal Lands to Parks Program decades  ago has impeded progress on an exciting renovation project for the  local Boys & Girls Club.\n\nDespite strong local support from the city of Paducah and community  members, this Federal restriction has hampered efforts…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697652/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…the schools. It affects families,  educators, and, ultimately, the success of our communities. At the  Education and Workforce Committee last week, we just heard about the  exciting new opportunities artificial intelligence presents to advance  education for students with special needs. However, many of those  opportunities will not be realized if Congress…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689683/supporting-our-nations-children-with-disabilities"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…first football state title.\n\nMr. Speaker, please join me in recognizing the Coosa Christian  football team, Coach Propst and his coaching staff, the faculty and  fans on this exciting win for the school. I congratulate them and Go  Conquerors.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697936/recognizing-coosa-christian-school-for-winning-the-ahsaa-class-2a-state-championship-in-football"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…American workers; adding 345,000 new  jobs; securing billions of dollars in new investments in the United  States.\n\nThe golden age of American prosperity is indeed here. As exciting as  the first 100 days of President Trump have been, it is clear President  Trump is just getting started.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690430/the-first-100-days"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…equipment, and got to work setting up.  That night, he blew everyone away and bought a real, college-like feel  to the game. He was prepared and professional, enthusiastic and  exciting. He brought music, catchphrases, and announcing on the call-- the whole nine yards. All night long people were asking, ``where did  this guy come from?'', ``he is amazing!'',…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691109/recognizing-dean-lancaster"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…dedicated service to the Lone Pine Unified  School District, she has taught thousands of students, transforming  their view of math from an intimidating subject to one that is exciting  and achievable.\n\nMrs. Rost is known for her creative instructional style, integrating  hands-on activities, technologies, and real-world applications,  instilling engagement…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…needs are left without access to the  kinds of opportunities so many take for granted, which is real teams,  real competition, and real crowds cheering them on.\n\nThis is an exciting new effort. There is so much going on with soccer  in Spokane and across the country with the launch of our USL team and  the coming World Cup. I am so proud that this has…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695809/recognizing-spokane-impact"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…help cultivate success  on the campus. She has been working diligently to match big brothers  and big sisters with students on campus, with 10 success stories to  date. It is exciting for students to have someone from their community  encouraging them in their educational journey.\n\nIt is clear Alyssa Reas has made a profoundly positive impact on our  community,…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690144/recognizing-alyssa-reas"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…unknown,  who have contributed so much, and who have built our Nation. This is  one of our new caucus' priorities, and we must get it done in this  term.\n\nLast week, something exciting happened at the White House. President  Trump threw his 100 percent support behind building the Smithsonian  American Women's History Museum on The National Mall. We must…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689367/womens-history-month"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…special time. We are already engaging  with the Senate to make sure this can adhere to and go through the Byrd  rule, all the specifics of making this a reality.\n\nThis is an exciting moment. It will be monumental, and it will do so  much good.\n\nI have always said, as I have been involved in congressional  policymaking, that we live in 2-year increments,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Bearden's dedication to public service and expertise in  navigating complex policy landscapes make her an asset to the Trump  administration.\n\nI congratulate Ms. Bearden on this exciting achievement. We all look  forward to watching her succeed and wish her the best in her new role.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690088/recognizing-deputy-assistant-secretary-lori-frazier-bearden"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…FLEISCHMANN. Mr. Speaker, I am excited to congratulate the  University of Tennessee at Chattanooga men's basketball team on winning  the National Invitation Tournament in an exciting overtime victory to  bring the championship trophy home to Chattanooga and East Tennessee.\n\nThis nail-biting head-to-head had Chattanoogans on the edge of their  seat. As…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690281/congratulating-the-nit-national-champions-the-utc-mocs"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…already over 250 years ago--we look forward to  Americans being able to have a very affordable day when they can go to  our parks and Federal lands for free.\n\nIt is already an exciting time in America. I commend the gentlewoman  who brought this bill to us and the effort that she has put forth to  make sure that Americans can have an affordable day on our…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697765/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…new CEO--and, by the way, this is the fifth CEO--so there have  been five more CEOs than there have been riders. Five CEOs, zero  riders. But the new CEO came out with some exciting news. He announced  that he has a goal by the year 2045 of completing the line going from  Palmdale to Gilroy.\n\nSo let's parse that statement, a goal of by 2045 going from…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}]