[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…discriminatory jury selection extends beyond that  inflicted on the defendant and the excluded juror to touch the entire  community. Selection procedures that purposefully exclude black persons  from juries undermine public confidence in the fairness of our system  of justice.''\n\nI urge my colleagues to support this bill.", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692690/introduction-of-the-district-of-columbia-local-juror-non-discrimination-act-of-2025"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…``less-than-lethal projectile devices'' does       not constitute deadly force. Moreover, even if that were not       the case, changing the federal definition of a firearm to       exclude TASERs and similar devices would in no way impact       liability for using deadly force, because such liability       outside the context of federal law enforcement is established…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…I also want to make clear, we are not excluding anything. In fact,  this amendment is what excludes things. If you are an organization that  checks facts, we are going to exclude you from who we are going to do  business with.\n\nI would just let out a heavy sigh at this moment about how do you  engage in that sort of conversation? If you want to take…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…employees to show that they are committed to creating and  affirming an inclusive environment for LGBTQI+ people or a way to  celebrate their own identity. It does not indicate to exclude anybody  else for what they may believe in.\n\nAt a time when the LGBTQI+ community is under attack, displaying a  Pride flag is especially important. It is particularly offensive…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695261/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…agreement. I fear President Trump  has not learned any new negotiating skills in the 5 years since.\n\nThe tenets of his approach to Ukraine and Europe appear to be the  same: Exclude and criticize American allies, capitulate to our enemies,  and withdraw support without any assurance of success.\n\nEarlier this month, Munich was the scene of another capitulation,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…Reduction Act (PRA), and       therefore is not a rule subject to review under CRA. As       explained below, we conclude that the scope of CRA does not       automatically exclude agency action subject to the PRA.       Instead, the agency action must be analyzed under CRA.                                  DISCUSSION\n\nAt issue here is whether the withdrawal…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…also differ considerably.       Researchers have documented significant gaps in multiple       political ad archives. And even the most comprehensive       archives generally exclude certain categories of spending,       such as payments to influencers for content or political       endorsements, further obscuring the whole picture.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "…the  White House's permanent collection.\n\nWe need more representation of African-American artists like Alma  Thomas and Eva Hamlin Miller in the Women's History Museum. To exclude  their work is to miss significant parts of our country's history and  contradict the very founding principle of the museum.\n\nI close again by honoring all of the women of…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689365/womens-history-month"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…``less-than-lethal projectile devices'' do       not constitute deadly force. Moreover, even if that were not       the case, changing the federal definition of a firearm to       exclude TASERs and similar devices would in no way impact       liability for using deadly force, because such liability       outside the context of federal law enforcement is established…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…misleading. Investors see a fund's expenses as higher than  they actually are simply because the fund decides to invest in BDCs.  This perception has led many fund managers to exclude BDCs from their  portfolio, not because of performance but because of this distorted  regulatory accounting.\n\nThe intent of this rule to provide transparency was well-meaning.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692711/access-to-small-business-investor-capital-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…deduct them as a cost of doing business and offering tax  preferences for certain child and dependent care assistance.\n\nThis bill would change the Fair Labor Standards Act to exclude the  value of these services from the regular rate used to calculate  overtime.\n\nDespite its name, the bill does not require employers to provide any  child or elder care.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699005/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…in America.\n\nMr. Speaker, this bill would rip a dangerous new loophole in the Gun  Control Act by changing the definition of firearm throughout the entire  criminal code to exclude from coverage certain less-than-lethal but  still highly dangerous weapons, such as tasers, which have been  identified as a contributing factor in more than 500 deaths throughout…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700036/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…the benefits of this bill  if they fall out of favor with President Trump. The role of Congress is  constrained. The bill continues to empower the President to include or  exclude countries entirely at his whim, and we know how unpredictable,  vengeful, and punitive he can be.\n\nWhile I support AGOA, I do not support extending it to countries with  serious…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698906/agoa-extension-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…retirement security.      H.R 2270, Empowering Employer Child and Elder Care Solutions           Act\n\nThe Empowering Employer Child and Elder Care Solutions Act       would exclude child, dependent, and elder care payments from       the rate used to compute overtime compensation for eligible       workers. This would result in workers receiving less…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…The result is misleading: investors see a fund's expenses as higher  than they actually are, simply because it invests in BDCs. This  perception has led many fund managers to exclude BDCs from their  portfolios, not because of performance, but because of distorted  regulatory accounting.\n\nThe intent of the rule--to provide transparency--was well-meaning.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697831/increasing-investor-opportunities-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…of the Commander in Chief. It is legislative  sabotage, and we shouldn't give in to that.\n\nThe Civil Service Reform Act of 1978 explicitly gives the President  authority to exclude agencies from collective bargaining when national  security is at stake. This would undo that.\n\nPresidents from Carter to Reagan to Trump have exercised this  authority. Courts…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697990/protect-americas-workforce-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…altogether, and it has kept  BDCs out of key investment indexes. That means fewer dollars flowing to  small businesses on Main Street.\n\nH.R. 2225 fixes this. It allows funds to exclude expenses related to  BDCs from their AFFE calculation, while still disclosing their  investment in BDCs. This improves both accuracy and transparency. This  is a smart and…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692712/access-to-small-business-investor-capital-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…program administered by the Secretary of Housing and Urban       Development and not yet in existence at the time of the       enactment of this section, the Secretary shall exclude from       income any disability benefits received under chapter 11 or       chapter 15 of title 38, United States Code, by such person.\n\n(c) Department Property Defined.--In…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "Mr. WALBERG. Mr. Speaker, Pursuant to House Resolution 988, I call up  the bill (H.R. 2270) to amend the Fair Labor Standards Act of 1938 to  exclude child and dependent care services and payments from the rate  used to compute overtime compensation, and ask for its immediate  consideration in the House.\n\nThe Clerk read…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699006/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…work falls into these types of categories.\n\nIn the case that it does, this bill would simply require a brief  justification in writing from a contracting officer before they exclude  over 60 percent of American workers who do not have a 4-year degree  from the chance to compete.\n\nMr. Speaker, I thank the lead Democratic cosponsor of this bill,  Representative…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700119/skills-based-federal-contracting-act-of-2025"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…Effects:\n\nContains intergovernmental mandate? No.\n\nContains private-sector mandate? No.\n\nH.R. 2189 would amend the definition of firearm in the Gun       Control Act of 1968 to exclude certain nonlethal projectile       devices. Under current law, people who violate this Act could       be subject to criminal penalties. Criminal penalties are       recorded…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700039/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "Mr. CLOUD. Mr. Speaker, I rise today in strong opposition to H.R.  2550.\n\nThe proposed legislation is designed to nullify President Trump's  lawful executive order to exclude agencies with national security  missions from collective bargaining agreements.\n\nArticle II of the Constitution is crystal clear: The executive power  is invested in the…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697985/protect-americas-workforce-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "Mr. WILLIAMS of Texas. Mr. Speaker, I move to suspend the rules and  pass the bill (H.R. 2066) to amend the Small Business Investment Act of  1958 to exclude from the limit on leverage certain amounts invested in  smaller enterprises located in rural or low-income areas and small  businesses in critical technology areas, and for…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697259/investing-in-all-of-america-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…considers       appropriate.\n\n(d) Scope of Report.--The Assistant Secretary shall--\n\n(1) limit the report required by subsection (a) to mobile       service networks;\n\n(2) exclude consideration of 5G protocols and networks in       the report required by subsection (a);\n\n(3) limit the assessment required by subsection (b)(1) to       vulnerabilities…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693423/understanding-cybersecurity-of-mobile-networks-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…recommit.\n\nSec. 2.  Upon adoption of this resolution it shall be in       order to consider in the House the bill (H.R. 2262) to amend       the Fair Labor Standards Act of 1938 to exclude certain       activities from hours worked, and for other       purposes. All points of order against consideration of the       bill are waived. The amendment in the nature…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…plain language  of the amendment passed, by the way, over the objections of the  Democratic Party. We know from the congressional debate that its  authors understood it to exclude foreign nationals who are merely  passing through the country.\n\nThe question of our time is whether those who have illegally entered  our country in defiance of our laws and…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688130/birthright-citizenship"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…President is required to notify  Congress if China poses an immediate threat to Taiwan's security. If  this notification is triggered, my bill states that it is U.S. policy  to exclude Chinese representatives from key international organizations  such as the G20, the Financial Stability Board, and the Basel Committee  on Banking Supervision.\n\nThis bill sends…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699845/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…a company files for an IPO, they often spend tens of millions  of dollars to gather and compile information to submit to the SEC.  These mandatory information requirements exclude or dissuade many  companies from even considering an initial public offering.\n\nThe study required by Mr. Himes' bill will help Congress and the  market better understand the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693907/middle-market-ipo-cost-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…choose,  this could create differing approaches and confusion. The bill simply  requires that grantee servers include this essential screening tool.  The code says include, not exclude or only.\n\nThis bill, as amended, preserves VA's flexibility to ensure the best  results for veterans who are seeking mental health services in their  most desperate moments.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691509/no-wrong-door-for-veterans-act"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…be subject to--\n\n(A) valid existing rights; and\n\n(B) such terms and conditions as the Secretary determines       to be necessary.\n\n(2) Exclusion.--The Secretary shall exclude from the       conveyance under subsection (a) any Federal land that       contains significant cultural, environmental, wildlife, or       recreational resources.\n\n(c) Payment…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693918/la-paz-county-solar-energy-and-job-creation-act"}]