[{"senator": "Donald Norcross", "party": "Democrat", "sentence": "…would talk about the very issue that I spoke about  earlier. Earlier this year, President Trump launched one of the largest  attacks on labor in U.S. history by signing an executive order to strip  Federal workers of their collective bargaining rights.\n\nFor more than 60 years, Federal agencies under both Democratic and  Republican administrations have…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697802/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…arts, after-school, and athletics.\n\nAmani honored four outstanding individuals at their recent gala: John  Howard, Stephanie McCaine, Charles Stern, and Johnayia White. The  executive director, Debra Stern, who was founder of the Friends of the  Mount Vernon Public Library and president of the Mount Vernon PTA  Council, leads the school as executive director…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696952/amani-public-charter-school"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…national security necessity to restore this  program, but it is a constitutional necessity as well because the  legislative branch has the authority to pass budgets and the executive  must execute on them.\n\nI will continue to speak on this floor every day until this program  is restored.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695817/lifesaving-food-aid"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…University School of Nursing where he has focused on health information  technology and the implementation of evidence-based practice. Dr.  Ferrara previously served as the Executive Director of the Nurse  Practitioner Association New York State, where he played a key role in  removing state barriers to NP practice. Dr. Ferrara has been recognized  for…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690400/recognizing-the-service-of-dr-stephen-a-ferrara"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…deeply concerning. The  separation of powers is a cornerstone of our democracy. Each and every  day Federal judges work as a check on the powers of both the  legislative and executive branches, regardless of who is in charge.  This is a good thing and something each and every one of us should be  working to protect.\n\nInstead, our colleagues across the…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689013/supporting-federal-judiciary-and-judges"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…his nose definitively at a Court ruling, then his attacks on democracy  are troubling but not lethal. It is normal politics up until that  dramatic confrontation between the executive branch and the judicial  branch, for which the Constitution, as we know, really has no  prescribed remedy.\n\nFor many Americans, they may breathe a sigh of relief that America's…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…refused at every  turn to perform meaningful oversight of this administration, to push  back on Trump's worst impulses, and to exert Congress' Article I powers  against the executive's repeated overreach. In the context of the NDAA,  there hasn't been a single oversight hearing scheduled in the House or  Senate to address the ongoing misuse of our military…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…reality. Like so much of his agenda, it  doesn't add up, and everything he does is rooted in a sweetheart deal  for his wealthy contributors.\n\nBack in February, he signed the Executive order declaring an energy  emergency. That is the subject of today's floor action. The emergency  declaration has nothing to do with energy dominance, but it has  everything…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696128/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…stakeholder engagement so the whole rest of the process, as it goes  forward, is accelerated; disciplining the despised-by-me interagency  process mechanism that excuses so much executive branch delay and  indecision. I was actually pretty pleased with the way the process was  going.\n\nOff of Rhode Island, we are developing offshore wind. Our offshore  wind…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…concerns about  endless American wars. I know many of you have questioned open-ended  military commitments that lack clear strategic objectives. You have  consistently opposed Executive overreach by previous Presidents in the  manner of war.\n\nThese SOUTHCOM operations look like the beginning of exactly that  kind of entanglement, and we are being asked to…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…acknowledged that President  Trump has been overruled by judges more than the last three Presidents  combined, and that is because he is insistent on extending an overreach  of the executive branch. We have the courts to safeguard that.\n\nWhat the Republicans are trying to do is to require every single  person who has been harmed in any way to file individual…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689780/role-of-the-judiciary"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…communities.            Sincerely,                                         Juliana E. Morris, MD, EdM                                __________\n\nMy name is Colin O'Leary, I am the Executive Director at       Laurel Ridge Rehab and Skilled Care around the corner in       Jamaica Plain and I want to thank you for your time this       morning. Laurel Ridge is a…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…democratic future for  Venezuela and policies that return war powers to the United States  Congress, as enshrined in the United States Constitution.\n\nThat is why I and the executive board of the Congressional Hispanic  Caucus will propose a forward-looking framework for a democratic and  stable Venezuela. As members of the Congressional Hispanic Caucus,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698765/venezuela"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Home Rule Act. This bill would remove the  authority of the Commission of Fine Arts (CFA) over non-federal real  property in the District of Columbia.\n\nUnder presidential executive orders (EOs) and federal law, the CFA  has review authority for D.C.-owned parks and buildings, as well as for  certain private land in D.C. Under EOs, the CFA has review…", "date": "2025-07-07", "source_url": "https://justfacts.votesmart.org/public-statement/1693244/introduction-of-the-commission-of-fine-arts-district-of-columbia-home-rule-act"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…effectuated through NCUA's       Call Report update and was announced by NCUA's chairman in an       agency press statement. NCUA is an independent federal agency       within the executive branch. Second, the withdrawal of the       Reporting Requirements is of future effect because it       describes changes to the information certain FICUs are       required…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…IMF in 1980. As James M. Boughton has noted in       his Silent Revolution: The International Monetary Fund 1979-      1989, even as the PRC was seated, the United States Executive       Director to the IMF, Sam Y. Cross, expressed support on       behalf of the United States Government for ``some kind of       association between Taiwan and the Fund''.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…and it hasn't stopped, as evidenced by the tragedy in Boulder,  Colorado, earlier this week.\n\nThankfully, President Trump is taking action to restore the rule of  law with executive orders that stop the Federal subsidization of areas  that refuse to comply with immigration laws.\n\nThis legislation, in part, codifies those efforts and the work  already…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692097/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "Mr. JOYCE of Pennsylvania. Mr. Speaker, President Trump issued an  executive order last week to prioritize the development of the U.S.  warfighter.\n\nPresident Trump has made significant strides toward strengthening the  United States' military capabilities,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698913/significant-strides-to-strengthen-united-states-warfighters"}, {"senator": "Mike Turner", "party": "Republican", "sentence": "…support that this bill invests in the  National Endowment for Democracy.\n\nDuring my time in Congress, I have worked very closely with the  National Endowment for Democracy's executive director, Damon Wilson,  who is a great leader in democratic efforts throughout the world, and I  can attest to the important work done under his leadership.\n\nThe National…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699043/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…colleagues oppose this bill, they are voting in favor of the largest  tax increase on working families in American history, plain and simple.\n\nFrankly, we need Pennsylvania's executive office and State agencies  to get on board with this progrowth initiative, as well. Mr. Speaker,  let's thank every entrepreneur, employer, team member, and small  business…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690760/national-small-business-week"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…worked directly for  the chief of the Integrated Personnel Pay System--Army (IPPS-A) program  and later returned to the 101st Airborne to serve as its Chief of  Operations and executive officer for battalion operations. For his  outstanding service, Rob has earned two Bronze Star Medals, three  Meritorious Service Medals, the Army Commendation Medal with…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694101/recognizing-the-service-of-major-robert-coleman"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…is in question.\n\nEvery Member of this House has a duty to uphold the Constitution's  system of checks and balances by exercising its Article I powers  entrusted to us.\n\nThe executive's military exercise to capture the leader of Venezuela  represents one of the most blatant usurpations of congressional  authority we have seen in modern times. If we ignore…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699373/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Protecting Women and Girl's Sports in California\n\nMr. KILEY of California. Mr. Speaker, today, I am calling on  California Governor Gavin Newsom to immediately issue an executive  order to protect women and girls sports in California and ask the  legislature for legislation codifying in law that men shall never  compete in women's sports in California…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…reversed this decision  against the wishes of Alaskans and finalized a new RMP that enshrined  Public Land Order 5150.\n\nOn his first day in office in 2025, President Trump issued Executive  Order No. 14153 on ``Unleashing Alaska's Extraordinary Resource  Potential,'' which directly called for repealing the Biden  administration's central Yukon RMP. This CRA…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…served in  Vietnam were unfairly denied the ability to apply for land allotments  due to their service overseas. While Congress took steps to correct  this injustice, the executive branch, until recently, has been slow  processing applications and conveyances, leaving many veterans in  limbo.\n\nAs of January 2025, out of more than 2,000 eligible veterans,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693425/land-conveyances-for-alaska-native-vietnam-veterans"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…continue this work.\n\nOn behalf of my colleagues and staff on the Committee on House  Administration, I wish Derek Harley all the best as he begins his new  role as the Chief Executive Officer of the Congressional Institute. I  thank him for his service to the United States House of  Representatives.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696851/thanking-derek-harley-for-his-service-to-the-house"}, {"senator": "Tim Sheehy", "party": "Republican", "sentence": "The PRESIDING OFFICER (Mr. Sheehy). Under the previous order, the  Senate will proceed to executive session and resume consideration of  the following nomination, which the clerk will report.\n\nThe bill clerk read the nomination of Terrance Cole, of Virginia, to  be Administrator…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694056/executive-calendar"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Mr. BARRASSO.  3424, which is at the  desk.\n\nThe clerk will report the bill by title.\n\nThe senior assistant executive clerk read as follows:\n\nA bill (S. 3424) to amend titles 11 and 28, United States       Code, to modify the compensation payable to trustees serving       in cases under…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697876/bankruptcy-administration-improvement-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…agriculture. Here  is what the law says. The law says that coming into this country  without authorization is categorically illegal.\n\nThen it is within the discretion of the executive branch how to  prioritize deportations. Across party lines, there has always been a  strong focus on prioritizing those with criminal records. Beyond that,  different Presidents…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…explicit authorizing legislation from Congress.  The Supreme Court has also recognized Congress' power to coin money and  regulate the value thereof, implicitly denying to the executive branch  or to the Fed the ability to do this without congressional authority.\n\nThat said, I think it is prudent to explicitly deprive the Fed of the  authority to do this…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693730/anti-cbdc-surveillance-state-act"}]