[{"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…what it says it is going to do and continues  funding ready-to-use therapeutic food.\n\nI am not asking the administration to change their policy. We are  asking them to just execute on their stated policy, and do what they  said they were going to do, which is: Continue the funding. Resume the  flow of aid. Save the lives of malnourished children around…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691610/global-report-on-food-crisis"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…year. A large portion of       those funds go to Child Nutrition Programs, See Penn Decl.       Doc. No. 14-2 \f 30. To make them available for SNAP, USDA       would need to execute its discretionary authority under 7       U.S.C. 2257. Much of the public discussion of Section 32       misunderstands the funding; Congress has designated uses for…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…documenting and  standing up to human rights abuses carried out by authoritarian regimes  against their own people.\n\nLet me say this plainly: A functioning democracy does not execute  people in the street. That is the kind of thing you see in North Korea,  Mr. Speaker, or Iran; not in the United States of America.\n\nIt is beyond the pale. In my view, this…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…does not address the breach of trust that this  administration has demonstrated since January.\n\nThey have failed to follow the law, and we cannot trust that they  will even execute this bill if we vote on it today.\n\nMr. BISHOP. They cut SNAP by 20 percent in the big, ugly bill this  summer, dismantled and defunded Federal programs, fired Federal  workers,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696744/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…are  insufficient and for the Joint Chiefs of Staff to detail the size, the  scope, and the expected duration of deployment and certify that the  forces to be deployed can execute the mission.\n\nAnd it provides for judicial review. It ensures that courts can  prohibit flagrant abuse--not substituting their judgment for the  President's but review whether…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…knows--maybe there  will be a third imaginary stop work order that drops. But in an  environment like that, where the executive branch refuses its  constitutional duty to faithfully execute the laws, it doesn't make any  sense for us to continue negotiations on a major bipartisan bill.\n\nI want to say, in particular, that Chair Capito has been helpful,  thoughtful,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…programs are vital to the success of our combatant  commanders' relationships with their counterparts.\n\nCutting these funds would lessen the ability of our Armed Forces to  execute their missions. For these reasons, I oppose this amendment, and  I ask my colleagues to do the same.\n\nMr. Chair, I yield 30 seconds to the gentleman from California (Mr.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…has no idea how to do that.\n\nAt an Energy and Commerce Committee hearing in April, we heard from  FERC that they do not currently have the staff expertise or resources  to execute this bill properly.\n\nThis bill is also a bad solution in search of a nonexistent problem.  FERC confirmed for us that they have not even seen issues with State  clean water…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Chicago.\n\nIn that unsigned order, the majority of the Supreme Court wrote,  ``The Government has failed to identify a source of authority that  would allow the military to execute the laws in Illinois.''\n\nThis is good news, and we should recognize the significance of this  moment: Even the Supreme Court's conservative supermajority refused to  greenlight…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698781/operation-midway-blitz"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…apparently those carrying citizens from other neighboring countries.\n\nThe administration has even admitted they don't know each individual  identity of those targeted. To still execute legal strikes is a  reckless and dangerous use of our powerful military.\n\nAs Trump considers expanding strikes to include land targets within  Venezuela--that is what we are…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696566/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…does not do.  The full-year CR is a law that sets funding levels for the full year.  The President and executive branch have a legal and constitutional duty  to faithfully execute the CR. The CR does not change the underlying law  making the Trump administration's impoundments and mass firings  illegal. This is true as a matter of law.\n\nNothing in the…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688900/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…discussed this bill 2 years ago, David Ortiz, then FERC's  Director of the Office of Electric Reliability, testified before the  Energy and Commerce Committee that FERC couldn't execute on the bill  because FERC does not have the capacity to assume other agencies'  expertise. That was before FERC lost 11 percent of its staff-- hardworking public servants--due…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…While President Trump was addressing us last night on this very House  floor, movements were being made by the Chief of Staff for Veterans  Affairs, Christopher Syrek, to execute a detrimental reduction in force  at VA. With the support of this administration, VA plans to move  forward with firing an additional 83,000 VA employees.\n\nSitting in the…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688505/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…the most  formidable fighting force the world has ever seen, and I am proud and,  frankly, not surprised that all elements of our military worked  together to successfully execute such a dangerous and difficult mission  in Caracas. The skill, professionalism, and courage are beyond question  of these men and women.\n\nBut military capability is not the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Venezuela.\n\nBy late summer, President Trump had signed a secret directive  ordering the Pentagon to conduct maritime strikes on drug boats.  Secretary Hegseth then signed an execute order, or EXORD, directing  lethal military strikes against alleged drug boats. He has refused to  submit that EXORD to Congress despite legal requirements for him to do…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…Resolution. Even if you believe the War Powers Resolution is  constitutional, these troops were in and out of Venezuela in a couple  of hours.\n\nOnly the United States could execute such a dangerous and difficult  mission without the loss of a single American life. But instead of  celebrating Maduro's ouster and America's success, our Democratic  colleagues…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…continue now that they  are members of the Cabinet.\n\nOur success has had a direct impact on President Trump's agenda. With  his team in place, President Trump has been able to execute effectively  and efficiently.\n\nThe Senate has also acted decisively to secure the border. Within  days of taking office, Senate Republicans passed the Laken Riley Act.  The…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688471/joint-session-of-congress"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…little bit  about that in a moment. They need additional resources to be able to do  their tasks, and they need additional authorities to be able to make  sure they can fully execute the law that is put in front of them.\n\nSomething that was interesting--the multiple times I have been to the  border the last several years--often the Border Patrol would…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…proposition that the new American Government should vest the war-making  powers with the President.\n\nSo this one man from South Carolina rose and said, not only should  the President execute the war, he should initiate the war also.\n\nBut others stood up. Elbridge Gerry, a delegate from Massachusetts,  was so aghast by Butler's suggestion that he rose to say that…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…to vote--illegal immigrants or fraudsters--to vote  for them. That is the truth.\n\nSo we have now the most secure border in the history of our country,  and we are trying to execute on the immigration laws that we have on  the books that have been voted for by Republicans and Democrats alike,  and Presidents of both parties have enforced those laws.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…of computers to create a ledger       of verified information among network participants;\n\n(B) linked using cryptography to maintain the integrity of       the ledger and to execute other functions; and\n\n(C) distributed among network participants in an automated       fashion to concurrently update network participants on the       state of the ledger…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692733/deploying-american-blockchains-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Administration's shortfall crisis  manufactured by the Biden administration cost the government billions  of dollars, increasing the frequency of these conversations will help  Congress execute its constitutional oversight and appropriations  responsibilities.\n\nWhile leadership in the Biden White House was replaced with the  veterans-first Trump administration by…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Commendation Medals, as well as the  Navy/Marine Corps Achievement Medal.\n\nAs he steps into the role of Commanding Officer, I know that  Commander Russell will continue to execute vital maritime patrol and  reconnaissance missions with precision and uphold the highest  traditions of Naval Aviation.\n\nMr. Speaker, Commander Russell is a true patriot and…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690861/change-of-command-daniel-russell"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…groundwork for the responsible deployment of new  technologies at sea.\n\nThrough this legislation, the United States Coast Guard will possess  the assets and personnel it needs to execute its safety, enforcement,  and national security missions.\n\nFinally, I thank the committee's ranking member, Rick Larsen; Coast  Guard and Maritime Transportation Subcommittee…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697805/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Israel is one of America's greatest allies, a bastion of freedom in  the Middle East, and our closest partner in countering Iran's  destabilizing efforts in the region.\n\nTo execute on President Trump's ironclad support of Israel, we  urgently need a qualified ambassador in the region. I have no doubt  Governor Huckabee is that person, and he will work…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689827/9999"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…hobbyist. The ATF thinks he has  done something wrong. Instead of just going and visiting him, coming to  see him, picking him up at his work, taking him back to his house to  execute the warrant, the search warrant, no, they had to kick in his  door, predawn raid, 10 cars pull up. The first thing you see on the  doorbell cam is them putting tape on the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691031/expressing-support-for-local-law-enforcement-officers"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…also restore the integrity of and faith in the law  enforcement of the District of Columbia.\n\nFor instance, this law stripped law enforcement officers of many  tools needed to execute their duties safely and without fear of  retribution, as well as limited their options in situations of life or  death.\n\nIt also created new opportunities for antipolice activists…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696934/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…have dragged out actually got more than 60 votes here on the  Senate floor.\n\nThe American people gave President Trump a mandate, and he deserves  to have his team in place to execute that mandate for the American  people. Democrats can continue to drag this process out, but  Republicans are going to get these nominees confirmed.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693870/trump-administration"}, {"senator": "Anna Luna", "party": "Republican", "sentence": "…Congress the right to vote. Some of the  American people might be surprised that if you are a female Member and  you have a child, that you can't vote. This means you can't execute  your constitutional authority.\n\nFor almost 2 years now in this cause I have met with leadership. I  have exhausted all tools in my legislative toolkit to be able to bring…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689415/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…appropriated to       the Department of State or the United States Agency for       International Development may be used to develop, design,       plan, promulgate, implement, or execute a policy, program, or       contract that knowingly uses goods, wares, articles, or       merchandise mined, produced, or manufactured wholly or in       part in the Xinjiang…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690654/no-dollars-to-uyghur-forced-labor-act"}]