[{"senator": "Ron Wyden", "party": "Democrat", "sentence": "…ready to sabotage the independent oversight of inspectors  general. Meanwhile, it has been crickets from Republicans. They are  just happy to let him do it.\n\nNo nominee has exemplified the assault on independent oversight quite  like March Bell, the nominee to serve as Health and Human Services  inspector general.\n\nI would be remiss if I didn't start off…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697900/9999"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…extraordinary individual from Rochester,  NY, whose commitment to service and leadership continues to uplift our  Jewish community: Nathan (Nick) Robfogel.\n\nNick Robfogel has long exemplified civic responsibility, compassion,  and tireless devotion to the betterment of our region. As Chair of the  Board of Trustees of the Max and Marian Farash Foundation, he…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691612/recognizing-nick-robfogel"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…focused on prosecuting hate crimes, civil  rights violations, and crimes committed against our most vulnerable  populations.\n\nMr. Barron's incredible value to Maryland is exemplified by a case of  federal-local partnership that led to a major crime bust. Ivan Bates,  Baltimore's State's Attorney, approached Mr. Barron for assistance in  getting the federal…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688210/recognizing-a-trailblazing-career-in-criminal-justice-us-attorney-erek-lawrence-barron"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…named the NextGen Rochester Young  Philanthropists of the Year, a testament to their shared commitment to  giving back. Across these roles and recognitions, Orlando has  exemplified a steadfast devotion to advancing our community and  preserving cultural heritage.\n\nIt is with great pride and admiration that I recognize Orlando Ortiz  during Hispanic…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695838/recognizing-orlando-ortiz"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Templeton Award.\n\nThis award underscores his ground-breaking environmental advocacy and  unique ability to merge both scientific and spiritual discourses. His  All-Holiness has exemplified a sense of responsibility towards coming  generations: to preserve, protect, and promote the health of the planet  on which we are honored to live.\n\nBeyond his environmental…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696019/appreciating-the-presence-and-contributions-of-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…faiths. His  visit reminds us that our Nation is strongest when we work together in  mutual respect, despite our differences.\n\nThroughout his ministry, His All-Holiness has exemplified how faith  can contribute to a just and peaceful planet. He has unapologetically  spoken out against violence, international terrorism, and the  degradation of the environment.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695506/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Braves  Double-A team to our city.\n\nJudy was a truth-teller, always voting her conscience, earning the  respect and admiration of those she served.\n\nThroughout her life, Judy exemplified a commitment to service, a  trait she inherited from her parents, who were both devoted to their  community--her father as the Columbus District Fire Chief and her  mother…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690837/in-memory-of-the-honorable-judy-thomas"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Historian, National Hospital Chair,  National Honors and Awards Chair, and Vice President at all levels, as  well as two terms as National Sergeant of Arms--roles in which she  exemplified leadership, humility, and heartfelt service; and\n\nWhereas, her steadfast volunteerism, including at the Sandusky Ohio  Veterans Home, and her continued leadership as President…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690126/proclamation-for-national-amvets-auxiliary-president-cindy-rice"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today to ask my colleagues to join  me in congratulating Adelyn Kim. Adelyn is a member of Girl Scouts of  Michigan Shore to Shore, Troop 4255. She has exemplified extraordinary  leadership, innovative problem-solving, and a demonstrated commitment  to making a lasting, positive impact by earning the most prestigious  award in Girl…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693242/recognizing-adelyn-kim"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…become a steadfast supporter of the military community. He displayed  exemplary work ethic and was widely known for his commitment to  ``taking care of the customer.''\n\nVictor exemplified service and dedication to the military community,  he carried this same unceasing devotion to serving those around him.  Brown Bear Car Wash backs National Guard and Reserve…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697600/recognizing-victor-odermat"}, {"senator": "Frederica Wilson", "party": "Democrat", "sentence": "…moral obligation to confront and       reject Jew-hatred in all its forms; and\n\nWhereas, the first official recognition of ``#EndJewHatred       Day'' on April 29, 2022, exemplified a united stand against       Jew-hatred, empowering collective action towards a future       characterized by fighting racism and bigotry with       understanding and equality;…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690399/proclaiming-this-and-every-april-29th-as-endjewhatred-day"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…worked tirelessly to advance and  professionalize a workforce that is indispensable to the well-being of  families. Through every role she has held, Lucia Colindres has  exemplified what it means to lead with both vision and heart by  strengthening Rochester, uplifting families, and building a legacy of  service that will endure for generations.\n\nIt…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695844/recognizing-lucia-colindres"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…Before taking this office, and once sworn in, Alan provided me wise  counsel sharing pragmatic, solutions-oriented advice on how to be of  service and make change.\n\nAlan exemplified community spirit and dedication to others, business  acumen, incredible generosity, friendship, and, of course, leadership.  He represented the best of Rhode Island, and…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693984/recognizing-arthur-coia-of-rhode-island"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Unfortunately, the proclamation also highlighted how the  administration is trying to use national parks to tell a myopic and  narrow view of our history. This revisionist turn is exemplified by  President Trump's decision to rename Mount Denali in Alaska despite  overwhelming criticism and concern from Alaska Native leaders and other  voices in the State. It…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690404/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…I rise today to ask my colleagues to join  me in congratulating Hannah Davis. Hannah is a member of Girl Scouts of  Michigan Shore to Shore, Girl Scout Juliette. She has exemplified  extraordinary leadership, innovative problem-solving, and a  demonstrated commitment to making a lasting, positive impact by earning  the most prestigious award in Girl…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693151/recognizing-hannah-davis"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "Mr. SESSIONS. Mr. Speaker, I rise today to recognize and honor a dear  friend, Marshall Brachman, on the occasion of his 75th birthday on July  6, 2025.\n\nMarshall has long exemplified the best of civic engagement and public  service. His remarkable career spans more than four decades, beginning  in 1978, and is defined not only by professional success…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693060/recognizing-the-75th-birthday-of-marshall-brachman"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…life lived at the  crossroads of world events.\n\nEven in his nineties, Allen embraced new adventures as he continued  to inspire students and veterans alike. Captain Brady exemplified the  values of patriotism, courage, and honor.\n\nIn his words: ``We will always need people who are willing to serve  their country . . . willing to give their lives defending…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691271/congratulating-northwest-florida-state-womens-basketball-team"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…the  hospital. Additionally, under John's leadership, the WellSpan  Chambersburg Hospital has implemented state-of-the-art security  systems.\n\nThroughout his career, he has exemplified what a true healthcare  administrator brings to the equation.\n\nMadam Speaker, I congratulate John on his retirement.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690998/delivering-on-president-trumps-agenda"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…40  years of service at Principal Financial Group. From his first role in  the retirement division to serving as Chairman, President, and Chief  Executive Officer, Dan has exemplified steady leadership, a deep sense  of responsibility, and a commitment to doing right by others. His  career reflects the integrity and work ethic that define our state.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695028/recognizing-the-service-and-leadership-of-dan-houston"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…forever shine brightly in the hearts of  all who were blessed to know her.\n\nMay Gia rest in peace and may we all strive to live each day in the  spirit of kindness that she exemplified.", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689204/gia-deborah-gentile-leaves-behind-a-legacy-of-kindness"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…for 2025 by the Sunbelt Ag Expo. This distinct honor is for  his decades of dedicated service to farming, conservation, and  community.\n\nFor over 40 years, Jeff Wilson has exemplified the very best of what  it means to be a South Carolina farmer. He is hardworking, he is  innovative, and he is deeply committed to preserving the land and the  legacy of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695599/recognizing-jeff-wilson"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…its position  as one of Bucks County's most recognizable destinations, balancing  tourism with quality of life for those who call the borough home. Mayor  Keller's service exemplified integrity, approachability, and a deep  respect for local government's role in serving the public.\n\nAfter years of dedicated service, Mayor Keller leaves a lasting  impact…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699203/congratulating-larry-keller-on-his-service-as-mayor-of-new-hope-pennsylvania"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…rise today to recognize  the 75th anniversary of St. Mary's Rotary Club, a cornerstone of  service in our community since 1950.\n\nFor 75 years, the St. Mary's Rotary Club has exemplified the Rotary  motto  of Service Above Self through countless projects supporting local  schools, awarding scholarships, and promoting youth leadership.\n\nTheir commitment to…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690205/recognizing-st-marys-rotary-clubs-75th-anniversary"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…pleasure to join her loved ones in honoring Sylvia's long  and admirable life and in reflecting on the profound impact she has  made on all who know her. For Decades, Sylvia has exemplified steadfast  dedication to her family, her community, and her church.\n\nIn 1945, Sylvia married the love of her life, Charles Howard  Thornton, and embraced her calling as…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697547/recognizing-sylvia-marie-thornton-on-her-98th-birthday"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…life while living in  Florida. That dedication only deepened after he and his family made  Buckingham Township their home. For more than three decades, Paul  Calderaio has exemplified the very best of local civic leadership,  devoting his time, energy, and experience to strengthening his  community.\n\nA resident of Buckingham Township since 1955, Paul…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698361/9999"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…Medical  Services immediately sprang into action to assist counties in desperate  need.\n\nThis spirit of service is what makes Western North Carolina truly  special. It is exemplified by neighbors showing up in times of crisis,  ready to lend a helping hand and stand together during the darkest of  days. The Clay County Sheriff's Office deployed officers…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693201/recognizing-the-sheriffs-office-and-emergency-medical-services-of-clay-county"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…to reside.\n\nDuring a legislative hearing in the Federal Lands Subcommittee,  Jackie Gingrich Cushman, the chair of the Adams Memorial Commission,  testified: ``The Adamses exemplified strength of character, belief in  God, and the importance of family, education, and public service. John  Adams and his family demonstrated that ideas, hard work, and  determination…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697633/adams-memorial-great-american-heroes-act"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…Nevada. Mr. Speaker, I rise today to ask my colleagues  to join me in congratulating Faith McCrea. Faith is a member of Girl  Scouts of the Sierra Nevada, Troop 1306, and has exemplified  extraordinary leadership, innovative problem-solving, and a  demonstrated commitment to making a lasting, positive impact, by  earning the most prestigious award in Girl…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691494/recognizing-faith-mccrea-gold-award"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…Mr. Speaker, I rise today to ask my colleagues to join me  in congratulating Dakota Partelow. Dakota is a member of Girl Scouts of  Gulf Coast Florida, Troop 608, and has exemplified extraordinary  leadership, innovative problem-solving, and a demonstrated commitment  to making a lasting, positive impact, by earning the most prestigious  award in Girl…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690441/recognizing-dakota-partelow-gold-award"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "Mr. STEUBE. Mr. Speaker, I rise today to ask my colleagues to join me  in congratulating Wyatt Dickinson. Wyatt is a member of Boy Scout Troop  776 and has exemplified extraordinary leadership, innovative problem- solving, and a demonstrated commitment to making a lasting, positive  impact, by earning the most prestigious rank in Scouting--the…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693623/recognizing-wyatt-dickinson-eagle-scout"}]