[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…million in USAI. We  blocked the President's misbegotten efforts to pull troops out of  Eastern Europe in this moment and really reassert the ability of our  committee to exercise oversight. We have a fence on the travel budget  for Secretary Hegseth until he follows the law and releases the videos  for all of the boat strikes that are going on right…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…faith. Preventing agencies from obligating such  large sums seems an abdication of this bipartisan agreement, and  Congress thus expressed strong opposition to this precise exercise last  year. Furthermore, the U.S. Government Accountability Office's December  2018 legal opinion concluded that the Congressional Budget and  Impoundment Control Act does…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694158/senate-amendment-to-hr-4"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…am sure there have been times when       it was, and I was privileged to witness some of those       occasions.\n\nOur deliberations today, not just our debates but the       exercise of all our responsibilities--authorizing government       policies, appropriating the funds to implement them,       exercising our advice and consent role--are often lively…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Machado and  Edmundo Gonzalez. And now our President has committed to running  Venezuela for years in order to exploit its oil resources.\n\nToday, we have the opportunity to exercise the power bestowed on us  by our Framers to authorize the use of force--or decline to do so--but  to reassert some constraint on an Executive grown too fond of the use  of…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699093/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…certain circumstances. It takes what should be an  apolitical process, a neutral review of the reliability of our Nation's  electric sector, and twists it into a fully partisan exercise. That is  why we should reject this bill entirely.\n\nRight now, a number of Federal agencies have authorities that could  impact the power sector. FERC and the Department of…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…opportunity to stand in, and they would not give him or her an  opportunity to do so.\n\nArresting people who are in this country legally--people whose only  crimes have been to exercise their right to free speech--is an assault  on our civil liberties and our Constitution.\n\nAn attack on these individuals is an attack on all of us. Who is to  say what this…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690503/trump-immigration-policies"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Republicans want to force every American to provide burdensome and  expensive ``documentary proof of citizenship''--similar to what  Minnesotans already rejected--in order to exercise their right to vote.\n\nCongress should be following Minnesota's lead and working to make it  easier for Americans to vote, not putting up roadblocks. Congress  should pass…", "date": "2026-02-13", "source_url": "https://justfacts.votesmart.org/public-statement/1700083/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…uniform are in dangerous locations to protect  our fundamental rights, perhaps the most fundamental right is to vote,  and yet this legislation would impair their ability to exercise that  right.\n\nElection integrity is essential to our democracy. That is why  Democrats vigorously support Federal funding and Federal anti-cyber  interference in our elections.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…of your own  party, you want some context.\n\nThere is no context that justifies this action.\n\nAlex Padilla is not required to be impeccable in every single way in  order  to exercise his responsibilities as an American and as one of the two  that represents California in the U.S. Senate. This is the stuff of  dictatorships.\n\nOne of the officers who throws…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692449/alex-padilla"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…so that billionaires could get another small tax break?  No. What he did was deploy ICE to make mass arrests and terrorize  families in Los Angeles.\n\nWhen people went to go exercise their First Amendment rights, he  deployed the National Guard and then the United States Marines against  the American people.\n\nThis is not only a distraction, this is a direct…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692301/protecting-our-nations-capital-emergency-act"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…Donald Trump and Russell Vought trample on this  Congress' power of the purse. Some will admit that. Some will say it  silently.\n\nIf there were ever a time for this Congress to exercise that power,  it is now. Let us pass five bills on which we have agreement and  substantially restrain and stop the funding of DHS a week from this  Friday. Then, let us come…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699570/consolidated-appropriations-act-2026"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Of course, I am doing so on behalf of my  incredible constituents in southeast Michigan, but also for all the  residents of Michigan and this great Nation for, you see, the exercise  of our democracy is ensconced and inscribed here in our House Chamber  and on our House floor. We use both our voice and our vote to move our  Nation forward.\n\nAs you so…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…consequences.\n\nHow will this administration tell Putin that he does not have the  right to assert the same control over its proclaimed sphere of  influence or that Xi cannot exercise his will unchecked in the Indo- Pacific, including with respect to Taiwan? The United States should be  countering this vision of a world based on spheres of influence with…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698621/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "Mr. COURTNEY. Mr. Speaker, in 2025, with growing global maritime  threats, it is particularly important for Congress to exercise its  constitutional mandate to ``provide and maintain a Navy.'' The Seapower  portion of this bill accomplished that goal.\n\nFor example, the bill includes a plus-up of $5…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697788/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…the history of the United States of  America, which was a functioning democracy when the President took  office for this term, we may  find ourselves with an inability to exercise the constitutional right  of free speech.\n\nYou have to see what is coming. You have seen what he has done,  calling all of the generals in, all of these high-ranking officers.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Special Operations Regiment and Marine Aircraft Group 29.\n\nIn 2013, Timothy reported to 2nd Battalion, 9th Marines, where he  deployed to Okinawa, Japan, and participated in Exercise Forest Light  and the Korean Marine Exchange Program--strengthening joint  capabilities and international cooperation.\n\nFollowing this assignment, Timothy transitioned to…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693985/recognizing-united-states-marine-sergeant-major-timothy-babcock-as-august-2025-veteran-of-the-month"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…(c) Sanctions Described.--The sanctions that may be imposed       with respect to a foreign person under subsection (b) are the       following:\n\n(1) Property blocking.--The exercise of all powers granted       to the President by the International Emergency Economic       Powers Act (50 U.S.C. 1701 et seq.) to the extent necessary       to block and prohibit…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690679/economic-espionage-prevention-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Slope is the federally recognized regional tribal government       for the North Slope and represents over 14,000 Inupiaq tribal       members. The mission of ICAS is to exercise its sovereign       rights and powers for the benefit of tribal members, to       conserve and retain tribal lands and resources including       subsistence. For millennia…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…our insured population alive and healthier.\n\nWe do things. We reward them for doing these data rings, or putting  things on their wrists, or how they eat, or we gamify some exercise,  and talk about how much healthier the population is. For them, it is a  profit model. Turns out, if you sell life insurance, the longer someone  keeps making their premium…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…away this essential transparency  measure in the early days.\n\nThe reality is that reforming the regulatory state begins with  identifying its true magnitude, and that is an exercise which Congress  simply cannot do alone.\n\nThe deregulatory agenda President Trump instituted, which resulted in  the creation of the SBA Office of Advocacy's Red Tape Hotline,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697347/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…following:\n\n(1) Asset blocking.--Notwithstanding the requirements of       section 202 of the International Emergency Economic Powers       Act (50 U.S.C. 1701), the President may exercise of all       powers granted to the President by that Act to the extent       necessary to block and prohibit all transactions in all       property and interests in property…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692720/sanction-sea-pirates-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…President, it seems no matter how       incoherent and disastrous the foreign policy from the       Democrat President, [the] Democrat Senators don't want the       Senate to exercise its authority.\n\nI would argue today is evidence that both sides are guilty of this. I  would argue that if Gaza was a war, that bombing of the Venezuelan  capital and removal…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699091/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…prioritize deportations. Across party lines, there has always been a  strong focus on prioritizing those with criminal records. Beyond that,  different Presidents have chosen to exercise that discretion in  different ways.\n\nFor example, President Obama chose to deport millions of people  during his time in office. It is ultimately a matter of how the  President…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…codify that retirement plan sponsors must make investment  decisions solely based on economic factors and financial returns.\n\nAdditionally, the bill states that the decision to exercise a  shareholder right is subject to the purchase and loyalty duties under  ERISA. It states that proxies held by ERISA plans must be voted in the  economic interests of the…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699156/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…interprets, or prescribes law or       policy when the action creates new regulations, changes       regulatory requirements or official policy, or alters how the       agency will exercise its discretion, among other things. The       2022 ROD prescribes policies for future uses of the covered       area, the NPR-A, and includes restrictions on certain uses,…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694269/us-government-accountability-office-legal-opinion"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…to read as follows:       ``Sec. 70504. Governing body\n\n``(a) Board of Directors.--The board of directors is the       governing body of the corporation. The board may exercise, or       provide for the exercise of, the powers of the corporation.       The board of directors and the responsibilities of the board       are as provided in the bylaws.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697185/foundation-of-the-federal-bar-association-charter-amendments-act-of-2025"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…businesses who want to  and should be able to keep their hard-earned money in their pockets to  reinvest in their families, communities, and businesses.\n\nThe House must swiftly exercise its constitutional responsibility to  oversee the District of Columbia and reject this misguided legislation  from going into effect.\n\nI urge my colleagues on both sides of…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…(1) Property blocking.--Notwithstanding the requirements of       section 202 of the International Emergency Economic Powers       Act (50 U.S.C. 1701), the President may exercise of all       powers granted to the President by that Act to the extent       necessary to block and prohibit all transactions in all       property and interests in property…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694815/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…to       the appropriate congressional committees, not less frequently       than annually, a periodic evaluation in writing that--\n\n``(A) assesses the effectiveness of the exercise of such       authority in resolving the covered national emergency;\n\n``(B) considers the views of public- and private-sector       stakeholders; and\n\n``(C) discusses any…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694826/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Blocking of property.--Notwithstanding the requirements       under section 202 of the International Emergency Economic       Powers Act (50 U.S.C. 1701), the President shall exercise all       authorities granted under the International Emergency       Economic Powers Act (50 U.S.C. 1701 et seq.) to the extent       necessary to block and prohibit all…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}]