[{"senator": "Ed Case", "party": "Democrat", "sentence": "…Hawaii's citizen soldiers and airmen and their  Philippine counterparts has steadily progressed, encompassing  humanitarian assistance and disaster relief, joint training exercises,  strategic planning and multilateral regional engagement.\n\nThe 25th anniversary of this agreement showcases an important and  long-lasting commitment to mutual security,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695815/recognizing-the-25th-anniversary-of-the-hawaii-national-guards-state-partnership-program"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…maintaining the readiness of our military troops, an advantage  that is unique to the U.S. military.\n\nThe military has even used ESA-listed wildlife to add complexity to  training exercises, treating them as sensitive infrastructure to avoid  as they would for schools or hospitals in another environment.\n\nThis amendment not only erodes this longstanding work,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695231/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the District of Columbia  Clemency Home Rule Act, which would give the District of Columbia  exclusive authority to grant clemency for D.C. crimes. Currently, the  president exercises the authority to grant clemency for D.C.  crimes, though presidents rarely do so. D.C. residents deserve a say in  whether their fellow residents deserve mercy. In the 117th…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696036/introduction-of-the-district-of-columbia-clemency-home-rule-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…individuals and their communities.\n\nDOD's HIV-AIDS prevention program pairs health and security  assistance to provide care and treatment in concert with military  training, exercises, and humanitarian activities.\n\nThis amendment would eliminate a successful military-to-military HIV- AIDS prevention, care, and treatment efforts in more than 55 countries.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…to be able to report, for solutions to be  able to be found, for lines that prevent unacceptable conduct to be  clearly delineated.\n\nBut that can't happen unless Congress exercises its oversight  ability.\n\nOK. We have Chapter 8. So we are headed back to the book, and the  book is this book, ``How Democracies Die.'' And with each chapter, I am  trying…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…just completed another massive military exercise  to not only blockade Taiwan but to stop any reinforcements from coming  into Taiwan. Then they conducted offensive military exercises off the  shores of our allies the Philippines and Australia. Their navy went all  the way around Australia just a couple of weeks ago.\n\nFriedman naively references Chinese…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…certainly a rising  military power.\n\nWe know that China, Iran, and Russia have conducted joint naval  drills in the Middle East, called the Maritime Security Belt 2025.  These exercises took place in the Gulf of Oman near the strategic  Strait of Hormuz, the narrow mouth of the Persian Gulf through which  nearly a fifth of all crude oil traded in the world…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688807/cormick-and-mmcr-fettermanhagerty-kim-cormick-schumer-sullivan-fetterman-and-others-for"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…to such law enforcement agencies       regarding implementing countermeasures, such as traffic       control measures and rapid vehicle containment protocols.\n\n(iii) Joint exercises and training programs to enhance       interagency preparedness and response.\n\n(iv) Efforts to equip law enforcement, first responders,       and private sector partners…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…plea bargains.--Subject to       paragraph (5), with respect to charges and specifications       alleging any offense over which the Chief Prosecutor of the       Coast Guard exercises authority, the Chief Prosecutor of the       Coast Guard shall have exclusive authority to, in accordance       with this chapter and with chapter 47 of title 10 (the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…unauthorized access to DOD facilities.\n\nIn 2023, five Chinese nationals were caught in my district at Camp  Grayling, Michigan, photographing military vehicles during allied  exercises and attempting to conceal the evidence that they did take  those photographs. This was not innocent trespassing. It was a  deliberate act threatening servicemember safety…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695145/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…exercising       terrorists       to plan and carry out terrorist attacks against IDF troops       and the State of Israel,'' the IDF stated.\n\n``As part of the terrorists' exercises and training at       these military sites, the terrorists carried out drills for       gunfire combat and the use of various weapons,'' it added.\n\nThe Israeli military said…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…provide unique training environments, restricted airspace, and  infrastructure that cannot be replicated elsewhere. They are essential  for Arctic operations, brigade-level exercises, missile defense  testing, and joint training with our allied forces.\n\nThe importance of this legislation cannot be overstated. It is vital  that we continue to allow the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697636/public-lands-military-readiness-act-of-2025"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…measures. That means environmental reviews and limits on  land use, construction, and water management. All those delay vital  infrastructure projects and constrain training exercises during  breeding seasons.\n\nOn top of that, Fort Huachuca must carry out ongoing monitoring,  predator control, and habitat management, all under ESA guidelines,  which impose…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695254/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…that time. Danny flew special  missions world-wide including flights into Vietnam, followed by  European and Middle Eastern trips supporting our Nation's Cold War  military exercises. He also flew into other various conflicts such as  the Israel-Jordan Crisis, and across the world to Pakistan, Ethiopia,  Panama, Greenland, and Libya. Danny had the privilege…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696328/recognizing-danny-charles-masur-with-a-congressional-veteran-commendation"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…rejuvenation. He has made it clear he  is willing to use force to make that happen.\n\nThe warning signs are in plain view. China is ramping up aerial  incursions, conducting illegal exercises that simulate a blockade  around Taiwan, threatening sanctions against Taiwanese industries, and  relentlessly targeting Taipei with economic and political intimidation.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690686/taiwan-assurance-implementation-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…nationwide injunctions are highly  disfavored. There was a time that people across both sides of the aisle  here recognized that.\n\nA certain judge named Boasberg continually exercises those nationwide  injunctions, and that wouldn't necessarily be a problem, except he has  repeatedly displayed bias and partisanship.\n\nFor instance, without substance or…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699047/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…expense  of the American taxpayer by invoking an existing legal authority.\n\nH.R. 2550 directly threatens that progress by overturning the  President's executive order that exercises one of the few tools  available to him under the law to more effectively manage the Federal  workforce.\n\nNow, it is no secret that accountability problems in the Federal…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Xi has ordered the  People's Liberation Army to be ready to do so by 2027, of course,  escalating tensions in the Indo-Pacific and engaging in provocative  joint military exercises with Russia.\n\nNotwithstanding the chaos around the world, America was suffering  direct consequences from the drug war, as I alluded to a moment ago.  Cartels in Mexico and…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…China escalated military pressure against  Taiwan by 300 percent last year. Commander Paparo explicitly warned  that these ``aggressive maneuvers around Taiwan are not just exercises.  They are dress rehearsals for forced unification.''\n\nIt is imperative that the full weight of the United States stands  firmly and publicly against these provocations.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690685/taiwan-assurance-implementation-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…required of the Rules Committee and the difficult discussions  when deliberating amendment decisions. The Rules majority believes in  meaningful lawmaking, not partisan messaging exercises. We do not need  to come up with partisan messaging amendments at the last minute in  order to score political points or manufacture floor fights but,  instead, focus on…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}]