[{"senator": "Jim Himes", "party": "Democrat", "sentence": "…would know that socialism is different than communism. The chairman  and I both come out of a highly capitalist industry, banking. There are  socialist countries that have exhibited horrors, like Denmark, like  Finland, any other number of socialist countries. Communism, in fact,  if this resolution said communism, I suspect we wouldn't even have to…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697156/denouncing-the-horrors-of-socialism"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…hate,  undermine[d] our democracy, and dissolve[d] our Republic, that he is  impeached for high crimes and misdemeanors, and that the following  Articles of Impeachment be exhibited to the United States Senate.''\n\nThey were first exhibited to the House. The House took a vote. One  hundred forty persons voted for the impeachment. We had another 47, I…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…misdemeanors.\n\nResolved, That Donald John Trump, President of the United States, is  impeached for high crimes and misdemeanors and that the following  Articles of Impeachment be exhibited to the Senate:\n\nArticle of Impeachment exhibited by the House of Representatives of  the United States of America in the name of itself and of the people of  the United States…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…their faith and  their Creator compels them to do.\n\nI am not surprised that President Trump would propose this. The  language and the rhetoric and the behavior that he has exhibited toward  even legal refugees, legal immigrants to this country lead me to not be  surprised that this important funding is on the chopping block in the  bill that he has sent…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693592/rescissions-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…invidious hate,  undermine our democracy, and dissolve our Republic, that he is  impeached for high crimes and misdemeanors, and that the following  articles of impeachment be exhibited to the United States Senate:\n\nArticles of impeachment exhibited by the House of Representatives of  the United States of America in the name of itself and of the people of…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697872/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…to challenge you and say to you that this is not the  appropriate thing to do. So, yes, he has the characteristics of a de  facto dictator with dictatorial behavior being exhibited.\n\nAs a result, the moment of truth is upon us. Next week we shall have  the opportunity to stand on the principles that I believe were  exhibited when we were campaigning,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690862/and-still-i-rise-impeaching-president-trump"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…ask a  question and for the Senator from Oregon yielding to me.\n\nMr. BLUMENTHAL. First of all, I want to thank him for his leadership,  his fortitude, and his determination exhibited so eloquently over these  last 24 hours. He is really providing a model for all of us in standing  up and speaking out.\n\nLet me say that after listening to the eloquent words…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696345/trump-administration"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…damaged, and subjected to despicable acts.\n\nMembers of Congress and their staffs feared for their lives. Some of  the insurrectionists waived Confederate battle flags and exhibited Nazi  symbols, and some brave American citizens died. A Republican Senator,  Ron Johnson, said that by and large it was a peaceful protest.\n\nNow, Mr. Speaker, this was not…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…1977 to 1993 in this House. She was the first Democratic woman elected  to Congress from Ohio.\n\nMary Rose was elected from the heart of the working class of people.  She exhibited raw courage, loyalty, perseverance, high learning,  precious humor, and stellar insight into human nature. Her hearty  giggle elevated people's spirits, and she suffered…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695548/moment-of-silence-for-mary-rose-oakar"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…would respond. Would an outsider president who considered       himself to be under unwarranted assault lash out, as happened       in Peru and Turkey?\n\nPresident Trump exhibited clear authoritarian instincts       during his first year in office. In Chapter 4, we presented       three strategies by which elected authoritarians seek to       consolidate…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…well  illustrates, any American or reasonable person looking at that would  say: Why is Russia picking on such a small country?\n\nThe fierce fighting that the Ukrainians have exhibited through  bravery against that is profound.\n\nI am just so honored, and I know the gentlewoman feels the same way,  to have met President Zelenskyy and so many of his advisers,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Speaker, I rise today to mourn the loss of  Richard ``Dick'' Wallace.\n\nDick was a man who led a captivating life growing up in Alexandria,  Virginia. From a young age, he exhibited an exceptional musical talent,  often playing intricate pieces by ear on multiple instruments.\n\nDick was an Eagle Scout, God and Country, and Order of the Arrow in  Boy Scouts.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691783/recognition-of-richard-dick-wallace"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Emancipation Hall;       and\n\n[Whereas Douglass was a pioneer in journalism who broke       through glass ceilings throughout one of the most crucial       times in American history, exhibited great perseverance to       become an American hero, and became a legend known in the       House Press Gallery: Now, therefore, be it]\n\nWhereas Frederick Douglass was born…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…from Pinewood Christian to  earn the GIAA Class 3A baseball State championship and made history for  their athletic program.\n\nUnder Head Coach Tim Orlosky, these young men exhibited persistence,  sportsmanship, and humility in their title run.\n\nMr. Speaker, join me in congratulating this team of incredible young  men and everybody who supported them…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692453/frederica-academy-baseball-team"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…totality. We should look at  the difficulty of the task that we asked the chairman and the ranking  member to do. We should thank them for the hard work and wisdom that  they both exhibited in bringing this product to the floor.\n\nMr. Speaker, I do worry about the rhetoric around this bill. I  personally believe it is not intentional, but it is reckless  encouraging…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699354/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…here illegally and Federal law enforcement was handcuffed  by the Biden administration to actually enforce our immigration laws-- so much so that the rhetoric that had been exhibited at that time now  has carried over, and you see fire bombings, and you see attacks on ICE  officials, attempts to dox them, to destroy their families and their  reputations…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696003/unanimous-consent-requests"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…which soon became internationally  acclaimed. It attracted people from across the world. This July will  mark the 62nd annual Trans-Tahoe Regatta.\n\nThe Tahoe Yacht Club has exhibited endurance and resilience over the  past century, briefly closing over COVID-19 but overcoming the  challenges of that time to reopen to a wave of new members. Today, the…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…a moment to acknowledge those who have sacrificed much and  devoted all to safeguarding our country. This year, Texas' Third  District is saluting brave veterans who have exhibited remarkable  service, leadership, integrity, and dedication. These veterans  represent true role models within our community, deserving our utmost  respect, acknowledgement,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696747/recognizing-veterans-in-texas-third-congressional-district"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…and I am eternally grateful.  I know I speak for the American people in thanking Mr. Cole for his  leadership.\n\nI thank my colleagues for this bipartisanship that has been exhibited  by this package. A ``yes'' vote today takes us one step closer to  restoring the confidence that the American people should have in this  Congress.", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699577/consolidated-appropriations-act-2026"}]