[{"senator": "Al Green", "party": "Democrat", "sentence": "…such that this person could get  due process. It hasn't happened.\n\nThe lower courts have told him at the Federal level, the Supreme  Court has told him, and the evidence now exists that he understands  what facilitate means because there was a second person who was removed  without due process, removed to another country without due process,  and that…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…folks  that have active cases and arrest warrants for the people running their  country.\n\nWe can go back and forth about whether or not we think the ICC is  legitimate, but it exists. It exists to prevent what is actually  happening right now. I think it is important that if we are going to be  consistent about whether or not we are protecting American…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689027/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…of thing does not happen in  democracy. It doesn't.\n\nThe only way to protect Americans from these abuses is to provide due  process to anyone facing deportation. Due process exists to protect  American citizens and to protect all of us from wrongful deportation  and wrongful detention.\n\nThis administration does not seem to care about this complete and…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693019/ice-turns-courthouses-into-traps"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…the impact and the consequences of unilateral military  action; an administration that openly disdains and threatens a free  press, ignoring the fact that our fourth estate exists to ask questions  for the people, even if those questions are uncomfortable--especially  when those questions are uncomfortable--and shine a light on the places  where tyranny…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Jared Golden", "party": "Democrat", "sentence": "…the flow of legislation, no one here believes they should  have absolute power to determine which bills see the light of day and  which don't.\n\nThe discharge petition process exists to give Members of Congress  some agency. It is a release valve to ensure that good bills with broad  support cannot be held up forever by a leadership team. It gives us a…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697864/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…price hike.\n\nSo I say to my Republican friends: You have to get your heads out of  the sand. This is a real problem for families. Later is way too late,  and I don't think it exists.\n\nThe majority leader just said that families don't know that they get  this. There is something wrong with that? They find out that their  healthcare--that they are being…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696460/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…objectives does not guarantee beneficial  long-term outcomes, and executing a successful raid does not constitute  a plan for governing a nation of 28 million people.\n\nCongress exists to provide oversight and scrutiny of the executive  branch, not to cheer from the sidelines. I commend our servicemen for  their performance last weekend, but I am deeply concerned…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…tragedy. It is now clear that the  administration fired key FEMA personnel during and, sadly, after the  tragedy. So, today, it is very clear: This is a systemic problem that  exists in Texas, extends beyond Texas, beyond the National Weather  Service, and across FEMA.\n\nHere are the facts about FEMA: A day after the Texas flooding, FEMA  laid off workers--hundreds…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693517/central-texas-floods"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…does it do that? It does that by adding $4.1 trillion to the  deficit--one bill, one act of Congress, $4.1 trillion piled on our  national debt.\n\nThere is another law that exists on the statute books of the United  States of America, the Statutory Pay-As-You-Go Act. What does that do?  It requires a look at bills that create enormous additions to our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695699/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…analysis tools,  communication platforms, and training--all that is necessary to do the  job of addressing the kind of threat or violence that President Trump  seems to feel exists there. There was no such professional force,  locally or statewide, when the Ninth Congress passed the original  Insurrection Act.\n\nToday, in the 119th Congress, the problems…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…care. While we  did not win this battle, the fight is not over. The power of the people  is always greater than that of the people in power.\n\nAs long as discrimination still exists and as long as there are those  who seek to undermine existing law, the purpose of the ADA will not  have been completely met. It is our job to make sure that happens.", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694026/recognizing-the-22nd-annual-disability-pride-parade"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…other Republican on the Rules  Committee voted against displaying a plaque to honor the law  enforcement officers who were here on January 6. That plaque, Mr.  Speaker, already exists. Congress already passed a law to create it,  and the Speaker just refuses to display it.\n\nWhy? Why would he refuse to do it?\n\nI know why, and we all know why. It is the same…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…Speaker, I thank Congresswoman Hayes for bringing us  here tonight.\n\nMr. Speaker, America, this country, has long promised that every  child has a right to learn. That promise exists because parents, not  just this Chamber, parents, refused to give up on their children's  future.\n\nMr. Speaker, one of those parents was my mother, Vicki Simon. I was  born…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698945/protecting-education-for-children-with-disabilities"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…A President  who seeks to seize control of elections is attacking the constitutional  order itself, and that is precisely the kind of abuse of power for  which impeachment exists, not as a partisan weapon but as a  constitutional safeguard against the usurpation of the electoral  process in our  country by a would-be King, Donald Trump.\n\nThat is what…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700022/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Black families, that Black women have been the mothers of  movements, that Black folks have endured redlining and pay disparities,  and yet, still, we rise.\n\nBlack brilliance exists in every corner of this Nation, from the  stage to the court to the classroom to the Halls of Congress. I want  every single person, certainly every single child who calls…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689876/trumps-attacks-on-black-history"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…class of firearms  regulated under the NFA, the constitutional foundation for applying the  NFA's transfer and registration requirements to those zero-tax firearms  no longer exists. These requirements now improperly operate without any  corresponding exercise of Congress' taxing power.\n\nAs the Supreme Court upheld the NFA's provisions only as ``in aid''…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697383/restoring-second-amendment-rights"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…cuts, offsets to spending, and revenue increases. Yes, there  are actually tax increases in a Republican bill, but overall, we are  creating a very competitive tax rate that exists.\n\nCompanies from 2017 on have reinvested in the U.S. and, at the same  time, have reinvested in their communities, reinvested in their  employees, and have grown their presence.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the biggest  scandals in our State's history, which is that Governor Newsom is  literally bankrupting Medicaid in our State. He is driving it insolvent  through a policy that exists nowhere else in the country, in no other  State, a policy of offering free, comprehensive, universal Medicaid, or  Medi-Cal as we call it, to the entire population of illegal…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…Government to  reopen.\n\nIn the last Congress, I was the chair of the subcommittee that wrote  the appropriations bill. Roughly, $32 billion went to USAID--an Agency  that no longer exists. Some of you may remember DOGE--an Elon Musk-led  effort to get into and tear up and, in the case of USAID, to tear apart  our longstanding, decades-old, U.S. foreign assistance…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696237/9999"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…communities,  respect others, and become engaged, responsible citizens.\n\nThat is why I am proud of the work we are doing with the bipartisan  Congressional Scouting Caucus. This group exists to strengthen and  support Scouting programs across the country and to highlight the  incredible impact Scouts have in each of our districts.\n\nMadam Speaker, I invite my colleagues…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694209/recognizing-the-congressional-scouting-caucus"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…2023, 1,200 people, most of which were Jews, but not all,  people from dozens of countries, including Americans, were attacked and  killed.\n\nWe focus on Hamas, but Hamas only exists because Iran funds and  supports it. Just as we saw President Trump free the last American  citizen who was being held hostage because of Iran, those problems and  challenges…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691211/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…facilities were destroyed utterly,  and they were wiped out. They were obliterated.\n\nNow that doesn't mean that the threat from Iran is over. The desire  of the regime still exists, and we will have to deal with Iran down the  road. But on this vote, I think, we all need to vote no because what we  are doing here, if we don't watch it, is having 535 Commanders…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693122/motion-to-discharge-sj-res-59"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…activated and  when the public was welcome to use deactivated airspace. They were  given 6 months to do that. Mr. Speaker, this is not reinventing the  wheel. This delivery already exists for temporary flight restrictions.  This would just be extending it to the restricted areas.\n\nMr. Speaker, 4 years later now, the DOD and the FAA have still not  acted on this.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695111/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…and discretion under its statutory       mandate to develop land use plans for public lands and the       government's mineral estate. Because the GSENM's legal status       exists independently of the Grand Staircase RMP, provisions       that affirm the Proclamations do not change the RMP's       fundamental character--an agency level administrative…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700255/us-government-accountability-office-decision"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…suffering at the hands of a bureaucracy and  the tyranny of government-run health management rather than the ability  to get care.\n\nThe current situation with respect to healthcare exists entirely by  record of vote and a record of policies because my Democrat colleagues  put forward policies that the American people are having to live under  today.\n\nThey broke…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…great uncertainty. So this accommodates  the realities on the ground.\n\nIf this fix were overturned, Indiana would revert to older limits  designed for a fleet that no longer exists, so, in practice, that means  less operating room during heat waves and higher costs right when our  citizens need power the most--all of our citizens.\n\nHoosiers are already…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695511/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-emissions-budget-and-allowance-allocations-for-indiana-under-the-revised-cross-state-air-pollution"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…true liberty. The basis of our political systems is the right  of the people to make and to alter their constitutions of government.  But the Constitution which at any time exists, until changed by an  explicit and authentic act of the whole people, is sacredly obligatory  upon all. The very idea of the power and the right of the people to  establish…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700270/president-washingtons-farewell-address"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…are talking  about potentially hundreds of billions of dollars that could be going  toward Medi-Cal for our own residents that is instead going toward a  reckless policy that exists nowhere else in the country, which is only  going to entice more people who are here illegally to come to  California, thereby, increasing the cost even more.\n\nBy the way,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…and less in  return.\n\nNow, Mr. Speaker, I will examine one of the reasons why that is the  case. I will take a moment today to look at the vast waste, fraud, and  abuse that exists in the State of California and the proposal that I am  working on to bring the full scale, extent, and breadth of it to light  so that we can work to address it using every…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…it has been the policy of the Federal Government that we don't  dispose of land anymore, so that threat has been removed. The need for  a President to move quickly no longer exists, and the act is just being  used to create land policy that couldn't get through Congress.\n\nThe process matters when it comes to land management. We need to take  back the…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689196/work-highlights-of-western-caucus"}]