[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Americans to vote until the Supreme Court gutted it in Shelby v.  Holder because it said that Congress had not created enough of a record  to show that voter suppression still existed on the basis of race.\n\nHowever, just like those delegates in the 1902 Virginia convention,  who, when asked: Well, when we give these literacy tests, how will we  know if…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689341/fighting-voter-suppression"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…assigned       power to admit new states and has never interfered with       Congress's admission of a state, even when potentially       legitimate constitutional objections existed. For example, in       1863, Congress admitted into the Union West Virginia, which       had been part of the State of Virginia, in potential       violation of a provision…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…You have to move to that era.\n\nThat homework gap is the cruel chasm that separates students who have  reliable internet access at home from those who don't. It is a gap that  existed long before the COVID-19 pandemic, but it was laid bare when  schools closed and kids were forced to learn from kitchen tables and  living rooms. For some, the transition…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…approach led  to a steady decline in Venezuela's role as a major drug transit route.  It relied on stopping vessels, inspecting cargo, and arresting suspects  where evidence existed. This Administration has shamefully abandoned  that lawful and effective approach in favor of bombing boats and  committing extrajudicial killings at sea. There is no operational…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698324/supporting-the-war-powers-resolutions"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Assessment of Educational Progress (NAEP) data, schools are struggling  to make up for lost time in the classroom following the COVID-19  pandemic. Achievement gaps, which existed before the pandemic, have  widened. According to that assessment, math and reading gaps between  higher- and lower-performing students continue to rise, as Black  students…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…implementing policies  that are expected to drive at least 30,000 public servants out of the  VA by the end of the year, while refusing to fill 40,000 vacancies that  have existed before he took that position.\n\nThose 30,000 who will be out of the VA by the end of the year include  1,720 registered nurses, 600 doctors, 1,150 medical support assistance,…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694542/9999"}, {"senator": "Greg Casar", "party": "Democrat", "sentence": "…21, 2025, NBC4 Washington also reported that the  Metropolitan Police Department determined that probable cause to arrest  Representative Cory Mills for misdemeanor assault existed and sent an  arrest warrant for Representative Cory Mills to the United States  Attorney's Office for the District of Columbia; however, then-Acting  United States Attorney…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695580/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…they  are doing, because this isn't a time to play around. This  administration hired as the director of FEMA somebody who never even  knew whether or not a hurricane season existed, somebody who has no  experience in this area.\n\nHomeland Security Secretary Noem put in place measures, cost-cutting  measures, that catastrophically impacted what the response…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693655/tragic-storms-in-texas"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…called e- bond's from the Middle East through its New York World Trade Center  offices by denominating them in dollars. It also ran a London Office.  Had the London office not existed on 9-11, it is likely the U.S.  financial bond markets would have collapsed that day. Chaos would have  reigned across our entire financial markets.\n\nBy way of history, Ronald…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Mr. Speaker, I understand that my colleague, Representative Luna, has  done everything she can to try to find a path forward, and this is  ultimately the only option that existed at the end.\n\nYet, this does not address the real barriers that people continue to  face. This would be the last week that I could have been home, still  working in my district,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689709/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…political theater. The Gulf of Mexico has held that name for over 500  years. Spanish explorers from Spain chartered these waters hundreds of  years before the United States ever existed. Let's call this bill for  what it is. It is a vanity project.\n\nMy constituents in California's San Joaquin Valley aren't asking me  about the Gulf of Mexico. They are asking…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690812/renaming-the-gulf-of-mexico-to-the-gulf-of-america"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…assigned       power to admit new states and has never interfered with       Congress's admission of a state, even when potentially       legitimate constitutional objections existed. For example, in       1863, Congress admitted into the Union West Virginia, which       had been part of the State of Virginia, in potential       violation of a provision…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…Arctic tundra  and the Coastal Plain.\n\nFor the many private interests that have sought to exploit these  sacred lands, it would be much easier if these species and Tribes never  existed. It would be much easier for them if the last remaining musk ox  hadn't survived the Ice Age or if the Porcupine caribou herd simply  went extinct, just to add a few dollars…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696905/defending-the-arctic-refuge"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…assigned       power to admit new states and has never interfered with       Congress's admission of a state, even when potentially       legitimate constitutional objections existed. For example, in       1863, Congress admitted into the Union West Virginia, which       had been part of the State of Virginia, in potential       violation of a provision…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…water.\n\nThe bottom line is that manufacturers didn't want this. They largely  rejected this move by President Trump  and didn't produce showerheads that exceeded the limit that existed.  That was because they knew that consumers value money-saving and water  conservation showerheads that are good for both their wallets and the  environment.\n\nEnergy and water…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…election of       directors.''.\n\nMr. Speaker, I rise in strong support of H.R. 3357, the Enhancing  Multi-Class Share Disclosures Act.\n\nMr. Speaker, multiclass structures have existed in American capital  markets for many decades, helping founders retain control of their  companies without holding a majority of the economic interest. These  structures are…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693913/enhancing-multi-class-share-disclosures-act"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…Today, I am asking that we pass four of them at the same time as a  modest step forward for the kind of open, Member-driven process for  which the Senate was built and has long existed.\n\nThe first, from Senator King of Maine, would expand access to the  Katahdin Woods and Waters National Monument--something that passed this  body unanimously last year.…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691666/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "Mr. CLINE. Mr. Speaker, back in November the American people issued a  resounding rejection of the profligate policies of the Biden-Harris  administration that existed over the past 4 years by electing President  Donald Trump.\n\nIn the first month of his new administration, President Trump has  answered this election mandate, signing executive…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688085/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…institutional consequences'' by the Senate not allowing GAO a veto over  the use of the CRA against Agency-submitted rules. I, on the other  hand, disagree. Such a GAO veto has never existed before, and we must  remember that the CRA is all about protecting the authority of elected  representatives over unelected Agencies. Delegating to the unelected  GAO staff…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…many times do you think  we have declared war since the founding of our Nation?\n\nI will give you the answer: Five.\n\nJust think about all of the military conflicts that have existed in  the history of our country, and we have only declared war five times:  the War of 1812, the Mexican-American War, the Spanish-American War  against Spain, World War I,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693122/motion-to-discharge-sj-res-59"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…diverted from more acute inpatient  settings. Additionally, 71 percent of follow-up appointments were  attended, a remarkable improvement from the 34 percent follow-up rate  that existed prior to the establishment of the UCC for individuals  referred from critical transition points.\n\nThis success was made possible in part through a strategic investment  of…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698647/recognizing-pasco-county-community-development-for-receiving-the-audrey-nelson-award"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…this government.\n\nI thank the President for his leadership. We stand with him in making  sure that the rule of law is finally followed, ending the  constitutional crisis that existed for the last 4 years.", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690709/constitutional-crisis"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…balances on.\n\nWhen they moved the original Obama subsidies--and those aren't going  anywhere. They are still in place. They are not expiring at the end of  this year. They have existed from the start. It is only the Democrat  Party's 2021 enhanced version that is expiring.\n\nThe worst aspect of those, in my opinion, is the fact that a person  used to be required…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…remarkable work supporting  victims of domestic violence.\n\nThe lifesaving Burleson victim assistance poster project began with  one powerful phrase: If I had known someone like you existed, I would  have gotten help sooner.\n\nFar too many women live in silence, unsure of where to turn,  especially while still under the control or surveillance of an abuser.  There…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693641/congratulating-aledo-bearcats"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…and related matters. My work covers both Republican  and Democrat administrations.\n\nDuring the Biden administration, the vetting process to safeguard  these children barely existed, putting them in harm's way. Today, I am  making public records obtained from the Trump Department of Health and  Human Services which illustrate the dire consequences of…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699108/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…telecommunication forums, and developing cybersecurity policy.\n\nAs the chairman has mentioned, Congress has not reauthorized NTIA  since 1992, before many of these responsibilities existed or were  relevant. This legislation ensures that NTIA has the right structure  and resources to fulfill its 21st century mission as directed by  Congress.\n\nToday's NTIA plays…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690256/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…patients, and the  millions of Americans suffering from rare diseases, scientific  advancements represent more than just medical progress--they offer hope  where none previously existed.\n\nThat hope would not be possible without the Orphan Drug Act, which  has served as the foundation for rare disease drug development for over  four decades. The Orphan Drug…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691696/support-for-the-orphan-drug-act"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…the President considered necessary to carry out       the statute's purposes. The President subsequently delegated       this authority to OMB. a OMB's involvement therefore existed       solely by virtue of that presidential delegation. Because the       President is not an ``agency'' under the APA, we concluded       that when an agency acts solely…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700255/us-government-accountability-office-decision"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…Speaker, Washington, D.C., is the Capital of  the United States. It should reflect the glory, the beauty, and the  grandeur of the most powerful civilization that has ever existed on the  face of the Earth.\n\nMr. Speaker, unfortunately, that is not the case under Democrat rule.  Under Democrat rule, especially in our Nation's Capital, we are forced…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695592/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…have failed.\n\nLet me ask the gentleman a couple of questions.\n\nPrior to the existence of Medicaid, there was no Federal subsidy at  all. This scheme couldn't have possibly existed in this way.\n\nMr. ROY. So Medicaid was created, and Medicaid was created to  ostensibly provide an avenue to healthcare for the poor and vulnerable,  right, as a broad statement.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690587/economic-anxiety"}]