[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…under a grace  period in the law, the funds evaporate at the end of the year. So in  other words, with no approval from the House or Senate, no new law  being passed, the existing law is undone on the clock. It is like-- well, it is like Cinderella's coach. It reaches midnight, and the coach  becomes a pumpkin. It falls apart. It disappears.\n\nThat is…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696665/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…people, our citizens,  our farmers, our businesses of dangers that might come? Cut them? They  are not waste.\n\nTheir recklessness is hurting rescue efforts. It has hurt the  existing ones, and it is going to hurt more in the future, unless they  reverse themselves.\n\nWe all support making Agencies like FEMA more efficient. Americans  support cutting waste.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693517/central-texas-floods"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…emissions that are killing  our planet. This bill, without an amendment, would gut the program that  sets these standards and pave the way for the administration to repeal  existing standards.\n\nIt is bad for our wallets. It is bad for our planet. It is just bad  policy. I cannot vote for the proposed bill as written, and I urge my  colleagues to do the…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700168/dont-mess-with-my-home-appliances-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…vehicles. Nothing could be further from the truth. The rule allows off- road vehicles on 388 miles of road within the park, only closing access  to approximately 6 percent of the existing roadways to protect  sensitive resources.\n\nEven those roads are still open to cars, jeeps, and other street- legal vehicles. They are just closed to vehicles that have the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690404/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…official  from unilaterally demolishing, selling, remodeling, or giving away the  buildings that we own as the American people. It restores enforcement  and accountability that existing laws already provide but that this  administration is ignoring, and it increases the penalties to ensure  accountability.\n\nMr. Speaker, the Supreme Court is on the verge of…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697854/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…National  Wildlife Refuge. They are home to caribou, salmon, and sheep species  that Alaska Native and rural communities depend on for food and  cultural traditions.\n\nThe existing RMP sets strong protections in response to declining  populations of these important species. It created 3.6 million acres of  areas of critical environmental concern.\n\nI…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694899/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…individualized       basis, and replacing it with a cash bail system which favors       release for wealthy defendants and imprisons those who cannot       afford bail, would deepen existing racial disparities and       disproportionately separate Black families from their       communities, jobs, and housing.\n\nThe District of Columbia has operated a successful…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696949/opposition-letter-led-by-the-american-civil-liberties-union-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…fairly demand from their government, and we should all be  working toward that challenge.\n\nWhen I helped lead NASA for President Obama, we constantly iterated  and improved our existing systems because we knew how important it was  to stretch the taxpayer dollar as far as it can go.\n\nTaking a sledgehammer and a chain saw to entire institutions that  allow…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691391/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…can't just say: I want to stop a  war that no one has contemplated and nothing is happening. So you have  to demonstrate imminence. You also have to show that there is no  existing congressional authorization authorizing the United States to  be at war--in this case, with Iran. That second criteria has been met.\n\nWe had a similar resolution on the floor…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…natural gas facilities in Mexico, which, again, will drive up utility  prices here at home in the United States.\n\nFinally, the bill creates a massive loophole allowing any existing  cross-border facility to expand without any review whatsoever. A  pipeline could be expanded by 10 times, dramatically increasing its  environmental impact, and there would…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…Inspection Service, states and  private agencies provide foreign importers with certainty regarding the  quality of the grain bought from U.S. farmers.\n\nWith parts of the existing U.S. Grain Standards Act set to expire on  September 30, 2025,  I am proud to be the lead Democratic cosponsor to reauthorize and  improve this law.\n\nThis bill before reauthorizes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695053/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…risks.  My legislation strives to find that solution and that balance.\n\nCurrently, the United States Forest Service allows utility companies  to cut down trees and branches in existing utility corridors. However,  the dead vegetation cannot be removed from Federal land without a  timber sale. This has created unnecessary red tape and led to the  buildup…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691069/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…among the  stained glass panels that portray the history of the United States.  D.C. residents deserve to have their history and American citizenship  recognized.\n\nThere is existing evidence that the D.C. seal should have been  depicted. The Members of Congress room in the Thomas Jefferson  Building, which is not open to the public, depicts the D.C. seal…", "date": "2025-11-25", "source_url": "https://justfacts.votesmart.org/public-statement/1697163/introduction-of-a-bill-to-require-the-library-of-congress-to-install-the-district-of-columbia-seal"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…the benefits of  those regulations at the time outweighed the costs.\n\nHad a regulatory budget been in place in 2020, it would have been  extremely challenging for SBA to cut existing regulatory programs to  offset the cost of the Paycheck Protection Program. Moreover, many of  the lending rules ensure accountability and fair access. Cutting them  to free…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697332/small-business-regulatory-reduction-act-of-2025"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…semiconductors.\n\nAt a minimum, given its tendencies to appease Russia rather than  pressure it, the Trump administration must maintain the current posture  of deterrence with the existing tools it already has. The better  approach is for this administration to also use the additional tools  offered by this legislation to deter further PRC shipments of dual-use…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690677/economic-espionage-prevention-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Palmdale is a ways away from L.A. It is about 37 miles  northeast of Los Angeles, so if traffic is good, it will take you an  hour in your car or 2 hours if you are using existing public  transportation.\n\nThink about this. You are taking our high-speed rail which, by the  way, isn't going to be that fast. It will probably be the slowest high- speed…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…unavailable for further consideration for leasing in order       to reduce greenhouse gas emissions.\\22\\ As such, BLM will not       accept new coal lease applications. However, existing coal       leases may be developed in accordance with lease terms and       conditions.\\23\\ The Miles City RMPA does not modify other       resource allocation management…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693085/us-government-accountability-office-legal-opinion"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…Code, and       veterans possess that are critical for supply chain careers       and any competency gaps that should be addressed;\n\n(B) opportunities to expand or enhance existing initiatives       for members of the Armed Forces eligible for preseparation       counseling under section 1142 of title 10, United States       Code, or veterans to become…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695018/transitioning-retiring-and-new-service-members-to-port-ocean-rail-and-truck-jobs-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…has  proven to be true. Democrats preferred to write the bill all by  themselves and then misrepresent to the American people about their  being able to keep their doctor or existing insurance plans.\n\nObamaCare was a massive failure that left Americans disappointed and  our healthcare system virtually bankrupt. Ignoring this reality,  Democrats came back…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…'60s, and I am  hopeful it will work again. I am confident it will, once implemented,  now in the 2020s.\n\nThe USDA is investing $21 million to help renovate and convert an  existing fruit fly facility in Metapa, Mexico. Once complete, this  facility is expected to produce an additional 60 to 100 million sterile  flies per week. With continued support…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699770/9999"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…other unfair or deceptive       acts or practices.\n\n(2) Requirements for study.--In conducting the study       required by paragraph (1), the Secretary shall examine--\n\n(A) existing and emerging uses of blockchain technology       that could help protect consumers, including by preventing or       mitigating fraud and other unfair or deceptive acts or…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693414/consumer-safety-technology-act"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…satisfactory to the       Secretary.\n\n(c) Terms and Conditions of the Conveyance.--\n\n(1) Requirements.--The conveyance under subsection (a)       shall be--\n\n(A) subject to valid existing rights;\n\n(B) made by quitclaim deed; and\n\n(C) subject to such other terms and conditions as the       Secretary considers to be appropriate to protect the       interests…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694030/wabeno-economic-development-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…rule in question, operators must comply with this blanket  mandate, even in areas with no known archeological risks, adding  millions in unnecessary costs and delays despite existing State and  Federal protections under the National Historic Preservation Act.\n\nEliminating this one-size-fits-all rulemaking will ensure that energy  production isn't bogged…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688630/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…help, real boots on the ground.\n\nMadam Speaker, entrepreneurs rely on them for practical guidance and  real-world help that works for their businesses. This bill builds on  existing efforts like America's SBDC AI U program and ensures that AI  support is consistent, accessible, and nationwide. It is not just in  major metro areas but in rural towns, manufacturing…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699180/ai-for-main-street-act"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…U.S.  export laws, and steal U.S. intellectual property.\n\nIt further requires a report on whether China is providing  significant support to Russia's military and updates existing law to  provide greater flexibility to pursue sanctions against China and other  foreign adversaries if they violate these export controls.\n\nThe PRC may publicly claim that…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690678/economic-espionage-prevention-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…approaches that allowed for  appropriate government use and dissemination.\n\nThe pilot program demonstrated that commercially provided datasets  can effectively complement NASA's existing capabilities. The ASCEND Act  builds on that success by authorizing the Commercial Satellite Data  Acquisition program within NASA's Science Mission Directorate.\n\nThis legislation…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700115/accessing-satellite-capabilities-to-enable-new-discoveries-act"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…Freedom. Mr. Speaker, any  soldier or veteran will tell you that service to the Nation takes many  forms, but that also means sacrifice does, too.\n\nWhen I learned that, under existing law, only the families of  soldiers who died in Active-Duty combat operations were eligible for  free lifetime national parks passes, I immediately thought of my friend  and…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691051/benefits-that-endure-for-lifetimes-of-service-act"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…to the 5-star rating, the Dole VA ranked first among 132  VA hospitals nationwide for access to specialty care. It offers the  shortest average wait time in the country for existing patients to see  a cardiologist--just 3.8 days. The Dole VA also ranks second in the  Nation for both routine specialty care access, at 95 percent, and  urgent specialty care…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690253/recognizing-the-robert-j-dole-va-medical-center-and-the-city-of-wichita"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…expeditious program of  competitive leasing of oil and gas in the Reserve'' to help boost our  energy security.\n\nWhat I just shared there is a word-for-word requirement from existing  Federal law, so this is what is in law: ``to conduct an expeditious  program of competitive leasing of oil and gas in the Reserve.''\n\nThe Department is mandated to do that…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "French Hill", "party": "Republican", "sentence": "…done on the Little Red River now  contributes $1.2 billion and 10,000 jobs to the Arkansas economy.  However, despite this beloved place in Arkansas' heritage, this river's  existing tail water trout fishery has been struggling for years.\n\nAfter careful conversations with the Arkansas Game and Fish  Commission, the Little Rock Army Corps of Engineers,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694859/energy-and-water-development-and-related-agencies-appropriations-act-2026"}]