[{"senator": "Jared Huffman", "party": "Democrat", "sentence": "…President Trump has undermined that work, vetoing this bill based on  unrelated policy disputes and a fundamental misunderstanding of Tribal  sovereignty.\n\nH.R. 504 would expand the Miccosukee Reserved Area to include Osceola  Camp, which would strengthen the Tribe's ability to self-govern and,  importantly, to address serious flooding concerns facing…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698657/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…go public.\n\nI urge my colleagues to support this bill. I think it is important  that we encourage companies to go public both so that they can get the  capital they need to expand their business and so that any person has a  chance to invest in these businesses and diversify their own portfolio.\n\nMr. Speaker, I urge my colleagues to vote ``yes'' on this…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692736/encouraging-public-offerings-act-of-2025"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…overreach. We understand that true security is built by  investing in people, and as Members of Congress we must actively build  that world through policies that defend and expand our rights and civil  liberties, not crush them. That is the work we must do, and we must  resist the fear that would tell us that we must surrender our rights  and forfeit…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697453/fighting-dhs-immigration-raids"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…nothing to address violent crime in  States with some of the highest crime rates in the country. In fact,  his administration has made things worse.\n\nTrump has opposed efforts to expand criminal background checks. He  has blocked attempts to reduce ghost guns and machine gun conversion  devices. His Department of Justice has gutted the number of inspectors…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695557/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…one without a full-service VA  hospital. My amendment before the House today would change that. It  will ensure the Trump administration follows through on its promise to  expand services to support a full-service VA medical center in New  Hampshire.\n\nIt is past time that we right this wrong and fill this gap.\n\nMr. Chair, I urge my colleagues here in…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692944/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Security, and for more than 40 percent of all  Social Security recipients, this is the only benefit that they have.\n\nRepresentative Stansbury is part of legislation that seeks to expand  benefits, not just protect Social Security. Congress hasn't acted on  Social Security and its expansion since 1971. Richard Nixon was  President of the United States.\n\nMr.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694190/hands-off-our-social-security"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…which, again, will drive up utility  prices here at home in the United States.\n\nFinally, the bill creates a massive loophole allowing any existing  cross-border facility to expand without any review whatsoever. A  pipeline could be expanded by 10 times, dramatically increasing its  environmental impact, and there would still be no review.\n\nIf Republicans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…am working with a bipartisan group of colleagues to  introduce legislation to make the lives and work of caregivers a little  easier. Together, we are introducing bills to expand access to tax-free  savings accounts to cover the costs of medical expenses, to improve  communication between Medicare and caregivers to streamline the  benefits process,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689770/hands-off-social-security"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…3424, the Shared Property Agency  Collaboration and Engagement Act of 2025, the SPACE Act.\n\nThis bill requires the Administrator of the GSA to develop new  criteria to help expand the use of office space sharing for Federal  agencies. By sharing amenities, space, and services, Federal agencies  can use shared-space arrangements to make the most effective…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695011/shared-property-agency-collaboration-and-engagement-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…and multilateral trade between the U.S.  and the Pacific Islands by authorizing a trade capacity building  initiative, authorizing the U.S. Trade Representative to work to expand  and diversify trade and directing the Secretary of Commerce to allocate  additionally Foreign Commercial Service Officers to the region.\n\nFurther, the BLUE Pacific Act supports…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693346/introduction-of-the-blue-pacific-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…proper oversight. That program was found to be  unlawful by the courts.\n\nThis bill would lawfully reinstate the depredation order for  aquaculture facilities. Further, it would expand coverage to 12 States  and allow the Secretary to add others as appropriate. The bill would  also include aquaculture lake managers and pond managers who face  similar challenges.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697640/cormorant-relief-act-of-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…rights obligations of the Department of Education, and  we know that a lot of the education laws that came about were signed by  President Johnson in the civil rights era to expand opportunities and  to close opportunity gaps.\n\nRight now, there are approximately 25,000 pending civil rights  complaints at the Office for Civil Rights, which has been gutted.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698126/dismantling-the-department-of-education"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…remind us that public safety  and public opportunity go hand in hand. I am proud to stand with them,  and I will keep working with my colleagues on both sides of the aisle  to expand the resources that make their mission possible.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692994/wilmington-police-athletic-league"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…been blatantly ignored  and courts denied access to potentially evidentiary information.\n\n``I am concerned these actions by the administration are simply a  trial balloon to expand Presidential authority without judicial or  legislative oversight in order to detain individuals at their will or  discretion. The constitutional checks and balances and our…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691184/letter-to-secretary-noem-and-secretary-rubio"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…Sub-Saharan Africa's economies and supports hundreds of thousands of  jobs across the continent and the United States. I can think of no  better way for America to continue to expand its trade relationships  with Africa than reauthorizing this very important piece of  legislation.\n\nMadam Speaker, I again ask my colleagues to vote in favor of this  reauthorization…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…order to accomplish the       following:\n\n``(1) Increase the technological and economic       competitiveness of industry and production in the United       States.\n\n``(2) Expand and increase the stability of supply chains       through enhanced domestic production, nearshoring, and       cooperation with allies.\n\n``(3) Achieve measurable greenhouse…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…dedicated service in the nonprofit sector and his  impactful tenure as President and CEO of Goodwill Industries of Central  Illinois. In this role, Johnson led the organization to expand  workforce development efforts and launched new initiatives aimed at  supporting some of the most vulnerable populations in Central Illinois.\n\nJohnson earned his Bachelor of…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693113/congratulating-don-johnson-on-his-retirement-as-the-ceo-of-goodwill-industries-of-central-illinois"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…resources into fuels and products that power everyday life.\n\nThe REFINER Act takes on a question that Washington has ignored for  far too long: Are we doing enough to protect and expand America's  ability to refine the energy we produce? Right now, unfortunately, the  answer is no, we are not.\n\nOver the last several years, America's refining capacity has gone…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697030/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…capabilities of AI systems are growing by the day.\n\nI think this is going to be a very important moment for us to look at  what is being done now and what we can do going forward to expand these  incredible learning opportunities to every child in America.\n\nSo you can tune into our hearing next Tuesday at 10:15 a.m. eastern  time.\n\nCelebrating the 100th Anniversary…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…global competition in space intensifies, our ability to support  our Nation's space-based assets has never been more crucial. We must  continue to invest in these capabilities, expand our launch  infrastructure, and ensure that our space assets in Alaska remain at  the cutting edge of technology. Whether it is weather forecasting,  global communications,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687923/space-dominance"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…regarding the role of petrochemical refineries in the  United States and their contributions to affordability, security, and  reliability. The report will assess opportunities to expand capacity as  well as current risks to refineries.\n\nH.R. 3109 will provide the Committee on Energy and Commerce the  information we need to enact policies to deliver affordable,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…and the Senate, respectively. I also recognize the work of  Representative Pete Stauber, who offered a thoughtful amendment during  our Natural Resources Committee markup to expand this bill to national  forests, refuges, and all public lands.\n\nMr. Speaker, I urge my colleagues to join me in supporting H.R.\n\nMr. Speaker, as we get ready to celebrate our…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697765/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…friend, Don Davis; Whip Emmer; Bryan Steil, and so many  more. There was just such a strong bipartisan leadership partner team.\n\nMr. THOMPSON of Pennsylvania. Mr. Speaker, I will expand for a minute  on the important protections included in the CLARITY Act. The CLARITY  Act includes strong protections for the developers of software.  Sections 309 and 409 make…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693788/digital-asset-market-clarity-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…mind for our  families.\n\nAmerica's future is shining brighter than ever. With the economic  policies of the One Big Beautiful Bill Act to lower costs, increase  wages, and expand job opportunities, I know America's industrial engine  will be unleashed to deliver a breadth of career empowerment not seen  at any time in our Nation's history.\n\nMadam Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694791/promises-made-promises-kept"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…American Recovery Initiative, President  Trump is elevating our national response by coordinating Federal,  State, and community resources. This action by President Trump will  expand access to treatment, to prevention, to long-term recovery, and  support millions of Americans and their families.\n\nThis initiative recognizes what addiction truly is, a chronic,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699740/confronting-the-disease-of-addiction"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…consumers are searching for relief. Repealing this out-of-touch energy  regulation will keep costs low for the American consumer and allow  small businesses to reinvest and to expand instead of being forced to  meet bureaucratic regulations.\n\nLet me put it very simply. This is exactly the type of regulation  that the American people voted against in November.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689125/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…America agenda alongside the Trump administration. It  is critical that we get the capital necessary for U.S.-owned small  businesses to ensure they have everything they need to expand and grow.\n\nThis bill codifies both President Trump's executive order to end  taxpayer subsidization of open borders and Administrator Loeffler's SBA  7(a) program guardrails…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692123/american-entrepreneurs-first-act-of-2025"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…conducting vital research related to defense, energy sciences, and  other sensitive industries. Many colleges and universities have  accepted CCP funding, hoping to simply expand their foreign language  learning. They have, unfortunately, opened the doors for our biggest  foreign adversary to exploit breakthroughs for Chinese strategic  advantage.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690825/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…property cannot be  used for gaming, nor for commerce beyond what is necessary to support  the needs of the new neighborhood.\n\nFrankly, I hope that future boards will agree to expand the  permissible use of this land. In the meantime, both the Tribal  government and the local government have agreed to these restrictions,  and they are incorporated into…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697668/shingle-springs-band-of-miwok-indians-land-transfer-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…government gobbling up the capital  stack that is used to finance growth, to finance business, to finance  when you want to buy a truck or a new home or your business wants to  expand.\n\nWe got an updated letter from the Congressional Budget Office.  Apparently, it didn't make me particularly popular with a few people,  which actually provides me a perverse…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}]