[{"senator": "Chris Pappas", "party": "Democrat", "sentence": "…and addiction treatment will be put at risk by the cruel  and fiscally reckless budget being proposed by Republicans in the  House.\n\nIn addition, New Hampshire's Medicaid expansion, established on a  bipartisan basis, would end with any decrease in Federal funds, leaving  68,000 Granite Staters uninsured and devastating our hospitals and  community…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689237/cuts-to-medicaid"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…without going bankrupt.\n\nWhile the healthcare system isn't perfect, the point of the  Affordable Care Act was to ensure more people had access to insurance  through Medicaid expansion, through employer provided healthcare, and  through the Affordable Care Act exchanges. It is called Marketplace  Virginia in my State.\n\nThe more people have insurance, the…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…provides resources to connect her  immigrant neighbors with their community and inform them about their  rights.\n\nAs an activist, Angelica has also helped advocate for the expansion  of healthcare for immigrants, inspired by her own experiences with the  healthcare system.\n\nAngelica is one of countless community leaders in my district who  feel the urgency…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688474/womens-history-month"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…Fire Station No. 3 and the upgrading of Fire Station  No. 11 through a cooperative, grant-funded project with North Fork  Mono. He also oversaw Madera County's continuing expansion along  Highway 41 with the Riverstone and Tesoro Viejo developments.\n\nMr. Varney was instrumental in establishing the Sheriff's Foundation,  which has raised more than a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694999/recognizing-jay-varneys-retirement"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…government.\n\nAccording to the Kaiser Family Foundation, thanks to improved access  to general health services, cancer screenings, and other forms of  preventative care, Medicaid expansion alone lowered health-related  mortality rates by 3.6 percent. So funding available insurance under  the Affordable Care Act drove down the mortality rate and helped  substantially…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…losing care  under the Republican budget. 45,916 of those are children, 19,000 are  seniors, 10,000 are people with disabilities, 48,300 adults are on  Medicaid due to ACA expansion.\n\nMr. Speaker, this is madness. I thank my colleague for bringing this  to the floor, and I thank her for her spirit and her personal testimony  to what this will mean to…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691415/gop-tax-scam-hurts-everyone"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…$4.5 trillion to the ultrawealthy and big  corporations.\n\nMadam Chair, Nevada Democrats and Republicans worked together to  implement the Affordable Care Act, including the expansion of Medicaid.  We reduced the uninsured rate by a third, and 563,000 children were  able to receive coverage as a result. The fact that Nevada did the  right thing then means…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688077/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…nonpartisan scorekeeper, the Congressional Budget Office,  just confirmed the truth: 5.5 million people would lose their Medicaid  coverage if Republicans cut the Federal match for expansion States; 3.3  million more would lose coverage if they cap Federal Medicaid spending  in those same States; 2.3 million people, mostly low income seniors and  people with…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…counselors staff the  VetSuccess on Campus, or VSOC, program. This change will put counselors  back into the severely understaffed VR&E program and will also allow  the future expansion of the VSOC program, which has been limited by the  availability of VR&E counselors.\n\nMr. Speaker, many colleges and universities and Members of Congress  are asking for…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699487/veterans-readiness-and-employment-improvement-act-of-2025"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…domestic  abusers with restraining orders against them.\n\nThis bill would also eliminate serialization, making these dangerous  devices untraceable. H.R. 2189 is a reckless expansion of the gun  industry.\n\nMr. Speaker, because we all care about public safety, I urge my  colleagues to stand with me and my colleagues in opposition to this  dangerous piece…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700040/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…of them would lose their Medicaid  access because a 1 percent cut in the Federal Government's contribution  to Virginia's Medicaid program will mean everyone from Medicaid  expansion loses their Medicaid.\n\nThere are 3 in 10 children who are on Medicaid, 2 in 7 working-age  adults with disabilities are on Medicaid, and 5 in 8 nursing home  residents are…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690740/medicaid-is-a-lifeline"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…handouts, and now they are at great  risk because DOGE-led staff cuts are making it impossible to get  through and are breaking the agency.\n\nI introduced the Social Security Expansion Act with Representative  Schakowsky, Senator Sanders, and Senator Warren because we believe in  protecting the promise of Social Security is our duty.\n\nOur bill would increase…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690792/expanding-social-security"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…attainment; securing numerous Affordable Care Act grants; securing the  hospital's selection with MO HealthNet; working alongside dozens of  stakeholders to secure Missouri Medicaid expansion; advocating for  vital hospital support during the COVID-19 global pandemic; providing  community leadership by ensuring outreach and vaccinations were  available during…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688302/recognizing-mr-gerard-j-grimaldi-on-his-retirement-and-expressing-appreciation-for-a-lifetime-of-dedicated-service-to-our-community"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…with the new Trump policy.\n\nThe administration is reviewing again all legal immigration cases  already approved for individuals from the banned nations. To be clear,  this expansion is not limited to nationals of countries on the list. It  also includes anyone who has been born in any one of those countries,  even if they lived the majority of their…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…School District  board. She served on the board for 16 years before joining the Chaffey  College Governing Board in 1993. Under her leadership, Chaffey College  championed the expansion of the college from one to three campuses, the  opening of the Industrial Technical Learning Center, and the  development of critical support services.\n\nWhen serving on the…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697315/recognizing-chaffey-college-trustee-kathleen-brugger"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…deliver critical care to farmers  and rural families who so desperately need it. However, in order to  access telehealthcare services, Congress must also prioritize broadband  expansion for our Nation's rural areas.\n\nRural families desperately need telehealthcare services. These are  only accessible if families have internet access. Large swaths of my  district…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691424/increasing-mental-health-services"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "Mr. BIGGS of Arizona. Mr. Speaker, the original Medicaid program was  designed to help the disabled, pregnant women, seniors, and children.\n\nThen there was this expansion that came along, and it is filled with  able-bodied adults of working age who could be working. That is the  fastest growing program in the United States today. They pay…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690836/increasing-medicaid-funding"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…CONTRACT HEALTH CARE PROFESSIONALS WHO PERFORM                     MEDICAL DISABILITY EXAMINATIONS FOR THE                     DEPARTMENT OF VETERANS AFFAIRS.\n\n(a) Expansion.--Section 504 of the Veterans' Benefits       Improvements Act of 1996 (Public Law 104-275; 38 U.S.C. 5101       note), as amended by paragraph (1) of subsection (a) of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695499/rural-veterans-improved-access-to-benefits-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…be an energy superpower due  to the robust trade of oil, gas, and electricity. As energy demand is  projected to increase in staggering numbers over the coming years, the  expansion of cross-border energy infrastructure throughout this  integrated market will be important.\n\nOne challenge confronting the expansion of energy trade with Mexico  and Canada…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695688/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…southern tier.\n\nAlstom, a global leader in smart and sustainable mobility, has opened  its new, cutting-edge plant 4 facility in Hornell, New York.\n\nThis 135,000-square-foot expansion brings stainless steel railcar  body production back to the United States, strengthening our domestic  supply chain, and reaffirming Hornell's position as the Nation's  premier…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692434/recognizing-alstoms-plant-in-hornell"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…that  supported children and families at risk of violence and created a new  job placement program for neurodivergent young adults. One of his  biggest projects being the expansion of the General Wayne A. Downing  Home for Veterans, which helped raise nearly $1.5 million for the  strengthening of services for local veterans.\n\nDon Johnson's tireless…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693113/congratulating-don-johnson-on-his-retirement-as-the-ceo-of-goodwill-industries-of-central-illinois"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Definitions.--In this section:\n\n(1) County.--The term ``County'' means Navajo County,       Arizona.\n\n(2) Map.--The term ``map'' means the map entitled       ``Pinedale Cemetery Expansion'' and dated May 23, 2022.\n\n(3) Secretary.--The term ``Secretary'' means the Secretary       of Agriculture, acting through the Chief of the Forest       Service.\n\n(b) Conveyance…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691144/apache-county-and-navajo-county-conveyance-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Dairy even made history when it became the first dairy in  the area to transport milk purchased from other local farms in a tanker  truck.\n\nIn 1986, Reid Ritchey oversaw an expansion of the facility, which  accommodated a new ice cream production room, additional freezer space,  and new offices. Now, as the fourth generation of Ritchey's takes over,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693458/golden-age-of-america-has-arrived"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…MODIFICATION OF PROVISIONS RELATING TO DEFENSE TRADE                     AND COOPERATION AMONG AUSTRALIA, THE UNITED                     KINGDOM, AND THE UNITED STATES.\n\n(a) Expansion of Expedited Review of Export Licenses.--\n\n(1) In general.--Section 1344(c) of the National Defense       Authorization Act for Fiscal Year 2024 (22 U.S.C. 10423(c))…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694783/aukus-reform-for-military-optimization-and-review-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…According to Joel Trotter, one of the authors of the JOBS Act,  ``Decades of successful experience show that the well-known seasoned  issuer category is long overdue for expansion.''\n\nI couldn't agree more, and this bill does exactly that. It lowers the  size threshold for WKSI qualification while maintaining all the  existing good governance requirements.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697266/expanding-wksi-eligibility-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…demonstrating selflessness and compassion. This year, the CDC received  the Daniels Fund Medal of Excellence and a $250,000 grant. The grant  will fund its continued operations and expansion of its services at no  cost to participating families.\n\nProviding the excellent service the CDC is known for takes a team of  talented people. This team includes the CDC's…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690065/recognizing-natrona-county-cdcs-art-a-la-carte-gala"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…repaired for  more than three decades. The inability to rehabilitate and rebuild the  Bolts Ditch Headgate prevented new development in the area, which would  have required the expansion of Bolts Lake to provide a water supply for  surrounding homes.\n\nCongress corrected this error in 2019 by allowing the town of Minturn  to access Bolts Ditch for maintenance…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693454/bolts-ditch-act"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…District for  17 years.\n\nWe have a lot of mosquitoes in Florida. Throughout his tenure, Mr.  Kwiatkowski helped guide the district through major accomplishments,  including the expansion of mosquito control services to meet the needs  of a growing community. His service to the community was so exemplary  that he was honored with the unveiling of the ``Jules…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697751/recognizing-lady-lake-florida"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…updates reporting requirements for NOAA's Office of  Commercial Remote Sensing Regulatory Affairs, giving Congress the  ability to monitor how regulations are affecting the expansion and  development of the commercial and remote sensing industry.\n\nRemote sensing uses data collected from satellites to produce images  of Earth and has become a crucial tool…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688971/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Disapproving this tax will also provide relief to       small businesses and industries so they can allocate more       resources toward growth, innovation, and workforce expansion.\n\nThis natural gas tax threatens to increase costs to       consumers and businesses and undermines economic       competitiveness. We urge Congress to act swiftly in passing…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}]