[{"senator": "Shomari Figures", "party": "Democrat", "sentence": "…that he did not enjoy even back at home.\n\nDespite that, Lieutenant Colonel Hardy kept the mission first, front  and center. With the other Tuskegee Airmen, they exceeded expectations,  and they left behind a spectacular record of service and  accomplishment. Though these men took off as the unlikeliest of  American heroes, they landed as what is possibly…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696982/tuskegee-airmen-moment-of-silence"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…colleague, if you want some guidance on this issue,  talk to local cops, talk to your local police chief. What are the rules  for them? What are the norms? What are the expectations?\n\nAll we are asking here is that the same apply to ICE and CBP and DHS.  And make no mistake, these are demands, not requests. I will oppose any  additional funding for…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Articles of Impeachment this  month. It is necessary, and it will be done.\n\nI truly believe in what the country stands for. I know that it has  not always lived up to the expectations written in the great documents  that support what the country stands for. I know that it has not always  lived up to these expectations, but I also know this. It is a country…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…than       federal incentives.''\n\nChina's shift from a fixed tariff system to an auction-      based model is also impacting project economics and dampening       growth expectations. Previously, wind and solar projects       benefited from guaranteed long-term revenues tied to fixed       tariffs, while now projects are awarded contracts based on…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…remember Sydney M. Boisselle, a young woman whose life  proved that impact is not measured in years but in courage, character,  and how we lift others.\n\nSydney shattered expectations. She became a leader in the  International Brotherhood of Electrical Workers Local 8, a teacher in  the trades, a voice for women, and a standard-bearer for excellence.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…further gutted under the  Republicans' big, ugly bill.\n\nThe effects of these cuts have far-reaching implications on the  Department of Energy's ability to perform and meet expectations. Across  the country, businesses and community partners are waiting to hear from  the Department of Energy about critical contracts and access to  funding. Congressional…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697891/electric-supply-chain-act"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…and Republicans agreed that we  should cut the ICE slush fund to protect Medicaid. It should be  bipartisan here, too.\n\nI hope Republicans make the right choice, but my expectations are  pretty low. I hope the American people are listening. They are most  certainly watching on their screens every night.\n\nMr. Speaker, this vote is about using taxpayer…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699592/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Address in the House Chamber.\n\nWashington's words demonstrate the mixture of wisdom, patriotism, and  selflessness that should serve as a model for all Presidents and set  the expectations for all Americans for how a President should approach  the sacred trust of serving as America's Chief Executive.\n\nWashington's Farewell Address to the people of the United…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…Consumer affordability, not corporate profit, has to be the priority.  Paying for groceries and healthcare, keeping the lights on, and heating  your home are the basic expectations that should exist in the  wealthiest country in the world, Mr. Speaker. They should not be  luxuries.\n\nThis affordability crisis isn't just hitting hardworking families…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699587/stop-the-republican-affordability-crisis"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…unique abilities, professionalism, and dedication are apparent  to all who across paths him. Throughout the nearly four years Ben was  in my office he continued to exceed expectations in every role he was  assigned. As a part of my legislative staff, he continuously found new  ways to address the needs of California's 39th district. From  spearheading…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692875/recognizing-departing-staff-member-benjamin-hong-starr"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…damage'' leading to dramatic worsening  for humankind in a worsening trajectory of damage.\n\nTipping points can have a profound effect on markets. Markets are  built around expectations, and one of the main expectations around  which they are built is the expected lifetime of assets. Well, as of  today, the central case estimate for sea level rise is around…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…administration and the  Republican majorities here in Congress are off to a very poor start.  Projected economic growth is down along with Americans' 401(k)'s.  Inflation and expectations for inflation in the coming months are up.  Last week, discussing the release of higher-than-expected inflation  data, one economic analyst observed ``the preliminary signs…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…this place works for people who don't have lobbyists,  who don't have super PACs, who can't write a seven-figure check.\n\nThese shouldn't be radical demands. They are basic expectations. And  here is why this matters so much right now. As long as big money and  billionaires dominate our politics, it will continue to block progress  on the issues that people…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699113/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…small  businesses align perfectly with BMS's mission to strengthen the local  economy while preserving the character of our town. Cindy's  volunteerism goes above and beyond expectations. She does not hesitate  to take an extra responsibilites, often stepping up when additional  help is needed. Whether it is arriving early to set up for an event,  staying…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690272/recognizing-cindy-mahon"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Certified Dog Trainer with more  than 20 years' experience at K-9 Partners for Patriots. Jeanne's  dedication to matching Veterans with the perfect rescue dog goes far  beyond expectations. She has an encyclopedic understanding of dogs and  their behaviors and serves multiple roles from training to K9  evaluations and acquisitions. She is also the liaison…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690843/recognizing-jeanne-white"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and elders to live with greater comfort.  Despite daunting challenges and limited equipment, the WREC team  completed a demanding project in just eight days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life-changing mission.\n\nThe impact of WREC's work goes far beyond electricity; it represents…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692641/recognizing-jose-santiago"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…more than  1,200 good-paying Texas jobs, including 200 held by proud residents of  Texas' 6th Congressional District.\n\nBy all accounts, the Wilmer facility is exceeding expectations,  surpassing production goals and selling out its entire 2025 inventory.  This success story is more than numbers; it is an American story. T1 is  reshoring the solar supply…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696803/recognizing-the-first-anniversary-of-t1-energys-operations-in-wilmer-texas"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…proud to recognize Utah's State Teacher  of the Year, Sayre Posey, an outstanding educator who embodies the  mission of the Merit Caucus: excellence, innovation, and high  expectations.\n\nShe comes from a long line of teachers. Her great-grandfather taught  in a one-room schoolhouse in West Virginia, and her mom is a retired  kindergarten teacher.\n\nNow,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692425/sayre-posey-utahs-state-teacher-of-the-year"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…on Feb 22, 1980, from       Lake Placid and drew 34,200,000 average viewers. The match is       remembered as a ``miracle'' as collegiate ice hockey players       defied expectations in defeating a Soviet team that won 4       consecutive gold medals dating back to 1964.\n\n(5) Team USA defeated Finland 4-2 in its final game to win       the gold medal,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695439/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and elders to live with greater comfort.  Despite daunting challenges and limited equipment, the WREC team  completed a demanding project in just eight days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life-changing mission.\n\nThe impact of WREC's work goes far beyond electricity; it represents…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692647/recognizing-jamen-monbarren"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…and caring  environment where students can thrive and their love for learning is  ignited.\n\nShe is instrumental toward establishing new academic programs,  standards, and expectations for all kindergarten students, leading the  continued development of the district's kindergarten programs.\n\nShe is often known for enrolling in classes, programs, and workshops…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…PIAA Championship on March 28, 2025.\n\nA small Christian school at the rural eastern edge of the 11th  Congressional District, Linville Hill Christian School has defied  expectations. After cruising through the regular season and the  playoffs, the boys' basketball team made their way to the Class 2A PIAA  Championship game.\n\nThough they trailed with…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689659/congratulating-the-linville-hill-christian-school-boys-basketball-state-champions"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…tears they took  their leaves one of another, which proved to be the last leave to many  of them.\n\n``Being now passed the vast ocean and a sea of troubles before them  in expectations, they had now no friends to welcome them, no inns to  entertain or refresh them, no houses, or much less towns, to repair  unto to seek for succor; and for the seasons it…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…dedication and lifelong  commitment to the city.\n\nHis peers and colleagues see him as a humble leader whose focus on  Madisonville's growth and success goes far beyond the expectations of  his role.\n\nIn addition to this remarkable honor, Mayor Cotton was recognized for  his 4 years of dedicated service as a member of the Kentucky League of  Cities Executive…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696906/recognizing-mayor-kevin-cotton"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and elders to live with greater comfort.  Despite daunting challenges and limited equipment, the WREC team  completed a demanding project in just eight days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life-changing mission.\n\nThe impact of WREC's work goes far beyond electricity; it represents…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692593/recognizing-patrick-sullivan"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…has all of our events and fundraisers on it for  the families to see as they come onto campus. Cheryl asks daily what  she can do to help and never stops until she exceeds expectations.\n\nIt is clear Cheryl Wirt has made a profoundly positive impact on our  community, and I am grateful for her service. May we all strive to  serve our communities with the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690177/recognizing-cheryl-wirt"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and elders to live with greater comfort.  Despite daunting challenges and limited equipment, the WREC team  completed a demanding project in just eight days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life-changing mission.\n\nThe impact of WREC's work goes far beyond electricity; it represents…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692424/recognizing-john-blaho"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and elders to live with greater comfort.  Despite daunting challenges and limited equipment, the WREC team  completed a demanding project in just eight days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life-changing mission.\n\nThe impact of WREC's work goes far beyond electricity; it represents…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692614/9999"}]