[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…little son with her family and celebrating her son's last day of  kindergarten, but Adriana's body lies hooked to machines in a hospital  bed as part of an unjust medical experiment for more than 3 months. No  family should have to endure this.\n\nNone of us are free until all of us are free.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692035/adriana-smith"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…National Lab in the 11th  District of Illinois that I represent.\n\nIn particular, this bill will allow for closer collaboration with  CERN on the Deep Underground Neutrino Experiment, also known as DUNE,  an international flagship experiment.\n\nDUNE will help us to discover more about the nature of subatomic  particles known as neutrinos, which could help…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694825/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…Organization for Nuclear Research, is one of the world's premier  scientific organizations. It is partnering with United States  researchers on the Deep Underground Neutrino Experiment, a $3 billion  project based right here in United States. This is some of the most  important and cutting-edge physics research in the world that will,  hopefully, allow…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694823/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…experiments and simulations with our existing stockpile  to make sure our arsenal is safe, secure, and reliable. All this is  done without any explosion. It is a scientific experiment called  subcritical and is far more helpful to understanding how the weapon  will perform than setting off an explosion in the desert.\n\nOur leadership on arms control and…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696970/nuclear-testing-opposition"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…of the 19th century. In 1896,  the U.S. Post Office decided to try a new service in two counties in  West Virgina, free rural home delivery. In less than a decade, this  experiment was adopted nationwide, and today, millions of rural  Americans count on home delivery.\n\nThis commitment to equitable, universal delivery is one that is near  and dear to…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697376/250th-anniversary-of-the-united-states-postal-service"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…integrating unnecessary risk and  volatility into agencies. For example, according to recent reports, the  Department of Housing and Urban Development, or HUD, is attempting to  experiment with crypto in their operations, including by paying  grantees in stablecoin or crypto. One of Trump's executive orders  leaves the door wide open for Trump to require the…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…job  because a name correction appointment is weeks away, or the retiree who  waited hours just to schedule an appointment on the phone.\n\nSocial Security is not a political experiment. It is a promise. The  American people paid into the system and earned these benefits. They  shouldn't have to fight their own government to receive them.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698683/social-security-customer-service"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…that is contingent on work  and other qualifying activities.\n\nAccording to the Georgia Budget and Policy Institute, however, there  have been significant problems since this experiment in Medicaid reform  was established two years ago. It is failing to achieve its two primary  objectives of enrolling people in health care and getting them to work.\n\nGeorgia's…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689905/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…region as the home of  the biggest week in American birding, which today attracts birders from  around the globe.\n\nTo the last, he was an active participant in the American experiment.  He wrote Op-Eds and organized, kept reading and studying, even through  his final, difficult illnesses.\n\nSteve Fought's life is beautifully summed up by his nephew: ``Steve…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…world will have  the ability to collaborate in New York in R&D for new chips. It means  startups and other innovators will have access to the most advanced  machinery to experiment and discover new innovations in semiconducting.  It will even mean more good paying jobs--J-O-B-S--at Albany NanoTech  and the local economy.\n\nWe all worried that China would…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693456/national-semiconductor-technology-center"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…sure that is possible, but I will do everything I  can.\n\nThis year's celebration of America's anniversary offers an  opportunity to reflect on the resilience of the American experiment.  Our Nation has faced countless tests to our strength and our unity,  including a civil war, two world wars, natural disasters, and more.\n\nYet through each of these profound…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699839/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Women's Bureau  funds discriminatory DEI experiments. I would like to know why exactly  they think helping women enter and succeed in the workforce is a  discriminatory DEI experiment. Canceling more than $20 million  in congressionally authorized funds is both illegal and  unconstitutional, and we must hold DOGE and Secretary Chavez-DeRemer  accountable.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691209/supporting-the-womens-bureau-at-the-department-of-labor"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…her dissent from the Supreme Court's denial of a stay of  execution, Justice Sotomayor, joined by Justices Kagan and Jackson,  concluded, ``Allowing the nitrogen hypoxia experiment to continue  despite mounting and unbroken evidence that it violates the  Constitution by inflicting unnecessary suffering fails to ` ``protec[t]  [the] dignity'' ' of `…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696470/executive-calendar"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…to pay off  their loans.\n\nSecretary McMahon has usurped Congress' role by firing staff, holding  up grants that Congress has approved, and running a multimillion-dollar  experiment by shuttering the Department and making six different  Federal agencies do the work of one.\n\nDemocrats have worked to conduct oversight for our Nation's students,  but Republicans…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698129/dismantling-the-department-of-education"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…since Congress first authorized  this memorial in 2001. It is time to finish what we started.\n\nWe are speaking of a family that didn't merely participate in the  American experiment but helped define it. Thomas Jefferson called John  Adams the Colossus of Independence, and his thoughts on government  frame the very Constitution we swear to uphold every…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697632/adams-memorial-great-american-heroes-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Folks are trying to fill out a tax form and give the government  money. They call and call and can't get the phone answered. There was a  little pilot program done. It was an experiment. Let's actually do a  chat, like a ChatGPT, that picks up the phone 24 hours a day, will stay  on the phone as long as the caller needs, will help them fill out the  tax…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Eta  Space. It is a company in my district that employs 20 people, but they  are having a massive impact on the changing space world. They developed  a satellite that will experiment with cryogenic fuels in orbit, a key  technology for orbit refueling. This innovation will pave the way for  long-distance space travel, making missions to Mars and beyond…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…debt we sell to the retirement, to the business, to the  bank, and other things.\n\nThe day we were elected, publicly borrowed debt was about $28  trillion. Let's do a math experiment. Baseline borrowing for the next  10 years is $22 trillion. If we were to do the tax extensions--and this  is going to make sense. When we hear people running around here…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…ask for a bailout of the program to stave off insolvency.\n\nNow, you would think that this would compel Newsom and the  legislature to immediately roll back this disastrous experiment, yet  when Governor Newsom was asked, he said that rolling back this policy  was ``not on my docket.'' Let's be very clear: Saving Medicaid in  California is not on Governor…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…are targeting them.  It is battle, and it is one we must win. There is not an option.\n\nFor our heroes' sake, for our country's sake, for the success of this  great American experiment, living as a free man under the rule of law,  I urge my colleagues to have our officers' backs while they cover ours.\n\nI hope they will join me in supporting my Halo Act.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697550/halo-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…State budgets instead of taking care of healthcare, but that will get  protests.\n\nEighteen States have higher credit ratings than we do. It is just an  interesting thought experiment. How about if I told you that, I think  it is as of yesterday, either 12 or 13 countries can sell a 10-year  bond cheaper than the United States. Greece today can sell a…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…colleague. I mostly appreciate his friendship.\n\nWe convene here before the Fourth of July. I think it is worth  recalling those unalienable rights that sparked this American  experiment: life, liberty, and the pursuit of happiness. Our Founders  built this Republic on the promise of freedom: the freedom to build, to  strive, and to pursue our own dreams.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693192/one-big-beautiful-bill-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…that the Democrats fought to bankroll with another 450 billion taxpayer  dollars.\n\nTo test the program's safeguards against fraud, the GAO said: We are  going to conduct an experiment. So they decided to make up 24  fictitious applications, and they did these quite sloppily. They made  up names, addresses, information. They left out some required  information…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699102/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Apparently, islet cells don't need antirejection drugs to get  bodies to be able to start making their own insulin again. There are  crazy ideas.\n\nMr. Speaker, can we do a thought experiment? I am probably going to  get beat up for this. This is a thought experiment. Give me some leeway  on it. I am trying to help our brothers and sisters, and anyone crazy  enough…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…months off and actually do good,  quality policy and legalize properly vetted and properly certified AI  to prescribe.\n\nThis August, with the wearables, I am going to do an experiment with  this Oura Ring. I am buying some Dexcoms to manage my glucose. Have we  all seen the app where we can take a picture of food and it calculates  glucose and calories?…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Madam Speaker, I rise today in support of the bill sponsored by the  gentleman from Alabama (Mr. Aderholt), my good friend, the $2.50 for  America's 250th Act.\n\nThe greatest experiment in the history of the world, the United  States of America, is still going stronger than ever, and 2026 marks  our Nation's 250th birthday, an incredible feat as our Founders…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699867/for-americas-250th-act"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…is stepping  down after 13 years of serving as the dean of the College of Food,  Agricultural and Natural Resource Sciences and the director of the  Minnesota Agriculture Experiment Station.\n\nAs our State's premier institution for agricultural education, the U  of M has a longstanding reputation of excellence in developing and  training future ag leaders.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699023/recognizing-brian-buhr"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…proclaiming our unalienable  rights and self-evident truths: equality, life, liberty, and the  pursuit of happiness.\n\nThe Declaration of Independence launched the American experiment that  continues from one generation to the next. This experiment is unique in  the 6,000-year history of humans.\n\nEarlier this week, the Washington Monument, here on our…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698577/250th-anniversary-of-the-declaration-of-independence"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…the  streets after his arrest in January.\n\nPolice do their jobs, but ideological prosecutors and judges refuse  to do theirs.\n\nThis is not justice. It is a failed social experiment backfiring on  our communities. We see it time and time again.\n\nIn D.C., police recently arrested a carjacking suspect who laughed in  their faces saying: I have been in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695036/failed-social-experiment-backfiring-on-our-communities"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…computing and quantum       information, all rely on mathematical and statistical       concepts, which are critical to prove under what       circumstances an algorithm or experiment will work and when       it will fail.\n\n(8) Military academies have a long tradition in teaching       mathematical modeling and would benefit from the ability to       recruit…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}]