[{"senator": "Ron Wyden", "party": "Democrat", "sentence": "…phones.'' The Biden administration took no action in response to my  letter.\n\nCISA's inaction on telecommunications security prompted the Agency's  top telecommunications security expert to file a whistleblower report  with the Federal Communications Commission (FCC) in the summer of 2024.  Citing his access to nonpublic reports and other ``very concerning…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689978/nomination-of-sean-plankey"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…deployment of nuclear weapons.\n\nWe never thought there would be a need to revive the nuclear freeze  movement, but here we are.\n\nLet me quote from Michael Klare, an arms control expert at Hampshire  College and a constituent of mine: ``February 6 is likely to bring us  into a new era, not unlike the early years of the Cold War, in which  the major powers…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699036/expiration-of-new-start"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…network stopped monitoring  requirements for all but two dangerous pathogens. I know R.F.K., Jr.,  doesn't like listening to public health experts, but I don't think it  takes an expert to understand listeria will not go away just because  States don't track it. It will not go away because nobody is looking.  Shigella outbreaks will not go away if you ignore…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694964/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…and treatments that we  need to survive and thrive; trying to illegally dismantle the  Department of Education; and going after public health and really  ruining a lot of the expert public health advice that helps keep our  neighbors healthy and safe.\n\nThen, here, when we are talking about oil and gas and their  lobbyists, they are so firmly in control…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697027/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…anti-efficiency resolutions  that we have seen recently from the Republicans, did not go through any  regular order. I want to stress why that is important. We never  received any expert witness testimony on the impact of the standards or  on the impact of repealing them. Instead, we are left to trust a  Republican Party that is decidedly antiscience on the…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689127/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…I also strongly oppose the Trump administration's ongoing plans to  fold the CPSC's mission into the Department of Health and Human  Services with a smaller budget, fewer expert staff, and a narrower  mission.\n\nAmerican consumers deserve to have peace of mind that the products  they bring into their homes are safe. I commend Representatives Castor…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692745/awning-safety-act-of-2025"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…security  threat posed by foreign governments exploiting U.S. phone carriers'  weak cybersecurity. The Biden administration took no action.\n\nCISA's top telecommunications security expert was so concerned, he  actually filed a whistleblower report with the Federal Communications  Commission. He cited his access to nonpublic reports and other ``very  concerning…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694259/telecom-cybersecurity-transparency-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…who are desperately in need of nutrition.\n\nIn order to hold that the children are not suffering, we would have  to completely discount the consensus of every humanitarian expert and  agency in the world, the organizations that in many cases were founded  with the significant help of bipartisan efforts here in this U.S.  Congress. I am talking about…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Mr. Speaker, I will take a moment to share some words. On February 8,  at the Sheet Metal Workers union in Oakland County, Michigan, I was  joined by an incredible medical expert from Michigan, my friend, Dr.  Preetha Iyengar, who happens to be in this very Chamber alongside her  family here today.\n\nShe read these words, which I would like to share…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688410/a-serious-and-profound-moment"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…traditional redistricting criteria. See,       e.g., Tr. Jun. 7, 2025, PM Session at 33; Tr. Jun 9, 1025, AM       Session at 54. Dr. Sean Trende, renowned redistricting       expert, testified on behalf of Texas that its electoral maps       correlate more closely with partisan advantage than any       racial consideration. See Tr. Jun. 9, 2025, AM Session…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Congress, I was  so happy that States had the option to expand Medicaid coverage for up  to 1 year postpartum. It was one of the solutions to this maternal  healthcare crisis that expert after expert after expert says: Just make  sure those women who gave birth are not knocked off of healthcare after  2 months.\n\nAs of this January, 49 States, plus the District…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…final bill before it moves forward?\n\nI am happy to yield to him.\n\nI guess we are not going to get an answer.\n\nI mean, I guess we all know why they don't want the nonpartisan,  expert analysis to be made available before a vote on this bill. This  vote is a monstrosity. This vote is going to throw at least 14 million  people off their healthcare. This is…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…provided       crucial support for the review process--both early in their       career and with tremendous promise as civil servants.\n\nAnother in my division was an intermittent expert.\n\nNational Science Foundation's work depends on bringing in       knowledgeable experts from many fields, and intermittent       experts are critical for this.\n\nTo lose them…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688192/fired-by-president-trump"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…would wipe out an industry that we  have spent more than a decade creating.\n\nThe advocates for this language that is in the bill will tell you  this won't affect CBD. Every expert I have consulted has said that that  is exactly wrong; that this will, in fact, wipe out 95 to 99 percent of  the industry.\n\nMy colleague from Kentucky is exactly right. We…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696665/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…My friends,  this is how we compete and win on the world's stage.\n\nIt is so very important to me, as somebody who worked in a  manufacturing research lab. I have brought in expert witnesses to the  Science Committee that, yes, our great chairman has been a part of for  his whole tenure in Congress. We have heard this from the researchers.  I have heard…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688978/mathematical-and-statistical-modeling-education-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…East Asia, the Pacific, and International Cybersecurity Policy held a  hearing on China's challenge to America's leadership when it comes to  artificial intelligence. We heard expert testimony from four witnesses  on the challenges that the United States faces in staying ahead of  China in this critical sector.\n\nEach of these witnesses emphasized the importance…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697555/china"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…seawall project to preserve the maritime heritage and identity of Port  Huron as a Great Lakes port city.\n\nFor over six decades, the Lakes Pilots Association has provided  expert pilotage services to foreign-flagged vessels operating in the  critical waters of District 2. Under the leadership of President  Captain Tony Brando, the Association has played…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694741/recognizing-the-lakes-pilots-association-for-over-60-years-of-service-to-the-great-lakes-maritime-community"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…specialty installations,  demonstrating excellence and innovation at every turn.\n\nLeMaster's growth is a testament to their hard work, skill, and  dedication to its workforce: expert supervisors, veteran foremen, and  hardworking crews whose craftsmanship and professionalism have earned  the respect of clients across Indiana and beyond.\n\nBeyond their business…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693965/9999"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…demonstrated extraordinary skill, professionalism, and courage day and  night, in all conditions.\n\nThousands of families across our region have been touched by the  fast, expert care this team delivers. Their work has strengthened our  emergency response system, expanded access to advanced medical care,  and saved countless lives.\n\nToday, we honor…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697041/congratulating-memorial-medflight-on-its-20th-anniversary"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…scientific, technical, and strategic pursuits.\n\nIn addition to his outstanding work with PCCA, Mr. Bassani has  previously served on the United States Pharmacopeia Compounding Expert  Committee.\n\nMr. Speaker, I congratulate Mr. Bassani on this exciting achievement,  and I wish him the best in his new role.", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690331/recognizing-david-sparks-for-contributions-to-pharmaceutical-industry"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Citation, Vietnam Cross of Gallantry with palm, Vietnam Campaign Medal  with device, Navy Commendation Medal, Meritorious Unit Commendation,  Sea Service Deployment Ribbon, Pistol Expert (15th Award), Rifle  Sharpshooter and Legion of Merit dated May 4, 1987.\n\nThroughout his distinguished military career, he completed Recruit  Training in 1955, then moved on…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696280/recognizing-colonel-john-battista-airola-usmc-retired-with-a-congressional-veteran-commendation"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…term ``FFRDC'' means a federally funded research       and development center.\n\n(2) The term ``covered entities'' includes--\n\n(A) the Secretary of Veterans Affairs;\n\n(B) an expert in laws administered by the Secretary of       Veterans Affairs;\n\n(C) a veterans service organization recognized under       section 5902 of title 38, United States Code;…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689678/clear-communication-for-veterans-claims-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…gaps, asking Congress to act to fill those gaps.\n\nIn 2022, we certainly witnessed consumer harm when the Financial  Services Committee heard unprecedented testimony from an expert called  in to clean up the failed digital asset crypto firm FTX and the mess it  left behind. In his words, never had he seen such an utter failure in  corporate controls.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693775/digital-asset-market-clarity-act-of-2025"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…Between 2022 and 2023 alone, PJM saw over 11,000 megawatts of  generation deactivated while only adding 4,000 megawatts of new  generation to the grid. It doesn't take an expert to see that retiring  power plants outpacing new generation is a problem.\n\nThis is especially concerning for my district and central Ohio, which  has become a national hub…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695755/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…earned national recognition.\n\nGeorgia is home to hundreds of golf courses, but our resort golf  courses stand among the very best in the Nation.\n\nThese rankings are based on expert evaluations of course design,  conditioning, and overall quality, highlighting Georgia as a premier  golf destination. This distinction showcases both Georgia's natural  beauty…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699261/recognizing-wayne-barth"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…working and marshaling bipartisan, bicameral support. I thank him for  his tremendous leadership.\n\nI thank the gentleman from Wisconsin (Mr. Steil) for being a subject- matter expert and working in a bipartisan way to build a bipartisan  coalition for this moment.\n\nThere has been a lot of talk, Mr. Speaker, made in this term of  Congress about the One Big…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693841/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…under Chair Cathy McMorris  Rodgers while I was serving as Subcommittee Chair. When I became  Chairman in January of this year, I knew I wanted to keep her on my  team as an expert on health issues.\n\nAfter serving two Chairmen and three Subcommittee Chairmen, Molly has  departed the U.S. House of Representatives to accept another  opportunity to continue…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698336/recognizing-molly-brimmer-lolli"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…to  see accurate depictions of the chain of events.\n\nWith his levels of experience and expertise in the field, Officer  Schneider has become the department's subject matter expert on traffic  matters, leading the city to new heights and addressing traffic  concerns through the implementation of positive and advanced solutions.\n\nOfficer Brett Schneider…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Achievement Medal, the 9/11 Medal,  two Southwest Asia Campaign Medals, the Kuwait Liberation Medal from  Kuwait, six Sea Service Ribbons, three Good Conduct Medals, and both  the Expert Pistol Medal and Expert Rifle Medal.\n\nFollowing his retirement in July of 2004, Mr. McInnis continued his  commitment to service through education. Using a degree earned while…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698462/recognizing-united-states-coast-guard-cwo4-james-mcinnis-as-december-2025-veteran-of-the-month"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Staff Member for the Subcommittee on Commerce,  Manufacturing, and Trade. When I became Chairman in January, Brannon  stayed on as a valuable member of my team as a policy expert in  critical areas such as artificial intelligence, data privacy, and  children's online safety. During his time in the United States House of  Representatives, he has helped…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690576/recognizing-brannon-rains"}]