[{"senator": "Shontel Brown", "party": "Democrat", "sentence": "…review software  assets, this bill can improve planning for software management,  automate processes, train staff, and improve our cybersecurity.\n\nHere is a key point: Industry experts estimate the bill could save up  to $750 million each year in taxpayer funding. This is real government  efficiency, and it is from legislation that has gone through committee…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698152/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…As we continue to hear that Elon Musk and his band of hackers are  rampaging through Federal agencies, including the Department of Health  and Human Services, firing policy experts, falsely accusing Americans  of fraud, freezing and terminating investments that were directed by  Congress, I hope we can return to the kind of partnership and genuine  concern…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688406/recruiting-families-using-data-act-of-2025"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…question, then we, Congress, have to draft laws that  are far more technical in specificity than we do now. That cannot be  done without major assistance from subject matter experts such as those  at the Congressional Research Service.\n\nTo that end, it is my hope that the millions we save from passing  this bill will be promptly reinvested in CRS to enhance…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689323/repeal-requirement-for-congressional-research-service-to-prepare-annotated-constitution-and-supplements-in-hardbound-version"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Security officers' perspective who screen millions of passengers a day,  to Federal air marshals providing in-flight security, to canine  handlers, inspectors, and cybersecurity experts, all helping to secure  our air transportation system.\n\nIn recent weeks, life has only become harder for this workforce, as  probationary employees have been fired and TSOs'…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688740/tsa-commuting-fairness-act"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…far-reaching results. To earn the Girl  Scout Gold Award, high school-age Girl Scouts must identify and  investigate an issue they care about, devise a plan, and then lead a  team of experts and community members to implement a project that  produces lasting change. Over the course of 1 to 2 years, Gold Award  Girl Scouts demonstrate significant initiative, commitment,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694162/recognizing-paige-kitts"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…of Representatives,      Washington, DC.\n\nDear Speaker Johnson and Leader Jeffries: We, the       undersigned organizations, represent a diverse group of       advocates and experts dedicated to advancing civil rights       protections and institutional resources for pregnant and       parenting students. We write       to share our opposition to the…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…health system is on life support  while Secretary Kennedy pulls the plug on lifesaving programs.\n\nJust 9 months in, he fired his own CDC director and has forced out  disease experts who protected us through a pandemic and disease  outbreaks.\n\nHe has perpetuated distrust in vaccines, while we see the highest  number of measles cases in more than three…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695085/commending-myesha-cooper-and-robert-johnson-south-fulton-police-officers"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…woke  up every morning to serve their country in the federal government.  Today, thousands of professional civil service employees, among them  cancer researchers, climate experts, food safety inspectors, air  traffic controllers and civil rights lawyers, have been illegally fired  or forced to retire from a job they loved and in which they excelled.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…enforce rules of  evidence--including by striking irrelevant or unreliable testimony from  consideration by the jury. In some cases, judges must also pre-qualify  proposed experts before they can state an opinion on a key issue. A  lawyer's questioning then further tests the reliability of those  opinions. Thanks to these established procedures, jurors…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690041/valuing-truth-fullness-lessons-from-jury-trials"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…delivering real economic damage across the  country.\n\nI want to emphasize that this is not an isolated concern. My  constituents, as well as economists, academicians, and policy experts  across the country have echoed the same worries. The Administration's  recent approach to tariffs has created serious uncertainty for U.S.  businesses, workers, and consumers.…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690134/opposing-the-chaotic-and-harmful-trade-policies-of-president-trump"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…are complex, involving layered  transactions, false documentation, and financial concealment. These  cases will take time to investigate and prosecute, and we owe it to the  experts doing the work to give them the tools they need.\n\nExtending the statute of limitations is only part of the equation. We  must provide full funding to the Office of the Inspector…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697226/sba-fraud-enforcement-extension-act"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…bill. It is a  resolution that pretends that tax costs nothing. It is a resolution  that would do damage to our Nation's finances and add $4.6 trillion to  our Nation's debt.\n\nExperts across this political spectrum have called this dishonest,  fabricated scorekeeping, and it undermines the point of budget rules.\n\nThat is why I introduced an amendment to…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689911/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…Medicaid means ripping healthcare from the youngest, the  oldest, and the special needs communities, the most vulnerable members  of our community.\n\nNonpartisan health policy experts, economists, and medical groups,  including Healthcare Association of New York State, have already warned  that the impact of gutting this program will be felt by all, including…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692748/medicaid-is-a-lifeline"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…to achieve some military  advantage. We do not want to go there.\n\nMy colleagues have also objected to the declarations of famine, even  though that is the declaration that experts--and I say ``experts.'' It  is people who have as their goal and life's work to try to feed people  who are desperately in need of nutrition.\n\nIn order to hold that the children…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…the American people.\n\nWhy? Apparently, it is because a disabled vet's salary is wasteful,  but $4.5 trillion in billionaire tax breaks are necessary.\n\nFive, he axed bird flu experts, nuclear safety officers, and IRS  workers, right in the middle of tax season.\n\nSo before Elon Musk demands five justifications from a VA nurse in  Cleveland, maybe he should…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688144/recognizing-resilience-resistance-and-relentless-struggle-lessons-of-black-history"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…participation in  international forums, including IMF. China pursues these tactics  because they know that financial security is just as important as  military security.\n\nDefense experts have identified that China could exploit Taiwan's  financial system by raising tariffs, short-selling stocks, and freezing  bank transfers. Joining the IMF would allow Taiwan…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692794/taiwan-non-discrimination-act-of-2025"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…Scouting, the Gold Award.\n\nGold Award Girl Scouts help their communities and the world by  identifying a community need, investigating it, devising a plan, and  leading a team of experts and community members to implement a project  that produces lasting change. Over the course of 1 to 2 years, Gold  Award Girl Scouts demonstrate significant initiative, commitment,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690499/recognizing-gold-award-girl-scout-recipients"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…in subsection (a).\n\n(2) Qualifications.--To materially assist in the activities       of the task force, representatives under paragraph (1) should       be subject matter experts who have familiarity and technical       expertise regarding cybersecurity, digital forensics, or       threat intelligence analysis, or in-depth knowledge of the       tactics,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "…years, we have seen an explosion of sexual abuse material online.\n\nThe data does not lie. Our children are not safe. But I also know it  because whistleblowers tell us. The experts from these companies tell  us the truth. I will never forget sitting in the Senate Judiciary  Committee and listening to whistleblowers from Meta talk about the  steps their…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697735/9999"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…Most defined contribution plans, like 401(k) plans allow participants  to direct their investments from a menu of options selected by  investment fiduciaries, who are the experts. Those are  the professionals who have a legal obligation to maximize return for  the investor.\n\nPlan fiduciaries go through an extensive selection and monitoring  process,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699155/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "John Boozman", "party": "Republican", "sentence": "…and Fetterman for leading the bipartisan  legislation and championing policies that promote a balanced diet and  increased dairy consumption for students, something dietary experts who  testified before the Ag Committee agree is important to their long-term  health.\n\nI also appreciate the interest of my colleagues who want to ensure  these changes support…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697061/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…are basically over 150 percent of debt to the  GDP.\n\nLet's actually do something difficult. The Treasury Secretary, Ray  Dalio, these other people who are sort of economic experts--they are a  lot smarter than I am or anyone else here--keep saying if we get to 3  percent of debt every year, it is actually somewhat equivalent to the  growth of tax receipts.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…legislation rightly identifies those responsible, including  members of the Chinese Communist Party, who have been credibly accused  by human rights organizations and U.N. experts of orchestrating  systematic, state-run organ harvesting, primarily targeting prisoners  of conscience from religious and ethnic minority groups.\n\nThis is not speculation.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…far-reaching results. To earn  the Girl Scout Gold Award, high school-age Girl Scouts must identify  and investigate an issue they care about, devise a plan, and then lead  a team of experts and community members to implement a project that  produces lasting change. Over the course of 1-2 years, Gold Award Girl  Scouts demonstrate significant initiative, commitment,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690422/recognizing-krysta-fowler-gold-award"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…from the pit of Hell.\n\nIt is impressive to me that a 23-year-old independent journalist did  more to serve the American people with investigative reporting than the  so-called experts in the legacy media. Where are they?\n\nThe fake news is complicit with the radical Islamic takeover of the  United States, and they are in on the scam on the American taxpayers.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…concept and underlying purposes of congressional       oversight within the governance framework of separation of       powers.\n\n``(3) Lecturers and panelists.--\n\n``(A) Outside experts.--The Commandant shall ensure that       not less than 60 percent of the lecturers, panelists, and       other individuals providing education and instruction as part…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…supply chain grid for grid  components. H.R. 3638 takes a comprehensive look at the supply chain  for our electric grid and appropriately incorporates the advice and  views of experts spanning the power sector.\n\nMr. Chairman, I urge my colleagues to support the legislation, and I  reserve the balance of my time.\n\nMr. GUTHRIE. Mr. Chairman, I yield 4 minutes…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Senate colleagues. I agree with  Senator John Kennedy, who said: ``Whoever put this in had an obligation  to tell us about it, and they didn't.''\n\nThe consensus of many legal experts is that this provision amounts to  a pay increase. To me, the provision reads like a Christmas bonus, and  that is blatantly unconstitutional. It defies the 27th Amendment,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696927/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Subcommittee on Modernization  and Innovation.\n\nNoah has served as the Deputy House Legislative Counsel since 2018,  helping lead the office and manage a committed team of experts to  provide the House with impartial and confidential drafting and  counseling services for bills, amendments, resolutions, and laws.\n\nThroughout his career in the House of…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696434/thanking-noah-wofsy-for-his-service-to-the-us-house-of-representatives"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…it effectively.  For over 40 years, Iran has targeted, threatened, and terrorized the  United States and our allies. We know from our own intelligence and  from independent experts that Iran was dangerously close to getting  nuclear weapons.\n\nMy colleagues on the other side of the aisle have called for  diplomacy. Well, President Trump tried diplomacy…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693090/iran"}]