[{"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…where close to half of our residents are Latino and where farmworkers  are essential pillars of our community.\n\nSince Trump's return to the White House, our community has  experienced an unprecedented level of chaos, fear from ICE raids, and  family separations. I witnessed one of these raids myself in  Carpinteria, California, where ICE agents unleashed…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697456/fighting-dhs-immigration-raids"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…elected Member of  Congress for political reasons.\n\nOur democracy only works when everyone has a voice. This includes the  millions of people across the country who have experienced violence and  exploitation, including Liz Stein and Jessica Michaels, both survivors  of Jeffrey Epstein's abuse. They are here in the gallery with us this  evening. I thank…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696711/welcoming-the-honorable-adelita-s-grijalva-to-the-house-of-representatives"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…monitoring  terrorist networks, cyber threats, or foreign adversaries. Imagine if  analysts stop flagging real dangers because they fear political  retaliation. Imagine if experienced officers walk away from service  altogether because they know their expertise will be diminished or  punished. That kind of environment doesn't just weaken our intelligence…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…underlying macroeconomic       factors such as the U.S. savings rate and the desire of our       trading partners to invest in the United States. The United       States has experienced trade deficits for 49 consecutive       years, yet, during this period, real GDP, national wealth,       and median incomes have all grown substantially. Moreover,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699566/opposing-the-trump-administrations-sweeping-national-tariffs"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…normal for a President  of the United States to try to alleviate economic pain for the citizens  of the United States, and this is certainly the first President that I  have experienced in the U.S. Senate but honestly the first President  that I have even been aware of who is intentionally raising the price  of something that we all need.\n\nIt is Secretary…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699020/energy-costs"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "“The people of Wisconsin deserve to have qualified, experienced, impartial judges working for them – and I am confident that’s just what we will get with Byron Conway. I was proud to work with Senator Johnson to stand up our bipartisan…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1681935/senate-confirms-baldwin-johnson-nominee-for-us-district-court-for-the-eastern-district-of-wisconsin"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…counterproductive. Research by U.S. and international finance  professors shows that after BDCs were removed from major U.S. stock  indexes--a consequence of the AFFE rule--BDCs experienced 29 percent to  33 percent lower investment growth compared to peers. The effects were  not limited to the financial sector: companies that relied on BDC  capital saw lower…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697831/increasing-investor-opportunities-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…resources that  immigrant, Black, Brown, and underserved communities need and deserve  to prevent, treat, and end the HIV/AIDS epidemic.\n\nAs a queer Latino immigrant, Omar has experienced firsthand the  importance of high-quality, culturally competent healthcare and HIV  prevention services. His experience has motivated him to build a world  where no one…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697836/commending-omar-martinez-gonzalez"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…way beyond welcoming  help for violent offenders, which we would, or a fraud investigation-- way beyond all of that.\n\nIn fact, the opposite has happened because some highly experienced  prosecutors in the U.S. Attorney's Office in Minnesota, who have been  there through Republican-appointed U.S. attorneys and Democratic- appointed U.S. attorneys, who lead…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…best serve our veterans.\n\nWe can and should look to staff the Board of Veterans' Appeals with  attorneys that have demonstrated expertise in this area, attorneys who  are experienced and who can see beyond quotas and metrics to apply the  law to the maximum benefit of veterans at the heart of the process.\n\nSo, Madam Speaker, I strongly support H.R. 659…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699208/veterans-law-judge-experience-act-of-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Wilderness Act, which passed with overwhelming bipartisan support back  when we had great conservation champions in both parties.\n\nAmericans from across the country who have experienced the serenity  of this wilderness know exactly what is at stake. Passing this  resolution would pave the way for toxic mining that would, without a  doubt, cause permanent…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…part,  attributable to the disparities in access to healthcare.\n\nDisparities in health outcomes were starkly apparent during the  COVID-19 pandemic. Communities of color experienced higher rates of  fatality and were often at increased risk for the comorbidities that  led to more serious illnesses from COVID-19.\n\nMy Democratic colleagues and I, in partnership…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690244/health-disparities-in-minority-communities"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…injured. Fortunately, he was not one of the four who died that day.  Another one died the next day. Four officers committed suicide in the  wake of the trauma that they had experienced that day.\n\nMr. Tate was attacked and temporarily blinded by bear spray. He hit  his head on the scaffold as he was knocked to the ground and lost  consciousness temporarily.…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698549/january-6-attack"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…the cost of this tax  cut policy will be.\n\nYet, with what the Senate is doing, the way the Senate majority is  setting up this score, the score that has been developed by  experienced, nonpartisan officials with Ph.D.'s in economics who  provide this good information to us, they are going to have to do some  kind of maneuver to figure out how to deal…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…sometimes. We saw  the disaster of government when it didn't work. Congress put in place  some measures to repeal and increase FEMA. One of those was you have to  hire an experienced administrator of FEMA, somebody who knows what they  are doing, because this isn't a time to play around. This  administration hired as the director of FEMA somebody who…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693655/tragic-storms-in-texas"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…big  thing down there.\n\nMr. Speaker, again, I thank my colleagues for being here to share  their perspectives as we look back on some of the significant wins that  we have experienced over the course of the last year. I wanted to  briefly share a little bit about stuff that doesn't get as much  attention.\n\nAs a proud father of four boys, we know that…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "Mr. ALLEN. Mr. Speaker, I rise with a heavy heart this evening. On  Saturday, April 26, Columbia County in my district experienced an  unimaginable tragedy as one of our beloved law enforcement officers,  Deputy Brandon Sikes, lost his life and Deputy Gavin White was severely  injured while serving…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690553/mourning-the-loss-of-deputy-brandon-sikes-and-praying-for-swift-recovery-for-deputy-gavin-white"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…gives the United  States access to some of the most fertile fishing waters that are found  anywhere in the world.\n\nThis strengthens the United States' tuna fleet, which has experienced  a rapid decline in recent decades, while also bolstering the United  States' presence in the South Pacific.\n\nThe 2016 amendments improved the treaty's execution and clarified…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691006/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…family and I know this pain personally. My brother Luke was taken  from us by a single pill laced with illegal fentanyl.\n\nMr. Speaker, so many families across our country have experienced  this same pain. It is a tragedy, but we cannot let heartache keep us  down. Our family and this country, we do not weep in the wake. We rise,  we fight, and we prevail.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690382/fentanyl-awareness-day"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…often flushed down the toilet.\n\nWe know, however, now, that mifepristone is extremely dangerous to  women. A big study, the biggest study ever done, found that 1 in 10  women experienced serious adverse events.\n\nMr. Speaker, that is not what you hear from the abortion lobby. You  hear about how safe it is. It ain't safe. They suffer things like  sepsis,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…leaders who, in their hubris,  thought they could shape the fate of nations, but we are subsequently  proven wrong as events ended up controlling them. Our own country,  sadly, experienced this during Vietnam.\n\nThe needless tragedy of that war in which 58,000 Americans paid the  ultimate sacrifice led Congress to pass the War Powers Resolution we  debate today.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…enactment of this Act.\n\nI rise today in strong support of H.R. 1442, the Youth Poisoning  Protection Act, led by Representative Trahan.\n\nSince 2017, the United States has experienced a troubling increase in  self-poisoning cases involving sodium nitrite, many of which stem from  easy online access to high-concentration products.\n\nThis bill aims to confront…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690219/youth-poisoning-protection-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…legislation would extend the  Alaska Native Vietnam era veterans land allotment program for an  additional 5 years, to end on December 29, 2030.\n\nAlaska Natives have long experienced land-related hardships.  Recognizing this, Congress passed the Alaska Native Claims Settlement  Act in 1971 to settle the aboriginal land claims of Alaska Natives.\n\nUnfortunately,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693474/alaska-native-vietnam-era-veterans-land-allotment-extension-act-of-2025"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…their most radical base,  continued to vote in unison to shut the government down.\n\nMr. Speaker, during that shutdown, we saw millions of families  experience pain. They experienced pain and suffering that Democrats  themselves acknowledged they imposed on the American people. They said  over and over again--and we have quote after quote from Democrats…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696745/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…efforts of our brave  patriots who deftly brought an end to Maduro's terrorization of not  only the good people of Venezuela but also those Americans and others  who have experienced Maduro's drug-laden terrorism.\n\nThis Special Order and the related House resolution clarify one  thing: America is grateful for this administration's efforts to rid the…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "James Risch", "party": "Republican", "sentence": "…intend to. You can't terminate something that is not going on. Every  American is opposed to the long, drawn-out conflicts that we have, in  our history, from time to time, experienced. I assure you that  President Trump feels exactly the same way. He hates those long, drawn- out conflicts. He hates any kind of kinetic action but realizes that as  Commander…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693132/motion-to-discharge-sj-res-59"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…All of these are very real and important and urgent issues that we have  tried to address, and there is more we can and should do.\n\nBut, under President Biden, the country experienced, as I said,  historic levels of inflation not seen since Jimmy Carter was President  of the United States. The cumulative inflation from the time President  Biden took office…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…respond to the need for environmental  responsibility and sustainability.\n\nWith the annual number of visitors to Lake Tahoe growing to 15  million people, Tahoe's beaches experienced a surge in waste,  particularly during peak travel seasons. JB and JT recognized the  problem and set out to find innovative and low-impact solutions to this  growing concern.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…Capital to  march for the most vulnerable among us: preborn children. I am so proud  to live in a country with such a strong and resilient pro-life  movement. While we have experienced many ups and downs in the cause for  life, one thing has never changed: We have never given up.\n\nThe fact that the March for Life has endured for 53 years speaks  volumes…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699389/rounds-mr-wicker-mr-lankford-mr-mcconnell-ms-lummis"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…birthday--a day marking a hundred years of  love, laughter, and commitment to her family, friends, and community.\n\nBorn on August 30, 1925, in Trenton, New Jersey, Helen has  experienced a century full of changes and milestones. Her life story  stands not only as a testament to longevity, but also to unwavering  character. Throughout her ten decades of life,…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694743/recognizing-helen-birkheads-100th-birthday"}]