[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…service,  and business software. As an additional requirement of the graduation  process, students must complete an internship with local community  partners to gain practical experience in a career pathway of their  choice. It is these types of programs that set the school apart and  help prepare students to thrive, no matter what they choose to do after…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695848/recognizing-canon-city-high-school"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…administration has cut funding contracts within the  Department that support data collection, learning tools, and programs  to increase test scores.\n\nMrs. McMahon does not have the experience required to support the  more than 62 million students in their elementary to postsecondary  education across the country. Mrs. McMahon has no experience teaching  or working…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688592/confirmation-of-linda-mcmahon"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…cuts to SNAP benefits and the school lunch  program. They spoke of how students will not be able to show up to  school ready to learn and how it would impact their learning experience  and their school environment.\n\nI spoke to families who told me that they didn't know how they would  be able to afford healthcare once their Medicaid is cut, once the  effective…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695039/better-is-possible"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…from all across the country to see the darkest skies in the  country in what is an International Dark Skies Sanctuary and one of the  most breathtaking trails that one can experience in our Nation's first  wilderness.\n\nRegardless, SRS is incredibly important to help ensure that our  schools and our roads continue to function as we expand New Mexico's…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…setbacks that would weaken       accountability, revive discriminatory practices, and replace       effective reforms with policies long discredited by research       and experience. We urge you to stand with the residents of       Washington, D.C., to uphold the principles of local self-      governance, and to vote NO on these bills. The nation is…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…wrong. We  need to listen to them and hold Big Pharma accountable.\n\nWhen people tell us that they see government as overly bureaucratic  and complex, we can't dismiss that experience and say that it is all  fine. We need to ensure that taxpayer dollars are spent responsibly.\n\nOf course, addressing waste, fraud, and abuse is important. We also  need to…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689078/economic-populism"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Carothers remembers it well. At the time, he was an intern for the  National Weather Service in Chicago under their Pathways student  program, which allowed him to gain experience at the National Weather  Service while he was earning his graduate degree in meteorology.\n\nEric has long been passionate about public service and meteorology. A  career at…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688591/recognizing-federal-employees"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…company--that is to say, an institution  responsible to shareholders or to the public--and he lacks essential  qualifications in his educational background as well as in his  experience.\n\nThe VA's 2025 budget request is for $370 billion. It is second only  to the Department of Defense. It needs someone who not only is loyal to  President Trump--in fact,…", "date": "2025-07-24", "source_url": "https://justfacts.votesmart.org/public-statement/1694219/9999"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…father's health is declining rapidly. Every single one of us knows what  it is like to have a loved one struggling when it comes to their care.  I know everyone knows that experience of saying we would try to move  Heaven and Earth to be able to make sure that they get the care that  they need in their time of greatest need. How can I--when I stand by…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695926/government-funding"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…here have learned from her--not just how to do our  jobs, but how to do them with purpose.\n\nWe will miss Rikki and her steady presence, her joyful spirit, and  her years of experience. But we take comfort in knowing that the values  she has instilled will continue to guide this workplace in the dozens  of new staffers she has trained and inspired. She…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696707/recognizing-the-career-of-erica-rikki-miller-and-her-work-on-behalf-of-michigans-3rd-congressional-district"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…their help to work side by side  with them. They are really indispensable employees.\n\nI also want to say that the people who we are losing, many of them  have had years of experience. They choose to work for the Forest  Service, for the Federal Government, because of their passion for  taking care of our public lands. They are talented. They are critical.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…leadership.\n\nJoAnne's lifelong commitment to educational equity was shaped early  in life. Born on February 11, 1946, she attended a segregated two-room  Catholic school--an experience that profoundly influenced her  dedication to ensuring that low-income children, children of color, and  students with learning disabilities received equitable access to…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698084/the-year"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…last 6 weeks or so, we have conducted kinetic strikes  against these boats without what I recognize as the legal authority to  do so. It is not something I have seen in my experience in the U.S.  Navy--I spent 25 years in the U.S. Navy--that I have seen during my  career. I am now retired. But during my career, I never saw a President  command the Department…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696346/trump-administration"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…met her husband,  Francis. Together, they spent over 40 years married, with two children  and four grandchildren.\n\nMillie was a school psychologist with over 30 years of experience in  the Greenburgh Central School District and still had time to be active  in numerous community groups and worthwhile projects that helped her  neighbors, particularly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695505/recognizing-the-life-of-millie-ortiz-sheehan"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…are talking about.\n\nThis amendment is intentionally discriminatory and will result in  higher rates of mental health issues and suicide for trans youth, kids  who already experience higher rates of depression, anxiety, and suicide  compared to their peers.\n\nRepublicans' all-out assault on healthcare right now has put these  people into a state of constant…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695248/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…majors, 25 minors, and 13 graduate programs.\n\nBy working shoulder to shoulder with farmers, agribusiness, and  public policymakers, Dean Buhr has worked to cultivate a student  experience that combines classroom learning with cutting-edge research  and public engagement, preparing CFANS graduates to become the world's  ag leaders of tomorrow.\n\nI thank Brian…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699023/recognizing-brian-buhr"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…intersection of law, diplomacy, security, and commerce, while always  advancing President Trump's America First agenda.\n\nMr. Kimmitt also brings over a decade of private sector experience as  a partner at Kirkland & Ellis, where he represented U.S. companies in  cases before the International Trade Commission and advised on supply  chain issues. He understands,…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694342/confirmation-of-william-kimmitt"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…they are not seeing the big picture. These particular  vehicles cannot sustain any type of saltwater flooding. They create a  thermal runaway. Fortunately, they may not have experience with what a  thermal runaway is where they live, but these are catastrophic events  that ultimately affect not just that vehicle but everyone around that  vehicle. It ties…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695161/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…subject to the  Paperwork Reduction Act's requirements. Removing these unnecessary  burdens will strengthen the advocate's ability to shape policy based on  real-world business experience.\n\nMr. HILL of Arkansas. Mr. Speaker, I include in the Record the CBO  estimate for this bill.       H.R. 3351, IMPROVING ACCESS TO SMALL BUSINESS INFORMATION ACT, AS\n\nREPORTED…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693954/improving-access-to-small-business-information-act"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…1981.\n\nMr. Sola is a fourth-generation farmer who has devoted his life to  nurturing the land his family has tended since it was homesteaded in  1903. Mr. Sola has extensive experience growing products including  cotton, corn, wheat, tomatoes, sugar beets, broccoli, cauliflower, and  watermelons, all of which are important crops to Central Valley. He  also…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697013/recognizing-vincent-sola"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…contracts should be  awarded through a fair and competitive bidding process that allows all  qualified contractors to compete on a level playing field based on  merit, based on experience, quality, and the safety of their workforce.\n\nProject labor agreement mandates prevent many small businesses from  competing for Federal projects and may even lead to increased…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693111/project-labor-agreements"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…bill (H.R. 659) to amend title 38, United States Code, to direct the  Chairman of the Board of Veterans' Appeals to give priority to  individuals with certain professional experience in recommending such  individuals to serve as members of the Board of Veterans' Appeals, and  for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699210/veterans-law-judge-experience-act-of-2025"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…Congressman Kevin Hern, and Legislative Director and  Deputy Chief of Staff for Ranking Member Kevin Brady before coming to  Team Jackson as my Chief of Staff. His extensive experience, knowledge,  and leadership in these roles have helped shape policy and governance  at the highest levels.\n\nDuring his tenure in my office, Jeff was instrumental in my success…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690377/recognizing-the-career-of-jeffery-ronald-billman"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "Mr. WIED. Mr. Speaker, I rise today in recognition of January as  National Blood Donor Month. Each winter, blood centers across the  Nation experience reduced donor turnout, while the need for blood  remains constant.\n\nIn the United States, someone requires a blood transfusion every 2  seconds to treat patients facing trauma,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699256/national-blood-donor-month"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…our  community.\n\nJim devoted his life to protecting others, serving in many roles over  the decades, including nearly 25 years as assistant fire chief.\n\nJim's leadership, experience, and commitment helped to shape the  department and mentor generations of firefighters. For nearly half a  century, Jim answered the call whenever his neighbors needed help.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699907/recognizing-joshua-hobson"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…the  camps, saw the horrors, and ordered that videographers record what was  seen so that people would believe because Ike was sure that it was so  far beyond the pale and experience of most people what had occurred in  the camps and to the Jewish people and others during the war at the  hands of the Nazi regime that, without seeing, they would not believe.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…has dedicated much of his life to public service, community  engagement, and leadership. He was first elected to the Royse City  Council in May 2010, building on earlier experience serving on the  Royse City Zoning Board of Adjustment, as well as similar service in  other communities. In 2013, he served on the Royse City ISD Strategic  Planning Committee…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698289/recognizing-the-success-of-tom-crowley"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…concern in  monitoring volcanic activity, but it is not just people on the ground  who are at risk. Aircraft that are flying within 1,000 miles of a  volcanic eruption can experience damage if they are not made aware of  the smoke. Volcanic eruptions can be detrimental, and even fatal, to  passengers and crew.\n\nThe lives of families near erupting volcanoes…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698113/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…You  actually had the University of Georgia that went and asked voters after  that election, and a whopping zero percent, Mr. Speaker, of Black  voters said they had a poor experience going to the ballot. Over 72  percent said they had an excellent experience at the ballot. Then, you  could go further.\n\nBy the way, the American people get this. They understand…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700016/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Armed Services Committee, by the way--a Senator who knows probably more  about the military than anyone else here--has it exactly right.\n\nGeneral Caine has this breadth of experience, not just as a fighter  pilot with thousands of hours, combat hours, in flight but has worked  very closely with our intel services and has very significant combat  experience…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}]