[{"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…Labor-Health and Human  Services bill passed. It passed the Senate; it passed the House; and it  was signed into law by President Trump on September 28--just days short  of the expiration of fiscal year 2018. It wasn't the only pair of  bills. Several other appropriations bills were enacted prior to October  1 also.\n\nMy Republican colleagues knew then that…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693591/rescissions-act-of-2025"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…thank goodness,  the Democratic leadership in this House put forth an opportunity to  solve one of the most critical problems that face Americans right now,  and that is the expiration of the Affordable Care Act tax credits. That  has happened. Today, on this floor, there was a vote. Fortunately, the  House of Representatives, led by the Democrats and a…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698666/protecting-healthcare-for-millions-of-americans"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…During this emergency, Congress and the VA rightfully allowed borrowers  to request forbearance and allowed missed payments to be added to the  end of the loan term.\n\n``Upon expiration of this pandemic program, VA used this authority to  end borrowers' ability to push missed payments to the end of the loan  term and created VASP to help up to 80,000 veterans…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689686/prioritizing-veterans-survivors-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…difficult and less affordable for hardworking families across our  Nation through chaotic trade policies and devastating cuts to  healthcare and food programs.\n\nThe pending expiration of health insurance subsidies at the close of  this year, in particular, threatens to impose a severe and unwarranted  tax hike on the middle class.\n\nAllowing these subsidies…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695661/healthcare-subsidies-and-rescissions"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…Congress has 3 legislative days left to extend the ACA tax credits,  or they will expire at the end of the year. The impact of the tax  credits expiring is devastating. Expiration of the tax credits will  result in health premiums increasing by an average of 114 percent for  individuals who rely on the marketplace, forcing 4.2 million people to  lose…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698301/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…to keep their premium costs low to be able to afford  health insurance.\n\nExtending the tax credits has been a priority, and we have been  calling attention to the looming expiration of these vital tax credits  since last year. In fact, three times during this past year, my  Democratic colleagues and I have tried to pass our legislation to offer  some…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695663/cloture-motion"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…Moreover, since  2002, AGOA has spurred more than $500 billion in exports to the United  States.\n\nHowever, this year, the impact of the reciprocal tariffs, coupled  with the expiration of AGOA on September 30, threaten to erode 25 years  of economic cooperation.\n\nIf we fail to act, we will likely see weakening supply chains and  increased poverty across…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…which, at the end of the day, is just going to--as we have seen  already--is going to increase healthcare costs for everybody.\n\nWe know that at the end of last year, as the expiration of the ACA  enhanced premium tax credits approached, Democrats in Congress worked  hard to try to extend them. We put forward a strong, compromised  proposal to extend the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698976/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…medications that many, many rely on.\n\nYet, because of a prolonged and entirely avoidable Trump-Republican  government shutdown and because Republicans refused to negotiate, the  expiration of these credits will hit working families the hardest. In a  city where the cost of living is already sky high, premium spikes will  push many in New York's Ninth District…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…clean CR! This is a dirty, corrupt  Continuing Resolution that I cannot in good conscience support. This CR  does nothing to address the Affordable Care Act subsidies whose  expiration Republicans refused to address. This CR includes a shameful  stealthy provision that would allow eight senators to sue the federal  government for millions of dollars. To…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696678/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Act's enhanced premium tax credits through a  clean, 3-year extension.\n\nLast year, the Republicans blocked the extension of these credits in  the big, ugly bill. With the expiration of the tax credits last month,  the health premium costs have skyrocketed, causing millions to lose  their coverage.\n\nWhen more people lose coverage, costs go up for everyone.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698801/breaking-the-gridlock-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…affordability crisis. Instead,  chaotic trade policies, along with devastating cuts to healthcare and  food programs by the President, have only driven up costs.\n\nThe recent expiration of ACA tax credits makes things even worse. In  Maryland, it is the equivalent of a $4,700 tax hike. I have heard from  many constituents who are now forgoing insurance altogether,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698590/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…books said: Sorry, it is too late. The deadline to bring your  case has passed.\n\nVirginia's Law will change that because justice for victims of abuse  should not have an expiration date.\n\nCongress should pass this law immediately. We know when Congress has  the will, it can pass legislation with lightning speed. We passed the  Epstein Files Transparency…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699879/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…START treaty for 1 year  after February 5, 2026,'' if the United States reciprocates. In  response, Trump said: ``Sounds like a good idea to me.''\n\nHere we are, 22 days from expiration. The White House has yet to  reply to the Kremlin's offer. The clock is ticking.\n\nI ask the administration to respond to the Russians today: announce  we will abide by the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699036/expiration-of-new-start"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…system while Americans began receiving their  notices that their healthcare premiums would skyrocket and Republicans  stood idly by.\n\nNow we are just 2 weeks away from the expiration of these tax  credits, and this half-baked plan isn't going to cut it.\n\nMs. McCLELLAN. Mr. Speaker, I thank Mr. Carter for his remarks.\n\nMr. Speaker, I wasn't here when the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…taught  about in school, conduct oversight, lower prices, and protect our  healthcare.\n\nSo what are Republicans doing?\n\nLast week, following the invasion of Venezuela and the expiration of  the healthcare tax credits, their priority was a bill about  showerheads. This week it is worse. They are actively putting their  thumb on the scale in favor of big corporations…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…mineral leasing       laws.\n\n3. This withdrawal will expire 20 years from the effective       date of this order unless, as a result of a review conducted       before the expiration date pursuant to Section 204(f) of the       Federal Land Policy and Management Act of 1976, 43 U.S.C.       1714(f), the Secretary determines that the withdrawal shall…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…premium costs have skyrocketed. Networks  have shrunk, and the system has become bloated and inefficient.\n\nIt is important to remember that the enhanced premium tax credit  expiration at the end of the year, again, was set by Democrats. When  they are complaining that Republicans are going to let this expire,  that was their timeline. This zero-dollar…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…original act mandates sanctions on  individuals and entities involved in Iran's energy sector in its  efforts to develop weapons of mass destruction. By eliminating the  expiration date, we ensure that these sanctions remain a steadfast  component of our national security strategy.\n\nThe Iran Sanctions Act has been a cornerstone in our efforts to deter…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690689/solidify-iran-sanctions-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…percent of Zambia's exports to the United States       went through AGOA, making its renewal vital to sustaining       U.S.-Zambia commercial diplomacy.\n\nMore broadly, the expiration of AGOA would likely prompt       many African countries to reassess their economic diplomacy       strategies. Without preferential access to the U.S. market,       governments…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Speaker, I rise today to urge prompt  action on a matter that could make life a lot more difficult for  millions and millions of people in this country, and that is the  expiration of tax credits that could lead to a massive increase in  healthcare costs.\n\nWe are talking about 22 million Americans who will be directly  affected, some of them seeing…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…into political gains using the  American people as collateral.\n\nIt is worth reiterating. Democrats funded temporary Band-Aids to  cover up unaffordable care. They set the expiration dates. They chose  to fund liberal priorities instead of making them permanent.\n\nWhile Democrats continue to fearmonger, I want to shed light on what  Republicans are doing…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…be       appointed for a term of 2 years, except as provided in       subparagraph (B).\n\n(B) Vacancies.--Any member appointed to fill a vacancy       occurring before the expiration of the term for which the       member's predecessor was appointed shall be appointed only       for the remainder of that term. A member may serve after the       expiration…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693435/communications-security-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…active       merchant mariner credential issued under this part that is       not an extension under subsection (a) or (b), such credential       shall begin the day after the expiration of the active       credential of the credential holder.'; and\n\n``(2) in section 7510(c)--\n\n``(A) in the subsection heading by striking `Exam Review'       and inserting…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…congressional districts in the  country, and still, 99.7 percent of my constituents in my district, one  of the poorest congressional districts, will be unaffected by this  expiration.\n\nThis is all about subsidizing the wealthy, so why are we even having  this debate? It is because Democrats chose to make these giveaways  temporary--not once, but twice,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…year. This is all of their own making.\n\nI mean, somehow, they have tried to shift the narrative here that  this is somehow a problem of the Republicans' making. They set the  expiration date, and they passed the legislation in 2021 and 2022 that  led to this explosion in costs.\n\nAnd so now the 10-year score on this program--the 10-year score on  this program--is…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Utah.\n\nThe One Big Beautiful Bill Act also helps Utahns by reauthorizing the  Radiation Exposure Compensation Act, also known as RECA, for another 2  years following its expiration last year. RECA authorization will  compensate Utahns who were exposed to radiation after the aboveground  atomic testing  at the Nevada Test Site. It will also extend compensation…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694171/benefits-of-one-big-beautiful-bill"}, {"senator": "French Hill", "party": "Republican", "sentence": "…established by the Secretary, assumes the duties and       obligations of the deceased owner with respect to funds       provided under this title.''.\n\n(h) Elimination of Expiration of Right to Draw Home       Investment Trust Funds.--Section 218 of the Cranston-Gonzalez       National Affordable Housing Act (42 U.S.C. 12748) is       amended--\n\n(1)…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…compliance with other Federal       law;\n\n(4) modernize the recordkeeping requirements contained in       the original depredation order; and\n\n(5) remove the June 30, 2014, expiration date contained in       the original depredation order.\n\n(c) Renewal.--Not less than once every 5 years after the       date on which the Secretary reissues the original…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697641/cormorant-relief-act-of-2025"}]