[{"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…and Economics.\n\n26. Executive Calendar #305--Jovan Jovanovic, of       Pennsylvania, to be President of the Export-Import Bank of       the United States for a term expiring January 20, 2029.\n\n27. Executive Calendar #324--Richard Fordyce, of Missouri,       to be Under Secretary of Agriculture for Farm Production and       Conservation.\n\n28. Executive…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695711/s-res-377"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…groceries and other  expenses.\n\nI heard from another constituent in Clark County. She works three  jobs, but none of them--none of them provide healthcare. Because of the  expiring subsidies, the cost of her basic bronze plan has doubled to  $1,050 per month with a deductible of $9,000. She is going to an  occupational therapy provider for arthritis.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697783/healthcare"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…reluctant to leave my home. I constantly worry about       losing my house and being unable to drive or work because my       driver's license and work permit are at risk of expiring.\n\nI am overwhelmed by the thought of not being able to work.       I have many bills to pay and two children who depend on me. I       respectfully pray that those in authority…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "Ms. DelBENE. Mr. Speaker, I rise today to call out the impact of the  Republican healthcare crisis in my community, particularly those hurt  by the expiring tax credits.\n\nOne of those people is Gerry from Kirkland. Gerry has cancer and  depends on his Affordable Care Act coverage to afford treatment. Right  now, Gerry and his…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698442/impact-of-expiring-tax-credits"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…York. Mr. Speaker, I thank the gentlewoman from  Virginia for anchoring us in the Congressional Black Caucus' Special  Order hour, ``Stories from Home: The human costs of expiring healthcare  tax credits.''\n\nTonight, we have already heard from my colleagues, and we speak for  everyday Americans, families, seniors, young adults, and workers who  now…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…No. 314 on the cloture motion, Motion to Invoke  Cloture: Olivia Trusty, of Maryland, to be a Member of the Federal  Communications Commission for the remainder of the term expiring June  30, 2025.", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692680/vote-explanation"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…state health exchange and on average       pay $850 a month for insurance. We got a letter the other day       that our rates will be increasing a lot due to ACA rates       expiring. On top of high monthly premiums, we have high       deductibles and many things are not covered. We also pay for       all vision and dental expenses out of pocket as they…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696732/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…today is  barely even a concept of a healthcare plan. After 15 years of efforts,  they should be embarrassed by this slapdash effort.\n\nNot only does the bill not address the expiring tax credits, it hurts  patients, it hurts families, and it hurts women and seniors.\n\nI want to be very clear. My Republican colleagues are taking zero  action to extend the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698395/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…glad to  have Fauquier Hospital serving our community.\n\nHealthcare institutions around the country continue to face  challenges, with cuts to Medicaid, the ACA tax credits expiring, and  burned-out workforces that are asked to do more with less every single  day.\n\nThe Senate must take up the 3-year ACA tax credit extension to  address healthcare costs.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698917/korean-american-day"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "Ms. MOORE of Wisconsin. Mr. Speaker, I thank Mr. Neal for the time.\n\nMr. Speaker, time is up. The ACA tax credits are expiring December  31.\n\nThe ACA premium tax credits have provided healthcare access for 15  years to over 20 million people who were previously uninsured. The ACA  has saved lives,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698372/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…but perhaps this one from PBS, ``A closer look at who relies on  Medicaid.''\n\nThis is what PBS wrote:\n\nAs congressional Republicans seek about $4.5 trillion to       extend expiring tax cuts, the Federal Government will need to       find savings elsewhere.\n\nYou are going to give that $4.5 trillion that disproportionately go  to the wealthy, and you are…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…over a government shutdown? The real  reason that is being given priority is that the tax cuts that were  passed in 2017, particularly on personal rates, are going to be  expiring in 2025. For the people who benefited the most, the top 1  percent of this country in terms of their economic position, for them,  that is their number one priority.\n\nA week…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687944/republican-budget-betrays-middle-class"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…continue to work on long-term  solutions to make health insurance more affordable for Americans.\n\nSo I urge my colleagues to continue to work with us. The ACA tax  credits expiring at the end of this year and this enrollment that we  are going to see on November 1, that everybody is going to see how much  these costs are going up--I am asking my colleagues,…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696494/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "Ms. ROSS. Mr. Speaker, we have reached the precipice of a full-blown  healthcare crisis in North Carolina and this country. ACA tax credits  are only weeks away from expiring. Unless Congress acts, an estimated  157,000 North Carolinians will lose their coverage.\n\nThis week, I led my North Carolina colleagues in demanding actions  from Speaker…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698079/healthcare-crisis-in-north-carolina"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…invading  and threatening to invade other countries, he would drop the idea of  resuming nuclear testing, and he would make tangible, necessary steps  to prevent New START from expiring, to make sure the catastrophic  consequences of a new nuclear arms race are averted.\n\nUnless there is dramatic action, the world will be a much more  dangerous place after…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699032/expiration-of-new-start"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Missouri. Mr. Speaker, I am prepared to close, and I  reserve the balance of my time.\n\nMr. Speaker, I will remind the body that the reason why these  enhanced subsidies are expiring is because the Democrats are the only  ones in this Chamber who voted for them to expire on December 31.  Apparently, they regret that vote because they focused most of their…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…State.\n\nNow, as you might imagine, one of the major themes of my discussion  back home was the importance of our major task at hand here in the  Senate, which is extending the expiring provisions of the Tax Cuts and  Jobs Act. While we made an important first step by passing the budget  resolution in the House and the Senate, now the various committees of…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}, {"senator": "Bill Hagerty", "party": "Republican", "sentence": "…report.\n\nThe senior assistant legislative clerk read the nomination of Frank  Bisignano, of New Jersey, to be Commissioner of Social Security  Administration for the term expiring January 19, 2031.", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690564/executive-calendar"}, {"senator": "John Thune", "party": "Republican", "sentence": "…got bigger. It was good  for small business and good for American workers, and it led to a very  strong economy before the pandemic.\n\nBut many of the law's provisions are expiring at the end of this  year, and if we don't extend the Tax Cuts and Jobs Act, small  businesses will face a $600 billion tax hike in 2026. Republicans do  not intend to let…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690626/national-small-business-week"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…trillion.\n\nIf anyone else is playing along, I have Medicare reform, $1.8  trillion, and talent-based immigration, $150 billion. Let's say we were  able to get just part of the expiring provisions, that is $540 billion.  I just covered every dime of the reconciliation budget.\n\nThere is no borrowing, and you maximize economic growth because you  are not engaging…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…fast.\n\nThey called it, at the time, a temporary plan to be able to help  during COVID. But then a year later, they added another 2 years on top  of it. That is now what is expiring at the end of this year, their  temporary COVID extension. The problem is, the price continues to go up  so rapidly that now no one can afford the plan anymore.\n\nIn my State…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Commerce.\n\nMr. GUTHRIE. Mr. Chair, I yield myself the balance of my time.\n\nMr. Chair, I appreciate my friend bringing up the enhanced or COVID- era premium tax credits that are expiring at the end of this month.  Since we are talking energy tonight, we need to understand that they  were set to expire, without a single Republican vote, to expire them in  the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…coverage. This is something  we need checks and balances on.\n\nWhen they moved the original Obama subsidies--and those aren't going  anywhere. They are still in place. They are not expiring at the end of  this year. They have existed from the start. It is only the Democrat  Party's 2021 enhanced version that is expiring.\n\nThe worst aspect of those, in my opinion,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…in  history. It would be a $4 trillion tax hike.\n\nThat is why, earlier this month, Republicans in Congress passed a  budget resolution that will enable us to extend these expiring cuts. At  the same time, we are advancing other tax priorities that are  championed by the President, including his proposal to cut taxes on  Social Security.\n\nBy taxing Social…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…This is hard for people  to accept, but it is the math. Over the next 10 years, the baseline  borrowing was about $22 trillion. We are trying to figure out how to  extend the expiring tax provisions. We have the requests from the White  House. We have other disasters and things we are trying to cover.\n\nWe are basically looking at--and I am going to show…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…ago, and I am  sorry it is handwritten. I broke the printer. It is just simply making  a point that for the average American at the end of this year, if we  don't fix the expiring provisions, their taxes go up $2,853,  and functionally 62 percent of all taxpayers will be subject to higher  taxes.\n\nNow, we actually have our friends on the left basically…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…and Urban Development\n\nExecutive Calendar No. 305, Jovan Jovanovic, of       Pennsylvania, to be President of the Export-Import Bank of       the United States for a term expiring January 20, 2029\n\nExecutive Calendar No. 324, Richard Fordyce, of Missouri,       to be Under Secretary of Agriculture for Farm Production and       Conservation\n\nExecutive…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695696/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…Federal Government is currently shut down. It is shut down  because we can't come to an agreement here in the Senate, with the  President, and with the House to deal with the expiring Affordable Care  Act tax credits that make it affordable.\n\nLetters are about to go out in my home State of Delaware that will  tell folks who get their health insurance through…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696237/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…here is the punch line which worries me and why I beg my  brothers and sisters: For those of us in the House, we have a  reconciliation budget. We are trying not to let the expiring provisions  raise people's taxes. We have a reconciliation budget in the House  that, if we do everything right, we get a couple trillion dollars of  savings over 10 years.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}]