[{"senator": "Judy Chu", "party": "Democrat", "sentence": "Ms. CHU. Mr. Speaker, 1 week ago, Republicans skyrocketed healthcare  costs for 22 million Americans. They chose to let the ACA tax credits  expire, even though there was bipartisan support to extend them.\n\nNow, families are seeing premiums jump by hundreds, even thousands,  of dollars a month. That is utterly devastating…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698797/breaking-the-gridlock-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…assistance they need to navigate the complicated and convoluted world  of bankruptcy proceedings.\n\nThe bill also extends 29 temporary bankruptcy judgeships that are set  to expire. In my State of Maryland alone, we are on track to lose three  out of seven temporary judgeships. That is nearly half of our entire  bankruptcy bench. We cannot afford to lose…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698846/bankruptcy-administration-improvement-act-of-2025"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…healthcare costs for  millions of Americans.\n\nAs of January 1, more than 400,000 Alabamians faced higher premiums  because Republicans in this body let the ACA tax credits expire. That  is on top of the nearly $1 trillion in cuts that Republicans made to  healthcare earlier this year.\n\nToday's vote represents one more chance for Republicans to do the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698813/breaking-the-gridlock-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…we must do more than simply pass this bill. Since fentanyl- related substances were originally scheduled by the DEA, in 2018,  Congress has never allowed this authority to expire. So, by passing  this bill, we are merely maintaining the status quo. We must also  address how this poison gets into the hands of the most vulnerable: our  children. Too often,…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688848/halt-fentanyl-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Although Belgium prohibits the destruction of reusable medical  devices, aid workers worry that the Trump administration will run down  the clock until these contraceptives expire. Most of the products  expire in 2028 or 2029, with some expiring as early as April 2027.  Destination countries often have rules for importing medical supplies  based on remaining…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696465/womens-health"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…things that are actually, hopefully, much more       productive.\n\nI could not agree more with what President Trump said. It is why I  want to speak today about the soon-to-expire New START treaty and the  very real possibility of a new nuclear arms race, something that  neither the President, the Vice President, nor any other senior  official has even…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Lauren Underwood", "party": "Democrat", "sentence": "Ms. UNDERWOOD. Mr. Speaker, I rise today because, in just 2 weeks,  the Affordable Care Act tax credits that help millions of Americans  afford their premiums will expire, and this Republican healthcare bill  does absolutely nothing to keep costs from surging.\n\nIn fact, every House Democrat has signed a discharge petition for my  bill to extend…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698394/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…of the aisle  have blocked each and every one of these efforts.\n\nNow, this program to provide that help that families need to cover  their cost of health insurance is set to expire at the end of the year,  and there is no plan in sight to replace it and to help families afford  health insurance. Allowing these tax credits to expire is going to harm  the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695663/cloture-motion"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…creating loopholes for plans that will escape any  regulatory oversight.\n\nFurther, Mr. Speaker, this plan does nothing to extend the ACA  enhanced tax credits which are set to expire. Millions of people will  see their premiums skyrocket, and millions more won't be able to afford  any insurance at all. If we bring up the bipartisan bill, then we could…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698382/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…they are already seeing.  It is raising costs for everyday Americans.\n\nAnd now, if Congress doesn't act to extend the Affordable Care Act's  health tax credits before they expire, more than 20 million Americans  will see their premiums soar, putting their coverage at risk.\n\nI go to all 87 counties in my State every single year, and I visit  rural hospitals.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695651/healthcare"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…years of Active Duty service in the  Air Force was fired from the VA in Michigan after receiving an  ``outstanding'' performance review. His probationary period was set to  expire last week, just 12 days after he was let go.\n\nThese cuts are not based on fact. They are not based on logic. They  are just cruel. And our country will not be better off. As…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688440/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…billion a day interest payment that the Democrats, under Joe  Biden's lead, left the United States citizens with. Now we hear their  demand that we allow the current tax rates to expire, thereby raising  taxes on virtually every American citizen.\n\nIt is very convenient that they say billionaires. Now, they have  acknowledged millionaires, but just factually…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…adults, and workers who  now face the devastating reality that their healthcare premiums are  about to double--in some cases, triple and quadruple--when critical tax  credits expire at year's end.\n\nIn New York's Ninth Congressional District, this crisis is not  theoretical. It is happening to the single mother in Flatbush,  Brooklyn, who finally had been…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…debating the definition of showerheads. Really? Millions of  Americans are losing their healthcare coverage after Republicans  allowed the Affordable Care Act tax credits to expire.\n\nThe nightmare of families having to choose between taking their child  to the doctor or paying their rent is now a reality, hitting my home  State of Florida especially hard.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…uncompensated care.\n\nMr. Speaker, when people come off of Medicaid and when the Enhanced  Premium Tax Credits for purchasing insurance on the Affordable Care Act  Exchange expire if we don't act by the end of this year and more people  become uninsured, they are not going to magically never get sick. They  are going to get sick.\n\nWhen they get sick…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…beneficiaries.\n\nZero-claim enrollment numbers dwarf potential coverage loss       estimates of not extending the COVID credits. This anomaly       suggests that when the COVID credits expire on schedule at       the end of 2025, they will likely have little to no negative       effect on access to health care services or health.\n\nTo curb fraudulent enrollment that…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698438/uncovering-widespread-fraud-in-obamacare"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…were seeing record profits. That is now  what they want Republicans to renew.\n\nIt is an insurance company bailout that Democrats created to be  temporary. They set it up to expire. They are now saying that the world  is going to end if that insurance company bailout doesn't get renewed.\n\nAt the same time we as Republicans worked to actually lower premiums…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696745/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…enormously successful, and we  know this, in allowing families to keep more of their paychecks and  supercharging growth for small businesses.\n\nIf these tax cuts are allowed to expire, as we have heard, the  average American would suffer. Make no mistake, small businesses,  family farms, and so many other folks would suffer.\n\nMr. SMITH of Nebraska. Mr. Chair,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688061/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…from reality. Adding qualified providers to the list of grantees  helps keep the door open for veterans seeking mental health services.  The reality is this program is set to expire in September, and we  cannot allow this to happen.\n\nDelay jeopardizes this program. We have big problems to solve. Adding  qualified mental health providers will only help.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691509/no-wrong-door-for-veterans-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…have reinvested in the U.S. and, at the same  time, have reinvested in their communities, reinvested in their  employees, and have grown their presence. Most of that is set to expire  at the end of this year. If we don't get a tax bill done, then you are  just going to see a significant tax increase across everything.\n\nMr. Speaker, I will also talk briefly…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "John Thune", "party": "Republican", "sentence": "…filed during Tuesday's session of the Senate  ripen following disposition of the O'Neill nomination and if cloture is  invoked on the Eisenberg nomination, the postcloture time expire at  1:45 p.m. tomorrow; finally, that if cloture is invoked on the Shumate  nomination, all postcloture time be expired and the Senate vote on  confirmation of the Shumate…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691911/authorizing-testimony-document-production-and-representation-by-the-senate-legal-counsel-in-the-case-of-in-re-architect-of-the-capitol-employment-dispute"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…show. That is what we know.\n\nLook here. These are the projections of the way things will be if we  do nothing.\n\nThe blue line, we do nothing this year. We let the tax cuts expire,  taxes go up--let me repeat, I am against that--taxes go up, revenues  are projected to do what they do, and we will have the amount of debt  over the next 10 years we see…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…eliminate the upcoming 2026 sunset from the  Iran Sanctions Act.\n\nWe need to send Iran a clear and simple message. They cannot wait out  our sanctions. Our sanctions will not expire on some arbitrary date.  The only way to make U.S. sanctions go away is to stop the sanctionable  conduct and not threaten the United States' national security interests  or…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690688/solidify-iran-sanctions-act-of-2025"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…century of reliable, clean  power.\n\nFor decades, Congress has allowed for the continued use of the  Federal lands for this purpose, but unless we act now, the  authorization will expire in 2026.\n\nWithout authorization, Southern California Edison would be forced to  dismantle critical infrastructure, costing ratepayers in the region  tens of millions of dollars…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693463/amendment-to-kaweah-project-provision"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…disproportionately harmed  by lockdown policies due to their reliance on confined gathering  spaces.\n\nThe statute of limitations for prosecuting fraud within these  programs is set to expire beginning early next year. If Congress does  not act, law enforcement will not have the necessary time to  investigate and prosecute these crimes.\n\nAlong with my colleague,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697225/sba-fraud-enforcement-extension-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…positions for which       the Commandant determines a direct hire authority remains       necessary.\n\n``(e) Sunset.--The authority provided under subsection (a)       shall expire on September 30, 2030.''.\n\n(b) Clerical Amendment.--The analysis for chapter 25 of       title 14, United States Code, is amended by inserting after       the item relating…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Now, Democrats are uniting behind that policy to send billions more  of taxpayer dollars to big health insurance plans. With the Democrats'  temporary COVID credits set to expire at the end of the year, they are  attempting to turn their policy failures into political gains using the  American people as collateral.\n\nIt is worth reiterating. Democrats…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…on the floor talking about this and about how  Democrats are peddling falsehoods to try to justify their Schumer  shutdown. They claim that ObamaCare subsidies are going to expire. In  reality, it is only the Biden COVID credit bonus that will expire.\n\nWhat happened during COVID for the ObamaCare subsidies--they took off  the income caps, and a lot of…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…they  predate the park's expansion and have long been recognized by Congress  as a valuable energy asset.\n\nWith the current statutory authorization for the permits set to  expire in 2026, this bill provides much-needed certainty for the  continued operation of a critical source of reliable energy. Without an  extension, Southern California Edison will…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693461/amendment-to-kaweah-project-provision"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…would have had to pay an  additional $7,450 in taxes next spring without that legislation having  passed. The lower rates from the Tax Cuts and Jobs Act from 2017 were  set to expire at the end of this year, but the Working Families Tax  Cuts bill made these lower rates permanent.\n\nIn addition to the increased standard deduction and lower rates  across…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}]