[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…harmful, and completely out of touch  with the needs of the American people. Donald Trump held an extravagant  Great Gatsby party at Mar-a-Lago the night before SNAP benefits  expired, and the administration and Republicans continue to ignore the  needs of working families. That's not governing; it's a cruel and  corrupt abdication of their promise and…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696722/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…increased  is because when my friends passed this tax bill when Trump was last in  office, the majority made all the tax cuts for middle-class families  temporary. They all expired. Mr. Speaker, do you know what Republicans  didn't make temporary? The tax breaks for corporations; those are  permanent. Those are permanent, and that says it all there.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…vulnerable with it? America's credibility and global leadership must  not yield to this con.\n\nLet's get to the real waste. The real waste is incinerating 500  metric tons of expired aid sitting in warehouses meant to feed  suffering children in Afghanistan and Pakistan.\n\nThe real fraud is telling the American people that these cuts will  help them, and…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693706/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "Mr. KRISHNAMOORTHI. Mr. Speaker, I rise in support of extension of  the ACA tax credits.\n\nI met Shadene Butchart in Chicago. She has ALS. Since the ACA tax  credits have expired, her health insurance premium consumes the  entirety of her husband's Social Security check. She will not be able  to afford any health insurance to cover this incredibly…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698805/breaking-the-gridlock-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…basic laws to ensure that those pipelines are safe.\n\nThe authorization for pipeline safety activities at the Pipeline and  Hazardous Materials Safety Administration, or PHMSA, expired about 2  years ago. At no point in the last 2 years have Republicans put a bill  on the floor that would reauthorize pipeline safety activities. I guess  they don't care about…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…opportunity to extend it  during the reconciliation bill. My colleagues did not. Republicans had  the opportunity right through the end of this year to extend it before  it expired, and all these double and triple costs per month for health  insurance started on January 1. My Republican colleagues didn't do it  and are not doing it now.\n\nWe had the debate…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…And I talked about West Virginia, the  Presiding Officer's great State, where folks will face enormously high  premium increases if these Affordable Care Act subsidies are expired.  It will be brutal. I told the Presiding Officer about my visit to West  Virginia, my respect for the coal miners, those hard-  working folks there. And I know how highly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…it is safe to continue going to       work. Many are afraid to leave their homes. Others are facing       the immediate loss of income because their work permits have       expired and they are legally barred from working, despite       having jobs and employers who need them.\n\nOne constituent told us, ``My main concern is that I don't       want to…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…harmful, and completely out of touch with the needs  of the American people. Donald Trump held an extravagant Great Gatsby  party at Mar-a-Lago the night before SNAP benefits expired, while the  administration and Republicans continue to ignore the needs of working  families. That is not governing. They have abandoned their  responsibility to bring down…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696695/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…coming for more than a year. And if  we are serious about protecting both the physical and financial health  of Americans, we must restore the enhanced premium tax credits that  expired on December 31.\n\nCongress has not fulfilled its duty to protect Americans from rising  healthcare costs. And at a time when so many Americans are worried  about the cost of…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699085/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…problem after being shamed by their constituents. They are rolling out  new bills to reimburse benefits.\n\nI ask my Republican colleagues, where were you in December when the  law expired? Republicans tanked the bipartisan deal to continue benefit  replacement.\n\nWe don't need more gratuitous bills from Republicans who just voted  to cut SNAP by $300 billion.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692258/end-hunger-now-snap-skimming"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…when there  was a medical emergency in the middle of the night, emergency medical  services had the roads that they needed to save lives.\n\nThat stability vanished when SRS expired in 2024. Rural counties  across the West, including mine, were forced to make impossible  decisions.\n\nIn New Mexico alone, our communities lost more than $9 million in a…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…pushed forward an extension, a 3-year extension of the  Affordable Care Act subsidies which will be exceedingly important.\n\nThe Affordable Care Act enhanced premium credits expired. They  expired last year at the end of the year, and 4 million Americans  immediately faced a problem. The expiration of these tax credits not  only raised the cost for individuals…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698666/protecting-healthcare-for-millions-of-americans"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…majority leader, in  consultation with the Democratic leader, no earlier than Monday; and  that if cloture is invoked upon reconsideration, the postcloture time  be deemed expired.\n\nWhat does that mean? It means that you would have kept your  optionality to go nuclear on Monday and not have lost a thing. The  leader would have been able to go nuclear…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695313/cloture-motion"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Act enhanced premium  tax credits under Trump's Big Beautiful Bill. Last year, 22 million  Americans relied on these credits to afford their healthcare, but now  they have expired. Despite pressure from patients, physicians, and  providers, congressional Republicans refused to extend them.\n\nWhat is the impact of refusing to extend this program that…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698601/healthcare"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…empathy for  women and respect for the weakest and most vulnerable.\n\nMr. SMITH of Missouri. Mr. Speaker, I remind this body that the  reason why these COVID-era tax credits expired is because the Democrats  focused all their resources on helping their wealthy environmentalists  with permanent tax credits for electric vehicles and solar panels.\n\nMr. SMITH…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…THUNE.  74 and 75, the mandatory quorum calls be waived  and they ripen at 1 a.m., Friday, April 11; further if cloture is  invoked on Calendar No. 74, all post-cloture time be expired and the  Senate vote on confirmation of the nomination; further, if cloture is  invoked on Calendar No. 75, all postcloture time be expired and the  Senate vote on confirmation…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690107/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…economic engagement with Haiti, the HELP/HOPE  program has supported industry growth while encouraging a more stable  business environment. However, as with AGOA and other expired  preference programs, Haiti HELP/HOPE should not be the extent of our  engagement. Congress and the Trump administration must develop  additional strategies to work with Haiti…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698849/haiti-economic-lift-program-extension-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…go on TV and act outraged about Abrego Garcia being  deported? Give me a break.\n\nHere are the facts. He was pulled over by the Tennessee Highway  Patrol for speeding with an expired license. He was detained. He had  folks in his vehicle that were apparently not American citizens. Then  he was ordered by Biden's FBI to be released.\n\nIn court documents,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690313/abrego-garcia"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Wall Street Journal, about 62 percent of taxpayers  would see their taxes go up if Democrats had their way and the  temporary tax provisions in the Tax Cuts and Jobs Act had expired.\n\nBut it is important for us to begin to chip away at that national  debt. I have said, time and time again, that we are spending more money  on interest on the national debt…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…unspeakable  tragedy that happened in Boulder, Colorado, in my home State of  Colorado.\n\nThe person who perpetrated that crime obtained a visa in August of  2022. Their visa expired in February of 2023, and my home State of  Colorado issued them a driver's license in July of 2024.\n\nMr. Speaker, Colorado lawmakers and our Governor gave him a sanctuary…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691724/boulder-terrorist-attack"}, {"senator": "John Curtis", "party": "Republican", "sentence": "…PRESIDING OFFICER (Mr. Curtis). Senator, excuse me. Let me  consult the Parliamentarian for just a second.\n\nThe 10 minutes allotted to the Senator in morning business has  expired. Another Senator may seek recognition in his or her own right.\n\nThe Senator from Washington.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692500/alex-padilla"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…drugs to market.\n\nBecause of the shutdown, because of my Democratic colleagues refusing  to vote to open the government, for the first time in history, a user  fee program has expired, meaning patient access to new over-the-counter  treatments for common ailments is in jeopardy.\n\nI am a doctor. I want to tackle the numerous issues facing our  healthcare…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…before the markets opened on Monday  morning: I will not allow any Board member for the Federal Reserve to  go through the Banking Committee for a Chair or for replacement of  expired terms until this matter is settled. I have no problem with us  having an investigation, like we should with so many other areas of the  government.\n\nI would like to have oversight…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…Competitiveness Act of 2015 established a  reporting requirement from the Department of Commerce on the status of  commercial remote sensing licensing and regulation. That requirement  expired in 2020.\n\nH.R. 1325 will reinstate the reporting requirement and keep Congress  informed of agency actions, their impact on licensees, and the state of  the commercial remote…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688972/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Competitiveness Act of 2015 established a  reporting requirement for the Department of Commerce on the status of  commercial remote sensing licensing and regulation. That requirement  expired in 2020. H.R. 1325 will reinstate this reporting requirement  and keep Congress informed of agency actions, their impact on  licensees, and the state of the commercial remote…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688971/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…or severely maimed U.S. citizens  and other lawful residents, depriving families of their loved ones and  causing untold human misery. Some of these aliens have driven with  expired licenses, suspended licenses, or no license at all and have  shown complete disregard for the danger this may pose.\n\nLast January, two college students in Illinois named Katie…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "John Thune", "party": "Republican", "sentence": "…authorizes the Senate legal  counsel to represent Ms. Kotschwar in this matter.\n\nMr. THUNE.   on Thursday, June 5; that following the prayer and pledge, the morning  hour be deemed expired, the Journal of proceedings be approved to date,  the time for the two leaders be reserved for their use later in the  day, morning business be closed, and the Senate proceed…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691911/authorizing-testimony-document-production-and-representation-by-the-senate-legal-counsel-in-the-case-of-in-re-architect-of-the-capitol-employment-dispute"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…multiple States issued nondomiciled CDLs  improperly to unqualified, often foreign drivers, even in some  instances allowing them to keep licenses after their legal status  expired.\n\nIn the Florida case, the FMCSA investigation revealed that the driver  had failed the English language proficiency test, answering only 2 out  of the 12 verbal questions…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697478/commercial-drivers-license-system"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…a Democratic  proposal from years ago that, if we are going to add new spending  beyond the 5-year window, there needs to be an offset. Members saw a  number of bills that expired just before the fifth year so that they  don't set off the paygo, or like we did back in January when we owed  approximately $1.2 trillion in cuts to meet the paygo--pay as…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}]