[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…do so? With those thoughts in mind, we established  the Commission to look at the issue of service comprehensively.\n\nOne of the statutory mandates of the Commission was to explore the  ``means by which to foster a greater attitude and ethos of service  among United States youth.'' We as a government must be prepared to  invest in what is truly one of…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689050/act-back-then-senate-armed-services-committee-chairman-john-mccain"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…every kid who grows up here in the United  States receives the skills necessary and stays alive long enough to  live a decent life, a life that my son never got to truly fully explore  or enjoy.\n\nTime and time again, Secretary McMahon and President Trump fail to  rise to the challenge, and the American people are the ones who  continue to pay the price.…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693588/americans-have-a-right-to-a-quality-public-education"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…Democratic administrations and Republican  administrations, and they have one dedication, and that is to their  fellow Americans. Our Federal workers keep our food safe. They explore  the bounds of science to find cures to our most challenging diseases.  They make sure that our veterans receive the benefits that they so  richly deserve and that our seniors…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…ambitious goals through perseverance and commitment.\n\nGabriella served the Blackfeet Nation in Montana, honed her field  hockey and Greek dance skills, and helped her family explore our  national parks.\n\nMeanwhile, Emily taught American Sign Language, distributed food, and  became a stronger swimmer and martial artist, all while deepening her  understanding…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692377/recognizing-milford-delaware"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…economic engines generating billions in tourism revenue, sustaining  entire coastal economies. They are living laboratories also where  families snorkel with sea turtles, divers explore historic shipwrecks,  and scientists unlock climate secrets.\n\nThis legislation would let tech moguls bulldoze right through these  waters with industrial-scale operations--massive…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…President Trump's really sham energy emergency.\n\nAt a time when the United States is already producing record amounts  of oil and gas, the President wants to bypass laws and explore eminent  domain to fast-track fossil fuel projects--not alternate energy  projects, fossil fuel projects--and really not to lower prices or  create jobs but to benefit his…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688190/sj-res-10"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…of us are Members of  the legislative branch. All of us have taken an oath to the  Constitution, and all of us should stand up for each other and  certainly our ability to explore the policies of this administration.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692551/alex-padilla"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…September 2025, Patriarch  Bartholomew will travel to the U.S. to receive the Templeton Prize, one  the most prestigious awards recognizing those who use the power of  science to explore the deepest questions of the universe and  humankind's place and purpose within it. Previous recipients include  St. Teresa of Kolkata and the Dalai Lama.\n\nMr. Speaker, I…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695550/recognizing-his-all-holiness-bartholomew-archbishop-of-constantinople-and-ecumenical-patriarch"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…harmful policy riders in  the House bill, yet it does not go far enough to negate House language  falsely questioning the safety of Mifepristone and encouraging the FDA  to explore liability protections for certain infant formula  manufacturers, over which the agency has absolutely no jurisdiction  whatsoever.\n\nWhile the overall funding package may reopen…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696744/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…strategic insight into hemispheric policy and social  integration. She contributed to a multiyear initiative with the  Americas Society/Council of the Americas to document and explore  successful models of Hispanic integration in midsized American cities.\n\nMs. Manatt has been a leader in public diplomacy. She currently  serves on the board of the Diplomacy…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695835/recognizing-michele-manatt-for-her-service-to-the-george-washington-university-graduate-school-of-political-management"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…on in New Hampshire  with the Dinah Whipple STEAM Academy at the University of New  Hampshire. This program offers underrepresented young teens of color  the opportunity to explore science, technology, engineering, arts,  math, and black history in America for no cost. In addition, the  location of Dinah Whipple's trail blazing school is now a stop on…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688247/recognizing-dinah-whipple"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…in which minority turnout rates were unusually high.\n\nEvery now and then, we see the parties flip on a significant issue.  That is always kind of an interesting question to explore how that  happens.\n\nSo here is the Republican Party that was founded, antislavery--the  Republican party that fought for civil rights bills against the  Southern Democrats…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…will bring tax bills down and give Long Islanders much-needed tax  relief.\n\nI came to Congress to cut taxes and make life more affordable for my  residents. I will continue to explore every possible avenue to do just  that.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691111/bring-back-full-salt-deductibility"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…abatement and, upon the  determination of an abatement, to issue a notice of abatement to the  taxpayer.\n\nFurthermore, this bill requires implementation of a pilot program to  explore the use of alternative mail delivery methods for issuance of  math error notices.\n\nMr. DAVIS of Illinois. Mr. Speaker, H.R. 998 is a commonsense,  bipartisan bill. I encourage…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689361/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…Established in 1972, the  Templeton Prize honors individuals whose exemplary achievements advance  Sir John Templeton's philanthropic vision: harnessing the power of the  sciences to explore the deepest questions of the universe and  humankind's place and purpose within it. At this year's ceremony, His  All-Holiness will be honored for ``pioneering efforts to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…remembering, I hope we  will be grateful and humble to have inherited the progress of past  generations. As Americans and visitors to our country visit the  Nation's Capital and explore the museums, it seems fitting that they  would have the opportunity to learn about the pioneering spirit of  America and the stories of pioneering American women.\n\nMs. De…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689363/womens-history-month"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…mountain biking, kayaking, and  camping. All of these activities are an ode to the beautiful landscapes  across our Nation and experiences that a Scout will never forget.\n\nScouts explore their interests and improve their skills while working  toward Scouting's highest rank, Eagle. By first imagining, planning,  then doing their own service projects, Scouts…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699723/national-scouting-day"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…identify the remains of our fallen servicemembers from past  wars and conflicts. The U.S. military leaves no one behind.\n\nAnd through this bill, we are directing the Pentagon to explore  whether local communities can play a more active role in helping  develop the Department's healthcare facilities, similar to my CHIP IN  for Veterans Act. This is the very…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695027/9999"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…family traditions of Hee Haw Farms  and the Christa McAuliffe Space Center.\n\nThough the city has grown, it continues to be a family-oriented town  where residents can learn, explore, and thrive together.\n\nAt the heart of Pleasant Grove is its tight-knit community, people  dedicated to service, education, and preserving the city's rich  history.\n\nI want…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695307/recognizing-pleasant-grove-utah"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 1770) to direct the Consumer Product Safety Commission to  establish a pilot program to explore the use of artificial intelligence  in support of the mission of the Commission and to direct the Secretary  of Commerce and the Federal Trade Commission to study and report…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693414/consumer-safety-technology-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…middle schools and high schools, introduced the GO  Ag Act, and introduced the Creating Opportunities to Thrive and Advance  Act, all of which are important ways for students to explore different  careers.\n\nWhile all this is a huge accomplishment, there is still much left to  do. This is why I will continue to advance legislation that promotes  workforce…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700190/recognizing-career-and-technical-education-month"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…educators who elevate technology into  a tool that is used for exploration and opportunity.\n\nRebecca is a teacher at Mifflin County High School. Through her  teaching, students explore engineering design, digital fabrication,  robotics, and manufacturing challenges that mirror real-world industry.  Rebecca's colleagues praise her for her leadership and creativity.…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700129/opening-of-kongsberg-defense-expansion"}, {"senator": "John Thune", "party": "Republican", "sentence": "…communities is       an important part of our effort to strengthen mental health       care statewide. The Rural Health Transformation Grant will       help New York State explore new partnerships, build our       health care workforce, and pursue innovative opportunities to       expand care in these areas.\n\nLet me repeat that.\n\nThe Rural Health Transformation…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698574/rural-health-transformation-program"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Subcommittee, I, too, have seen firsthand the importance of this  law. Earlier this year, we held a hearing with industry stakeholders to  discuss the act's significance and explore ways to foster innovation.\n\nThe provisions in this bill ensure transparency, market confidence,  and fair price discovery, all of which are essential to a functioning  agricultural…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…their communities safe.\n\nWe must take care of those who do so much to take care of us.\n\nThis legislation is common sense. It will gather more information to  help Congress explore the best possible solutions for our law  enforcement officers.\n\nI would like to mention that 146 of my colleagues across the aisle  voted in favor of this legislation last…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…apply to a problem, as is required in life and the workplace,       rather than prescribing a particular approach or method.\n\n(3) Providing students with opportunities to explore and       analyze real data sets from contexts that are meaningful to       the students, which may include the following:\n\n(A) Missing or incorrect values.\n\n(B) Quantities…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…turning point  in the Revolutionary War by routing the British invasion force.\n\nToday, this 3,400-acre site is considered a unit of the National Park  System. There, visitors can explore trails and experience the historic  battlefield, which includes landmarks, fortifications, and other  important structures.\n\nRepresentative Stefanik's legislation would redesignate…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691018/strengthening-americas-turning-point-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Western Area       Power Administration, in consultation with the Glen Canyon       Dam Adaptive Management Work Group, shall enter into a       memorandum of understanding to explore and address the impact       that the record of decision entitled the ``Supplement to the       2016 Glen Canyon Dam Long-Term Experimental and Management       Plan Record…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691060/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Coordination Act.\n\nThe Department of Energy and NASA have an extensive history of  collaboration, which has enhanced both our understanding of the  universe and our ability to explore well beyond our planet.\n\nThe Voyager spacecrafts, which were launched more than 40 years ago  and are now flying far beyond our own solar system in interstellar  space, continue…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688985/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…we are getting it done. We promised to unleash American energy and  we have done it. We have delivered on our promises.\n\nYou know, under the Trump administration, permits to explore for  energy right here in America have gone way up. It has been successful.  The United States has never produced more energy than we are producing  today. Energy dominance…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699081/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]