[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…tuned.\n\nLet me tell you what it is all about. I rise today to ask the Senate  to pass the DEFIANCE Act--bipartisan legislation that gives victims of  nonconsensual, sexually explicit deepfakes the tools to fight back  against those who would exploit them.\n\nI want to thank the Senate sponsors of this legislation, including my  Republican colleague Senator…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…important and very necessary clarification for a circuit split that  could allow predators to evade justice. By making it uniformly illegal  to depict a minor in sexually explicit material, regardless of whether  that child appears to be actively participating, this change  strengthens the law so that predators can no longer hide behind  technical loopholes…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698896/child-predators-accountability-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Kaine and I have introduced a resolution to  direct the President to stop engaging in armed strikes against these  vessels or the country from which they emanate without the explicit  authorization of Congress. We are here today to ask our colleagues to  join us in this nonpartisan vote, in this affirmation of Congress's  authority to declare war or to…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…as well as undocumented immigrants, without a  judicial warrant, in violation of the Fourth Amendment. And that  violation is only one of many violations of constitutional, explicit  guarantees that we have seen repeatedly in Minneapolis, but around the  country.\n\nMs. Martinez is from Chicago. Mr. Rascon is from California. And,  yes, Ms. Rahman is from…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…an image of the abuse.\n\nThe Howard decision narrowed the scope of section 2251(a), holding  that the mere physical presence of the minor in a visual depiction of  sexually explicit conduct does not automatically violate the statute.  To obtain a conviction for production of CSAM in the Seventh Circuit,  the child in the photo, video, or image must themselves…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698895/child-predators-accountability-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…years.\n\nAdvances in generative artificial intelligence and other photo  manipulation software have enabled the creation of digital forgeries  that place victims in sexually explicit situations that never actually  occurred but can still cause massive reputational and financial damage  to those who were targeted.\n\nSome of the platforms hosting actual and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690185/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…not subject to reporting requirements, except for TV and       radio ads run within 30 days of a primary or 60 days of       Election Day.\n\nBy running ads that avoid explicit calls to vote for or       against a particular candidate outside of the mandated       reporting windows, dark money groups can bypass FEC       disclosure rules. Some of…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…what you call the leftwing for what is happening.  Don't do that. Explain what the person has done.\n\nI came to this floor. I am here in this House now, and I am giving  you explicit things. Tell me what the so-called leftwing has done. They  speak in these broad, general terms about people without giving the  explicit evidence of the thing that they claim…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Police who were on the  receiving end of violent conduct by citizens who stormed the Capitol.\n\nNo. 2, it is important that we have accountability for who caused  this and to be explicit about who caused this and who was the primary  motivator.\n\nAnd 3, it is extremely important for us not to allow history to be  rewritten so what happened then will happen…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698518/anniversary-of-january-6"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…was gut-wrenching about Newtown, gut-wrenching that the strongest  Nation on planet Earth should now be this Nation where we tell our  children in this implicit lesson--not explicit but implicit lesson-- that we are going to teach you how to hide, we are going to run active  shooter drills because we can't protect you.\n\nMy mom lives in Vegas--that Vegas…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…actually help pregnant and parenting students be able to       remain enrolled and meet their educational goals.\n\nSuch supports are critically needed, and include:\n\nExplicit protections under Title IX\n\nNondiscrimination protections at the state and local level\n\nAccessible and affordable child care, and increased funding       for on-campus child…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…say an authoritarian  President can roll out the military under title 10. That is scary as  hell.\n\nThe Insurrection Act, in ways, is even scarier because it does have  an explicit deference to the executive. So while it has a standard, it  says that, interpreting that standard, there should be deference. I  have read a number of analyses that say there…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…bring these  evils to justice.\n\nWith this bill, we will provide prosecutors with additional tools to  hold perpetrators accountable for schemes in which they seek to obtain  explicit photos and videos of minors.\n\nOur teenagers are in need of protection regardless of their  independence and maturity. I am proud to support this legislation to  ensure our…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699202/supporting-hr-the-combating-online-predators-act"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…can dress this up in charges of narcoterrorism.  Secretary Rubio can talk about the promise of a better life of  Venezuelans as a secondary effect. But Trump is being very explicit  about the main goal. It is the oil.\n\nThis is the same guy who for 10 years and over three Presidential  runs made not getting into wars a central premise of his campaign.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698623/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…turn away from us.\n\nIt gets worse. With President Trump actually allying himself with  China, Russia, Iran, and North Korea, these countries now seemingly  have America's explicit backing to spread their influence, and in some  cases to spread their force, like we have seen in Ukraine. This will  undoubtedly cause people to flee oppressive regimes and…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…and say: Do we believe that the United  States Senate should operate under a 60-vote threshold? Because if you  go watch the Twitter feed of Kyrsten Sinema, she is pretty explicit  about what she is watching and the hypocrisy of my colleagues on the  other side of the aisle in the Senate who now suddenly have newfound  love and respect for the 60-vote…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…explicitly forbid ICE from taking custody of these  dangerous individuals in the safest and least disruptive setting, in a  custodial setting, that is, in jails. That is the explicit purpose of  our sanctuary laws.\n\nDespite these facts, as these operations were being carried out in a  standard and targeted way in Los Angeles, you had certain politicians…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…this. In  fact, a cursory, simple review of the Federal Reserve Act shows that  the Federal Reserve does not have the legal authority to issue a CBDC  to individuals absent explicit authorizing legislation from Congress.  The Supreme Court has also recognized Congress' power to coin money and  regulate the value thereof, implicitly denying to the executive…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693730/anti-cbdc-surveillance-state-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…last session. They will  hopefully find the time in this session.\n\nUnder current law, being a member of Hamas or associated with its  barbaric attack against Israel is not an explicit ground of  inadmissibility or removability. That is just not good enough. Anyone  who gave them support in any form should never be allowed into this  country.\n\nDuring the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…week, Democrats have claimed that Maduro's capture was  unconstitutional, illegal, and violated international norms. Democrats  argue that Congress must declare war or give explicit authorization  before the President can act.\n\nArticle II is clear. The President is the Commander in Chief, and the  Constitution has never required a declaration of war for…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698883/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…known as the 1002 Area, including  lands that are projected to have substantial resources beneath them,  from responsible oil and gas leasing--completely undermining the  explicit and express will of Congress and ignoring the needs and input  of local residents. Passing this joint resolution will disapprove this  Record of Decision and prevent this…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…Decency  Act insulates ``Big Tech'' from most liability for the digital fentanyl  promoted on their sites. Time and time again, drugs are sold, sexually  suggestive and/or explicit content is posted without consent,  algorithms promote and normalize suicide and self-harm, and chatbots  tell children how to cope with their emotions. All of these things…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…walk free and then exploit others and create more  victims.\n\nThe Child Predators Accountability Act of 2025 closes this gap by  clarifying that a minor is engaged in sexually explicit conduct when  the offender intentionally includes the child in the depiction, even  passively. This is a straightforward, bipartisan fix that ensures that  Federal law captures…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698897/child-predators-accountability-act"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…colleagues, and we have reached an  agreement that will allow the Senate to pass this bill unanimously  today.\n\nI am also pleased to report that the ROTOR Act now has the explicit  backing of the White House on this revised product. The White House is  committed to helping us work with our House colleagues to see that the  ROTOR Act passes in that Chamber.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698320/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…protesters. That kind of government power has  no place in the United States.\n\nThe Anti-CBDC Surveillance State Act ensures the Federal Reserve  cannot issue a CBDC without explicit authorization from Congress. It  protects financial privacy and upholds the constitutional rights of  every American.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693527/congratulating-central-high-school-womens-softball-team"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…degrading nonsexual conduct       (whether or not physical injury results) for which any person       can be charged with a criminal offense; or\n\n``(D) engage in sexually explicit conduct, as defined in       section 2256(2)(A),      shall be punished as provided in paragraph (2).\n\n``(2) Whoever violates, attempts to violate, or conspires       to violate…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698880/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…the       identifiable individual;\n\n``(iv) a person who possesses or publishes an intimate       visual depiction of himself or herself engaged in nudity or       sexually explicit conduct (as that term is defined in section       2256(2)(A) of title 18, United States Code); or\n\n``(v) the publication of an intimate visual depiction that       constitutes--…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690186/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…controls? How many  people have been impacted? Have they been notified? Has there been any  restitution? Why did Covered California use the trackers contrary to  Linkedin's explicit guidance? I am asking how this sort of violation  can be prevented in the future. This is truly unacceptable, and I am  looking forward to getting some answers from this investigation.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…both Republicans and  Democrats, for working together on these very important issues.\n\nMr. Speaker, sextortion has become a devastating crisis. Predators  threaten to release explicit images of minors to extort money, more  content, or compliance, preying on shame and fear.\n\nProtecting children from online sexual exploitation remains a top  priority for…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698863/combating-online-predators-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…political systems is the right  of the people to make and to alter their constitutions of government.  But the Constitution which at any time exists, until changed by an  explicit and authentic act of the whole people, is sacredly obligatory  upon all. The very idea of the power and the right of the people to  establish government presupposes the duty…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700270/president-washingtons-farewell-address"}]