[{"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…Medicaid, if they  intend to go through with their plan to cut Medicaid by a third to pay  for a tax break for billionaires, then before they do, they should at  least stop and explain to these three people--Michelle, Noa, Cheri--who  is the one that they want to kick off of Medicaid.\n\nHow would any of us be better off if any of these three people are  forced…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689509/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…to tariffs; the next day, no to tariffs; one day,  tariffs on this country; the next day, tariffs on that country. Even  Donald Trump's own policy advisers are struggling to explain his flip- flopping.\n\nThe only thing Donald Trump's tariffs have succeeded in is raising  the  odds of recession and sending markets into a tailspin.\n\nI have talked to business…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690523/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Congressional Review Act resolution that will block the  Consumer Financial Protection Bureau from supervising payment apps  offered by Big Tech firms like Apple and Google.\n\nBefore I explain why this resolution is bad, let us not ignore that  President Trump and co-president Musk are tearing down key government  agencies and programs as we speak, like the CFPB…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…is very important for all of us to understand that if we want to  be innovative and if we want innovation, we will study and we will  understand so we then will be able to explain. If we really want to  protect the American dollar, we will not put our heads in the sand. We  will allow this research to go on to make sure that the American dollar  stays…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693736/anti-cbdc-surveillance-state-act"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…when Governors  stepped up and said they don't want people to go hungry, the  administration ran to court, Mr. Speaker, to take $6.20 away from poor  people. Who does that? Explain that to me. Who takes $6.20 away from a  single mom or a hungry senior?\n\nThat is the state of America today. It is unbelievable, and here we  are to vote on this. I will be…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696743/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…on?\n\nAs the effects of this bill take shape and slither their way through  our communities, our Republican colleagues will have to look their  constituents in the eyes and explain their votes. They will have to  explain to a farmer who now must drive an additional 50 miles to the  nearest hospital why they had to shut the community hospital doors.…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693251/one-big-beautiful-bill-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…trade, I will get an answer. I have been waiting. I have been asking  everybody. Not only the chairman but any Republican that wants to make  a statement, if they could just explain to the American people. They  don't have to explain it to me. Explain it to the American people. Just  give me some explanation of why the President of the United States…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…When the legal justification keeps changing, it means that there is  no clear mission to begin with. And here is what troubles me the most:  the administration's refusal to explain itself, both to Congress and  the American people. It suggests that they know this operation does not  hold up to scrutiny.\n\nChairman Wicker and I have sent multiple requests…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…because they may have tattoos, the  Trump administration has decided to use them for a poorly executed and  expensive publicity stunt.\n\nAs I think Senator Van Hollen began to explain to us, if Republicans  allow Donald Trump to make himself judge, jury, and executioner, then  we are all in trouble. This is the behavior of a foreign dictator, not  the President…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691401/motion-to-discharge-s-res-195"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…the middle of a hearing, and,  of course, I don't think there is any rule here against taking phone  calls in a hearing.\n\nNow if you want to actually give her the chance to explain what  happened, then we would take it to the Ethics Committee. I still don't  see what the charge is. Where is the ethical transgression? Where is  the legal transgression?…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…it, Jeffrey enjoys his social life.''\n\nThat is disgusting, wrong, and we must require more information. The  truth is, we don't know what the facts are in this case.\n\nI can't explain why the Trump administration has changed their minds  on Epstein, but their behavior raises questions. This is the time that  we must demand answers, and the Oversight Committee…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693624/release-the-epstein-files"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…questions that he said were too hard. He said that the witness wasn't  prepared and that I was cross-examining him. He said that my questions  weren't fair.\n\nMr. Speaker, let me explain for the gentleman why I asked so many  questions last night. It is because this House has been turned into a  place where you can hardly ask questions at all.\n\nThis majority…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700195/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Brett Ganger said:\n\nThese encounters with federal agents are changing the       community and changing many lives, including ours, forever. I       still don't know how to explain to my 4-year-old what these       agents are doing when we pass by.\n\nThey said:\n\nRenee is not gone from us. She's in the light that finds us       on hard days. She's in the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…proposed with this resolution. The entire scheme is untested,  reckless, and ill-advised.\n\nIf my colleagues accidentally ban off-roading in Glen Canyon, I hope  they are ready to explain that to their constituents, assuming they  ever hold townhall meetings again.\n\nMr. Speaker, in closing, I urge my colleagues to vote ``no'' on this  legislation. Last week…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690404/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…constitutional interpretation; it is a radical blueprint  for rolling back decades of progress on individual freedom and  equality.\n\nWhen I gave Mr. Tung an opportunity to explain his history of sexist  and anti-labor comments a few months ago in committee, during the  confirmation hearing, he deflected. He showed no reflection or evolved  thinking,…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696538/government-funding"}, {"senator": "Anna Luna", "party": "Republican", "sentence": "Mrs. LUNA. Mr. Speaker, I have a parliamentary inquiry.\n\nMrs. LUNA. Mr. Speaker, I was wondering if the Speaker of the House  of Representatives can explain why leadership on both sides, both  Democrat and Republican, are cutting back-end deals to cover up public  corruption in the House of Representatives for both Republican…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696854/parliamentary-inquiry"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…$1.8 trillion, making it the biggest savings bill  in U.S. history.\n\nMr. Speaker, guess how many cosponsors we have? Zero. Zero because it  is hard, complicated, difficult to explain, but it is really good  policy. There are solutions. Toughen up.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Medicare; when you have people who are able- bodied who are getting a higher subsidy than the vulnerable population  for whom Medicaid was originally created, then someone explain to me  why we don't have a duty to fix that.\n\nThat is what we are putting forward, to try to deliver healthcare  that would actually have a doctor and a patient relationship…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…to tie NPDES permit conditions to what happens       on their site, rather than what happens downstream to impair       receiving waters. This approach allows regulators to explain       the measures that home builders must take to comply with       their NPDES permit, without imposing numeric discharge       limits.\n\nNAHB additionally urges passage…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…considered read a third time  and passed, and that the motion to reconsider be considered made and  laid upon the table.\n\nMr. KENNEDY. I will not, Mr. President.\n\nI would like to explain why.\n\nI understand Senator Paul is making a good point. What he is saying  is, rather than saying, as I am, that nobody else is being paid so  Members of Congress shouldn't…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "John Thune", "party": "Republican", "sentence": "…by--\n\n``(I) data on shellfish or water quality obtained through       sampling programs, including baseline data, and regulatory or       advisory thresholds established to explain management actions       related to the event;\n\n``(II) toxin levels in fish, marine mammals, seabirds,       shellfish, or water during the event;\n\n``(III) toxic aerosols…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695277/harmful-algal-bloom-and-hypoxia-research-and-control-amendments-act-of-2025"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…finds a mistake on a tax return, such as when  a taxpayer accidentally adds a zero to their reported income, the  agency should clearly indicate that error to the taxpayer and explain  why the refund is different than expected.\n\nHowever, current notices do not explain or contain helpful  information, leaving millions of taxpayers confused about how and…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689360/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "Markwayne Mullin", "party": "Republican", "sentence": "…opportunity  to simply have the same opportunity as adults do with cancer? It is  called pediatric cancer. Give kids a chance. Why wouldn't we want to do  that?\n\nIt is hard to explain why we wouldn't want to do that, but yet I  understand the Senator from Vermont intends to object to the Senate  doing this. I think it is wrong. I think it is dead wrong.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698335/9999"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…voter. I have an ID that has a different name than my birth  certificate.\n\nAlso, since we are using women as bait here, maybe in the next round  of debates, Democrats could explain to us exactly what a woman is.\n\nMr. Speaker, I rise in support of the SAVE Act. The American people  are done messing around with a woke, weak-kneed system that lets our…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689994/safeguard-american-voter-eligibility-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…back of napkins, the math, and if that had held for an entire year,  just those 30 basis points would have been $33 billion of additional  interest.\n\nI will try to actually explain that and then actually talk about  something that is really interesting. The economy from a GDP  calculation standpoint, and this is just the economists looking at the  vitality…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…rule.\n\nI urge my colleagues to vote no and return the Senate floor to our  business of confirming President Trump's nominees in the face of  historic obstruction.\n\nAllow me to explain just a little bit--and both of them have  explained this. In 2021, the EPA issued a Federal implementation plan  covering Indiana. In doing so, they relied on the announced…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695512/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-emissions-budget-and-allowance-allocations-for-indiana-under-the-revised-cross-state-air-pollution"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…fiduciaries and  service providers based on race, religion, sex, or national origin. It  almost sounds American in its idea. It improves transparency by  requiring plans to explain the difference between fiduciary-selected  investments and brokerage windows.\n\nThis bill puts retirement savers first, and I urge my colleagues to  vote ``yes'' on this bill.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…for that reason, I implore my colleagues on both sides  of the aisle to join me in supporting the SAVE America Act.\n\nAnd if not--and if not--I respectfully challenge you to explain to  the clear majority of your constituents why you believe our elections  are not in desperate need of repair.", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…example, as a law student at George Washington University,  she earned a recordbreaking 4.22 GPA. Her professors even wrote to the  Judiciary Committee prior to her hearing to explain that these  professors often thought that her exam answers were better than their  own answer keys.\n\nIt is no surprise, then, that she went on to clerk for two Supreme  Court…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696138/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…invasion of Ukraine.\n\nI would like to see the analysis behind the administration's decision  to zero out USAI in its fiscal 2026 request. I would like to hear them  try to explain away the massive return on investment of America's  security assistance to Ukraine and the previous lessons we have learned  from our Ukrainian partners.\n\nThe Secretary of…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692870/9999"}]