[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…another  agency's regulation meant to protect public health.\n\nThese are regulations that are responsible for safe drinking water,  for  reducing air pollution, and preventing exposure to cancer-causing  chemicals. We are not just talking about price increases here that the  Trump administration has imposed. We are also talking about the impact  on health…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…protections that would have prevented the Byhalia  pipeline from being rushed through my district; and a third one to  require the EPA to certify that this bill will not increase exposure to  harmful contaminants.\n\nUnfortunately, none were made in order. Therefore, I oppose the bill  and urge a ``no'' vote.\n\nPermitting reform should not come at the expense…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698033/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…without being told what they were exposed to. Decades later,  workers are still fighting to get screened for cancers and other life- threatening illnesses caused by their exposure to radiation. Taxpayers  are still paying the price from the arms race.\n\nThe Federal Government has paid out more than $27 million to more  than 430 Oregonians who were uranium…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699034/expiration-of-new-start"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…official misconduct.\n\nLet me provide examples of the types of officers the department had  to rehire: officers convicted or arrested for child abuse, sexual  assault, indecent exposure, drunk driving causing injuries, domestic  violence, and assaults while off-duty. D.C. also had to provide  millions of dollars in backpay to those officers it was forced…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…American. That is unacceptable.\n\nThe Healthy Lungs for Heroes Act changes that. It directs our Federal  land agencies to develop and require respiratory protection when smoke  exposure becomes dangerous.\n\nProtecting our firefighters' lungs should not be controversial. This  bill ensures that those who protect us are finally protected  themselves.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698661/firefighter-protections"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…for our veterans.\n\nThe information provided under this report will help us to better  understand the most serious threats facing our veterans, whether it be  suicide, toxic exposure, or other life-threatening conditions.\n\nThis reporting will also include important information on veterans  with service-connected disability, which will help to ensure that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695485/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…large-scale industrial polluting plants. We know they cause  cancer. We know they cause birth defects, developmental disorders, and  neurological problems, even at low levels of exposure.\n\nWhile Americans struggle with the high cost of living and watch this  billionaire boondoggle bill try to get through the House, just know  what else is going on at the same…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691593/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…neighbors, and friends. We have recently learned that 440 additional  people across southern California died in the month following the fire  due to delays in medical care and exposure to toxic elements.\n\nThe Eaton fire was the second most destructive wildfire in  California's history. Those we lost helped to shape the fabric of their  communities, and their…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698642/marking-anniversary-of-los-angeles-fire"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Nation's  veterans with comprehensive care, the preventative and palliative care  that they earned and deserve.\n\nMr. Speaker, I look forward to getting this and other critical  exposure legislation through this body and signed into law. I hope my  colleagues will continue to rally around our efforts.\n\nMr. Speaker, that is why I support this legislation and…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693895/aces-act-of-2025"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…educational experience at the NSF so that students can  thrive.\n\nWhat we don't want is a bunch of one-offs and all of a sudden you are  graduating high school and maybe you had some exposure to these  computational skills. We are competing across the world with talent.  Our schools need to have the best ability to thrive. I urge everybody  in this data-driven,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688978/mathematical-and-statistical-modeling-education-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…advantage of patients who are desperate for  cures.\n\nFor example, there are reports of some clinics peddling unapproved  treatments with exaggerated and deceptive claims. Exposure to these  unproven treatments has put vulnerable patients' health at risk,  leading to serious adverse events, including blindness, bloodstream  infections, paralysis, and…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692766/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…rolling that back. They are rolling back  regulations to create clear and specific requirements for occasions  when employers must require the use of respirators that prevent  exposure to toxic chemicals that can cause cancer and other diseases.\n\nRegulations to bolster labor protections for farmworkers on guest  worker visas; they are rolling those protections…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695574/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…little more than a bandana between them and the clouds of toxic smoke.\n\nAs the only pulmonologist serving in the United States Congress, I  know just how dangerous that is. Exposure to wildfire smoke isn't just  uncomfortable. It leads to heart and lung disease. It causes cancer. It  shortens lives.\n\nThat is why, during a recent House Natural Resources…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695520/servicing-the-right-to-breathe-clean-safe-air"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…period of time were captivated by  laptops and cell phones into changes in attitude, changes in conduct.  Sadly, some of the children took their own lives because of their  exposure to what happened on these devices. It is heartbreaking.\n\nI recall one in particular: a young, African-American, high school  student--a track star at his school--who got swept…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…overwhelming, and the  moral case is undeniable. Yet, the Occupational Safety and Health  Administration, OSHA, still lacks a national standard to protect  workers from dangerous heat exposure on the job.\n\nIn addition to the important legislation mentioned by the gentleman  from Arizona to address the issue, I am a proud cosponsor of the bill  introduced by the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695655/extreme-heat-caucus"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…happens in  the classroom with extension programs or with groups like FFA or 4-H.\n\nBy recognizing our agricultural educators, we can ensure our students  have knowledge and exposure to all the opportunities the agriculture  sector has to offer.\n\nMr. Speaker, I thank all the ag teachers and volunteers across the  country who help propel students into meaningful…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695790/national-teach-ag-day"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…fundamentally different from any past drug  epidemic. These substances are engineered to be highly lethal. The  amount that you can fit on a pinhead could kill a person. Unknown  exposure just from somebody coming to assist somebody could kill  somebody. These are weapons of mass destruction.\n\nIt is different from anything we have ever experienced in the history…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698247/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…able to make it to  Washington, D.C.\n\nMr. Speaker, we remember the 150,000 who were wounded in battle and  bear the visible scars of post-traumatic stress and Agent Orange  exposure. We remember those who faced brutal captivity as prisoners of  war, and the 1,200 servicemembers still missing in action from Vietnam.\n\nMr. Speaker, we may never be able to…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689202/saluting-vietnam-veterans"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…the training course required under this       section shall include a multi-day detail within the Coast       Guard Office of Budget and Programs to ensure adequate       exposure to Coast Guard policy, oversight, and requests from       Congress.\n\n``(B) Nonconsecutive detail permitted.--A detail under this       paragraph is not required to be consecutive…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Jim Justice, Jr.", "party": "Republican", "sentence": "…of the House of Representatives a       strategy to provide all Federal correctional facilities with       capabilities necessary to--\n\n(1) protect staff and inmates from exposure to synthetic       drugs and opioids introduced to facilities through the mail;\n\n(2) ensure that--\n\n(A) not later than 24 hours after a piece of mail is       received at…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689519/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and suppliers of       domestic manufacturers;\n\n(III) identifying and mitigating risks, including--\n\n(aa) significant vulnerabilities to supply chain shocks;       and\n\n(bb) exposure to gaps and vulnerabilities in domestic       capacity or capabilities and sources of imports needed to       sustain critical industries (including critical industries…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…drugs. It will also give the Coast Guard the parity to police  other armed services with regard to rapid treatment of drug overdoses,  keeping guardsmen safe from accidental exposure.\n\nH.R. 2351 implements changes that will help secure our maritime  border and increase safety on our seas.\n\nMr. Speaker, I urge support of this bill, and I yield back the…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692169/controlled-substance-onboard-vessels"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…______\n\nBy Mr. PADILLA (for himself and Mr. Merkley):\n\nS. 1042. A bill to require the Agricultural Research Service to  conduct research relating to wildfire smoke exposure on wine grapes,  and for other purposes; to the Committee on Agriculture, Nutrition, and  Forestry.", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688826/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…students are pursuing accounting degrees than  in prior years.\n\nThe Accounting STEM Pursuit Act seeks to improve the accounting  pipeline by expanding K through 12 students' exposure to accounting  programs. As with other areas of STEM education, this bill would  qualify accounting instruction for Federal funds. This recognition  aligns with the increasing…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699755/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…time when the economy is good. We are not in a  pandemic. We are not in a war. We are not in a recession.\n\nUnderstand that when you take some of these charts of interest  exposure into the future--there is one of my charts that shows, in 9  budget years, interest, just interest, is over $2 trillion a year.\n\nWhy aren't we running around terrified here?…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…November is Lung Cancer Awareness Month.  One in eighteen people receives a lung cancer diagnosis during their  lifetime. Twelve percent of the diagnoses have had no tobacco exposure.  This disease impacts hundreds of thousands of families across our  country.\n\nMy friend Marlys Carlson of Stratford, IA, finished her battle with  lung cancer in July of…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697020/lung-cancer-awareness-month"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "Mrs. MILLER of Illinois. Mr. Speaker, today, Senator Mike Lee and I  will reintroduce the Shielding Children's Retinas from Egregious  Exposure on the Net Act, also known as the SCREEN Act.\n\nThe average age of a child's first exposure to pornography is 11  years old. Blocking and filtering software is ineffective,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688197/blocking-and-filtering-software-is-ineffective"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…Island, right in the heart of my district, conducted the  first of its kind study on this issue. From a small sample of 50  Vietnam veterans, 24 percent tested positive for exposure to the liver  fluke parasite.\n\nThat study raised the alarm and called for further research,  standardized treatment, and expanded access to care for affected  veterans at…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689626/vietnam-veterans-liver-fluke-cancer-study-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…spanning more than 27 years, I held the longest  voting streak in Senate history. My 8,927 consecutive rollcall votes  ended in November of 2020, when I was quarantined for exposure to  COVID-19.\n\nMy good friend from Maine Senator Susan Collins now holds the baton,  as she continues her unbroken voting streak since she was sworn into  office in 1997.…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691703/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…someone who says:  Well, you guys voted for this. Well, you guys wanted to tax this. You  actually start to help them understand, saying, we are talking  fractions of our exposure.\n\nI accept, you don't need to be an accounting major or math major to  be a Member of Congress. We make some very pretty charts, though. For  anyone who actually gives a darn…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}]