[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…rushed, and devastating to  firms and working families across Ohio.\n\nCanada is Ohio's largest trading partner. Over 100,000 jobs in Ohio  depend on trade with Canada. Our State exports $21 billion in goods  annually to our neighbor to the North, our largest fair-trade partner.\n\nFrom Toledo Jeep and General Motors to the parts manufacturers in  Sandusky,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693472/unfair-tariffs-on-canada"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…yielding.\n\nMr. Speaker, it is Groundhog Day again in Washington, D.C. You know,  this week is an opportunity to drive down electricity costs, create  jobs at home by bolstering our exports of goods made in America. It is  an opportunity to lower the cost of groceries and healthcare for  families around our great country. But this Republican majority never  misses…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699897/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…fossil  fuels to the United States. Right now, we barely have a relationship  with Canada because of the tariffs.\n\nThe fact of the matter is that there is a tariff on Canadian exports.  The bottom line, I guess, is the only way that we could get Canada to  maybe send us more oil or gas is if we did what President Trump says  and annex them and make them…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…reliance on America's economic strength and the U.S. dollar. Such a  world leaves each American poorer and with fewer economic  opportunities. Just as Russia relies on oil exports to finance and  undercut the financial sanctions that have been placed on that country  due to its invasion of Ukraine, Putin has called for the world to adopt  untraceable…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…sham energy emergency pushes fossil fuels as the solution, but those  fossil fuels are polluting, they are pricey, and they are getting  pushed abroad to the highest bidder as exports. These fossil fuel  exports actually increase energy costs here for Americans. This is what  Senator Kaine has been talking about, trying to raise the profile of  these issues.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696132/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…This is nutty stuff, and it is dangerous stuff economically. Just in  Rhode Island, Canada is our largest international trading partner.  Twenty-two percent of Rhode Island's exports are to Canada, and we  import from Canada as well. And when the tariffs get reciprocated by  our Canadian friends after this ridiculous behavior from President  Trump, then…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689472/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Mr. Speaker, I am proud of the strong bipartisan support for allies  and partners in the bill, the $400 million refill of the Ukraine  Security Initiative and streamlining exports to our AUKUS partners.\n\nLast week, the Pentagon's AUKUS review endorsed that security  agreement, and this bill's massive commitment to the submarine  industrial base and…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697788/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…fact, last year, with the Biden  administration, we produced more oil than any country in the history of  humanity.\n\nThe same is true for natural gas. The same is true for LNG exports.  The United States produces more oil than any other country in the  world. We produce more natural gas than any other country in the world.  We are the leading exporter of…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688166/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…San Pedro Bay port complex in my district are  expected to plunge in May. That means empty shelves at our stores in a  few weeks and further price spikes as shortages hit.\n\nExports at the port complex have also plummeted as retaliatory  tariffs by other countries hit agriculture and manufactured goods. This  hurts consumers. It hurts businesses. It hurts…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690420/put-hardworking-american-families-first"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…who the President often quotes and  references in his trade policy, but it is 2025, and it is not making  America great again to push American manufacturing offshore.\n\nOhio exports more to Canada than its next six largest foreign markets  combined. This country slapped tariffs on our allies. They retaliated,  and it is our workers, businesses, and communities…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691573/earthquaker-devices-sounds-the-alarm"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…basically  collapsed, practically overnight, in India. And I traveled to India and  worked hard over several years to lift those tariffs, and now, we  finally are back growing our exports exponentially, but the market  still isn't fully recovered, and now, people are questioning what is  going to happen next.\n\nI heard from a grower in my State who said, ``The…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…in the last year, tariffs  have cost American families nearly $1,700. That cost is expected to  increase in 2026. That is the case. Since these tariffs were imposed,  U.S. exports to Canada have fallen by more than 21 percent.\n\nWhen I go home, my constituents aren't telling me they have an extra  $1,700 to spare. They are asking me to lower grocery…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…specifically curtails the Federal review for pipelines from  Texas to Mexico that carry natural gas to Mexican LNG facilities.\n\nThese provisions would facilitate increasing LNG exports, which have  been shown to drive up prices for American consumers.\n\nMr. Speaker, for the sake of our consumers, our national security  interests, and the future of our planet,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695689/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…office--I already mentioned  that--and natural gas prices are up 8 percent nationwide since a year  ago, 14 percent in my home State of New Jersey, in part due to  increased exports of liquefied natural gas. Both of these figures are  vastly outpacing inflation, which is already sky high, thanks to the  President's tariffs and the healthcare and housing…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…talk about this claim of a double  standard and of hypocrisy. Oh, the poor fossil fuel industry is being  singled out.  Poor Big Oil with its record profits and its record exports and its  executive bonuses and its collusion with OPEC to gouge American  consumers, they are just such a victim in the telling of my friends  across this aisle.\n\nI hate to…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…industry in the U.S. and meet President Trump's goal of  achieving American energy dominance.\n\nNatural gas is a major engine of economic growth, particularly in  Oklahoma. LNG exports alone in the U.S. support more than 273,000 U.S.  jobs and contribute $40 billion to our GDP.\n\nThis sector is a lifeline for communities across the country,  including Oklahoma's…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697092/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…under the Arms Export Control Act to countries or end-users       identified by such list and a fixed timeline for decisions       for all other applications for such exports. The timelines so       established shall provide that, to the maximum extent       practicable--\n\n(1) an application to export defense articles or defense       services…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694830/international-traffic-in-arms-regulations-licensing-reform-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…down. We have quadrupled revenue to strengthen  America's balance sheet and pay down the tax on our children, which is  the deficit. We have gone from 6.3 percent to 5.9, and exports are at  an all-time high.\n\nNow, what is the issue here? It is not about 301, unfair trade  practices, although there are plenty of grievances against our northern  neighbor…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699974/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…percent of our critical minerals. These  minerals are used to produce everything from cell phones to fighter  jets.\n\nWith the flip of a switch, Communist China could cease all exports of  critical minerals to the United States. In fact, they have already  started reducing their exports.\n\nFurther, we have turned a blind eye to the atrocities committed by…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695238/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…U.S. exported  more than $26 billion of American grains. In just my home State of  Pennsylvania alone, almost $100 million of corn and barley are exported  every year.\n\nThese exports make a difference to the bottom line for family farmers  in Pennsylvania and across our country.\n\nAmerican agriculture has certainly changed since 1916, and the United  States…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…advice,  and guidance related to effective coal policies.\n\nAn example of the council's importance can be found in the report  that it issued in 2018 titled: ``Advancing U.S. Coal Exports.''\n\nAlthough environmental NGOs have worked to reduce domestic coal  production and use, our allies in Asia have an increasing demand for  coal, confirming that export markets…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695769/national-coal-council-reestablishment-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Negotiating Tools                  (By Debra Struhsacker, Sarah Montalbano)\n\nPresident Trump secured a one-year reprieve from Beijing's       threat to shut down global rare-earths exports, which would       have interrupted manufacturing of semiconductor chips and       magnets essential in military and technology applications.       The President quipped that…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…projects, like pipelines; and, most importantly, pandering to radical  climate activists. Then they delivered perhaps the most damaging and  egregious move of all: They banned new exports on LNG. This wasn't to  help the environmental laws or to lower prices for American families.  It was to satisfy the radical green activists.\n\nLet me be clear that this ban…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697088/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…Joe Biden unveiled the  latest of many attacks on our domestic energy capabilities when he  announced an indefinite pause on all pending approvals of liquefied  natural gas exports, or LNG.\n\nThis certainly made the Russians happy, and Europe could have used  some help with their energy demand.\n\nNot only was this decision completely unnecessary, but it…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697085/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…North Dakota have invested $2 billion in  emissions control technology. They have done this because they care  about our communities and environment. In fact, North Dakota exports  thousands of megawatts of electricity every year.\n\nWe are the third largest oil- and gas-producing State in the Nation,  and we are one of only four States in the Nation…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691597/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…microchips. Intellectual property is also foundational for  movies, music, publishing, and much more.\n\nIntellectual property industries produce almost 80 percent of U.S.  commodity exports. Many of these industries even have trade surpluses  since the United States is the world's top intellectual property  exporter, with exports valued at $140 billion in 2024.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691132/world-ip-day-and-inventions-caucus"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…expand market access       by removing tariffs on all imports from 53 African nations.       If the United States were to let AGOA expire and reimpose       tariffs on African exports, it would send a damaging signal       about the future of U.S. commercial diplomacy on the       continent. When African governments see comparable       opportunities from…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…10423(c))       is amended--\n\n(A) by striking ``classified and unclassified items, and       the process'' and inserting ``classified and unclassified       items, and apply to all exports and transfers (including       reexports, retransfers, temporary imports, and brokering       activities), wholly within or between the geographic       territory of Australia,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694783/aukus-reform-for-military-optimization-and-review-act"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…Iowa, our products are second to none. ITA ensures that  foreign markets are open to those goods by cutting through redtape and  breaking down trade barriers. That means more exports, more jobs, and  stronger communities here at home.\n\nOn enforcement, ITA plays a vital role in confronting dumping  practices, countering illegal subsidies, and ensuring that…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694342/confirmation-of-william-kimmitt"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…SEC. 2. FINDINGS.\n\nCongress finds the following:\n\n(1) On March 14, 2024, the Department of State notified       Congress of the following:\n\n(A) People's Republic of China exports of semiconductors to       Russia have increased substantially since Russia's full-scale       invasion of Ukraine.\n\n(B) In the second half of 2023, China exported between…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690679/economic-espionage-prevention-act"}]