[{"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Ms. MORRISON. Mr. Speaker, I rise to express my horror at what we are  witnessing in Minnesota. Kristi Noem's DHS has been working with no  oversight and no accountability. The irresponsibility and recklessness  are…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699296/dhs-is-working-with-no-oversight-and-no-accountability"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…the 20th Congressional       District of Florida, do hereby commend CaRiMi for their       dedication to innovation, artistic excellence, and cultural       preservation, and express gratitude for the joy and       inspiration they have provided countless fans worldwide.       Their legacy is a testament to the power of music to unite,       heal, and…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694734/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…and nonbinary individuals. I recognize  that some LGBTQ+ individuals do not want gender designations on  licenses at all, while others do want gender designation so as to  express their identity. I believe this bill strikes the middle ground,  while showing Congress' support for LGBTQ+ individuals.\n\nI urge my colleagues to support this bill.", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691711/introduction-of-the-real-id-gender-requirement-reform-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Representatives,      Washington, DC.\n\nDear Speaker Johnson and Leader Jeffries: On behalf of the       ACLU, ACLU DC, National Urban League, and The Bail Project we       write to express our opposition to the D.C. Cash Bail Reform       Act (H.R. 5214) and the Common Sense Law Enforcement and       Accountability in D.C. Now Act (H.R. 5107).\n\nWe urge all Members…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696949/opposition-letter-led-by-the-american-civil-liberties-union-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…is simple:\n\nEmpower students to connect with their community and their       own potential through storytelling.\n\nChayanee has created a welcoming space for her students to express  themselves and share their stories through creative avenues like  journalism and documentary storytelling, where they highlight topics  such as family separation and mental…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690856/teacher-appreciation-week"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "Ms. STEVENS. Mr. Speaker, after Monday's college football national  championship, I rise to express my concern about the trend of private  equity firms attempting to buy up college sports. These deals will be  bad for athletes, students, and fans.\n\nWe have seen this play…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699263/college-sports"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "Ms. STRICKLAND. Mr. Speaker, I thank Representative Takano for  yielding time.\n\nMr. Speaker, I rise to express my support for my bill, H.R. 970, the  Fairness for Servicemembers and their Families Act of 2025.\n\nI first thank Chairmen Bost and Luttrell and Ranking Members Takano  and…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689627/fairness-for-servicemembers-and-their-families-act-of-2025"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…youth in Loudoun County.  BAPS Charities is a global charity, active across the country and in  nine other countries, and its efforts are volunteer-led.\n\nBAPS Charities aims to express a spirit of selfless service through  five key areas: health awareness, educational services, humanitarian  relief, environmental protection and preservation, and community…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691837/congratulating-baps-charities-and-baps-temple-walkathons"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…says philosophically,  politically, or otherwise, but free speech is not based on what you  like or dislike or choose to hear or not hear; it is based on one's  ability to express themselves. It is not conditioned on what you like  to hear. Free speech is free speech.\n\nWe will not stand by while they violate the principles that form the  bedrock of…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690503/trump-immigration-policies"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…of the American role in  the world comes as China is bolstering its soft power everywhere.\n\nThis is a giant blow to our national security and effectiveness in  the world.\n\nI express gratitude to the patriotic men and women at the State  Department, many of them my constituents, for their decades of service,  and I affirm our enduring commitment to the…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693533/mass-state-department-layoffs"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Hinkelman as the winners of the 2025  Congressional App Challenge for our district and name them as Ohio's  13th Congressional District's champions of the week.\n\nTheir app, Eagle Express, is an innovative system that allows  students and teachers to better track and complete transactions within  their school's token-based incentive program. The app will help…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698016/champions-of-the-week-kaxten-mcgrew-bastain-nowak-and-luke-hinkelman"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…on treating drug overdoses  onboard vessels and also ensuring that the Coast Guard has the legal  authority to prosecute certain drug smuggling cases.\n\nI would also like to express my thanks for the bipartisan leadership  of Chair Sam Graves, Ranking Member Larsen, and Subcommittee Chair  Ezell.\n\nThis bill will strengthen the Coast Guard's ability to…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692170/controlled-substance-onboard-vessels"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…opportunity,  and laid the groundwork for a more sustainable future. As Executive  Director of the San Joaquin Regional Rail Commission, she led the  launch of the Altamont Corridor Express--ACE--in 1998, uniting San  Joaquin, Alameda, and Santa Clara Counties through a first-of-its-kind  commuter rail partnership. This complex initiative required building  infrastructure…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696403/recognizing-the-retirement-and-career-of-stacey-mortensen"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…a serious attempt to cut  funding.\n\nMr. Speaker, if you want to go after waste and save taxpayer money,  then count me in. Count me in. I wish my Republican friends would  express some concern about the fact that their President is spending  maybe up to $40 million for a parade of military tanks on his birthday.\n\nReally?\n\nWe are cutting money to save…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…efficiency. It was  never about finding waste, fraud, and abuse. That was always the big  lie. What Elon Musk was trying to do was reshape government illegally  against the express will of Congress.\n\nUnfortunately, my colleagues on the other side of the aisle failed to  stand up to this abuse of law and this direct attack on our  Constitution and our…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…are still in use today.\n\nOn behalf of everyone in Pennsylvania's 13th Congressional District,  I offer heartfelt congratulations to the Farabaugh and Burkhart  families and express gratitude for their enduring commitment to one of  Pennsylvania's most vital industries, and that is agriculture.                  Honoring Partsch Farm in Conemaugh Township…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695049/supporting-the-stop-of-chinese-fentanyl"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…is imperative the Office of  Intelligence and Analysis analysts have effective partnerships within  the intelligence community.\n\nIn addition, I also want to take a second to express my gratitude to  the rest of my Committee on Homeland Security colleagues on both sides  of the aisle as we work to advance over a dozen bipartisan pieces of  legislation…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696795/dhs-intelligence-rotational-assignment-program-and-law-enforcement-support-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…in       promotional materials, social media promotions, or paid       advertising, unless a partnership agreement has been executed       or the issuer or exchange has the express written consent of       the venue, team, or artist, as applicable; and\n\n(3) shall not include the name of the venue, including any       misspelling of any such name, in…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690175/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…current and future members.\n\nOn behalf of everyone in the 13th Congressional District, I  congratulate the Fayette Fire Company of Juniata County on its 100th  anniversary and express my personal thanks for their distinguished  legacy of community service.\n\nRecognizing 75th Anniversary of Williamsburg Public Library\n\nMr. JOYCE of Pennsylvania. Madam Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695425/president-trumps-peace-through-strength-agenda"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…public understanding of the  deep significance the site holds in our military history and honor the  site where so many gave their last full measure of devotion.\n\nMr. Speaker, I express my gratitude to my great friend and classmate,  Chairman Bruce Westerman, for his partnership in ensuring our  battlefields and historic sites in upstate New York and across…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691016/strengthening-americas-turning-point-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…American people safe.\n\nThis legislation will authorize the President to impose sanctions  against any PRC entity that engages in PRC military or intelligence  sectors.\n\nI want to express my gratitude to our colleagues, people like  Senators Cortez Masto, Warren, Banks, Slotkin, Ricketts, Bennet,  Hagerty, Kim, McCormick, Schumer, Sullivan, Fetterman, and others…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688807/cormick-and-mmcr-fettermanhagerty-kim-cormick-schumer-sullivan-fetterman-and-others-for"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…ensures our servicemembers have the training, tools, and support they  need to confront the growing threats that we face at home and abroad.\n\nMr. Speaker, I rise today to express my strong opposition to the NDAA  provision that seeks to circumvent the established merit-based process  for Federal Tribal recognition and instead grant unchecked Federal…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697785/ensuring-fairness-and-integrity-in-federal-tribal-recognition"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…researching art therapy and how it  can help people who are dealing with negative emotions. Applying her  research on art therapy techniques, Faith's project helped students  express their negative emotions through art using colors and shapes.  Faith presented the color wheel to students and taught them how they  can use art to express and influence their…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691494/recognizing-faith-mccrea-gold-award"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Langhorne's government  remained responsive, compassionate, and responsible. His legacy is  built on countless acts of service which are many unseen, but all  deeply felt.\n\nToday, we express gratitude not only for his public accomplishments,  but also for the humility, kindness, and character that have defined  his service. He has lived a life that reflects a…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697645/commending-mayor-joe-taylor-for-his-dedicated-service-to-langhorne-borough"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…today, we are going to move to our first  vote on Professor Jennifer Mascott's nomination to the U.S. Court of  Appeals for the Third Circuit. I want to take a few minutes to express  my support for her nomination and to urge my colleagues to vote  accordingly.\n\nBipartisanship in this body has become, unfortunately, rare. Our  government shut down because…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696138/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…continued efforts to support veterans in need reflect the very best  of our Nation's values. His legacy of service is an inspiration to all  who know him.\n\nMr. Speaker, let us express our deepest gratitude to Robert Longo for  his military service and his unwavering dedication to his fellow  veterans. His life's work reminds us of the strength and resilience…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689738/recognizing-robert-longo-as-april-2025-veteran-of-the-month"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…serving our veterans. On  behalf of everyone in Pennsylvania's 13th Congressional District, I  congratulate the James E. Van Zandt Medical Center on this important  milestone and express my personal gratitude for the excellent  healthcare that has been provided to the veterans there, continuing  today and into the future.\n\nHonoring Century Farm Designation…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696753/improving-domestic-energy-market"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "Mr. JACKSON of Texas. Mr. Speaker, I rise today to recognize and  express my sincere gratitude to my Defense Fellow, Major Evan Hanson of  the United States Air Force, for his outstanding work in my office and  service to the people of Texas' 13th…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697563/recognizing-and-expressing-gratitude-to-defense-fellow-major-evan-hanson"}, {"senator": "John Joyce", "party": "Republican", "sentence": "Mr. JOYCE of Pennsylvania. Mr. Speaker, I rise to express my support  for legislation that House Republicans are bringing to the floor this  week to bring down healthcare costs for Americans.\n\nSince the enactment of the unaffordable…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698173/lowering-healthcare-costs-for-all-americans"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "Mr. JACKSON of Texas. Mr. Speaker, I rise today to recognize and  express my gratitude to my former Chief of Staff, Bryan Brody of  Highland Village, Texas, for his exceptional service, tireless  dedication, and unwavering commitment to the people…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697548/recognizing-and-expressing-gratitude-to-former-chief-of-staff-bryan-brody"}]