[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Speaker, in strong support of this bipartisan  effort to protect the healthcare of the American people and ensure that  we extend the Affordable Care Act tax credits, to make sure that tens  of millions of Americans do not experience dramatically increased  premiums, copays, and deductibles.", "title": "Breaking the Gridlock Act", "date": "2026-01-08"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Speaker, I rise today to call up a bipartisan  motion to discharge legislation to extend the Affordable Care Act tax  credits to make sure that tens of millions of everyday Americans do not  experience dramatically increased premiums, copays, and deductibles  that will prevent them from being able to go see a doctor when they  need one.", "title": "Providing for Consideration of H.R. Breaking the Gridlock Act", "date": "2026-01-07"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "As Americans face a Republican-manufactured health care crisis,  skyrocketing costs from Trump's tariffs and a weakening economy,  Republicans have refused to extend the Affordable Care Act premium tax  credits for working class families, which will expire December 31,  2025.", "title": "Healthcare is Real", "date": "2025-12-17"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "Then they refused to negotiate with Democrats to extend the  Affordable Care Act tax credits so that 22 million wouldn't have to  choose between healthcare and rent.", "title": "Providing for Consideration of Senate Amendment to H.R. Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "6074, which  would extend the Affordable Care Act enhanced premium tax credits for 3  years, through 2028.", "title": "Providing for Consideration of H.R. Promoting Efficient Review for Modern Infrastructure Today Act; Providing for Consideration of H.R. Increasing Investor Opportunities Act; Providing for Consideration of H.R. Electric Supply Chain Act; Providing for Consideration of H.R. State Planning for Reliability and Affordability Act; Providing for Consideration of H.R. Improving Interagency Coordination for Pipeline Reviews Act; Providing for Consideration of S. Disinterment of Remains of Fernando V. Cota From Fort Sam Houston National Cemetery; and for Other Purposes", "date": "2025-12-10"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Speaker, I rise today in strong support of  this legislation to extend the Affordable Care Act and the tax credits.", "title": "Providing for Consideration of H.R. Breaking the Gridlock Act", "date": "2026-01-07"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "In addition to cutting $1 trillion from Medicaid, congressional  Republicans refused to extend the Affordable Care Act enhanced premium  tax credits under Trump's Big Beautiful Bill.", "title": "Healthcare", "date": "2026-01-07"}, {"senator": "Lauren Underwood", "party": "Democrat", "sentence": "Speaker, I rise today in support of my bill to  extend the Affordable Care Act tax credits and to put an end to the  Republican healthcare crisis.", "title": "Breaking the Gridlock Act", "date": "2026-01-08"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "6074, which  would extend the Affordable Care Act enhanced premium tax credits for 3  years, through 2028.", "title": "Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``National Petroleum Reserve in Alaska Integrated Activity Plan Record of Decision''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Buffalo Field Office Record of Decision and Approved Resource Management Plan Amendment''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Coastal Plain Oil and Gas Leasing Program Record of Decision''; Providing for Consideration of H. Con. Res. Denouncing the Horrors of Socialism; Providing for Consideration of H.R. Unlocking Our Domestic Lng Potential Act of Providing for Consideration of H.R. Researching Efficient Federal Improvements for Necessary Energy Refining Act; Providing for Consideration of H.R. Common-Sense Law Enforcement and Accountability Now in DC Act of Providing for Consideration of H.R. District of Columbia Cash Bail Reform Act of and for Other Purposes", "date": "2025-11-18"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Speaker, let me first thank Richard Neal, the once  and future chairman of the powerful Ways and Means Committee, as well  as Frank Pallone,  Bobby Scott, all my colleagues in government on the  Democratic side, and the Republicans who have joined us now to make  sure that we extend the Affordable Care Act tax credits which are  scheduled to expire at the end of this month.", "title": "Lower Health Care Premiums for All Americans Act", "date": "2025-12-17"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "This Republican healthcare crisis is completely and entirely  preventable, and House Democrats and even a few Republicans have a  solution: Extend the Affordable Care Act enhanced premium tax credits.", "title": "Providing for Consideration of H.R. Lower Health Care Premiums for All Americans Act; Providing for Consideration of H.R. Do No Harm in Medicaid Act; Providing for Consideration of H.R. Protect Children's Innocence Act; and Relating to Consideration of H.R. Standardizing Permitting and Expediting Economic Development Act", "date": "2025-12-17"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Speaker, I rise today in strong opposition to this woefully  inadequate spending bill that fails to decisively address the  Republican healthcare crisis and fails to extend the Affordable Care  Act tax credits for tens of millions of Americans.", "title": "Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "I will offer them the opportunity to maybe extend the Affordable Care  Act to the 24 million Americans who are facing unprecedented enormous  health insurance premium hikes since we are extending healthcare stuff  today.", "title": "Hospital Inpatient Services Modernization Act", "date": "2025-12-01"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "She, her husband, and her college-aged son  are going to see an increase of $1,700 a month, $20,000 a year more  that they are going to pay for their health insurance for three people  if Republicans don't do the right thing and extend the Affordable Care  Act tax credits.", "title": "Recognizing Sarah Dully, Rhode Island Teacher of the Year", "date": "2025-12-03"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "Now, Republican leadership, who love to extend tax breaks for  billionaires, are making things worse by, for months, refusing to  extend the Affordable Care Act's tax credits for regular people.", "title": "Protecting Healthcare for Millions of Americans", "date": "2026-01-08"}]