[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…new location as quietly as can       be done with a police escort.\n\nBoth the appeals and challenges of the society's current       home were evident during a recent tour. An extensive library       all but begged the visitor to pause and flip through a book,       any book: on heraldry or mythology, shipwrecks or excavation.       Then, once past the several…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…mistake.\n\nAcross the Federal land management agencies, plans like these are the  foundation for responsible, sustainable management of our public lands.  RMPs are the product of extensive public input, rigorous scientific  reviews, and meaningful Tribal consultation. Balancing the activities  on our public lands from energy development to recreation is what…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…to talk about the merits of this bill today, I am  sure, but we all know that this veto has nothing to do with fiscal  policy, nothing to do with the merits. There has been extensive  reporting that raises broader concerns about the administration's  posture toward the State of Colorado and even toward the sponsor of  this bill.\n\nWe know what this veto…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698699/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…San Antonio and then  went on to St. Louis to get a law degree from Washington University.\n\nHe built a successful career as a commercial litigator in Houston and  provided extensive pro bono work there, including his working with  immigrant families affected by the Muslim ban. He most recently served  as the Harris County attorney, the youngest person…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699521/welcoming-the-honorable-christian-d-menefee-to-the-house-of-representatives"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…suffers from a life-threatening heart  condition and has fully complied with every requirement of our  immigration system, submitting every application on time, providing  extensive documentation, and cooperating completely with USCIS.\n\nYet, 2 months ago, after dropping his 15-year-old son off at school,  Marwan was detained by ICE. This is a man who…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696969/marwan-marouf-needs-humanitarian-parole-now"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…grazing, and recreation with protecting clean  water, wildlife, and the long-term health of the land.\n\nThe three plans under attack today took years to develop. They  reflect extensive Tribal consultation, public input, and the expertise  of career scientists.\n\nAs the gentleman just said, these resolutions don't just undo those  protections. Under the Congressional…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694910/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…here.\n\nTitus).\n\nMr. FOSTER. Mr. Speaker, I have to say Ms. Titus is absolutely right  about the fact that there is no necessity to resume nuclear testing.\n\nWe have a very extensive program. It is called the Stockpile  Stewardship Program. Every year or so, the heads of the weapons labs  and the head of NSA have to sign a document to the President that…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…make our Nation's Capital less safe.\n\nIn 1992, the DC Council, DC's elected legislative branch       under the Home Rule system established by Congress, found       after extensive hearings that cash bail was harming, not       helping, public safety. The Council adopted a system that,       mirroring federal bail laws, removes wealth from the decision…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696958/opposition-letter-led-by-tzedek-dc-on-the-district-of-columbia-cash-bail-reform-act-of-2025-hr-november-2025"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…fourth largest Federal funding stream for public schools.\n\nTwo weeks ago, I visited the Campus School in Boston, which is a  school for students with complex disabilities and extensive support  needs. During my visit, I met Natalie, a middle school student, and her  mom Julia. Natalie has Dup15q syndrome, which causes serious  developmental, behavioral,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697522/50th-anniversary-of-individuals-with-disabilities-education-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…is up here--which is the  headwaters that flows into the Boundary Waters Wilderness and Voyageurs  National Park. It started a 2-year environmental study, which included  extensive public input and scientific review.\n\nWhile the Rainy River Watershed was being studied, Paradise Valley in  Montana and Methow Valley in Washington State were going through…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…position, John oversaw Emergency  Medical Services, dispatch, fleet services, and special operations. His  educational background in organizational leadership, along with his  extensive on the job experience, has separated him from the other 76  applicants. Our community is fortunate to have an incoming Chief with  the years of experience and education that…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692026/recognizing-john-curtis"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…reconnaissance missions worldwide. Moreover, she played a vital  role in supporting the numerous wings, mission partners, and personnel  stationed at Buckley, as well as the extensive retiree community.\n\nA native of Greenville, South Carolina, Chief Master Sergeant Haynes  entered the Air Force in 2003 and quickly established herself as a  dedicated and…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692495/recognizing-the-service-of-chief-master-sergeant-sharma-j-haynes"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…them--should write to the  Department of Education saying that this rule makes no sense in terms  of the healthcare system today and, also, is an insult to the people  who go through extensive training, testing, and certification before  they are allowed to practice their caring profession.\n\nWhile we are at it, we should also help the other professions which  were…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697261/nursing-excluded-as-professional-degree-by-department-of-education"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…for the IRS.\n\nMayo Peter Bartlett was an outstanding basketball player who played  in Europe and loved coaching young people in basketball. He was a jazz  enthusiast with an extensive collection of LPs. He has been a good  friend to many. For over 50 years, he and his wife, Ernestine ``Tina''  Conner, were parents of three children and five grandchildren.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696952/amani-public-charter-school"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…local businesses. The Thanksgiving food drive now feeds hundreds of  families each year and fed over 300 families last year.\n\nThe continued success of this food drive requires extensive  dedication, compassion, and community support. In the weeks and months  leading up to Thanksgiving, Terri starts setting up donation sites  throughout town, storing donations,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699949/recognizing-terri-judah"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…the results of such  study every 5 years, including defining the term ``small entity'' under  the Regulatory Flexibility Act.\n\nSimply put, small businesses can't afford the extensive legal and  regulatory expertise that large, multinational firms employ to comply  with every regulation while still managing their operating costs.\n\nRecognizing that company…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693958/small-entity-update-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…now under consideration.\n\nMr. Speaker, I rise in support of H.R. 1368, the DOE and NASA  Interagency Research Coordination Act.\n\nThe Department of Energy and NASA have an extensive history of  collaboration, which has enhanced both our understanding of the  universe and our ability to explore well beyond our planet.\n\nThe Voyager spacecrafts, which were…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688985/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…leadership and resolve.  Relentlessly, alongside the entire leadership team and staff of Freedom  House, she has protected dissidents from harm around the world,  leveraging her extensive network and strong, trusted relationships to  safeguard those who stand against oppression and tyranny. Her efforts  have provided critical support to vulnerable individuals…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700047/recognizing-the-service-of-annie-wilcox-boyajian"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…school student who  maintains a 4.0 GPA with AP courses. She balances academic rigor with  leadership in volleyball, the art club, and the Girls Inc. Eureka!  program.\n\nHer extensive history of community service includes the Open Door  Mission and organizing gift drives for overseas troops and local  seniors. Ms. Anthony is known for her compassionate…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699725/happy-90th-birthday-to-beth-ragland"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…professional, he completed advanced courses in  leadership, public affairs, multimedia production, space and missile  operations, communications, and emergency medical care. His extensive  professional training included the Substance Abuse Program Prevention  Course, Digital Multimedia Course, Instructor Training Course, Public  Affairs Course, Combat Lifesaver…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696275/recognizing-sergeant-first-class-alyn-michael-macleod-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…his peers in the legal community for  outstanding track records, being rated among the best lawyers in  Montana for environmental and commercial litigation.\n\nThroughout his extensive legal career and years of public service,  Bill has represented Montana's interests very well. He is committed to  the rule of law and the original interpretation of the…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696331/nomination-of-william-w-mercer"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…and Wise County UAS event coordinator,  Andrianah Kilgore.\n\nAt that time, delivering medical supplies to rural sites like the RAM  Wise County clinic event often required extensive hours of travel that  could take hours or days of travel across rugged, mountainous terrain.  But on that historic day, a drone carried the same supplies in just  minutes--safely…", "date": "2026-01-16", "source_url": "https://justfacts.votesmart.org/public-statement/1699162/recognizing-the-10th-anniversary-of-the-first-faa-approved-drone-delivery-in-the-united-states-commending-lets-fly-wisely"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. Mr. President, on Thursday afternoon, Democrats abruptly  ended extensive bipartisan work on the GENIUS Act and filibustered the  Senate's attempt to move this bill. Democrats, I should say, who had  voted for the bill in committee, inexplicably…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690974/business-before-the-senate"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…was  underway;\n\nWhereas Delegate Plaskett, who previously served as an assistant  attorney general in the U.S. Department of Justice Civil Division, is  known to have had extensive political, personal and professional  connections with Epstein after his conviction as a sex offender up to  the time of his arrest and then death in 2019;\n\nWhereas Delegate…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696890/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…agriculture in 1981.\n\nMr. Sola is a fourth-generation farmer who has devoted his life to  nurturing the land his family has tended since it was homesteaded in  1903. Mr. Sola has extensive experience growing products including  cotton, corn, wheat, tomatoes, sugar beets, broccoli, cauliflower, and  watermelons, all of which are important crops to Central Valley.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697013/recognizing-vincent-sola"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…Staff for Congressman Kevin Hern, and Legislative Director and  Deputy Chief of Staff for Ranking Member Kevin Brady before coming to  Team Jackson as my Chief of Staff. His extensive experience, knowledge,  and leadership in these roles have helped shape policy and governance  at the highest levels.\n\nDuring his tenure in my office, Jeff was instrumental…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690377/recognizing-the-career-of-jeffery-ronald-billman"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…conversations about the  cost of illegal immigration on programs that are designed to help and  support vulnerable Americans, especially Medicaid.\n\nCongressman Haridopolos has extensive experience in the Medicaid  space, and he knows that it must be guarded to protect those who rely  upon it here in the United States. It is not an international charity,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…in the eye of the beholder.\n\nWhat we did in this bill, and I think it is something that everybody  on the floor can be proud of, we put into this bill the capability to  do extensive research by universities, the NIH, and the FDA. We created  a framework to do research on the 4,800 believed analogues of fentanyl.\n\nI believe it has two advantages. One,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Physics.\n\nBeyond her academic achievements, Kacee has demonstrated an  extraordinary commitment to service. She has dedicated her time to  uplifting those around her through extensive volunteer work, including  serving at Revive Common Grounds, assisting with local blood drives,  supporting VFW spaghetti dinners, and bringing holiday joy to children  through…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689670/recognizing-kacee-gray-as-cass-citys-2025-junior-citizen-of-the-year"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Mr. President, the Senate will soon vote to confirm  Linda McMahon to be Secretary of Education.\n\nI know that some people feel that the Secretary of Education should  have extensive experience in a school system; however, it is important  to remember that education is still mostly a State and local  responsibility. There is no such thing as a Federal…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688387/nomination-of-linda-mcmahon"}]