[{"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…grazing, and recreation with protecting clean  water, wildlife, and the long-term health of the land.\n\nThe three plans under attack today took years to develop. They  reflect extensive Tribal consultation, public input, and the expertise  of career scientists.\n\nAs the gentleman just said, these resolutions don't just undo those  protections. Under the Congressional…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694910/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…mistake.\n\nAcross the Federal land management agencies, plans like these are the  foundation for responsible, sustainable management of our public lands.  RMPs are the product of extensive public input, rigorous scientific  reviews, and meaningful Tribal consultation. Balancing the activities  on our public lands from energy development to recreation is what…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…surrounding the Boundary Waters and its  headwaters from mining for 20 years through a public land order, a  standard tool and process backed by peer-reviewed science and extensive  public engagement.\n\nThe Congressional Review Act resolution on the floor today would  overturn those protections, once again putting our beloved Boundary  Waters at risk…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…office, Donald John Trump has, through  unlawful orders and directives, created an unlawful office, the so- called Department of Government Efficiency, DOGE, and assigned an  extensive range of unlawful powers, effectively granting this  flagrantly unconstitutional creation significant control over the  executive branch.\n\nDonald John Trump has appointed…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…Drugs.  Soon after, he was a member of the Justice and Civil Rights Review Team  for President Barack Obama's Presidential Transition Team.\n\nGiven his high qualifications and extensive experience, it is no  surprise that in 2014, the good people of Prince George's County,  Maryland elected Mr. Barron to the House of Delegates. In the state  legislature,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688210/recognizing-a-trailblazing-career-in-criminal-justice-us-attorney-erek-lawrence-barron"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…quality of life, such as family leave policies, career  flexibility, tuition assistance incentives, and behavioral healthcare.\n\nEqually important, this bill capitalizes on the extensive work that  former Commandant, Admiral Fagan, did to make institutional changes to  address sexual assault and sexual harassment.\n\nOur coasties deserve better, and this legislation…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694192/coast-guard-authorization-act-of-2025"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…here.\n\nTitus).\n\nMr. FOSTER. Mr. Speaker, I have to say Ms. Titus is absolutely right  about the fact that there is no necessity to resume nuclear testing.\n\nWe have a very extensive program. It is called the Stockpile  Stewardship Program. Every year or so, the heads of the weapons labs  and the head of NSA have to sign a document to the President that…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…make our Nation's Capital less safe.\n\nIn 1992, the DC Council, DC's elected legislative branch       under the Home Rule system established by Congress, found       after extensive hearings that cash bail was harming, not       helping, public safety. The Council adopted a system that,       mirroring federal bail laws, removes wealth from the decision…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696958/opposition-letter-led-by-tzedek-dc-on-the-district-of-columbia-cash-bail-reform-act-of-2025-hr-november-2025"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…fourth largest Federal funding stream for public schools.\n\nTwo weeks ago, I visited the Campus School in Boston, which is a  school for students with complex disabilities and extensive support  needs. During my visit, I met Natalie, a middle school student, and her  mom Julia. Natalie has Dup15q syndrome, which causes serious  developmental, behavioral,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697522/50th-anniversary-of-individuals-with-disabilities-education-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…is up here--which is the  headwaters that flows into the Boundary Waters Wilderness and Voyageurs  National Park. It started a 2-year environmental study, which included  extensive public input and scientific review.\n\nWhile the Rainy River Watershed was being studied, Paradise Valley in  Montana and Methow Valley in Washington State were going through…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…position, John oversaw Emergency  Medical Services, dispatch, fleet services, and special operations. His  educational background in organizational leadership, along with his  extensive on the job experience, has separated him from the other 76  applicants. Our community is fortunate to have an incoming Chief with  the years of experience and education that…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692026/recognizing-john-curtis"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…to talk about the merits of this bill today, I am  sure, but we all know that this veto has nothing to do with fiscal  policy, nothing to do with the merits. There has been extensive  reporting that raises broader concerns about the administration's  posture toward the State of Colorado and even toward the sponsor of  this bill.\n\nWe know what this veto…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698699/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…the vast majority of Americans.\n\nMr. Speaker, with respect to the Miles City Resource Management Plan  update, it is just important contextually to say that it was a very  extensive and inclusive public comment period. BLM provided a 90-day  public comment period, two public meetings, a 30-day public comment  period, and a 60-day review period for the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694889/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…systems to make the  experience seamless. This means updating airplane screening technology,  modernizing TSA, full-strength staffing at Customs and Border  Protection, and extensive marketing efforts. New York City, which I  represent in part, is a major worldwide tourist destination.\n\nThere is still time to build this industry to make us the best in…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691775/growing-travel-industry-jobs"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…local businesses. The Thanksgiving food drive now feeds hundreds of  families each year and fed over 300 families last year.\n\nThe continued success of this food drive requires extensive  dedication, compassion, and community support. In the weeks and months  leading up to Thanksgiving, Terri starts setting up donation sites  throughout town, storing donations,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699949/recognizing-terri-judah"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…the results of such  study every 5 years, including defining the term ``small entity'' under  the Regulatory Flexibility Act.\n\nSimply put, small businesses can't afford the extensive legal and  regulatory expertise that large, multinational firms employ to comply  with every regulation while still managing their operating costs.\n\nRecognizing that company…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693958/small-entity-update-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…that powers our economy and enables modern life  for households.\n\nTo ensure the timely delivery of electricity at all times of the day,  utilities have historically undergone extensive planning processes to  methodically deploy ratepayer dollars to build requisite  infrastructure.\n\nUnfortunately, in recent years, we have seen States move away from an  integrated…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697882/state-planning-for-reliability-and-affordability-act"}, {"senator": "Mike Kelly, Jr.", "party": "Republican", "sentence": "…out with professionalism and  integrity.\n\nThroughout her tenure, Ms. Krzysiak has demonstrated a commitment to  public service and to the residents of Crawford County. Her extensive  knowledge, attention to detail, and tireless work ethic have not only  ensured the responsible management of county finances but have also  earned her the respect and admiration…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689885/recognizing-christine-krzysiak-as-a-community-champion-in-pennsylvania-16"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…agriculture in 1981.\n\nMr. Sola is a fourth-generation farmer who has devoted his life to  nurturing the land his family has tended since it was homesteaded in  1903. Mr. Sola has extensive experience growing products including  cotton, corn, wheat, tomatoes, sugar beets, broccoli, cauliflower, and  watermelons, all of which are important crops to Central Valley.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697013/recognizing-vincent-sola"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Richard worked in a  surveying crew for the Texas Department of Transportation in the early  days of construction of Interstate 45 in 1970. He then moved on and  entered an extensive career with Texas Instruments in their Facility  Maintenance Division earning the following trade licenses before  retiring in 2009: Master Plumber in 1981 and Journeyman's…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696281/recognizing-richard-reagan-horn-with-a-congressional-veteran-commendation"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…his peers in the legal community for  outstanding track records, being rated among the best lawyers in  Montana for environmental and commercial litigation.\n\nThroughout his extensive legal career and years of public service,  Bill has represented Montana's interests very well. He is committed to  the rule of law and the original interpretation of the…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696331/nomination-of-william-w-mercer"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…businesses and individuals  in need of this vital support is squandered and stolen.\n\nOver the course of the COVID pandemic, the Small Business  Administration carried out an extensive effort, channeling funding to  small businesses facing unprecedented economic challenges. In total,  SBA provided over $1.2 trillion in emergency loans and grants during…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697225/sba-fraud-enforcement-extension-act"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…appalling lack of diligence in       preventing trafficking, not a single one establishes that       craigslist created or developed the trafficking content.''       After an extensive legal battle, the Court ultimately found       craigslist not liable based on a Section 230 defense.    Mother Whose 11-year-old Son Was an Alleged Victim of Sexual Battery…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…served as a Federal  security director since January of 2020, managing operations and  directing security efforts all across our great State.\n\nDave's record of service is both extensive, and it is remarkable. He  has served as an honorary commander with the U.S. Coast Guard Base  Charleston through the Joint Base Charleston Program and has made  equally…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698763/recognizing-david-mcmahon"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…advocacy priorities leading to legislative, regulatory,  and public policy outcomes that ultimately benefited the company,  customers, employees, and business partners.\n\nHis extensive experience with product sales uniquely equipped him to  educate policymakers and regulators about the company, its products,  and processes. This expertise made him an effective…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694731/congratuling-deere-company-vice-president-of-global-government-affairs-collis-jones-on-his-retirement"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…Staff for Congressman Kevin Hern, and Legislative Director and  Deputy Chief of Staff for Ranking Member Kevin Brady before coming to  Team Jackson as my Chief of Staff. His extensive experience, knowledge,  and leadership in these roles have helped shape policy and governance  at the highest levels.\n\nDuring his tenure in my office, Jeff was instrumental…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690377/recognizing-the-career-of-jeffery-ronald-billman"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…hydropower facility in the United  States is 60 years. Therefore, hundreds of projects will be up for  relicensing between now and 2035.\n\nHydropower developers must go through an extensive permitting process  in order to license and relicense projects. While important, this  process can significantly increase the cost and timeline of relicensing  these important…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693478/hydropower-licensing-transparency-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…soldiers fought and died in America's wars in Afghanistan and Iraq.  There is no ambiguity here--no ambiguity. Close ties with our  northernmost allies are what make America's extensive reach in the  Arctic actually possible. And I have yet to hear from this  administration a single thing we need from Greenland that this  sovereign people is not already…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Physics.\n\nBeyond her academic achievements, Kacee has demonstrated an  extraordinary commitment to service. She has dedicated her time to  uplifting those around her through extensive volunteer work, including  serving at Revive Common Grounds, assisting with local blood drives,  supporting VFW spaghetti dinners, and bringing holiday joy to children  through…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689670/recognizing-kacee-gray-as-cass-citys-2025-junior-citizen-of-the-year"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…rehabilitation services, where his  team is committed to delivering quality care  to their patients and clients in Blairsville and Union County, Georgia.\n\nMr. Barth has provided extensive care for disorders that affect  speech, function, movement, and swallowing. His specialization lies in  restoring mobility in patients, reducing pain, rehabilitating injuries,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699261/recognizing-wayne-barth"}]