[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…ensure that these standards were feasible and justifiable. Unlike my  colleagues across the aisle, the Department of Energy went through a  prolonged process that engaged extensively with experts and worked to  address their concerns.\n\nIn fact, in recently submitted comments regarding the delay and the  effective date for the standards, the Air-Conditioning,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689263/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…purpose led her  to the board in 2010 and eventually to her current leadership role.\n\nA veteran teacher in the Rochester City School District, Monica has  also volunteered extensively throughout the Jewish community, including  service on the board of Jewish Family Services. Her experience in the  Wexner Heritage Program--a prestigious two-year leadership…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691572/recognizing-monica-gurell"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…to  stress because there is nothing more important in the Constitution than  the power to declare war.\n\nThe Founders who wrote the Constitution in 1787 debated this topic  extensively, and they recognized the reality in the world at the time:  Decisions about war were made by the Executive, King, Monarch, Emperor,  Czar, Pope. It was made by the Executive.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…her time  and skills where needed and bringing the same care and diligence to her  professional life as she has to her AMVETS mission; and\n\nWhereas, Cindy Rice has traveled extensively throughout the United  States to visit AMVETS Departments and Auxiliaries, sharing her  message, promoting her project, and uplifting all with her inspiring  theme--Together…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690126/proclamation-for-national-amvets-auxiliary-president-cindy-rice"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…The  Gentlemen Shop, G & W His & Hers Accessories, and the Albany Christian  Book & Gift Store.\n\nHis ministry and mission were global in scope--Bishop Williams  traveled extensively to Haiti, Africa, London, Paris, Amsterdam,  Belize, Jamaica, Honduras, Mexico, and beyond, and he established two  ministries in Liberia. He served as Bishop Ordinary for…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…to disparage, was a coordinated,  unanimous finding by the entire intelligence community. Our committee-- on a bipartisan, unanimous basis--reviewed it and validated it  extensively. Not a single one of my Republican colleagues objected to  its findings, including the current Secretary of State, then-committee  chairman Senator Rubio.\n\nAnd what did…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…national laboratories across the United States provide the government  with some of its most cutting-edge research.\n\nAt the same time, our Nation's small businesses contribute  extensively to public and private sector research and development  efforts. Aligning research efforts between the DOE and the SBA would  increase the efficiency of the national labs…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687909/doe-and-sba-research-act"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…worked as a Laboratory Craftsman  until her retirement in 2006. Throughout her service, she earned a  second CCAF degree, was active in chapel ministries, and volunteered  extensively in the base and local community, including youth programs  and church education.\n\nFollowing her military retirement, TSgt. Ybarra continued her service  to veterans as a…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696274/recognizing-technical-sergeant-martha-socorro-ybarra-usaf-retired-with-a-congressional-veteran-commendation"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…notified targets of U.S. investigations when they receive  requests for assistance.\n\nThe PRC allows for the open sale of fentanyl precursors and other  illicit materials on the extensively monitored and controlled PRC  internet. A review of just seven e-commerce sites found over 31,000  instances of PRC companies selling illicit chemicals with obvious ties…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694828/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…house in Millbrae. It soon  grew to a small warehouse in San Bruno and then a bigger warehouse in  San Mateo and then in Redwood City and finally in Hayward.\n\nHe traveled extensively for business, both overseas and the United  States. He achieved one of his greatest goals by becoming a citizen of  the United States in 1973.\n\nAfter over 40 years in the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Regardless of the issue, he  remains positive and works towards reasonable resolutions, even while  facing medical challenges. Beyond his own community, Hugh volunteers  extensively. His roles include Vice Chair of the Penny for Pasco  Oversight Committee for Education, Field Training Officer with the  Pasco Sheriff's Office Citizens Service Unit, Board…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692162/recognizing-hugh-townsend"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…Oversight and Government Reform Committee.\n\nI got to ask her about a lot of her past public statements. It turns  out she has a prolific Twitter history. She has written extensively  about every single major woke buzzword that you can think of, Mr.  Speaker, including ``the ravages of late-stage capitalism,''  ``structural privilege,'' and her own ``cis…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693722/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…advanced AI  technologies.\n\nIn November 2025, I convened a subcommittee hearing on export control  loopholes which leave American technology vulnerable, and this is where  we extensively discussed issues such as this one. H.R. 2683 was  reported favorably out of the House Foreign Affairs Committee by a vote  of 51-0. Mr. Speaker, we can't do better than…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698859/remote-access-security-act"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…where her attention to detail was  crucial in my ability to represent and serve my constituents.\n\nKathy discovered her passion for public service in High School and  was extensively involved in the Florida Federation of Teenage  Republicans and the Republican Party of Florida. This passion  eventually led Kathy to study Political Science at the University…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697542/recognizing-and-expressing-gratitude-to-former-director-of-operations-kathy-zhu"}, {"senator": "French Hill", "party": "Republican", "sentence": "…regulated, what is the role of United States  Government in oversight, what is the future of money in terms of the  use of a blockchain.\n\nMembers in these committees have worked extensively. Likewise over in  the Energy and Commerce Committee, the idea of blockchain technology at  large outside financial institutions has garnered a tremendous amount  of bipartisan…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693731/anti-cbdc-surveillance-state-act"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…Department of Agriculture for  several years in the late 1980s. For 16 years, he worked as State  Executive Director of the USDA's Farm Service Agency. Steve traveled  overseas extensively throughout his career to promote Ohio products and  expand our state's trade opportunities.\n\nA native of Carroll County, John H. Davis has dedicated his life to  teaching…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694257/recognizing-the-2025-class-of-the-ohio-agricultural-hall-of-fame"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…has been with PCCA since September 2002, actively  participating in legislative, regulatory, and public affairs  initiatives. At PCCA, he has been a visionary, contributing extensively  to the organization's scientific, technical, and strategic pursuits.\n\nIn addition to his outstanding work with PCCA, Mr. Bassani has  previously served on the United States…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690331/recognizing-david-sparks-for-contributions-to-pharmaceutical-industry"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…vote in Congress.\n\nAnd our Democratic colleague says you can't change it because we  worked a way to be able to fix it so you couldn't. That is not true.  This body worked extensively with the Parliamentarian's office. This  body worked extensively across the aisle to be able to have  conversation, talking with members of the Democratic caucus to say:…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691634/congressional-review-act"}]