[{"senator": "George Latimer", "party": "Democrat", "sentence": "…Reverend Norman has led the church in spiritual matters, Sunday  worship services, and weekly Bible study classes, in person and online.\n\nHis service to the larger community extends to his efforts to meet  the needs of the poor and the hungry, young people and seniors, the  homeless, and those in need of mental health services.\n\nPastor Norman serves the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696971/recognizing-reverend-william-e-norman-sr"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…Joyce Beatty and Ayanna Pressley, we  were all struck by her poise, her genius, and her passion for artistry  and activism.\n\nMr. Speaker, the impact of Ava DuVernay's artistry extends far beyond  her portfolio. Rather, it is the voices that may otherwise have gone  unheard and the generations of filmmakers who she has inspired that  will be credited as…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696266/recognizing-ms-ava-duvernay-art-as-a-catalyst-for-change"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…spiritual growth and community service. Her involvement  in various initiatives showcases her unwavering dedication to improving  the lives of others.\n\nMrs. Booker's service extends far beyond her church. She has been a  consistent advocate for children's welfare and has worked relentlessly  to provide opportunities for underserved populations. Her tireless…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694759/recognizing-mrs-juanita-carson-booker"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…It provides the clarity our fleet needs to operate effectively and the  consistency our Pacific partners expect from the United States.\n\nThe significance of this legislation extends well beyond economic  benefits. The treaty itself embodies a broader commitment, one rooted  in decades of cooperation, mutual respect and shared responsibility for  the stewardship…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691007/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…Beyond her judicial service, Judge Hicks has been a dedicated mentor  and role model, investing in the growth and advancement of future legal  professionals. Her influence extends far beyond the courtroom, leaving  an enduring mark on the legal landscape through her advocacy, guidance,  and commitment to ensuring equal access to justice for all.\n\nThe…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699927/recognizing-the-honorable-judge-maryellen-hicks"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…Mildred Long  Bridge project; the Memorial Bridge Project; and many other projects  that have and will continue to improve transportation in New Hampshire.  Bill's service extends beyond his commissioner title, with him actively  involved on committees for the American Association of State Highway  and Transportation Officials (AASHTO) and the Northeast…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699267/recognizing-william-bill-cass-commissioner-of-new-hampshire-department-of-transportation"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…to Patriarch Demetrios, Metropolitan of Philadelphia, and  later Metropolitan of Chalcedon before his election as Ecumenical  Patriarch.\n\nPatriarch Bartholomew's leadership extends far beyond the walls of  the Church. He has become a global voice for peace, interfaith  communication, and environmental stewardship, reminding the world that  creation itself…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695368/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…by double-digit cost  increases on their insurance.\n\nCongress is about to pass a budget for next year, and we can pass a  budget that restores funding for healthcare, that extends the  Affordable Care Act tax premiums, that restores funding for Medicaid so  that working people aren't stuck with higher costs for their health  insurance. Not only can…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695636/government-funding-and-healthcare"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…the same  land, and elevating the people will elevate the land and bring peace to  everyone in the region.\n\nYesterday, Rabbi Ulman and Ahmed al-Ahmed showed that this spirit  extends far beyond the Middle East. Their shared humanity and embrace  of each other reflects our hope for the future, a future in which  people see the dignity and grace in one another…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699026/the-light-will-win"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…on both sides of the  aisle, that strengthens American diplomacy, science, and leadership in  the world.\n\nThe PARTNER Act does something very simple but very important. It  extends basic legal protections, known as privileges and immunities, to  several key international organizations that the United States works  closely with but that, until now, have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694823/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…cosponsored by myself  and seven of our colleagues who  are particularly invested in advancing our country's relationships with  crucial international organizations.\n\nThis bill extends diplomatic privileges and immunities to five  multilateral organizations. I am grateful that Congressman Castro  included a section from my Pacific Partnership Act, which…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694767/supporting-the-partner-act"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…retreat from this understanding.\n\nThe history of DEI efforts in America is not some partisan agenda. It  is part of our Nation's ongoing work to ensure that America's promise  extends to every American. In 2025, as we face renewed attacks on these  principles, we must renew our commitment to this work.\n\nLet me be clear: Diversity, equity, and inclusion…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690322/ending-of-dei-programs-through-executive-order"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Joint Committee  on Taxation tells us it costs $736 billion, and reduce it to less than  1 percent of the true cost.\n\nLet's take another example. There is a provision that extends the  estate and gift tax exemptions. The honest broker, the Joint Committee  on Taxation, says putting that provision in the bill will cost, as in  increasing deficits and…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…with a 3.8 percent pay raise, an increase in the  family separation allowance, and other provisions that will help ease  the financial pressures of military families.\n\nIt also extends the Child Care in Your Home pilot through 2029 and  requires annual reviews of childcare fee assistance.\n\nWe also include protections I championed for our Department of  Defense…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697807/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…their number one priority.\n\nA week ago Friday, in the Budget Committee, on a party-line vote, the  Republicans produced their bill, their budget reconciliation bill,  which extends those tax cuts, despite the fact that it worsens our  budget deficit and leaves middle-class and lower income Americans in  the dust.\n\nThis chart was done by the Peterson…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687944/republican-budget-betrays-middle-class"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Congress  has passed legislation to respond to how the bankruptcy system is  operating.\n\nS. 3424 responds to the current bankruptcy climate in three ways:  First, the bill extends the temporary quarterly fees used to pay for  the United States Trustee Program within the Department of Justice and  bankruptcy judgeships. Ensuring taxpayers are not on…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698845/bankruptcy-administration-improvement-act-of-2025"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…veteran, and  a graduate of the University of Virginia.\n\nIn his 25 years of service, Joe has proven to be an indispensable  member of my team. His pride for the 1st District extends into  everything he does. Not only is Joe passionate about his work, his  commitment to bettering  the lives of Virginians and Americans alike is unparalleled. Joe is  unwavering…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700090/recognizing-joe-schumachers-25-years-of-dedicated-public-service"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "Mr. MEUSER. Mr. Speaker, I thank my friend from Texas for his  leadership.\n\nMr. Speaker, in order for us to deliver one big, beautiful  reconciliation bill, one that extends the provisions of the Tax Cuts  and Jobs Act, reins in regulations of wasteful spending, unleashes  American energy, secures the border, curbs inflation, and restores  American…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689890/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…permitting--home       builders pull some of the highest numbers of Nationwide       Permits (NWPs) issued annually. To assist with planning and       permit backlogs, this legislation extends the duration of a       NWP from 5 to 10 years and right sizes the acreage threshold       for impacts to where the NWP was originally intended.\n\nTo better assist states in…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…in sharia means one is permitted to embrace Islam but one is  never free to leave Islam. Abandoning sharia is an apostasy punishable  by death.\n\nFreedom of speech in America extends to expression not only of verbal  communication but also in art, writing, the media, and action. Certain  forms of expression are forbidden by sharia. Non-Muslims and moderate…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697017/sharia-is-dangerous"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…35 years, currently serving as Precinct Chair and  Volunteer Coordinator, inspiring and organizing others to participate  in the democratic process. Her community outreach extends beyond the  Party through her work in voter registration and voter engagement at  local events and festivals.\n\nSince 1992, Lisa has proudly served as an Election Clerk and…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696870/recognizing-congressional-patriot-award-recipient-lisa-singleton"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…existence. Ms. Day- Scanlon has performed her teaching duties exceptionally, while also  being an active and supportive member of her community.\n\nMs. Day-Scanlon's outreach extends far beyond the walls of her  classroom through her active involvement in her school and community.  Kimberly is currently a full-time teacher in Okaloosa County. She has…", "date": "2026-01-16", "source_url": "https://justfacts.votesmart.org/public-statement/1699161/recognizing-ms-kimberly-day-scanlon-okaloosa-county-schools-2027-teacher-of-the-year"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…families alike. She  made it her mission to ensure every student felt supported, confident,  and prepared with the skills needed to succeed beyond graduation. Ms.  Elias' impact extends far beyond the classroom. She has been a mentor  to colleagues, a trusted partner to parents, and a pillar of the  greater Kern County community. As the Master of Ceremonies…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698972/recognizing-ms-martha-elias"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "Mr. McCLINTOCK. Madam Speaker, as has been noted, H.R. 183 simply  extends the lifetime national parks pass to the frontline public safety  officers who risk their lives every day to protect our families and  communities. It is the same courtesy…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693930/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…am grateful to say to my colleagues that Congress  overwhelmingly passed and President Donald Trump enthusiastically  signed the National Defense Authorization Act. That law extends  Ukraine's Security Assistance Initiative and our commitment to sharing  intelligence with Ukraine. Good for the President, and good for our  friends in the House and Senate.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699095/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…why the tax relief is a top priority for Republicans in  Washington and is the centerpiece of the one big, beautiful bill. This  bill includes a commonsense tax package that extends existing tax  policy, avoiding the highest tax increase in U.S. history. That is  right. This bill just extends existing tax policy, improves it, and  avoids the highest tax…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…emergency  services events, such as cancer treatment fundraisers, and was a  central figure in special occasions throughout Lititz Borough.\n\nHis dedication to serving the community extends beyond the Lititz  Borough Police Department, as he served with the Boy Scouts for more  than 30 years.\n\nOnce again, I want to thank Chief Nye for his selfless efforts  serving…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689982/congratulating-chief-kerry-nye-on-his-retirement"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…counters the threat from China and ensures mission  success in the Indo-Pacific. The bill includes a number of provisions  to rid adversaries from our defense supply chain. It extends the  Pacific Deterrence Initiative to enhance U.S. posture in the region and  improves our ability to conduct military operations in the Pacific. It  also bolsters Taiwan's…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697810/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…between the school administration and the parent community. His  input is instrumental in shaping policies and initiatives that benefit  the entire school. Mr. Ross's dedication extends beyond regular school  activities. He has presented at the Great American Teach-In, sharing  his knowledge and experiences with students. This event is a highlight  for many…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691992/recognizing-robert-ross"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "…the Fire Academy at  Tarrant County College. As an instructor for both new recruits and  continuing certification courses for commissioned firefighters, his  positive impact extends to other fire departments across the State of  Texas.\n\nNow, as he retires from Station 35 in the critical Fort Worth  Alliance Airport Corridor, Mr. DeWitt holds the distinction…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689725/9999"}]