[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…requires  international cooperation, then there would be no need for the Office  of the Special Representative. But Members of Congress and their staff  who have met with the extraordinarily knowledgeable and dedicated  occupants of that position over the years would strongly disagree.\n\nIf you believe that the alarming proliferation of conventional  weapons,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699129/us-withdrawal-from-united-nations-organizations-and-programs"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…are showing what  can still get done when both sides work together.\n\nI want to start by acknowledging and thanking very much Chair Collins  and her staff, who have worked extraordinarily hard with my staff  throughout this process, and we are continuing to work.\n\nI also want to thank House Chairman   Tom Cole and Ranking Member  Rosa DeLauro and all their…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698874/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…land--is one of the leading countries on the planet  Earth, in the Western World--in the leading democracies, I should say-- that has maternal mortality rates that are extraordinarily high.\n\nForty-plus percent of our babies are born on Medicaid.\n\nHere is an article from NBC: ``Republicans can't meet their own  budget target without cutting Medicare…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…dealing with now through Trump's and Musk's  unapologetic conflicts of interest and self-profiteering poses far  greater risks.\n\nThe Consumer Financial Protection Bureau is extraordinarily  important. We worked hard for consumers to have somewhere to go when  they have complaints about being ripped off. Why is it that we would  have any Member of Congress…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "Mr. COURTNEY. Madam Speaker, after an extraordinarily lengthy recess  that Speaker Johnson ordered at the third week of July, Congress is  finally back in session with a huge to-do list.\n\nIf there was any benefit in terms…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…aspirational part of the Declaration of Independence, of course,  is often famously quoted. Then if we read other parts of the  Declaration of Independence, which is an extraordinarily written  document, it reads like an indictment against the extremism of the  King.\n\nIt reads like an indictment against the King. I think it was King  George. It reads…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…controllers nationwide in  America. We need 14,000. What does that mean if you are understaffed by  that 40 percent figure?\n\nIt means that those who are presently working work extraordinarily  long hours. In fact, the normal routine at O'Hare with the air traffic  controllers who manage that airport is to work 6 days out of 7, 10  hours each day. So in one…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697201/air-traffic-controllers"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…situation for our country, as the rest of the world looks at  us as the gang that can't get its act together and pass simple funding  bills for the government.\n\nIt is an extraordinarily frustrating moment to be here now. There are  very few people for whom this is not a miserable prospect, but there  are a few of them, and one of them is OMB Director…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695927/government-funding"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Public  Broadcasting. So I am confident in saying what happened.\n\nI don't think anything like that will ever happen with the Oregon  National Guard. I think they will be extraordinarily careful to execute  their mission in a professional fashion and to provide a little bit of  encouragement to protesters: Get out of the way of the car--or do  things like…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…just heard  but are truly prioritized within our government.\n\nRunning a small business is really an act of faith. It is hard work,  often brutally hard work, and it is extraordinarily important work  because rural small businesses are the beating hearts of communities  across America, and in every corner of my home State of New Hampshire.  They are…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697281/office-of-rural-affairs-enhancement-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…until November, which was long after many of these strikes  took place.\n\nThe legal foundation for this campaign and the operations that  President Trump engaged in became extraordinarily tenuous during the  September 2 strike. According to numerous public reports, after the  initial attack, two survivors were left floating on the wreckage of  their boat,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Kaploun, President Trump's nominee to the Special Envoy for  Combating Antisemitism--he will lead this fight internationally, within  the State Department.\n\nThese are both extraordinarily capable and energetic people--and  determined. I have no doubt they will do excellent work--they  understand, they can name, and will fight the poisonous ideology that…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692173/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…moments exactly like  this: when the legislative branch speaks with unity and clarity, and  the executive branch says no anyway.\n\nIn modern congressional history, it is extraordinarily rare, and  perhaps unprecedented, for a President to veto a bill that passed both  Chambers unanimously while his party holds unified control of the  government. That…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698701/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…``could almost see the tough,  young First Sergeant Lomell directing his men as they landed under the  withering fire of German forces.''\n\nFor his amazing leadership and extraordinarily brave acts, Bud Lomell  received the Distinguished Service Cross. As we all know, that is the  second highest military decoration. The citation said in part: ``First…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…extended heartfelt congratulations to  Coach Renee Favaro and the entire Botetourt community. They have made  their school and Virginia's Sixth Congressional District  extraordinarily proud.\n\nGo Lady Cavs.       Celebrating First Baptist Church of Roanoke's 150th Anniversary\n\nMr. CLINE. Mr. Speaker, I rise today to honor the 150th anniversary  of First…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691575/recognizing-the-75th-anniversary-of-james-wood-high-school"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Chairwoman  Virginia Foxx of North Carolina for yielding.\n\nMr. Speaker, indeed, Republicans were elected last November, but with  promises made, promises kept.\n\nDespite the extraordinarily ignorant lies on the other side, the  American people know that the bill that we will be voting on today  reduces taxes, creating jobs.\n\nIt is the elimination of taxes…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…congratulate these outstanding student athletes on winning the  State championship, a fitting way to end their perfect season. The  students on Cascade's football team should be extraordinarily proud of  their tireless efforts and dedication. I know this win means so much to  everyone in the Clayton community who was cheering them on to victory.\n\nCongratulations,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697559/congratulating-cascade-high-school-cadets-football-team"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…would not  be at this place today without the members not only on my team but on  Senator Merkley's team, and the broader Interior Appropriations staff.  They have worked extraordinarily hard and extraordinarily well  together.\n\nI want to thank the members of my team, led by Daniel Mencher, Sarah  Jorgenson, and Anna Smith; and their counterparts on the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…no.\n\nGreenland is an amazing place. It is a beautiful place. Again, I have  had an opportunity to visit it multiple times. It reminds me of Alaska,  my home State. It is extraordinarily beautiful in so many ways. It is  also, like Alaska, very geostrategic. It is a resource-rich area just  like my State of Alaska. We have cultural connections thanks to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…relied on, our chairmen and our ranking members, are  people that we know and trust and that, frankly, know one another and  trust one another and work well together. I am extraordinarily proud of  this committee for what it did.\n\nI also particularly thank my friend, the ranking member across the  aisle. Now, we don't always agree. As a matter of fact,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}]