[{"senator": "Julie Johnson", "party": "Democrat", "sentence": "Ms. JOHNSON of Texas. Mr. Speaker, I rise today to recognize and  congratulate Tracy Eubanks on his extraordinary leadership and decades  of experience to Metrocrest Services.\n\nFor more than 40 years, Metrocrest has been a lifeline for families  across Addison, Coppell, Carrollton, Farmers…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697071/congratulating-tracy-eubanks"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…to know him. I was just  out of school. He was in law school. Sadly, we saw the assassination of  the President, and that was a horrible thing.\n\nAs he concludes his extraordinary leadership and service in the  Congress, we celebrate his legacy of decency and devotion to our  country. He has been just so remarkable. Our gratitude to him and his  family…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698705/recognizing-the-honorable-steny-hoyer"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…SCHUMER. Mr. President, in a few minutes, my good colleague from  New Mexico Senator Lujan will be offering a unanimous consent request,  and I want to thank him for his extraordinary leadership on the issue  of SNAP, leading the way on an urgent issue for millions of Americans.\n\nNow, right now, we are facing down two crises at once: a healthcare  crisis and…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696462/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "Ms. PELOSI. Mr. Speaker, I thank the gentlewoman for yielding and for  her extraordinary leadership in making the case.\n\nMr. Speaker, yes, we are talking about something being expensive.  Don't say clean air for our children to breathe is too expensive for us  after…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690390/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…Ecumenical Patriarch Bartholomew was elected in October 1991 as  the 270th archbishop of the 2000-year-old church founded by the Apostle  Andrew. He has demonstrated extraordinary leadership within the  Orthodox Christian community and across the global religious and  environmental landscapes.\n\nEcumenical Patriarch Bartholomew was ordained as a deacon…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694986/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Mr. RASKIN. Mr. Speaker, I thank the distinguished gentlewoman from  Georgia for her extraordinary leadership for gun safety and public  safety in America.\n\nMr. Speaker, this bill would rip a dangerous new loophole in the Gun  Control Act by changing the definition of firearm…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700036/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…today to ask my colleagues to join  me in congratulating Paige Kitts. Paige is a member of Girl Scouts of  Michigan Shore to Shore, Troop 4504. She has exemplified extraordinary  leadership, innovative problem-solving, and a demonstrated commitment  to making a lasting, positive impact by earning the most prestigious  award in Girl Scouting, the Gold…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694162/recognizing-paige-kitts"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…leaders, in recognition of his  contributions to global peace and understanding.\n\nAs His All-Holiness is in our Nation's Capital once again, his visit  highlights his extraordinary leadership. Ecumenical Patriarch  Bartholomew continues to devote his life to advancing peace, fostering  understanding across faiths, and promoting human dignity. His  leadership…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695503/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today to ask my colleagues to join me  in congratulating several remarkable Girl Scouts from Girl Scouts of  Eastern Missouri for demonstrating extraordinary leadership, refreshing  creativity, and a commitment to making a lasting impact by earning the  most prestigious award in Girl Scouting, the Gold Award.\n\nGold Award Girl Scouts…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694102/recognizing-gold-award-girl-scouts-from-eastern-missouri"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…today to ask my colleagues to join  me in congratulating Adelyn Kim. Adelyn is a member of Girl Scouts of  Michigan Shore to Shore, Troop 4255. She has exemplified extraordinary  leadership, innovative problem-solving, and a demonstrated commitment  to making a lasting, positive impact by earning the most prestigious  award in Girl Scouting, the Gold…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693242/recognizing-adelyn-kim"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Mr. RASKIN. Mr. Speaker, I thank Ranking Member McBath for her  extraordinary leadership.\n\nMr. Speaker, I rise to support the Improving Law Enforcement Officer  Safety and Wellness Through Data Act, which seeks to improve law  enforcement officer safety…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…recognize Rev. Jason Coker and Rev.  Jenell Coker as my December 2025 Co-Constituents of the Month.\n\nRev. Jason and Rev. Jenell Coker are being recognized for their  extraordinary leadership, vision, and longstanding commitment to  community transformation. Together, they have grown The Oceanside  Sanctuary into a thriving, historic congregation that serves…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699856/recognizing-reverend-jason-coker-and-reverend-jenell-coker-as-my-december-2025-co-constituents-of-the-month"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…my colleagues to join  me in congratulating Hannah Davis. Hannah is a member of Girl Scouts of  Michigan Shore to Shore, Girl Scout Juliette. She has exemplified  extraordinary leadership, innovative problem-solving, and a  demonstrated commitment to making a lasting, positive impact by earning  the most prestigious award in Girl Scouting, the Gold…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693151/recognizing-hannah-davis"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "Mr. WALKINSHAW. Mr. Speaker, I rise today to commend Mr. Paul Gilbert  on his upcoming retirement after two decades of extraordinary  leadership as Executive Director of NOVA Parks. Mr. Gilbert has  transformed our park system into a vibrant, inclusive network of  outdoor spaces that serve more than 2 million…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697129/recognizing-nova-parks-executive-director-paul-gilbert-on-the-occasion-of-his-retirement"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…critical  investments in education, healthcare, and infrastructure that benefited  New Yorkers and Americans across our country.\n\nMr. Speaker, I thank Nita Lowey for her extraordinary leadership and  her unwavering belief in a better future for all Americans. May her  memory be a blessing, especially for her husband, Stephen; her  children; and her beloved…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689209/in-memory-of-the-honorable-nita-m-lowey"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…rise today to ask my colleagues  to join me in congratulating Faith McCrea. Faith is a member of Girl  Scouts of the Sierra Nevada, Troop 1306, and has exemplified  extraordinary leadership, innovative problem-solving, and a  demonstrated commitment to making a lasting, positive impact, by  earning the most prestigious award in Girl Scouting, the Gold…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691494/recognizing-faith-mccrea-gold-award"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…Speaker, I thank the chairman for yielding me time.\n\nMr. Speaker, I rise today in strong support of the passage of the  GENIUS Act, and I thank Chairman Hill for his extraordinary leadership,  not just in this Congress, but for a long time advocating for this  moment. He deserves a tremendous amount of credit for persevering and  working and marshaling…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693841/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…today to ask my colleagues to join me  in congratulating Dakota Partelow. Dakota is a member of Girl Scouts of  Gulf Coast Florida, Troop 608, and has exemplified extraordinary  leadership, innovative problem-solving, and a demonstrated commitment  to making a lasting, positive impact, by earning the most prestigious  award in Girl Scouting, the Gold…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690441/recognizing-dakota-partelow-gold-award"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…rise today to ask my colleagues to join me  in congratulating  Reagan Graham. Reagan is a member of Girl Scouts of Gulf Coast Florida,  Troop 441 and has exemplified extraordinary leadership, innovative  problem-solving, and a demonstrated commitment to making a lasting,  positive impact, by earning the most prestigious award in Girl  Scouting, the Gold…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690446/recognizing-reagan-graham-gold-award"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…ask my colleagues to join me  in congratulating Krysta Fowler. Krysta is an individually registered  member of Girl Scouts of Gulf Coast Florida and has exemplified  extraordinary leadership, innovative problem-solving, and a  demonstrated commitment to making a lasting, positive impact, by  earning the most prestigious award in Girl Scouting, the Gold…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690422/recognizing-krysta-fowler-gold-award"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "Mr. GIMENEZ. Mr. Speaker, I rise today to recognize and honor the  former President of the Republic of Colombia, Alvaro Uribe Velez, for  his extraordinary leadership, steadfast defense of democracy, and  unwavering commitment to the safety and prosperity of the Colombian  people.\n\nPresident Uribe assumed office in 2002 during one…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696701/recognizing-president-alvaro-uribe-velez"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Patronis, who all contributed  provisions to this bill.\n\nI especially thank the chairman of the subcommittee,  Mike Collins,  for working with me on this. He has shown extraordinary leadership in  developing this very important issue. I do thank the gentlewoman from  Michigan for her friendship in this process, and I would urge support  for the bill.\n\nMr.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698041/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…today to ask my colleagues to join me  in congratulating Victoria Morton. Victoria is a member of Girl Scouts  of Gulf Coast Florida, Troop 135, and has exemplified extraordinary  leadership, innovative problem-solving, and a demonstrated commitment  to making a lasting, positive impact, by earning the most prestigious  award in Girl Scouting, the Gold…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690466/recognizing-victoria-morton-gold-award"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…colleagues to join me  in congratulating Hannah Dickinson. Hannah is a member of Sandy Beaches  Service Unit within Girl Scouts of Southeast Florida, and has  exemplified extraordinary leadership, innovative problem-solving, and a  demonstrated commitment to making a lasting, positive impact, by  earning the most prestigious award in Girl Scouting, the Gold…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690867/recognizing-hannah-dickinson-gold-award"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…rise today to ask my colleagues to join me  in congratulating Harley Cross. Harley is a member of Girl Scouts of  Gulf Coast Florida, Troop 5005, and has exemplified extraordinary  leadership, innovative problem-solving, and a demonstrated commitment  to making a lasting, positive impact, by earning the most prestigious  award in Girl Scouting, the Gold…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690443/recognizing-harley-cross-gold-award"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…STEUBE. Mr. Speaker, I rise today to ask my colleagues to join me  in congratulating Wyatt Dickinson. Wyatt is a member of Boy Scout Troop  776 and has exemplified extraordinary leadership, innovative problem- solving, and a demonstrated commitment to making a lasting, positive  impact, by earning the most prestigious rank in Scouting--the Eagle  Scout.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693623/recognizing-wyatt-dickinson-eagle-scout"}]