[{"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…not going to make energy more  affordable, and it seems to me, as I stand up here to speak about yet  another attack on our public lands, that no place is sacred from this  extract-at-all-costs playbook--not even wildlife refuges.\n\nSo what is next? Are we going to develop geothermal energy in  Yellowstone? Maybe more uranium mining in the Grand Canyon.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697413/9999"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…produce them on-demand near the front lines; to engineer biological  sensors that can detect pathogens and chemical threats on the  battlefield in real time; and to better extract critical minerals from  domestic mining deposits, reducing our dependence on China for rare  earth mining.\n\nThat, again, Mr. Chair, is why the National Security Commission…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…has settled in  terms of what the impact of this bill is.\n\nIn terms of healthcare, the bill is going to cut our Medicaid  program, America's largest healthcare program, and extract roughly $700  billion from the system over the next 10 years.\n\nThe Affordable Care Act, subsidizes premiums, which provides health  insurance for millions of Americans. Again,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691848/one-big-ugly-bill"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…local  communities most impacted by mining deserve more say, not less, in the  future of their lands and waters.\n\nThis bill is about making it easier for foreign entities to extract  and take away America's resources and leave the pollution to forever  scar the land. We must fight back. We must listen, and we must be the  advocates and fighters that we…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699693/critical-mineral-dominance-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…the Boundary Waters, our State's crown jewel.\n\nAntofagasta, owned by a Chilean billionaire who is a crony of  President Trump's, is the foreign mining company that wants to extract  minerals from this watery wilderness. They have contracts set up to  send copper they extract to China for processing, and from there, it  will be sold on the open market.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699272/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…weakens our public school system and makes higher education more  expensive.\n\nIt gives sweetheart tax deals to dirty fossil fuel companies and  makes it cheaper for them to extract gas and coal from our public  lands.\n\nIt attacks our federal investments in clean energy, which will cost  over 790,000 jobs over the next decade and raise household energy…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693153/one-big-beautiful-bill-act"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…organizations. He has pursued  meritless litigation, leveraged his public office for private gain, and  perverted the course of justice and the integrity of the judicial  system to extract tens of millions of dollars in putative settlements,  effectively acting as a conduit for flagrant bribery and extortion.\n\nHe has restricted the access of the Associated Press…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…order to control, to  dominate, and to seize Venezuelan oil and pursue regime change for  their imperialistic agenda in the Western Hemisphere. They do this all  so they can extract resources, they can expand their wealth, and they  can make sure that one day, should they lose their hold on power, which  they will, they can be pardoned for their corruption.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698443/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Antofagasta, as has been  pointed out, is a Chilean mining company who owns Twin Metals. It is  lobbying to undo the current mineral withdrawal and restore their  leases to extract the copper. Here is what Antofagasta does with the  extracted copper, and we can't say this enough: They send it to China  where it is smelted and then it is sold on the open…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…majority is prioritizing the interests of an  international Chilean mining conglomerate that has no interest or stake  in the economy or well-being of Minnesotans.\n\nThey will extract our resources. They will pollute our air, land, and  water. They will permanently damage our pristine Boundary Waters and  leave Minnesotans to foot the bill for the cleanup.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691611/boundary-waters-canoe-area-wilderness"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Mast,                            Chairman, Committee on Foreign Affairs.\n\nMr. Speaker, this bill signals that the United States will not  tolerate the use of state violence to extract profit from the bodies of  the persecuted.\n\nI thank my friend, the gentleman from Pennsylvania (Mr. Perry), along  with his bipartisan cosponsors for their leadership on this…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…bipartisan delegation from this body just 2  weeks ago visiting our trusted, loyal NATO ally Denmark, as they were  alarmed about the rising tide of threats from our President to extract  the territory of Greenland from their nation.\n\nThis coming weekend and week, I will travel to the annual Munich  Security Conference, which my friend and late colleague Senator…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…writes to express our       strong support for H.R. 4090, the Critical Mineral Dominance       Act.\n\nEMA is the representative voice of approximately 100       companies that extract,       process, and support a vital and beneficial group of metal/      nonmetal minerals that are the essential ingredients for a       strong national defense and economy…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…blackmail, and coerce them into committing acts of violence against  themselves, others, or even animals.\n\nThese online groups use mainstream platforms to gain access to  children, extract personal information or images, and then weaponize  that material.\n\nThe result is severe psychological coercion and abuse--children  forced into self-mutilation, cruelty to…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698877/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…nuclear. It works on  fusion. It works on coal. It works on making sure that we have the  ability to mine the coal in the United States. It makes sure we have  the ability to extract our oil and our natural gas resources.\n\nIf we want to compete with the Chinese, Mr. Speaker, we are going to  have to up our game on producing electric power. It is fascinating…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…extremist base and hold the whole country  hostage.''\n\nThat is exactly what the Democrats have done over the last 43 days.  They have held the American people hostage, trying to extract insane  things, like free healthcare for illegal immigrants.\n\nIf they were serious about tackling the healthcare affordability  crisis in this country, then they would address…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696694/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…just last year as the negative effect from dumping has not only  affected the commodity price, but it has made it so that the commodity  price is below the actual cost to extract it. The ripple effects are  still being felt throughout my district.\n\nThis is why Montana's congressional delegation is stepping up. I  stand shoulder to shoulder with Congressman…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689193/work-highlights-of-western-caucus"}]