[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…Congresspeople did, but he  also did some really extraordinary things to fight for healthcare.\n\nMy friend Chris Murphy knows about that. He was there when John Lewis  did an open Facebook chat--not in this Chamber or the House Chamber; he  sat on the steps, and people were there. I remember when he did a sit- in. They had to shut the cameras off him. He got…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…Here in Washington, D.C., as the National Guard is patrolling, and  ICE agents are dramatically ramping up raids across the city, citizens  are starting Instagram pages and Facebook groups to inform fellow  citizens of their rights. Parents are patrolling schoolyards to protect  the rights of students and other parents. Around the country  journalists…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…changes, that is what the Republican Congress will do.\n\nOne of Chairman Hill's changes to the GENIUS Act addresses a key  concern I have had from the beginning, which is that Facebook and any  other Big Tech company should not be allowed to issue their own  stablecoin.  That would violate a longstanding separation of banking and commerce in  financial regulation,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…get  permission to get in.\n\nI said: Well, let's go knock on the door.\n\nAnd so we go up. And he is doing a live feed--what is that called--on  one of those social media--live Facebook feeds. I go up and I knock,  and I say, yes, who I am, and we were in the area, and we heard there  were a lot of operations here. Can you give us a tour? Can you have the…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Health website, and sure enough, in  January they did announce a theme for 2025: Advancing Commitments to  Eliminate Health Disparities.\n\nThen in the January post on their Facebook page they invited the  public to join them all year as they shared resources to help address  health disparities impacting racial and ethnic minority groups. I  thought, great,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…advertising, however, the full extent of       digital election spending remains difficult to quantify.\n\nThe major platforms that reported political ad sales for       2024 are Facebook, Instagram, Google, YouTube, X, and       Snapchat. Spending totals for Facebook, Instagram, Google,       and YouTube were collected by OpenSecrets, and spending       totals…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…CFPB's oversight and supervision.\n\nWhen I was chair of the Committee on Financial Services, Democrats  held Big Tech companies to account, including convening a hearing with  Facebook CEO Mark Zuckerberg over his plans to develop cryptocurrency  called Libra.\n\nMoreover, when Democrats led passage of the Dodd-Frank Act, we  empowered the CFPB to supervise…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "…minute. A hundred percent? One hundred percent?\n\nShe said: Every child who gets on a Meta platform--whether it is  virtual reality, whether it is Instagram, whether it is Facebook  itself--every child who is on that platform for any length of time will  be exposed to child sex abuse material, every single child.\n\nThe tech companies themselves tell us,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697735/9999"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…what--he didn't want to spend the money to fix the  problem. Now, 6 years later, Meta's platforms are still dangerous for  minors. And the people leading the company know it.\n\nOn Facebook, Instagram, WhatsApp, AI chatbots have engaged in  romantic fantasies with underage users, even carrying on explicit  discussions of sexual acts with children. They know this…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…I talk to my colleagues in Texas on a daily basis. They are just as  engaged as we are, but I talk to the American people and I say to you:  We need your help. We have to Facebook this thing. It has to spread  like a wave. Do not be shy about this issue, Mr. Speaker. Our babies  depend on us to watch over them.\n\nI have two beautiful sons, and I give…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699002/human-trafficking-awareness-month"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…institutions in our country try to block the will of the people and  what they wanted to see done. This includes some of our Nation's social  media companies. According to reports, Facebook is allowing a black  market to thrive on its platform where illegal aliens can buy ride  share and delivery driver accounts from credentialed users. In effect,  what this…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…they need to hire, grow, and contribute to a dynamic,  competitive economy, and we know that this model works.\n\nAngel investors helped launch companies like Amazon, Google,  Facebook, Costco, and Starbucks, names we all recognize today that  started as small ideas in need of capital and support.\n\nBy reducing legal uncertainty, especially around demo day…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692723/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…an exceptional professional staff and the business community.\n\nDecades of engagement and community outreach have produced clear  results, attracting firms like Google and Facebook to expand to  Papillion.\n\nHe will be deeply missed by the people of Papillion, and I am hopeful  he will continue public service down the road. Mayor Black has more  than…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698932/recognizing-mayor-david-black"}]