[{"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…supplies, forces us to be more reliant on foreign energy  sources, and erodes our economic competitiveness and energy dominance.\n\nIt does not have to be this way. The last time we faced an energy  crisis in the United States, it was the 1970s. Energy prices were  skyrocketing because of the 1973 oil crisis, when barrels of oil--then,  our most in-demand energy…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…the eyes of a mother or father who lost a son or daughter to gun  violence, that is the look that we are choosing to visit upon millions  of families in this country who, when faced with the loss of their only  health insurance option for their disabled child, will watch their  child potentially face the same fate as those young men in your  neighborhood…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…only one to participate;       various organizations, churches, institutions and members of       the community came together to address the serious       humanitarian crisis faced by our Haitian brothers       and sisters, a crisis that persists and is characterized by       the displacement of their country of origin. This situation       is the result…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…Cleveland. Despite her efforts, President William  McKinley signed into law a joint resolution of Congress annexing Hawaii  as part of the United States. Through the adversity she faced, Queen  Liliuokalani continued to petition Congress and advocate for the  restoration of the Hawaiian monarchy. Her commitment to the people of  Hawaii and her dignified resistance…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695588/hawaiian-history-month"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…who did not have  the opportunity to be viewed as full human beings in our great country,  for those who marched in the dust, for those who bled on the bridges,  for those who faced the dogs and the batons right here in the United  States of America, for those who met the fire hoses just to try to  claim their right to vote.\n\nMr. Speaker, both of my grandfathers…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…nearly 4 million  victims of crime every year. That is a staggering number, so I want to  say it again: 4 million victims of crime every year.\n\nOver the last decade, the fund has faced a severe and sustained  crisis. Stemming from changes in prosecution practices, revenues have  plummeted. Meanwhile, the needs of victims have only grown.\n\nIn recent years,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698840/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…rise in support of H.R. 1721, the Critical  Infrastructure Manufacturing Feasibility Act.\n\nOur Nation's manufacturing base was once the envy of the world.  Unfortunately, it faced steady headwinds for decades. The United  States' share of global manufacturing activity declined from 28 percent  in 2002 to less than 16 percent in 2021.\n\nFortunately, the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690288/critical-infrastructure-manufacturing-feasibility-act"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…Advocate, Kathryn handled a wide range  of complex and often deeply personal issues, including IRS cases,  housing matters, student loan concerns, and many other challenges faced  by families across the district. She approached each case with patience  and determination, understanding that for many constituents, reaching  out to a congressional office…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699929/recognizing-the-service-of-kathryn-angell"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…changes to our judicial  system, and trampling on the most basic and fundamental tenets of our  Constitution. How much more hypocritical can they be?\n\nThe Biden administration faced 133 multistate lawsuits from  Republican attorneys general. Texas Attorney General Paxton alone filed  over 100 lawsuits against the Biden administration. Republicans are now…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689013/supporting-federal-judiciary-and-judges"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…its  responsibility of starting the war and defaming the democratically  elected President of our ally, we should have the courage to stand up  and call it what it is: a bald-faced lie.\n\nIt is shameful when we, the shining city upon a hill, as President  Reagan put it, oppose a United Nations resolution condemning Russia and  supporting Ukraine. The rest…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…Unfortunately, this bill  misses that mark. It lets the President get away with starting illegal  wars and committing illegal killings.\n\nFurther, Pete Hegseth still has not faced any consequences for  leaking confidential information to journalists and wasting taxpayer  dollars on makeup mirrors. Tulsi Gabbard has not faced consequences for  manipulating…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…Christmas dolls. Businesses, big and small, are  paralyzed by uncertainty and reducing their spending, and many small  businesses may not survive.\n\nTo add insult to injury, when faced with these facts, the President  says: Deal with it. Those are the President's own words. The tariffs  will be painful, but it is a price that must be paid; but paid by whom?…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…deficiencies of past policies and advancing long-      overdue initiatives.\n\nLet me give you some facts that our critics never seem to       remember. When we took office in 1980, we faced a dusty shelf       of reports which pointed out our predecessors had been so       busy spending money on new lands for parks that they       seriously neglected basic upkeep…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…These attacks on their rights are not abstract. They are real, and  they are personal. Over the past few months, I have heard from many  Federal workers in Oregon who have faced illegal firings, threats, and  mistreatment. They have shared how these actions are creating fear and  instability in their lives and communities. One Federal worker, a  disabled…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697870/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…war.\n\nFor over two decades, tens of thousands of Afghan civilians worked  alongside our military and diplomats. Make no mistake, they were  risking their lives to help us and faced the possibility of retribution  in their own country. I saw firsthand during a visit to Afghanistan  some years ago just how these Afghans were making that courageous  sacrifice.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693450/temporary-protected-status"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…should care about for the Iranian people, though we  should. As Americans, we are a people whose country was founded because  a group of people were unhappy by the tyranny we faced. There is no  question they face it over there, as well.\n\nThe cause of Iran is one that we should care about because it is in  the best interest of the United States to care…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691211/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…D.C.\n\nMr. Speaker, we remember the 150,000 who were wounded in battle and  bear the visible scars of post-traumatic stress and Agent Orange  exposure. We remember those who faced brutal captivity as prisoners of  war, and the 1,200 servicemembers still missing in action from Vietnam.\n\nMr. Speaker, we may never be able to repay our debt to those who…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689202/saluting-vietnam-veterans"}, {"senator": "French Hill", "party": "Republican", "sentence": "…hope ends in tyranny and death  every time.                          Coptic Christians in Egypt\n\nMr. HILL of Arkansas. Mr. Speaker, I rise to shed light on the  discrimination faced by Coptic Christians in Egypt.\n\nCoptic Christians face restrictions on building churches, have  limited representation in government, and, tragically, have been  targets of…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698914/warmth-of-collectivism"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…the ability to place communication, electric transmission, and other  infrastructure these land restrictions create, adding further obstacles  to the extraordinary challenges faced by rural communities in Alaska,  many of which are disconnected from the road system.\n\nFurthermore, the approved Central Yukon RMP did not recommend  revoking PLO 5150--which…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…world.\n\nThis time capsule, when viewed 250 years from now in 2276, may it be  a reflection that, at the midpoint then, which will be today, we  navigated these challenges that we faced with great courage and great  vigor.\n\nMr. Speaker, I appreciate my colleague's work and support on both  pieces of legislation today, and I encourage my colleagues to vote…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688200/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "Mr. KENNEDY of Utah. Mr. Speaker, today I rise to congratulate both  the Corner Canyon and the Lone Peak High School football teams who  recently faced off in the Utah 6A State Championship. Their matchup  showcased exactly what Utah embodies: determination, grit, and  exceptional spirit.\n\nCorner Canyon emerged victorious,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697704/congratulating-corner-canyon-and-lone-peak-high-school-football-teams"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…expectant mothers, children, low-income seniors, and people with  disabilities.\n\nWithout passing the One Big Beautiful Bill Act, the average family in  my district would have faced a 25 percent tax increase next year. Our  bill prevented that tax hike by making permanent the 2017 Trump tax  cuts and built upon it.\n\nLet's talk about individuals. The individual…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694788/promises-made-promises-kept"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…disgusting.\n\nOn October 7, Hamas also took roughly 250 residents hostage, even  including babies, really old people, and even some Americans. The  horror these individuals have faced under the brutal reign of Hamas is  unimaginable. The hostages have been subjected to inhumane conditions,  deprived of their basic human rights, and used as pawns in the cruel…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688469/hamas"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…challenges impacting investors over the age of 65.  The task force will also make recommendations for changes to existing  legislation and regulations to address the unique issues faced by our  senior investors.\n\nMr. Speaker, H.R. 1469 has received strong bipartisan support in the  past, passing by suspension in the last three Congresses. It remains a  commonsense…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693936/national-senior-investor-initiative-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…clear, expanding access to health insurance and protecting  people with preexisting conditions are worthy goals, but good  intentions do not excuse bad results.\n\nMr. Speaker, faced with these affordability problems, what have my  Democratic colleagues proposed? Their answer has been more taxpayer  subsidies to paper over ObamaCare's problems. Rather than…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698804/breaking-the-gridlock-act"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…Immigration and Naturalization Service at Chicago's O'Hare  International Airport.\n\nPeter's long career in federal law enforcement has taken him across  the country, where he faced some of the world's most dangerous, and  hardened criminals. As the Acting Deputy Executive Associate Director,  he was appointed the Deputy Senior Coordinating Official for…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692698/recognizing-st-paul-minnesota-immigration-and-customs-enforcement-field-office-director-peter-berg"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…over $600,000 annually, and the  group spends more than $700,000 on lobbyists all to keep the money  flowing.\n\nContrast that with the conditions our military servicemembers faced  during the same time: moldy barracks, sewage overflows, and rodent  infestations to highlight a few. In 2022, a mere $56 million was spent  on housing maintenance for military…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690710/outrageous-government-funded-incentives"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Tahoe's environment, ensuring the sustainability of its water  resources, and fostering community engagement.\n\nThroughout its history, the South Tahoe Public Utility District has  faced and overcome many unique challenges. During droughts, wildfires,  and even a global pandemic, the district did not falter in its mission.  In moments of crisis, such as the…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…across the aisle voted in favor of this same  exact bill, and I encourage more Members to do so as we honor police  this week and into the future.\n\nLaw enforcement officers are faced with danger every single day, not  only on the job, but when they return to their homes. This commonsense  bill honors them a little bit and shows them that we want them to…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691348/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…everything--their safety, their future, their very lives for  freedom, for the opportunity for all of us to be here today.\n\nToday, there are 61 living Medal of Honor recipients, 61 men who  faced unthinkable odds, who put their country before themselves so that  the rest of us could live in peace. We cannot truly ever repay them.  There is no sum, there is no medal,…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696586/medal-of-honor-act"}]