[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…House Chief of Staff--the  White House Chief of Staff--admit on the record that Donald Trump  ``wants to keep on blowing boats up until Maduro cries uncle.''\n\nFolks, the fact of the matter is, Congress has not declared war, nor  has Congress authorized the use of military force in Latin America. Do  you want to have that debate? Let's have that debate.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…tried to paint a  picture of sanctuary States or sanctuary cities as nothing but lawless,  and I get that it is maybe a favorite sound bite for rightwing media,  but the fact of the matter is it is not true.\n\nSanctuary policies do not mean that there are no laws or that the  Federal Government can no longer enforce Federal law in those  jurisdictions. What…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…than prosecute  them in the United States courts, as we would expect if these  individuals were, in fact, dangerous drug traffickers bound for the  United States.\n\nThe fact of the matter is a number of the individuals that he talked  about, if they were in the United States, they would have been tried in  our courts. That decision raises serious questions…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…are selling drugs.\n\nLook, I totally agree that if someone is selling fentanyl, it is a  totally different situation from someone who is arrested for possessing  it. The fact of the matter is this bill covers both those who possess  it, using it for themselves, and those who are selling it--maybe those  who have a huge ring of selling it.\n\nMy point is that…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…most folks think about  when they are considering Federal legislation; however, for the  citizens and businesses and the economy of the city of Green, Ohio, it  is, in fact, a matter of importance and priority.\n\nDuring the Green State of the City Address earlier this year, Mayor  Rocco Yeargin proclaimed that he would actively engage toward working…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693900/single-unique-zip-codes-for-certain-communities"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…and will do so by overruling the  Parliamentarian and breaking the filibuster.\n\nIn effect, going nuclear. The Republicans can say what they like  about this, but the fact of the matter is that the Parliamentarian  ruled that the Congressional Review Act does not permit what we are  doing.\n\nAnd she did so on the basis of advice from the Government  Accountability…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…keeps her alive. I  have people, small business people in my district, that are calling to  say this is the first time they have ever had to go without insurance.\n\nThe fact of the matter is this is the right policy.\n\nNow, if people want to talk about how to deliver quality, affordable,  appropriate healthcare with less money going to hedge fund-owned…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698665/protecting-healthcare-for-millions-of-americans"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…asked me: What will you do as President Trump continues his  unconstitutional activities? Well, Madam Speaker, I rise today to hold  this President accountable.\n\nThe fact of the matter is, the President has committed crime after  crime. I am not concerned about whether this is the right time or if  there are enough votes from my colleagues across the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690991/the-truth-still-matters"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…a public position on the  bill, and they have given lipservice to veterans and advocates  requesting their support. What their real reasons are, I can't say.\n\nBut the fact of the matter is that these veterans have been denied  this simple justice.\n\nAnd let me speak to those critics.\n\nWe can't balance the Federal budget on the backs of combat-injured…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…government, but there is a factual aspect to this which is,  whatever one's governing philosophy is and whatever one thought about  the Affordable Care Act, the plain fact of the matter is, people are  going to get letters from their insurance carriers with astronomical  increases that they will not be able to pay.\n\nNo. 4, 5 million people are either…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…be reduced from 57,000 all across America to  50,000.\n\nSome may say: What is wrong with that? We should sort of downsize our  workforce, make them more efficient.\n\nThe fact of the matter is, if you look at how many people are  beneficiaries today, with the baby boomer retirements that are swelling  the ranks of Social Security beneficiaries, it is 73…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689134/dont-touch-social-security"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…middle of the  investigation.\n\nI come from a family of firefighters, one of whom just got diagnosed  with Parkinson's after spending months at the World Trade Center.\n\nThe fact of the matter is, on 9/11 my Republican colleagues will fall  all over themselves to thank firefighters and say how they will never  forget. I will tell you something, we are going…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690904/protections-for-firefighters"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…work with us to build a pipeline and export more fossil  fuels to the United States. Right now, we barely have a relationship  with Canada because of the tariffs.\n\nThe fact of the matter is that there is a tariff on Canadian exports.  The bottom line, I guess, is the only way that we could get Canada to  maybe send us more oil or gas is if we did what…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…detaining and  deporting U.S. citizens; no prohibition on video recording for ICE.  This was all passed in the Committee on Appropriations and then  stripped out.\n\nThe fact of the matter is we need to focus like a laser in these 10  days--6 legislative days--on DHS. Let's not have to focus on five  agencies where there is agreement on what we do. There…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…focus and stop certain things from coming  across the border of Canada, as if it is coming across in a cluster  like it is an emergency, is just an out-and-out lie.\n\nThe fact of the matter is that if you look at the Federal  prosecutions--this just came out not too long ago--for narcotics in the  United States of America, it just came out that, under the…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…spending in government, modernize it, make it better,  faster, cheaper for the American people. No, we would rather burn  things down.\n\nAre we all proud of ourselves? The fact of the matter is $86 trillion  in spending over the next 10 years, and at best our budget  reconciliation is 2.3 percent of that spending.\n\nThis is the one I get complaints from everyone,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…think this is somewhat  of a unique opportunity. Those of us from the Joint Economic Committee  actually take math seriously. We don't always see things alike, but the  fact of the matter is the Joint Economic Committee I think started in  1956. It has this remarkable history of some of the world's greatest  economists coming and speaking before walking…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…time I have  remaining.\n\nMr. Speaker, the gentleman from Massachusetts said that we are just  doing this legislation because we are afraid of losing this election.\n\nThe fact of the matter is we are not. We want to ensure that we win  this election by getting the votes of American citizens and not  noncitizens. It is pretty simple.\n\nI would note that the…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…and the ability to compete.\n\nNow, it looks like the reality of sounding like an idiot economist  around here doesn't buy you a lot of friends, Mr. Speaker. Yet, the  fact of the matter is the budget box that was just offered is an  opportunity to--Mr. Speaker, forgive me, my asthma and my lung  infection are going a little nuts right now--it is an opportunity…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…seem to find a single thing to say  about Epstein when President Biden was in office, but now they want to  make this the centerpiece of their entire conversation.\n\nThe fact of the matter is right now they know it is true, and right  now what they don't want to do is have the American people focusing on  the Republicans in Congress who are doing the thing…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693712/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…completely silent in terms of Presidential authority.\n\nTo the Senator from Michigan, I know they want to put language in  there to restrict Presidential authority, but the fact of the matter  is--and I made him well aware of this--that it is a bill that would  never be signed into law.\n\nSo if the Senator is serious about actually paying the workers, he  will…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…next 10 years is  Medicare, other mandatory and discretionary grows about 13 percent, but  a portion of that is actually, I think, defense and other things in  that. The fact of the matter is your government is an insurance company  with an army.\n\nNow, here is the other part that makes doing the math so incredibly  difficult. Every year there are fewer…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…the aisle thinks that one person controls the  truth. That, by and large, he thinks that conservative media is lying  and that liberal media is telling the truth.\n\nThe fact of the matter is, during the Biden administration when all  of this came to be, where we start fact-checking, recruiting went down  miserably. We had a recruiting problem we have never…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695256/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Hortencia, Jessica, and others show how patently false the accusation  is of our Democratic colleagues who somehow claim that this is just to  benefit rich people. The fact of the matter is, the Tax Cuts and Jobs  Act is not about helping the wealthy few at the expense of ordinary  Americans, contrary to the Democratic talking points.\n\nYou know, I have…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…aisle  shouldn't come whining to Congress about what they need in order to  deal with high energy prices that my Democratic colleagues caused.\n\nThat is the truth.\n\nThe fact of the matter is that we need to do a lot better job of  speaking truth here in this Chamber. As a number of my colleagues were  debating a resolution honoring a friend to many of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…because we talk  our book. We talk what gets us elected. We talk what raises us money.  We talk what enrages our base so that they are more politically  involved. The fact of the matter is a substantial amount of that is  just a boldface lie.\n\nFor anyone who is really interested just in sort of the academics of  what goes on here, I talked about this…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…driving that spending up? It is the refinancing of our debt  at higher interest rates, because we had all that debt we sold a few  years ago at very low interest rates. The fact of the matter is  healthcare costs keep going up. The stupid discussion we are going to  have here is a financing debate--how much more subsidies should we hand  out--and not a discussion…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…You really think you are going to do a $600 billion tax  hike.\n\nHere is my battle. I have tried for years and years and said, we need  to do a fiscal commission. The fact of the matter is, we have the same  number of 18 year olds as we had 20 years ago, but we have double the  number of Americans, our brothers and sisters, who are now 65 and up.\n\nTwenty…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…get an argument  out in some sort of fashion where the American people can see it. I  would appreciate being able to engage somebody on the House floor.\n\nMr. Chair, the fact of the matter is, if I can keep my train of  thought, Mr. Chairman, what I would say is that this has been drafted  specifically--drafted specifically--to avoid the constitutional…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699058/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Member on the Democrat side or Republican side  running for office: I care about the debt, but I am more afraid of  telling you the truth of what drives the debt. The fact of the matter  is, the people walking the hallways here, often our own constituents,  are screaming at us for more spending. Don't they have kids? Don't they  even care about their…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}]