[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…the basis of advice from the Government  Accountability Office, which was given that role by the Senate, given  that role in a bipartisan agreement years ago.\n\nSo we are de facto legislating here, amending the operation of the  Clean Air Act to remove a statutory waiver for the State of California,  amending the Congressional Review Act, so it is no…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…known as persons who have supported what I believe to be the last  effort that we have to prevent this President from becoming a full- blown dictator. He is right now a de facto dictator. He has the  potential to becoming full-blown.\n\nWhat do I mean by de facto?\n\nIt is because we are in the nascency of his dictatorship. Someone,  someday, will write…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690862/and-still-i-rise-impeaching-president-trump"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…personal review and approval of every single wind and solar  project on public lands, not to mention things as trivial as rights of  way. What this really turned out to be was a de facto moratorium on new  projects, new electrons on the grid. And so far, 22 gigawatts--the  equivalent of two New York Cities--of solar, storage, and wind have  been stalled because…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698581/permitting-reform"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…the Supreme Court's  order.\n\nI call that, in Article 1 of my Articles of Impeachment, devolving  democracy within the United States into a dictatorship with himself as  a de facto dictator.\n\nMy friends, truth be told, we are now into a de facto dictatorship  with a de facto dictator, not a dictatorship that has been declared by  some official body.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…victory.\n\nWe want peace and not appeasement that would reward a brutal Russian  invasion with land gains that officially recognize Crimea as Russia,  with land gains that give de facto recognition to four other large  areas. In time, then Putin would recognize his ability to come back and  finish the job. We want peace but not without security assurances…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690213/supporting-ukraines-independence"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…like, well, California ``isn't simply setting a stricter  standard for itself; it's setting a new national standard.''\n\nOr California's ``emission standards would become de facto national  ones.''\n\nSo I want to be clear. California has not and cannot force our  emission standards on any other State in the Nation. As much as I may  love that authority,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…powers, effectively granting this  flagrantly unconstitutional creation significant control over the  executive branch.\n\nDonald John Trump has appointed Mr. Elon Musk as the de facto head of  this contrived entity, which was not created or funded by any law,  without a formal title or office. These actions have been in direct  violation of the Constitution's…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…privacy. The Trump administration is pursuing an unprecedented effort  to consolidate Federal data on virtually every American into a single,  centralized master file, a de facto digital ID on every American.\n\nThis would be a digital record containing most anything that any part  of the government knows about you, tracking where you live, where you…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…other States into adopting California's standards; or to let  California do this is the equivalent of setting a national standard; or  that these emissions standards become de facto national ones.\n\nThat is ridiculous. We have made it clear: Let California take care  of Californians. If California had the power, the authority to set  those national standards,…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…do not protect consumers,       workers or the financial system and instead they expose all       to more risk. The GENIUS Act would allow tech companies to       become de facto banks or issuers of a corporate currency,       without requiring them to adhere to equivalent bank       regulatory oversight. Stablecoins are not inherently stable…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…environmental standards,  zero labor standards, and they use child slave labor.\n\nThanks to the Biden administration's refusal to support responsible,  domestic mining, their de facto EV mandate will only increase our  reliance on the Chinese Communist Party for critical minerals.\n\nMadam Speaker, the Biden administration ``exported their  environmental guilt.''…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690472/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…coal, oil, or gas,  federally owned subsurface minerals are intermingled with State and  private mineral owners. In plain speak, the Biden resource management  plan is a de facto taking from the State and private mineral owners.\n\nThroughout the rulemaking process, this point was made very clear,  but BLM ignored it. And it is unacceptable and needs…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696136/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…manufacturers have to look at that and say: Are we going to  manufacture two different types of vehicles for each class, or are we  just going to follow what California has done?\n\nDe facto, this is a regulation on the Nation as a whole. De facto,  this decision by the EPA is a regulation on the entire Nation.\n\nThat is why this Congress is paying attention to…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690474/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "John Thune", "party": "Republican", "sentence": "…repealed the Biden administration's  electric vehicle mandate, and here in Congress, we approved legislation  to repeal waivers that would have allowed California to impose a de  facto electric vehicle mandate on the whole country.\n\nWe also passed a CRA resolution repealing the Biden rubber tire  manufacturing rule--a gross example of unnecessary regulation.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697344/biden-administration"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…assessments of several four- stars.\n\nI respect the work they do and the scope with which they do it, but  their spreadsheets shouldn't be the final word. A 3-year delay is a de  facto cancellation and a win for China, and China is watching. While  they are watching, they are building ships at a torrid pace. They have  three generation-six airplanes and aircraft…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693649/department-of-defense-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…and recreation opportunities.\n\nUnder this new rule, dozens of miles of popular trails and shorelines  are closed off to highway vehicles in what the State of Utah called de  facto wilderness management. Even small road closures can have profound  consequences for public access.\n\nFor example, the National Park Service effectively cut off access to  the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…practices of the       People's Republic of China.\n\n(b) Matters To Be Included.--The report required under       subsection (a) shall include--\n\n(1) a summary of de jure and de facto policies toward organ       transplantation in the PRC, including with respect to       prisoners of conscience (including Falun Gong) and other       prisoners;\n\n(2)(A) the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "Mr. WALBERG. Mr. Speaker, last year, the EPA finalized a rule which  set aggressive emission standards for vehicles, amounting to a de facto  EV mandate.\n\nWhile I am not against EVs or certainly against reducing emissions,  we must not push misguided regulations that limit consumer choice,  burden the American auto…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689285/put-consumers-back-in-the-drivers-seat"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…withdraw more than 5,000 acres, in the  aggregate, without congressional authorization. Designation of ACECs  that remove lands from operation of the public land laws is a de facto  withdrawal and an insult to Congress's express intent in ANILCA,  locking up critical resources that our Nation needs to counter our  dependency on hostile foreign powers.…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Speaker, last week I introduced  legislation to reverse the out-of-touch California EV mandate that the  Biden administration approved with one foot already out the door.\n\nThis de facto ban on internal combustion engines not only stifles  innovation and blocks consumer choice for the American people, but it  also threatens 40 percent of the auto market including…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689611/supporting-reversal-of-california-ev-mandate"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Trump's executive order by  ramping up mineral extraction and production on our own Federal lands.\n\nWe can't continue to play into the hands of Beijing by granting them  de facto control of the global lithium supply chain--it makes  absolutely no sense--whether through domestic mines or ones they have  gained through other means, such as the Belt and…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698230/application-of-mineral-leasing-act-for-acquired-lands-to-hardrock-minerals"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…energy.\n\nFor more than a decade, the State of Alaska has worked on this RMP to  revoke Public Land Order 5150, which would unlock millions of acres of  land from restrictive, de facto wilderness management and return it to  multiple use.\n\nUnfortunately, the previous administration reversed this decision  against the wishes of Alaskans and finalized a new…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…repeal out- of-touch Biden-era Green New Deal policies.\n\nH.J. Res. 88, which I introduced this Congress, will repeal the Biden  administration's approval of California's de facto electric vehicle  mandate. This policy requires California to end the sale of all  internal combustion engines by 2035, and 17 States, including the  Commonwealth of Pennsylvania,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690194/repealing-green-new-deal-policies"}]