[{"senator": "Ro Khanna", "party": "Democrat", "sentence": "…irresponsible one big, beautiful bill that simply gives tax breaks for  the richest Americans and takes away services for working- and middle- class families.\n\nHere are the facts: We currently have about a $36 trillion debt, and  we are spending right now $2 trillion more every year than we take in.  The Republican budget would add $3.8 trillion to…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691530/tax-cuts"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…moment for the  country but also for this body. I understand that it may take a few  moments for our Republican colleagues to watch the full video, to  gather some additional facts, to come to a conclusion. But we need our  Republican colleagues to be on the floor right now with us because this  is not simply an assault on Senator Padilla. This is not…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692557/alex-padilla"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…Trump  brain drain.\n\nDonald Trump and Republicans in this House are launching a full scale  assault on our Nation's ability to think, learn, and to innovate.\n\nLet's look at the facts. Trump's budget cuts funding for the National  Science Foundation, National Institutes of Health, STEM education, and  even basic K-12 public schools. He has tried to crush…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692286/sounding-the-alarm-on-a-crisis-threatening-americas-future"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…policy this year.\n\nIt is very unusual, by the way, to have a President who has been here  twice with an interruption, but that is the case with President Trump.  We now know the facts of the math that he claimed the last time.\n\nHe said last time that the tax cuts would pay for themselves. We know  that they cost the country $4 trillion; that the sons and…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…and that is what the  President has used to justify the tariffs. He  says this is a way to stop the flow of fentanyl into our country, but  he has forgotten a few inconvenient facts.\n\nFirst, it is that, in 2024, CBP, or Customs and Border Protection,  seized about 43 pounds of fentanyl along our northern border--about 1  percent of the fentanyl coming…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…terminating Haitian TPS because       conditions in Haiti no longer supported an ongoing       designation. That decision was not based in any honest       interpretation of the facts; it is indisputable that Haitian       nationals cannot safely repatriate at this time. Rian       represents many Haitian-American U.S. citizens petitioning to       lawfully…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…relationship with Donald Trump this  year--dare I say, abusive. I hope you will consider this a Republican  intervention. For the record, these are not attacks. They are just  facts.\n\nHealthcare: Republicans cut $1 trillion from Medicaid with their big,  ugly bill, threatening their own vulnerable constituents, when three- quarters of Medicaid enrollees…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697771/intervening-in-gops-relationship-with-president-trump"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…abomination.\n\nMr. Speaker, I urge people who watch this debate not to take my word  for it and not to take the gentlewoman's word for it but to actually  google CBO. Look up what the facts are. The facts, quite frankly, are  damning.\n\nMr. Speaker, if we defeat the previous question, I will offer an  amendment to the rule to bring up H.R. 2753, the Hands Off Medicaid…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Robin  Hood in reverse, and the American people will pay the price for the  Republicans' billionaire-first budget.\n\nMr. Speaker, the gentlewoman said that we need to deal with facts. I  agree.\n\nYet, we also need to deal with math. I understand that President  Trump told the gentlewoman and other Republicans ``to close your eyes''  and vote for this budget.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…Stansbury), distinguished member of  the Committee on Oversight and Government Reform.\n\nMr. Speaker, I think it has been a good debate that has brought out a  couple of clear facts. Even though President Trump directed House  Republicans last night to ``close your eyes'' and just pass the  resolution, I believe the speakers on this side have opened the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689914/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…public school  curriculum, instruction, or instructional materials. Those decisions  are already made at the local level by local boards of education.\n\nI am trying to state the facts, to lay them out so that the people at  home understand what is happening right now. This is not an emotional  journey. This is not an effort to save a department that does…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689644/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…Alaska, and California-- voted to reduce the age to 14 in D.C., even though the age is 16 in  their own states. The supporters of this bill claim it will make D.C.  safer, but the facts and history prove otherwise.\n\nFirst, let's talk about the discriminatory nature of this proposal.  The juvenile justice system in Washington. D.C., already has stark  racial…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695783/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…continue to call on RFK, Jr. to resign. His time at HHS has been an  embarrassment and has caused deep harm to our country.\n\nTo lead our Nation's health system, you must rely on facts and data,  not conspiracy and ego.\n\nI will continue to stand with the Democratic Doctors Caucus fighting  against RFK, Jr.'s rejection of science and data.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697767/vaccines-are-a-great-invention"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…wrath. They threw our allies and  our military under the bus.\n\nTrump's weaponization of the horrific shooting of the National  Guardsmen, before we had even gathered the full facts, to scapegoat  Afghan allies and immigration communities, has been repugnant. The  administration swiftly suspended asylum decisions, halted the issuance  of special immigration…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697852/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…to lower costs.\n\nNow, they are even trying to rebrand their so-called big, beautiful  bill with a new name about working families. No matter what label they  slap on it, the facts don't change. Trump and Republicans' big, ugly  law makes the cost of healthcare go up and takes away healthcare from  working families.\n\nRepublicans hand out an average of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695218/millionaires-tax-breaks-in-big-ugly-bill"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…lecture. That is actually not the goal here. It is  actually just to sort of walk through the reality of the math because  so much of this body is about theater and not about facts.\n\nAs my wife a decade ago said: David, you get to go and hang out in a  math-free zone.\n\nLet's have some fun with facts and math.\n\nMr. Speaker, next year, the 2026 fiscal year,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…truly qualifies for Medicaid; that is theft from other  taxpayers.\n\nSo as the CBO confirmed, $18 billion in Federal spending was put on  emergency care, and these are just the facts that play out.\n\nAgain, let's have the honest conversation. If the other side wants to  fund it, then say it; but don't say it is not happening or bury it  under the typical…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…11 Democrats voted for the SUPPORT for Patients and  Communities Reauthorization Act coming out of committee. I think that  we need to make sure that we are sticking to the facts instead of  Democratic talking points.\n\nMr. Speaker, I was just thinking about what we are talking about. The  notion that my colleagues are really considering voting against…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "John James", "party": "Republican", "sentence": "…and across the country.\n\nIt is a Green New Deal mandate that will crush our trucking industry  and drive costs up on everything and increase deaths on our highways.  Those are facts.\n\nThis policy, if left unchecked, would mandate truck manufacturers  only sell expensive, less reliable, zero-emission trucks, no  exceptions, no choice. This is going to increase…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690473/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…basic  functions of government, and our already-fragile air traffic control  system is facing strain from this occurrence.\n\nWe are reminded how fragile our air system is by the facts of what  occurred on January 29, when a flight from Kansas to Washington, DC,  did not land safely at Washington Reagan, and it claimed the lives of  67 people.\n\nOver the time…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696174/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…tend to affect adversely that person's reputation, may       request in writing to appear personally before the Committee       to testify or may file a sworn statement of facts relevant to       the testimony, evidence, or comment, or may submit to the       Chairman proposed questions in writing for the questioning of       other witnesses. The Committee…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…around-the-clock capacity isn't optional; it is  how the Hoosier economy runs.\n\nYes, the expectation was that four Indiana coal-fired power units  would be offline by 2024, but the facts on the ground have changed, and  our responsibility here today is to keep power dependable and  affordable with the megawatts we have--the megawatts we already have.\n\nSo what…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695511/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-emissions-budget-and-allowance-allocations-for-indiana-under-the-revised-cross-state-air-pollution"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…focus on stories  from my district and my home state of Florida.\n\nAs a successful Section 230 defense often results in the court  granting dismissal early in the litigation, the facts are often  accepted as plead. In these instances, the excerpts below reflect the  claims as plead by the victims and their families.  Only Fans Parent Company Faces No Liability…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Congress with respect to--\n\n(A) any foreign person with respect to which the President       has made an affirmative determination under paragraph (1);       and\n\n(B) the specific facts that justify each such affirmative       determination.\n\n(4) Waiver.--The President may waive imposition of       sanctions under this subsection on a case-by-case basis if…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…Nebraska. Mr. Speaker, Americans across the country  agree, the unmitigated flow of fentanyl under the Biden administration  now constitutes an emergency.\n\nLet's discuss some facts. In 2023 alone, this crisis contributed to  the deaths of 70,000 Americans--in just one year, 2023--a number that  only worsened the following year, when the amount of fentanyl…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699963/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Such rules are addressed to specific,       identified persons or entities and address actions those       persons or entities may or may not take, taking into account       facts and circumstances specific to those persons or       entities.\n\nIn determining whether a rule is one of general or       particular applicability, we have noted that a rule…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694269/us-government-accountability-office-legal-opinion"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…easily and  has--there are some dangerous people--murdered a family member and  terrorized a community. They would rather tip them off than to have  them deported. These are the facts.\n\nSo what should we do?\n\nHere is what I think: I think it is actually an opportunity for us to  strengthen our immigration laws. The Democrats want to kneecap ICE. I  have…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…doesn't  know or he should know, and if he did know, I can't imagine why he  would make the comments that he did the other night in a television  interview.\n\nLet me give you some facts about Denmark, for example. Denmark, which  has responsibility for Greenland--although, Greenland is an autonomous  territory under NATO. It is a part of the Kingdom of Denmark.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…not have been further from the truth.\n\nPresident Trump has shown that the only thing we needed all along was  a President who was not afraid to actually enforce the law.\n\nThe facts speak for themselves. During the month of June, U.S.  Customs and Border Protection saw the lowest number of encounters ever  on our borders nationwide. Apprehensions along…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694111/americas-borders-are-safer"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…copper- nickel find in the world was in northeastern Minnesota, where she  banned mining. It was a dangerous, purely political decision that  disregarded the science and the facts.\n\nUnder the Federal Lands Policy and Management Act, or FLPMA, the  Department of the Interior is required to notify Congress of public  land orders impacting in excess of…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}]