[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…deadly force, even though the device is designed to be less  than lethal.\n\nWe have been asking for years, and they cannot provide us a single  case where this problem exists. In fact, courts have readily  distinguished between deadly force and intermediate force in cases  involving law enforcement.\n\nThey don't have a single case. They just say that some…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700036/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…possible. The cowardice it takes to go along with these cuts is  shameful.\n\nThe President said it himself. He demanded Republicans defund NPR and  PBS because they dared to fact check him. Now my colleagues are falling  in line, even though they know their communities depend on these  stations for everything from weather alerts to kids' programming.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693621/pbs-and-npr-tell-the-truth"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…the President of the United States'  political interests.\n\nJust like what happened with the universities, there is a lot of  extra compliance that is happening. I know for a fact that firms that  have already signed these agreements with Trump have gone above and  beyond the terms of the agreements to quiet their criticism of the  government. No doubt,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…there that  are tuned in to this, understand what this is about. This is about DOGE  having access to the more than 70 million Social Security recipients  and everybody who, in fact, is on Social Security, which will include  basically the whole Nation.\n\nWhy they need this data they don't make clear, but then again, they  have never been vetted. They have…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692502/doge-has-unfettered-access-to-personal-data"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…local issues determined by a federally       appointed person with no local accountability. The proposed       legislation would be especially undemocratic in light of the       fact that, in 2010, an overwhelming majority of District       voters (76 percent) exercised their right to amend the       District Charter to make the DC Attorney General an…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "Ms. KAMLAGER-DOVE. Mr. Speaker, I rise in strong support of Chuy  Garcia and against this resolution. I am, in fact, appalled at the  hubris behind all of this.\n\nIf this is not a question of legality, if this is not a question of  State law, then what is it a question of?\n\nI was in Chicago…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696775/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…new debt.\n\nPresident Trump's `Big Beautiful Bill' doesn't do anything to address  the high cost of living or fix the economic mess created by the  President's trade war. In fact, it adds more burden for Minnesota  families who are looking for help with the rising cost of living.\n\nNearly 1.3 million Minnesotans--about one quarter of our state--are  covered…", "date": "2025-04-14", "source_url": "https://justfacts.votesmart.org/public-statement/1690119/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…will be inspired by this global democratic back slide.\n\nPresident Trump claimed he was going to reduce this kind of  migration, but the political turmoil he is causing will, in fact, make  it worse, pushing people to seek safety outside of their own home  country.\n\nWe can't turn our back on Ukraine and the world, and we cannot expect  that the consequences…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Senate, and will do so by overruling the  Parliamentarian and breaking the filibuster.\n\nIn effect, going nuclear. The Republicans can say what they like  about this, but the fact of the matter is that the Parliamentarian  ruled that the Congressional Review Act does not permit what we are  doing.\n\nAnd she did so on the basis of advice from the Government…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…think about these  things, we need to keep all of those things in mind.\n\nThe last point I will make, a variation on the home rule argument.  D.C. is not a rural jurisdiction. In fact, its roads aren't even as  straightforward as Manhattan. We have got diagonal roads that cut  across, we have circles, and we have very dangerous intersections. I  wish my colleagues…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695639/district-of-columbia-policing-protection-act"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…billionaires in my district in Silicon Valley, for  those we want 10 years.\n\nThen what are they cutting? They are cutting $750 billion in Medicaid  benefits. That is just a fact. Go Google it. You will see the cuts.  They claim that people aren't going to lose their healthcare, but the  independent CBO says that up to 14 million Americans may lose their…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691530/tax-cuts"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…emergency powers  to fast-track dirty fossil fuel projects, primarily to reward the Big  Oil donors whom he reportedly asked to donate a billion dollars to his  campaign.\n\nThe fact is, energy prices are a real emergency for the American  people, and we need more energy on the grid to keep up with the  proliferation of AI and data centers. But the truth…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…U.S. Congress has  sunk to the kinds of lows we are seeing right now? We are adding to the  perception that Congress somehow is legitimizing or overlooking his  behavior--in fact, looking the other way. That is not the message we  ought to be sending at this moment in our history, and it is not  legally right under the Constitution.\n\nWe ought to be voting…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…combat gear.\n\nIf it is such a hellscape, pull back the cameras and release the  drone footage so we can see what is happening across the entire city.\n\nThis resolution ignores the fact that the violence didn't start in a  vacuum. It was sparked by the Trump administration's provocative,  aggressive immigration raids across the State.\n\nICE agents were in neighborhoods,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693147/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Really? No, they are not. How does this proposal make any  sense for them or for families? for the parents? for the community? It  makes no sense.\n\nThis resolution would undo, in fact, all of the hard work in closing  the digital divide in States like Connecticut, where people have  devoted lives and careers to helping students close that homework gap  and…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690726/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "…jails.\n\nWork with us to be able to allow us to do that. That would be great-- I am sure the ICE members are saying to themselves. So that cooperation  would be wonderful. In fact, that is the key. I see it in my home  State, that our local law enforcement, our county sheriffs, they don't  do ICE's job for them, but they do cooperate to be able to get…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699924/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…and  minimize operating costs.\n\nToday's smart agriculture technology, from autonomous tractors to  distributed soil sensors, rely on internet connections to share data.\n\nIn fact, farmers use information in real time to make smarter  decisions on how to optimize inputs and whether and when to plant or  harvest. When terrestrial or cellular networks are…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693469/precision-agriculture-satellite-connectivity-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…on tape delay.\n\nMr. Speaker, I am so proud for this body to pass this. As my  colleague, Mr. Sherman, said, it is also coming from the Senate. It  came from the Senate.\n\nThe fact of the matter is, as Chairman Williams says, it was more  than a hockey game. It was the height of the Cold War. The United  States needed that lift, and those American heroes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695441/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…retroactively take away  permits.\n\nIn a country of due process, it is absurd that a government can  dictate whether a project is good or bad even before an application is  filed. The fact that the government can waltz in and shut down years of  hard work is staggering.\n\nThis section of H.R. 3898 is not a dramatic departure from the status  quo. It clarifies timelines…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698030/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "Mrs. FISCHER. Madam President, last week, my bill, the Foreign  Adversary Communications Transparency Act, or the FACT Act, cleared the  Commerce Committee unanimously. Now it will come before us here on the  Senate floor for a vote.\n\nI stand before you today because the threat our foreign adversaries…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690666/fact-act"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…specifically authorized under       criteria established by an Executive order to be kept secret       in the interest of national defense or foreign policy and are       in fact properly classified pursuant to such Executive order.\n\n(2) All redactions must be accompanied by a written       justification published in the Federal Register and submitted…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696818/epstein-files-transparency-act"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…from the aftereffects and trauma of being in Tel Aviv  on October 7. It has done wonders for their mental health. I know  personally how important therapy dogs can be.\n\nThe fact that this bill also helps dogs in need by getting them out  of shelters and finding them good homes is something that we can and  should all get behind.\n\nMr. Speaker, I support…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696972/providing-emotional-assistance-with-relief-and-love-act"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…and say thank you. Thank you for talking to me the way  you did and handling me the way you did and making me realize that my  path to a better life began through jail.\n\nThe fact that this horrible man should brutally stab this innocent  woman, that is part of the national narrative right now. The fact that  we are dealing with that horror brings us…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…Senate rules, or Senate  precedents gives unelected staff at the GAO the authority to prevent  elected Senators from considering a resolution of disapproval against a  rule. In fact, Comptroller General Gene Dodaro, who is head of the GAO,  recently testified in a Senate hearing and said:\n\nOur decisions are not dispositive on the Congress--they're…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…development.\n\nI can tell you, Mr. Speaker, we have seen firsthand how government at  every level, local, State, and Federal, has put up barrier after  barrier to affordable housing. In fact, based on recent analysis, the  average home in Michigan costs almost double to build than what the  average family can afford.\n\nThe Housing for the 21st Century Act would help…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699804/housing-for-the-21st-century-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today in support of H.R.  3109, the REFINER Act.\n\nFor too long, America has fallen behind in refining capacity. In  fact, we have lost an estimated 1 million barrels of fuel per day due  to low refining capacity.\n\nThe Biden administration declared war on American energy by  suspending oil and…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697032/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…Trump's America First agenda. It invests in transportation  infrastructure and housing affordability while cutting wasteful  spending and reducing the Federal bureaucracy. In fact, this bill  codifies DOGE cuts, like reducing HUD staff by 24 percent and DOT by 5  percent, helping to rightsize the Federal workforce.\n\nWhen it comes to aviation safety, a…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699326/consolidated-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…SCHWEIKERT. Mr. Speaker, I was actually going to come here and do  some things on demographics and some things that are optimistic, but I  actually think we should first jump into the fact that we work in a  math-free zone.\n\nIf you listen to the people coming behind the microphones,  particularly today, it is as if they have read none of the CBO reports,  none…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…taken the brunt of this.\n\nThis CRA needs to be done away with because we have to have that  ability. The predecessor of the gentleman across the way advocated no  mining. In fact, he used a national monument, disgracefully, to  actually bring in a tin-silver mine. Yes, that is bad, but we can have  our cake and eat it too. That is technology.\n\nMr. Speaker,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699270/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…little time to address the importance of the No  Rogue Rulings Act and why the American people are demanding action  against this unchecked abuse of nationwide injunctions.\n\nThe fact is activist liberal judges have been utilizing nationwide  injunctions in an unprecedented fashion. There have been 17 identified  cases in which Federal courts issued nationwide…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}]