[{"senator": "Mark Kelly", "party": "Democrat", "sentence": "…It failed because the will of the American people was  stronger than an angry mob and stronger than Donald Trump.\n\nBut now the question is: If this happens again, will this fail?  Democracy is not self-executing. It depends on leaders who tell the  truth, respect the will of the people and the rule of law, and put the  Constitution ahead of their own…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698511/9999"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…will provide relief. Instead, they are putting on  political theater with an unserious vote on an amendment that will  undermine the ACA that their leadership intends to see fail.\n\nThis eleventh hour, half-baked plan isn't even feasible to implement.  Earlier this year, Democrats urged Republicans to extend the tax  credits fearing for those Americans…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…However, this year, the impact of the reciprocal tariffs, coupled  with the expiration of AGOA on September 30, threaten to erode 25 years  of economic cooperation.\n\nIf we fail to act, we will likely see weakening supply chains and  increased poverty across the continent. Moreover, many industries could  shift investments away from Africa and toward…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…foreign power, must be intrinsically precarious.\n\n``While then every part of our country thus feels an immediate and  particular interest in union, all the parts combined cannot fail to  find in the united mass of means and efforts greater strength, greater  resource, proportionably greater security from external danger, a less  frequent interruption of…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700271/president-washingtons-farewell-address"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…American. That includes the farmers who feed our Nation.\n\nI will stand here in opposition to any executive or legislative  action that puts our farmers at risk because when we fail farmers, we  fail all Americans.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688191/protecting-agriculture-the-backbone-of-delawares-economy"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…lifesaving food aid sat in  warehouses while children starved to death.\n\nThis was not just cruel. It was short-sighted.\n\nAmerica's reputation as a global leader suffers when we fail to  deliver international aid. Our adversaries--China, Russia, terrorist  organizations--fill the abyss when the United States pulls out.\n\nA broad coalition of Americans fought…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696874/recognizing-important-victory-for-countless-children-around-the-world"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…They are facing attacks on their benefits. They are facing attacks on  their healthcare, education, and housing. When we reduce  an agency established to work for them, we fail them.\n\nI stand behind Congressman Green as he stood up for the rights of all  veterans and all Americans.", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688505/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…Hawaii alone.\n\nJust yesterday, this House passed the NDAA, meant to strengthen our  national defense. However, the NDAA means nothing if we cut down, take  away rights, and fail to protect the very workforce that makes national  defense possible.\n\nEarlier this year, President Trump issued an executive order  dismantling collective bargaining agreements…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697988/protect-americas-workforce-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Bellatrix Fail  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nBellatrix has overcome many challenges along her journey to success,  demonstrating perseverance at…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689798/recognizing-bellatrix-fail"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…authoritarianism  with himself as the authoritarian. Authoritarian President Donald John  Trump is the problem. The threat of impeachment can act as a deterrent.  Should that fail, actual impeachment becomes the solution.\n\nHaving presented Articles of Impeachment that laid the foundation for  President Trump's prior impeachments, which contributed to…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…have intervened  because we assume military might is enough. We imagine outcomes that  align with our military and economic objectives but are surprised when  those outcomes fail. We consistently fail to plan for the ``day  after.''\n\nUnless the Trump administration gets serious, Venezuela will be no  exception.\n\nThis isn't about our military capabilities.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…vote--a vote. We ought to face  our responsibilities. Maybe my colleagues, even though 76 of them have  cosponsored--that is three quarters of this body--maybe it would still  fail for whatever reason. But I would like to take my chances. And I  assure my colleague from Mississippi, who I think supports the basic  goal from what he has said, that I will…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the world wants  that cease-fire to hold.\n\nMr. Speaker, when you talk about a cult, the cult would be the people  who hate Donald Trump so bad that they want the cease-fire to fail.\n\nMr. Speaker, let me just remind my colleagues again about what is  happening here. Trump said he would end the war in Ukraine on day one.  He didn't. Last time I checked,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…feed this information through  sites that don't fact-check? Russia, Iran, the People's Republic of  China, and other adversaries do.\n\nRepublican leadership has continued to fail the American people by  making this bipartisan bill a rightwing culture war process. When we  should be debating the administration deploying Active-Duty  servicemembers on…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695250/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…majority, and they should. It  is my hope that this fear will prompt my Republican colleagues to  rethink their agenda for purposes of electoral self-preservation. If  they fail to do so, the American people, as has happened before, will  rightfully rethink who they elect so that we can preserve our economy  and our democracy.\n\nI will close, Mr. Speaker,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…sit  idle? The current state is intolerable. The status quo has failed, and  it is time for genuine reform.\n\nMr. Speaker, I have seen firsthand what occurs when the systems fail  for those on the front lines overseas. We cannot allow failure at home.  When I served as an Army intelligence officer overseas, we lived by a  simple creed: Mission first,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695432/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…interconnection  process and will work in tandem with reforms made in FERC order number  2023 to alleviate some of the backlogs we have witnessed over the past  several years.\n\nIf we fail to build the dispatchable resources needed to power next- generation industries, we will cede American leadership on the world  stage to Communist regimes such as China and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695753/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…vitally needed payments.\n\nThis is a measure that has broad bipartisan support. It is a very  popular program. It is an important program. There is no reason that  Congress should fail to pass its reauthorization in a timely manner.\n\nMr. Speaker, I look forward to this passing on the floor today. We  need to make sure that in the future we don't keep our schools…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697664/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…in prosperity. We do not believe  in martyrdom. We do not celebrate death. That is not what we believe.  There are those that do, and we put ourselves in great peril when we  fail to recognize that.\n\nDonald Trump recognized it. Our brave American soldiers who flew 40  hours round trip to deliver a message that under this President and  under the Congress…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692703/thanking-president-trump-for-saving-the-world"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…constitutional and representative  form of government.\n\nIncreasingly, however, civic knowledge is on the decline.\n\nA recent survey by the U.S. Chamber of Commerce found that 70 percent  fail a basic civic literacy test.\n\nAnother survey found that nearly 17 percent of Americans could not  name any branch of government.\n\nThis should be concerning for all of us.\n\nI…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693285/civic-education"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…the largest tax  cut in American history. This process hasn't been easy by any means,  but it is worth every single debate we are having to get it over the  finish line. If we fail to get this bill passed and on President  Trump's desk, then middle- and working-class families will be the ones  who pay the price.\n\nSome of my Democrat colleagues continue…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "John Thune", "party": "Republican", "sentence": "…month, cartels are already smuggling fentanyl across our  northern border.\n\nSo what will happen if we focus on fentanyl coming across the  southern border and from China but fail to address the northern border  component of this crisis? Will the cartels simply shift tactics and  expand their operations to the north? I think we can be confident the  answer…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689477/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…requirements for foreign funding and  contracts. It also will hold institutions accountable by imposing  fines, such as the loss of student aid funding for schools that  continually fail to comply.\n\nThis bipartisan bill is a commonsense solution to an irrefutable  problem, which is why it passed last Congress with bipartisan support.  We should be loud and clear:…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…them.\n\nWhile the report says the Secret Service has made changes to correct  some of these problems, they still have more work to do. The Secret  Service operates in a zero-fail mission, and they don't have room for  any error.\n\nEvery failure exposed by the Government Accountability Office report  must be turned into positive changes in the Secret Service.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693512/one-year-anniversary-of-trump-assassination-attempt"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Congress holds an explicit mandate that is outlined in our Article I  responsibilities to appropriate funding for the missions of departments  across the government. When we fail to uphold that mandate, we fail to  serve the American people. We fail to do right by them.\n\nWe must bring the appropriations process to a close. We must move  forward and complete…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699591/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…every  aspect of society under brutal government control, the CCP uses state  power to drive fear into the hearts of its citizens. History has shown  that these tactics will fail, and the persecuted church will only grow  stronger.\n\nThe Apostle Paul reminds us that God gave us not a spirit of fear but  of power and of love. I know that that same spirit--one…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696588/expressing-condemnation-of-the-chinese-communist-partys-persecution-of-religious-minority-groups"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…cost us  more. They also update, refine, and change language in some cases that  is 2 and 3 years old and is simply out of date with the current  circumstances.\n\nIf we were to fail to pass these bills in these respective areas,  then that language would remain intact. I think it is important to  recognize that we were able to come to agreements in this…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Trump.\n\nFor years, the House Committee on Energy and Commerce has ultimately  led the fight to crack down on pharmacy benefit managers, or PBMs,  whose hidden practices too often fail patients and, rather, enrich the  health insurance companies in America.\n\nThese historic reforms take important first steps to hold PBMs  accountable by delinking PBM compensation…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700129/opening-of-kongsberg-defense-expansion"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…colleagues representing States that rely on the  National Flood Insurance Program is, let's find a way forward. One day,  the National Flood Insurance Program will lapse if we fail to act.\n\nNow, we are going to, with this CR, do a temporary--temporary-- extension. I would ask that we actually have a reauthorization and a  reform of the National Flood Insurance…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688826/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…CLARITY Act.\n\nThe United States has the opportunity to lead and deliver on  President Trump's promise to make America the crypto capital of the  world. We cannot and will not fail.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693790/digital-asset-market-clarity-act-of-2025"}]