[{"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…backs on millions of Americans and their fight to survive  poverty and live with dignity.\n\nRepublicans are doing nothing to bring down costs. Instead, their  policies and their failure to act are making life more expensive for  hardworking Americans during a time when inflation and a rise in  grocery prices make it harder for people to get by.\n\nMr. Speaker,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691951/protecting-snap-from-budget-cuts"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…to, or  favoring a concentration of power in a leader or an elite not  constitutionally responsible to the people.''\n\nI am among those who have pointed out President Trump's failure to  preserve, protect, and defend the Constitution by flouting  constitutional law, as well as the orders of Federal courts, including  the Supreme Court of the United States…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…about narcotrafficking at all. We have argued that  the administration's shifting legal justifications, refusal to give  Congress straight answers, and, in particular, the failure of the  Department of Defense to provide information to Congress, which is  required by law--all of these things--together with a massive military  buildup, pointed toward…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…died. Parents should never have to  bury their children. More than 100 Texans died in the deadly floods.\n\nThere are a lot of questions that need to be asked about government  failure and State government failure in Texas. The Governor of Texas  has a lot of questions that need to be answered. Instead, he is trying  to rig the Texas congressional map in…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693714/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…happening around us--especially when they're  affecting our lives and livelihoods and our national security. Future  generations will pay the highest costs of Republicans' failure to act.\n\nAs a Minnesota representative, I will fight to defend these critical  investments because Minnesotans deserve better. The children deserve  better.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695056/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…President.\n\nSo this week, due to the resolution being brought forth by my  colleague from Virginia Senator Kaine, we have a chance--all 100 of  us--to weigh in and correct this failure on this third point and  reclaim the responsibilities that we took on when we took the oath of  office to become a U.S. Senator. That is our responsibility.\n\nThis should pass…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…force of masked thugs. In my community in  the Houston area, people are paying the price.\n\nLuis Gustavo Nunez Caceres died in ICE custody near Houston. DHS  claims it was heart failure, but this administration has shown such  contempt for the truth that we can't believe a darn thing they say. His  family is demanding answers, and so are we. I have requested…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699665/horrific-ice-abuses"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…work with Republicans to pass a true bipartisan-- true bipartisan government funding bill, one that ensures vital  programs remain funded and that our government remains open. Failure to  do so will mean economic catastrophe and a continuation of the trends  of the past 30 years that we have just walked through.\n\nWe can't let that happen, and we must work…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695675/cloture-motion"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…horror stories  about immigrants, regardless of the truth.\n\nAll we see from this House majority is distraction after distraction,  all to divert attention from the President's failure to deliver on  promises to the American people.\n\nMs. SCANLON.  Ansari).\n\nMs. SCANLON.  McBride).\n\nIf we defeat the previous question, I will offer an amendment to the  rule…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…authorities is the ability to designate certain nonbank  financial companies as systemically important financial institutions,  or SIFIs, when their activities or potential failure pose significant  risk to financial stability.\n\nPast attempts by FSOC to designate an entity as systemically  important, however, have been controversial and short-lived.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699823/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…largest child sex abuse and trafficking ring perhaps in American  history, certainly in this century, and they want to just throw stones  at the Democrats. What a remarkable failure of leadership we are seeing  from the other side.\n\nI imagine that the chairman of the Committee on Oversight and  Government Reform will follow up his spectacular failure…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696807/epstein-files-transparency-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…experiencing addiction and  alcoholism, and the stigmas surrounding those diseases were  devastating. At the time, the sentiment in America was that addiction  was a personal failure. Those who suffered from addiction were cast out  of society, isolated from their families, and denied the treatment they  so desperately needed. Instead of being sent to…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694580/recognizing-50-years-of-haymarket-center"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…healthier people who see their insurance premiums rise by 20  percent--right now, they are projected to rise at least 18 percent for  everyone because that is the cost of this failure to extend the  subsidies. The healthier people are going to say: I am not bothering. I  won't need it.\n\nThe sicker people may try to buy it, and the insurance companies will…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695873/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the National Weather Service so badly that right now we might  not have enough meteorologists to warn communities about tornadoes and  hurricanes.\n\nDOGE was a total, complete failure, and now Republicans want to lock  their disastrous cuts into law?\n\nCome on. That is insane. That is crazy.\n\nMr. Speaker, look at what these cuts are targeting: funding for…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…responsible for  healthcare costs rising through the roof.\n\nYesterday, Leader Thune admitted:\n\nWe're not going to pass anything by the end of this week.\n\nThat is a clear admission of failure--a failure to govern, a failure  to lower costs for the American people.\n\nThe damage has been done, no matter what happens, because, at this  point, Republicans have made…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…bill shall be       considered for amendment under the five-minute rule. The bill       shall be considered as read. Points of order against       provisions in the bill for failure to comply with clause 2 or       clause 5(a) of rule XXI are waived.\n\nSec. 2. (a) No amendment to H.R. 4553 shall be in order       except those printed in the report of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…ISSA. Mr. Speaker, as I close, since the ranking member so aptly  named a couple of famous quotes and famous movies, I might call  attention to the line: What we have here is a failure to communicate.\n\nThe other side, just a few months ago, supported this legislation in  a more radical form than, in fact, we bring today. Thanks to  Congressman Schmidt and…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Americans who have worn the uniform to honor that humbling  responsibility.\n\nMoreover, despite the tactical success of our strikes, they may end  up proving to be a strategic failure. It is unclear if this  intervention will fully curtail Iran's nuclear aspirations or, in fact,  whether the Iranians may well conclude to double down on their efforts  to…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…authority from the imperial  pretensions of the Chief Executive.\n\nTo endorse governance by emergency rule is to fail to live up to what  the Constitution demands of us, and failure to do our constitutional  duty is an invitation to further emergency rule.\n\nI know some Republicans like the idea of taxing trade, but what if  there is a next President who…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…has failed, and  it is time for genuine reform.\n\nMr. Speaker, I have seen firsthand what occurs when the systems fail  for those on the front lines overseas. We cannot allow failure at home.  When I served as an Army intelligence officer overseas, we lived by a  simple creed: Mission first, and no Americans left behind.\n\nMy bill is an embodiment to that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695432/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…high risk.\n\nBy doing so, it effectively limits access to credit and that  overdraft privilege for those who need it the most at the time they  need it the most.\n\nThe CFPB's failure to consider the cost associated with this  regulation, especially the real-world impact on consumers, their local  community's financial institution, and the broader financial…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…remaining hostages is paramount! The author's angst is       with the Nazi-like Hamas leaders as well as Prime Minister       Netanyahu and his government for the colossal failure to       forestall the October 7 debacle, requiring a state inquiry       commission. A disturbing inclusion is the eulogy by the late       Moshe Dayan, the iconic Israeli…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690665/israel-at-77"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…Street Journal, just this week, aptly summed up the current  crisis stating: We ``have a system under pressure that now just has  another 100 pounds of weight on it.''\n\nThe failure to pass a continuing resolution is slowly crushing our  aviation system. Our system is too fragile and the stakes are too high  for us to continue operating the national aviation…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696174/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…the end the following:\n\n``(17) a listing of penalties, settlements, or payments       under section 303 of the Federal Food, Drug, and Cosmetic Act       (21 U.S.C. 353) for failure to comply with requirements under       such section 505B, including, for each penalty, settlement,       or payment, the name of the drug, the sponsor thereof, and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…future.\n\nSo why in the world would we engage in willful blindness, not knowing  what American investors are doing to help prop up the Chinese economy  and the Chinese military?\n\nFailure to address outbound investment transparency is to pretend  that national security doesn't matter. And we don't have any more time  to procrastinate. The best time to act on…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…it?\n\nAgain, there are great examples all over the world of how failed that  approach is and every one of those countries has experimented with  that, and it has been a dismal failure. I don't see any of the people,  that want to change America to that, going to those other countries,  because those other countries are so failed.\n\nLet's start with that.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…day 30 of the Federal Government shutdown. Agencies are  shuttered. Important services are paused and unavailable. Countless  Americans have missed paychecks because of our failure to do our job to  keep the government open.\n\nIt only gets worse as this drags on.\n\nOn November 1, an estimated 42 million Americans will miss out on  their monthly benefits…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696473/vote-explanation"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…National Endowment for Democracy, you think the United States is  working productively in places like Iran, Cuba, and Venezuela. If we  are, let's face it, we have been an abject failure.\n\nLet me tell you where your taxpayer dollars are really going. Where  they had been going is to pressure advertisers to demonetize and  suppress American political speech…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699045/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…What makes  these tragedies so heartbreaking is the knowledge that many of these  victims could have lived but for the Biden administration's open border  policies and its failure to act responsibly and enforce the law. These  good Americans died at the hands of criminal aliens who should never  have set foot in our country.\n\nBut there is another category…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…M.D. Anderson and could not go because  she was on an  ObamaCare plan and couldn't go to the best cancer hospital in the world  because she was covered under ObamaCare.\n\nThe failure of our healthcare system cannot be overstated. Both  parties need to step to the table to get government out of the way and  to allow doctors and patients to be able to go…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}]