[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…have a Department of Defense that is  unaccountable.\n\nLast Congress, I led a bicameral letter to then-Secretary Austin  demanding answers after a GAO report found significant failures in  barracks' facilities across the country. Billions of dollars have been  poured into installations for housing and infrastructure improvements.  Again, those investments…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691398/motion-to-discharge-s-res-195"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…possess no special insight into their motivations, I would  argue that the two are connected. Republicans don't want to face  democratic accountability for their governing failures, so they are  trying to curb the electoral power of the struggling Americans who  their destructive economic agenda is harming the most.\n\nI am a little bit of a student of…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…American  people and to punish their political opponents.\n\nLast week was President Trump's 100th day in office, a customary  benchmark by which we measure the successes and failures of a new  President's term. I think it is safe to say that Trump's first 100 days  have been a disaster. His tariff policies are likely to cause a  recession. Millions of…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…almost 3 years since we saw the dramatic failure of  Silicon Valley Bank, Signature Bank, and First Republic Bank,  representing the second, third, and fourth largest bank failures in  United States history.\n\nSilicon Valley Bank was the fastest bank run ever, with $42 billion  of deposits withdrawn on a Thursday and customers trying to pull out  another…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699862/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…It  would strengthen emergency notification so first responders are not  left in the dark. It would raise penalties for safety violations and  address the exact equipment failures that caused the East Palestine  derailment.\n\nThe RAIL Act is supported by rail workers, local governments, and a  bipartisan group of lawmakers, Democrats and Republicans…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699687/norfolk-southern-train-derailment"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…failed the American  people. That is why I am grateful to my colleagues, Representatives  Kamlager-Dove and Brown, for leading this Special Order hour.\n\nLet's focus on these failures. In countless ways, Donald Trump has  failed the American people. He has failed to bring down prices for  families. He has failed to keep Americans safe. He has failed to…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690634/trumps-first-100-days"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…crisis in  San Diego.\n\nThe IBWC has jurisdiction over the South Bay International Wastewater  Treatment Plant in San Diego, where longstanding operational and  maintenance failures have allowed raw sewage to flow from the Tijuana  River into San Diego's beaches. This has created a public health crisis  that strains local resources, poses significant…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698031/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…students spoke boldly about their fears and hopes for the  future, and they made one thing clear: They are done waiting for  change.\n\nI don't blame them. Our country's policy failures have grounded our  kids in uncertainty. Many feel like the American Dream is out of reach.\n\nThat is personal for me. My trajectory has been an American Dream:  the first in…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696966/youth-advisory-council"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…numerous water challenges. Climate change is  making those challenges worse.\n\nOur military is not exempt. The Defense Department has previously  identified water services failures as a growing risk, as they impact a  military facility's ability to execute missions and maintain warfighter  readiness. That is where my amendment comes in.\n\nMy amendment…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694170/department-of-defense-appropriations-act-2026"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…national parks to not only marvel at the  mountains or coastlines. They come to understand who we are. They come  to confront the complex tapestry of our past: our triumphs, our  failures, and the lessons that bind them together.\n\nThat is why the recent removal of the interpretive materials titled  ``Life Under Slavery,'' ``The Dirty Business of Slavery,''…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699714/rewriting-history"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…will do what Senate Republicans refuse to  do: conduct oversight on this administration. We will do it on our own.  That means pushing for investigations into the leadership failures at  the Pentagon. What Hegseth did there was horrible. It means pushing  back against attacks on Social Security. It means resisting the  defunding of public resources like…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690192/business-before-the-senate"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…over a year.\n\nYet still, after an entire year in charge, Republicans continue to  point the finger at Democrats rather than take responsibility for their  own embarrassing failures and broken promises. Republicans and Trump  ran on fighting for working people, but every single day, they have  governed on behalf of billionaires and corporate donors.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…accountable, improve transparency, and       strengthen community trust. These are not abstract ideals;       they were enacted in response to concrete, well-documented       failures within the Metropolitan Police Department.      The D.C. reforms were necessary to hold officers accountable           for serious misconduct\n\nBefore the Act, D.C. had no…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…States will ``run''  Venezuela and seize its oil--was not an isolated incident; it was a  culmination of a monthslong campaign built on dubious legal arguments,  institutional failures, and Congress' willful abdication of our  constitutional duties.\n\nFor months, my colleagues and I warned that President Trump's  military campaign against the alleged drug…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…but they have become the norm. It is not just a failure of a  process. It is a failure of President Trump's leadership and House  Republican leadership.\n\nTrump's economic failures include trying to make his tax cuts  permanent, the DOGE cuts, and the irresponsibility of the tariff  packages. Thank goodness, I think he backed away a few days ago with…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…elected him as  President--promises made, promises kept.\n\nIt is hard to believe that, in just 6 short months, President Trump  has reversed 4 years of disastrous open-border failures from the  previous administration. For 4 years, President Biden and Vice  President Harris told the country over and over again that they simply  did not have the authority…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694111/americas-borders-are-safer"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…the  career VA employees who contributed to the crisis remain. Some of these  employees have operated far too long without scrutiny and with no  consequences for planning failures that total billions of dollars.\n\nWithout some ways of tying poor performance to outcomes for these  employees, what message does the business-as-usual status quo send to…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…spending without meaningful improvements in outcomes, and that is  driving our national debt now to $37 or $38 trillion.\n\nSecretary Kennedy has committed to addressing these failures. He has  made himself and his staff available to Congress and the American  people to restore faith in our institutions. When issues have arisen,  Secretary Kennedy has worked…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691446/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…will end that nightmare. It will get this  legislative body and the entire Nation moving once more.\n\nDemocrats should grow a spine and accept responsibility for their own  failures. I urge a ``yes'' vote on the rule.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696692/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…systems       to communicate with and alert other vessels in the vicinity;\n\n(5) address the ability of small uncrewed maritime systems       to respond to system alarms and failures to ensure control       commensurate with the risk posed by the systems;\n\n(6) provide present and future capabilities of small       uncrewed maritime systems; and\n\n(7) provide…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…signature.\n\nLate last year, the American people rallied en masse behind the  Republican vision for a renewed Nation. It is a nation no longer  blighted by the cataclysmic failures of the previous administration,  and a nation primed and ready to enter the golden age.\n\nOne of the many strong reinforced byproducts of our Republican vision  is the One…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…inclusion, as well as financial  literacy and  awareness. Frankly, this rule isn't going to accomplish that. My  friends on the other side of the aisle know it.\n\nAfter the bank failures of 2023, community financial institutions  lost consumers and remain at a disadvantage. Again, any rule that leads  to greater consolidation in the banking industry only benefits…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689844/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…I think we should thank the Trump administration's efforts--and I  thank them--for responding to my oversight requests and their efforts  to fix the Biden administration's failures.\n\nThis Senator's oversight work will continue.", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697333/national-security"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…applicable requirement)''; and\n\n(3) by adding at the end the following:\n\n``(3) Limitation.--The Secretary shall not issue       enforcement actions under section 303 for failures under this       subsection in the case of a drug or biological product that       is no longer marketed.''.\n\n(b) Due Diligence.--Section 505B(d) of the Federal Food,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…ObamaCare. Their plan ignores 93 percent of Americans who  will also see costs go up. We need to help all Americans by fixing our  healthcare system, not just paper over the failures of ObamaCare to  help a few.\n\nI will add, for as much as they talk about healthcare, the Democrat  shutdown is defunding important healthcare programs.\n\nAs chairman of the…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…taxpayer dollars to big health insurance plans. With the Democrats'  temporary COVID credits set to expire at the end of the year, they are  attempting to turn their policy failures into political gains using the  American people as collateral.\n\nIt is worth reiterating. Democrats funded temporary Band-Aids to  cover up unaffordable care. They set the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…chain modernization program,       disaggregated by each such workforce; and\n\n(4) an independent assessment of the review carried out by       the Secretary with respect to failures of the supply chain       modernization program of the Department.       SEC. 3. EXTENSION OF CERTAIN LIMITS ON PAYMENTS OF PENSION.\n\nSection 5503(d)(7) of title 38, United…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695399/va-hospital-inventory-management-system-authorization-act"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…a healthcare  system put into place by the Democrats. It is a healthcare system  extended by the Democrats. The proposal today will do nothing to extend  anything but the failures of the past. It will not fix the broken  system they put in place.\n\nMr. Speaker, that is why I rise today in opposition to this  Democratic discharge petition. It is fiscally…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698806/breaking-the-gridlock-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. Mr. President, in the runup to last year's elections,  Republicans made some promises to the American people. We promised to  turn the page on the failures of the last 4 years, to help working  families and to get our economy moving, to make our country stronger  and more secure. Last week, we delivered legislation that will…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693279/one-big-beautiful-bill-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…fallout from Joe Biden's disastrous  decision hurt Americans then, and it continues to hurt Americans today.  President Trump and Republicans are working to reverse these failures.  The President is strengthening law enforcement. He is deporting  criminals who are here in our country illegally, and he is taking a  hard look at anyone who has been improperly…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697341/trump-administration"}]