[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…by Europe.\n\nI am surprised to hear that the Europeans collectively are spending  more on defense than the United States. If that had been a trivia  question, I would have failed. But there it is, and that certainly has  been partly to recognize the threat from Russia.\n\nIf Russia is willing to slice off a piece of Georgia, as they were in  2008, I believe;…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…were 96  small business submissions and, more recently, reported there were 301  submissions. Yet, despite repeated requests for more information, the  Office of Advocacy has failed to provide any specific information about  this request to the committee--Democrats and Republicans.\n\nWe have no way of knowing if the submissions are related to rules.  They…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697350/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…rigor, problematic methodology, and  undisclosed bias.\n\nEdward Artau, nominated for the Southern District of Florida--the  ethical lapses on his part were undeniable when he failed to recognize  the obvious conflict and recuse himself from his involvement in a case  involving the President at a time when he potentially was under  consideration for a nomination.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…for my mom.\n\nMy dad, as I mentioned earlier, grew up in Newark.\n\nThat must be LaMonica McIver.\n\nHe grew up in Brick City. I mentioned earlier he had a nickname,  Pudding. I failed to ask him, but I am going to see if my mom can  unlock the key to that nickname for me. My mom grew up in Bristol,  Connecticut, and my father grew up in Newark.\n\nI mentioned…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…discussed above, courts have       determined that the Richardson Waiver imposed such       requirements on HHS, and invalidated rules within those       categories when HHS failed to follow APA notice-and-comment       procedures. HHS has also contested the impact of the       Richardson Waiver in more recent litigation, but the courts       have either…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…Office of  the Presidency and the people of the United States. He has betrayed the  trust of the Nation to conduct meaningful diplomatic negotiations as  its chief diplomat and failed to maintain peaceful economic and defense  relations with foreign countries. He has threatened the security of the  United States through gross misconduct of his office, prompting…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…out-of-pocket  costs. Nationwide, nearly 100,000 American families could lose their  coverage each year if Congress fails to act.\n\nLast year, Republicans passed a partisan bill that failed to renew  the essential premium tax credits, forcing millions of Americans to pay  higher costs this year, even though a bipartisan solution is at hand.  Families, therefore,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698830/putting-americans-first"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…close to Vermont but  doesn't have anything close to the weather in Vermont.\n\nSo the aftermath of repairing, getting the community back on its  feet--that is where FEMA has failed us. It is because of the  centralization, in my view--actually, less important than my view--in  the view of the local officials who have ongoing responsibility to get  the…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…cleanup. Guess what? It didn't work. It just  delayed the cleanup and cost taxpayers more money.\n\nSecretary Bodman, he inherited Secretary Abraham's unrealistic  promise, and he failed to address the fundamental technical problems  emerging at the waste treatment plant--problems with hydrogen gas  build-up, pulse jet mixing, nuclear critical risk, and identified…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695342/hanford-site-cleanup"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…big  lie. What Elon Musk was trying to do was reshape government illegally  against the express will of Congress.\n\nUnfortunately, my colleagues on the other side of the aisle failed to  stand up to this abuse of law and this direct attack on our  Constitution and our authorities.\n\nThe courts, thankfully, have stepped up. Right now, the Trump  administration…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…targeted.\n\nWhile our colleagues across the aisle are determined to shift the  public narrative away from the harm being done to veterans, we choose  to focus on what our President failed to address last night. He spent  an hour and 40 minutes touting his so-called accomplishments while  veterans watching at home were waiting for answers, answers and  explanations…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688505/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…caught  voting in Federal elections already face deportation and even jail  time.\n\nTime and again, when pressed for evidence of widespread noncitizen  voting, Republicans have failed to produce a single credible example.  The reason? Because the problem they claim to be solving simply doesn't  exist.\n\nWhy are we here today? Why are we debating a bill that…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689394/gop-creating-chaos-in-electoral-system"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…off to billionaires.\n\nSo this is without question just a continuation of their efforts.  They tried to stop Medicare. They tried to stop Social Security. They  tried and they failed to kill the Affordable Care Act. Now they are  trying to eliminate the tax credits that help people afford their  health insurance.\n\nIn Massachusetts, for example, it is 60,000…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "…first step is these ACA tax credits because it is going to help  working families. The party in the majority now said they were going to  lower the cost of living, but they failed. Now we are going to step up.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698802/breaking-the-gridlock-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…employees, not touting how its employees are abandoning the VA--fleeing  a toxic work environment and a demoralizing work environment. They are  fleeing the VA because of a failed and failing leadership.\n\nNow, the reason why the VA Secretary has abandoned this plan to fire  83,000 people is, essentially, unexplained. There is no transparency.  He has…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693321/9999"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…grow the economy, power the country, and steward the  environment all at once. That is the American Way, and that is  certainly the North Dakota way.\n\nThe Biden administration failed to recognize that and completely  ignored all of my State's concerns with the plan. If we want to talk  about intellectual dishonesty, that is the definition of it. So is so…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694907/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "James Risch", "party": "Republican", "sentence": "…for a long time have hoped to see our European partners wake  up to the extreme threat that we all face from a nuclear Iran. Today,  we are 10 years on from President Obama's failed nuclear deal with  Iran. Over the last 10 years, Iran has enjoyed unwarranted sanctions  relief, and time is short before the opportunity expires to snap back  sanctions, as…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694081/9999"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Act did not make healthcare affordable.\n\nWhen ObamaCare was crafted, debated, and passed, Democrats refused to  work with Republicans to make it a bipartisan law.\n\nSo this failed experiment in ObamaCare that is now proposing 18  percent premium increases in places like the State of Texas this  upcoming year has been a complete failure.\n\nPresident Obama…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…in history, putting  thousands of dollars back in the pockets of families still recovering  from the crushing inflation and cost-of-living crisis caused by the  Democrats' failed economic policies and unbridled spending.\n\nThere is the complete distortion that Medicaid is being cut when, in  fact, it is being strengthened for our most vulnerable citizens…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693192/one-big-beautiful-bill-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…adding new ones where  necessary, we can combat fraud head-on.\n\nMr. Speaker, at the end of the day, veterans should never lose their  hard-earned benefits because the system failed to protect them from  criminals. The VSAFE Act should strengthen the accountability, improve  prevention, and give veterans the support and protection they deserve.\n\nThis bill…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699191/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Accountability Office produced to  me its report on the July 13 assassination attempt. The Government  Accountability Office report starts by stating:\n\nThe U.S. Secret Service failed to implement security       measures that could have prevented the assassination attempt       on then-former President Donald J. Trump during a July 13,       2024, campaign…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693512/one-year-anniversary-of-trump-assassination-attempt"}, {"senator": "John Thune", "party": "Republican", "sentence": "…up prices for consumers.\n\nIn its public comments on the Biden administration's appliance  standards, Carrier, an appliance manufacturer, said that the Department  of Energy failed to adequately account for ``the cost and burden . . .  to comply with updated requirements.'' A manufacturers association said  that the proposed reporting standards had ``no…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697344/biden-administration"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Management Act, or FLPMA, the  Department of the Interior is required to notify Congress of public  land orders impacting in excess of 5,000 acres. The Biden  administration failed to properly transmit Public Land Order 7917 to  Congress when it was finalized in January 2023.\n\nPublic Land Order 7917 implemented a broad policy that hinders access  to American…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "John Thune", "party": "Republican", "sentence": "…is the employer  market--half the cost. Again, taxpayers are paying the premiums. The  incentives are all there to continue to run up the cost.\n\nThis is nothing more than a failed program, partly because it is a  failed structure with no incentives to reduce costs; where insurance  companies decide to cover you--you may not even know you have coverage;…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…bipartisan legislation introduced by the gentleman from  Montana (Mr. Downing) and the gentleman from New Jersey (Mr. Conaway).\n\nFor 4 years, the Biden administration's SBA failed to address over  $200 billion in COVID-19 era fraud. H.R. 4495 extends the soon-to- expire statute of limitations for two pandemic-era relief programs: The  Shuttered Venue…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697227/sba-fraud-enforcement-extension-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…That's why I want to recognize two Utah businesses--Gateway Parks in  Spanish Fork and Barn Elite Training in Mapleton--that are stepping up  where too many institutions have failed.\n\nGateway Parks is making winter sports accessible to kids who might  never get the chance, teaching them confidence, grit, and the value of  falling down and getting back…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690045/recognizing-gateway-parks-and-barn-elite-training"}, {"senator": "John Rose", "party": "Republican", "sentence": "…executive oversteps.\n\nAll Members of the House should take issue with Senate leadership for  secretly slipping in this provision. In fact, whoever carefully crafted  this scheme failed to tell their Senate colleagues. I agree with  Senator John Kennedy, who said: ``Whoever put this in had an obligation  to tell us about it, and they didn't.''\n\nThe consensus…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696927/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…independence, and support an industry critical to our economy and our  security, all while maintaining responsible stewardship of historic  resources.\n\nOne thing that BOEM failed to analyze that often gets overlooked, it  is not just Big Oil in the Outer Continental Shelf, it is also small  producers, family-owned businesses, and thousands and thousands…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688630/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…former coal miner, also signaled his skepticism       at Biden's plan to transition coal, gas and oil workers to       clean energy jobs, saying he was subject to a similar failed       policy.\n\n``You know, when they laid off at the mines back in       Pennsylvania, they told us they were going to train us to be       computer programmers,'' Trumka said.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…I have to say no. I always say no.\n\nI tell my farmers who come in and are just dying for relief because  we have messed up their livelihoods so much, Congress has, with a  failed system. Crop insurance is important. All the things we do are  important, but we include a bloated food stamp program, which is  exploding off the charts in the farm bill every…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}]