[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…Venezuela.\n\nAt every turn, this body had the opportunity to exercise oversight  and demand accountability, and at every turn, we failed to do so. Now  we must correct that failure.\n\nPresident Trump began laying the foundation for this operation--all  the operations in Venezuela--the moment he was sworn in. On his first  day in office, he designated…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…``Big Bad Bill.'' But this  time they want more and more. To what end? We know this hasn't worked  before. We know previous efforts to offer leases here have actually  been a failure.\n\nNow, they told us that development of the Arctic Refuge would bring  in a billion--billion with a ``b''--a billion dollars to the Treasury  to pay off the tax cuts that…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697413/9999"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…that was before him. If this judge rules, as  I think he will, the sword of Damocles will fall on him. I am referring  to the articles I have already filed dealing with his failure to obey  the simple constitutional premise  of persons having a right to due process.\n\nEverybody in the country knows--as he would say, ``everybody.'' We  know everybody doesn't,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…President comes here next,  you will admonish him for the language he uses.\n\nMcBride).\n\nI don't want to close, but I am prepared to close.\n\nMr. Speaker, this bill is a moral failure. It rips healthcare away  from millions. It pushes more families into hunger, and it leaves  seniors stranded all so billionaires can keep more of what they will  never spend.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…soon be  true in every district in this Nation. Families everywhere will know  someone who has lost their job because of the DOGE cuts, the tariffs,  the budget bill, or our failure to address the rising costs on  everything from groceries to rent to prescription drugs.\n\nThis week, Mr. Speaker, the people of Virginia sent a clear message:  They want pragmatic…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695221/welcoming-the-honorable-james-walkinshaw-to-the-house-of-representatives"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…using the same tired playbook authoritarian regimes have  used throughout history. He is dehumanizing our most vulnerable to  divide us and distract us from the fact of his failure to meaningfully  improve the lives of the people he was elected to serve.\n\nMr. Chair, we see this for what it is, and we refuse to let them win.  We will not erase the LGBTQIA+…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695236/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…our air: lead, mercury, arsenic,  benzene. When inhaled, these pollutants are known to have significant  health impacts, including cancer, birth defects, infertility, organ  failure, and developmental disorders in children.\n\nThe science is clear. Pollution kills. Study after study has shown  that air pollution is linked to higher rates of hospitalizations…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691589/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…authorities is the ability to designate certain nonbank  financial companies as systemically important financial institutions,  or SIFIs, when their activities or potential failure pose significant  risk to financial stability.\n\nPast attempts by FSOC to designate an entity as systemically  important, however, have been controversial and short-lived.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699823/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "Mr. FOSTER. Mr. Speaker, I thank Congresswoman Kaptur and  Congresswoman Budzinski for giving us a chance to set the record  straight on President Trump's abject failure to restore the strength of  U.S. manufacturing, perhaps his number one campaign promise.\n\nI am best known around here as being the Ph.D. physicist in Congress.  Before that,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695605/devastating-harm-caused-by-trump-administration"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…largest child sex abuse and trafficking ring perhaps in American  history, certainly in this century, and they want to just throw stones  at the Democrats. What a remarkable failure of leadership we are seeing  from the other side.\n\nI imagine that the chairman of the Committee on Oversight and  Government Reform will follow up his spectacular failure…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696807/epstein-files-transparency-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…inherently stable       and the assets that are permitted to back the value of       stablecoins in the bill are not sufficiently strong. Thus, a       situation similar to the failure of Silicon Valley Bank       (SVB), which was brought about by the failure of the       stablecoin peg, looms large. The bills also do little to curb       the fraud, illegal…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…Geithner, Lew, and Yellen, along with former Fed  Chair Bernanke, warned: ``These changes would make it impossible to  prevent the build-up of risk in financial institutions whose failure  would threaten the stability of the system as a whole.''\n\nBiden's FSOC addressed these concerns and improved procedures for  designations, while importantly ensuring there…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699825/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…for a huge tax giveaway to billionaires and  big business.\n\nDespite more than 40 years of empirical evidence showing that  Republican trickle-down economics are a resounding failure, Republicans  are nonetheless pushing ahead with their party orthodoxy. We have more  than enough evidence that trickle-down economics does not work. It  doesn't help the…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…when Silicon Valley Bank collapsed  and the price of the USDC stablecoin, which was supposedly worth a  dollar, fell to 88 cents as the run on the bank exposed the company's  failure to keep cash deposits in insured accounts. USDC only looks  stable today because the taxpayers bailed them out with the FDIC.\n\nThe GENIUS Act makes this problem even worse…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693618/crypto-used-by-criminals-and-corrupt-politicians"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…of all the people of this country. It is a cause       of particular       concern to young Americans, because they more than we will       reap the grim consequences of our failure to act on programs       which are needed now if we are to prevent disaster later.\n\nClean air, clean water, open spaces--these should once       again be the birthright of…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…remaining hostages is paramount! The author's angst is       with the Nazi-like Hamas leaders as well as Prime Minister       Netanyahu and his government for the colossal failure to       forestall the October 7 debacle, requiring a state inquiry       commission. A disturbing inclusion is the eulogy by the late       Moshe Dayan, the iconic Israeli…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690665/israel-at-77"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…ISSA. Mr. Speaker, as I close, since the ranking member so aptly  named a couple of famous quotes and famous movies, I might call  attention to the line: What we have here is a failure to communicate.\n\nThe other side, just a few months ago, supported this legislation in  a more radical form than, in fact, we bring today. Thanks to  Congressman Schmidt and…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…a  lie. Yet Gemma even generated fake links to fabricated news articles to  support the defamatory claim, and, of course, the links didn't work.\n\nThis marks a catastrophic failure of oversight of an AI model that  has been downloaded by more than 200 million people. So last week, I  sent a letter over to Google's CEO Sundar Pichai demanding an  explanation…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…authority from the imperial  pretensions of the Chief Executive.\n\nTo endorse governance by emergency rule is to fail to live up to what  the Constitution demands of us, and failure to do our constitutional  duty is an invitation to further emergency rule.\n\nI know some Republicans like the idea of taxing trade, but what if  there is a next President who…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…has failed, and  it is time for genuine reform.\n\nMr. Speaker, I have seen firsthand what occurs when the systems fail  for those on the front lines overseas. We cannot allow failure at home.  When I served as an Army intelligence officer overseas, we lived by a  simple creed: Mission first, and no Americans left behind.\n\nMy bill is an embodiment to that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695432/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…process, and  undermine the public trust.\n\nLet's be clear: There is no apparent evidence of widespread consumer  harm that justifies this rule. There is no demonstrated market failure  here. What we have instead is an agency stretching its mandate in a way  Congress never intended.\n\nBy allowing this final rule to remain intact, we are affirming that  scale…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689950/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…requirements       imposed by this subsection, the State plan shall not be       regarded as failing to comply with the requirements of such       part solely on the basis of the failure of the plan to meet       such additional requirements before the first day of the       first calendar quarter beginning after the close of the first       regular session…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688405/recruiting-families-using-data-act-of-2025"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…and their clients, and  sexual networks in Nepal.\n\nThe American people are begging Congress to get off its ass, codify  the DOGE cuts, and stop this taxpayer-funded nonsense. Failure is not  an option.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692532/rescissions-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…the end the following:\n\n``(17) a listing of penalties, settlements, or payments       under section 303 of the Federal Food, Drug, and Cosmetic Act       (21 U.S.C. 353) for failure to comply with requirements under       such section 505B, including, for each penalty, settlement,       or payment, the name of the drug, the sponsor thereof, and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…enforcement officials who prevented this attack  from happening. But the fact that the perpetrator is here in the United  States in the first place underscores yet again the failure to vet the  individuals who came into this country via the Biden administration's  parole.\n\nThe repeated incidents--and there are many more--committed or  attempted by Afghan…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…receive incorrect guidance or no guidance at  all on how to navigate classes while pregnant. In many cases, women  feel pressured to end their pregnancies or risk academic failure  despite protections that exist now under Federal law.\n\nThe Pregnant Students' Rights Act requires schools to clearly  communicate what accommodations and protections pregnant…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699316/pregnant-students-rights-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…disinfectant. For  years, the American people have demanded transparency about Jeffrey  Epstein and Ghislaine Maxwell's horrific crimes and about the Federal  Government's failure to protect the victims.\n\nThe House Oversight Committee is conducting a thorough review of the  Federal Government's investigation into Epstein. Our work goes far  beyond the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696808/epstein-files-transparency-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…waste that we will be slashing in foreign funding:\n\n$158 million from the Lebanon peacekeeping mission which has been  fraught with waste and abuse as evidenced by its abject failure to  contain Hezbollah;\n\n$3 million for an Iraqi Sesame Street;\n\n$833,000 for services for transgender people, sex workers, and their  clients and social networkers in Nepal;…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…direct primary  care arrangements that cut out the middleman and allow patients to  coordinate care directly with their chosen provider.\n\nHigh costs are not the only ObamaCare failure. It also resulted in a  major increase in fraud. A 2024 GAO investigation found that fake  identities were approved for ObamaCare subsidies at a 100 percent rate,  often remaining…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698431/republicans-have-delivered-in-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…M.D. Anderson and could not go because  she was on an  ObamaCare plan and couldn't go to the best cancer hospital in the world  because she was covered under ObamaCare.\n\nThe failure of our healthcare system cannot be overstated. Both  parties need to step to the table to get government out of the way and  to allow doctors and patients to be able to go…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}]