[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Security acquiring more  information on us. I do not want the general post office holding  ballots without postmarking them. I want our country to believe in free  and fair elections. It is how we move forward. The President of the  United States tonight should listen, as my guest tonight is the  secretary of state from Washington whose vote-by-mail…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700198/save-america-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…peace  going forward is also at stake. Democracy is at risk.\n\nI want to shift to the democracy that is at risk here at home, the  democracy that is dependent on free and fair elections, the democracy  that we must preserve against efforts to degrade and decimate it.\n\nPresident Trump has called for a nationalization of American  elections. Now, Americans…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700241/9999"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…circle of  election-denying, conspiracy theorists would have Americans believe,  the truth is that our elections are, indeed, free; that our elections  are, indeed, fair; and that our elections are, indeed, secure.\n\nThat is why the revamped, new-and-made-worse SAVE Act, which was  passed by the House last night and is designed to compel States to give…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…charge protesters.\n\nThe Georgian people have protested for over 150 consecutive days and  are still protesting today, especially on Sundays. They are calling for  free and fair elections and the release of political prisoners.\n\nThe United States has long supported freedom in Georgia and now is no  different. The MEGOBARI Act is an expression of that support.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690701/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…independence  of States and counties.\n\nWhy? It is so they can rig the elections and save Republicans. We  have to reject the so-called SAVE America Act and save our free and  fair elections and save our democracy.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700008/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "Mr. MULLIN. Mr. Speaker, free and fair elections are the foundation  of any functioning democracy. The SAVE Act is a blatant attempt to  undermine our election system, weaken American democracy, and unfairly  suppress…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690013/safeguard-american-voter-eligibility-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…democracy, and who we are as a people. I thank Senators Klobuchar  and Bennet for participating as well and all the others who did as  well.\n\nWell, we know that free and fair elections are the very wellspring of  American democracy. When you ask people around the world ``What is  great about America?'' this is one of the first things they say: ``They…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690523/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…Hitler, Mussolini, and  Saddam Hussein before him, Vladimir Putin should be called what he is:  a dictator.\n\nOver the past 20 years, Putin has systematically ended free and fair  elections, crushed independent media, quashed protests, and killed,  jailed, or exiled political opponents.\n\nThree years ago, Putin invaded Ukraine, showing complete disregard…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687989/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…Libyan Prime Minister, the group presented  solid evidence that a new Libya is in the making.\n\nThe new Libya is focused on creating circumstances that will make  free and fair elections a reality. The new Libya is taking concrete  steps to lessen long-standing tribal animosities that have divided the  country. The new Libya is committed to a unified country…", "date": "2025-12-05", "source_url": "https://justfacts.votesmart.org/public-statement/1697566/recognizing-the-importance-of-a-new-libya"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…gerrymandering schemes and by  restricting access to the ballot for millions of Americans. Five years  later, Donald Trump remains laser focused on sabotaging our free and  fair elections in the United States of America. This President has no  regard or respect for the Constitution. This President has no regard or  respect for the rule of law. This President…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698517/anniversary-of-january-6"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…this  never happens again.\n\nEarlier today, the leader of our caucus, Hakeem Jeffries, held a  special hearing to shed further light on the ongoing threats to free  and fair elections and the threats to public safety posed by some of  the violent criminals President Trump has let out of prison.\n\nThe threat to our democracy that we witnessed 5 years ago…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…the  voting rights of all citizens in this country but for his work as the  California Secretary of State, where he gained a nationwide reputation  for running free and fair elections.\n\nSenator Padilla, thank you so much for your work there, and thank you  so much for your leadership here.\n\nI want to stand here in solidarity with my colleagues to push…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…of President Trump's very first acts in office. It was an unmistakable  signal that his administration would be obsessed with suppressing votes  and undermining free and fair elections.\n\nAnd since that very first day in office, President Trump and his  administration have been praising and hiring into leadership positions  the very people who attempted…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…masked men. It will become clear to you  that Trump and Republicans want to control who votes so they can remain  in power.\n\nThat is not democracy. That is destroying free, fair elections. It is  just another page from the authoritarian playbook, and we must have the  moral clarity in this place to stand against it, just like our  ancestors did.\n\nMr. Speaker,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700017/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…is our dictatorship, serving us, the American corporations,  and the Trump administration, rather than the Venezuelan people.\n\nThe people of Venezuela deserve free and fair elections.\n\nAnd then let's talk about how this entire setup for this gunboat  diplomacy was based on a massive lie to the American people. The Trump  administration said: This is…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…this overwhelmingly bipartisan bill is necessary to  assist our law enforcement officers in combating fentanyl.\n\nMr. Speaker, I will transition to the issue of free and fair  elections and H.R. 884.\n\nIn 2022, Washington, D.C., enacted a dangerous law: the Local  Resident Voting Rights Amendment Act, D.C. Act 24-640, which allows  noncitizens, including…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…illegal. We don't need another law.\n\nMr. Speaker, it is already illegal for a minor to purchase alcohol.  Yet the clerk says: Please show me your ID.\n\nAmerica is hungry for fair elections. I don't think it is too much to  ask that we show an ID to restore election integrity. Let's give  America what they want.\n\nFor all those who say that it is too much to…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699999/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…will cut down on people's use of innovative money  transfer apps.\n\nAll four of these legislative items are steps in the right direction  to cut down on red tape, ensure fair elections, and restore the system  of checks and balances in our country.\n\nMr. GRIFFITH. Mr. Speaker, the gentlewoman apologized for the noises  on the floor. I love the noises and…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…pass it shortly. We can get this done  today and deliver for the American people.\n\nPassing the SAVE America Act is an essential step to our democracy,  ensuring free and fair elections nationwide. We must get it done.\n\n1383; further, that the Senate concur in  the House amendment, and that the motion to reconsider be made and laid  upon the table.\n\nMr.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700025/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…expansive bombing campaign  by the junta that has struck more than 1,000 civilian locations,  including Christian churches.\n\nWhile the military ruling class pledged open and fair elections, the  sham process that took place last month should be viewed as a rigged  farce and nothing more. Make no mistake, these mass atrocities will not  stop until the current…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699832/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…to ask your Representative where they stand  on this issue because it is a bipartisan issue, with over two-thirds of  this body having voted for it last year.\n\nFree and fair elections are a prerequisite for the healthy Republic  that our Founding Fathers envisioned in the District of Columbia as the  epicenter, and they entrusted its care to Congress…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692315/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…country once and for all.\n\nBy the way, I think that should go hand in hand with a requirement  for voter ID in elections across the country so that we can finally  have fair elections in the United States.\n\nThe reality is that Americans of all party affiliations are tired of  the political division that only seems to get worse and worse every  single…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…increase, trade ties between       Georgia and Russia;\n\n(6) to continue supporting the ongoing development of       democratic values in Georgia, including free and fair       elections, freedom of association, an independent and       accountable judiciary, an independent media, public-sector       transparency and accountability, the rule of law,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the lines for  legislative districts. Voters have empowered an independent citizens  redistricting commission to set the boundaries of representation so  that free and fair elections, not political manipulation, are the  motive force in our democracy.\n\nThis principle is so important and so vital to safeguarding democracy  that the citizens commission…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694777/protecting-representative-form-of-government"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…that were coming out of Venezuela. It was because of a lot of  things that this took place.\n\nDoes the President have a plan for the future? He does, 100 percent:  free and fair elections, freedom for the people of Venezuela. Ask the  people of Venezuela if that is what they want. Ask the people of  Venezuela if they are better today than they were before…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "Mr. CORNYN. Madam President, America is an exceptional nation:  freedom of religion, freedom of speech and of the press; private  property rights; free and fair elections; the rule of law and an  independent judiciary. All of these help make us exceptional, but we  Americans often take this for granted because these principles, these  values,…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}]