[{"senator": "Steve Cohen", "party": "Democrat", "sentence": "…Wednesday and will hold a press conference with the House  cosponsor Congressman Don Beyer and the Senate bill sponsor Ron Wyden.\n\nIt is an effort to establish a level of fairness in federal income  taxation and prevent millionaires and billionaires, and the aspiring  trillionaire, Elon Musk, from taking advantage of the tax code to pay  what, for them…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695551/introduction-of-the-billionaire-income-tax-act-and-noting-the-popes-concern-on-income-inequality"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…have fallen short; and at times, we have  failed to live up to our promise. But we have always eventually bent  the arc of our own national story towards justice, towards fairness,  and towards a more perfect Union.\n\nAnd yet from the moment he inflicted himself on our public life,  Donald Trump has done everything possible to reverse that progress.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700183/state-of-the-union-address"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…and women in uniform have traveled the  highways and byways of our state to ensure the safety of our  communities. They have lived up to their creed of honor, integrity,  fairness, excellence, courage, honesty, and devotion to duty.\n\nOn April 2, 1925 the Rhode Island General Assembly created the  ``Rhode Island Department of State Police.'' It was the…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692219/rhode-island-state-police-centenary"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…requirement for the Commanding General of the  D.C. National Guard will lead to a better relationship between the D.C.  National Guard and D.C. residents and is a matter of fairness for D.C.  residents.\n\nThe D.C. mayor should control the D.C. National Guard. Until then, I  urge my colleagues to support this bill.", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694307/introduction-of-the-district-of-columbia-national-guard-commanding-general-residency-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…protected from discrimination.\n\nAs the Supreme Court said in Edmonson v. Leesville Concrete Company,  ``discrimination within the courtroom raises serious questions as to  the fairness of the proceedings conducted there. . . . [B]ias mars the  integrity of the judicial system and prevents the idea of democratic  government from becoming a reality.'' Similarly,…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692690/introduction-of-the-district-of-columbia-local-juror-non-discrimination-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…considered to be more effective and secure than the systems in place  during previous elections, and it should help counter efforts--already  reportedly underway--to undermine the fairness of the electoral process  through legal and judicial maneuvers or to manufacture an excuse by  some to challenge the results of the election if their candidate loses.\n\nOn…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696472/honduras"}, {"senator": "Diana DeGette", "party": "Democrat", "sentence": "…and voice of  reason. He gave us advice, set an example through his work, and showed  us what it meant to fight for people who needed a strong advocate.\n\nHis dedication to fairness and justice had a lasting impact on  generations of trial lawyers. I am proud to have known Jerry and to  call him my friend.\n\nColorado's legal community mourns the loss of…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690315/in-remembrance-of-gerald-p-mcdermott"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…education sectors--      public, private, and charter--and this approach is working.       We will not support changes that tip the scales away from       this core principle of fairness for DC families. As the       fastest improving urban school system, DC has become a model       for urban education. We outpace the national average on all       tested subject…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696979/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…is why we have to be here fighting for them. That is why we  have to be here, raising the alarm about what is happening in this bill  with Medicaid.\n\nWhat Americans want is fairness. What they need is fairness. We owe  them that. They want and need affordable healthcare, and we owe them  that. They want and need a fair shot, a better life for their kids,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691416/gop-tax-scam-hurts-everyone"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…25  years of distinguished service on the bench, including more than a  decade on the Washington State Supreme Court. Her tenure is marked by  an unwavering commitment to fairness, dignity, and equity for all. She  is a trailblazer, a champion for justice and a visionary leader in  Washington's legal community.\n\nAs the first Asian American, the first…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697901/recognizing-the-contributions-of-mary-yu"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…possible again.\n\nThat is what House Democrats are fighting for, not an economy built  around pay-to-play politics or shady closed-door deals but one built  around dignity, fairness, and that simple idea that the American Dream  should be within reach for everyone, not just the well-connected.", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699585/stop-the-republican-affordability-crisis"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…they stood up for equality and dignity by  fighting against the discriminatory  Proposition 8. Indeed, they lent their voices and resources to  countless causes rooted in fairness and opportunity for all.\n\nCivically, Rob and Michele were fierce champions of the First  Amendment and the creative rights of artists, never wavering in their  belief that…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698360/rob-and-michele-reiner-tribute"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…reflecting the same support and compassion he consistently  showed others.\n\nLieutenant Swandrak is foundational to the fabric of Cranford, and he  is leaving a legacy of service, fairness, and true community  partnership for all of New Jersey to follow.\n\nOn behalf of the New Jersey 10th District, I congratulate Lieutenant  Swandrak on a job well done.", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699515/congratulating-lieutenant-john-swandrak"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Athletic associations and the service academies are better prepared  to understand the sports that they regulate and how to provide both  respect for transgender people and fairness in sports. These  associations and academies should be addressing this issue, not  politicians, especially politicians who do not understand that trans  people are not men…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695232/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…would streamline that  process while maintaining environmental safeguards under existing land  management plans and Federal law.\n\nImportantly, the bill would ensure taxpayer fairness. If utilities  sell any of the removed material, they must return the net proceeds to  the Federal Government. Altogether, this bill provides a commonsense,  bipartisan solution…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691067/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…22 years as the  senior resident superior court judge for the 24th Judicial District in  North Carolina. Throughout his tenure, he upheld the rule of law with  wisdom, with fairness, and with integrity.\n\nJudge Ginn's influence extended far beyond the courtroom, where he  not only delivered legal rulings but also mentored those around him,  always striving…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688470/recognizing-phil-ginn"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…Oversight Improvements Act.\n\nMr. Speaker, for far too long, manufacturers in Ohio and across the  Nation have had to compete on an unfair playing field. This bill  restores fairness for American producers by cracking down on the import  of counterfeit and dangerous gas cylinders into the United States.\n\nMy bill also holds foreign manufacturers to the…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692180/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…to them. We are honoring  promises, Mr. Speaker.\n\nFinally, we have brought transparency and common sense back to our  institutions, dismantling DEI mandates, and restoring fairness, merit,  and basic common sense. We have begun to make America healthy again by  examining finally what is in our food supply, empowering patients,  expanding health savings…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Montgomery GI Bill Selected       Reserves Tuition Fairness Act of 2025''.       SEC. 2. DEPARTMENT OF VETERANS AFFAIRS DISAPPROVAL OF COURSES                     OFFERED BY PUBLIC INSTITUTIONS OF HIGHER                     LEARNING…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689695/montgomery-gi-bill-selected-reserves-tuition-fairness-act-of-2025"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…is a basketball-crazed  Commonwealth, and we care about the shot clock. Congress should care  about the shot clock on merger applications, as well.\n\nMy bill would restore fairness and predictability, preventing delays  and giving banks the stability they need to focus on serving their  customers and growing their businesses.\n\nThe Bank Failure Prevention…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…MILLER-MEEKS. Mr. Speaker, I should be standing here today  celebrating the Senate's passage of the Protection of Women and Girls  in Sports Act, a bill that simply ensures fairness and common sense in  athletics. Instead, Senate Democrats made their priorities clear. Mr.  Speaker, 45 Senate Democrats voted against protecting women's sports,  45 Senate…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688462/america-deserves-president-trump"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…which will transcend  generations. The Lumbee have fought tirelessly for decades to achieve  full recognition by the U.S. Congress. Today, that day has arrived.\n\nThe Lumbee Fairness Act, which I offered as an amendment to the  National Defense Authorization Act, will soon head to the President's  desk, as part of the annual defense bill, for his signature,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698409/federal-recognition-for-lumbee-tribe"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…watch the House floor--I do not remember a  single incident, a single time in my 7 years of being in the United  States House of Representatives, not once have I seen it. In fairness,  I might have missed one. Maybe somebody will find it in the Record. I  have been down here countless times when it is an attack on law  enforcement, countless times when…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Electronic Filing and       Payment Fairness Act''.       SEC. 2. APPLICATION OF MAILBOX RULE TO DOCUMENTS AND PAYMENTS                     ELECTRONICALLY SUBMITTED TO THE INTERNAL                     REVENUE SERVICE.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689373/electronic-filing-and-payment-fairness-act"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…``(iii) mentoring and coaching employees and improving       employee engagement, performance, and productivity;\n\n``(iv) fostering a work environment characterized by       fairness, respect, equal opportunity, and attention paid to       the merit of the work of employees;\n\n``(v) effectively managing employees with unacceptable       performance, including…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698216/federal-supervisor-education-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…participants, not to advance radical political initiatives, not  to appease advocacy groups, and not to satisfy trends in the corporate  boardrooms.\n\nIn addition, the bill strengthens fairness and nondiscrimination in  the selection of service providers. It states clearly that race, color,  religion, sex, or national origin may not be considered when selecting…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…integrity,  with patience, and an unwavering commitment to justice as a justice of  the peace and as a magistrate judge. His courtroom has been a place not  only of law but of fairness and respect for all who appeared before  him.\n\nBeyond the bench, Judge Fender was an educator who shaped minds with  the same care and wisdom he brought to the law. His influence…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699709/retirement-of-judge-ronnie-fender"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…action. A one-sided  policy of unchecked expansion is not the answer.\n\nGray wolf populations have recovered. Now it is time to ask whether  our current path reflects balance, fairness, and common sense for rural  America. As everyone in rural America knows, particularly in Washington  State, if there were wolves in Bainbridge Island or in the suburbs of…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697671/support-for-rural-schools"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…careful documentation and verification,  including proof of Native American ancestry.\n\nBypassing this process, as is suggested through this NDAA, by  including the Lumbee Fairness Act as an amendment, sets a dangerous  precedent. It would invite other groups with unsubstantiated claims to  sidestep this process and seek recognition through political…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697785/ensuring-fairness-and-integrity-in-federal-tribal-recognition"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…that is an effort--any effort--that would seek to annex  Greenland, whether it is taking it by force, taking it by coercion,  taking it by pressure or threat, or, really, in fairness, any related  method. It is not an issue that I would have ever expected to raise  here on the floor of the Senate.\n\nIn my time here in the Senate, over the past two decades,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}]