[{"senator": "Pat Fallon", "party": "Republican", "sentence": "…Mr. Speaker, I rise today to recognize Mr. Ralph O'Dell  of Celina, Texas, and present him with the Congressional Patriot Award.  Ralph has dedicated himself to faithfully serving our community and  country.\n\nRalph is a veteran of the Second World War and served with the United  States Army from 1943 to 1946. He participated in the South Pacific  campaign,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690225/recognizing-congressional-patriot-award-recipient-ralph-odell"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Speaker, I rise today to recognize Dr. Walter Eugene  Hunter of Celina, Texas, and present him with the Congressional Patriot  Award. Walter has dedicated himself to faithfully serving our community  and country.\n\nAs a young man, Walter was a decorated Boy Scout and Cub Scout leader  and worked as a messenger boy for Western Union. During the Second  World…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690722/recognizing-congressional-patriot-award-recipient-walter-hunter"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…today to recognize Mrs. Elizabeth  ``Beth'' Terrell of Burr Ridge, Illinois, and present her with the  Congressional Patriot Award. Beth has dedicated herself to faithfully  serving our community and country.\n\nA native of Lake Forest, Illinois, Beth attended Saint Mary's College  in Notre Dame and graduated in 1989 with a bachelor's degree in  communication.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694169/recognizing-congressional-patriot-award-recipient-beth-terrell"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…rise today to recognize Mr. Patrick  ``Pat'' Terrell of Burr Ridge, Illinois, and present him with the  Congressional Patriot Award. Pat has dedicated himself to faithfully  serving our community and country.\n\nAfter receiving over forty Division I scholarship offers, Pat  ultimately decided to play football at the University of Notre Dame as  a member…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694136/recognizing-congressional-patriot-award-recipient-pat-terrell"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Mr. Speaker, I rise today to recognize Mr. Mark Metdker  of Celina, Texas, and present him with the Congressional Patriot Award.  Mark has dedicated himself to faithfully serving our community.\n\nA native of Dallas, Mark graduated from Lewisville High School in  1975 as a star football and track athlete. He began his career working  for the McKinney Fire…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690240/recognizing-congressional-patriot-award-recipient-mark-metdker"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…FALLON. Mr. Speaker, I rise today to recognize Mr. Nate Pike of  Prosper, Texas, and present him with the Congressional Patriot Award.  Nate has dedicated himself to faithfully serving our community.\n\nA native of Denison, Texas, Nate attended Denison High School and  graduated from Baylor University in 2003 with his Bachelor of Business  Administration. He…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690209/recognizing-congressional-patriot-award-recipient-nate-pike"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…to recognize and celebrate Mr.  Gary Singleton of Bowie County, Texas, and to present him with the  Congressional Patriot Award. Gary has dedicated his life to faithfully  serving his community and country.\n\nBorn in Texarkana, Texas, Gary attended school in the Texarkana and  Liberty-Eylau districts before pursuing higher education at Texarkana  College,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696861/recognizing-congressional-patriot-award-recipient-gary-singleton"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…rise today to recognize Ms. Catherine  ``Trinka'' Taylor of Dallas, Texas and present her with the  Congressional Patriot Award. Trinka has dedicated herself to faithfully  serving our community.\n\nA sixth-generation Texan, Trinka was born in Dallas, Texas, and grew  up in Houston. She attended Rice University before transferring to the  prestigious Cornell…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690291/recognizing-congressional-patriot-award-recipient-catherine-trinka-taylor"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Speaker, I rise today to recognize Mr. Corbett Howard  of Celina, Texas, and present him with the Congressional Patriot Award.  Corbett has dedicated himself to faithfully serving our community.\n\nCorbett was born in Roswell, New Mexico. He received his Bachelor of  Arts in History and Political Science from Southern Nazarene University  and graduated…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690167/recognizing-congressional-patriot-award-recipient-corbett-howard"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Speaker, I rise today to recognize Ms. Carmen Roberts  of Celina, Texas, and present her with the Congressional Patriot Award.  Carmen has dedicated herself to faithfully serving our community.\n\nCarmen was born in Chihuahua, Mexico, and immigrated to the United  States at a young age. She attended school in Rosemead, California, and  became a naturalized…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690747/recognizing-congressional-patriot-award-recipient-carmen-roberts"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…rise today to recognize Mr. John  ``Johnny'' Rothfus of Prosper, Texas, and present him with the  Congressional Patriot Award. Johnny has dedicated himself to faithfully  serving our community and country.\n\nJohnny was born in Sachse, Texas, and moved with his family to  Prosper at a young age. In 1943, he graduated high school and joined  the United…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690292/recognizing-congressional-patriot-award-recipient-john-johnny-rothfus"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…rise today to recognize Pastor lsiah  Moore, Jr., of Celina, Texas, and present him with the Congressional  Patriot Award. Pastor Moore has dedicated himself to faithfully serving  our community and country.\n\nBorn in Shreveport, Louisiana, Pastor Moore attended Booker T.  Washington High School and joined the United States Navy after  graduation. He was…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690155/recognizing-congressional-patriot-award-recipient-pastor-isiah-moore-jr"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…today to recognize and celebrate Mr.  Steve Ledwell of Texarkana, Texas, and to present him with the  Congressional Patriot Award. Steve has dedicated his life to faithfully  serving his community and country.\n\nBorn and raised in Texarkana, Steve has spent his life building up  others and strengthening his community. From a very young age, he has  always…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696827/recognizing-congressional-patriot-award-recipient-steve-ledwell"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…today to recognize and celebrate Mr.  Dennis Lewis of Texarkana, Texas, and to present him with the  Congressional Patriot Award. Dennis has dedicated his life to  faithfully serving his community and country.\n\nBorn in Texarkana, Texas, Dennis attended Maud High School,  graduating in 1970, before pursuing higher education at United  Electronics Institute,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696848/recognizing-congressional-patriot-award-recipient-dennis-lewis"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…to recognize and celebrate Mrs.  Lisa Singleton of Bowie County, Texas, and to present her with the  Congressional Patriot Award. Lisa has dedicated her life to faithfully  serving her community and country.\n\nBorn in Hope, Arkansas, Lisa attended Hope High School, graduating in  1986, and later completed office vocational courses at Texarkana  College.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696870/recognizing-congressional-patriot-award-recipient-lisa-singleton"}]