[{"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…beginnings. Founded in 1918 in  the basement of a building under construction on Twelfth Street, just  eleven devoted charter members came together, united by a vision of  faith and service. Their commitment and love for their community  sparked growth, soon reaching 23 members. As the neighborhood around  them evolved, so did the church, embracing change…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691231/congratulating-reverend-lydie-ngoie-and-the-members-of-trinity-faith-united-methodist-church-on-35-years-of-worship-and-leadership"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "Mr. BOOKER. Mr. President, New Jersey is home to one of our Nation's  most vibrant Greek Orthodox communities. For generations, it has  nurtured a community rooted in faith and service--values that continue  to strengthen the fabric of not just our shared home but of American  society.\n\nThis month, our Nation's Capital welcomed His All-Holiness Ecumenical…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695894/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…centennial milestone of Geraldine ``Bubby''  Litvin Shaffer, who celebrates her 100th birthday on October 28, 2025.\n\nBorn in 1925, Geraldine has lived a life centered on faith, service,  and love for her family. Together with her beloved husband, Louis  Shlomo Leib Litvin, she raised five children, and today, she is the  proud grandmother to over 100…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696117/congratulating-geraldine-bubby-litvin-shaffer-on-her-100th-birthday"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…recognize and  celebrate Bethel Temple Church in Hampton, Virginia, on the occasion of  its 70th anniversary. For seven decades, Bethel Temple has been a  steadfast pillar of faith, service, and fellowship in the Hampton  community.\n\nIn the early 1950s, Reverend Beverly W. Fox, then pastor of Phoebus  Assembly of God, led efforts to build a new house of worship.…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696401/recognizing-the-70th-anniversary-of-bethel-temple-church-in-hampton-virginia"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "Mr. BISHOP. Mr. Speaker, I rise today with profound sorrow but also  with deep gratitude to pay tribute to a man whose life was a testament  to faith, service, and love--Sheriff John Bowens of Terrell County,  Georgia. A funeral service to celebrate his remarkable and purposeful  life was held on Saturday, February 7, 2026, in…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699826/in-memory-of-sheriff-john-bowens"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Merrifield on the occasion of the 155th anniversary of its  sanctuary. For more than a century and a half, First Baptist Church of  Merrifield has served as a cornerstone of faith, service, and community  for the Northern Virginia region. First Baptist Church of Merrifield  was started in a log cabin between 1871 to 1872. FBCM had then branched  out and began…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696034/recognizing-the-first-baptist-church-of-merrifield-on-their-155th-anniversary"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…the  country in welcoming His All-Holiness to the United States and to  Congress. His visit is a point of pride for many Arizonans and a  reminder of the shared values of faith, service, and community that  strengthen our country.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695659/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Virginia, a vibrant and  faithful community that stands as a testament to the Orthodox  tradition's rich history and enduring presence in America. Their  commitment to faith, service, and fellowship reflects the very values  His All-Holiness has championed throughout his ministry.\n\nOn behalf of the 4th Congressional District of Virginia, I welcome…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696208/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…Archbishop Desmond Tutu.\n\nAs the longest-serving Archbishop of Constantinople in over two  millennia, All-Holiness Ecumenical Patriarch Bartholomew embodies the  values of faith, service, and moral leadership. His life's work is a  testament to the power of courage, compassion, and conviction, and I am  honored to welcome him to our country.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695395/welcoming-the-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…better.\n\nDoug was more than a colleague. He was a friend. He was a brother.  His leadership, his wisdom, and his heart for service will be deeply  missed. Doug's legacy of faith and service and love endures.\n\nLord, accept this gentle giant, this dedicated giant, Doug LaMalfa.  May his family have the goodwill to know that he lies in your comfort.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698721/9999"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…First Baptist Church of Roanoke's 150th Anniversary\n\nMr. CLINE. Mr. Speaker, I rise today to honor the 150th anniversary  of First Baptist Church of Roanoke, a beacon of faith, service, and  resilience, since its founding as Big Lick Baptist Church on May 16,  1875.\n\nFrom just 20 charter members in a small village, this church has  grown alongside the…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691575/recognizing-the-75th-anniversary-of-james-wood-high-school"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "Mr. EZELL. Mr. Speaker, I rise today to recognize a remarkable  milestone for a cornerstone of faith and service in south Mississippi.\n\nThis year marks the 35th anniversary of Abundant Life Evangelistic  Church in Biloxi, Mississippi. For more than three decades, this church  has…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695571/recognizing-abundant-life-evangelistic-church-in-biloxi-mississippi"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…and to his generation that can never be  repaid.\n\nBorn and raised in Pensacola, FL, Mr. Brewton returned home after the  war. He raised a family and devoted his life to faith, service, and  community.\n\nA devout Christian, he lived his values daily and by example. His  daughters recall that throughout their childhood, their father rose  every single morning…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700061/9999"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…and his wife,  Lynn, have been married for over 40 years and have raised four  daughters, three sons-in-law, and five grandchildren, imparting to them  the same values of faith, service, and community that have helped shape  his life and legacy.\n\nAbove all of his many accomplishments, it is Judge Ginn's unwavering  faith in the Lord Jesus Christ that has…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688470/recognizing-phil-ginn"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Founding CEO, Charles L. Bender, III, the dedicated  staff, volunteers, and supporters who have all made this milestone  possible. Their work exemplifies the power of faith and service in  changing lives. May they have an even greater impact on our  communities' families in the years to come.\n\nMr. Speaker, I ask my colleagues to join me in congratulating…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694742/recognizing-place-of-hope"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…during that time.\n\nMr. Speaker, I rise today to honor the life and legacy of Judy  Jurgensen Melroy.\n\nA native of Savannah, Georgia, Mrs. Melroy lived a life defined by  faith, service, and love for others. Her passion for learning led her  to become a teacher, where she inspired countless young people and  passed on her joy for education to future generations.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695205/people-are-sick-and-tired"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Honoring the Life of Joseph Rylon Wills, Jr.\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to honor the life of  Mr. Joseph Rylon Wills, Jr., a man of faith, service, and dedication.\n\nBorn in 1957 in Plant City, Florida, Joe was raised by his loving  parents, Rylon and Gail. He was active in church and sports,  demonstrating a commitment…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…City challenges us to  use our active faith to lead by example and invest in our communities,  not just with words, but with action.\n\nThis is what makes east Texas strong: faith, service, and a deep love  for God and for others. I am proud to honor this effort today and to  recognize all those who give their time to love their neighbor.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693760/love-thy-city-initiative"}]