[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…recognize and  celebrate Bethel Temple Church in Hampton, Virginia, on the occasion of  its 70th anniversary. For seven decades, Bethel Temple has been a  steadfast pillar of faith, service, and fellowship in the Hampton  community.\n\nIn the early 1950s, Reverend Beverly W. Fox, then pastor of Phoebus  Assembly of God, led efforts to build a new house…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696401/recognizing-the-70th-anniversary-of-bethel-temple-church-in-hampton-virginia"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…build trust with Haitian families, often       in their own language, often through community       relationships, and always with deep respect for history,       culture, and faith. Over time, we have watched individuals       begin to heal. Parents who survived political violence,       natural disasters, and forced migration finally started to…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…see this happen to their neighbors; and  local mayors and farmers and small businesses; Democrats, Republicans,  people who aren't political at all; law enforcement officers, faith  leaders, Second Amendment supporters, and civil libertarians.\n\nAnd there is the man in the truck that I saw when I was in  Minneapolis, taking groceries to people on Monday.…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…community and our communities have been safe, to stand up and fight for  the people of the city of Chicago, a city that my colleague does not  really understand the kind of faith that they have in Chuy Garcia all  of these years.\n\nFor someone who doesn't know about the city of Chicago and the role  that he has played and to find some outside idea that…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696779/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…incentives to offer more  affordable loans that borrowers have an ability to repay. The same  incentives should apply across the Nation.\n\nI thank the 176 consumer advocacy groups, faith-based organizations,  veteran service organizations, and trade associations that support this  bill, including the Consumer Federation of America, the National  Consumer Law…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699782/9999"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…city and champion unity across  diverse Jewish organizations.\n\nIt is an honor to recognize Monica Gurell during Jewish American  Heritage Month. Her unwavering dedication to faith, education, and  community has enriched the lives of countless others and continues to  serve as a beacon of strength.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691572/recognizing-monica-gurell"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Councilman Hutchins has always reached  back to help others to reach their full potential.\n\nBeyond his public work, Al Hutchins is a devoted family man and  active member of his faith community. He and his wife, Alice Hutchins,  are parents to Machelle (Joyce) Hutchins, Allison (Andrea) Harrison,  and Tre Hutchins, and proud grandparents of TiGeronika Lindsey,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698107/recognizing-the-honorable-al-hutchins"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…for the U.S. Coast  Guard through 2029, updates and restructures Coast Guard programs and  policies, and supports the commercial maritime industry. It is the  result of good faith, bipartisan negotiations between Chair Graves and  Chair Ezell, myself, and Ranking Member Carbajal, and it includes  important contributions from members on and off the committee.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694197/coast-guard-authorization-act-of-2025"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…as well  as the full terms of whatever agreement the Trump administration has  negotiated with El Salvador's dictator.\n\nBut it doesn't stop there. We need to see clear, good-faith efforts  to abide by court orders and to bring back everyone wrongfully,  unjustly sent to a foreign prison. We need to have lines of  communication so these people can talk…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Seth Moulton", "party": "Democrat", "sentence": "…Orthodoxy, religious freedom  globally, and constructive dialogue among faiths.\n\nBorn on the island of Imvros, the Ecumenical Patriarch has spent his  life in service to both faith and humanity. He is internationally  recognized for his efforts to protect the environment--earning the  nickname ``the Green Patriarch''--as well as for his work in advancing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695352/welcoming-his-all-holiness-bartholomew-to-washington-dc"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…amending the resource management plan, doing  the hard work required in the agency to perform the consultations  necessary to then change the RMP, if folks have concerns, good faith  concerns about the contours of that resource management plan, that is  the way to do it.\n\nInstead, my colleagues have chosen to use the Congressional Review  Act, a very blunt…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694899/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…missteps;\n\nWhereas, he has worked to guide the Orthodox Christian       Church in an environmentally conscious and Godly way, helping       to develop a strong community of faith, and has presided over       events including the 150th anniversary of the Theological       School of Halki and the 500th anniversary of the Greek       Orthodox Community…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694760/recognizing-his-all-holiness-ecumenical-patriarch-bartholomew-i-archbishop-of-constantinople-new-rome"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…Bartholomew is being honored as the  recipient of the Templeton Prize. This prestigious international a yard  recognizes his scholarly contributions in exploring the intersection of  faith and the natural world. Past recipients include Mother Teresa and  the Dalai Lama.\n\nIn 1997, he was awarded the Congressional Gold Medal in recognition  of his contributions…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695506/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…deepest condolences to his family and all  those who mourn his loss during this difficult time of bereavement. I  pray that they will be consoled and comforted by an abiding faith and  the Holy Spirit in the days, weeks, and months ahead.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691304/in-memory-of-the-honorable-curtis-parham-cp-redding-sr"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…choices are  real. They are real for these families, and sometimes they have tragic  consequences.\n\nSince the beginning of this year, Democrats have been trying to work  in good faith with Washington Republicans to extend these ACA enhanced  premium tax credits and protect Americans' healthcare coverage. We have  even introduced bills to extend the tax credits.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695919/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…American Diabetes Association. Her most cherished accomplishment is  raising a wonderful family with  seven children, all of whom were instilled with the values of  compassion, faith, and kindness. I'm pleased to recognize Beth today  for her important contributions to our community, and I wish her  continued success.\n\nIt is an honor to bestow Beth with…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694169/recognizing-congressional-patriot-award-recipient-beth-terrell"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…Innocent people should not be harmed when we are  pursuing justice.\n\nI understand the political nature of this petition. I resent the fact  that there was not room for good faith amendments, and I urge the  Senate to protect innocent people.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696815/epstein-files-transparency-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…leaders like Franklin Roosevelt reminded the  American people that despair is never destiny. Let me repeat that.  Despair is never destiny. He told them that courage, unity, and faith  could rebuild an entire nation from the brink of ruin.\n\nMr. Speaker, today the Iranian people are living through their own  era of hardship--economic collapse, political oppression,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…Hanks, Jennifer Brant, and Stephen  Lewerenz; nine grandchildren and three great-grandchildren. He will be  remembered as a patriot, mentor, and friend whose legacy of service,  faith, and love continues to inspire those who knew him.\n\nMr. Speaker, it is an honor to recognize Alfred Thomas Lewerenz for  his lifetime of service to Florida and to our Nation.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697024/recognizing-alfred-thomas-lewerenz"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Advocate to  trust that the legal advice that she receives is without any undue  influence from the IRS. It certainly undermines the ability of the  American taxpayer to have faith that the National Taxpayer Advocate's  service is adhering to its mission.\n\nThe National Taxpayer Advocate Enhancement Act gives the NTA the  authority to hire her own lawyers,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689378/national-taxpayer-advocate-enhancement-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…conservatives that now sing a populist tune know deep down  that their advocacy of higher taxes will cause suffering for the  American family. The converts to this protectionist faith cannot help  but acknowledge that even they know that the tariffs will raise prices.  They admit it readily. The tariffs that they put on in 2019 are still  punishing the farmers…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…communities with hope.\n\nMr. Speaker, as we observe National Volunteer Month, I encourage each  of us to find new ways to give back.\n\nWhether through a local nonprofit, a school, a faith-based group, or  a simple act of kindness in our daily lives, we all have something  valuable to contribute. Let us celebrate those who give their time and  let us recommit…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689399/national-volunteer-month"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…commit  crimes who are citizens. That discrepancy enables hordes of illegal  immigrants to come from around the world to harm Americans.\n\nAgain, I repeat, Mr. Raskin, in good faith and with sound logic,  talked about robbery. He talked about property crimes. He talked about  rape and murder. Some of these people have been convicted of rape,  murder, property…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…keeping programs running.\n\nThis is not a partisan issue. It is a promise to rural America. Let's  reauthorize the Secure Rural Schools Reauthorization Act of 2025 and  keep faith with the communities that steward our national forests.             Recognizing Environmental Stewardship in Our Forests\n\nMr. BAUMGARTNER. Mr. Speaker, I rise today to support…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697671/support-for-rural-schools"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…BAUMGARTNER. Mr. Speaker, I rise today to honor the life of Roger  Reed, a man whose legacy is defined not only by his distinguished legal  career but his deep love of family, history, faith, and Cougar  football.\n\nBorn in Portland in 1939 and raised in Wenatchee and Spokane, Roger  was a lifelong learner with a passion for the law.\n\nAfter graduating from Washington…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695071/operation-rolling-thunder"}, {"senator": "Victoria Spartz", "party": "Republican", "sentence": "…stated ``Under the Fourth Amendment of the U.S.  Constitution, a police officer may use deadly force to prevent the  escape of a fleeing suspect only if the officer has a good-faith belief  that the suspect poses a significant threat of death or serious  physical injury to the officer or others.''\n\nDuring his time with the Sheriff's Department, Deputy…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689236/recognizing-deputy-jeff-larkin"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…also help maintain low domestic  natural gas prices for Americans.\n\nThe Biden-Harris administration's action not only jeopardized our  European allies but it threatened the faith and credibility of American  companies' contracts. It emboldened Russia and other nefarious actors  and created uncertainty for domestic producers of natural gas.\n\nH.R. 1949,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697089/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…stringing the President of the United States and the  rest of the world along while innocent lives are being taken.\n\nIn order to achieve peace, President Trump needs a good-faith partner  both in Ukrainian President Zelenskyy and Russian President Putin.  Notably, while Zelenskyy has met with the President several times, most  recently at the Vatican,…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…persevered through frontier hardships, local feuds, floods, and  economic trials. Over the years, it has grown into a vibrant  congregation rooted in service, tradition, and faith.\n\nThe sanctuary itself, built of native limestone in the Victorian  Gothic style, is a testament to the perseverance of its early leaders,  including Capt. A.H. Barnes, Dr.…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696051/recognizing-the-150th-anniversary-of-st-marys-episcopal-church-in-lampasas-texas"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…the community who sought to live in  peace and  rebuild from war. They were members of our community who had endured  unimaginable suffering and faced an uncertain future with faith and  hope.\n\nIn the shadow of relentless terror and violence, it takes enormous  courage to do many of the things that we take for granted. We can take  inspiration from those…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693108/facing-down-perpetrators-of-destruction"}]