[{"senator": "Al Green", "party": "Democrat", "sentence": "…for the Execution  of Members of Congress.\n\nIn his conduct of the office of President of the United States,  Donald John Trump, in violation of his constitutional oath to  faithfully execute the office of the President of the United States  and, to the best of his ability, preserve, protect, and defend the  Constitution of the United States, and in violation…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697872/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…is, honor the life of our  colleague, a life well lived, a Member of the House of Representatives  who did such a good job on behalf of his constituents who he  represented faithfully since coming to Congress in 2013.\n\nDoug and I knew each other before then. We had interactions on a  number of issues that we were mutually passionate about beginning with…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698716/9999"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…made his home for the  past decade.\n\nCorey was a devoted man of faith, a lifelong member of Rodman Street  Missionary Baptist Church in Pittsburgh, Pennsylvania, where he  faithfully served as a Trustee. His love for God and church was a  guiding force throughout his life. Family was at the heart of Corey's  world. He cherished his grandmother, the late…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697070/recognizing-the-life-of-corey-lee-sidney"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…cuts would be carried out by Robert F. Kennedy, Jr., one of the  most unqualified individuals that we have seen to hold that position.\n\nSecretary Kennedy took an oath to faithfully discharge the duties of  the office in which he was about to enter, and to this point, he has  utterly failed and is making Americans sicker.\n\nLook at what he has done in…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691450/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…Musk plays at DOGE and the rules it follows and  under what authority.\n\nHow can we, as lawmakers, fund the government and trust that our  instructions written into law are faithfully executed?\n\nHow can we make informed decisions that directly affect the lives of  millions of Americans who rely on these services?\n\nWe are being left in the dark without…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688338/stopping-appropriation-work"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…books--none--that allows a President to  commandeer State election systems--no emergency power, no implied  authority, no ``because I just say so.'' The President's role is to  faithfully execute the laws, not to rewrite the Constitution when the  facts or the voters displease him.\n\nYet here we are. Donald Trump's dangerous threat rests on a familiar  and…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700022/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…working diligently, day in  and day out, to ensure that our learning environments remain clean,  safe, and welcoming. They are often the first to arrive and the last to  leave, faithfully fulfilling their duties with dedication and pride.  National Custodian Day was first established in 1972, when a group of  educators and school administrators recognized…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697118/recognizing-national-custodian-appreciation-day"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…prosecutors,       special agents, and intelligence analysts to immigration       judges, grant managers, civil rights attorneys and more, we       all carried out our duties faithfully, regardless of who       occupied the White House. Until we no longer could.\n\nEach of us left the Department, either voluntarily or       involuntarily, because of actions…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…does and does not do.  The full-year CR is a law that sets funding levels for the full year.  The President and executive branch have a legal and constitutional duty  to faithfully execute the CR. The CR does not change the underlying law  making the Trump administration's impoundments and mass firings  illegal. This is true as a matter of law.\n\nNothing…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688900/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…best.\n\nShe has devoted her life to serving our country, and she has done so  at every level of the Federal Judiciary. At every turn, she has upheld  the Constitution and faithfully followed the rule of law. She is  impartial, thoughtful, and even-handed, evaluating every case from, in  her words, a ``neutral posture.''\n\nSince her confirmation, Justice…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689666/justice-ketanji-brown-jackson"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…personal Savior and was baptized at Antioch Missionary Baptist Church  under Pastor R.B. Smith. Under the pastoral leadership of Reverend  George Daniels, he exercised his gifts faithfully--serving as church  clerk, armor-bearer, organizer of the first Pastor's Aide Board, leader  in the music ministry, and deacon board member--early signs of a  servant's heart…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…White House and the so-called Department of War  appear determined to undermine, discredit, and even erase the evidence  of Black patriotism and Black servicemembers who have faithfully served  our Nation.\n\nAgainst this backdrop, we must remain vigilant against these attacks  on Black servicemen and veterans, recognize their valor and sacrifice,  and work…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…knows--maybe there  will be a third imaginary stop work order that drops. But in an  environment like that, where the executive branch refuses its  constitutional duty to faithfully execute the laws, it doesn't make any  sense for us to continue negotiations on a major bipartisan bill.\n\nI want to say, in particular, that Chair Capito has been helpful,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…appropriations laws, laws  that this Congress passed and the President signed, a far cry from the  constitutional imperative that the President ``shall take care that the  laws be faithfully executed,'' so says Article II.\n\nIf the President wants to spend differently than the law dictates,  the Constitution provides him with a couple of options.\n\nFirst, he can…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691336/pocca"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…transparency  requirements so that Congress can better track the use of funds and  ensure that they are being spent as intended.\n\nJust last week, Secretary Rubio committed to faithfully implementing  this bill, and now it is on all of us to work together to make that  true. There will be a lot more work to do in the months and years ahead  to rebuild American…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…years,\n\nThe adults' heartfelt davening (praying) with painful       groaning\n\nOf weighing memories while searching for the light,\n\nGratefully feeling still the loving hands faithfully\n\nPlaced on my curly head by proud Grandpa Zvi,\n\nSon of martyred Rabbi Yaacov and Dena of Zamosc,\n\nWith radiant grandma Rachel smilingly approving,\n\nReassuring their first…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699495/recognizing-remarks-of-rabbi-dr-israel-zoberman"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…Base, Germany. Mr. Woodward subsequently returned to the United  States where he took the position of Director of Public Affairs for the  82nd Training Wing, where he has faithfully served the outstanding men  and women at Sheppard Air Force Base.\n\nAt Sheppard, Mr. Woodward diligently supervised eighteen employees  who delivered clear and well-informed…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693070/recognizing-the-career-of-mr-george-woodward"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…Commerce, as well as earlier work as a newspaper reporter  and managing editor--experiences that helped shape his understanding of  the community he would go on to serve so faithfully.\n\nMr. Greer's influence can be seen through his involvement with  numerous civic and community organizations. He has served as a founding  member of the Board of Directors…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699608/recognizing-mr-dale-greer"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…these are illegal actions when we simply agree or  disagree with the actions of the President and in many cases the Court  finds the President is well within his rights in faithfully executing  his obligations.\n\nMr. ISSA.\n\nMr. ISSA. Mr. Speaker, as I close, since the ranking member so aptly  named a couple of famous quotes and famous movies, I might call…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…FALLON. Mr. Speaker, I rise today to recognize Ms. Carmen Roberts  of Celina, Texas, and present her with the Congressional Patriot Award.  Carmen has dedicated herself to faithfully serving our community.\n\nCarmen was born in Chihuahua, Mexico, and immigrated to the United  States at a young age. She attended school in Rosemead, California, and  became…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690747/recognizing-congressional-patriot-award-recipient-carmen-roberts"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…enough to have a brother who served  in the Marines in World War II. I have had a grandson in the Marines in  the last 10 years.\n\nFor the last 250 years, the Marine Corps has faithfully defended our  Nation with a distinct fighting spirit, and I am confident that the  Marines will continue to do that.\n\nThank you to our dedicated marines and thank you to…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696569/veterans-day"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…elect a President to do that.\n\nThe President directs the workforce of the executive branch so he can  fulfill his constitutional duty to ensure the laws of the land are  faithfully executed.\n\nWhen President Trump ran for office last year, he told the American  public that if--if elected, he would return Federal employees to their  offices, reform the…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…employees. They work for the people, who,  in turn, have selected Donald Trump to exercise the executive powers of  the government and charged him to take care that the laws be faithfully  executed. He can't do that if he can't open the books, look at where  the money is spent, and determine whether it is being spent efficiently  and in accordance with the…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688585/yosemite-belongs-to-the-people"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to recognize an  outstanding constituent of my district, Larry Keller. Larry has  faithfully served the residents of New Hope Borough, Pennsylvania,  including as Mayor of New Hope, during his many years of dedication to  public service.\n\nMayor Keller has long been…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699203/congratulating-larry-keller-on-his-service-as-mayor-of-new-hope-pennsylvania"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Mr. Speaker, I rise today to recognize Dr. Walter Eugene  Hunter of Celina, Texas, and present him with the Congressional Patriot  Award. Walter has dedicated himself to faithfully serving our community  and country.\n\nAs a young man, Walter was a decorated Boy Scout and Cub Scout leader  and worked as a messenger boy for Western Union. During the Second…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690722/recognizing-congressional-patriot-award-recipient-walter-hunter"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…Nation's servicemembers.\n\nIt all began nearly a quarter century ago in the garage of the  Lawrences' residence in Hamersville, Ohio. One of Diana's family  members was serving faithfully in the military in Afghanistan, and she  sent a care package overseas to show support.\n\nAn idea was born, and soon, students from Milford Schools and  volunteers from all…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691308/acts-of-service-by-diana-lawrence-and-troop-box-ministry"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…1945, Sylvia married the love of her life, Charles Howard  Thornton, and embraced her calling as a pastor's wife. Together, she  and Charles raised six children. She served faithfully in teaching,  serving, and leading the women of the church with grace and devotion.  Guided by an unwavering faith, she made it her mission to instill Godly  values in her…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697547/recognizing-sylvia-marie-thornton-on-her-98th-birthday"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Speaker, I rise today to recognize Pastor lsiah  Moore, Jr., of Celina, Texas, and present him with the Congressional  Patriot Award. Pastor Moore has dedicated himself to faithfully serving  our community and country.\n\nBorn in Shreveport, Louisiana, Pastor Moore attended Booker T.  Washington High School and joined the United States Navy after  graduation.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690155/recognizing-congressional-patriot-award-recipient-pastor-isiah-moore-jr"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…consider them a very fine  organization, not only helping whistleblowers, but helping all of  Congress in our responsibility of oversight to see that the executive  branch faithfully executes the laws according to the constitutional  requirement.\n\nThe Government Accountability Project said this to the Times about my  whistleblowers not facing any risk…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…I rise today to recognize and celebrate Mr.  Steve Ledwell of Texarkana, Texas, and to present him with the  Congressional Patriot Award. Steve has dedicated his life to faithfully  serving his community and country.\n\nBorn and raised in Texarkana, Steve has spent his life building up  others and strengthening his community. From a very young age, he…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696827/recognizing-congressional-patriot-award-recipient-steve-ledwell"}]