[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Immigration\n\nMr. President, the year was 1939, and there was a ship that sailed  from Germany destined for Cuba. It was bringing Jewish refugees from  Europe, which was falling into Nazi control, to a free place to live in  Cuba.\n\nUnfortunately, as that ship, the St. Louis, approached Havana, Cuba,  it was turned away. They wouldn't allow those Jewish…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…some mandatory minimum sentences in  the First Step Act that was signed by--guess who--President Donald  Trump himself in 2018. Yet, I guess all good policy is, once again,  falling to the feet of the divisive political rhetoric around  immigrants and crime that my colleagues across the aisle have embraced  as their salvo to save them from the bleak economic…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695359/stop-illegal-entry-act-of-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…have few answers. ``I hope we're going to be here,''       the employee tells caller after caller. ``But I can't       guarantee anything.''\n\nComplicated benefits cases are falling by the wayside, the       employee said. Online claims, which are completed by field       staff, are piling up.\n\n``There is just no time to breathe or get anything else…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…what Johnny Carson or Jack Paar would think about all of  this. I am sure Alec Baldwin wouldn't like it, and President Trump  didn't like the way he treated him. Chevy Chase falling over Gerald  Ford would probably put him in bad positions, too. Comedy is comedy.  Free speech is free speech, and we shouldn't step on it.\n\nGod bless the First Amendment.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695703/authoritarianism-is-a-threat-to-democracy"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…Local housing organizations will owe landlords rent checks on January  1 with no guarantee they will have the funds. Mr. Speaker, 170,000 of  our fellow Americans will risk falling back into homelessness.\n\nBefore I served as mayor of Phoenix, I chaired Maricopa County's  Continuum of Care. We put our funding  where it made the biggest impact with proven…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697137/addressing-the-housing-crisis"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…H.R. 1155, the Recovery of Stolen Checks Act, has received. The bill  will take a critical step toward combating financial fraud and  protecting hardworking Americans from falling victim to check theft.\n\nEach year, countless Americans are targeted by criminals who steal  and fraudulently cash their checks, causing financial hardship and  eroding the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689292/recovery-of-stolen-checks-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…dollars to elect Donald Trump and other  Republicans, is now saying Members should be ashamed of themselves for  voting for this disgusting bill.\n\nRemember when Republicans were falling all over themselves calling  Elon a genius and he could do no wrong?\n\nI have got to be honest, Mr. Speaker, it gives me whiplash. I think I  need a neck brace to deal with…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…Gaza to  alleviate the humanitarian catastrophe. It will resume when families on  both sides of the border can sleep peacefully without the constant fear  of rockets and bombs falling from the sky. It will resume when there is  a lasting, durable, and negotiated cease-fire.\n\nMr. Speaker, that day need not be far away. Israel achieved its goal  of destroying…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692485/supporting-israeli-security-and-palestinian-freedom"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…everything right. They are  working longer hours. They are budgeting carefully. They are raising  their families. And they are just trying to stay afloat, but they are  still falling behind. That is why we are here today.\n\nIn 2010, the Supreme Court handed down a decision that put a ``for  sale'' sign on our democracy. The Citizens United ruling opened…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699113/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…With the certainty of tides,      Just like folks springing high,      Still I rise.      Did you want to see me broken,      Bowed head and lowered eyes,      Shoulders falling down like tear drops      Weakened by my soulful cries?      Does my haughtiness offend you?      Don't you take it awful hard      'Cause I laugh like I've got gold mines…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689641/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…price they  publish in private--at least to some sources--and not tell the American  consumer? If they had to do that, we think the American consumer would  think twice about falling for these ads.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694204/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…military  readiness here at home, with sea-level rise and extreme weather  flooding our bases. Permafrost thaw is making Alaskan runways unusable.  Radar stations are at risk of falling into the sea.\n\nMr. Chair, we don't have the luxury of ignoring the very real effects  of climate change happening around us--especially when they're  affecting our lives and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695056/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…manufacturing, quantum computing and semiconductors, or cedes those  opportunities to competitors abroad. We are supposed to win all the  races and make us great again. We are falling behind in competition.\n\nConstruction workers, researchers, manufacturers, and students are  ready to build the next generation of American industry. Instead of  investing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695601/devastating-harm-caused-by-trump-administration"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…is  designed to address all of these different issues in our society, but I  come to the floor with really bad news, as though we needed more.  America's K-12 students are falling further and further behind,  particularly behind China's students, academically.\n\nThis lag is particularly concerning when we talk about the STEM  fields because our industrial…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688979/mathematical-and-statistical-modeling-education-act"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…Rural hospitals will close. Millions will lose  their healthcare. Kids will go hungry. Americans will be poorer. They  will be sicker because my Republican colleagues  are falling in line instead of standing up for their people back home.\n\nThis bill shows us their priorities, and it is not the American  people. They are taking away Americans' healthcare…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693172/one-big-beautiful-bill-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…card revealed that American students  are still struggling to make up ground lost during the pandemic.  Reading scores among fourth and eighth graders declined again, after  falling in 2022 and 2019. One-third of eighth graders are reading below  a basic level--the highest proportion ever recorded. Math scores showed  modest improvement, but they still…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688343/nomination-of-linda-mcmahon"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…are not resolved on jurisdictional or procedural grounds,  only 2 percent are decided in favor of the appellant and against the  agency.\n\nAs instituted, the IBLA is not only falling short of its stated  mission for impartiality, but creating further burdens through its  extensive backlog.\n\nThe EARA creates an alternative path for expedited review, allowing…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691037/expedited-appeals-review-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…children, I ask: Should illegal immigrants receive tax- funded meals day in, day out to eat on your dime?\n\nAgain, I heartily say: Absolutely not.\n\nTo the children at risk of falling behind in lagging schools all over  this country, I ask: Should we continue to allow millions upon millions  to arrive here illegally and crowd out your classrooms?\n\nI would…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…families for their political means and ends than genuinely work  to make their lives better. The American people see that for what it  is. Mr. Speaker, you are hearing: The sky is falling. Everyone is going  to lose their healthcare if this is not attached to a CR at this  moment.\n\nYes, we do have the majority. I am confident we will pass the CR in  the House.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…discussion on this critical  Congressional Review Act that we are operating under. The Congressional  Review Act agenda as a whole is important. My Democratic colleagues are  falling into a repeated trap of copying and pasting comments these  days. It is true of remarks for rule debate, as well. Every week, they  come before this body to complain that…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Mike Carey", "party": "Republican", "sentence": "Mr. CAREY. Mr. Speaker, I rise today in support of a bill that will  prevent deadly chemicals from falling into the hands of children, our  Youth Poisoning Protection Act.\n\nIt's a parent's worst nightmare: a nameless, faceless stranger over  the internet teaching your child how…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690217/youth-poisoning-protection-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…many institutions have failed.\n\nGateway Parks is making winter sports accessible to kids who might  never get the chance, teaching them confidence, grit, and the value of  falling down and getting back up. Barn Elite Training is giving young  athletes a place to push their limits, to build mental and physical  toughness in an era when both are in short…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690045/recognizing-gateway-parks-and-barn-elite-training"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Mr. HARIDOPOLOS. Mr. Speaker, it is an honor to be here with you this  morning to talk about the good news. Every day, I hear in so many  newscasts that somehow the sky is falling. Let's get to the facts about  what is actually happening in our economy and, most importantly, how  America is moving in the right direction.\n\nGas prices are down. Inflation,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691176/president-trumps-delivery-on-his-promises"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…usher in a new golden age, we are already  seeing incredible results.\n\nIn March, our economy added 228,000 jobs, beating expectations by  almost 100,000 jobs.\n\nThat same month, falling energy costs pushed inflation down to 2.4  percent. That is tied with the lowest inflation rate since February  2021. That was 1 month after President Biden took office and…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…food supply.  However, the FDA's approval process for these additives has resulted in  a decades-long approval process that stifles innovation and leaves  American farmers falling behind their international competitors.\n\nI am proud to join a bipartisan group of Members on the Innovative  FEED Act to streamline this process and cut the approval time…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688957/president-trump-bringing-back-investments"}, {"senator": "Dan Crenshaw", "party": "Republican", "sentence": "…good, then 10 more must be better.  You can never do enough.\n\nOf course, my colleagues on the other side of the aisle have started  with the scare tactics claiming the sky is falling, the air quality is  plummeting, and people are dying and they are not going to have  healthcare. There is no evidence for that, of course.\n\nThe evidence actually shows the…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688530/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…the advent of President Trump's ascension to the Office of President.\n\nIt is amazing to me to listen to my Democratic colleagues talking  like Chicken Little: ``The sky is falling.'' I heard the Senator from  Rhode Island suggest that we are trying to privatize Social Security.  There is no one--absolutely no one--suggesting that. This is what is  called…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…fiscal year  2026 at the end of November was 19 percent lower than the same time  last year. Core inflation is at 2.6 percent, the lowest we have seen in  4 years.\n\nRents are falling month after month, and shelter inflation is at a 4- year low. Gas prices are down to their lowest levels in 4 years. Stocks  were at near highs by the end of the year, with…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…many years to come.\n\nIn today's era of strategic competition, Congress needs to provide  the administration with the tools it needs to ensure American  technologies are not falling into the hands of our adversaries. Malign  actors like China, Russia, North Korea, and Iran would gladly seek to  use our very own goods and technologies against us, whether…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690695/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…keep telling me that  we are going to take off on productivity, but then you see the charts  of available young people to participate in the labor force. The number  keeps falling and falling.\n\nRemember, we have the smallest group of 18-year-olds as a percentage  of population in U.S. history, and next year is even smaller, and the  year after that…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}]