[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…the ATM because they are trying to get  a car loan?\n\nThese are legitimate questions. These are legitimate answers that  need to be given.\n\nI will say this: The money does not fall out of the sky that allows  them to pay millions and millions of dollars in fines. It comes from  charging the customers, increasing interest rates, laying off employees  so…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…women. So let's bring it to light.\n\nIf we believe in that vision of equal justice under law, if we  believe in accountability for all, then release the files. Let the  chips fall where they may. It is the right thing to do.\n\nEveryone involved in assisting Jeffrey Epstein in running an  international trafficking organization or involved in directly  purchasing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…comments, and we will  relentlessly defend our State's right to protect the air our children  breathe with robust fuel economy and pollution standards when Federal  standards fall short.\n\nWith these resolutions, Republicans are exposing their cynical,  special-interest agenda that endangers public health in every community  in our country by dismantling…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690390/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…credits.\n\nWe offered the Republicans the chance during the so-called Big  Beautiful Bill; they rejected it three times unanimously. But they went  home over the summer and the fall and now into the winter and they hear  their constituents clamoring for relief. Open your ears, open your  minds, Republicans, listen to the American people. There is no doubt,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…out of foreign wars. That was a huge  signature part of his campaign. So why do we find ourselves now ``in  charge,'' in his words, of Venezuela?\n\nLet's put it in context. All fall, the White House has been attacking  boats in the Caribbean Sea, in the Pacific, saying that we were at war  against drugs and the flow of drugs, even though no fentanyl is…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698619/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…cells in the pancreas,       so people with the disease must take insulin by injection or       insulin pump to survive Abby, 15, will be a sophomore at       Summit High in the fall. One of Abby's mentors with       Breakthrough T1D encouraged her to apply to be part of the       Children's Congress, an initiative the organization runs that       sends…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693470/recognizing-ms-abby-lachman-for-her-dedicated-medical-research-advocacy"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…because, in order  to start paying and in order to start enrolling, you have got to notify  people: Hey, your thing that was $289 a month now is $789 a month. So  sometime in the fall--it depends on the State, in October, November,  and some people in December--people are going to get a letter, saying:  If you want to stay on the same healthcare plan, here…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…our  schools, our local communities, our families, and our children, who are  already feeling financial strain.\n\nOur families are counting on us. Congress cannot continue to fall  short on our students and families regarding funding when so much is at  stake. We must fulfill our promise and fund IDEA.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698946/protecting-education-for-children-with-disabilities"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…recruited to break down a color barrier at the University of Alabama's  law school.\n\nEight young men walked through the doors of the University of Alabama  School of Law in the fall of 1969. Among them was a young man named  John, a young man named Ronald, a young man named Booker T., and a  young man named Michael.\n\nThis was a time when the civil rights…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…William and Fairfax Counties on their awards,  and I look forward to working with them and fighting false allegations  about our elections.                      Anniversary of the Fall of Saigon\n\nMr. SUBRAMANYAM. Mr. Speaker, today marks the 50th anniversary of the  Fall of Saigon.\n\nThousands of Vietnamese families escaped during the war, coming to  America,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690520/election-integrity"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…alone: the President of the United States.\n\nUnless we reverse course quickly, many economists believe that a  recession is inevitable. And like in all recessions, the pain will fall  hardest on working families. Many Americans will face the one-two punch  of job losses on top of overwhelming debt burdens. A cascade of  defaults and foreclosures and personal…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690534/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…detention prior to       trial or without trial is the carefully limited exception. We       hold that the provisions for pretrial detention in the Bail       Reform Act of 1984 fall within that carefully limited       exception. The act authorizes the detention prior to trial of       arrestees charged with serious felonies who are found after       an…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696979/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…We have built communities that are unparalleled  in strength, prosperity, and commitment to preserving our history.\n\nMr. Speaker, as we reflect on the past 50 years since the fall of  Saigon, we do so in solemn remembrance but in celebration of what we  have built together. From the ashes of war, we have risen.\n\nWe celebrate today the trailblazers who…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690347/recognizing-black-april"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…rules he wants to advance his crypto  operations.\n\nNot only that, under the Trump administration, the SEC has said that  memecoins, stablecoins, and bitcoin mining all do not fall under their  oversight. Can my colleagues imagine that?\n\nDo these assets sound familiar? Oh, yes, they do because these are  all ventures that Trump and his family are pursuing…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693777/digital-asset-market-clarity-act-of-2025"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…slash-and-burn proposal, it  will mean real harm for veterans and their families. My constituents  are warning me, and they are right, that cuts to SNAP, Medicaid, and VA  services will fall hardest on disabled and aging veterans, especially  in rural areas and communities of color.\n\nHouse Republicans have chosen to unilaterally pursue a budget that  puts tax cuts…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691492/protecting-american-maritime-research"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…most vulnerable patients,  the Department of Health and Human Services oversees many of the  Federal Government's most essential functions. But far too often, these  programs fall short of their well-intended purpose.\n\nBureaucratic overreach has resulted in the loss of trust from many  Americans. Waste, fraud, and abuse have contributed to excessive…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691446/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…I write regarding our mutual       understanding of H.R. 2492, the ``Fire Safe Electrical       Corridors Act of 2025.''\n\nI recognize that the bill contains provisions that fall       within the jurisdiction of the Committee on Agriculture and       appreciate your willingness to forgo further consideration of       the bill. I acknowledge that the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691068/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…for  beneficiaries. This isn't to say that HVAC systems in a hot climate or  legal supports aren't important or may have some potential relation to  someone's health, but they fall far outside the scope of what Medicaid  is intended for. They open the door for States to draw down Federal  funds or for services that are oftentimes entirely funded by the…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…every day. The work done in Alaska ensures that America  remains a leader in this critical domain.\n\nMr. Speaker, space is the next great frontier, and America cannot  afford to fall behind. We must continue to invest in our space  infrastructure, foster private-sector innovation, and recognize  Alaska's strategic significance in maintaining international…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687923/space-dominance"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…2026, we could  see prices rising as high as $8.43 per gallon by the end of 2026.\n\nThis is because we are going to see a severe decline in in-State  production. Indeed, it could fall from over 34 million gallons per day  in 2023 to just 27 million gallons by the end of 2026. Then you factor  in the higher transportation costs. You are going to see Californians…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…our townhall tour stops in  August. Yes, we actually did townhall tours. I know a lot of you are  surprised by that. We got out there and listened to people.\n\nFrom seasonal fall specialty coffees to strawberry lemonade  smoothies, the Funky Buffalo is always offering new drink recipes.\n\nThe Funky Buffalo is run by Kendra. She is a wife, a mom of three,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695704/recognizing-the-funky-buffalo-coffee-house-and-trading-company"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…poisonous new idea,  utterly alien to the traditional American way of life.\n\nOur trade policy, like our foreign policy, failed to adapt to the new  reality of the world after the fall of the Berlin Wall. The  consequences were nothing short of devastating.\n\nAt the dawn of the 1990s, as America looked forward to the new  millennium, the architects of globalism…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Direct-Attack Munitions (JDAMs) consist of a bomb       body paired with a warhead-specific tail kit containing a       GPS/INS       guidance capability that converts unguided free-fall bombs       into accurate, adverse weather smart munitions. The JDAM       weapon can be delivered from modest standoff ranges at high       or low altitudes against a variety…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696967/arms-sales-notification"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…applicability.      (2) Rule of Agency Management or Personnel\n\nThe Miles City RMPA is not a rule of agency management or       personnel. We have previously held that rules that fall into       this category relate to purely internal agency matters.\\41\\       Because the Miles City RMPA is concerned with public use of       the areas it governs rather than…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693085/us-government-accountability-office-legal-opinion"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…applicability.\n\n(2) Rule of Agency Management or Personnel\n\nThe North Dakota RMP is not a rule of agency management or       personnel. We have previously held that rules that fall into       this category relate to purely internal agency matters.       Because the North Dakota RMP is concerned with public use of       the areas it governs rather than…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…ensures that we are  going to develop hypersonic defense, space-based missile interceptors,  and AI-driven surveillance to keep us ahead of those adversaries. We  cannot afford to fall behind because the price of inaction is just too  high.\n\nThe economy of space has also grown dramatically over the last few  years. In 2022 alone, it added $132 billion to the…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…is a failure of political will.\n\nEveryone wants to see an end to Russia's war in Ukraine, but the  price of peace matters. If we want enduring stability in Europe, we  can't fall for an illusory peace. We should know enough history not to  dismiss this as merely ``a quarrel in a faraway country, between two  people of whom we no nothing.''\n\nIt is a major…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692870/9999"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…Finland,  Italy, Latvia, Lithuania, the Netherlands, Poland, Portugal, Spain, and  Sweden, the minimum age requirement to undergo any sex reassignment  surgery is 18. We should not fall behind these countries when it comes  to protecting our children.\n\nThe Protect Children's Innocence Act will hold those accountable who  perform or attempt to perform genital…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698346/protect-childrens-innocence-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…full-year appropriations and release our military from the constraints  of the Biden fiscal year 2024 budget. But I want our colleagues to  understand what is at stake this fall.\n\nThe President has set some ambitious, important, and overdue  priorities for America's national security, and none of them--none of  them--come cheap: the Golden Dome for…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…estimate that in 10 years, we will have 5.3 million fewer  people in America. That is mostly from reduction in immigration and the  fact that our fertility rates continue to fall, but think of this.\n\nThat missing 5.3 million people is $500 billion over that timeframe  in lost tax receipts. When I use the term ``demographics'' on our debt,  it is a function.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}]