[{"senator": "Jim Costa", "party": "Democrat", "sentence": "…financing costs and  bipartisan legislation on permitting reform to get infrastructure like  energy, transportation, and housing projects more quickly approved for  working families.\n\nMr. Speaker, we need bipartisan solutions, and they are clear.  Congress must act now to ease costs, expand access to healthcare, and  invest in the future of our communities throughout…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698830/putting-americans-first"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…housing to groceries.\n\nThere were 10 bills to undo the democracy of people who live here in  D.C., 10 issues and 10 solutions we could have worked on to help  working families.\n\nMr. Speaker, in closing, I encourage all of my colleagues in Congress  to oppose this joint resolution.\n\nVoting ``no'' means that we refuse to support this congressional  Republican…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699681/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…and increasing wages. The  budget passed last night only gives billionaires tax cuts and funds  indiscriminate raids in our city, all paid for by working-class  families.\n\nAgain, Mr. Speaker, CHC stands with our community and rejects the  Republican budget betrayal.\n\nMr. ESPAILLAT. Mr. Speaker, we stood here tonight to warn the  American people of these…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688134/republican-budget-betrayal"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…Americans who are at risk of losing healthcare,  while Republicans found the time and the money to give tax cuts to  billionaires but no time to give relief to middle-class families.\n\nMr. Speaker, I thank Leader Jeffries and Democrats. I call on my  Republican colleagues to join us, and let's be on the right side of  history.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698785/breaking-the-gridlock-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…that the members of the  Congressional Black Caucus serve.\n\nMr. Speaker, I also rise on behalf of the 82 million Americans that  the Congressional Black Caucus serves. Families, Mr. Speaker, who sit  at the kitchen table late at night wondering which bill they can pay  and which bill must wait.\n\nIf Congress fails to act, 35,000 people in my district will…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697648/restoring-enhanced-premium-tax-credits"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…they have a big problem.\n\nI just don't get it. I mean, that is where their attention is, on  going after consumers, making life more difficult for everyday working  families.\n\nMr. Speaker, tonight is the State of the Union, and I am sure that  the President is going to come here and paint a very rosy picture,  indeed. He is going to say that the economy…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700195/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…their families or delivering the IVF  coverage the President promised; they are focused on denying women  their reproductive rights and failing to deliver for American families.\n\nMr. Speaker, I urge my colleagues to stand for women and families,  for dignity and for freedom, and vote ``no.''", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699228/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…doubled down on our cause and demand the State Department  send Members of Congress a weekly update on exactly how much aid is  entering Gaza and reaching desperate families.\n\nHowever, Mr. Speaker, aid alone is not enough, especially not for our  children who have suffered injuries, especially not for children with  disabilities and complex medical conditions.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697473/president-trump-is-a-threat-to-our-republic"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…resolution that really is going to provide  tax breaks to the wealthiest Americans in exchange for cuts in vital,  essential programs for working- and middle-class families.\n\nMr. Speaker, I am proud to stand here with my colleagues from the  Congressional Hispanic Caucus to call out the partisan Republican  budget resolution that passed last night for…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688133/republican-budget-betrayal"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…this bill on small business owners and entrepreneurs who  are the heart and soul of our economy.\n\nThis bill also represents an all-out assault on law-abiding immigrant  families. Mr. Speaker, we are going to tell their stories, as well. We  are going to tell their stories because what is happening in this  country is an all-out assault on law-abiding immigrant…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…for  months, we are joined by Republican colleagues who recognize that we  have a responsibility to help ensure Americans can afford to provide  healthcare for their families.\n\nMr. Speaker, it is our job to bring down the cost for Americans. It  is our job to make life better for Americans. It is our job to ensure  that every family has access to affordable…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698793/breaking-the-gridlock-act"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…sickness without treatment. They are voting to enrich billionaires at  the expense of what makes us American, which is our freedom to build a  better life for our families.\n\nMr. Speaker, the American people overwhelmingly oppose this bill, and  they will not forget if my Republican colleagues sell out their freedom  this Independence Day.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693173/one-big-beautiful-bill-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…sure every single one  received funding.\n\nThis is what government should be: responsive, collaborative, and  focused on our people delivering results for them and our families.\n\nMr. Speaker, I am proud of this progress, and I am just getting  started for the people of Oregon's Third.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698771/delivering-on-commitments-to-oregons-third-congressional-district"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…White House and this Congress that encourages stability in the  marketplace, protects our relationships with close trading partners,  and lowers costs for American families.\n\nMr. Speaker, I commend Representatives Kelly and Evans for their  leadership on this issue. I urge my colleagues to support this  legislation.\n\nMr. PALLONE. Mr. Speaker, I know…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692696/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…only Republican priority is pleasing President Trump with  whatever he wants. They give in to his every wish, even if it means  driving up utility bills for American families.\n\nMr. Speaker, I urge my colleagues to vote ``no'' on this bill, and I  reserve the balance of my time.\n\nMr. PALLONE.  Castor), the ranking member of our Energy Subcommittee.\n\nMr.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…healthy and make ends meet. Personal finances and being able to pay  your bills are a major source of stress and anxiety for so many  veterans, survivors, and their families.\n\nMr. Speaker, passing this cost-of-living adjustment provides them  with the peace of mind they deserve and access to benefits they are  owed. I know many of my House colleagues…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696760/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…though he and I disagree on many things, including this  resolution, Mr. Speaker, we have heard a lot from the other side of the  aisle about how they support working families.\n\nMr. Speaker, this is a resolution that would provide no tax on Social  Security, no tax on tips, no tax on overtime, provisions that  specifically help working families, families…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…significantly over the  next several years, which means this body has a duty to ensure our  constituents have a dependable grid that meets the needs of hardworking  families.\n\nMr. Speaker, unfortunately, both the Obama and Biden-Harris  administrations were guilty of using the EPA to promote radical policy  designed to drive out baseload generation in…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698276/reliable-power-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…say, well, how could anybody vote against this bill? Think about what a  ``no'' vote means. I am proud of the ``yes'' vote that we are about to  pass to help those families. Mr. Speaker, everybody who votes ``no,''  make no mistake about it, everybody who votes ``no'' is going to be  asked a question by that waitress making $32,000 a year saying: Why…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…allowing the city of Paducah to transfer land directly to the club.  This will pave the way for long-planned improvements that will directly  benefit Kentucky children and families.\n\nMr. Speaker, I urge my colleagues to support Chairman Comer's  legislation, and I yield back the balance of my time.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697651/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…That is why we are here today: to protect consumer choice, lower  costs, and ensure that American families have the freedom to decide  what suits the needs of their families.\n\nMr. Speaker, I am thankful to Energy and Commerce Committee Chairmen  Guthrie and Latta for their support of this bill, House Republican  leadership for bringing it to the floor,…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700167/dont-mess-with-my-home-appliances-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Act's tax cuts  benefit families making less than $500,000. Just because they keep  saying it doesn't make it true. The One Big Beautiful Bill Act does  help working families.\n\nMr. Speaker, I do have to address, because my colleague has decided  to bring ICE into this debate, or this discussion, regarding small  businesses and help that we may be able…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…and advanced manufacturing, hold tremendous  promise to lift up communities across the country with stable, good- paying jobs, while lowering costs for hardworking families.\n\nMr. Speaker, the Securing America's Critical Minerals Supply Act  takes an important step towards solidifying the U.S. position as a  global leader in economies and technologies…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699990/securing-americas-critical-minerals-supply-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…students with disabilities had long been  denied access to public education, but IDEA transformed the public  school experience for students with disabilities and their families.\n\nMr. Speaker, we have an obligation to our students in this country.  Thanks to IDEA, our education system is working to serve the needs of  every student in America.\n\nThis important…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697493/9999"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Democrats remain stuck in the year 9--we are going on year 10-- of Trump derangement syndrome, Republicans are focused on governing and  delivering results for working families. Mr. Speaker, I would like to  once again remind my colleagues of what is actually in the rule before  us today.\n\nThe rule provides for consideration of three commonsense bills:…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}]