[{"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…families, their kids.\n\nAnd Nevada has more tipped workers per capita than any other State.  So this bill would mean immediate financial relief for countless hard- working families.\n\nNo tax on tips was one of President Trump's key promises to the  American people, which he unveiled in my State of Nevada. And I am not  afraid to embrace a good idea wherever…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691423/no-tax-on-tips-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Republican Congress  just enacted the largest transfer of wealth in history. They cut 15  million people off of their healthcare and decimated food assistance  for working families to give tax breaks to billionaires.\n\nLast week, I joined my dear friend Representative Ayanna Pressley and  Project Bread in Boston to hear directly from people experiencing food…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694156/impacts-of-the-big-ugly-bill-on-massachusetts"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…could get  affordable care.\n\nAnd since then, I am proud to say that we have actually built on the  success of the Affordable Care Act. One of those wins has been giving  families a tax break when they buy their insurance through the  marketplace to help make their healthcare more affordable.\n\nFor small businesses, like our restaurants, manufacturers,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695650/healthcare"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…especially multigenerational households,  deal with the rising costs of living, I am introducing the  Multigenerational Family Tax Credit Act. My bill gives  multigenerational families a tax credit for expenses that they incur  when they upgrade their houses to make them more accessible for their  aging parents who live with them. This includes upgrades like…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699584/stop-the-republican-affordability-crisis"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…greatest democracy deserve that  democracy themselves.\n\nMr. Speaker, I think it is very interesting, as we sit here, I keep  hearing my colleagues bring up the ``working families tax cut bill.''  They keep bringing it up, and I am asking the staff here, I don't  remember voting on the working families tax cut bill. We have looked it  up, and we can't…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699681/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Republican leadership has taken  this country over the last year.\n\nTogether, we have accomplished real results. It starts with tax  relief for American families with the working families tax cut. Mr.  Speaker, do I need to remind you, it is only the largest tax cut in  U.S. history. Workers can keep more of what they earn with no tax on  tips and no tax on overtime.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…to build affordable homes and taking  advantage of abundant natural gas reserves beneath our Nation.\n\nImportantly, H.R. 4758 builds on the important work of the Working  Families Tax Cut law by officially putting an end to these egregious  authorities so future abuses cannot occur.\n\nBy passing this legislation, House Republicans are continuing to  address…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700222/homeowner-energy-freedom-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…million  in rural healthcare funding for the State of Washington.\n\nNot long ago, right here in this Chamber, I joined my House  Republican colleagues to pass the Working Families Tax Cut Act, the  largest tax cut in American history.\n\nWhen we voted for this, we also voted for a new rural healthcare  fund, and $181 million of this rural healthcare fund…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698645/tax-relief-for-working-families"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Republicans' policies have changed all of that. Our focus is  affordability. The proof is in the pockets of the American people.\n\nLast year, Republicans passed the Working Families Tax Cut law. Every  Democrat--every single Democrat in this body--voted against it. That  law benefits every single American taxpayer.\n\nEvery working American receives a permanently…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700171/state-of-the-union-address"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…Speaker, the one big, beautiful bill is the most  transformative legislation in a generation.\n\nIt delivers tax-free Trump accounts for newborns, tax cuts for  working families, and no tax on tips and overtime. For millions of  parents, the most powerful piece of this is that it delivers nationwide  school choice.\n\nStates like Utah have led the way. We…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692895/delivering-on-educational-freedom"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…which workers  across the country overwhelmingly support--90 percent. This is just one  of the ways Republicans are helping tipped workers earn more.\n\nAs part of the working families tax cuts, Republicans enacted  landmark policies like no tax on tips and no tax on overtime, which put  more money back into the working family's pockets.\n\nRepublicans are working…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698965/tipped-employee-protection-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Republicans have taken important steps that  will help ease the affordability crunch for all Americans, particularly  when it comes time to file their taxes next year. The Working Families  Tax Cuts Act was signed into law by President Trump on July 4. This is  one of the most significant pieces of legislation that we have seen in  a long, long time, and one of…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…implementing that directive,  working to reinstate the 2020 Record of Decision and moving forward  with the four statutorily required lease sales mandated by the American  working families tax cut.\n\nHowever, unless we disapprove of the 2024 ROD today, regulatory  whiplash will continue, investment will remain frozen, and local  communities will shoulder the burden…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696831/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Wyoming's K-12 public education system  and protecting more than 4,000 high-paying jobs in rural Wyoming.\n\nIn conjunction with the pro-energy policies included in the working  families tax cut law, this CRA also has the potential to generate more  than $260 million for the Federal Treasury.\n\nThis CRA helps the U.S. remain energy dominant and will lower prices…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "John Thune", "party": "Republican", "sentence": "…to create the first U.S.  Federal framework for stablecoins and ensure U.S. leadership in  financial innovation; and first and foremost, of course, we passed the  Working Families Tax Cut and the rest of our landmark legislation.\n\nJanuary 1 was this past Thursday. If Democrats had their way,  Americans would have been facing a big tax hike at the start…", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698482/senate-agenda"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…American  achieve their dreams. If President Trump's tax cuts are not extended,  as I say, virtually everybody or at least a significant supermajority  of American working families will see a tax increase. Texans  specifically will see taxes increase about $3,000 on average. I am sure  every single one of my constituents can think about somewhere better to…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…projects. There is finally the willingness to  tackle this housing crisis head-on.\n\nMrs. KIM. The Housing for the 21st Century Act builds on the success  of  the working-class families tax cuts and deserves swift passage so we  can deliver results for American families.", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699800/housing-for-the-21st-century-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…ideal that is reflected in  the testimony of Mr. Lampe.\n\nThis Congress has already taken decisive steps to reassert its  authority over the Coastal Plain. In the ``Working Families Tax Cut  Act,'' P.L. 119-21,  Congress mandated lease sales to be offered under the same terms and  conditions set forth in the August 2020 ROD for the FEIS of the  original…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Mr. MOORE of Utah. Mr. Speaker, I am so glad to be joined by my  colleagues this evening to talk about the historic tax relief we are  providing for working families this tax season. I think it should be on  the mind of every single American, and we are thrilled to be able to  highlight some of the many things that we have accomplished in…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699706/historic-tax-relief-for-families"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…like $200 billion of taxpayer  funding for illegals to get taxpayer benefits, while they gutted the  $50 billion rural healthcare fund that we put in place in the working  families tax cut.\n\nMr. Speaker, anybody who comes up here and says they care about  healthcare is also advocating to gut the $50 billion rural healthcare  fund to provide $200 billion…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696745/continuing-appropriations-and-extensions-act-2026"}]