[{"senator": "Mark Messmer", "party": "Republican", "sentence": "…MESSMER. Mr. Speaker, I rise today to celebrate the massive  benefits that my constituents in Indiana and all Americans will reap  thanks to the passage of the working families tax cuts.\n\nI am so pleased we are able to put hardworking taxpayer dollars back  into the pockets of deserving Americans. Mr. Speaker, because of this  important legislation,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695724/supporting-working-families-tax-cuts"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…successfully passed a  reconciliation package, which will extend President Trump's tax cuts  for working families, known as the One Big Beautiful Bill or the  Working Families Tax Cuts Act, which contains far more than just tax  relief for the American people. We passed our first draft of the  National Defense Authorization Act in the Senate.\n\nIn addition…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…the gentleman from Georgia  for his comments. I appreciate his thoughts and for articulating much  of that.\n\nMr. Speaker, last year House Republicans passed the working families  tax cuts. This was a reconciliation bill that included monumental  progrowth and profamily legislation that lowers costs for American  families.\n\nA lot has been said about this.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699064/how-republicans-have-delivered-for-americans"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…can use that to invest  in their child's future. Also, parents get a bigger tax credit--$2,200  for every child.\n\nAmerica is now energy dominant once again. The working families' tax  cuts unleashed American energy. It reopened Federal lands and waters  for energy production.\n\nThis is a historic victory for Wyoming. Wyoming is America's energy  breadbasket.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698252/nominations"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…here in the United States.\n\nCongress is now working in a bipartisan way to resolve this issue and  bring back housing affordability. In 2025, as a part of the Working  Families Tax Cuts Act, we passed what has been called the largest  expansion ever of affordable housing tax credits. Our reforms to the  low-income housing tax credit are predicted to…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699814/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "John Thune", "party": "Republican", "sentence": "…South Dakotans,  as they are for many Americans. Affordability begins with more money in  your pocket, which is exactly what Republicans have delivered with the  working families tax cuts.\n\nIf Congress failed to act this year, a typical family in South Dakota  would have had less money in their budget. They would have been looking  at a $2,500 tax hike…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698212/senate-accomplishments"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…time under Chair Rodgers and  myself, Seth was an invaluable Professional Staff Member and under his  leadership--our committee strengthened Medicaid through the Working  Families Tax Cuts, which established Medicaid work requirements and  expanded home and community-based services to new beneficiaries.\n\nAfter serving two Chairs and three Subcommittee Chairmen,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696705/recognizing-seth-gold"}, {"senator": "John Thune", "party": "Republican", "sentence": "…affordable energy supply and more.\n\nOur goal for 2025 was more money in Americans' pockets, new  opportunities, and safer streets. We are accomplishing that with the  Working Families Tax Cuts and the rest of our landmark legislation, and  we will continue to expand on that work in 2026.\n\nThere are a number of bills that I would like the Senate to take up,…", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698482/senate-agenda"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…ObamaCare premiums and expanded access to  health savings accounts, direct primary care, and telehealth for  millions, including ObamaCare enrollees, as part of the Working  Families Tax Cuts.\n\nThere was $50 billion invested in the healthcare needs of rural  communities. The Lower Health Care Premiums for All Americans Act was  passed, which also lowered premiums…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…like cryptocurrency.\n\nOn the policy front, I helped to ensure the passage of the Secure  Rural Schools Reauthorization Act. I secured numerous provisions in the  Working Families Tax Cuts Act, which benefited American agriculture, as  well as a provision authorizing Workforce Pell Grants.\n\nThe Whole Milk for Healthy Kids Act will soon be signed into law,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698682/recognizing-the-honorable-steny-hoyer"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…legislation will save billions of taxpayer dollars by reducing  inefficient and unnecessary funding for defense programs. The NDAA  builds on efforts started in the Working Families Tax Cuts Act to  stimulate our economy and to bring jobs back home.            Addressing Misleading Advertising for Prescription Drugs\n\nMr. JOYCE of Pennsylvania. Madam Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695425/president-trumps-peace-through-strength-agenda"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Instead, they have  chosen to lie again.\n\nThe lie that they tell us is that by making tax cuts permanent,  Congress is taking money from working-class and low-income families to  give tax cuts to the rich. The facts show that this is the farthest  thing from the truth. President Biden's own Treasury Department  reported that the average person would see…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691527/one-big-beautiful-bill"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…scrutiny, the issue before  us today is whether the D.C. Council should be permitted to decouple  its local tax code from the historic tax relief enacted through the  Working Families Tax Cuts Act.\n\nThis landmark legislation, passed by House Republicans last July,  delivers meaningful tax relief to working Americans by expanding the  child tax credit, allowing…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699684/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…in support of H.J.  Res. 142, legislation to reverse a District of Columbia law that bars  the citizens of our Nation's Capital from seeing the benefits of the  working families tax cuts enacted by Republicans and signed into law by  President Trump on July 4.\n\nInstead of seizing the opportunity to provide relief to the working  families and small businesses…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699682/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…Speaker, I will make a few factual comments in response and also  provide some information relative to my colleague's previous comments.\n\nRepublicans just passed working families tax cuts, which gave  American families the largest tax cut in American history. Under the  bill, the typical family will get up to $10,900 in additional take-home  pay. Households…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699316/pregnant-students-rights-act"}]