[{"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…District is extremely proud of what  Coach MJ has achieved. Her tremendous honor is not only a testament to  the investment she has made in herself, but also to her family, her  community, and, most importantly, to her team.\n\nI congratulate Coach MJ.", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698083/congratulating-maryjo-mccloskey"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…accessing healthcare.       Many of my patients have withstood remarkable obstacles to       start their lives in this state, some without any support       from their family or community. My mission as a doctor is to       ensure all my patients receive the best care possible, and       added stress from their immigration status being rescinded…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Mr. Goldman mentioned, I represent  Boulder, Colorado, in the Congress. I live in Boulder County. My wife  and I are incredibly blessed and lucky to be raising our family in this  community.\n\nLast week, I introduced a bipartisan resolution denouncing this  heinous anti-Semitic terror attack in my community. H. Res. 476, a  resolution that makes clear…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692191/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…their Fellows, and the resilience of the  students themselves.\n\nMoreover, Acting Librarian of Congress Newlen said the awardees this  year had a particular focus on family and community, something  Delawareans know is at the heart of our State's success.\n\nBeing 1 of only 15 honorees, alongside programs from States across  the country, Kenya, and Scotland,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696940/recognizing-shae-parks"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Ms. STANSBURY. Mr. Speaker, I rise today on the House floor with a  heavy heart for the family and the community of Renee Nicole Good.\n\nMy heart is heavy and not just because of the unabashed and violent  killing that happened last night by an ICE agent in Minneapolis, but  because…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698708/enough-is-enough"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Georgia's Second Congressional District, salute and honor  life of Honorable Curtis Parham ``CP'' Redding, Sr., a man of purpose  and heart, whose enduring love for his family and community will never  be forgotten. I ask my colleagues in the House of Representatives to  join us in extending our deepest condolences to his family and all  those who mourn…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691304/in-memory-of-the-honorable-curtis-parham-cp-redding-sr"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…the internet is awash with real and fake nonconsensual  intimate imagery. Mr. Speaker, the consequences, as you just heard, are  devastating for every victim, their family, and their community. It  happens to men and boys, to women and girls. Most often, it happens to  women and girls.\n\nAs AI becomes more prevalent in our everyday lives, Congress must…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690183/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…were robbed of memories that make a  life, and they won't have their mother there for them.\n\nThis week, ICE, DHS took this 5-year-old boy, Liam Ramos, from his  family and from his community. This is what Liam's teacher says about  him:\n\n``He is very friendly. He comes into class every day, and he just  brightens the room. His friends haven't asked…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699379/speaking-out-against-ice"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…is about something much bigger. This is about how we  as a community stand together and resist the injustice that is  happening. Hardworking people and members of our family and community  are being treated like criminals. We all collectively have to object to  this madness because this is not justice.''", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692154/supporting-david-huerta"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I rise today with a heart full of joy to  celebrate a story that reminds us why sports, family, and community  matter.\n\nAt the University of Toledo, sophomore Rocket Miriam Diala was  greeted after a hard-fought win by her mother, Francisca. Her mom had  traveled 4,300 miles…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699647/family-sacrifice-and-the-rocket-spirit"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…Las Vegas community, and all those  whose generosity and commitment have made this day possible. Their  efforts stand as a testament to the enduring values of faith, family,  and community that enrich our great state of Nevada and our Nation.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695341/recognizing-the-groundbreaking-of-chabad-southwest-las-vegas"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…realize those dreams for people in Wheaton.\n\nI had the pleasure of meeting Deborah at one of my townhalls, where I  saw firsthand her passion to fight for herself, her family, her  community, and our district.\n\nMr. Speaker, on behalf of Illinois' Third Congressional District, it  is my honor to recognize Deborah for her lifetime of leadership in  Wheaton…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690325/national-fair-housing-month-amisha-patel"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…stop to this  injustice.\n\nThat is what I saw at Bluebonnet, a betrayal of our values as a  nation. We are a country of immigrants. We are a country that claims to  honor family, community, and fairness. Yet, the Trump administration is  locking up people who are simply trying to work, raise families, and  contribute to our community. This is not about…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695521/visit-to-bluebonnet-detention-facility"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…retired at the young age of 83. He truly made a  difference in a lifetime of extraordinary public service.\n\nYet, Rex's greatest legacy was the love he poured into his family and  community. He was a mentor, a coach, a storyteller, and a steady hand.  He was always present, always giving, always leading with heart.\n\nFor over 30 years, Papa Rex made Halloween…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…my esteemed colleagues in the United States House of  Representatives to please join me in celebrating her 100th birthday and  wishing her continued joy surrounded by family and community.", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696117/congratulating-geraldine-bubby-litvin-shaffer-on-her-100th-birthday"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…strengthening his  community.\n\nA resident of Buckingham Township since 1955, Paul and his wife have  raised their four children in Bucks County, firmly rooting their family  in the community he has worked so diligently to serve. His public  service to the Township spans nearly 25 years, first as Township  Auditor and later as a Township supervisor, roles…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698361/9999"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…special is not only the years Mr. Good has  lived, but also the example he has set for all of us through his  service, dedication, and lifelong commitment to faith, family, and  community.\n\nMr. Speaker, it is my distinct honor to recognize Edmund Good on the  occasion of his 100th birthday. His life reflects the very best of  American perseverance, patriotism,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695832/recognizing-edmund-good-on-the-occasion-of-his-100th-birthday"}, {"senator": "John Carter", "party": "Republican", "sentence": "…was listed as Missing in Action. Thanks to  the tireless efforts of military recovery teams, his remains have  finally returned home to Georgetown, Texas, where his family and  community, after decades of unanswered questions, can now lay him to  rest with the honor and dignity he earned.\n\nLt. McCook's service reminds us that freedom is not free. It…", "date": "2026-01-16", "source_url": "https://justfacts.votesmart.org/public-statement/1699163/saluting-tmche-service-and-sacrifice-of-first-lieutenant-charles-w-woody-cook"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…13-year battle with Scleroderma, providing unwavering  support and care, in both his personal and professional endeavors, Alan  was a committed man--committed to his family and community.\n\nToday, I commemorate Alan Bleam for his 40 years of remarkable  service for our community. His steadfast dedication to the betterment  of Plumstead Township continues…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693337/recognizing-alan-bleams-40-years-of-service-with-plumstead-township"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…Nation.\n\nJerry Landkamer embodies the very spirit and service of the American  Legion. I'm honored to recognize his election to National Vice  Commander and know his family and community share in the same pride of  this well-earned achievement.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695830/recognizing-norfolks-jerry-landkamer-on-his-election-as-national-vice-commander"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…sacrifice,  and patriotism. Let us honor him for his extraordinary service to our  Nation, his devotion to his fellow servicemembers, and his steadfast  commitment to family and community. On behalf of Michigan's 1st  Congressional District, I wish him a joyous 100th birthday and extend  the gratitude of a Nation, he so bravely served.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695299/recognizing-mr-john-moddie-on-his-100th-birthday-and-for-his-service-with-the-590th-field-artillery"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…this level of continuous hard work, service and devotion  to his community and its youth that I proudly commend Richard Reagan  Horn of Huntsville, Texas to his friends, family, community and country  awarding him the 2025 Congressional Veteran Commendation.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696281/recognizing-richard-reagan-horn-with-a-congressional-veteran-commendation"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…Rainbow Springs, Florida,  who passed away on September 16, 2025, at the age of 89.\n\nMr. Lewerenz lived a life marked by service, leadership, and deep  devotion to his family and community. In 1952, he enlisted in the  Florida Army National Guard, beginning a distinguished 33-year military  career that saw him rise from Private to Lieutenant Colonel. As…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697024/recognizing-alfred-thomas-lewerenz"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…long  and admirable life and in reflecting on the profound impact she has  made on all who know her. For Decades, Sylvia has exemplified steadfast  dedication to her family, her community, and her church.\n\nIn 1945, Sylvia married the love of her life, Charles Howard  Thornton, and embraced her calling as a pastor's wife. Together, she  and Charles raised…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697547/recognizing-sylvia-marie-thornton-on-her-98th-birthday"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…The story of the Suarez-Delgado family reflects the best of the  American spirit. From humble beginnings to professional achievements,  their legacy is one of faith, family, and community. It is proof that  the American Dream is alive, that it endures, and that the American  Dream can be fulfilled through generations to come through resilience,  devotion,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695647/recognizing-the-suarez-delgado-family"}, {"senator": "Neal Dunn", "party": "Republican", "sentence": "…the community, who  enjoyed playing cornhole and cheering on Alabama football with his  neighbors.\n\nDeputy May was a model officer who never stopped defending his family  and the community he loved. I ask my colleagues to join me in honoring  Deputy William ``Will'' Paul Thomas May and offering prayers and  condolences to his family and friends. May…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689979/mourning-the-loss-of-walton-countys-sheriff-deputy-william-will-paul-thomas-may"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…his higher nature  and asks, `What is wanted of me?'\n\n``A servant leader has vision. They have knowledge of the past,  recognize what is needed to improve their life, family, community and  world and act to bring about a better future for others.\n\n``A servant leader applies true principles such as: public and  private virtue, natural law, liberty, life,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…discoveries in the facilities  critical outer space work.\n\nDanny then moved to work at the ALCOA plant in Rockdale, Texas, where  he began dedicating his life to his family and several community  volunteer organizations. For twenty-two years he was a board member of  the Rockdale Fair Association, as well as the Goat Superintendent and  Vice-President of…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696328/recognizing-danny-charles-masur-with-a-congressional-veteran-commendation"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…great-grandfather, Tony  shared 66 years of wonderful marriage with his beloved wife, Joan.  Together, they raised six children. He cherished every moment with his  family and community and will be deeply missed.                      Honoring Life of Theodore Schultz\n\nMr. LAWLER. Mr. Speaker, I rise today to honor the life of Theodore  ``Ted the Great''…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699118/recognizing-and-thanking-nate-soule"}]