[{"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…different abilities are a  part of DEI. American workers are a part of DEI. Even women and  families that need IVF, in vitro fertilization to build strong American  families, are all communities that benefit from DEI initiatives.\n\nHere is a news flash: Diversity does not mean Black. Diversity can  mean making sure people who use wheelchairs are not discriminated…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…have been missing more than $9 million that should have  been supporting schools, roads, and essential services. I am proud to  be bringing that money back to the families and communities that have  waited for far too long.\n\nI also want to take a moment to recognize some of the incredible New  Mexican advocates who helped make today possible. This is…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Ms. McCOLLUM. Mr. Speaker, the Republican's Reckless Budget Scheme is  back on the House floor today, proposing the same devastating cuts to  our families and communities in exchange for massive tax breaks for  Elon Musk, President Trump, and their billionaire buddies.\n\nI am joining every Democrat in the House and Senate in opposing…", "date": "2025-04-14", "source_url": "https://justfacts.votesmart.org/public-statement/1690119/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…small business owner with a child  who has type 1 diabetes, told me plainly: ``I need these tax credits so  my baby can survive.''\n\nThis is life or death for so many families in our communities. Yet,  Republicans have refused to extend these tax credits, making healthcare  unaffordable for millions of people.\n\nI refuse to accept Republicans governing in…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698596/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…and dismantle the  important work the Department does, and we won't back down.\n\nThe consequences are clear: Closing the Department of Education will  harm students, families, communities, and the economy. The majority of  Americans support the Department of Education, and I know public school  advocates will be working tirelessly to maintain the strong…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689037/majority-of-americans-support-department-of-education"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…mindless tariffs on our allies and top  trading partners. Let's protect the Bureau of Reclamation and NOAA from  these disastrous sabotage cuts. Let's protect rural families and  communities by opposing cuts to Medicaid and SNAP.\n\nMr. Speaker, I urge my colleagues to reject this resolution that  merely distracts and deflects and scapegoats instead of…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…she worked to ensure  that critical economic and social services programs funded through the  agency had the necessary resources to serve millions of children and  families in communities across the country. Her talents and  contributions will be sorely missed.\n\nI congratulate Ms. Barlow on a distinguished career and wish her the  best in her upcoming…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692562/recognizing-amanda-barlow-on-her-retirement"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…don't have a passport--and half of Americans don't--they  wouldn't be able to register to vote.\n\nThink about that: Tens of millions of women, the backbone of our  families and our communities, stripped of their right to vote simply  because they got married.\n\nImagine a woman who has voted in every election since she turned 18,  who pays her taxes, who…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689394/gop-creating-chaos-in-electoral-system"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…stability and removal.\n\nTerminating Haitian TPS without a humane and legally sound       alternative compounds existing injustices and jeopardizes the       well-being of families and communities across the United       States. We must choose policies rooted in justice, grounded       in law, and reflective of this Nation's fundamental values.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "Mrs. McIVER. Mr. Speaker, I thank the gentlewoman for yielding.\n\nMr. Speaker, I rise today to speak on an issue that has devastated  families and communities across this country: gun violence.\n\nFor years, gun violence has been an unchecked epidemic. In the Black  community, the toll has been heartbreaking and more deadly.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691751/national-gun-violence-awareness-month"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…United       States establish battery safety standards for mobility       devices so that people can use these products without putting       themselves, their families, and their communities at risk.       Your continued leadership on this issue will make a real       difference in the lives of everyday Americans.\n\nDoorDash empowers local businesses…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…educational attainment, preparing young  Americans for success in a changing world and evolving economy. This  movement featured professional educators and engaged families and  communities. It was about general knowledge and practical application.\n\nThis movement launched the United States as a world economic power.  It was essential to our national…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…both--neither one of them fit the categories  that the President railed against during his rallies and campaign.  Instead, these two innocent people were taken from their families and  their communities, far too soon, in instances of senseless violence at  the hands of the U.S. Government.\n\nDonald Trump's immigration enforcement operations have not restored  the…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699485/department-of-homeland-security"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…exemplifies true  service and sacrifice. He has defined what it means to protect and  serve our community.\n\nMr. Speaker, I thank him for all he has done to keep our families and  our communities safe. I congratulate him on his well-deserved  retirement and we wish him all the best.    Commending Glendora and San Dimas High School's Varsity Baseball Teams…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692888/congratulating-jj-spaun"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…the school lunchroom.\n\nDairy farmers in Pennsylvania's 15th Congressional District and  across our country work hard every day to produce nutritious milk for  our families and communities.\n\nI am proud to lead this legislation that would allow schools to serve  flavored and unflavored whole and reduced-fat milk in school  cafeterias. Today, we will restore…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698178/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…from Mississippi, and we do. We all do  appreciate the work of our law enforcement men and women who put that  uniform on every day, risk their lives to protect our families, our  communities, all the things that we care about.\n\nWe hope this resolution is a unanimous vote. We hope both sides  support it.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691031/expressing-support-for-local-law-enforcement-officers"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…services. These gaps are worsened by transportation barriers, doctor  shortages, and hospital closures. These challenges don't just affect  individuals; they affect entire families and communities.\n\nBefore coming to Congress, I spent nearly 30 years in the nonprofit  healthcare field, assisting those with life-changing diseases and  disabilities.\n\nMost of my…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696840/national-rural-health-day"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…Montana's laws and issues. His experience as a widely  respected and effective member of the Montana House has helped him  understand the needs of our State, our families, and our communities.\n\nI believe his time serving in Helena has given him an important  perspective on the law and the importance of judicial impartiality.  Federal judges play a critical…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696331/nomination-of-william-w-mercer"}, {"senator": "Ashley Hinson", "party": "Republican", "sentence": "…have a healthy pregnancy.\n\nSupporting women who choose life should not be a partisan issue.  Every woman who completes her studies while pregnant strengthens our  families, our communities, and our workforce. I hope my colleagues  across the aisle will help to vote to empower pregnant students and  support this vital life-affirming legislation.\n\nMr.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699314/pregnant-students-rights-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…Federal designation, just a recognition, no  property is taken over, but to say: We as a nation remember.\n\nIt is important to the people of North Tulsa because the families and  communities and the businesses in North Tulsa are literally turning  tragedy into triumph. They are looking back on that time and saying  that is what happened on that day, but…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691662/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…and costly efforts to stop it. That is not just a tragedy.  It is a call to action.\n\nHyperbaric oxygen therapy is saving lives and helping veterans rejoin  their families, their communities, and the workforce. With sufficient  funding and support, we can expand this model across Virginia and  across our country. Our veterans deserve a program that can…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700045/hyperbaric-oxygen-therapy-for-veterans"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…Bryan Health's commitment to compassionate care and medical  excellence continues to draw patients from across our State. Their  enduring mission puts patients, families, and their communities first,  and it has earned them the respect and gratitude of generations of  Nebraskans.\n\nOnce again, I congratulate all of Bryan Health's staff and medical  professionals…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690724/recognizing-first-national-bank-of-omaha"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…However, many of these same parents, for any  number of reasons, stop serving as foster families after only 1 year.\n\nIn short, there is a dire need for more foster families in our  communities. Much of the foster care system is coordinated at the State  level, which means we need to enlist the States in helping expand the  number of foster families.\n\nUnder…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688405/recruiting-families-using-data-act-of-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…year in a row, I visited all 60  counties in the Big First District, and I had the chance to hear about  the impacts the One Big Beautiful Bill Act will make on our families  and communities.\n\nAs I visited companies and families across the Big First District,  stop after stop, my fellow Kansans expressed their appreciation for the  wins the bill delivered…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694904/no-place-like-home"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…driving crashes led to nearly 400,000 injuries.\n\nThose crashes do not discriminate, Mr. Speaker. The victim could be  me, it could be you, it could be anyone in our families or in our  communities.\n\nThis issue hits close to home for me. There was a newlywed couple  from my hometown of Enterprise, Alabama, named Angel and Jeremy Seay. I  knew this couple…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693084/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Throughout his time in public service. Walt focused on leaving a  positive impact wherever he went. His mission was always clear: to  support his fellow Veterans, their families, and the communities that  supported them. He dedicated himself to making each day better for his  fellow Veterans, and his leadership, kindness, and dedication will not  be forgotten.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692464/recognizing-the-life-and-service-of-united-states-army-veteran-walt-hartnett"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…principles. Get out and enjoy this Nation's natural  resources, learn something new, or just celebrate with loved ones in  one of our parks.\n\nFree access encourages families and communities to visit, learn, and  participate in the national celebration together. Americans just might  come together during this major national commemoration by getting  outside…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697764/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…our trusted partners and neighbors, and House Republicans  are continuing to pass legislation to support and equip our law  enforcement officers to best serve our families and communities.\n\nMr. Speaker, I thank my colleagues for joining me tonight to talk  about these important topics.\n\nTo do that, I will kick it off right by yielding to the gentleman…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…costing billions and billions of  dollars for the taxpayer, running up our national debt, when they  should be contributing to our economy and contributing to their  families and their communities by doing meaningful work.\n\nFor a long time, there was a bipartisan consensus around work  requirements. In 1996, for example, President Clinton and Newt  Gingrich,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}]