[{"senator": "Tina Smith", "party": "Democrat", "sentence": "…public radio station that the local immigrant rights organization is  getting 400 calls a day from people who are trying to figure out what  their rights are, what to do: A family member of mine is detained. I  don't know where they are.\n\nThis is happening in dozens of cities.\n\nSo what we have here, colleagues, is a campaign. It is a campaign not  about…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…States for her safety which is now being  undermined by this administration.\n\nMr. Speaker, imagine being a United States citizen and the horror you  would feel when your family member, again, someone who had been granted  legal protection, is taken in the middle of the night and driven to  Mexico, a country to which she has no ties.\n\nHow is this making…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689390/president-trumps-immigration-enforcement-policies"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…__________\n\nHello, my name is W.V., and in 2009 my life changed       unexpectedly.\n\nI traveled to Florida for a brief vacation. During that       time, a family member living in New Jersey became seriously       ill, and I traveled there to assist her. Before I was able to       return to my home country of Haiti, a devastating earthquake…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…arriving at an Israeli police station for  interrogation, which is often located in an Israeli settlement. They  are routinely interrogated alone without the presence of a family  member or attorney and often threatened with physical violence if they  don't confess.\n\nNearly half of the approximately 350 Palestinian children currently  detained by Israel…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697313/palestine"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "Ms. TOKUDA. Mr. Chair, I rise in strong opposition to this amendment.\n\nLet's be clear: The Exceptional Family Member Program does not pay  for medical care. Its purpose is simple: to ensure that military  families are stationed where the medical and educational services they  need are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695235/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…application under this       section, accumulated $10,000 or more in debt as a result of       unreimbursed medical expenses incurred by the alien or an       immediate family member of the alien; and\n\n(II) received total income, during the 12-month period       immediately preceding the date on which the alien files an       application under this…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…To tell a family to just double up or triple up drives up their  costs. It is often that the elder who is living with them who might  have dementia demands care. So the family member who is caring for them  has to decide, Oh, my God. Am I going to give up my job, which I need  to pay the rent? Am I going to stay home to take care of them or go to  the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Constitution.\n\nAn attack on these individuals is an attack on all of us. Who is to  say what this ruthless administration will do next or who they will do  it to? Will it be your family member, your friend, or a coworker who is  taken without cause?\n\nI am reminded of a quote from Angela Davis: ``If they come for me in  the morning, they will come for you in the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690503/trump-immigration-policies"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…time.  Everyone is at risk. So there is fear and trepidation.\n\nIndividuals who have other documentation are afraid that they may  make a move that may lead to some extended family member or someone  else who has documentation being arrested, just like this woman had  documentation. So it is a regime of fear.\n\nThe argument Trump made was that when someone…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…to ensure that even if the VA determines that a  veteran has a mental health condition to the point where they can't  cash their own check, the check has to be given to a family member  because they are going through a crisis, congressional Republicans want  that person to be able to go to a gun store and buy a weapon.\n\nMost veteran suicides involve firearms.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692961/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Kenmore, continue to pose lifetime cancer risk from industrial  pollution that is nearly twice the EPA's acceptable levels.\n\nUnfortunately, everyone in Akron has a friend or a family member with  a cancer story. Too often, these stories involve working in rubber or  being too close to a plant.\n\nThe EPA rule that is the subject of this joint resolution estimates…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688529/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…profound.\n\nGovernor Spencer Cox of Utah observed that social media is a cancer  on our society right now, and he encouraged people to log off, turn  off, touch grass, hug a family member, and go out and do good in their  community, and I couldn't agree more.\n\nToday in Toledo, we did exactly that. We celebrated the completion of  a $13.5 million water project…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695469/resisting-the-temptation-to-divide"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…earlier, under the Biden-Harris administration, ICE had  lifted a detainer which had previously been lodged against this illegal  alien after he was arrested for assaulting a family member in June of  2024.\n\nH.R. 875 makes commonsense changes to immigration laws to make an  alien who is convicted or who admits driving under the influence  inadmissible. It…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693084/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…talking--as we talked about the HALT Fentanyl Act-- that there is somebody listening to this program who is addicted to  fentanyl and is looking for a way out; there is some family member  listening who knows they have a family member with a fentanyl addiction  or some other addiction who needs a way out. The SUPPORT Act is giving  them the tools they need…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695793/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…1-minute  remark about something that is important to him, but I wanted to take a  moment to share my prayerful solidarity with my brother from Georgia  because he had a family member, a young girl who was unfortunately lost  in that terrible flood, and I bring that up because we were all  affected by it. We had so many loved ones who were impacted,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Guard is operating, particularly in a case in       which there is an element of misuse of position or of       unauthorized personal benefit to the senior official, a       family member, or an associate.\n\n``(2) Senior leader of the coast guard.--The term `senior       leader of the Coast Guard' means--\n\n``(A) an active duty, retired, or reserve officer…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…constituents want me to support this. But I also support it because  my children and grandchildren deserve better than what we are currently  delivering.\n\nFor example, I have a family member who has gone to medical school.  This individual has taken out enormous amounts of debt to achieve that  significant opportunity to become a doctor and currently is in…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699811/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…arguments.\n\nThis is further evidence of the gamesmanship the Democrats are  playing with people's lives. They are the party of Big Government. They  have, in effect, taken a family member hostage.\n\nI see our leader on the floor here. He has been doing everything he  possibly can to help Democrats release their own hostage, open up the  government.\n\nOnce…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…farm from the Pennsylvania Department of  Agriculture.\n\nA bicentennial farm is a farm that has been owned by the same family  for at least 200 consecutive years, has a  family member who still lives on the farm, and has at least 10 acres of  the original holding.\n\nRichard Metz, Jr.'s newly designated bicentennial farm was founded in  1825 by Johann…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694805/critical-supply-chains"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "Mr. NORMAN. Mr. Chair, my amendment prohibits provisions of gender  transition procedures including surgery or medication through the  Exceptional Family Member Program.\n\nThe Exceptional Family Member Program provides resources to military  families with special needs. This program is designed for military  spouses, children, or…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695252/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…position working on behalf of the Government of       Georgia, including law enforcement, intelligence, judicial,       or local or municipal government.\n\n(C) An immediate family member of an official described in       subparagraph (A) or a person described in subparagraph (B)       who benefitted from the conduct of such official or person.\n\n(2) Sanctions.--The…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Century  Farm from the Pennsylvania Department of Agriculture.\n\nA Century Farm is a farm that has been owned by the same family for  at least 100 consecutive years, has a family member who still lives on  that farm, and has at least 10 acres of the original farmland.\n\nWilliam Farabaugh purchased the family farm in September 1918. He and  his wife had…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695049/supporting-the-stop-of-chinese-fentanyl"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…man or woman, boy or  girl, who has been victimized sexually in this country. Anybody who has  been a victim of sexual assault, or maybe they have been victimized by  a family member, maybe it is not a billionaire, but they are all  waiting and watching to see what we do today.\n\nThey are wondering: If I go to mom or dad, will anything happen?\n\nIf I…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696903/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…possessing obscene material of a minor and filming child porn.\n\nIn my home State of Texas, a criminal illegal alien from Mexico was  convicted for aggravated assault of a family member in Harris County.\n\nIn New York, a criminal illegal alien from Jamaica was convicted for  burglary.\n\nA criminal illegal alien from Mexico was convicted for burglary.\n\nA…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…instinct with this crazy, suicidal empathy would be  to protect an illegal immigrant gang member who could very easily and  has--there are some dangerous people--murdered a family member and  terrorized a community. They would rather tip them off than to have  them deported. These are the facts.\n\nSo what should we do?\n\nHere is what I think: I think it is…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…moment, working to rediscover that capacity for unity is a  matter of the highest urgency to our Nation's future.\n\nA simple thing we can all do: If you have a friend or family member  whom you have stopped talking to because of political differences, this  might be a good time to reach out and to say that  we are still friends and still family. Politics…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695355/tragic-loss-of-charlie-kirk"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…for our  Department of Defense's continued commitment to searching for our  missing soldiers, and I am very hopeful that we can one day bring  closure to each and every family member and friend of our POW/MIA  servicemembers in this conflict.\n\nAt present, it's estimated there are just over 5 million Vietnam  veterans still alive today. Many have experienced…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688919/recognizing-the-service-of-our-vietnam-veterans"}]