[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "For these vulnerable populations, the FCC's Lifeline program can help struggling families afford basic internet and telephone connectivity at a time when they need it most -- but only if they know about it."}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "We only need one more Republican to sign, one more  to help American families afford healthcare."}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "We  need to help families afford daycare."}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "In April, the Trump administration abruptly fired the entire staff  overseeing the low-income Home Energy Assistance Program, which helps  working families afford their utility bills."}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "I am proud to share that, in our  State, education and nonprofit leaders are working to find innovative  solutions to help families afford childcare through scholarships and  tax credits, but also, and this is crucial, to grow the supply of  childcare providers and create critically needed seats."}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "\"If the federal government doesn't provide support to help providers remain open and working families afford tuition, we risk losing millions of child care slots across the country and letting families and providers who were already struggling fall further behind."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "Our proposal lays out steps the Senate should be considering, like helping laid-off workers keep their employer health plans, expanding Medicaid, and creating a special enrollment period, in order to give American families affordable health care coverage during the COVID-19 pandemic,\" Durbin said."}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "Illinois receives about $400 million from the Child Care and  Development Fund and another $500 million from TANF that help low- income working families afford quality childcare."}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "After spending the last few weeks threatening access to childcare  support and doing literally nothing to help millions of Americans  afford their healthcare, Republicans want to direct taxpayer dollars  away from helping families afford necessities like food, rent, and  childcare to crisis pregnancy centers that prey on vulnerable women  seeking legitimate reproductive healthcare."}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "At the start of this  year, 22 million Americans saw their premiums go up in 2026 because  Republicans refused to extend tax breaks to help families afford their  healthcare."}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "This tax credit will help  multigenerational families afford to make the upgrades necessary for  seniors to age gracefully in one place."}]