[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…infrastructure projects when the cost of materials goes up?\n\nIt is going to increase costs. It is going to delay projects. And,  once again, who pays the price? Working families across America.", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689475/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…and we are  unified in our fight. As a matter of conscience and conviction, we will  not be bullied.\n\nDonald Trump should know that we will stand strong for working  families in America. They deserve healthcare. It is about saving  healthcare and holding Donald Trump accountable to follow the law. When  there is a budget, when it is passed by Congress…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695920/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…inflation highest since 2022 as  Trump tariffs pile on.'' Or this one: ``Poorer Americans hit hardest as  tariffs fuel price rises.''\n\nMr. Speaker, it is a cold winter for families across America under  Trump's America, under his failing economic plan, and tariffs that are  not even legal and which this House of Representatives, under the GOP,  voted yesterday…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695608/devastating-harm-caused-by-trump-administration"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…individual family right now, these tariffs mean a $2,000 tax  per family. Tools are up. Audio equipment costs more. This is the  effect of this tariff policy on individual families in America.\n\nSo we can have high-ended debates here, but at home, they are looking  at their grocery prices. They are looking at their markets, their  family farms--that they spent…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…areas, in small towns, and the inner city. That is a  fact.\n\nIf you want to give tax breaks to the wealthiest people and you don't  care about the impact on the regular families of America, that is  exactly what happened with the Republican tax bill, and that is the  reason why Democrats  did not support it. We believe that tax cuts should be geared toward…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…cut they wanted to  extend to the people who make the most money off this system and these  cuts because the tax cuts they will get will be billionaires.\n\nAnd working families in America, the people who are paying insurance  rates--hurts; it is hard; it is difficult. The people who have high  premiums, copays--it is the rest of us that pay.\n\nSo I want…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…bill go  through. They can help me lower prices right here, right now. I am very  disappointed. This bill would lower prices at the grocery store for  hard-working families all across America. And by stopping it from  passing, you and your Republican colleagues--well, I am afraid you are  telling the American people that their kitchen table isn't your…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698816/9999"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…our parents need the help of medical professionals to care  for them properly. That is why Medicaid is so vital, so important, such  a lifeline to tens of millions of families across America. The  Republican Medicaid cuts would be a gut punch to these families.\n\nIt was the same story on Long Island. Senior citizens are scared,  nervous, angry about what…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689512/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "Mr. CASTEN. Mr. Speaker, families across America are struggling with  ever-increasing energy prices.\n\nIn the last year, electricity prices have soared, increasing by 13  percent under the Trump administration. Utility…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700229/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…tax breaks for billionaires, Democrats are  working to protect affordable coverage, lower prescription drug costs,  and expand access to healthcare for working families because in our  America, healthcare is not a privilege for the wealthy few. It is a  right for every American.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695218/millionaires-tax-breaks-in-big-ugly-bill"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…people that  their government will be there to help them when they are at their most  vulnerable.\n\nThe fact is that these cuts will mean life-altering changes for  families across America and will lead to nursing homes being closed,  doctors refusing to care for patients, healthcare claims being denied,  and more debt and increased costs on the backs…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688235/democratic-proposals"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…percent of births in America are funded by Medicaid.  Republicans who claim to be pro-family are coming for Medicaid with a  sledgehammer.\n\nWhat would this mean for families across America? It would mean even  worse maternal health outcomes, States rescinding policies that improve  access to reproductive care, and decimating access to prenatal care,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691443/gop-tax-scam-hurts-women-and-families"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…SNAP program--used to be  known as food stamps--in his Big Beautiful Bill--not so beautiful--that  will reduce or eliminate food assistance for more than 22 million  families. This is America. This President gives 20 million bucks to  Argentina, but he can't find the money for American citizens.\n\nAnother is the administration's attacks on immigrant workers,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…exercising  their free speech rights. Elected leaders, including myself, breathe it  after watching colleagues and public figures gunned down in front of  their families.\n\nThis is the America we are living in right now, and this is not okay.  We don't need to agree with someone's politics to say that their murder  is a tragedy. The assassination of Charles…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695714/calling-for-empathy-in-the-face-of-tragedy"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…So Democrats will show the American people another way forward, a way  focused on lower costs, more prosperity, and an agenda focused on the  working- and middle-class families of America--not the billionaires,  not the special interests, not the huge lobbyists who seem to dictate  what the Republicans do.                               U.S. Coast Guard…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…is, what we are doing here as  Republicans is putting more money in your pockets, creating more  opportunities for the American people, for American families, and  families all across America are feeling it today.\n\nAmericans are no longer seeing these sky-high increases in prices  like we experienced over the 4 years of the Biden administration--not…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699081/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…dollars of debt that were racked up had  consequences, Mr. Speaker.\n\nIt had consequences not only in terms of our national debt, but it  affected the pocketbooks of families all across America because that  bloated spending in Washington, which is money we don't have, by the  way; and it increased inflation to the point where people couldn't even  go to…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…Housing for the  21st Century Act, a bill that advances exactly what Americans voted  for: fewer bureaucrats, more builders, lower costs, and real results.\n\nRight now, families across America are still recovering from Biden- era inflation, sky-high interest rates, and a Washington regulatory  state that makes it harder and more expensive to build a home.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…rates low on hardworking families and his  opponent said she wanted those cuts to expire so those tax rates would  go up on those hardworking families.\n\nThe hardworking families of America said where they wanted to go. In  fact, the majority of all Americans said they don't want their taxes to  go up.\n\nThink about which tax rates will go up. On the other…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…with the Federal Reserve of New York when they say that to cap this fee  to do price intervention here is to deny credit and deny this product  to the hardest working families in America.\n\nMr. Speaker, I urge a ``yes'' vote, and I yield back the balance of  my time.\n\nMr. HILL of Arkansas. Mr. Speaker, on that I demand the yeas and  nays.\n\nThe yeas and…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…we have Yellowstone National Park; we have the Grand Teton.  These are more than parks; they are part of our State and our Nation's  rich history and heritage.\n\nFamilies from across America and around the world visit Wyoming, our  national parks, and other national parks. They do it every year.\n\nUnder a Schumer shutdown, those plans will be forced to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695529/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…it. Democrats voted against the American Dream, while we fought and  will continue to fight to protect it.\n\nThe One Big Beautiful Bill Act is an investment in America's  families, America's workers, and America's future. We are lifting up  the middle class, restoring fairness, and proving once again that,  under Republican leadership, the American Dream…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694797/promises-made-promises-kept"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…prices have increased by 13  percent since 2022, and overturning misguided policies like this RMP  amendment will help make the cost of living more affordable for  families across America.\n\nIt is time to unleash our domestic resources to put this money back  into the pockets of American families by repealing the Biden  administration's anti-American…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…spending in Washington, for  Washington, at their expense.\n\nWhat does this bill do? It says that we are finally going to turn  that around and deliver a bill that focuses on families in America.\n\nWe hear a lot from the other side, Mr. Speaker, about billionaires,  tax cuts for billionaires. If you go look at this bill--everybody has  had an opportunity to read…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…critical pieces of  legislation being considered. I urge Congress to pass these commonsense  bills to lower the cost of living not only for Buckeye families but for  families across America.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698639/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…Carolina. Mr. Speaker, this is an opportunity this  evening to vote for a budget resolution that extends tax relief for  working families.\n\nIf Members want to support working families in America, vote for  this. It makes the Trump tax cuts permanent. It also provides security  for our southern border. It unleashes American energy, and it sets the  stage for…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…agents as a direct result of  our One Big Beautiful Bill Act. This will mean stronger borders, safer  Texas communities, and definitely greater peace of mind for our  families.\n\nAmerica's future is shining brighter than ever. With the economic  policies of the One Big Beautiful Bill Act to lower costs, increase  wages, and expand job opportunities, I…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694791/promises-made-promises-kept"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…security. During a time of high inflation across       the country, this misguided rule will almost certainly lead       to higher energy prices for working class families across       America. Restricting access to energy development limits       consumers' access to affordable, reliable energy.\n\nFurthermore, oil production on the North Slope and in…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…American culture seem to have weaker  family ties than those people who are coming here from other countries.\n\nIt is my personal belief that the reason we have weak families in  America--and one of the reasons why our American children cannot do as  well as children whose ancestors come from Pakistan or India or  Philippines--is that we have such strong…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}]