[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…where he not only was a respected leader but  a beloved manager and colleague known for his generosity, mentorship,  and unwavering support.\n\nMost of all, his love for his family was insurmountable and deeply  felt by all of those he cared for, especially his wife Sreelatha and  his daughter, Priya. His memory will live on with those that were  touched…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689774/congratulating-chief-keith-johnson-on-his-retirement"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…instability farmers face in trying to earn a living. This informed her  work at the Minnesota Farmers Union (MFU), where she has advocated for  affordable healthcare and the needs of family farmers. Additionally,  Linda has been a strong leader for women in farming. In 2013, she  helped reestablish the MFU Women's Conference and later received the  2013 MFU Leadership…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690447/congratulating-linda-larson-on-her-graduation-from-inver-hills-community-college"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Republican or a Democrat deal. This is about  seeing two innocent people shot when they didn't need to be.\n\nYou know, one of the things that is so important for us if we have a  family and if we live in a community is to act in a way in which the  people around us can be confident that we have got their backs; that we  won't hurt them or harm them; that we…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699407/9999"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Scarsdale.                  Trump Administration's Attacks on Families\n\nMr. LATIMER. Mr. Speaker, I rise today to condemn the Trump  administration's recent attack on childcare and family assistance. This  administration has decided to freeze funding for three critical  programs in New York and four other Democratic States. As usual, they  are putting their…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699265/recognizing-the-scarsdale-forum"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…Annie, also from Bend, shared with me her costs  could jump to almost $1,700 per month.\n\nThere are countless more stories like these, Mr. Speaker, and that is  unacceptable. No family should have to choose between getting the care  they need and putting food on the table.\n\nMr. Speaker, I will keep fighting to protect healthcare, lower costs,  and make life…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697135/healthcare-open-enrollment-for-oregonians"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…irony here is? President Trump could  actually be the person who does good in this. He can still change his  mind.\n\nSpeaker Johnson is a true Christian. I know him. I know his family.  He is a good Christian man. He can be for bringing justice. I really  don't understand why we are fighting over this. Why don't we do  something good for this country? Why…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694883/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…TPS       Alliance.\n\nI have lived in Malden, Massachusetts for over 20 years       with my wife and two U.S. citizen children. I work hard every       day to provide for my family and to be a productive member of       my community in Malden. I am very proud of my two children.       My oldest is 19 years old and is in the second year of       college.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…KRISHNAMOORTHI. Madam Speaker, I rise in strong opposition to  H.R. 3492.\n\nThis measure would allow politicians, not doctors, not families, to  decide medically necessary care for family members. It criminalizes  medically necessary, evidence-based lifesaving care, and it threatens  parents and physicians with prison time for providing care for their  kids.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698351/protect-childrens-innocence-act"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…United States for her safety which is now being  undermined by this administration.\n\nMr. Speaker, imagine being a United States citizen and the horror you  would feel when your family member, again, someone who had been granted  legal protection, is taken in the middle of the night and driven to  Mexico, a country to which she has no ties.\n\nHow is this making…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689390/president-trumps-immigration-enforcement-policies"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…community member and leader in San Jose, for his  selfless dedication to Vietnamese refugees and to cultural  preservation.\n\nBorn in 1933 in northern Vietnam, Loc Vu and his family fled their  homeland during the fall of Saigon, ultimately finding refuge in San  Jose, California, the largest community of ethnic Vietnamese of any  city outside of Vietnam.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698268/recognizing-the-life-of-colonel-vu-van-loc"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…A veteran teacher in the Rochester City School District, Monica has  also volunteered extensively throughout the Jewish community, including  service on the board of Jewish Family Services. Her experience in the  Wexner Heritage Program--a prestigious two-year leadership initiative-- helped her forge deeper bonds across our city and champion unity across…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691572/recognizing-monica-gurell"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…Now, after shutting down the government for weeks, delaying further  weeks, they offer this sorry bill, this loser, wrapped up in a bow for  Christmas.\n\nTo Andrew and his family down in Austin, this phony bill means zero  relief on premiums, premiums that are going to spike for his family by  nearly $2,000 per month. It means nothing for Russell, a…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698310/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…lying awake at  night running the numbers, wondering which bill they can delay paying  this month.\n\nA report from the Joint Economic Committee found that the average  American family spent $1,625 more because of inflation than the year  prior. In Oregon, families paid $1,791 more than the year before.\n\nIt doesn't have to be this way.\n\nI grew up working…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699588/stop-the-republican-affordability-crisis"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…was a diagnosis similar to spinal meningitis--that wasn't the exact  diagnosis--but I was actually in the hospital for 3 months. And even  though I made a full recovery, my family was not able to find health  insurance for me at any price, and that is because I had been labeled  as a child with a preexisting health condition.\n\nAt that time, insurance…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695650/healthcare"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…sort of in the rearview mirror, people just think  they get onto the ACA portal; they sign up for their healthcare; and  they pay what they pay, right? Like, Oh, I am on a family plan. I want  ``this'' level of deductible. Then it spits out how much you are going  to pay every month. What tens of millions of people don't actually know  is that those…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…to know him, or to even call him a friend agrees with  this sentiment.\n\nMr. Speaker, I congratulate Vance on a well-earned retirement. May  God continue to bless him and his family as he enters a new and  exciting chapter in his life.                           Recognizing Scottie Cook\n\nMs. FOXX. Mr. Speaker, I rise to recognize Mr. Scottie Cook, a career…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697290/recognizing-valencia-abbott"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Patricia Furlong has made to our community  through her volunteerism with the Pregnancy & Family Life Center. Ms.  Furlong is part of a team of selfless and dedicated women who have  worked at the Center in Inverness for several years. Their roles  include working each…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691825/recognizing-patricia-furlong"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Teresa Piechowicz has made to our community as a  volunteer with the Hernando County Family YMCA. The Hernando County  Family YMCA is more than just a place--it's a community, a support  system, and a beacon of hope for so many. None of that would be  possible without…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692159/recognizing-teresa-piechowicz"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…issues.\n\nNow, Mr. Speaker, I ask that we lift Grant up in our hearts, our  minds, and our prayers. We recently learned that Grant is receiving  hospice care, and I want him, his family, and all who know him to  understood his impact. He roamed the Halls of Congress, indifferent to  politics, to make sure the  voiceless were heard and reflected in our policymaking.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688646/recognizing-grant-smith"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Birkhead, a remarkable constituent from my district. It is my honor to  celebrate her on her 100th birthday--a day marking a hundred years of  love, laughter, and commitment to her family, friends, and community.\n\nBorn on August 30, 1925, in Trenton, New Jersey, Helen has  experienced a century full of changes and milestones. Her life story  stands not only…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694743/recognizing-helen-birkheads-100th-birthday"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…108 years of age on April 21, 2025.\n\nMargaret was born in Deer Lodge, Montana on April 21, 1917. Her  parents were John Matthew Briggeman and Gerena Wolfe Briggeman. Their  family moved with the Wolfe family to Lemhi, Idaho about 1920.\n\nMargaret attended grade school in a one-room schoolhouse in Lemhi.  She then attended Idaho State College in Pocatello,…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690129/recognizing-the-108th-birthday-of-margaret-elizabeth-mortensen"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…will allow the Y to open 50 new childcare slots, giving  working parents in Jasper County the reliability and support they  urgently need.\n\nAccess to childcare is not just a family issue. It is a workforce  issue. When parents can't find childcare, they can't work, which hurts  local businesses and the entire economy.\n\nThe Newton YMCA is a pillar of its…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696794/highlighting-critical-investments"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…serve: We want to help with your healthcare. We want to stop the  cuts to NIH and CDC. We want to reduce the increases in health  insurance costs. We want to help you and your family.\n\nIn my home State of Delaware, emergency room wait times are too long.  And as millions of Americans get thrown off of health insurance, they  are going to go to the emergency…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695942/government-funding"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…very young age, he has  always been the first to lend a hand to anyone in need--and often to  those who never even had to ask. Steve has also built a loving, faith- filled family with his wife, their three children, and grandchildren.\n\nProfessionally, Steve has had a long and dedicated career at Ledwell  & Son Enterprises. Through his work, he has extended…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696827/recognizing-congressional-patriot-award-recipient-steve-ledwell"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Fairchild, the owners of this Christmas tree farm,  were very welcoming. I was fortunate to meet their three daughters-- Bailey, Brooke, and Blair--along with other members of the family  during my visit.\n\nWestern North Carolina for many years has produced impeccable  Christmas trees that have been featured at the White House and are the  most beautifully grown…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697374/fun-with-math"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…lifesaving  efforts in responding to a medical emergency at Nub's Nob Ski Resort.  Due to his courage and professionalism, a life was saved, and a man in  need will return to his family safely.\n\nOn January 3, 2026, while cross-country skiing off duty at Nub's Nob  Ski Resort, Sergeant Wagner observed a skier collapsed along the side  of the trail. Without…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699808/recognizing-michigan-state-police-sergeant-dennis-wagner"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "Mr. KEAN. Mr. Speaker, I rise today to recognize Jay Post--a  dedicated patriot, family man, and valued member of his community. Jay  moved to Westfield, New Jersey, in 1951. He graduated from Westfield  High School in 1957 and earned his degree from Siena College…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691577/recognizing-jay-post"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…make their State a better place. There is no  scenario in which that dedication to public service should have cost  them their lives.\n\nWe stand with John and Yvette and their family as they continue to  recover from the horrible attack.\n\nI know that the friends and family of Mark and Melissa are proud of  the legacy they left, and they have left a strong…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692863/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…their courage and their service and their legacies are  recognized by the highest office of our land, the Office of President.\n\nThe medal of sacrifice will ensure that when a family member, a  spouse, a son, a daughter, or a department, that when they reflect on  the end of watch for their friend or their hero or their loved one,  they will know that it…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699504/medal-of-sacrifice-act-of-2025"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…thankful for our  Department of Defense's continued commitment to searching for our  missing soldiers, and I am very hopeful that we can one day bring  closure to each and every family member and friend of our POW/MIA  servicemembers in this conflict.\n\nAt present, it's estimated there are just over 5 million Vietnam  veterans still alive today. Many have…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688919/recognizing-the-service-of-our-vietnam-veterans"}]