[{"senator": "Linda Sánchez", "party": "Democrat", "sentence": "…strategic. It is just reckless. Frankly, it is bizarre.\n\nWe are now seeing the consequences of allowing the President's  unhinged behavior go unchecked. American families, small businesses,  and farmers are paying the price for these endless trade wars.\n\nTrump's tariff tantrums have cost households more than $1,600 a year  in higher prices. Families…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699972/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…America at risk. Straining  ties with trade alliances also put us at a security risk. Trade wars  have lasting consequences. Trade wars devastate Americans working  families and small businesses and manufacturers.\n\nArticle I, section 8 of the U.S. Constitution gave Congress--gave  Congress--the explicit authority to impose duties and regulate  commerce,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689522/klobuchar-ms-murkowski-mr-warner-mr-mcconnell-and-mr2024"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…Harvard filed a lawsuit against the  administration, arguing that its freezing of research funding is  unconstitutional and flatly unlawful.\n\nThough undocumented families and small businesses were explicitly  encouraged for decades by government and legal counsel to come forward  out of the darkness and pay their taxes through their ITIN number, the…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690851/opposing-illegal-power-grabs"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…America at risk. Straining  ties with trade alliances also put us at a security risk. Trade wars  have lasting consequences. Trade wars devastate Americans working  families and small businesses and manufacturers.\n\nArticle I, section 8 of the U.S. Constitution gave Congress--gave  Congress--the explicit authority to impose duties and regulate  commerce,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689549/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…highest in 4 years. We are now veering  toward stagflation: rising prices and a cooling job market.\n\nNo matter what you call it, the reality is clear: American families  and small businesses are struggling. The President came into office  promising to lower costs and make life more affordable. Instead, he has  delivered the opposite with a massive tax…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695597/fed-rates-and-stagflation"}, {"senator": "Lauren Underwood", "party": "Democrat", "sentence": "…just 3 weeks, the  Affordable Care Act tax credits that helped millions of Americans  afford their premiums will expire. These tax credits have been a  lifeline for families and small businesses across the country. They  have allowed people to see their providers, to fill their  prescriptions, and to get the procedures that they need.\n\nThese tax credits…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697855/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "Mr. PAPPAS. Madam Speaker, I rise today because the House has a  critical opportunity to support families and small businesses who are  struggling to afford healthcare for 2026.\n\nI am thinking of the parents I have talked to who will drop coverage  for their families because their premiums…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698696/supporting-families-and-small-businesses-struggling-to-afford-health-care"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…the  healthcare tax credits, the health insurance premiums of millions of  Americans will double next year. This premium increase will be felt by  many, including families, small businesses and their employees, and  people living in rural communities. I am committed to lowering  healthcare costs and will do everything I can to get this done. I urge…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696995/hr-5371"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…premiums, and it is not affordable. By the  way, these are folks, some of whom voted for Trump, some of whom  didn't, but all of whom deeply care about their families and their  small businesses and their farmers. I will give you an example.\n\nA family of four making $130,000 a year--a very good income in  Vermont--would have paid $1,200 a month in 2025.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…progress in States like  Massachusetts, where strong State-level appliance efficiency programs  are projected to cut energy costs by $13 million each year by 2044 for  families and small businesses, while fighting climate change. Let's not  forget that these rules have support from industry, but now they are  the target of political theater out here on the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690527/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…wisely voted to extend the subsidies, and the Senate needs to do the  same.\n\nThe same affordability crisis is playing out with energy costs. I  hear it every day from families and small businesses who simply cannot  afford another rate hike. That is why I helped found the Congressional  Lowering Utility Bills Caucus, to push real, practical solutions that…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699587/stop-the-republican-affordability-crisis"}, {"senator": "Linda Sánchez", "party": "Democrat", "sentence": "…change for Trump and his billionaire  buddies. Higher prices on groceries, cars, housing, utilities, and  other basic necessities don't impact them.\n\nHowever, working families, small businesses, and farmers are  certainly feeling the pain of these trade wars. Trump's tariffs are  increasing prices on everything for them, and Republicans are letting  it happen…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699901/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…the wealth of the  richest than they do about the healthcare for every family in our  country.\n\nAnd at every opportunity, Republicans are looting healthcare from  families and small businesses in order to pay for tax breaks for people  who already have too much. They are robbing the American people, and  they are asking the Democrats to drive the getaway…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…with my  colleagues on both sides of the aisle to preserve the vital programs  that we need to keep our country safe.\n\nI am committed to speaking up for American families and small  businesses that have been shouldering the burden of higher costs  because of President Trump's trade wars.\n\nSo I know he is not listening, but I call on President Trump to…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690349/9999"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…require the President's  signature.\n\nI spent a great deal of time back home hearing about the importance  of these tax cuts and how they have benefited not just Texas families  but small businesses throughout the State.\n\nI know most of the time when we think about job creators, we think  about Fortune 500 companies, but the fact is, in Texas and across the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…there are communities with  limited food and drink retail options. It is not uncommon for a  convenience store to bridge that gap in providing food to American  families.\n\nThese same small businesses, which are often owned and operated by a  single family or an individual, cannot afford the new equipment  mandated by these unreasonable standards. In fact,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689265/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…with a  strong reconciliation package that reflects President Trump's America  First agenda.\n\nThe bill secures our southern border, keeps taxes low for working  families and small businesses, strengthens our economy, protects Social  Security, restores American energy leadership, supports our men and  women in uniform, and brings much-needed accountability…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689009/recognizing-salvation-army-of-harrisonburg-and-rockingham-countys-100th-anniversary"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…times of change and growth while staying true to its  mission of serving everyday Americans. Under his leadership, Principal  remained a reliable partner for working families and small businesses,  helping them prepare for the future, plan for retirement, and weather  economic uncertainty. He championed a people-first approach to  financial services that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695028/recognizing-the-service-and-leadership-of-dan-houston"}, {"senator": "Max Miller", "party": "Republican", "sentence": "Mr. MILLER of Ohio. Mr. Speaker, Ohio families and small businesses  continue to face unprecedented healthcare costs, making it increasingly  difficult for my constituents to access affordable, high-quality care.\n\nSince the enactment…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698389/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…legislation led by my friend Representative Stephanie Bice.  This reverses yet another burdensome Biden administration mandate that  will add senseless costs for families and small businesses for no real  benefit.\n\nThe Biden Department of Energy's rule on walk-in refrigerator  equipment is a textbook example of government overreach. This rule  imposes…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689268/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…ensuring our servicemen and -women in Utah and  across the world receive the care and support they deserve.\n\nThis legislation is designed to put hardworking Americans, families,  and small businesses first, including my constituents in Utah's Third  District. By passing this bill, Republicans have delivered on the  promises we made to the American people.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694171/benefits-of-one-big-beautiful-bill"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…she has championed innovative approaches to serve the underserved and  underbanked, expanding access to fair, transparent, and affordable  financial services for families and small businesses alike. Her  leadership reflects the very best of what community driven institutions  can achieve when guided by a mission of service over profit.\n\nKelly has also…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696273/recognizing-chief-executive-officer-of-trumark-credit-union-ms-kelly-botti"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…constituents in  California's 40th District. Under Governor Newsom's rule, California  has repeatedly chosen to decouple from Federal tax relief, denying  hardworking families and small businesses much-needed breathing room  after years of Bidenflation.\n\nCalifornians are struggling with some of the highest taxes and cost  of living in the Nation and are getting…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699679/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…commitment to the American people that  would secure a better future for all of us.\n\nThis resolution secures the opportunity for tax cuts for hardworking  American families and small businesses. It reins in the regulatory  overreach that has long stifled our economic growth. It roots out  waste, fraud, and abuse in the Federal budget.\n\nIt is simply common…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689915/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…leaving skilled workers questioning the sustainability of the       current economic environment. Passing the CRA resolution       sends a clear message to families, small businesses, and       energy partners that Montana is open for responsible       development. I urge the Senate to support S.J. Res. 61 so we       can secure Montana's economic…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Mike Carey", "party": "Republican", "sentence": "…and Jobs Act, to enshrine border security into law, and to  move forward toward American energy independence.\n\nAfter enduring years of high inflation, American families and small  businesses urgently need tax relief in order to thrive. We must pass  our budget resolution today to start the budget reconciliation process  and advance the policies that…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689894/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…statement of administration policy strongly supports this  resolution.\n\nMr. Speaker, Alaska is ready to power America. We are ready to help  lower energy costs for families and small businesses. We are ready to  strengthen national security by reducing our reliance on foreign  nations. The people who live in Alaska's Far North, the people whose  ancestors…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696835/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…those three today because they are about safeguarding public lands,  fostering economic growth, and empowering our communities. They are  about letting ranchers, families, small businesses, and entrepreneurs  benefit from thoughtful and responsive government as opposed to  government that drowns out their voices and ignores their needs.\n\nMr. Speaker,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689196/work-highlights-of-western-caucus"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…100,000 Americans.\n\nNext, this bill enables us to permanently protect tax relief.  President Trump's Tax Cuts and Jobs Act provided critical relief to  middle-class families and small businesses. Americans are still  experiencing high prices because we are still recovering from  Bidenomics.\n\nPrices are up 21 percent. Real wages have declined by more than…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}]