[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Tel Aviv; when the President of the United States, with signature  bombast, began to telegraph the possibility that we would enter the  fray; when countless American families were forced to consider whether  their children would be the next to bear the burden and carry the  sacrifices of another potentially endless war in the Middle East.\n\nAnd so with…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…crisis.\n\nBoston has long been a city that values immigrants and       recognizes their role in our shared future. Please find       compassion and empathy to ensure families are not forced into       the shadows, separated from their loved ones, or pushed into       harm's way by the termination of TPS. Everyone deserves       stability and the opportunity…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…bill--that is projected to increase electricity prices  for American families by 61 percent. Nearly 1 in 20 American households  are in severe utility debt. This winter, families are forced to make  the impossible choice of heating their homes or putting food on the  table.\n\nWe have to address this issue, but somehow that is not enough for my  Republican…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…consequences are  devastating, and the cruelty is deeply disturbing.\n\nThis policy punishes those who can least afford it: seniors on a  fixed income, veterans, and families already forced to choose between  gas and groceries.\n\nStates will be stuck in a corner. They will cut benefits, cut  eligibility, or cut public safety, education, housing, and mental…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693203/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…can to support our  young families and make raising kids more affordable. These policies  are doing the exact opposite.\n\nWith this administration's sweeping tariffs, families will be forced  to pay even more for the products they need to care for their children  such as high chairs, cribs, strollers, and car seats. Car seats are not  an optional purchase.…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689419/protecting-american-families"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…healthcare plans that they need. Democrats are fighting to bring  your costs down. If you take away the credits that millions of  Americans depend on to afford coverage, families will be forced into  junk plans that don't cover their needs or will have no coverage at  all. When they get sick or hurt, it will cost even more.\n\nThis is a good day for Americans.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698811/breaking-the-gridlock-act"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…Americans I represent in the San Joaquin Valley are  concerned about is bearing more and more of this burden and not seeing  any potential light at the end of the tunnel.\n\nFamilies are forced to make impossible choices between putting food  on the table or whether or not they should keep their healthcare  coverage.\n\nIn July, President Trump's one big--I never…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697385/healthcare-crisis"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Here is what that means in real life: seniors losing nursing home  care, children losing access to basic checkups, cancer patients cut off  in the middle of treatment, and families forced to choose between a  doctor's visit and rent.\n\nRepublicans say these cuts are about cutting waste, fraud, and abuse,  but Americans know what this really is. It is an…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…spend 3  percent of their income on energy costs, low-income households often  spend 15 percent or more. Under the MAGA Republican plan, many senior  citizens and families would be forced to choose between buying  groceries or cooling their homes during record-breaking heat.\n\nIt could get even worse for these families. President Donald Trump  has proposed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695056/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…them.\n\nNow, families are seeing premiums jump by hundreds, even thousands,  of dollars a month. That is utterly devastating and was entirely  avoidable.\n\nMiddle-class families are being forced to cancel coverage. People  with cancer are going uninsured. Small business owners are being told  to pay 34 percent more, or $40,000 a year, or go without care.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698797/breaking-the-gridlock-act"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "Mr. HORSFORD. Mr. Speaker, for more than a year now, working Members  and families have been forced to pay the price for Donald Trump's  illegal tariffs. Let's call them what they are. Blanket tariffs are  blanket taxes. They are taxes that the American people have…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700196/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…thousands of  dollars that the President's tariffs have already cost American  families.\n\nThe Republicans have no plan to address the affordability crisis.  American families are forced to pay the price, and this bill is only  going to make it worse.\n\nMr. PALLONE.\n\nMr. Speaker, I once again rise in strong opposition to this bill. I  have to say that…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…like to say thank you to Steny  Hoyer for an incredible career and for being a role model and my  friend. He is always a class act.\n\nI also rise today to speak for the families who are forced to choose  between groceries, rent, and healthcare because prices keep climbing.  Affordability is equal to economic stability. Let me repeat that:  Affordability…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698830/putting-americans-first"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…benefits.\n\nToo often, that wait stretches from months and sometimes into years.  During that time, veterans are left in limbo, unable to work,  struggling to support their families, and forced to navigate a system  that moves far too slowly for the urgency of their lives.\n\nAcross our district offices, our caseworkers hear directly from  veterans who are desperate…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699209/veterans-law-judge-experience-act-of-2025"}, {"senator": "Lauren Underwood", "party": "Democrat", "sentence": "…vote on that extension today, but if Republicans let these tax  credits expire, premiums will soar. Healthcare will be out of reach for  tens of millions of Americans. Families will be forced to go uninsured  or make incredibly tough choices just to make ends meet. This is life  or death for people.\n\nHealthcare should be a right for everyone, not an unaffordable…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697855/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…must act now if America is to, once again, be a rising nation, but  we are currently on a path toward decline. If we continue down this  unsustainable path, American families will be forced to deal with even  higher inflation, confiscatory tax rates, rising interest, and a weak  economy. It will be harder to find a job and provide for your family  because…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Every year, I have introduced legislation to preserve stepped- up basis and to stop far-left Democrats' farm killer tax. For decades,  stepped-up basis has protected families from being forced to pay  capital gains taxes on inherited assets.\n\nPresident Biden tried his best to remove this provision, which would  have resulted in the destruction of family…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690715/help-small-businesses-thrive-again"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…their respective cemeteries, which are currently located on U.S. Forest  Service land and operated under a special use permit. If the cemeteries  are not expanded, families will be forced to travel long distances to  distant cemeteries to visit their deceased relatives.\n\nTo address this need, Pinedale and Alpine have worked with their  respective counties…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691144/apache-county-and-navajo-county-conveyance-act-of-2025"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…they recover from this heinous attack, as well.\n\nThere is no place in our country for politically motivated violence.  None. The fact that the Hortman and Hoffman families are being forced  to endure the consequences of inexplicable evil is heartbreaking,  devastating, and infuriating for us all, but it is through tragedies  like this that we are reminded…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692785/in-memory-of-mark-and-melissa-hortman"}]