[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…man's head into the ground so hard  that he was concussed. In Illinois, a woman was shot five times, while,  in Indiana, a man was punched in the face and dragged outside his  family home in the early morning hours. It didn't matter whether  children were present; agents acted with reckless disregard for their  safety and well-being. In Idaho, children…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699087/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jake Auchincloss", "party": "Democrat", "sentence": "…the healthcare.\n\nMr. Speaker, as we discuss cuts to this program, we must not forget  the people behind these budgetary numbers. As such, I will highlight  one Massachusetts family today. I will be reading a poem entitled,  ``The Mathematics of Mercy.'' It was written by Betsy Johnson. Betsy is  an autism educator with the ARC of Massachusetts and a mother…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690834/advocating-against-medicaid-cuts"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…career on track and  just hope you will get better.\n\nIt doesn't make our skies safer, but it does lead to horrible and  avoidable tragedies.\n\nIt hit home for me when a Chicago family told me about their son who  was studying to become a pilot, and he took his own life. He knew that  he needed help, but he didn't want to be grounded. That young man would…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695007/mental-health-in-aviation-act-of-2025"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…resilient local food systems in our state. She is currently  President of the Maine Dairy Industry Association and has served in  leadership roles of the Northeast Organic Family Farm Partnership,  Maine Organic Farmers and Gardeners Association, and the Agricultural  Council of Maine.\n\nThere are many challenges that come with operating a small farm--…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699302/recognizing-annie-watson"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…other World War II  Veterans. There, I was honored to join in celebrating Don's 100th  birthday, a joyous occasion, last February.\n\nWe extend our deepest condolences to his family and loved ones. May  we always honor Don Kuehl's service, cherish his legacy, and remember a  life well lived in service to the United States of America.", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699857/in-memory-of-donald-l-kuehl"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…budget becomes law.\n\nMedicaid pays for the daily care this little boy needs to survive.  Rachel wrote: ``We are terrified about what losing Medicaid support  would mean for our family.''\n\nMoms have enough to deal with. Let's leave their healthcare alone.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691488/gop-tax-scam-hurts-women-and-families"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…have amazing scientists in this country who have  been researching this, and they are at the point of clinical trials.\n\nMr. Speaker, I don't know if you know anyone in your family who is a  survivor of breast cancer or any other kind of cancer. Oftentimes, when  you go in and the surgeon puts you under to take it out, they don't  know if they have gotten…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…who  is disabled, too. None of them can work, and they depend on SNAP and  Medicaid to survive. If Congress guts these programs, it will gut a  lifeline for Cheryl and her family.\n\nMr. Speaker, we must remember who we are here to serve. These are  real people with real lives, and we must stand up for them.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691428/gop-tax-scam-hurts-women-and-families"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…military  bases across the globe via phone, chat and text. These services are  free and confidential.\n\nAuthorized by the Violence Against Women Act of 1994 and funded  through the Family Violence Prevention and Services Act, the National  Domestic Violence Hotline was created to ensure that anyone  experiencing relationship abuse would have a safe, confidential…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700099/recognizing-the-30th-anniversary-of-the-national-domestic-violence-hotline"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…burden families with higher grocery bills or the  deprivation of millions of Americans without healthcare coverage or the  kleptocratic meme coin schemes to enrich the Trump family by more than  $200 million. President Trump can simply ask Congress to pass a bill  here on Capitol Hill.\n\nAnother option is provided through a 1974 law, the Impoundment  Control…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691336/pocca"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…congratulating Robert Jennings on his retirement from SpartanNash. We  commend him for his decades of service. I wish Mr. Jennings, a much- deserved, restful retirement surrounded by family, friends, and  neighbors.", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689251/recognizing-the-retirement-of-robert-jennings"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…simply going to cost people more money.\n\nIt gets worse because Republicans in Congress are barreling toward a  massive tax giveaway to billionaires paid  for by targeting the family members we love the most: our parents who  rely on skilled nursing, children, pregnant women, and our neighbors  with disabilities.\n\nWe know what this is. This is an attempt…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…President's  Park, dedicated to the contributions to our Nation by John and Abigail  Adams, John Quincy and Louisa Catherine Adams, Charles Francis Adams  and Henry Adams and their family.\n\nThe exciting part of this is that while efforts have been made in the  past, we have finally arrived upon what I think is a suitable location  for this memorial. It is shown…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697631/adams-memorial-great-american-heroes-act"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…have to pay their  fair share. Why are they withholding funding to find a cure for  Alzheimer's disease? So big corporations can pay less in taxes than the  average American family. The cuts we are seeing right now will damage  Americans' lives for the next generation--all so the wealthiest  Americans can get wealthier.\n\nWe must stand up to this illegal…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688264/national-institutes-of-health"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…tasks with a sense of accountability, decency, and honor. He led  his life with purpose and served the people of Rhode Island extremely  well.\n\nDonny leaves behind a devoted family, and I express my heartfelt  condolences to the Ruggerio family: his children Charles Ruggerio and  his wife Jillian and Amanda Fallon and her husband William; his  grandchildren…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691451/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…into the future.\n\nHonoring Century Farm Designation of Black's Willow Run Farm\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, I rise today to honor four  generations of the Black family in Tyrone Township, Blair County,  Pennsylvania, on the designation of their farm as a Century Farm by the  Pennsylvania Department of Agriculture.\n\nJames Black purchased the…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696753/improving-domestic-energy-market"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…firefighter. He was  the captain of his house.\n\nI remember clearly the risks that my father took every day he walked  out the door. I remember well what it meant to be a police family, and  I know the courage it takes not just for the officer but for the family  members who stand behind them.\n\nWhen the worst happens, when a first responder is lost in the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691021/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Rather than empower border enforcement, the Biden-Harris administration  threw open the Federal checkbook, funneling billions of taxpayer  dollars to private nonprofits like Family Endeavors Incorporated,  Southwest Key Programs, and Global Refuge. These NGOs didn't just  shelter illegal aliens. They pampered them.\n\nThose contracts paid for luxury hotel…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690710/outrageous-government-funded-incentives"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…taxes on tips and on overtime pay. It lowers taxes on Social  Security benefits and expands the child tax credit for working-class  families.\n\nOur bill helps keep American family farms afloat by eliminating the  death tax for most, saving 2 million family farms. The family farmers  and ranchers in my district are hardworking men and women who are up…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…mission  throughout the organization, and strengthened the relationship between  UWPC and its many partner agencies. Charles retired 2 months ago to  spend more time with his family, and he leaves behind a stronger, more  resilient UWPC prepared to meet future challenges.\n\nIt is clear Charles Anderson has made a profoundly positive impact on  our community,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690203/recognizing-chuck-anderson"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…chairman of the Franklin County Board of Commissioners, a  representative on the Chambersburg Council, and the mayor of  Chambersburg.\n\nSam's commitment to his country, his family, and his community truly  makes him an exceptional example of America's Greatest Generation.\n\nMr. Speaker, I thank Sam for all he has done for America.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698173/lowering-healthcare-costs-for-all-americans"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Wranglers band, who are part of The Flying W Wranglers Original Western  Stage Show at the Flying W Ranch in Colorado Springs. Flying W Ranch  was opened in 1947 by the Wilson family, who hosted their first potluck  in 1953. It has evolved into the entertaining and iconic dinner and  show that it is today which hosts hundreds of people on a regular  occurrence.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694939/recognizing-the-flying-w-wranglers"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…the cornerstone of community life--a vibrant hub for artistic  performances, civic engagement, and social events. From city council  meetings and public forums to receptions, family reunions, and  community celebrations, it has hosted countless gatherings that reflect  the heart and spirit of Hanford. More than just a venue, the auditorium  plays a vital…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698408/recognizing-the-hanford-civic-auditorium"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "Mr. NORMAN. Mr. Speaker, I rise today in recognition of an  outstanding South Carolina family and small business whose story  reflects the true American values of hard work, service, and community.  George and Joanna Katergaris along with their children, Mina and Mike,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696937/recognizing-the-katergaris-family"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…historic  resources.\n\nOne thing that BOEM failed to analyze that often gets overlooked, it  is not just Big Oil in the Outer Continental Shelf, it is also small  producers, family-owned businesses, and thousands and thousands of  people who make a living working in the Outer Continental Shelf.\n\nThis burdensome regulation will be detrimental to those…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688630/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Birkhead, a remarkable constituent from my district. It is my honor to  celebrate her on her 100th birthday--a day marking a hundred years of  love, laughter, and commitment to her family, friends, and community.\n\nBorn on August 30, 1925, in Trenton, New Jersey, Helen has  experienced a century full of changes and milestones. Her life story  stands not only…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694743/recognizing-helen-birkheads-100th-birthday"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Victoria Barley has made through her volunteerism  with Youth and Family Alternatives. For more than 15 years, Victoria  Barley has been a remarkable champion for Youth and Family Alternatives  (YFA), leaving a lasting legacy that will continue…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692476/recognizing-victoria-barley"}, {"senator": "John James", "party": "Republican", "sentence": "…to be a part of it.  America called on us during two World Wars and a global pandemic, and  my legislation ensures Michigan stands ready to answer the call once  again.\n\nMy family is no stranger to how important the trucking industry is.  My father started a trucking business with one truck, one trailer, and  no excuses. Then a generation later, I started…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690473/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "French Hill", "party": "Republican", "sentence": "…that information. Clearly, customers opt in to  it.\n\nMr. Speaker, I promise you, I had it all through my early career when  I couldn't make payments between paychecks. A young family, one income,  lots of children, a lot of expenses, you do it. It is a good, prudent  practice.\n\nAs a community banker for decades, I can promise you families were  smart about…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…these things are numbers and  graphs. We forget that every job lost to China and every factory moved  to Mexico belongs to a real, flesh-and-blood American, with a life and  a family and a home. Each and every data point is a fellow citizen, a  neighbor, a son or daughter of this great Republic. Since NAFTA,  90,000--90,000--factories in our country have…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}]