[{"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…bill, despite my extreme lack of  confidence in this Pentagon's leadership, but I must always support the  men and women who wear the uniform. Our servicemembers and their  families make extraordinary sacrifices for our Nation, and now,  especially now, we must fulfill our commitments to them.\n\nMr. Speaker, with my remaining time, with very much respect…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697807/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, at a time when food prices are rising and  it is harder for families to make ends meet, we should not be cutting  food assistance programs, but that is exactly what is happening.  Earlier this month the administration announced a billion-dollar…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689059/feeding-our-children"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…your service, Mr. President--many  of them 19, 21, 23 years old--who signed up to serve not for money or  for glory but out of their love for our country. Their entire families  make sacrifices on behalf of our Nation, and they should not have to  sacrifice safe, clean housing, and high-quality schools.\n\nFor years, the Department has neglected quality…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694129/9999"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Speaker, as we stand here today in the people's House, I want to  be very clear about something. I will not betray working families by  supporting a budget that harms working families to make the rich  richer. We have to stand up in this precise moment in the people's  House.\n\nRepublicans must also stand up to their billionaire bosses and do  what is right,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…their  7-week paid vacation, I can't imagine anything more disconnected than  for House Republicans to come back here and make their first priority  not helping working families to make ends meet but jamming through more  favors for their billionaire buddies.\n\nThese three Congressional Review Act, or CRA, resolutions treat  America's public lands like…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…this weekend at the grocery store, I have heard from  parents, grandparents, and small businesses alike that the childcare  crisis is suppressing our economy and forcing families to make  impossible decisions.\n\nIt is more expensive to send one infant to daycare than it is to send  an 18-year-old to the University of Maryland.\n\nLike every State, Maryland…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699582/stop-the-republican-affordability-crisis"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…families.\n\nThe very fact that President Trump and the Republicans are only just  allowing a vote on continuing these critical tax credits just 2 weeks  before all these families have to make their decision--it is only 2  weeks to go, and then they have to send the check in to get the  coverage for January 1. So the Republicans have waited until 2 weeks…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…the largest  ever cut to food assistance in our Nation's history. This ploy will put  extreme pressure on our food banks, leave millions of Americans hungry,  and force families to make impossible choices.\n\nLet me be clear: Hunger is not inevitable. Letting people be hungry  is a policy choice. Republicans are choosing to rip the food out of  hungry people,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691769/151-days-without-a-vote-to-lower-costs"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…robbed of resources to keep people safe.\n\nRuss Vought has stripped hope away from cancer patients and  singlehandedly made the cost-of-living crisis even worse for working  families.\n\nMake no mistake. This is all part of Russ Vought's plan to centralize  and hoard power for himself over all others. He is poisoning these  negotiations. Every illegal action…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Speaker, I thought maybe I was in the wrong place when I heard  the debate when I walked in today. I do want to add that I agree it is  not pro-life to cut services to families and to make childcare more  expensive. These bills are anti-choice.\n\nMr. Speaker, I rise today in opposition to these two deceptively  titled bills: H.R. 6945, the Supporting Pregnant…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699221/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…frankly, join us  in a bipartisan effort. There is a lot more to be done. This is not all  that we will do, but extending this health insurance premium assistance  to these families can make a real difference.\n\nLet me tell you a story. If you are looking for breakfast in downtown  Chicago on a Sunday morning, let me recommend a restaurant. The name of  the…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…people owe me, the authoritarian; not I am accountable to them.\n\nSo, therefore, it is totally legit to go for legislation that slashes  the programs that are fundamental to families to make the rich richer.  And I want to go back to that picture that I had up earlier of the  billionaires standing behind President Trump at the inauguration. And  at that point,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…permanent.\n\nTime is of the essence. Families and businesses are going to get  those dreaded letters in the mail any day now saying their premiums are  going up 75 percent. Families will have to make really tough choices.  Small businesses will be left holding the bag as employees leave for  corporations that are able to afford insurance plans.\n\nSo we are left…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695650/healthcare"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…from heating homes in winter to cooling them in  summer are also rising, stretching budgets even further.\n\nThese are not small inconveniences. They shape every decision  families make about what they can afford. As people question whether  they can cover the basics, it affects how they plan their days, care  for one another, and participate in their…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696852/higher-costs-of-everyday-life"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…young  children. I met Nana Renee. She is a mother and a grandmother from  Brooklyn Park who loves her family more than anything in the world.  She, like so many families, is struggling to make ends meet.\n\nAs a country, we should be doing everything we can to support our  young families and make raising kids more affordable. These policies  are doing…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689419/protecting-american-families"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…families and alleviate some  of the stress that providers are feeling.\n\nCongress must tackle this problem holistically. In this case, getting  broadband to our rural families could make the difference between life  and death. All in all, expanded broadband access would lead to  significant mental health benefits in our rural communities.\n\nAs we recognize…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691424/increasing-mental-health-services"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…educate the public  about the vital role service dogs play and the protections in place to  guarantee their access. It is also a time to honor the trainers,  volunteers, and families who make this work possible.\n\nAs a Navy veteran, I've seen firsthand the impact these dogs have on  our service members. So I want to thank all of those organizations who  are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695913/recognizing-september-as-national-service-dog-month"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…is  very important.\n\nI thank my colleagues for being here tonight to show their support  for law enforcement and recognize the sacrifices that these officers  and their families make on a daily basis.\n\nNational Police Week is a great opportunity to stop to thank our  local police officers, but we really should be committing to do this  throughout the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…removed that provision that  would have lowered premiums for families.\n\nRepublicans absolutely have worked and will continue, by the way, to  work to lower premiums for families. Make no mistake that the high  premiums that everybody faces today are a result of the inaptly named  Affordable Care Act and the many failures associated with it.\n\nMr. Speaker,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696745/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…We can talk about energy dominance, the most significant commitment  to opening up energy resources in this country to bring down the cost  of energy prices for our families and to make American energy dominant  again.\n\nWe are so blessed by our natural resources. I will talk about the  farm bill reforms. Republicans are strengthening the safety net,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692295/stop-defending-lawlessness"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…are  now, finally, getting relief, let alone families who are enjoying the  largest tax cut in American history with this package, it is smart  policy to reward those families that make America work every single day  and to recognize that sometimes the government has left them behind and  that we need to step up and help those folks most in need.\n\nThe…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692334/election-promises-made-promises-kept"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…not normal. These are not normal people. Stand with  Israel. Standing with Israel, you are standing by your--you are helping  your own self; you are helping your own families.\n\nI will make a prediction. Israel is going to win, and this regime is  going to fall. This regime is going to fall of its own weight. The  people in Iran are going to have their…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…Nation  exceptional.\n\nAmerica's strength comes from our enduring belief that freedom is  worth fighting for and from our commitment to protect and empower the  hardworking families who make the American Dream possible.\n\nMy commitment is simple: Lower prices for Tennesseans, bring down  healthcare costs, protect communities, and restore American energy  independence…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697494/welcoming-the-honorable-matt-van-epps-to-the-house-of-representatives"}]