[{"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…budget resolution that really is going to provide  tax breaks to the wealthiest Americans in exchange for cuts in vital,  essential programs for working- and middle-class families.\n\nMr. Speaker, I am proud to stand here with my colleagues from the  Congressional Hispanic Caucus to call out the partisan Republican  budget resolution that passed last night…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688133/republican-budget-betrayal"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…financing costs and  bipartisan legislation on permitting reform to get infrastructure like  energy, transportation, and housing projects more quickly approved for  working families.\n\nMr. Speaker, we need bipartisan solutions, and they are clear.  Congress must act now to ease costs, expand access to healthcare, and  invest in the future of our communities…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698830/putting-americans-first"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…course, see that  the Israeli Government continues to illegally steal Palestinian land in  the occupied West Bank where my family lives. They illegally evict  Palestinian families, Mr. Speaker, demolish homes, and deny  Palestinians basic human rights.\n\nWe honor those all around the world and want them to know that former  Congresswoman Cori Bush and…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691384/the-nakba-never-ended"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…Americans that the members of the  Congressional Black Caucus serve.\n\nMr. Speaker, I also rise on behalf of the 82 million Americans that  the Congressional Black Caucus serves. Families, Mr. Speaker, who sit  at the kitchen table late at night wondering which bill they can pay  and which bill must wait.\n\nIf Congress fails to act, 35,000 people in my district…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697648/restoring-enhanced-premium-tax-credits"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the  White House and this Congress that encourages stability in the  marketplace, protects our relationships with close trading partners,  and lowers costs for American families.\n\nMr. Speaker, I commend Representatives Kelly and Evans for their  leadership on this issue. I urge my colleagues to support this  legislation.\n\nMr. PALLONE. Mr. Speaker, I…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692696/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…their fossil fuel  friends. It is time for Republicans to come to the table to work with  Democrats on the solution to this affordability crisis for the sake of  American families.\n\nMr. Chair, I yield back the balance of my time.\n\nMr. PALLONE. Mr. Chairman, I rise in opposition to the amendment.\n\nMr. PALLONE. Mr. Chairman, I yield myself such time as…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "Ms. CASTOR of Florida. Mr. Chairman, I thank the ranking member for  yielding me time and thank her for everything that she does to protect  the pocketbooks of American families.\n\nMr. Chairman, American families and small business owners deserve  lower electric bills, but Republicans in Congress are really sticking  it to folks with higher costs at…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694853/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…Oregon. I commend my colleagues for coming together to fight for  what is right. I am eager to continue this work alongside all of you to  prioritize the needs of working families.\n\nMr. Speaker, it is time we act. It is time we pass the Protect  America's Workforce Act because our workers cannot wait. Congress must  honor their service and ensure their…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697870/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…intimate and  fundamental decisions for the physical, mental, and emotional well- being of America's children. Let us leave it to people's parents. Let  us leave it to the families.\n\nMr. RASKIN. Madam Speaker, I yield 2 minutes to the distinguished  gentleman from California (Mr. Takano), the chair of the Congressional  Equality Caucus.\n\nMr. RASKIN. Madam…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698345/protect-childrens-innocence-act"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…costs and increasing wages. The  budget passed last night only gives billionaires tax cuts and funds  indiscriminate raids in our city, all paid for by working-class  families.\n\nAgain, Mr. Speaker, CHC stands with our community and rejects the  Republican budget betrayal.\n\nMr. ESPAILLAT. Mr. Speaker, we stood here tonight to warn the  American people…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688134/republican-budget-betrayal"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…and Minnesota.\n\nThe administration is illegally withholding payments to States for  childcare, foster care, child protective services, and cash assistance  to low-income families.\n\nMr. SCHNEIDER. They are hiding behind false claims and unauthorized  administrative barriers in order to inflict pain on States that the  President dislikes.\n\nLet me be clear.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699230/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…The driving force behind  this entire legislative effort has been to grant handouts to those same  billionaires and special interests all at the expense of hardworking  families.\n\nMr. Speaker, I hope my colleagues on the other side of the aisle will  stop and think again before voting for the worst piece of legislation  in generations. But I know one…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693236/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…fighting for  months, we are joined by Republican colleagues who recognize that we  have a responsibility to help ensure Americans can afford to provide  healthcare for their families.\n\nMr. Speaker, it is our job to bring down the cost for Americans. It  is our job to make life better for Americans. It is our job to ensure  that every family has access to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698793/breaking-the-gridlock-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…its  better nature and reached out, not to give a handout, but a hand up, to  millions of Americans who, in the blink of an eye, lost everything and  couldn't feed their families.\n\nMr. Speaker, my father was also a pastor. I can't help but think of  him without thinking of Matthew 25:31-40. This is the story of the  sheep and the goats, and this is what…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…this bill on small business owners and entrepreneurs who  are the heart and soul of our economy.\n\nThis bill also represents an all-out assault on law-abiding immigrant  families. Mr. Speaker, we are going to tell their stories, as well. We  are going to tell their stories because what is happening in this  country is an all-out assault on law-abiding…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…hardworking Americans. Failure to act on this budget resolution, our  House Republican budget, risks trillions in tax increases on Missouri  farmers, small businesses, and families.\n\nMr. Chairman, as a member of the House Armed Services Committee, I am  pleased to see that the budget directs an investment of $100 billion  for our national defense after…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688038/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…grow significantly over the  next several years, which means this body has a duty to ensure our  constituents have a dependable grid that meets the needs of hardworking  families.\n\nMr. Speaker, unfortunately, both the Obama and Biden-Harris  administrations were guilty of using the EPA to promote radical policy  designed to drive out baseload generation…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698276/reliable-power-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…a chance to work under Mark. I wish  his amazing kids and family all the best. We hope that he really, truly  won't go far.                       Historic Tax Relief for Families\n\nMr. MOORE of Utah. Mr. Speaker, as I mentioned, I want to share a  brief message about what we have accomplished this last year.\n\nMr. Speaker, House Republicans have turned…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699706/historic-tax-relief-for-families"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…like AI and advanced manufacturing, hold tremendous  promise to lift up communities across the country with stable, good- paying jobs, while lowering costs for hardworking families.\n\nMr. Speaker, the Securing America's Critical Minerals Supply Act  takes an important step towards solidifying the U.S. position as a  global leader in economies and technologies…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699990/securing-americas-critical-minerals-supply-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Bill Act's tax cuts  benefit families making less than $500,000. Just because they keep  saying it doesn't make it true. The One Big Beautiful Bill Act does  help working families.\n\nMr. Speaker, I do have to address, because my colleague has decided  to bring ICE into this debate, or this discussion, regarding small  businesses and help that we may be…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…allowing the city of Paducah to transfer land directly to the club.  This will pave the way for long-planned improvements that will directly  benefit Kentucky children and families.\n\nMr. Speaker, I urge my colleagues to support Chairman Comer's  legislation, and I yield back the balance of my time.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697651/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…Even though he and I disagree on many things, including this  resolution, Mr. Speaker, we have heard a lot from the other side of the  aisle about how they support working families.\n\nMr. Speaker, this is a resolution that would provide no tax on Social  Security, no tax on tips, no tax on overtime, provisions that  specifically help working families, families…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…you  say, well, how could anybody vote against this bill? Think about what a  ``no'' vote means. I am proud of the ``yes'' vote that we are about to  pass to help those families. Mr. Speaker, everybody who votes ``no,''  make no mistake about it, everybody who votes ``no'' is going to be  asked a question by that waitress making $32,000 a year saying:…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…students with disabilities had long been  denied access to public education, but IDEA transformed the public  school experience for students with disabilities and their families.\n\nMr. Speaker, we have an obligation to our students in this country.  Thanks to IDEA, our education system is working to serve the needs of  every student in America.\n\nThis…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697493/9999"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…While Democrats remain stuck in the year 9--we are going on year 10-- of Trump derangement syndrome, Republicans are focused on governing and  delivering results for working families. Mr. Speaker, I would like to  once again remind my colleagues of what is actually in the rule before  us today.\n\nThe rule provides for consideration of three commonsense bills:…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…stay  healthy and make ends meet. Personal finances and being able to pay  your bills are a major source of stress and anxiety for so many  veterans, survivors, and their families.\n\nMr. Speaker, passing this cost-of-living adjustment provides them  with the peace of mind they deserve and access to benefits they are  owed. I know many of my House colleagues…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696760/veterans-compensation-cost-of-living-adjustment-act-of-2025"}]