[{"senator": "Salud Carbajal", "party": "Democrat", "sentence": "Since Trump's return to the White House, our community has  experienced an unprecedented level of chaos, fear from ICE raids, and  family separations.", "title": "Fighting Dhs Immigration Raids", "date": "2025-12-03"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "This informed her  work at the Minnesota Farmers Union (MFU), where she has advocated for  affordable healthcare and the needs of family farmers.", "title": "Congratulating Linda Larson on Her Graduation From Inver Hills Community College", "date": "2025-04-30"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "I give my condolences to your wife and your family.", "title": "-9999", "date": "2026-01-08"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "A robust life insurance policy can provide a grieving family  with the financial security they need to navigate the loss of their  loved ones and do so with dignity.", "title": "Fairness for Servicemembers and Their Families Act of 2025", "date": "2025-04-07"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "Speaker, if I were to describe Jeffrey Epstein as a  nice family man who works in finance, you might question why I am  saying that.", "title": "Guiding and Establishing National Innovation for U.S. Stablecoins Act", "date": "2025-07-17"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "``My family and I could not survive without these programs.", "title": "Medicaid", "date": "2025-05-20"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "I work hard every       day to provide for my family and to be a productive member of       my community in Malden.", "title": "Constituent Testimony During the Congressional Field Hearing on Haitian Tps Termination", "date": "2026-02-04"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Every person in this country, every patient  battling illness, every doctor searching for answers, and every family  hoping for a cure would feel the consequences of these disastrous cuts.", "title": "Nih Cuts Put American Lives At Risk", "date": "2025-04-01"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "The person has no idea where they  are going, who these people are, or when or if they will ever see their  family again.", "title": "Pushing Back Against Ice's Authoritarian Overreach", "date": "2025-07-23"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "Speaker, I missed votes due to a previously scheduled  family commitment.", "title": "District of Columbia Federal Immigration Compliance Act of 2025", "date": "2025-06-12"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "We had family farm after family farm collapse across this country  through consolidation.", "title": "Trump Tariffs", "date": "2025-04-10"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "He raised his family in Texas.", "title": "Visit to Bluebonnet Detention Facility", "date": null}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "These are our friends, neighbors, coworkers, or family  members.", "title": "Mental Health Solutions", "date": "2025-05-07"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "But I also plan on doing  everything I can to ensure that Alex and his family get justice.", "title": "-9999", "date": "2026-01-28"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "Like, Oh, I am on a family plan.", "title": "One Big Beautiful Bill Act", "date": "2025-07-14"}, {"senator": "John Joyce", "party": "Republican", "sentence": "Sam's commitment to his country, his family, and his community truly  makes him an exceptional example of America's Greatest Generation.", "title": "Lowering Healthcare Costs for All Americans", "date": "2025-12-15"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "I congratulate Tarky's family and so many who have done so much to  help our region, upstate New York, and Syracuse University, and all of  the wonderful legacies of everyone who lives in the region and everyone  from the State of New York.", "title": "Recognizing Colonel John Peyton Swain", "date": "2025-07-16"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "They care  what happens in their family and their local communities.", "title": "Elections Matter", "date": "2025-06-24"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "This bill also promotes the use of public lands for recreation,  health, and family time, particularly among those who may face long  hours, stressful shifts, and dangerous conditions.", "title": "Law Enforcement Officer and Firefighter Recreation Pass Act", "date": "2025-07-21"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Charles retired 2 months ago to  spend more time with his family, and he leaves behind a stronger, more  resilient UWPC prepared to meet future challenges.", "title": "Recognizing Chuck Anderson", "date": "2025-04-28"}, {"senator": "John Joyce", "party": "Republican", "sentence": "A Century Farm is a farm that has been owned by the same family for  at least 100 consecutive years, has a family member who still lives on  that farm, and has at least 10 acres of the original farmland.", "title": "Supporting the Stop of Chinese Fentanyl", "date": null}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Speaker, although our Nation's Capital contains towering and  iconic tributes to many of our Founding Fathers, we still have no  memorial for President Adams and his family.", "title": "Adams Memorial-Great American Heroes Act", "date": "2025-12-09"}, {"senator": "David Valadao", "party": "Republican", "sentence": "My prayers are with his wife, Jill, his children, and all of his  family and loved ones during this incredibly difficult time.", "title": "-9999", "date": "2026-01-08"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "I proudly commend retired USAF Technical Sergeant Martha Socorro  Ybarra, of Waco, Texas to her friends, family, and colleagues, and  salute her service to the Air Force, her country and community of Waco  by awarding her with a Congressional Veteran Commendation.", "title": "Recognizing Technical Sergeant Martha Socorro Ybarra, Usaf, Retired, with A Congressional Veteran Commendation", "date": "2025-10-17"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "I know they have a special affinity for fish that aren't  in the Gulf and attack recreational fishermen in their endeavor to go  out and spend time with their family and catch fish.", "title": "Gulf of America Act", "date": "2025-05-08"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "The medal of sacrifice will ensure that when a family member, a  spouse, a son, a daughter, or a department, that when they reflect on  the end of watch for their friend or their hero or their loved one,  they will know that it is the whole of America that remembers with  them.", "title": "Medal of Sacrifice Act of 2025", "date": "2026-02-02"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Susan Pugh has made to our community through her  volunteerism with the Pregnancy & Family Life Center.", "title": "Recognizing Susan Pugh", "date": "2025-06-09"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "The most important piece of legislation we passed--actually, there  are a couple that come to mind, but one is the working family tax cuts  act.", "title": "Trump Administration", "date": "2026-01-07"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "Every family in the Baltics knows someone shot by the Soviets or sent  to Siberia to die.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}]