[{"senator": "Maxwell Frost", "party": "Democrat", "sentence": "Speaker, I think it is very interesting, as we sit here, I keep  hearing my colleagues bring up the ``working families tax cut bill.''  They keep bringing it up, and I am asking the staff here, I don't  remember voting on the working families tax cut bill."}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "It starts with tax  relief for American families with the working families tax cut."}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "residents  and businesses that was afforded to them by the Working Families Tax  Cut Act."}, {"senator": "John Thune", "party": "Republican", "sentence": "But thanks to the working families tax cut legislation, however, help  is on the way."}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "Back in July of this year, this Republican Congress passed the  Working Families Tax Cut Act."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "I was proud to help craft the Working Families Tax Cut law that the  President signed on July 4 last year."}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "As part of the working families tax cuts, Republicans enacted  landmark policies like no tax on tips and no tax on overtime, which put  more money back into the working family's pockets."}, {"senator": "John Joyce", "party": "Republican", "sentence": "The NDAA  builds on efforts started in the Working Families Tax Cuts Act to  stimulate our economy and to bring jobs back home."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "In that role, I worked with Senate Republicans and the  White House as part of the Working Families Tax Cut law signed by the  President on July 4, securing historic support for the Byrne JAG and  COPS Programs for local police as well as efforts to combat drug  trafficking."}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "Speaker, that  just last summer we passed the working families tax cuts bill with lots  of help for people on Main Street in Abingdon, Virginia, and Marion,  Virginia."}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "I don't think anyone can  argue that before our working-families tax-cut bill--our signature bill  that is going to grow the economy--that before that legislation, that  illegal aliens were getting healthcare."}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Real wages and benefits fell 3.9 percent during the Biden-Harris  administration, and through the Working Families Tax Cuts Act, real  wages are growing faster than prices."}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "It was a $1.5 trillion mad  spending spree that included things like $200 billion of taxpayer  funding for illegals to get taxpayer benefits, while they gutted the  $50 billion rural healthcare fund that we put in place in the working  families tax cut."}]