[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…No matter how rich the person is, no  matter if they held office in the past, no matter if they aspire to  office in the future or sit in an office right now, no matter how  famous or not famous they might be--let the chips fall where they may.  That is the vision of equal justice under the law.\n\nEveryone involved in Mr. Epstein's crimes must be brought…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…far and wide. The show  barns were full of animals and people, and the weather was heavenly.\n\nI spoke with constituents from six of the eight counties I represent  and got a famous Fulton County Dairy Association milkshake, a farm- fresh cheeseburger, and got to meet hundreds from across the vast  northwestern Ohio region I represent and beyond, even…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694992/fulton-county-fair"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…In the past 125 years Cal Poly SLO has educated more than 230,000  individuals who have gone on to be everything from astronauts to iconic  football players, and even world-famous musicians.\n\nThe university's partnerships with local communities, industry and  government exemplify the vital role public higher education plays in  advancing opportunity,…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699776/recognizing-the-california-polytechnic-state-university-san-luis-obispo"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…a time when Black people were discouraged  from construction jobs, Larry founded a construction company that is  still thriving and has helped build some of Chicago's most famous  landmarks.\n\nHuggins is an eminent civic leader, as well. He served as acting  chairman of Metra and founded the famous Christmas in the Wards to  distribute toys and other…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689205/congratulating-larry-huggins-on-a-life-of-service-and-achievement"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Americans who  have helped shape today's America. Black history is American history  and for decades has been ignored by racism. Now, as we identify and  remember both those famous and some unfamiliar names from decades past,  there is today a movement to whitewash history and to minimize those  names.\n\nHowever, there are efforts to ensure we never forget…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700078/black-history-month"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…life of a Louisville hometown hero, Dixie Demuth,  who fought for equality for women in Kentucky and left a permanent mark  on our city and commonwealth.\n\nBorn in 1917 in the famous Samuels House in Samuels, Kentucky, Dixie  moved to Louisville with her mother in 1933 at the height of the Great  Depression. From an early age, she worked in restaurants…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695585/recognizing-the-extraordinary-life-of-dixie-demuth"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "Mr. DeSAULNIER. Mr. Speaker, I thank Mr. Huffman for yielding.\n\nMr. Speaker, welcome to California water wars. A famous quote  attributed to Mark Twain is:\n\nIn California, whiskey is for drinking, and water is for       fighting.\n\nWelcome to the debate. This is much more than just the delta…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690598/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…and  women's rights advocate who used her powerful voice to demand justice.  Born into slavery, she escaped and dedicated her life to fighting for  freedom and equality. Her famous ``Ain't I a Woman?'' speech challenged  the exclusion of Black women from the suffrage movement, leaving a  legacy that continues to inspire generations.\n\nAnna Howard Shaw…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689165/womens-history-month"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…Tubbs Jones and Marcia Fudge. They are  three strong Black leaders who represented the district I now  represent.\n\nBlack History Month isn't just about trailblazers, icons, and famous  names. It is also about Black culture, community, and excellence, and  the history and experience that binds us all. It is often a time of joy  and celebration.\n\nBlack History…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688144/recognizing-resilience-resistance-and-relentless-struggle-lessons-of-black-history"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…have seen is that so-called disabled  people or differently abled people have made such tremendous  contributions to our culture and to our society. I am thinking of very  famous people like Thomas Edison, Franklin Roosevelt, and Fannie Lou  Hamer, people who have had polio, who have been in wheelchairs, and  physicists who have contributed.\n\nIt is…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698944/protecting-education-for-children-with-disabilities"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…before the arrival of the pilgrims at Plymouth  Rock; the farmers coming to Washington, D.C., with their tractors to  protest what was happening to their land; and Dr. King's famous speech  on The Mall where he gave his ``I Have a Dream'' message, and that is  we the people. That is why I wear this necktie. It is my favorite tie.  It is one of my favorites,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…as usual.\n\nYes, there are millions of people out there who are worried about  getting their Social Security payments on time because Trump and Musk  are out there with that famous chain saw, doing what they can to make  it harder for people to get the benefits that they have earned.\n\nOr here is another:\n\nI've had Medicare medication coverage for around…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690633/nomination-of-frank-bisignano"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…only a handful  of my colleagues in the Chamber to hear that alarm and a few folks in  the gallery, but I pray that Americans writ large will hear it.\n\nGeorge Orwell in his famous book ``1984'' wrote of a time when ``The  party told you to reject the evidence of your eyes and ears. It was  their final, most essential command.'' His warning proved pressing…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699746/it-is-time-for-the-corruption-to-end"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…first declaration of human rights, emphasizing freedom of religion,  equality, cultural and civil rights, and the abolishment of slavery.  These values were recorded on the famous Cyrus Cylinder in 539 B.C.E,  and remain an essential part of our values today--including being  enshrined in our own Constitution.\n\nZoroastrianism celebrates the spring festival…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688922/introducing-a-resolution-to-recognize-march-as-zoroastrian-legacy-and-heritage-month"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…the U.S. Government while protecting more good-paying  manufacturing jobs right here in the United States of America.\n\nI am proud that my district is also home to the most famous airship  in the entire world, and that is the Goodyear Blimp.\n\nThis amendment, which is based on the Airship Improvement Research  for Safety and Humanitarian Innovation Projects…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695128/my-amendments-to-hr-3838"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…ensuring the  bakery's continued legacy.\n\nCelebrating 80 years of business, Smith's has been a symbol of  excellence and community spirit, known for their iconic treats, like  the famous happy face cookie.\n\nAs Jim Balmain once said: ``If you care and you try to do things  right, people will appreciate it,'' and that is exactly what Smith's  has done for decades.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690793/recognizing-smiths-bakeries"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…in the areas of psychology and  psychiatry have to identify. I will refer to it as ``Thunberg  syndrome.'' You may remember the little girl who, about 10 years ago,  became famous in Sweden for pushing the global warming hoax.\n\nThis little girl was in a Western country, a well-off family,  somebody who hypothetically should have been happy, right? According…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…leadership and administrative roles,  providing unwavering support to both the firefighters and the  community.\n\nTogether with her husband Victor, she helped establish and run the  famous Fish and Chips at the Annual Wendelville Field Days and has  contributed to countless social and fundraising activities that sustain  the Wendelville Volunteer Fire Company.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699525/recognizing-doreen-neilson"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…experience in Israel while attending       Tel Aviv University as a Fulbright scholar and encountering       the enormity of the Holocaust for the first time.\n\nReferring to the famous Adolf Eichmann trial of the       notorious SS officer in Jerusalem, with profound impact on an       entire mesmerized nation. I vividly recall as a teenager       living…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697168/the-triumph-of-life"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…President is well within his rights in faithfully executing  his obligations.\n\nMr. ISSA.\n\nMr. ISSA. Mr. Speaker, as I close, since the ranking member so aptly  named a couple of famous quotes and famous movies, I might call  attention to the line: What we have here is a failure to communicate.\n\nThe other side, just a few months ago, supported this legislation…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…community work. She organized the fair booth, served on the Cattle  Princess Selection Committee, and brought humor to the High Fever  Follies fundraiser by wearing the group's famous ``beef cut suit.''  Following her early involvement with the Kern County Cattlewomen, Ms.  Woody began a distinguished career in education. She taught both junior  high and…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696714/recognizing-april-woody"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…artifacts and  interactive displays. Not only does Mount Airy house this museum but  also the Andy Griffith Playhouse and Museum. Of course, Mount Airy is  the prototype for the famous Mayberry series starring Andy Griffith.\n\nMr. Speaker, Mount Airy is a wonderful place to visit, and I  encourage everyone to do so.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697642/recognizing-the-siamese-twins-museum"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Livestock and has devoted countless  hours working with FFA students as a Board of Director with the Waller  County Fair Association. He is also a Life Member of the world-famous  Houston Livestock Show and Rodeo since 1975, serving on the Calf  Scramble and Livestock Committees.\n\nAfter moving to Huntsville in 2011, Richard and his wife Linda, have…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696281/recognizing-richard-reagan-horn-with-a-congressional-veteran-commendation"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…dedication to his family, his country, and his faith.\n\nWe are all looking forward to the great things that Trey and his  officer teammates will accomplish this year in that famous blue and  gold jacket.\n\nHappy National FFA Week.", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700175/recognizing-national-ffa-week"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…he will come.'' ``If you build it, he  will come.'' Those are the words Kevin Costner's character famously  heard, a mysterious voice encouraging him to construct the most famous  baseball field in America, the ``Field of Dreams.''\n\nUnfortunately, Mr. Chair, that only happens in the movies. Because  for the last 2 years, if anyone in the free State…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…historic site to be included in the National Park System  in 1938. Today, the historical park includes 12 historic structures, a  downtown visitors center, and a replica of a famous sailing ship, the  Friendship of Salem. The site attracts over 800,000 visitors annually  and showcases over 600 years of New England's maritime history.\n\nSince most historical…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691015/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…theirs was to get rid of  the family. It winds its way all the way up through communism and the  feminists in the 1960s.\n\nLet me give you a couple quotes of people who are famous, who were  well-known to people in the 1960s. We have Simone de Beauvoir: ``As  long as the family and the myth of the family . . . have not been  destroyed, women will still…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…return to  the Capitol.\n\nCongress has honored Douglass with a portrait and plaque in the  gallery and a statute in Emancipation Hall. This  resolution permanently renames these famous offices off of the House  floor for all Americans today, and years to come, to honor his work for  freedom in this hallowed Chamber.\n\nI thank Speaker Johnson, Chairman Graves,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692222/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "French Hill", "party": "Republican", "sentence": "…working with me on this proposal.\n\nAs I conclude, Mr. Speaker, I have to say that for four decades this  has been an important place in my life. It reminds me of John Muir's  famous poem:       Climb the mountains and get their good tidings. Nature's             peace will flow into you as sunshine flows into trees.             The winds will blow their…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…and everything which  overpowers all reason and undermines all distinctions between right and  wrong, good and evil, order and anarchy.\n\nIt is an attitude summed up by the famous slogan of the French  student radicals in 1968: ``It is forbidden to forbid.''\n\nThat is what the phrase ``suicidal empathy'' is meant to describe. We  open our borders and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}]