[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…``Congress  shall have [the] Power . . . To declare War''--not the President, or  the President if it is not convenient to the Congress, but the  Congress. And this body, for far too long, has been allergic to the  responsibility it has to govern the use of military force.\n\nNot since the very early part of this century has Congress approved  any authorization…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…HOYER. If you are serious, you have to be serious about  collecting revenue that is due and owing. That means funding the IRS,  which has been understaffed and underresourced far too long.\n\nNow, I am concerned not only by the IRS but also the FBI. For two  decades, I have worked to help the FBI move out of the crumbling,  unhealthy J. Edgar Hoover Building…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699056/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…and families second.\n\nMr. Speaker, you might think that, in a democracy, the fact that  there are more consumers than producers would cause the reverse. Yet,  in fact, for far too long, we have pursued an energy system with a  single goal: Make sure that oil and gas and coal companies keep their  profits as high as possible. We have pushed the most expensive,…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700229/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…and killed by Border Patrol  through a border fence while he was walking home on the Mexico side of  the border in Nogales, Sonora. He was unarmed. He was a child.\n\nFor far too long, communities like mine have been told to accept this  as the cost of enforcement. That is why, yesterday, I voted against  continued funding for DHS. I will not rubberstamp…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699657/horrific-ice-abuses"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…everyday Americans in order to reward billionaires, that we actually  can get to the work of lifting up everyday Americans because the deck  has been stacked against you for far too long. That is not the America  that the American people deserve.\n\nPart of the challenge, part of the problem, part of the issue as to  why we find ourselves, everyday Americans,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…EPA rule simply ignore the very real  experiences of people who have been forced to breathe toxic pollution  while coming into work or walking out of their front door for far too  long.\n\nMr. Speaker, for all of these reasons, I urge my colleagues to oppose  this resolution, and I yield back the balance of my time.\n\nMr. PALLONE. Mr. Speaker, on that I…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688531/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…Business Lending Companies provide loans to small businesses  located in underserved and rural communities, to new businesses, and to  veteran-owned small businesses.\n\nFor far too long, far too many people in our country have not been  able to access capital and participate in the American Dream of  starting a business, creating jobs, and growing our economy.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692067/capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…will have Dani Bensky, a survivor of Jeffrey Epstein and  now a leading voice demanding transparency, accountability, and justice  for survivors who have been failed for far too long.\n\nSecond, I will be pleased to welcome Raiza Contreras, a mother whose  son Dylan entered the U.S. legally but who was still detained by ICE.  Dylan did everything right--followed…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700178/state-of-the-union-address"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…never find  their way into the hands of people who are ill-trained, who have ill  intent, and who seek to cause the damage that we have seen with our  mass shootings.\n\nFor far too long, our Nation has tolerated an epidemic that is  killing our children, our friends, and our future. Gun violence has  ravaged this country. While every American feels the…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691752/national-gun-violence-awareness-month"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…must  support the mental health of the dedicated women and men on the front  lines of ensuring the traveling public reaches their final destination  safely every day.\n\nFor far too long, many aviation professionals suffer in silence. That  silence is because of the fear that disclosing a mental health  diagnosis or treatment could derail their careers,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695006/mental-health-in-aviation-act-of-2025"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "Ms. ELFRETH. Mr. Speaker, I rise today to give voice to an issue that  has gone unaddressed for far too long, and it is one this body must  take up before it is too late and lives are lost. We must address the  alarmingly low staffing levels of firefighters on our military  installations.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695629/filling-firefighter-positions-on-military-installations"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…can be here for this important moment. Their decision to be here today,  to push Virginia's Law, will ensure others get the justice that they  have been wrongly denied for far too long.\n\nAgain, I want to thank Virginia Giuffre's family who will also attend  today. What they have gone through is unimaginable. Virginia was  courageous and an inspiration…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699879/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…clear that a grantee may use grant funds from the Office of  Justice Programs and Office on Violence Against Women for legal  representation for post-conviction relief.\n\nFor far too long, we have closed our eyes to the true horrors of  human trafficking and allowed victimization to fester simply by  allowing survivors of human trafficking to be classified…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697181/trafficking-survivors-relief-act"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…and I am sending them love and strength.\n\nEvery single person there will be forever impacted by the violence  and trauma that mass shootings impose on communities.\n\nFor far too long, we have been forced to watch as gun violence  devastates our communities, and we feel unsafe going to the movies or  eating out at a restaurant.\n\nOne thing is clear. These…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690714/mass-shooting-in-glendale-arizona"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, gun violence is a scourge that has plagued  the United States for far too long. We have witnessed tragedy after  tragedy, and the only thing that ever seems to happen is that gun  restrictions are loosened even further.\n\nSix years ago, in my home State…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692027/observing-gun-violence-awareness-month"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…produced in the Energy and Commerce  Committee will strengthen Medicaid for low-income children, for  pregnant women, for the elderly, and for those with disabilities. For  far too long, illegal immigrants and able-bodied Americans, who can  return to the workforce, have been draining funds from the citizens who  deserve and need Medicaid.\n\nThis ends now.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690998/delivering-on-president-trumps-agenda"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…Mr. Chair, I yield 1 minute to the gentleman from North  Carolina (Mr. Harris).\n\nMr. HARRIS of North Carolina. Mr. Chair, I thank the gentleman for  yielding me time.\n\nFor far too long, the Lumbee Tribe of North Carolina has been  wrongfully denied full Federal recognition, but today is a chance to  make it right.\n\nWith over 55,000 individuals, the Lumbee…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…down their  family farm for good. This is unacceptable.\n\nMy bill, the Disaster Reforestation Act, offers a simple fix to an  issue that has harmed American foresters for far too long. Under the  Disaster Reforestation Act, foresters will be able to deduct the true  value of timber destroyed by natural disasters from their taxes. This  would help provide…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694913/americas-foresters-are-in-need-of-help"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…strengthening American energy security, protecting  good-paying jobs, and restoring common sense to a process bogged down  by bureaucratic delays and partisan politics.\n\nFor far too long, energy developers have faced an outdated and  unpredictable permitting process that has delayed and even canceled  critical infrastructure projects, costing taxpayers millions…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695691/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…our Second  Amendment rights but to restore what we have lost. The National  Firearms Act of 1934 is an unconstitutional relic that has infringed on  these liberties for far too long. We must take this historic  opportunity to ensure both taxation and registration on suppressors and  short barrels are gone for good.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697383/restoring-second-amendment-rights"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…bipartisan legislation, led  with my colleague Representative Cleaver, a Democrat from Missouri,  makes commonsense changes to fix the housing programs that have been  broken for far too long.\n\nMy bill means a young couple in Creston, Iowa, can buy their first  home, and seniors in Osceola, Iowa, can stay in their communities.\n\nThis bill will help hundreds of…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699801/housing-for-the-21st-century-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…for its immediate consideration.\n\nThe Clerk read the title of the bill.\n\nMr. COMER.\n\nMr. Speaker, cashless bail allows dangerous and violent criminals on  our streets. For far too long, dangerous criminals have been allowed to  roam the streets of Washington, D.C., posing a threat to the general  public. Progressive, activist judges are currently allowed…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696981/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…combined with the  provisions in the Housing for the 21st Century Act, will bring the  dream of homeownership closer to reality for working families in my  district.\n\nFor far too long, working-class Americans have been priced out of the  housing market. The Housing for the 21st Century Act confronts that  problem head-on by exploring where our housing…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699800/housing-for-the-21st-century-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…our country and our economy strong, which  are clarity, flexibility, and individual opportunity. We are removing  regulatory hurdles that have stifled upward mobility for far too long.\n\nMr. Speaker, it is time to put the interests of the American worker,  the small business owner, and the retiree ahead of the interests of  Washington bureaucrats. I am…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…of  H.R. 3633, the Digital Asset Market Clarity Act of 2025, otherwise  known as the CLARITY Act. H.R. 3633 delivers a foundational framework  that has been missing for far too long, which is clear, consistent  rules for digital assets and the innovators building the future of  finance.\n\nFor years, American entrepreneurs and developers in the digital…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…step toward  rebuilding American manufacturing capability in strategic sectors. We  are creating a roadmap for revitalizing rural communities that have  been sidelined for far too long while critical infrastructure  components are manufactured overseas.\n\nThis legislation not only shields America from global supply chain  disruptions but also identifies…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690289/critical-infrastructure-manufacturing-feasibility-act"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "Mr. MILLS. Mr. Speaker, I don't need a written speech or a prepared  document to say how common sense this is.\n\nFor far too long, people have basically turned politics into a career  which was never its intent. It was meant to serve we the people. There  is something that is mutually exclusive: You…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691212/stock-trading-ban-for-members-of-congress"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…fentanyl, was coming across the Caribbean Sea.\n\nEvery year in this country about 80,000 people have been dying. It  used to be over 100,000 people killed from illegal drugs. For far too  long, wimpy Presidents sat there, watched it happen, and didn't do  anything.\n\nFinally, President Trump stepped up to the plate when he heard that  there was a boat coming with…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698045/thanking-president-trump"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "Mr. OWENS. Mr. Speaker, I rise today in support of H.R. 1069, the  PROTECT Our Kids Act. For far too long, American education has been  undermined from within by actors who have taken advantage of our free  and open society to advance the nefarious and anti-freedom objectives…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697528/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…bill, the BRAVE Burma Act. The vice chairman is also a  senior member of the House Foreign Affairs Committee.\n\nBurma has been plagued with an ongoing humanitarian crisis for far  too long. The Burmese people have been the victims of genocide as a  direct result of the military junta's use of funds that fuel these  abhorrent acts.\n\nThe bill introduced by…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699831/bringing-real-accountability-via-enforcement-in-burma-act"}]