[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…than 65 percent of all bank assets. The four  largest megabanks hold more assets than the next 75 largest banks  combined.\n\nThese megabanks are too big to manage. Take Wells Fargo, for example.  They grew larger through mergers and then repeatedly violated the law  and harmed millions of consumers. It got so bad that the Fed, under  former Chair Janet…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…stood with  SEIU and our residents in our medical schools who are demanding fair  pay. We are standing with our teachers who are demanding fair pay. And  we stood with the Wells Fargo workers in Albuquerque who made history  in becoming the first unionized branch ever in the history of this  country. It was that solidarity, when we stood with 80,000 flight…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695576/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…the CFPB over these unfair and deceptive practices, like  skyrocketing fees.\n\nJust one example: A servicemember in Connecticut filed a claim with  the CFPB in 2018 about Wells Fargo's predatory overdraft practices. He  reported he had an overdraft protection turned off his account, but  Wells Fargo still allowed autopayments to be taken out and then charged…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689109/9999"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…Jim, with Fran and family, served parishes in Belgrade,       Litchfield, and Roseville, Minnesota, Viroqua, Wisconsin,       Sioux City, Iowa, and lastly First Lutheran in Fargo, North       Dakota. Jim retired from full-time parish ministry after       serving 17 years at First Lutheran. He continued to share the       Word by accepting an interim…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…out of college as a financial  advisor and sales representative for multiple firms. In 2014, Nate  joined the Utter, Pike, & Dobbs Private Wealth Management Group of  Wells Fargo Advisors, where he currently serves as a partner and  managing director. In addition to his work in the financial industry,  he was elected to serve as the mayor of Anna, Texas,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690209/recognizing-congressional-patriot-award-recipient-nate-pike"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…destination marketing organization,  strengthening the region's reputation and economy.\n\nGreg has successfully championed major projects transforming Des  Moines, including the Wells Fargo Arena and the downtown Hilton  convention hotel. His efforts also helped secure Des Moines as a  recurring host for NCAA Division I events, including the first and  second…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689432/recognizing-greg-edwards"}]