[{"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…Home-Based Telemental Health Care Act, that would  expand access to remote mental health and substance use services in  rural America, specifically for individuals working in the farming,  fishing, and forestry industries.\n\nMr. Speaker, it is time we come together to pass legislation that  will address our Nation's growing mental health crisis and provide…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695302/mental-health-of-farmers"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…Minnesota Farmers Union (MFU), where she has advocated for  affordable healthcare and the needs of family farmers. Additionally,  Linda has been a strong leader for women in farming. In 2013, she  helped reestablish the MFU Women's Conference and later received the  2013 MFU Leadership Excellence award along with her husband, Brian. She  is the current…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690447/congratulating-linda-larson-on-her-graduation-from-inver-hills-community-college"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…comes from Canada, and U.S. refineries across  the Midwest use Canadian oil.\n\nThe United States imports 80 percent of its potash fertilizer from  Canada, and this tariff makes farming and food more expensive.\n\nIt is unclear how the American auto industry is going to continue to  operate. Ford's CEO said these tariffs will ``blow a hole in the U.S.  industry…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…they are so afraid. Their families are  so afraid to send them to school.\n\nIt is in Mankato, MN, which is in the southern part of the State. It  is another regional center, a farming community. I heard today on the  public radio station that the local immigrant rights organization is  getting 400 calls a day from people who are trying to figure out what…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Virginia.\n\nAgritourism, for those who don't know, is exactly what it sounds  like. We are bringing tourists to farms or agricultural venues and  offering experiences related to farming, rural life, and food.\n\nFrom wineries like Stone Tower in Leesburg, farm breweries like  Wheatland Spring in Waterford, you-picks like Great Country Farms in  Bluemont, and…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691461/supporting-agritourism"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…breaks, and it made a difference to  pay attention in those afternoon classes and to be active in your  sports activities right after that.\n\nThe second reason is that the dairy farming industry is not so much  an industry as it is a way of life, and in Vermont, the hardest working  people we have are our dairy farmers. It is a hard, hard job, but it is…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697064/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…delivery project that Congress authorized in 1962, 2 years before I was  even born. The conduit would wind its way for 130 miles, from Pueblo,  CO, to the State line, traversing farming communities that had to rely  on bottled water or prohibitively expensive water treatment.\n\nThis area covers a quarter of the land mass of Colorado. It is  sprinkled with…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698766/9999"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…farmers and farmers worldwide to build stronger,  more resilient farms. His work reflects the creativity and  resourcefulness that define the American spirit and helps keep our  farming economy strong, innovative, and ready for the challenges ahead.\n\nDavid embodies the spirit of hospitality that Kentuckians everywhere  extend to our neighbors. David has opened…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699894/recognizing-david-neville"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…``Maine farms are not just part of our  scenery--they are part of our soul.'' We are so lucky to have her  leadership in our state. I thank Annie for all her work to empower our  farming community and feed Maine's soul.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699302/recognizing-annie-watson"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…bipartisan Farm  Workforce Modernization Act which would provide stabilization for  farmworkers, farmers, and the ag sector, and he added so much because  he really knew how farming worked and what would work and what wouldn't  work, and he was a collaborator.\n\nWe also introduced together the bipartisan Utility Resilience and  Reliability Act that really…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698723/9999"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…fun.'' Guerrero is one of two local Girl Scouts working on a       Gold Award Project. She's partnered with Around the Bend       Farms to get youth involved and make farming a little more       eco-friendly.\n\n``We're creating this food scrap to compost system where       the food scrap waste from the Bethlehem Inn kitchen gets       delivered…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695344/recognizing-kyla-guerrero-for-her-impressive-gold-award-project"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…The Great Lakes form the beating heart of our regional economy. They  support hundreds of thousands of jobs, from the auto and steel  industries, manufacturing to shipping, farming to fishing, and tourism  to technology.\n\nOur freshwater coast is a national treasure, and it is also a global  economic engine, the third largest economy in the world that…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690375/great-lakes-tariffs-and-trade"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…tariffs are hurting our farmers. Just think about this.  Fertilizers--those costs are up 16 percent and in some cases, 39  percent. The effective rate on tractors and other farming machinery is  16 percent and 13 percent, respectively.\n\nWe have also had, as a result of the tariffs that are seen by our  trading partner in Canada that was the participant…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…at grocery stores for Americans. Instead of lowering the cost of  eggs, they are actively making them more expensive.\n\nAnyone who knows a thing or two about agriculture and farming knows  this: Farmers operate on thin margins. They depend on Federal partners  to provide stability in a volatile market.\n\nRight now, with a Federal funding freeze, that support…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688191/protecting-agriculture-the-backbone-of-delawares-economy"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "Mr. MRVAN. Mr. Speaker, when the cost of farming rises, it is not  just a challenge for our farmers, but it is a challenge to our Nation's  security because agriculture is the foundation of America's strength  and stability.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695660/supporting-farmers"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…have seen the differences these programs can make around  the world, and I support their continuance, even if it needs to be in a  new form.\n\nI often tell farmers in Kansas: Farming is a noble profession.  Feeding people is a worthwhile cause, and God gave you a purpose. God  gave you, a farmer, a purpose for your life.\n\nIt was Kansas farmers who came…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691403/motion-to-discharge-s-res-195"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…extending sympathy to the welu family of milroy\n\nMrs. FISCHBACH. Mr. Speaker, I rise to extend my sympathy to the Welu  family of Milroy following the tragic loss of Melvin in a farming  accident.\n\nMelvin was born and raised in Milroy, a third-generation farmer, a  lifelong active member of St. Michael's Catholic Church, and an amateur  historian. He loved…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694029/paying-respects-to-senator-bruce-anderson"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…Nation's food supply and put food on our families' tables.  They work long hours out in the fields, often on their own, trying to  turn a crop and a profit in a challenging farming economy.\n\nBeing isolated from the resources that are available in more urban  areas, farmers and farming families are facing a significant mental  health challenge. With 96…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691424/increasing-mental-health-services"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…elected to  the California State Assembly in 1982.\n\nSomehow, she was able to clean up every mess I made in those years.  She continued in that capacity until Newhall Land and Farming Company,  the largest land developer in California, recognized her talents and  offered her a senior position in their company when she was still in  her twenties.\n\nWell,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690017/mourning-the-passing-of-bob-phelan"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…down through the years to Samuel Black,  who transitioned the operation from a poultry farm to a dairy farm, and  then to Samuel's son Bob Black, who chose to focus on crop farming.\n\nToday, Black's Willow Run Farm is owned by Bob Black's son, Clinton,  and his wife, Jessica. Crops grown on the farm include corn, wheat,  soybeans, and alfalfa.\n\nOn behalf…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696753/improving-domestic-energy-market"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…already have.\n\nAs an animal scientist, I understand the life-changing effects STEM  education can have when it comes to our livestock, creating innovative,  more effective farming techniques, our food quality, and ultimately our  Nation's well-being.\n\nProper STEM education has an invaluable impact on American  innovation. It equips our students--our…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688977/mathematical-and-statistical-modeling-education-act"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…force back then,  Pinal County's economy has exponentially grown and expanded over time,  but agriculture remains a significant part of the county's economy,  while large-scale farming operations and ag research also prevail.\n\nPinal County has experienced significant population growth in recent  decades, becoming one of the fastest-growing counties in the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697110/tiffani-jaseph-named-2026-arizona-teacher-of-the-year"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…easier for his family to pass the  farm on to him and future generations. With family farms making up 96  percent of all farms in my district, this is huge news for countless  farming families in southern Ohio.\n\nThrough the One Big Beautiful Bill Act, President Trump and  Republicans are investing in American manufacturing and American jobs.  I see the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694798/promises-made-promises-kept"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…the town was named Baldwin and saw an  influx of lumberjacks and woodsmen drawn by the abundant forests.  Despite difficult growing conditions, residents were successful in  farming, and in establishing factories to produce lumber, boots, shoes,  and barrel staves.\n\nAs the town grew, so did trade and tourism. The Cumberland and Oxford  Canal opened in…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699146/town-of-sebago-200th-anniversary"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…99 percent of the businesses that operate  are small businesses. Whether they are small businesses on Main Street,  small mom-and-pop shops, little manufacturing operations, farming  operations, or supporting operations, 99 percent of our businesses are  small businesses.\n\nThose 99 percent in my State employ about 600,000 Kansans, which is  roughly half…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690784/big-beautiful-bill"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…TAYLOR. Mr. Speaker, I rise today to recognize Luke Jennings.\n\nLuke is from Felicity, Ohio, and was elected to serve as the national  secretary of the Future Farmers of America.\n\nFarming is in Luke's blood, as he has raised livestock, shown pigs  and cattle, and his family owns and operates Windy Ridge Acres, a beef  cow operation. As the Representative of…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691474/recognizing-luke-jennings"}, {"senator": "John Thune", "party": "Republican", "sentence": "…out of  last week's markup, and that is the Agriculture appropriations bill.\n\nAgriculture is the lifeblood of our country, and in places like my  home State of South Dakota, farming and ranching are a big part of our  way of life. I know how hard American farmers and ranchers work to  deliver food, fuel, and fiber to America and to the world, and I know…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693501/agriculture-appropriations"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…the United States and even to New Zealand.  Kyle also won numerous state awards for his homebred cattle and swept  the fitting contest at the 2024 World Dairy Expo.\n\nDairy farming is not an easy profession, but Kyle approached every  task--from washing animals to packing their bedding--with passion,  drive, and humility. These same qualities have made…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696415/congratulating-kyle-welk-on-being-named-the-2025-merle-howard-award-winner"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…Mr. Vincent Sola,  as he is awarded  the title of Farmer of the Year by the Kiwanis Club of Tulare.\n\nMr. Sola was born in Porterville, California and developed his love  of farming at two years old from his father, John Sola. As a high  school student, he rented his first twenty acres of land as part of a  Future Farmers of America (FFA) project, and…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697013/recognizing-vincent-sola"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…education, leading her to attend the College of  the Sequoias and later Fresno State University. While at Fresno State,  Michelle met her husband, Justin Nuckols, who came from a farming  family in Porterville. The two married in 1995 and made their home near  Justin's family farm. Following graduation, Michelle began teaching at  Tipton Elementary, where…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698441/recognizing-michelle-nuckols"}]