[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…already died, including thousands of children. It is despicable. They  want to cut $2.5 billion in development assistance that our allies and  partners use to build schools, help farmers grow food, fund clean water  projects, and combat poverty. They want to cut hundreds of millions of  dollars in funding for Ukraine and our allies at the border of Russia.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…apple pie. If it gets more expensive, people will choose not to buy  apple pie, and I got to lay people off. I saw it in Trump term 1. I am  going to see in Trump term 2.\n\nFarmers. Farmers have seen commodities be pretty darn flat. Commodity  prices have not been going up. They have been getting a lot more for  agricultural commodities, but the inputs…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…Canada is our second biggest trading partner.  Virginia's businesses export approximately $3.3 billion worth of  products to Canada. We import about $3.2 billion. Virginia's farmers  sell about $430 million of goods to Canada. A lot of Virginia peanuts  go to Canada. They are not going to be going. That is going to hurt our  economy. As a matter of fact,…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689480/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…more unemployment. They are not keeping us  safer, and they are not helping anybody.\n\nA young U.S. Department of Agriculture specialist just moved to Ohio  to assist local farmers sell produce locally. That job is gone.\n\nA young farmer with a newborn daughter and a single mother with two  children just back from maternity leave were hired to help citizens…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687903/draconian-doge-cuts"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…programs that support rural communities.\n\nHe has enacted tariff chaos, driving up the cost of fertilizer, fuel,  and equipment.\n\nHe has launched a trade war, again putting farmers at risk of  retaliatory tariffs that will dry up export markets.\n\nHe has slashed over a billion dollars from food programs that put  fresh produce in school cafeterias and…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690373/first-100-days"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…sources. Mr. Speaker, 60 to  70 percent of usable water in both Oregon and Washington comes from  mountain snowmelt, which is a critical water source in the West. It is  vital to farmers, forests, and every community I represent.\n\nThe scientist was with the Department of Agriculture's Oregon Snow  Survey.\n\nHere is what he said:\n\nMy job was to collect tangible…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688208/fired-by-president-trump"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…expensive       for U.S. businesses to access inputs and capital goods, like       steel and machinery for manufacturers and fertilizer and       agricultural equipment for farmers.\n\nAdditionally, by increasing production costs for       domestically made products and reducing the amount our       trading partners can earn by selling to the United States,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699566/opposing-the-trump-administrations-sweeping-national-tariffs"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…Americans who  didn't. They are hurting Americans who didn't vote and Americans who  were too young to vote. They are hurting the business community, and  they are hurting farmers. They are hurting cities, and they are hurting  our rural areas. They are hurting law enforcement officers and factory  workers. They are hurting teachers and students. They…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…state. She is currently  President of the Maine Dairy Industry Association and has served in  leadership roles of the Northeast Organic Family Farm Partnership,  Maine Organic Farmers and Gardeners Association, and the Agricultural  Council of Maine.\n\nThere are many challenges that come with operating a small farm-- brutal physical work, tight budgets,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699302/recognizing-annie-watson"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…and Mexico, our friends, and the next day he is launching a  global trade war. Today, he is pausing tariffs on some countries while  also increasing them on China. What our farmers, ranchers, and  producers need is certainty.\n\nI don't know how my Republican colleagues can say that any of this is  all according to plan with a straight face.\n\nThere is…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689863/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Island and seize their cargo, such as barrels of smuggled       rum. Accusations soon proliferated that the Gaspee's crew was       stealing sheep and hogs from local farmers, and cutting down       their fruit trees for firewood.\n\nRhode Islanders compared Dudingston to a pirate, sued him       in a local court (which found against him) and even…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…the developing world, and we can maintain  that goodwill by continuing our commitment to doing our part to end  global hunger with U.S.-produced products, sourced from U.S. farmers,  manufactured in U.S. factories that help build U.S. goodwill around the  world.\n\nThat is what we want to continue. We do not want to give an  opportunity to China or anybody…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691610/global-report-on-food-crisis"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…authority to impose tariffs and what the implications are,  because what I am seeing is that our farm economy is really being  devastated by tariffs.\n\nLet's talk about Midwest farmers. They are proud folks, like the  dairy farmers in Vermont, and they used to have markets. The thing they  loved to have is purchasing power that they earned by tilling the…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696342/trump-administration"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…and so they just cut it. They  don't even know what the effect will be. They don't even care. Just  cut, cut, cut. Cut meteorologists who warn our people, our citizens,  our farmers, our businesses of dangers that might come? Cut them? They  are not waste.\n\nTheir recklessness is hurting rescue efforts. It has hurt the  existing ones, and it is going to…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693517/central-texas-floods"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…I can tell you I just spent a week in Colorado, in the rural  communities that I represent, hosting townhalls, visiting with folks in  my community, constituents, ranchers, farmers, teachers, working  families, packed townhalls. At those townhalls, do you know the one  subject that no one brought up? Commercial refrigerators. It never came  up.\n\nAt a…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…which puts an end to the Democrats' reckless and unnecessary 43- day government shutdown, I strongly oppose Section 781 of this bill,  which would deal a fatal blow to American farmers supplying the  regulated hemp industry and small businesses, and jeopardize tens of  billions of dollars in economic activity.\n\nThe 2018 Farm Bill expanded the definition…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696735/continuing-appropriations-and-extensions-act-2026"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…historic economic growth for our country.\n\nThe legislation also provides rural Americans with much-needed tax  relief by extending immediate expensing to help our Nation's farmers  secure the most up-to-date technology and by delivering relief from the  death tax to more than 2 million family-owned farms, which ensures that  the next generation of American…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692792/operation-midnight-hammer-success"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…Many of these projects  would otherwise fall on our local property taxes, which are considered  very high in the State of Nebraska. It will shift the burden onto  families, farmers, and small businesses. So when we can fund these  priorities with Federal dollars that Nebraskans have already sent to  Washington, it provides a major boost for our communities,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699921/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…equal opportunities in the realms of employment  and entrepreneurship for all the people of Iran in a free-market  economy: restoration of the rights of blue-collar workers, farmers,  nurses, white-collar workers, teachers, and retirees.\n\nNine, protection and rehabilitation of the environment, which has  been absolutely massacred under the mullahs.\n\nFinally,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…sector has to offer.\n\nMr. Speaker, I thank all the ag teachers and volunteers across the  country who help propel students into meaningful careers that support  our Nation's farmers, ranchers, foresters, and producers.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695790/national-teach-ag-day"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…testament  from everyone who has crossed his path would be this: What a really  good man.\n\nAs a Member of the Western Caucus, I witnessed firsthand Doug's  fierce advocacy for farmers, ranchers, and hardworking families who  form the backbone of our Nation. It was inspiring.\n\nOn the Transportation and Infrastructure Committee, I saw the same  tenacious…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698718/9999"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…cited billions in so- called ``climate net benefits'' and the ``social cost of greenhouse  gases'' to justify heavyhanded mandates, ignoring the very real costs  passed on to farmers and manufacturers.\n\nFor too long, unelected bureaucrats have ignored the voices of job  creators and working families, pushing costly regulations while hiding  the true impact.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688158/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…regenerative livestock operation which produces a premium  beef brand.\n\nMotivated to help owners of small farms succeed, George also devotes  time to mentoring fellow beef farmers.\n\nMr. Speaker, I thank George Lake for his military service and offer  congratulations on receiving the Pennsylvania Veteran Ag  Entrepreneurship Award.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699740/confronting-the-disease-of-addiction"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…1\\1/2\\ pounds of fish every day.  Even the Fish and Wildlife Service has classified them as opportunist  and generalist feeders that prey on a wide range of species.\n\nYet, farmers are still forced to jump through needless hoops to  prevent these birds from wiping out their stock. The Aquaculture  Depredation Order is nothing new. It is the same commonsense…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697639/cormorant-relief-act-of-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…hours with  the Fire Prevention trailer educating the community, and has been an  essential contributor to fundraising events such as chowder-making,  lobster dinners, and the Farmers Breakfast. His dedication extends to  supporting both the operational and social functions that sustain the  Wendelville Volunteer Fire Company.\n\nRandy's experience, leadership,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699565/recognizing-randy-moje"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…reduce regulatory burdens, establish certainty, and increase  transparency in our permitting system.\n\nThis bill will, in turn, create opportunities for homebuilders, our  farmers, loggers, and our small business owners. It will entice them to  invest in projects that help our local communities grow.\n\nMr. Chair, I will highlight section 12 of H.R. 3898.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698030/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…our Governor, to  discuss how our Federal policies affect their lives. Together, we  explored opportunities to deliver more for all Hoosiers.\n\nI visited hardworking families, farmers, local businessowners, and  the employees who make them go. I discussed our passage of the working  families tax cuts. This bill, now law, allows Hoosiers to avoid perhaps…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694973/hoosier-heartland-tour"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…our ag producers,  and I know the Presiding Officer knows about that very well. Every  American depends every single day on the high-quality, low-cost food  supply that our farmers and ranchers provide.\n\nAt the same time, our farmers and ranchers depend on access to  markets to ensure they get good prices for the high-quality crops they  produce. This…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696017/9999"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…these populations.\n\nIf we are to properly allocate responsibility for the monetary costs  of the wolf, those millions of dollars each year unjustly imposed on  ranchers and farmers damaged by the reintroduction, we must appropriate  the money needed to make these good people whole.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697857/unfair-enforcement-of-endangered-species-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…many  of the communities I represent. When I was elected to Congress, I knew  that I needed a team who understood Kansas agriculture and who would  fight relentlessly for the farmers, ranchers, and ag producers in my  district.\n\nThe Lord provided abundantly by introducing me and my chief of staff  to Riley Pagett. Riley grew up in Woodward, Oklahoma, but…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688493/america-is-back"}]