[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…or, equally important, make  energy more affordable.\n\nIf this administration can derail a fully approved energy project,  whether it is natural gas pipelines or offshore wind farms, why would  any developer--why would anyone invest in the United States?\n\nThe credibility of the United States as a place to do business  craters when projects can be derailed…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…adversaries. Tariffs on key trading partners have already  cost farmers tens of billions of dollars in lost exports. Markets are  shrinking. Input costs are soaring, making it hard for farms to stay in  business.\n\nWe see the sweeping budget cuts and mass layoffs at critical agencies  like NOAA and the Bureau of Reclamation, threatening the services that  farmers…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…by the end of last year, every county in Vermont, all 14  counties, were hit by flooding. That billion dollars in damages  affected homes; it affected businesses; it affected farms.\n\nWe had 6,000 tons of debris that was removed, 77 State bridges and 63  State roads were closed; 704 miles of rail was closed, and 159 miles of  rail trail was closed.\n\nWe…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…countless  family-run poultry operations. Ohio families and farmers deserve better  than price gouging and political spin.\n\nIf we want to protect our food supply and keep our family farms  alive, we must accelerate development of a safe and effective vaccine  and flu remedy as well as coop control and sanitary protocols. Farmers  can't afford to have their flocks…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691814/recognizing-national-egg-day"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…ThayerMahan, a maritime company that installs and  operates undersea surveillance technology using sonar rays and pickets  to keep watch and detect malign activity. They protect wind farms  today. They protect oil rigs today. They protect U.S. maritime ports  today with the finest technology.\n\nMadam Speaker, Secretary Burgum and his staff at BOEM should review…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695066/halt-work-orders"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…assistance program only add to this crisis. At the  direction of this administration, the USDA axed two programs that give  schools and food banks assistance to buy food from local farms and  ranchers. In Delaware alone, this will amount to $2 million in cuts.\n\nJust last month, I stood on this floor to raise the alarm about $10  million in funding owed to Delaware…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689020/food-banks-facing-urgent-crisis"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…cut, but sadly, it  seems it is not for too many of my colleagues.\n\nMr. Speaker, I raise another argument: SNAP dollars flow directly  into our economy, local businesses, and farms. We have a chance to ease  the pain of our most vulnerable.\n\nI will not stand by as Republicans steal from the American people and  give even more to the rich.\n\nThe Gospel…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690833/hunger-is-all-consuming-pain"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…working with a local farm has been super       fun.'' Guerrero is one of two local Girl Scouts working on a       Gold Award Project. She's partnered with Around the Bend       Farms to get youth involved and make farming a little more       eco-friendly.\n\n``We're creating this food scrap to compost system where       the food scrap waste from the Bethlehem…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695344/recognizing-kyla-guerrero-for-her-impressive-gold-award-project"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…community with restaurants, entertainment, and more.\n\nThere is also a vibrant network of neighborhoods that link the  residents of the community: Battle Hill, Fisher Hill, Gedney Farms,  Rosedale, Reynal Park, Highlands, North Street, Carhartt, Gedney  Meadows, and more. They are linked by an organization that is the envy  of other communities in Westchester:…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699911/recognizing-derrick-thompson"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…legislation that  promotes the health and well-being of America's schoolchildren, while  strengthening American agriculture, including the world-class dairy  products and family farms across Central New York and the Mohawk  Valley. That legislation, Mr. Speaker, is the Whole Milk for Healthy  Kids Act.\n\nEarlier this week, the House passed this bill with…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698263/supporting-whole-milk-for-schoolchildren"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…Americans.\n\nThe Department is moving to rewrite or repeal more than 60 workplace  regulations. Let me say that again: 60 workplace regulations. It will  affect conditions in farms, factories, construction sites, and mines.\n\nThese changes are being framed as modernization. In reality, they put  workers at greater risk and undermine decades of hard-won…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695573/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, I rise today in support of the more  than 28,000 farms that engage in agritourism across the country, 1,500  of which are in the Commonwealth of Virginia.\n\nAgritourism, for those who don't know, is exactly what it sounds  like.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691461/supporting-agritourism"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…individual families in America.\n\nSo we can have high-ended debates here, but at home, they are looking  at their grocery prices. They are looking at their markets, their  family farms--that they spent a century there, they are next in line to  take it over--drying up. That is what these tariffs are about.\n\nThen, finally, this President cannot keep abusing…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…broken immigration system,  this wouldn't be the way to do it. If they did, they would work with  Democrats to ensure our border is secure, families stay together, and  our farms and businesses can get the workers they need. Instead, they  refuse to do anything to fix our immigration system for legal  immigration.\n\nMr. Speaker, Wake County and our State…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697072/condemning-deployment-of-cbp-to-north-carolina"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…punished for demanding better conditions.\n\nWhat has this administration done? They have proposed stripping those  protections, both for transportation safety and for organizing on  farms. While they wait for that change to take effect, they have  announced they will not enforce the 2024 Farmworker Rule at all.\n\nWhat does that mean in practice? It means workers,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…supercharging growth for small businesses.\n\nIf these tax cuts are allowed to expire, as we have heard, the  average American would suffer. Make no mistake, small businesses,  family farms, and so many other folks would suffer.\n\nMr. SMITH of Nebraska. Mr. Chair, the American people want us to have  a thoughtful exchange on this. Let's elevate the debate and stick…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688061/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…inability to afford to live in this country.\n\nMs. LEGER FERNANDEZ.\n\nMr. Speaker, it is true in New Mexico, we have all that beautiful  land. We have our ranchers. We have our farms. We have those mountains.  We love our trucks, but the problem is, Trump's tariffs are making all  of that more expensive.\n\nHe is raising the cost of trucks. Remember, there…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "John Thune", "party": "Republican", "sentence": "…already  helping South Dakota businesses innovate.\n\nThen there is the death tax relief. South Dakotans believe the death  tax is fundamentally flawed. It threatens too many family farms and  ranches and family businesses. Republicans agree. And so in the Working  Families Tax Cuts, Republicans permanently raised the death tax  exemption threshold to protect…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698212/senate-accomplishments"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…authorization would disrupt the current grain inspection and weighing  process, cost the farm economy more than $70 million a day, and create  serious consequences for American family farms, our supply chain, and  our international trading partners. These disruptions are entirely  avoidable.\n\nWe are doing our farmers and export partners a disservice if we don't…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "Mr. KENNEDY of Utah. Mr. Speaker, on February 25, 1846, beleaguered  residents of Nauvoo, Illinois, began leaving their homes and farms  behind, crossing the frozen Mississippi River by ferry and wagon to  escape persecution. Only the sickest and poorest remained behind, and  even they were finally forced out…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694022/july-24th-utahs-state-holiday"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…track.\n\nThe One Big Beautiful Bill Act gave a lifeline to the agricultural  community by updating reference prices, expanding crop insurance, and  saving millions of family farms from the death tax. The relief was long  overdue. We are grateful, but the work doesn't stop there.\n\nIt is past time for Congress to pass a fiscally conservative 5-year  farm…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693761/getting-animal-health-research-right-in-farm-bill"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…FOXX. Mr. Speaker, I thank my colleague Mr. Schweikert for  yielding to me.\n\nMr. Speaker, this past weekend, I had the wonderful opportunity to  stop in at Top of the Mountain Farms in Ashe County and support a local  small business selling Christmas trees and wreaths.\n\nBecky and Bill Fairchild, the owners of this Christmas tree farm,  were very welcoming.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697374/fun-with-math"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Pennsylvania's  top-producing counties for a variety of commodities such as milk,  apples, peaches, and cattle. Franklin County has invested more than $40  million to preserve 164 farms.\n\nMr. Speaker, on behalf of everyone in Pennsylvania's 13th  Congressional District, I congratulate all of Franklin County's  farmers.                         Congratulating…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698173/lowering-healthcare-costs-for-all-americans"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…businesses.\n\nThis bill will help our Main Street businesses grow, invest, and  hire, and it will increase the exemption for the death tax, which will  help save 2 million family farms.\n\nAdditionally, this legislation formally funds the border wall, hires  more ICE and Border Patrol agents, and creates American energy  independence.\n\nWe must pass this bill…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693183/one-big-beautiful-bill-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…week.\n\nAgriculture has a long history in the Commonwealth and has been one  of the State's first industries. For the prosperity of the State, it is  important to preserve these farms and pass them to the next generation.\n\nPennsylvania leads the Nation in the number of preserved farms, and  the Century and Bicentennial Farm programs recognize the commitment…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699335/farm-show-centennial-award"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…much more.\n\nThe bottom line is that without reforming the Clean Water Act,  America cannot efficiently build roads, bridges, pipelines, ponds,  dams, levees, airports, homes, farms, and other infrastructure that we  need.\n\nThis bill acknowledges that we can both protect our natural resources  and allow for development that benefits everyone in this country.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698041/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…benefit. With our Rural  Advisory Council, I heard directly from Utah farmers and ranchers, the  backbone of our State. The bill raises the death tax exemption,  protects family farms, and strengthens food security for generations to  come.\n\nIn Fairview, I heard from rural Utahns who rely on affordable energy  to power their homes, farms, and businesses,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694790/promises-made-promises-kept"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…this bill significantly  improves the core safety net and risk management tools by increasing  reference prices and improving crop insurance.\n\nIt expands flexibility for family farms to reinvest in equipment,  inputs, and labor. It renews 100 percent expensing for capital  purchases so producers can write off the cost of new machinery,  infrastructure improvements,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…concern. On the one hand, this bill helps  farmers and loggers feed and fuel this country by helping them move  product across the Commonwealth of Virginia directly from their farms  to their processors, but the bill also increases transportation safety.\n\nAgriculture and logging are two of the largest industries in the  Commonwealth of Virginia, combining…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688207/relief-for-virginias-farmers-and-loggers"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…hitting 200 years in operation next year, the increased  death tax exemption means it will be easier for his family to pass the  farm on to him and future generations. With family farms making up 96  percent of all farms in my district, this is huge news for countless  farming families in southern Ohio.\n\nThrough the One Big Beautiful Bill Act, President Trump…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694798/promises-made-promises-kept"}]