[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…veterans risk  missing out on the program's benefits.\n\nRepresentative Dexter's bill would make it easier for veterans to  find employment while in the program and to graduate faster from the  program, freeing up counselors at VA to assist the next class of  disabled veterans seeking a new career.\n\nOne of the primary goals of the PACT Act was to recognize…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695411/focused-assistance-and-skills-training-for-veterans-employment-and-transition-success-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…oil from America's Arctic will  not come online for many, many years.\n\nThe Willow project, for example, won't start until 2029. Meanwhile,  the Arctic is warming four times faster than the rest of the world.  Even at the Willow project, developer ConocoPhillips will use  artificial chillers to freeze melting permafrost before drilling for  oil. That…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…discipline in Washington. There is  no reason to conclude that it would not work here, and every reason to  conclude that absent such an approach we will be in far worse shape far  faster than followed previous attempts.\n\nWe clearly need help with our collective inability to confront this  reality. My Sustainable Budget Act is at least a start toward a  solution.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689288/introduction-of-the-sustainable-budget-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…benefits. Sometimes these calls are a simple matter of  getting people the right point of contact in the right office.  Sometimes it is an ask to wake a sleepy bureaucracy to move faster on  behalf of a constituent. Sometimes these calls highlight a loophole or  a blind spot in the law that has been discovered because deserving  beneficiaries have been wronged…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699468/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…air,      Where every sunset felt like it knew me.      But here, the marble glitters cold and bare,      And I feel lost in all this history.      These crowded halls move faster than my breath,      Each rushing step reminding me I'm new;      Some days my confidence feels close to death,      And I miss skies my hometown once let through       I smile,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…happening just as predicted.\n\nIn mid-August, The Guardian says:\n\nTrump's tariffs and green energy rollbacks push household       electricity bills up by 10 percent.\n\nThis is much faster than the core inflation rate, which is going up.  So now, energy inflation is outstripping the rest of inflation, and it  is particularly hard for low-income households.\n\nThen,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…their pay-to-play scheme would allow Big  Oil polluters to pay a one-time $1 million fee to the Department of  Energy to grease the skids to get polluting gas plants online faster.\n\nYes, we need more energy, but this comes at a time when they are, in  doing so, going to raise electric bills across the country because they  say it is only oil and gas.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691593/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…refund checks. It empowers the U.S.  Treasury and financial industries and institutions to act swiftly when  fraud is detected, enabling that victim to get their payment much  faster and that criminal to be held accountable.\n\nWith this bill, stolen checks can be flagged and traced more  efficiently, victims will experience a quicker resolution and recovery…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689292/recovery-of-stolen-checks-act"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…air-conditioner during  dangerous heat waves because their electricity costs will spike.  Seniors are turning off the heat on frigid winter days. Prices jumped  sharply last year, far faster than paychecks.\n\nLast year, there were 43 different electricity rate hikes across the  country, totaling over $11 billion in new costs for ratepayers.  Millions of households…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699895/prices-are-too-high"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…advanced data and resource matching  technology accelerates donation routing and optimizes logistics. This  system enables the delivery of critical goods up to three times faster,  while minimizing environmental impact and ensuring that the right  products reach the right communities at the right time.\n\nMr. Speaker, I commend Good360 for its dedication…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694807/recognizing-good360-in-honor-of-national-preparedness-month"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…has put on  things like aluminum and steel. That is not going to solve the rising  costs we are dealing with right now.\n\nIn contrast, solar, wind, and battery are modular, faster to permit,  and easier to construct with fewer supply chain restraints. That is  especially true when they are--or were--already permitted, with shovels  in the ground, workers…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…climate crisis is here,  it is real, and it is exacerbated by this administration's relentless  push toward fossil fuels.\n\nIn the Arctic, temperatures are rising four times faster than the  global average.\n\nIt is the indigenous communities in northern Alaska and in the refuge  that are disproportionately feeling the devastating impacts of the  climate…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…that the chairman and sponsor worked with Representative  Waters and Representative Foster to include our amendments to help  ensure that we learn how technology may require faster emergency  liquidity deployment, as well as understanding  barriers like stigma that need to be addressed to improve the  functioning of the discount window.\n\nMr. Speaker,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699862/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…the  ballot, we are all going to Congress together. Families in Ohio's 13th  Congressional District and all across the country are telling us that  housing costs are rising faster than wages, making it hard to keep a  roof over their heads.\n\nToday, I rise to bring an issue that plagues my community and the  entire country, which is the rising cost of…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699021/rising-housing-costs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…this bill. Honestly, it sounds more like  a cult than a Congress to me.\n\nSome Republicans promised their voters no cuts to Medicaid and no new  debt. Now, they are flipping faster than pancakes at a campaign  breakfast. The House passed it hoping the Senate would kill it. The  Senate passed it hoping the House would grow a spine.\n\nEveryone is playing…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…the price,  demand surges and prices soar. We have seen this movie before. Since  Federal student loans began 50 years ago, college tuition has risen  four and a half times faster than the rate of inflation.\n\nWhen Democrats passed the Inflation Reduction Act and spent $1  trillion on subsidies, inflation hit a 40-year high. It is clear that  pouring…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697139/skyrocketing-cost-of-healthcare"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…scientific  discovery, and other Federal missions are successful.\n\nThe work ITS performs has led to innovative advancements in the way  we manage our airways. These airways power faster mobile connectivity  for Americans, and making more spectrum available in the future is  critical to beating Communist China and ensuring our continued economic  and national…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693439/institute-for-telecommunication-sciences-codification-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…reached out to my office  asking for help replacing outdated systems and gear. With these  upgrades, officers will be able to communicate, and they will be able  to respond faster. And this will improve safety for both our first  responders and also the communities that they serve.\n\nI also worked to secure $8.8 million in the Interior and Environment…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699921/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…modeling that shows when you do expense  research and development, when you do expensing, you get a virtuous  cycle of: We bought the piece of equipment, so we do it better, faster,  and cheaper. Our competitors just did it, so the next year, we have to  do it again.\n\nThat was one of the reasons, particularly prepandemic, we had that  sudden spike of…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…for the 21st Century Act will streamline  approvals and simplify the Federal and local housing process to give  rural and urban communities the tools they need to build homes faster.  Importantly, our bill helps banks access stable deposit funding. It  streamlines the exam process that is tailored particularly for our  vital community banks. It helps promote…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…should focus  on adding new capacity--new capacity--before prematurely retiring  existing assets and cut redtape so that generation, pipelines, and  transmission get built faster. That is what we should do. Let's not  write off active megawatts and then act surprised when bills rise and  lights flicker.\n\nSo if your priority is reliability and protecting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695511/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-emissions-budget-and-allowance-allocations-for-indiana-under-the-revised-cross-state-air-pollution"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…just paid for our  reconciliation bill and put some more money in the bank.\n\nMy point is that if we would actually think about policy, the  modernization, doing things better, faster, cheaper--next week we are  going to do a--I think one of our Democratic colleagues a couple of  moments ago was attacking some of the--we will call it the DOGE cuts.  Last…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…healthcare that  they are receiving.\n\nLet's be honest about where we are right now. Healthcare now consumes  one-fifth of our entire economy. Hospital prices have risen three times  faster than the awful inflation that we have been experiencing as a  mean.\n\nInsurance premiums have soared, yet patients still struggle to see  their doctor. They still wait weeks,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "John Thune", "party": "Republican", "sentence": "…President Trump's  agenda first and foremost by getting his Cabinet in place. I am proud  to report we have confirmed 20 of the President's 22 Cabinet nominees-- a substantially faster pace of confirmations than in any of the three  previous administrations.\n\nIn addition to Cabinet nominations, we have also been laying the  groundwork for making the tax cuts…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688403/joint-session-of-congress"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…instead of the  creative destruction that starts the next cycle of productivity.\n\nWe need the creative destruction in our economy to have the rebirths  of the newer, better, and faster. Yes, it is always uncomfortable. It  is also really great free market economics. And it is as if we have  repealed the rules of a free market economy in this country right…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…for them;\n\nFive, it reopens Federal lands for energy and mineral development,  restoring American energy leadership;\n\nSix, it unlocks spectrum for auction so we can roll out faster 5G;\n\nSeven, it restocks our military, delivering peace through strength;\n\nEight, it invests $10 billion in border security or more;\n\nNine, it eliminates the $200 Federal tax…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692871/ten-commonsense-reforms"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…risk factors associated with aviation  service, we can implement targeted screening protocols that enable  earlier detection, when treatment is most effective. This leads to  faster access to care and benefits, significantly improved survival  rates, more time with loved ones, and the opportunity for continued  service.\n\nThis bill builds upon previous…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693896/aces-act-of-2025"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…I would just remind the gentlewoman from  Minnesota (Ms. Craig) and my Democratic colleagues that after the first  Trump tax cuts, the bottom half's income grew three times faster than  the top half. For the lower 10 percent, wages increased two times over  the 1 percent. People at the bottom and people in the middle benefited  more from the tax breaks.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693192/one-big-beautiful-bill-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…just to maintain baseline services.\n\nThe whole presentation of walking through what happens when you get a  moment to actually disrupt policy and do things that are better,  faster, and cheaper--because I will argue the army of lobbyists,  basically the rent seekers, if you remember your high school economics,  who are around us all, despise the concept…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…supply, lowered the price of lumber, and  brought mortgage rates below 6 percent.\n\nThis legislation builds on that progress by removing Federal barriers  so homes can be built faster and economically at scale without new  Federal spending.\n\nToday, it can cost over $100,000 before a shovel ever hits the dirt  to build a new home, and builders often cannot…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699948/housing-for-the-21st-century"}]