[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…amnesty for any reporting requirements.\n\nIn effect, the bill claims to establish a speed limit and       then provides what amount to exceptions for drivers with red       cars, fast cars, or if they're in a hurry.\n\nFurther, the bill offers a means for non-crypto companies       to bypass securities law and use the blockchain to raise       funds. This threatens…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…smoke. This energy  emergency is just fossil fuel gaslighting of the American people.\n\nSince Trump took office, electricity prices have gone up more than 10  percent--twice as fast as general inflation, which also remains  historically high thanks to the Trump administration running our  economy into the ground. Their tariffs and their healthcare policies…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696132/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…for small businesses. It would also delay  commercialization of promising technologies and weaken the United  States' competitiveness with foreign adversaries.\n\nDespite this fast-approaching deadline, negotiations for a  comprehensive reauthorization are ongoing, and while I attempted to  start the process early by introducing a bill last December, formal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695450/extension-of-sbir-and-sttr-authority"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…really here to make a plea:  Mr. President, please reconsider. These tariffs are fundamentally  misguided. They are dumb. They are cruel, reckless, and careless. They  play fast and loose with America's credibility around the world.\n\nI urge my colleagues to vote yes on S.J. Res. 37 and join us in  trying to save the American economy and our credibility…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689487/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…people at the  Edmund Pettus Bridge, the blood of people who died in the days before  and after. It was written in blood. Yet they would overlook that part  of the history, fast-forward to today, and it seems that they are now  about to eliminate section 2 of the Voting Rights Act.\n\nThis means that if Texas prevails with these maps and can remove five…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…infrastructure upgrades so power can get online. We should do it all in  a way that is fair to American families paying the bills.\n\nThis bill does none of that. It simply gives a fast pass to Big Oil  and Gas, and I urge my colleagues to oppose the bill.\n\nMr. PALLONE.  Castor), the ranking member of our Energy  Subcommittee.\n\nMr. Speaker, the Energy and Commerce…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695754/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Mr. MERKLEY. I would be happy to yield for a question.\n\nMr. MERKLEY. Thank you so much to my colleague from Oregon for this  question.\n\nIt is very powerful to think about how fast the menace grew through  the Jewish community in Germany and how, if one did not recognize that  threat--and if I understood it right, the women in the family were the  ones…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Republicans controlled the House and they  controlled the Senate. They decided: You know how we will tackle the  deficit now--now that we have destroyed the 1974 law that said the fast  track can only be used for reducing the deficit and how we switched  that and said it could be used for increasing the deficit--now we have  destroyed that, and we have a new…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…was cheaper for us to move in  the direction of clean energy in Hawaii, but you couldn't say that on  the continental United States side. And we moved in that direction as  fast as we possibly could and tried to provide some measure of relief  for ratepayers.\n\nBut now what is going to happen is we are going to have to buy a  bunch of electrons in the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699020/energy-costs"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…detention center.\n\nTo add insult to injury, the Trump administration is using the same  law, the Alien Enemies Act that was once used to imprison Japanese  Americans, to detain and fast track deportations, with zero due process  rights.\n\nWhile this administration insists it is targeting dangerous  criminals, we know that more than 73 percent of those in ICE…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697462/fighting-dhs-immigration-raids"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…have more voices heard too. There could have been a  robust, healthy, political, and democratic negotiation. But, no, Big  Oil chose not to do that because it knew it had a fast lane through  this body.\n\nThey had another alternative, which is to amend the Clean Air Act or  the Congressional Review Act to solve this problem. You could amend the  Clean…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Ms. JOHNSON of Texas. Mr. Speaker, I rise today to announce the  introduction of my bipartisan Fast Track Healthcare Apprenticeships  Act, alongside my friend, Congressman  Mike Kennedy from Utah.\n\nAcross the country, and especially in Texas, families are feeling the  strain…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697515/supporting-healthcare-apprenticeships"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…recover from malnutrition quickly.\n\nMr. Speaker, I worked at UNICEF. I have seen firsthand the power of  these lifesaving treatments. I have seen that they work. I have seen  how fast kids can bounce back and recover. I have seen that U.S.  funding and U.S. assistance makes a difference.\n\nUnfortunately, President Trump has eliminated countless assistance…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690808/funding-food-aid-for-malnutrition"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…order at this  point in the year than any Congress going back a decade.\n\nBy decimating debate, House Republicans have turned themselves into a  rubberstamp for Trump. They will fast-track giveaways to the wealthy  and the well-connected, but they will block amendments that would  protect care for millions or unrig our economy for working people.\n\nThe real…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…forces from Ukraine.\n\nTo quote my Republican colleague and dear friend, Congressman   Don  Bacon: The Trump administration royally screwed up on Ukraine.\n\nAnother anniversary is fast approaching. Indeed, on April 20 of last  year, 101 Republicans voted to support Ukraine. I am really glad that  Representative Bacon is speaking out about President Trump's…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…related  to their chemical and toxic exposures.\n\nVA needs robust medical research to streamline military aircrew  veterans' access to disability compensation, and VA needs it fast for  today's and tomorrow's veterans.\n\nThis bill ensures that research gets done and that our military  pilots and aircrew get the answers they deserve.\n\nMr. Speaker, I urge…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693894/aces-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…if you take every tax  they have that they have scored: Raise tax on capital gains, raise tax  on income, raise tax on businesses, raise tax here.\n\nI am sorry for talking so fast. Believe it or not, I live on coffee,  and I need to apparently deal with my issue with a 12-step group for  coffee.\n\nHowever, the point I am going to, read the article. All…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…right, as a broad statement. Is that true?\n\nMr. ROY. It was supposed to then be a shared arrangement between the  States and the Federal Government, correct?\n\nMr. ROY. Now, fast-forward, and the current vulnerable population-- what we call the vulnerable population--the indigent, the poor, those  who need it, single moms, people who are sick, the frail--that…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690587/economic-anxiety"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…valuable data on potential biological  threats.\n\nWe must do everything we can to ensure that the tools we rely on  remain as advanced and effective as possible, providing us with fast,  accurate, and reliable data. Unfortunately, DHS has faced continuous  challenges in acquiring capabilities to replace BioWatch.\n\nWhile DHS has the authority to utilize the…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688731/dhs-biodetection-improvement-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…ObamaCare for about 10 million people.  That was called the enhanced premium tax credit that got added on top  of ObamaCare because the ObamaCare costs were skyrocketing so fast.\n\nThey called it, at the time, a temporary plan to be able to help  during COVID. But then a year later, they added another 2 years on top  of it. That is now what is expiring…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…hour in your car or 2 hours if you are using existing public  transportation.\n\nThink about this. You are taking our high-speed rail which, by the  way, isn't going to be that fast. It will probably be the slowest high- speed rail system in the world if it even gets built. Then you get out  at Gilroy, and you have to somehow have a car there and drive…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…teams have  demonstrated extraordinary skill, professionalism, and courage day and  night, in all conditions.\n\nThousands of families across our region have been touched by the  fast, expert care this team delivers. Their work has strengthened our  emergency response system, expanded access to advanced medical care,  and saved countless lives.\n\nToday, we…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697041/congratulating-memorial-medflight-on-its-20th-anniversary"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…everyone  feel special because she genuinely believed everyone was special. She  treated people with compassion and kindness--always standing up for the  underdog, and making fast friends wherever she went.''\n\nMolly was deeply loved by Jim and Lisa, and because of that love,  Molly was also loved by many of her colleagues in this House. She grew  up here…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…settlers followed, and at the dawn of the 19th  century, the town was established by Massachusetts Governor Caleb  Strong.\n\nThe rich soil supported prosperous farms and the fast-moving Sandy  River powered lumber and grain mills. In the years that followed,  Strong became a rural industrial powerhouse, including footwear,  furniture, textiles, and Maine's…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699397/225th-anniversary-of-the-town-of-strong"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…foreign terrorist organizations to  move, at the time, over 250 tons of cocaine through Venezuela--cocaine  that was cultivated, manufactured, and moved through Venezuela.\n\nThen, fast-forward to January 2025. The Biden administration and the  Biden Department of Justice, at the time relying on the same indictment  from the Trump administration, increased…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698885/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…related to  their chemical and toxic exposures.\n\nThe VA needs robust medical research to streamline military air crew  veterans' access to disability compensation, and VA needs it fast, for  today and tomorrow's veterans. My friend from Texas' bill would ensure  that research gets done and that our military pilots and air crewmen  get the answers they deserve.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690650/aces-act"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…more, and we  certainly cannot afford to keep delaying critical projects.\n\nThe GRID Power Act addresses this by requiring FERC to develop rules  that allow grid operators to fast-track critical generation needed to  ensure reliability and meet demand, bypassing the years-long wait in  the interconnection queue.\n\nThe bill also promotes transparency by…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695755/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Focused Assistance and       Skills Training for Veterans' Employment and Transition       Success Act'' or the ``FAST VETS Act''.       SEC. 2. CONDITIONS UNDER WHICH SECRETARY OF VETERANS AFFAIRS                     SHALL REDEVELOP INDIVIDUALIZED VOCATIONAL                     REHABILITATION…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695412/focused-assistance-and-skills-training-for-veterans-employment-and-transition-success-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…America.\n\nMy office was honored to play a small part in helping her navigate  the final steps of that journey. Her story is a reminder that the  American Dream is not always fast or easy, but it is real, and it is  still worth fighting for.\n\nI congratulate Oslene and her family. Today, we celebrate not just a  new citizen, but a dream realized.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691362/congratulating-oslene-ducady-on-becoming-an-american-citizen"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…odds are helping  to advance science in the ALS community today. Alex's brain tissue was  donated to advance ALS research, and Jaci personally urged lawmakers  and the FDA to fast-track a new personalized drug designed specifically  for her rare and aggressive form of ALS.\n\nThese sisters showed us what it means to be courageous, to live with  purpose,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691604/als-awareness-month"}]