[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…belief that Together We Can work  toward a cure for this devastating disease; and\n\nWhereas, Cindy Rice's eligibility for AMVETS stems from her proud  lineage of service--her father, a World War II Army Veteran, and her  husband, Roger, a U.S. Navy Veteran--and is further honored by two  nephews currently serving in the U.S. Marine Corps; and\n\nWhereas,…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690126/proclamation-for-national-amvets-auxiliary-president-cindy-rice"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "Mr. DeSAULNIER. Mr. Speaker, I rise today in recognition of September  being Suicide Prevention Month.\n\nMore than 35 years ago, my father took his own life by firearm.  Unfortunately, this kind of tragedy is too common in America.\n\nThere were 1.4 million suicide attempts in 2019, making suicide one  of the most…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695318/recognizing-suicide-prevention-month"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…is deeply concerned and a Submission of the Colony of Rhode       Island to this enormous Claim of power would be made a       Precedent for all the rest,'' founding father Samuel Adams       wrote to Rhode Island's deputy governor in January 1773.\n\nBut the Gaspee affair, which shook the colonies and rattled       the crown, has been largely forgotten…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…and we  have been addressing for decades now, but it is catching its steam  again and starting to kill more people.\n\nThe Alzheimer's piece is especially of concern to me. My father died  from Alzheimer's, and watching that happen is like ripping your heart  out. They had clinical trials going on Alzheimer's which were shut down  based on the terminations…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…change.\n\nAward-winning filmmaker, screenwriter, and producer Ava DuVernay grew  up in the communities of Lynwood and Compton, in California, and spent  her summers visiting her father's home state of Alabama. It was in  Alabama that DuVernay found her passion for film through cherished time  spent with her aunt, Denise Sexton.\n\nSetting out into the film…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696266/recognizing-ms-ava-duvernay-art-as-a-catalyst-for-change"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…cause of equal rights; good people who  caused good trouble in the fight against hate; good people who caused  good trouble in the fight against demagogues from McCarthyism to Father  Coughlin, to big people who showed such small character when they tried  to suppress others. I want to cause good trouble and prove worthy of  those who came before.\n\nThis…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…suffering for all of Europe,  frankly, but obviously so much so for the people of Ukraine, and we  must do it through strength.\n\nI will end with this: With the passing of the Holy Father and holding  on to a promise of my faith, he reminded us over and over again of the  Gospel of Matthew: Blessed are the peacemakers, for they shall be  called the children…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690214/supporting-ukraines-independence"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…during the day.\n\nThis led to the death of an innocent man. This was over a stolen car.  Think about what you would say to that family when you are explaining  to them that their father, brother, or son lost his life over a stolen  car.\n\nThen the other part that influences me--again, I represent Prince  George's  County now--but sometimes when they start high-speed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695639/district-of-columbia-policing-protection-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…thousands of positions  across our Federal workforce will continue to hurt families in our  communities.\n\nI grew up in the heart of the civil rights movement. As a child, I  saw my father and my mother take a stand against those who legislated  against our freedoms and our rights as Americans. Mr. Speaker, 60 years  later, those same forces are animating the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690638/trumps-first-100-days"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…have a level  playing field, have only been to make sure that I can't be excluded  when I have the exact same qualifications as you.\n\nI stand here today as a proud son of a father and mother who have  both made Black history in their own right. I stand before you here  today as the proud grandson of men who set the stage.\n\nMost Black people in this country…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…imminent threat, then that provision of the Constitution is dead  letter. Period. Stop. And the most important piece of this document,  according to our most revered Founding Father, is no longer  operational.\n\nAnd if we lurch into a world in which any Executive can send us to  war without the participation of the American people, then we are in a  world…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693125/motion-to-discharge-sj-res-59"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Congress debate the SAVE Act. He was forced to  fly home after the Speaker canceled 3 days of legislative work.\n\nMr. Wilson is an American citizen, born in Japan to a military father  during the Vietnam war. Mr. Wilson is also a veteran. He proudly served  our Nation overseas, including in Korea and Germany.\n\nLike millions of Americans, Mr. Wilson does…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…brings us to Iran. One of the proudest moments in  my career was standing alongside Dr. Richard Garwin, who, as  Representative McGovern mentioned, was often pointed to as the father  of the hydrogen bomb and a strong advocate for nuclear  nonproliferation. He stood by my side, along with Energy Secretary Dr.  Ernest Moniz, as I announced my support for…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…federal  workforce.              What it is Like to be a Federal Employee in 2025\n\n(Commentary published in the Federal News Network on June 13, 2025)\n\nI remember driving with my father down Rockville Pike in       Bethesda, Maryland as a little girl. We would pass a large       campus of impressive buildings called the National Institutes       of Health.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…masked gunman opened fire inside a classroom at Brown University. Nine  students were injured, and two were killed. The victims were not even  20 years old. This is every father's and every mother's worst  nightmare. For now, the shooter remains at large, and we urge residents  in the area to listen  to guidance from local law enforcement.\n\nThen, just…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698130/shooting-at-brown-university-and-shooting-in-sydney-australia"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today with a heavy  heart to share a few words about my dear friend, Congressman Doug  LaMalfa.\n\nDoug was a husband, a father, and a fourth-generation rice farmer. He  dedicated more than 20 years to public service, both in this House and  in the California State Legislature.\n\nDoug was a giant in…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698715/9999"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…childcare. It is something we  can get done, and the reason why we do this is because it is important  to allow women and parents to work. It is often men who stay home as  the father. It is also important for the child because when you get  good early childcare, you grow up to have more opportunities in life.\n\nOn average, though, parents spend between $6,500…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…this thing should take a deep look in the mirror.\n\nI say to my friend, Mr. Roy, who is a gentleman who supports the  enforcement of law, he is a good and compassionate man, a father and  husband, he is determined to serve his country, and asking our fellow  man, Mr. Speaker, to hear this message: enforce existing laws,  prosecute violent criminals, incarcerate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…honor Jay Burke  III, the Grand Marshal of the 201st Savannah St. Patrick's Day Parade.\n\nThis prestigious role is made even more special as Jay follows in the  footsteps of his father, James F. ``Jimmy'' Burke, Jr., who led the  same parade 28 years ago in 1997.\n\nTheir legacy is a testament to the deep tradition of this event, one  of America's oldest and…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688723/patricks-day-parade"}, {"senator": "French Hill", "party": "Republican", "sentence": "…family.--The term ``immediate family'' of any       natural person means the following (whether by the full or       half blood or by adoption):\n\n(A) Such person's spouse, father, mother, children,       brothers, sisters, and grandchildren.\n\n(B) The father, mother, brothers, and sisters of such       person's spouse.\n\n(C) The spouse of a child, brother,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693876/taiwan-conflict-deterrence-act-of-2025"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…state-of-the-art, fully digital campus  that serves as a thriving international body.\n\nThroughout his accomplishments, Judge Ginn has remained a devoted  husband, a devoted father, and a devoted grandfather. He and his wife,  Lynn, have been married for over 40 years and have raised four  daughters, three sons-in-law, and five grandchildren, imparting…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688470/recognizing-phil-ginn"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…line, the thin gold line, and the thin red line  that holds society together. They serve not for accolades but out of  duty and honor.\n\nMr. Speaker, I know this personally. My father was a police officer  and a detective, while my grandfather also was a firefighter. He was  the captain of his house.\n\nI remember clearly the risks that my father took every…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691021/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Christine to the  office back when she was in kindergarten. At the time, she would help  around the office in exchange for a toy and some candy at the Main Drug  Store. Christine's father, Roy, Jr., managed the business until 2003,  when Christine officially purchased the business from him.\n\nFor more than seven decades, the Hebard Insurance team has been  committed…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…Washington, D.C., from September 15 through  September 17.\n\nFor many Greek Orthodox faithful in my district, His All-Holiness is  more than a religious leader. He is their spiritual father. He is a  voice of compassion, a symbol of faith that has been carried across  generations of families who came to America in search of freedom of  opportunity. His visit to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695267/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…significant acclaim, being ranked in the top 10 percent of restaurants  worldwide by Tripadvisor in 2024.\n\nMr. Pappas was more than just a restaurant owner. He was a loving  father and a grandfather, a mentor and a role model, and an exemplary  civil servant. His legacy will live on through Olympia Cafe, where  countless memories and joy were brought…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692245/congratulating-greg-parker-retailer-executive-of-the-year"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…H.R. 3109, and I reserve the  balance of my time.\n\nWhen I was a young man in the 1970s--when I was a kid, I guess, in  the 1970s--I remember gas lines and having to push my father's car to  get gasoline. At the time, everybody said we were going to run out of  crude oil. That was the thing, running out of crude oil.\n\nI appreciate the gentleman bringing…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…to the floor today is to look at,  from top to bottom, not just the judicial system, but really the entire  process of the court system.\n\nI have some background in this. My father served as a chief judge of  the Western District of Texas in San Antonio. He served as FBI Director  for President Reagan, President Bush, and President Clinton. He  understood…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695616/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "Mr. MANN. Mr. Speaker, on Tuesday, this Chamber lost a kind friend,  loving husband, proud father, and tireless advocate for rural America  and the Western United States.\n\nDoug LaMalfa brought joy and sincerity into the Halls of Congress  every single day and fought for…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698727/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Haney, started AllegiantVETS, which is a way to  provide a bridge for veterans leaving military service to be integrated  into jobs in their local communities.\n\nMark Haney, his father, says:\n\nWe have imagined the impact that the most resourceful       regional leaders could have if united to help one promising       entrepreneur. The Growth Factory is the…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…congressional  staff for these past 3 years. His was a remarkable life and one that  should inspire every American to realize the opportunities that freedom  provides.\n\nWhen Bob's father died, he was forced to drop out of high school to  work odd jobs to support their family. For nearly 10 years, he worked  as a crab cracker at Alioto's restaurant on Fisherman's…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690017/mourning-the-passing-of-bob-phelan"}]