[{"senator": "Wesley Bell", "party": "Democrat", "sentence": "…heavy.  At home, I see a community that still believes in looking out for one  another, especially our children. Not every child has the stability  they deserve, through no fault of their own. When families can't carry  that load alone, the rest of us have to help.\n\nThat is what organizations like the Foster and Adoptive Care  Coalition do every day,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698411/recognizing-annie-malone-and-foster-and-adoptive-care-coalition-in-st-louis"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…or water supply.\n\nCalifornia's water shortage is driven by climate change and also  prolonged drought, aging and outdated infrastructure, and  overallocation. It is not the fault of some tiny fish.\n\nMeanwhile, farmers, including those in my district, are grappling  with worsening droughts, wildfires, floods, extreme weather, and now  the fallout from…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…into the repairs.\n\nSo my hope is that we can come together as a Congress to fix FEMA so  that its capacity to help our communities when they have been hurt so  hard through no fault of their own--that they will be able to get the  capacity to make decisions, act, and get their community back on its  feet.\n\nNow, I do oppose this discussion that we are had…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Musk has not had an overdraft fee recently.\n\nOverdrafts hit people who are living paycheck to paycheck, people who  are at the bottom rung of our economic order through no fault of their  own--often the result of discrimination and denial of rights that  others are fortunate to have.\n\nBut put aside the inequities of this rule or the overdraft practices…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689109/9999"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…government and they saw the worst of  government.\n\nMr. Speaker, the best of government was when people came together to  solve problems and to help people who were hurting through no fault of  their own. These were people who were working day in and day out and  couldn't afford to put food on the table. They couldn't afford  healthcare when they got sick. They…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…They are inviting all the Members of  Congress to go see the Department of Justice's ``unredacted files,''  but they have got all redacted files from the FBI.\n\nIt is not the fault of the Justice Department attorneys. They were  just told to upload things that Donald Trump's FBI had already  scrubbed.\n\nIt is a blatant violation of the Epstein Files Transparency…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699892/decoding-epstein-files"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…recent one in Oklahoma, that were too small for regulators to use  emergency tools, and unlike Silicon Valley Bank's customers, small  business depositors lost money through no fault of their own.\n\nRepresentative Waters' bill would take the data-driven approach that  Chairman Hill prefers to study and then update our deposit insurance  framework to allow…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699862/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…mistakes that he, Elon, and the crew have made over the past  100 days. When the stock market is up, that is because of him. When the  stock market tanks, that is Joe Biden's fault. If it doesn't get  better, that is Joe Biden's fault, too.\n\nMr. Speaker, no parent would accept this behavior from their child,  so why do we accept it from the President?…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690634/trumps-first-100-days"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…prevention. We need reform. We need to separate out the DHS  budget from the others so we can get to work and not shut down the  government because the President won't admit fault in Minneapolis.\n\nAnd we need to fundamentally remember who we are as Americans. We  need to remember those values that literally we learned in the first  grade. We have fundamental…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…through Jim Crow. He saw the best of government  when Congress and the President, through the New Deal, responded to the  Great Depression, responded to people who, through no fault of their  own, were economically devastated.\n\nMy mother was born in the middle of the Depression, so she never knew  anything other than poverty. She also experienced the best…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…to help just  because Congress can't get its act together.\n\nI have pushed the Social Security Administration to stop clawing back  overpayments when the mistakes were not the fault of the seniors.\n\nI introduced legislation to make sure survivors of domestic violence  are not punished under Social Security rules for leaving unsafe  marriages.\n\nIf you have…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699255/2025-final-priority-results-survey"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "Ms. GARCIA of Texas. Mr. Speaker, I rise today for Dreamers, young  people brought to this country as children through no fault of their  own.\n\nDreamers grew up in our schools, played with our children, pledged  allegiance to our flag, and made our country, every single day,  strengthened in every way.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688333/providing-security-and-path-to-citizenship-for-dreamers"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…processes that we have enjoyed in  this country. He is unfit to be President. He is also unfit because he  disrespects the judiciary. When he loses a case, it is always the  judge's fault.\n\nWhat is amazing to me is that I have colleagues who are buying into  that, that it is the judge's fault. Let's impeach the judge because it  is the judge's fault. It is always…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…the United States dictate  the terms of their speech, their business, their defense of the rule of  law.\n\nI don't want to make the victim the perpetrator. This is all Trump's  fault, what he is doing to extort political loyalty from universities  and law firms. But instead of there being collective action on behalf  of these industries, the opposite is…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…outcry regarding that number?\n\nIt only seems to be an outcry when we are trying to, again, feed  children who are hungry or to help make sure that people, again,  through no fault of their own getting sick, get covered by Medicaid.\n\nThe budget would cut crucial programs for the poor and working  families. That is a fact. It is not being made up. It is…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691614/budget-cuts-will-harm-families"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…thousands of dollars more in many cases. Some  people won't be able to afford health insurance at all.\n\nWhat are we supposed to tell these folks? ``Oh, don't worry, it is  Obama's fault.'' Or, ``Oh, no, don't worry, we did a show vote on this  Lower Health Care Premiums for All Americans Act.'' Is that going to be  any consolation?\n\nNow, I have been extremely…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698374/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Administration policy makes it extremely  difficult for families to get a new Social Security number for a child,  even when families know the original number was compromised through no  fault of their own.\n\nPreviously, the Ways and Means Committee heard direct testimony from  a mother who had to battle with the Social Security Administration when  her 1-month-old…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697263/social-security-child-protection-act-of-2025"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…Handal, Cole Hodge, Brigid Kolish, Alexa Lorick, Ryan  Pettit, Todd Phillips, Kathryn Plunkett, Kim Segura, Tom Shaffer, and  Elise Stebick.\n\nIf I missed anyone, count it as my fault, not the staff who helped me  assemble that list and the following.\n\nI just wanted to also thank a number of the clerks of the  subcommittees with whom I worked: Evan Schatz,…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699444/appropriations"}, {"senator": "James Risch", "party": "Republican", "sentence": "…continue constant attacks. They have the duty to start this cease-fire.\n\nEvery starvation, every injury, every death, every  single thing that happens in this conflict is the fault of Hamas.\n\nOn October 7, when this invasion by Hamas started, Israel was doing  nothing to deserve this. Instead, Hamas invaded the country. They  killed 1,200 people. They…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695665/cloture-motion"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…information that was in the hands of their party's  President and their party's Department of Justice. It was in their  hands, and they didn't release it, but somehow it is our fault. Mr.  Speaker, it is the Republicans' fault that the Biden administration  didn't do what they now claim that the Trump administration should be  doing.\n\nIt is hard to understand…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…thousands of dollars.\n\nIn the case of a hit-and-run, the situation is even more difficult  because the victim cannot get the insurance information, if it exists,  from the driver at fault in order to have the damage paid for.\n\nFor the one in four American households who lives paycheck to  paycheck, an unexpected car accident might mean having to choose  between…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…a really exciting  discussion with my buddy of how CBO actually does scoring on things. I  was trying to explain that some of the things we consider absurd are  actually our fault because it is the law that we have passed to tell  CBO how to do the scoring.\n\nMr. Speaker, I want to make an apology to everyone because this one  will  go a little longer…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…to steal $1 billion from the  American taxpayer, money that could have gone to people who really were  homeless and children who really were hungry and kids who, through no  fault of their own, really were autistic, instead of stolen--a portion  of which allegedly was sent to a terrorist organization in Somalia.\n\nMan, these people ought to all be put…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…to point out, I know families of all  sorts of backgrounds. I know parents who have done a fantastic job of  raising children in all backgrounds, and sometimes beyond their fault,  there are families who appear to be doing a perfect job of raising  their children, but nevertheless have a problem.\n\nI think most Americans, though, with common sense would…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…build another on top and another on top. Eventually,  you get this giant dead mass. That is what we have done with a lot of  these agency regulations. Part of it is Congress' fault. Part of it is  the agency's fault.\n\nIf you look at this chart, Mr. Speaker, back in 1950, roughly the  time they started publishing the Federal Register, compiling all these…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690784/big-beautiful-bill"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…that Putin sees this conflict not just as a war  between Russia and Ukraine but as a war between Russia and the West.\n\nIn this same speech, he says the West is primarily at fault for the  conflict in the world today and that it was the West that incited a  Ukrainian coup in 2014 and further unrest in Eastern Ukraine in 2022,  which necessitated Russian…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…supposed to vote. That is why  there is a declaration of war. War originates also in Congress.\n\nBut we have lost so many of these things and so much of this. It is  Congress's fault for giving it. Over the last 70 years, there are  probably a dozen pieces of legislation where Congress said to the  President: Here, take this power. Create emergencies. Put…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…the right side  of this issue. We are on the side of freedom.\n\nIt is not conservative to appease Putin, nor is it conservative to  have a lack of moral clarity of who is at fault in this war. It is not  a conservative position to embrace isolationism.\n\nMr. Chairman, I stand with two-thirds of America, and I oppose this  amendment.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695259/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…levels into account. This program has been a  lifeline to hundreds of rural counties and school districts across the  country who have seen their budgets slashed through no fault of their  own.\n\nThe program expired in the fall of 2023, resulting in county payments  reverting to the rate under permanent law, which equates to a nearly 70  percent reduction.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697653/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…no ability to offer relief  to that taxpayer. Cases can be dismissed before the merits are even  heard, putting taxpayers at risk for losing their claim when they are  not at fault for missing the deadline. That is not a just result. This  bill ensures the court can make determinations based on the substance  of claims, not just procedural technicalities,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697270/tax-court-improvement-act"}]