[{"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…pattern of unlawful corruption for the personal profit of himself  and his associates, soliciting and accepting bribes in exchange for  official actions, policy influence, and favorable treatment from the  administration. In so doing, he has, beyond a reasonable doubt,  profiteered from public office on a scale unprecedented in American  history.\n\nDonald…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…the Secretary of  Defense, posted in the chat in all caps: ``TEAM UPDATE:'' Then, Mr.  Goldberg indicates that the text beneath this began: ``TIME NOW  (1144et): Weather is FAVORABLE. Just CONFIRMED''--with, it says w--``w/ CENTCOM we are a GO for mission launch.'' We are a go for mission  launch.\n\nLet's go on. These are excerpts. I shall not read it…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…their benefit, undermining our  national standing.\n\nTo do this, China is expanding its covert influence, seeking to turn  public opinion and effect policies that are more favorable to China and  against the United States. Additionally, the CCP seeks to exploit  American openness to steal economic secrets and undermine our national  security.\n\nThis bill…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688747/strategic-homeland-intelligence-and-enforcement-legislation-to-defend-against-the-ccp-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…President, I beg that you not do so. I beg that you would not do  so and that you would honor the third branch of government designed to  settle disputes among us, not always in a favorable way to some,  obviously, but that is what it is there for.\n\nI beg you, Mr. President, that you would not dishonor the judiciary  in this country.\n\nHere is what I know: I…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688663/incivility-in-chamber"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…deliberative  body in the world, the chance to stand up and say: Let's take a  different path.\n\nI thank my colleagues for their work together on this important  resolution and urge a favorable vote on the resolution that we will  have later today.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…is a report. This is not an allegation. This is a mainstream  media report. The oil companies said they would give him a billion  dollars for his campaign in exchange for favorable treatment when he  became President.\n\nNow, he has already given them a lot of favorable treatment, but,  boy, this would be a coup--the oil industry having full access to…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…his  billionaire supporters live in. Instead of paying their fair share like  most Americans, Republicans just wrote for President Trump and the  richest Americans a more favorable Tax Code, making sure that they get  to hold on to their wealth and watch it grow. And when the richest  Americans still don't succeed, they are given the leeway to bail…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698425/unanimous-consent-requests-the-calendar"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…join Republicans and Democrats  together in saying that any country that is willing to pay the  President personally, to enrich our President personally, in order to  receive favorable treatment from the United States of America in its  foreign policy or to receive national security secrets from the United  States of America shouldn't be able to do business…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…up  the majority of Donald Trump's net worth.\n\nForeign investors, some under Federal investigation, are pouring  millions into these ventures, buying access, influence, and favorable  treatment.\n\nSo I ask: What are we doing here?\n\nWith this bill, not only are we continuing to allow President Trump  to issue his cryptocurrency, but we are allowing him…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693771/digital-asset-market-clarity-act-of-2025"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…massively degraded.  Not since before the Islamic Revolution has there been such an  opportunity for America, Israel, and our Arab partners to reset  regional dynamics on such favorable terms.\n\nAchieving it has required no large-scale deployment of U.S. ground  forces. It required only supporting our friends. Israel is a close ally  and a strategic asset,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692870/9999"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…topic I wanted to take up. I have been talking to  some people who wonder why we have demonstrations in this country  hostile to Israel, and even more bizarre, demonstrations favorable to  Hamas and people who live in the Gaza Strip.\n\nIt has been my belief--and I give this conversation privately to  people, but I should make my case more public--that when…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…stuff that happened across the country post-2017  when you saw a significant economic boon in the U.S.\n\nYears prior to 2017, you saw a lot of companies decide there were  favorable tax rates elsewhere. Oftentimes, in countries in Europe-- there was a tax provision that was done in 2017 that is called FDII, an  intangible income piece.\n\nYou can establish…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Mr. Speaker, when these big multinational corporations have to decide  if they are going to set up shop in Germany or Korea or Brazil or India  or wherever, we want it to be favorable taxwise to set up shop in the  United States. Therefore, I do believe that, when the final tax rates  are laid out by the Committee on Ways and Means, I would like to see…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…the  back-and-forths over tariffs, trade deficits, prices, and markets.\n\nWe hear the talking heads say that America simply can't afford  President Trump's insistence on more favorable trade policies. We hear  much less about whether America can afford to continue down the road we  have traveled these past 30 years.\n\nThat is not a question that people in…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…the next generation of American patriots.\n\nThese subversive efforts are not limited to our universities. The CCP  has even reached into elementary classrooms, cultivating favorable  attitudes toward the Chinese Communist Party among young American  students.\n\nWith passage of the PROTECT Our Kids Act, schools that refuse to  confront this reality will…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697528/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…place of actual rules. These inconsistent conditions have stifled  domestic innovation, discouraged responsible market participation, and  driven capital and talent to more favorable jurisdictions abroad.\n\nH.R. 3633 addresses these issues directly by clarifying the legal  status of digital assets and establishing well-defined regulatory  responsibilities…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…intuitively that  strong alliances make America more secure--more secure.\n\nThe Reagan National Defense Survey, conducted late last year, found  that 68 percent of Americans hold a favorable view of the transatlantic  alliance--68 percent--and 76 percent support article 5 and a U.S.  military response in the event of an attack on a NATO ally. In just 6  months,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…De-Escalate Tax       Modernization Act. H.R. 2189 has received significant       bipartisan support and was marked up and approved by the       House Judiciary Committee with favorable guidance on November       18, 2025.\n\nH.R. 2189 addresses a serious and growing challenge:       outdated statutory language within the 1968 Gun Control Act       (GCA) that…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…degree after a quick and  affordable career technical education course.\n\nMy bill tasks the Secretary of Commerce with conducting an  interagency review to help create a more favorable environment for  foreign direct investment, ultimately boosting our economy and  benefiting American workers.\n\nInternational companies are beginning to recognize what most…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692695/global-investment-in-american-jobs-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…monetarists, you saw in the previous few years of inflation that  their model didn't work. Also, in addition to that, we are going to pay  the interest. In 9 years, baseline under a favorable interest rate  model, 30 percent of all U.S. tax receipts go to interest and, Heaven  forbid, if interest rates were to come up 1 percent because we have  to--this coming…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Arkansas Governor       Frank White (R-AR), an avid hiker and canoeist, issued a       Proclamation in favor of the ACC Plan and urged action by       Congress.\n\nGovernor White's favorable view of wilderness was echoed by       another strong conservative voice in the country. Then       Newsweek columnist, George F. Will, in an August 16, 1982,       column…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}]