[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…social media  and other means around the globe, certainly around our country.\n\nAnd these baseless and harmful conspiracy theories are, by now, in a  book by the current FBI Director, Kash Patel, who claims that the  January 6 attack was ``the insurrection that never was'' and was  encouraged by ``deep state'' agitators as a pretext to persecute Trump…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698494/9999"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…prosecute his personal  vendettas, punish his enemies, and award his friends.\n\nHe has installed to do his bidding banana republic cronies like  Attorney General Pam Bondi and FBI Director Kash Patel, who are more  than willing to carry out Trump's abuse of the justice system. Under  their reign, dozens of prosecutors were targeted, identified, and fired…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…Building.\n\nThe amendment that I have simply says: Let's not spend any money on  moving the FBI to this building, which the Murrah Building makes very  clear, and is why the FBI Director came to me in 2009 to have this  facility, the FBI building, moved to a place where you can have  security.\n\nWe have some number of security organizations. They are all…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699075/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…bipartisan vote by the  Judiciary Committee, Erik Siebert was forced out of office, and he was  forced out of office because he refused to prosecute, to indict, former  FBI Director Jim Comey and New York attorney general Letitia James. He  said there was no evidence to support an indictment in the case, and so  this individual who had been put in office…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696334/trump-administration"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…top. It is about  doing Donald Trump's bidding. Shame on them.\n\nEarlier this week, I offered a simple amendment to release the  Epstein files that Donald Trump, his AG, his FBI director, and his  supporters tell us contain a list of clients of Jeffrey Epstein. Let  the American people make up their own mind. But Republicans voted it  down, every single…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693718/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…hope of using       these agencies as a shield against investigations into his       campaign's Russia ties. During his first week in office,       President Trump summoned FBI Director James Comey to a one-      on-one dinner in the White House in which, according to       Comey, the president asked for a pledge of loyalty. He later       reportedly pressured…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…initiated gun buyback programs after their last tragedy, they are now  working to further tighten gun regulations.\n\nThe other one of these countries acted like a child. Our FBI Director  and President shared misinformation. The Vice President suggested that  the politics of one of the victims was the real tragedy. The Republican  Party remained committed…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698407/gun-violence-tragedies"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…Epstein, a  sex offender and financier with whom the President often socialized.\n\nFor years, the President and those in his orbit, including Attorney  General Pam Bondi and FBI Director Kash Patel, alleged that prior  administrations had covered up the identities of the rich and powerful  people to whom Epstein had trafficked the girls and the facts  surrounding…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…Trump really wants these files released, they would be out  already. Instead, he is orchestrating a coverup, and he is not acting  alone. The entire Republican Party, the FBI Director, the intelligence  community, and the Justice Department are backing him up to bury the  truth. They are doing everything they can to keep the truth buried  because they…", "date": "2025-07-24", "source_url": "https://justfacts.votesmart.org/public-statement/1694235/9999"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…contradictions.\n\nLet's review the record. In June of 2024, Trump said he would  declassify the Epstein files. His campaign even celebrated that promise  online. On January 30, Trump's FBI Director, Kash Patel, vowed to  release everything. On February 21, Attorney General Pam Bondi said the  client list was literally on her desk. As of today, none of that has  materialized.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695278/jeffrey-epsteins-abuse"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…colleagues have sent  letters, they have posted, and they have demanded disclosure. Donald  Trump, Jr., the President's own son, has tweeted dozens of times about  this case.\n\nFBI Director Kash Patel swore under oath in front of the Senate that  he would be transparent with the American public and release the  Epstein files. He said: ``Make sure the American…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693624/release-the-epstein-files"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…Prime Minister of Norway Thorbjorn Jagland has been charged.\n\nYet, we don't see any charges, arrests, or investigations in the  United States. What do we see? We see our FBI Director celebrating in  the locker room at the Olympics overseas.\n\nIt is fine to be proud of this country, but we should be proud of  this country because we have a system of justice…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700177/justice-for-epstein-victims"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Protection the authority to fingerprint noncitizens under  the age of 14 to combat the horrific practice called child recycling.\n\nJust this week, I also sent a letter to FBI Director Kash Patel and  Attorney General Pam Bondi requesting that they release the complete,  unredacted flight logs from Jeffery Epstein's private jet.\n\nIn addition, I also requested…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…a scandal the Times would  like to create. The Justice Department and the FBI have an obligation  to respond to congressional inquiries.\n\nTo Attorney General Bondi's and FBI Director Patel's credit, they  have done better in that regard than any of their predecessors of  Republican Presidents and Democrat Presidents. Now, am I fully  satisfied? Of course…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…FBI operation that has taken place in Memphis,  and this marks the next phase of what is a multipronged, multi-Agency  strategy to fight this crime.\n\nThis summer, the FBI, under Director Patel, conducted Operation Viper  in Memphis, and the FBI worked with the Memphis Police Department and  Chief Davis. And what they did was to surge Federal resources…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695666/cloture-motion"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…investigation that has been launched by the  Department of Transportation to claw back billions of dollars that have  been granted.\n\nI have also asked for an investigation by FBI Director Kash Patel to  figure out how it is exactly that they have already spent $17 billion,  that the overall cost has grown to in excess of $130 billion, yet no  track has been…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…foreign nationals voting in our elections threaten the bedrock of our  democratic Republic. All of us should be thankful to the Department of  Justice, Attorney General Bondi, FBI Director Patel, and DOGE that they  identified and eliminated this violation of the sanctity of our  elections process.\n\nThe Department of Labor and the Department of Agriculture…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…attack on the Jewish community in the  last 2 months. This sort of hate is completely unacceptable in our  society, and, of course, we all know it needs to stop.\n\nI commend FBI Director Patel for quickly responding and launching a  full investigation into this targeted attack. I trust that the FBI and  law enforcement will do their job and swiftly find…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691714/boulder-colorado-attack"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…against unreliable accusations. Is he calling all of these  victims unreliable?\n\nThey have testified to the FBI. The FBI has these names in their  possession.\n\nI asked the FBI Director in a hearing: Have you looked at the  documents?\n\nNo. He trusts everybody who has been there for decades.\n\nThat is wrong. Do not let the Senate muck this bill up. If Senators…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696903/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…California High-Speed Rail. I was  with Secretary Duffy when he announced an investigation into where the  recent Federal funding has actually gone and I have called upon the FBI  Director Kash Patel to launch an investigation into what happened to  the $17 billion that has already been spent.\n\nAt this point, the cost of the project is estimated to be about…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…funding  will come. It is not going to come. There is currently an investigation  by the Department of Transportation as well, and I have asked for an  investigation by FBI Director Kash Patel to look into exactly where all  of this money went.\n\nIt is time to end this irresponsible failure of a project--the  biggest public infrastructure failure in…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691353/governor-newsom-backs-down"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…the entire  process of the court system.\n\nI have some background in this. My father served as a chief judge of  the Western District of Texas in San Antonio. He served as FBI Director  for President Reagan, President Bush, and President Clinton. He  understood firsthand that control of crime has a lot to do with how you  deal with criminals, Mr. Speaker.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695616/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…question is yes.\n\nWe have already seen some illegal immigrants attempt that shift when  faced with stricter security measures at the southern border. And last  week, the FBI Director warned the House Intelligence Committee that our  enemies will adapt to security measures at the southern border by  shifting resources to the northern border.\n\nIf we are…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689477/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…whatsoever is a very unfortunate  thing.                          California's High-Speed Rail\n\nMr. KILEY of California. Mr. Speaker, yesterday, I formally requested  that FBI Director Kash Patel open an investigation into California's  High-Speed Rail.\n\nMy letter to Director Patel reads as follows: ``While I know that  many issues are competing for your…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}]