[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…ethical responsibilities; and fires its employees without       notice or cause in violation of civil service laws.\n\nIt also cannot keep our country safe when it ousts FBI       employees, prosecutors, national security experts, and ATF       officials; shutters offices that prevent community violence       and dismantle drug trafficking operations;…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…colleagues have sent  letters, they have posted, and they have demanded disclosure. Donald  Trump, Jr., the President's own son, has tweeted dozens of times about  this case.\n\nFBI Director Kash Patel swore under oath in front of the Senate that  he would be transparent with the American public and release the  Epstein files. He said: ``Make sure the American…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693624/release-the-epstein-files"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…revenue that is due and owing. That means funding the IRS,  which has been understaffed and underresourced far too long.\n\nNow, I am concerned not only by the IRS but also the FBI. For two  decades, I have worked to help the FBI move out of the crumbling,  unhealthy J. Edgar Hoover Building and into a new consolidated  headquarters that meets its security…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699056/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…public media also plays an important role in supporting  national security and law enforcement efforts. In the Thumb region,  Delta College Public Media hosts transmitters for the FBI and the Coast  Guard to ensure that they can effectively communicate during emergency  situations. Eliminating funding for that partnership, as this bill  would do, is quite…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…Donald Trump really wants these files released, they would be out  already. Instead, he is orchestrating a coverup, and he is not acting  alone. The entire Republican Party, the FBI Director, the intelligence  community, and the Justice Department are backing him up to bury the  truth. They are doing everything they can to keep the truth buried  because…", "date": "2025-07-24", "source_url": "https://justfacts.votesmart.org/public-statement/1694235/9999"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…School Resource  Officer, detective, sergeant and lieutenant. New also earned a master's  degree in public administration from Metro State University and  graduated from the FBI National Academy.\n\nIn 2016, New became a Deputy Chief before being named Eagan Chief of  Police in 2018. As Chief, New prioritized building strong community  partnerships, implemented…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696271/congratulating-chief-roger-new-on-his-retirement"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…other hand, my good friend, I believe, participated in--and if  he didn't, I am happy to stand corrected, but I know a bunch of his  colleagues said they wanted to defund the FBI, just like those who want  to defund the ATF and shut it down right now, so that is a reality.\n\nIn any event, why don't we talk about what Congress can actually do?  The President's…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…that bipartisan vote by the  Judiciary Committee, Erik Siebert was forced out of office, and he was  forced out of office because he refused to prosecute, to indict, former  FBI Director Jim Comey and New York attorney general Letitia James. He  said there was no evidence to support an indictment in the case, and so  this individual who had been put…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696334/trump-administration"}, {"senator": "André Carson", "party": "Democrat", "sentence": "Mr. CARSON. Mr. Speaker, I am proud to reintroduce the Justice for  Shireen Act today. I thank my House Colleagues who joined me in calling  for a report to Congress from the FBI and State Department, in  consultation with the Attorney General, Secretary of Defense and  Director of National Intelligence, on the death of American-Palestinian  Journalist,…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699427/reintroduction-of-the-justice-for-shireen-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…needed to respond effectively. Our  bill would require the Attorney General to submit an annual report to  Congress on gang activity investigations and prosecutions.\n\nWhile recent FBI data show violent crime trending downward, we know  progress does not mean the work is all done. This legislation  strengthens public safety, supports law enforcement, and helps…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698650/reporting-gang-activity"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…acquitted. That doesn't mean  these prosecutors did anything wrong. It certainly doesn't mean that  they should be forced out of their positions.\n\nIt is the same thing with the FBI agents. They sent over a list of  5,000 FBI agents to the Department of Justice. Guess what the common  denominator was? They had all worked on January 6 investigations.  Instead…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…inspectors general to start  the term. They issued a mass pardon of those convicted of assaulting  our government, including police officers, on January 6. They went  after the FBI and tried to fire anybody who was seen as insufficiently  loyal to Donald Trump at the FBI. They did the same thing at the  Department of Justice. They looked to illegally usurp…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…to give us the opportunity to weigh in or at  least explain to us and my constituents why my community is being  deprived of this resolution that honors law enforcement, the FBI and  the Boulder Police Department, which acted so swiftly in response to  this terrorist attack.\n\nMr. Speaker, I know Mr. Griffith, in particular, to be somebody who  shares,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692346/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…doesn't  back up the lies repeated by DHS immediately after the killing.\n\nState law enforcement in Minnesota have been blocked from the vehicle  where Renee was killed because the FBI sealed it off, blocking  transparency and accountability.\n\nRenee Good's murder is not an isolated incident. In my community, we  know this pattern all too well. In September,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699041/authority-without-accountability"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…It takes a remarkable combination of arrogance and stupidity to think  that this is the best use of time for our intelligence officers, VA  workers, air  traffic controllers, FBI agents, and everyone else upon whom our Nation  depends to do their jobs well.\n\nIf this is what bringing business acumen to government function looks  like, then it is pretty…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687998/department-of-government-inefficiency"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Defined.--In section, the term ``senior       citizen'' means an individual over the age of 65.\n\nMr. Speaker, I rise in support of H.R. 1469, the Senior Security Act.\n\nAccording to the FBI, over 100,000 seniors fell victim to fraud and  exploitation just last year. Their total losses were over $3 billion.  Just last year, a senior citizen from my home State fell…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693935/national-senior-investor-initiative-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…cities, loot  shopkeepers, and assault people on the streets while leftist  politicians egged them on.\n\nWe see the growing physical attacks on law enforcement. The left used  the FBI to suppress debate on critical issues ranging from COVID  lockdowns to Biden family influence peddling to climate hysteria. It  has called for government commissions to regulate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695787/beating-heart-of-democracy-is-freedom-of-speech"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…Cuba, Iran, Russia, and even Islamic  terrorists like Hezbollah.\n\nI want to take this opportunity to commend the exceptional skill and  bravery of our troops, CIA officers, and FBI agents for executing such  an amazing military and intelligence operation that brought Maduro's  reign to an abrupt end. It is impossible to overstate the complexity of  this…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…updating these deficient agreements.  The IG community has much work to do, and this Senator won't stop  protecting whistleblowers.\n\nWhistleblower disclosures proved that anti-Trump FBI agent Tim  Thibault was involved in the genesis of Jack Smith's election  interference case against President Trump. The FBI codenamed it Arctic  Frost. Internal FBI records…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688777/sunshine-week"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…procuring a child for  prostitution and of soliciting a prostitute in a plea deal in 2008, and  served a 13 month sentence;\n\nWhereas in the course of that investigation, the FBI compiled reports  on dozens of confirmed minors who credibly alleged sexual abuse by  Epstein;\n\nWhereas Epstein was under further Federal investigation beginning in  November…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696890/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…first, and their families first.\n\nMy friends, we are still feeling the consequences of this failed  border policy in North Carolina. Just last week, this picture to my  right, the FBI in Charlotte--and I want to give a shout-out to the FBI  agents based out of Charlotte. They arrested an illegal immigrant who  had already been deported.\n\nThat is a picture…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…going to cut it  all with nondefense discretionary. Nondefense discretionary is 12  percent of our spending. Almost everything you think of as government-- the Park Service, the FBI, the White House, our salaries here--that is  in this 12 percent.\n\nInterest on the debt is every bit as big as all the nondefense  discretionary. Actually, real interest on…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…started and got an idea. Now, again, this has all been proven. They  decided to infiltrate the crowd with antifa and intelligence community  members who would stir up trouble. The FBI has confirmed that there  were 274 FBI agents in plain clothes in the Capitol here that day.\n\nThen they set up Capitol Police by failing and refusing President  Trump's offer…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698541/9999"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…with the same mission as before, and that is to subvert  national security and expand CCP influence operations.\n\nAnother example is the CCP's Thousand Talents Program, which the FBI  has listed as the most prolific sponsor of State-sponsored talent  recruitment programs that bring outside knowledge and innovation back  to China, often through stealing trade…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690828/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…investigation that has been launched by the  Department of Transportation to claw back billions of dollars that have  been granted.\n\nI have also asked for an investigation by FBI Director Kash Patel to  figure out how it is exactly that they have already spent $17 billion,  that the overall cost has grown to in excess of $130 billion, yet no  track has…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…people about the program's vetting vulnerabilities.\n\nI asked then-Director Wray about the program's national security, and  I asked the same, this year, of Director Patel of the FBI.\n\nThis year, Director of National Intelligence Gabbard told my office  an important data point: Of the more than 100,000 Afghan evacuees, as  of August 2022, 1.6 percent had…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697333/national-security"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…supports law enforcement. Let's look at  the facts. Republican President Donald Trump's proposed budget will  slash funding for the ATF and Drug Enforcement Administration, fire FBI  employees, wipe out community policing grants, and gut civil rights  enforcement.\n\nTrump's budget doesn't support local law enforcement. It hurts them.\n\nIn my rural district,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…in times of need, embodying sacrifice for the  greater good. Some law enforcement and first responders make the  ultimate sacrifice in serving their communities.\n\nIn 2024, the FBI reported that 64 law enforcement personnel were  murdered while on duty. That same year, another 56 law enforcement  officers died because of traffic-related incidents.\n\nThe…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699505/medal-of-sacrifice-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…should be able to.\n\nWithout question, there are far better ways to handle this. The  legislative branch should correctly address the Biden administration's  weaponization of the FBI to spy on United States Senators in its  operation, Arctic Frost. The abuses, Mr. Speaker, by the Biden  administration are completely unacceptable, and I am committed to  holding…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696929/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…going on in Reedley:  commercial-grade freezers and refrigerators, equipment for processing  biological materials, and thousands of vials which are now under  examination by the FBI.\n\nIn Reedley, the pathogens that were discovered included E. coli,  Ebola, malaria, HIV, and tuberculosis. We have every reason to believe  that these same dangerous pathogens…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699738/national-oversight-for-biological-labs"}]