[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…They  would sacrifice the jobs and the clean energy industry all over the  country. To their own constituents, they would put those people out of  work. And why? Because of fealty to the oil industry.\n\nThis is not about energy independence. It is about oil dependence.\n\nToday, we are in a full transition to a clean transportation future-- or we could…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691621/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…now let me see you enforce it.  That is my Justice Department--not Al Green's, the President's--that is  my Justice Department. The head of my Justice Department has pledged  fealty to me--not Al Green, the President--that is my Justice  Department. Let me see you get my Justice Department to enforce your  order, Mr. Judge.\n\nMore specifically, Mr. John…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688663/incivility-in-chamber"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…second term, Whitney  Hermandorfer, to be a circuit judge on the Sixth Circuit.\n\nWe all know when it comes to judges Donald Trump cares only about one  thing: total unyielding fealty to Donald Trump--not experience, not  judicial independence, not knowledge or desire to pursue the law, but  brazen, uncomplicated fealty to Donald Trump. That is how he chooses…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693417/nomination-of-whitney-d-hermandorfer"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…king.\n\nWe are wasting time today, an entire legislative day where this is  the only bill that is being debated, so that our Republican colleagues  can get up and show their fealty to Donald Trump instead of the voters  who elected us who expect us to be focused on them.\n\nAnother reason that Republicans are wasting time on this bill--which,  by the way,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690931/gulf-of-america-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…President Trump--in fact, more than loyalty to President Trump--it  needs someone with the objective qualifications and experience. His  main qualification is, in fact, his fealty to Donald Trump.\n\nThat is not the qualification that should count here. What we need is  someone who will do the job with the excellence and integrity that  veterans have a…", "date": "2025-07-24", "source_url": "https://justfacts.votesmart.org/public-statement/1694219/9999"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…falls  short in some crucial areas. Above all, it falls short in its lack of  meaningful policy to rein in the Trump administration's reckless and  illegal actions.\n\nOut of fealty to their dear leader, Republicans have refused at every  turn to perform meaningful oversight of this administration, to push  back on Trump's worst impulses, and to exert…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…represented by Congresswoman Elise  Stefanik--welcome back to Congress. I am sorry it did not work out for  you. That is a lesson that should be learned by all those who pledge  fealty to the wannabe king, but I digress.\n\nIn New York's 2lst Congressional District, currently represented by  Congresswoman Elise Stefanik, approximately 44,000 New Yorkers will…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…to cut more  than half a billion dollars from the FBI to be fighting criminals and  terrorists? For the life of me, I don't understand how they can do that  while they swear fealty to law enforcement. It just makes no sense.\n\nThey want to cut $491 million from the Cybersecurity and  Infrastructure Security Agency, making our cyber and physical  infrastructure…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…as well--Members of the  Cabinet, persons meeting with the President in the Oval Office. I never  thought I would see persons holding such high and lofty positions  pledging fealty not to the Presidency as much as to sycophancy--fealty.  It was just unbelievable. The only time I saw anything similar to this  was when I was in Communist China and I was…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Abrego Garcia. Thus far, nearly a  month later, that has not occurred.\n\nThis is about fighting lawlessness. The 14th Amendment to the  Constitution, to which we all pledge fealty, is pretty straightforward:\n\nNo person shall be deprived of life, liberty or property       without due process of law.\n\nThat was the clause that the U.S. Supreme Court unanimously…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691406/motion-to-discharge-s-res-195"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…many of  the Republican nominees for judges and so many of our Republican  Senators. For Donald Trump, the only thing that matters, when it comes  to judges, is unyielding fealty to himself.\n\nWe have never seen--never--such a disastrous mandate for our Federal  courts in all of American history, and if the Republicans proceed, the  damage to our Judiciary…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693921/nomination-of-emil-j-bove-iii"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…actions of this House Republican majority have brought  disgrace to the House of Representatives from day one of this  Presidency.\n\nThe reality is, if you want to talk about fealty to the Constitution  and things of that nature, the House is a separate and coequal branch  of government. You don't seem to understand that.\n\nYou have functioned from the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696891/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…don't  need and won't even notice, there is no moral code under which that is  acceptable. There is no public demand for it. There is no logical  reason for it other than total fealty to billionaire donors,  billionaires who will never feel they have enough.\n\nI will close with a family that has been on my mind, a mom-to-be who  is 5 months pregnant. She…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688082/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…President Trump or in fear of him. But the record  here speaks powerfully--or it should--to our conscience and conviction.\n\nThis nominee epitomizes the Trump demand for loyalty and fealty above  all else to him, a sense that he has the power to do what no ordinary  American can expect from judges or from prosecutors; that they will, in  effect, rig the system…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "Ms. BALINT. Mr. Speaker, I ask my colleagues: What kind of man asks  for absolute fealty and bootlicking from the people around him?\n\nWhat kind of man asks people to lie for him?\n\nWhat kind of man is so petty that he can't admit obvious mistakes and  lies?\n\nWhat…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688349/collective-protection-of-our-ideals"}]