[{"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…day, I think about my mortality. How long do I have  left? Is that shoulder pain or something else? Will I be alive to see  my son graduate from high school? He turned 11 [in February], and I  made him a lemon cake.\n\n``NIH funding cuts will no doubt shorten my life. There is no truth  about which I have ever been more certain.''\n\nMr. Speaker, our constituents…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692074/condemning-anti-semitism"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…however, that while this legislation will assist  Taiwan, some Republicans are ignoring what the administration is doing  that will hurt our economy and that of Taiwan.\n\nIn February 2025, in one of his first actions as President, President  Trump issued an executive order seeking to withdraw the United States  from several international organizations…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692795/taiwan-non-discrimination-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…theoretical issue. These are the       very real questions that our residents and community members       are asking themselves as TPS for Haiti is set to expire on       February 3rd. For our children, what is next for them if this       protection is stripped away? Separating families in this way       undermines everything we claim to value about…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…declaration has been made have full  access to assistance, including targeted outreach and marketing  materials. SBA would have 1 year to close out the recommendation.\n\nOn February 22, 2024, GAO issued a report examining how SBA's  disaster loan program assists communities after disasters. GAO found  that rural areas have characteristics that make recovery…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687927/rural-small-business-resilience-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…electricity prices.''\n\nMr. Speaker, I include in the Record this letter from Consumer  Reports and Consumer Federation of America.                                                  February 23, 2026.      Hon. Mike Johnson,      Speaker, House of Representatives,      Washington, DC.      Hon. Hakeem Jeffries,      Democratic Leader, House of Representatives,…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700164/dont-mess-with-my-home-appliances-act"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…Act, the National  Domestic Violence Hotline was created to ensure that anyone  experiencing relationship abuse would have a safe, confidential place  to turn for help. On February 21, 1996, the National Domestic Violence  Hotline answered its very first call--marking the beginning of a  national commitment to listening to survivors, offering support…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700099/recognizing-the-30th-anniversary-of-the-national-domestic-violence-hotline"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…are on the rise. Between  2019 and 2023, there were more than 400 fires, 300 injuries, and 12  deaths from fires caused by lithium-ion batteries in New York City  alone. In February, a fire caused by lithium-ion batteries at a  recycling facility in my home State of New Jersey required the  evacuation of over 100 residents from their homes and caused…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…supplies. This is not a well-thought-out plan, but       something executed with malice by an organization supposedly       focused on eliminating waste, fraud and abuse.\n\nOn February 14, 2025, scientists and medical researchers       began to be dismissed by President Trump's administration.       They were told it was due to probationary status and poor…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…for several of ACF's executive  leadership positions, including the acting ACF Commissioner from  January to November 2021, and the acting Assistant Secretary for ACF  from February to May 2017.\n\nThrough her work overseeing a budget of more than $70 billion for  ACF, Ms. Barlow has played a key role supporting the programs and  services that provide critical…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692562/recognizing-amanda-barlow-on-her-retirement"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…History Month  Dinah Whipple was a monumental figure for educational equality in the  State of New Hampshire.\n\nDinah was enslaved until her emancipation at the age of 21. On  February 12, 1781, Dinah married Prince Whipple, who for many years was  enslaved by William Whipple, one of the signers of the Declaration of  Independence.\n\nDinah Whipple conducted…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688247/recognizing-dinah-whipple"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…good sense to hike bank fees on 23 million  hardworking families.\n\nDemocrats on the Financial Services Committee voted unanimously to  oppose this resolution at a markup in February, and I urge all of my  colleagues to unanimously reject it on the floor today.\n\nMs. WATERS. Mr. Speaker and Members, I think Mr. Hill said many banks  do not charge overdraft…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689845/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…should it find them harmful to U.S.  investors.\n\nOne additional but important note is this bill comes to the floor as  we await the 6-month review mandated by Donald Trump's February 4  executive order directing the Secretary of State to determine in which  international organizations the U.S. should continue or from which it  should withdraw. Inexplicably,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693972/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…unconstitutional it is. More than 200  Democrats filed an amicus brief against this executive order when it  was challenged in court. This attempt has been successfully halted.\n\nIn February, over a dozen religious organizations filed a lawsuit.  These organizations sued the Department of Homeland Security after the  administration rescinded guidance that would…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690851/opposing-illegal-power-grabs"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…that are central to the country and truly define  our communities. One such story is the revitalization of Native  languages, including the Hawaiian language.\n\nSince 2023, February has been recognized by the State of Hawaii as  Mahina Olelo Hawaii, or Hawaiian Language Month. Following the  colonization of the Hawaiian Islands by English-speaking westerners,…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700306/hawaiian-language-month"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…United States of America in Congress assembled, That,       pursuant to section 202 of the National Emergencies Act (50       U.S.C. 1622), the national emergency declared on February 1,       2025, by the President in Executive Order 14193 (90 Fed. Reg.       9113) is terminated.", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696439/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Madam Speaker, I rise today to  recognize Career and Technical Education Month, celebrated every  February. This month allows us to highlight the value of CTE programs,  which help prepare students for the workforce. These are programs that  are about learning to earn.\n\nDuring…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700190/recognizing-career-and-technical-education-month"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…recognize and  celebrate National FFA Week, an annual tradition that highlights the  contributions of one of our Nation's most impactful youth  organizations.\n\nLast week, from February 15 to 22, we honored the FFA's mission,  achievements, and ongoing work in preparing future generations of  agricultural leaders.\n\nFounded in 1928, the National FFA Organization…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687891/national-future-farmers-of-america-week"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…inadmissible. It also makes an alien convicted of doing so removable.  In fact, 59 Democrats voted in favor of this legislation when I brought  it to the House floor last February.\n\nIf you are a guest in our country and you drive drunk, you should be  removed from this country, period.\n\nDrunk drivers are involved in 31 percent of all crash deaths in…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693084/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "James Lankford", "party": "Republican", "sentence": "Mr. LANKFORD. Mr. President, it is the end of February, but it sure  feels like the beginning because it feels like Groundhog Day. We are in  yet another partial government shutdown. We are in it right now.\n\nWhat is interesting…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700299/government-funding"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Congress--on a piece of legislation that I am part  of--and how President Trump can help the economy through helping small  business.\n\nPresident Biden issued an Executive order in February of 2022. That  Executive order required what is called the project labor agreements,  or PLAs, on Federal projects over $35 million. Just to be clear, I  meant that Executive…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693111/project-labor-agreements"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…as `Adams Memorial: Eligible Additional Area' on the map       titled `Adams Memorial: Eligible Additional Area' prepared by       the Adams Memorial Commission and dated February 25, 2025.\n\n``(b) Additional Locations.--If the Commission determines       that the location described in subsection (a) is not suitable       or feasible due to physical…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697633/adams-memorial-great-american-heroes-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…violate the Budapest Memorandum in  2014 when it invaded Crimea and annexed the Crimea Peninsula. Then, as  we all know, Russia violated the Memorandum for a second time in  February 2022 with its invasion of Ukraine proper.\n\nIf Russia were unwilling to honor the commitments enshrined in the  Budapest Memorandum in 2014 and 2022, how, then, can Ukraine…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…rise today to recognize and remember the  life and service of a dedicated American veteran, Mr. Orval Mullens of  Oakwood, Ohio. Orval, who celebrated his 103rd birthday in February,  passed away on May 15, 2025. Orval led a long, productive life, and I  am honored to have the opportunity to recognize his many  accomplishments in life, especially his…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692278/special-recognition-of-the-life-and-service-of-orval-mullen"}, {"senator": "French Hill", "party": "Republican", "sentence": "…EFFECTS ON DIRECT SPENDING AND REVENUES OF LEGISLATION CONSIDERED UNDER SUSPENSION OF THE RULES IN THE HOUSE OF                                     REPRESENTATIVES WEEK OF FEBRUARY 9, 2026 ----------------------------------------------------------------------------------------------------------------…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699822/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…graduation, Kathy moved to the  Washington, D.C. area and began her career in politics, working for  various organizations in event coordination and digital analysis.\n\nIn February of 2022, Kathy joined my staff as Scheduler and quickly  became my Director of Operations the following year. During her time in  my office, Kathy worked diligently behind…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697542/recognizing-and-expressing-gratitude-to-former-director-of-operations-kathy-zhu"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…Consolidated Appropriations Act, 2026. Specifically, the  Senate amendments to H.R. 7148 strike the Homeland Security  Appropriations division, replacing it with a CR through February 13,  2026, and make other conforming changes to the text of the bill.\n\nMr. Speaker, by concurring in the Senate amendments to H.R. 7148, the  Consolidated Appropriations Act,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…directly from health insurance issuers in       accordance with agreements with those issuers and any       applicable state requirements.\n\nIndictments from December 2024 and February 2025 highlight       concerns about agent and broker practices in the federal       Marketplace. Specifically, the indictments allege that bad       actors enrolled consumers…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "Mr. FINSTAD. Mr. Speaker, I rise today to recognize the 2025 Class 1A  Minnesota State Girls Hockey Champions: the Dodge County Wildcats.\n\nOn February 22nd, the team won their first-ever state title at the  Xcel Energy Center in a suspenseful overtime game against Warroad. The  Wildcats claimed the win with a 4-3 final score.…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690120/recognizing-the-2025-class-1a-minnesota-state-girls-hockey-champions-the-dodge-county-wildcats"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…Oversight and Government  Reform or their respective designees.\n\nMr. Speaker, starting with S. 331, the HALT Fentanyl Act, important  legislation that the House considered back in February when 98  Democrats supported it, this bill would permanently classify all  fentanyl-related substances as illegal and give our law enforcement  officers more tools to combat…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…the station. On May 12, 1983,  he became an official member of the Oxford Volunteer Fire Department.\n\nHe later became a full-time member of the Anniston Fire Department on  February 13, 1987, rising through the ranks to eventually become  Assistant Fire Chief in 2003.\n\nAfter 20 years of service with the Anniston Fire Department, he  retired on February…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697974/recognizing-the-retirement-of-chief-gary-sparks-as-fire-chief-for-the-city-of-oxford-alabama"}]