[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…United, many newly empowered       groups purchased their own ads to influence elections. Some       of these purchases were reported to the Federal Election       Commission (FEC), which makes such information publicly       available. However, since at least 2020, dark money groups       have largely shifted toward making large transfers to allied…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Are you telling  me that Republicans are open to strengthening gun licensing laws in the  United States and no longer accept attestation?\n\nEach of us must submit records to the FEC, attesting under penalty of  perjury that our campaign committee reports are accurate. Do  Republicans now want to provide the American people greater  transparency around political…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…WinRed, McCain-Palin, Rick Lazio.\n\nI just want to be clear: If this is the standard that we are going to  make, just know we are going to expose it all, and just know that the  FEC filings are available for everybody to review.\n\nThis is absolutely ridiculous. You decide that you want to punish a  sitting Member of Congress because you are concerned about…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696889/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…long championed, like the DISCLOSE Act, that will shine a light on  the dark money donors that seek to purchase the outcomes of our  elections. It will fundamentally reform the FEC, so our Federal  campaign finance laws no longer go unenforced.\n\nIndeed, at present, the FEC has no quorum and cannot function in a  law enforcement capacity at all. House Democrats…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699248/citizens-united-16th-anniversary"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…scheme that the Governor came up with targeted me  specifically. One of his cronies, a woman named Ann Ravel, filed a  completely made-up, frivolous complaint against me with the FEC. It  alleged that I had transferred $50,000 to the campaign account  supporting this initiative. It was completely untrue. I never did  anything of the sort. I didn't transfer…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}]