[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Restoration  Act in the same manner as states. D.C. residents pay the same federal  taxes as residents of the states and, therefore, D.C. should be treated  as a state under federal programs. D.C. has roughly 7,800 acres of  parkland, covering nearly a quarter of the city.\n\nThe Pittman-Robertson Wildlife Restoration Act provides funding to  states for five…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700089/introduction-of-the-pittman-robertson-wildlife-restoration-act-and-dingell-johnson-sport-fish-restoration-act-district-of-columbia-equality-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…just pushed a scheme, really, straight out of Project 2025 to choke off  virtually all Federal funding, including halting over $8.6 billion in  grant funding for the Federal programs to combat the opioid crisis. At  the time, congressional Republicans just stood by silently as it  happened.\n\nTrump halted over $6.5 billion in funding for the Substance…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…who created the Program, made only the 50 states  eligible for funding, likely depriving D.C. of hundreds of millions of  dollars. D.C. is treated as a state for most federal programs because  D.C. residents pay the same federal taxes as residents of states, and  there is no reason D.C. should not be eligible for the Program's funds.\n\nI urge my colleagues…", "date": "2025-08-19", "source_url": "https://justfacts.votesmart.org/public-statement/1694752/introduction-of-the-equal-treatment-of-the-district-of-columbia-under-the-rural-health-transformation-program-act-of-2025"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…have access to education.\n\nBefore the Department of Education, millions of children all across  this country were denied access to schools and educational  opportunities. Federal programs were duplicative and wasteful, and  States regularly violated the basic civil rights of students.\n\nIf our colleagues want to stand with students, want to stand with  schools,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697300/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…helm, GAO has saved the  American taxpayer more than $1.2 trillion. The Committee on Homeland  Security and I have relied on Mr. Dodaro's deep experience and  knowledge of Federal programs and operations to shape the Department of  Homeland Security and protect civil rights and civil liberties in the  post-9/11 era.\n\nThe teams at GAO led by Mr. Dodaro have…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698469/recognizing-the-service-of-us-comptroller-general-gene-l-dodaro"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the CZMA, the term  ``coastal state'' includes the states and territories. D.C. residents  pay full federal taxes and therefore D.C. is usually treated as a state  for federal programs. It appears D.C.'s omission was a mistake. This  oversight likely occurred because the CZMA was passed in 1972, which  was before D.C. achieved home rule.\n\nScientists…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696521/introduction-of-the-district-of-columbia-flood-prevention-act-of-2025"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…loud music that he was playing in his car. It is  what we must do now as a Presidential administration, emboldened by  hatred and vengeance, seeks to weaken and dismantle Federal programs  that support our veterans, care for our seniors, and defend our Nation  from public health emergencies, just to name a few.\n\nWhat we must continue to do as we face threats…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687898/black-history-month"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…dismantle foundational policies and scapegoat the  American citizens.\n\nThese attacks have material consequences: The uncertainty surrounding  the future of longstanding Federal programs harms the most vulnerable  populations that we serve.\n\nJust last week, I toured a Head Start site in my home State of  Georgia and heard directly from parents and educators…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690638/trumps-first-100-days"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…success at risk. The attempts to claw back these historic  investments in our manufacturing sector, unstable and erratic tariff  policies, and mass elimination of trusted Federal programs and partners  put American businesses at a disadvantage.\n\nAll of these actions by the Trump administration are detrimental to  our ability to compete globally. I encourage…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692696/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…trust that they  will even execute this bill if we vote on it today.\n\nMr. BISHOP. They cut SNAP by 20 percent in the big, ugly bill this  summer, dismantled and defunded Federal programs, fired Federal  workers, and illegally ignored court orders.\n\nThis bill fails to address the healthcare crisis, and bipartisan  outrage has erupted over language in this…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696744/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "Mr. FOSTER. Mr. Speaker, I rise in support of H.R. 6644, the Housing  for the 21st Century Act, which makes improvements to Federal programs  that will support housing development and affordability.\n\nThis bipartisan bill will broaden access to homeownership, expedite  new construction, and lay the foundation…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699803/housing-for-the-21st-century-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…under the  Affordable Care Act and may see their average premium go up by $820 a  year, a 40 percent increase.\n\nMr. Speaker, the working people of my district rely on Federal  programs and services, and they also rely on the essential  organizations in Illinois-03 that provide federally funded social  programs and services.\n\nMr. Speaker, I stand for…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Angelica is one of countless community leaders in my district who  feel the urgency of this moment as my Republican colleagues move  forward with devastating cuts to federal programs like Medicaid.\n\nAngelica's activism reminds us how much our immigrants contribute to  our communities and shape the change they know we need.\n\nOn behalf of Illinois' 3rd…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688474/womens-history-month"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…devastating to the well- being of our citizens and economy, promoting a greater divide between  the haves and have nots. This Trump Administration seeks to slash key  federal programs that improve access to higher education, including  Pell Grants, loans, work-study, TRIO, GEAR UP, and CCAMPIS.  Approximately 45 percent of full-time Black students graduate…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690128/alarm-at-the-trump-administrations-dangerous-attack-on-education"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…will make power less reliable and more expensive for our  four States. In other words, it is all downside, no upside.\n\nWe have now seen weeks of taking a chain saw to our Federal programs  and damage to our grid, national forests, national security, and,  frankly, personal security. It is time for Congress to take our power  back and protect our constituents.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688300/senseless-bonneville-power-administration-workforce-cuts"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…fiscal sanity by cutting almost $2 trillion  in Federal spending. It rescinds billions in green new scam funding. It  eliminates waste, fraud, and abuse from numerous Federal programs.\n\nMr. Speaker, this is a time for choosing. We can choose to side with  the illegal aliens, unelected rogue bureaucrats, and fear-mongering  from the America left or we…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693210/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…source of credit described in subparagraph (A), as compared       to the default rate for the source of credit for small       business concerns generally;\n\n(C) the Federal lending programs available to provide       credit to small business concerns owned and controlled by       covered individuals;\n\n(D) gaps, if any, in the availability of credit for…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687890/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…American Dream of  homeownership.\n\nThis bill cuts through the regulatory choke hold that Washington has  imposed on housing. It streamlines permitting, modernizes outdated  Federal programs, and gets the Federal Government out of the way so  builders can do what they do best: build.\n\nIt empowers local communities, not central planners in Washington,  D.C.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Kansas must make tough  choices every day, and they expect their government to do the same.  Last year, we rescinded $9.4 billion in waste, fraud, and abuse found  in Federal programs, such as funding for Iraqi ``Sesame Street,''  electric buses in Rwanda, and LGBTQ programs in Uganda. Fiscal  responsibility is not optional. It is a basic obligation…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698651/following-through-on-americans-priorities"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…information       from relevant documentation and interviews of agency       officials against relevant leading practices in GAO's A       Framework for Managing Fraud Risks in Federal Programs (Fraud       Risk Framework).\n\nTo support all three objectives, we interviewed CMS       officials and representatives from seven stakeholder       organizations that…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Republicans--and particularly President Trump--suggest or  propose or do, especially when it comes to ways to try to shrink the  size of our government and rightsize bloated Federal programs.\n\nThey have spent a lot of time and energy catastrophizing about all  the supposed dangers of the One Big Beautiful Bill--one of the most  important achievements of this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695530/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…years, so that is $150 billion a year.  What that means is we are already in the hole.\n\nBy 2035, the United States will be spending more on interest per year  than all Federal programs, aside from Social Security. Right now,  Federal debt is so large that 40 percent of all personal income taxes  go to paying interest on the Federal debt. Think about…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…our conservative agenda and make positive  changes that we know that Americans want. From a more secure border to  stronger domestic energy resources, to more efficient Federal programs,  to a tax code that supports families and businesses, this is a once-in- a-generation moment, and I am grateful to be part of this effort on  both the Committee on Ways…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690787/big-beautiful-bill"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "Mr. DOWNING. Mr. Speaker, waste, fraud, and abuse fundamentally  undermine the American people's trust in the government. When well- intentioned Federal programs are defrauded by criminal bad actors,  taxpayer dollars are wasted, and funding for businesses and individuals  in need of this vital support is squandered and stolen.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697225/sba-fraud-enforcement-extension-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…we would be proud of. In the long run, it is not  fair to the next generation to discourage people from getting married  and having children.\n\nRight now, there are many Federal programs. They used to be called  food stamps, low-income housing, Medicaid, which is healthcare for the  poor, and Pell grants. All of these programs are designed to penalize…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…said, and programs like Medicare that our seniors rely on.\n\nNow, one of the ways we can do this, which I hope we will embrace  wholeheartedly, is to look at means-tested Federal programs. So what  does it mean to have a means test?\n\nWell, it depends on your income. Wealthy people don't qualify. People  of modest and lower income brackets can qualify for…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…such committees a certification attesting thereto.\n\n``(c) Contents.--The strategy, including any updates       thereto, shall--\n\n``(1) account for and describe all Federal programs,       projects, activities, and authorities including associated       spending levels, to secure elementary and secondary schools       from acts of terrorism;\n\n``(2)…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696997/national-strategy-for-school-security-act-of-2025"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…erroneous  overpayments.\n\nWe are well aware that the Federal Government has a major spending  problem, and we face a massive problem continuing to pay people for all  sorts of Federal programs, including Social Security, who have passed  away. In FY 2024 alone, Federal agencies reported over $162 billion in  improper payments. By making this data exchange permanent,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698921/ending-improper-payments-to-deceased-people-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…open for those 42 days. Yet, 14 times, Senate Democrats denied funding  to air traffic controllers, denied funding to farm assistance, and  denied funding for all the Federal programs, inconveniencing States,  hurting families, and hurting Federal workers.\n\nFurther, perhaps, unlike some, I certainly gave up my pay for those  42 days by direction of…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697143/denouncing-the-horrors-of-socialism"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…their own.\n\nToday, that number is estimated at over 2.6 million children not  aborted, all because abortion subsidies have been prohibited by the  Hyde amendment in Federal Medicaid programs and other HHS programs.\n\nIt is time to add the Hyde amendment to the ACA.\n\nI believe it is time, as well, for all of us to face the harsh  reality of what abortion…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}]