[{"senator": "Rick Larsen", "party": "Democrat", "sentence": "…International Boundary  and Water Commission, or IBWC, in carrying out its critical water- related missions.\n\nThis bill allows IBWC to accept contributed funds from other Federal  and State agencies, giving the Commission the authority other Federal  infrastructure agencies already have.\n\nThis authority will allow the IBWC to partner with other Federal  agencies…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692168/international-boundary-and-water-commission-authority"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…colleagues in the future, but right now, we need  continued help and focus in the State of Washington, given these severe  weather impacts. And again, I appreciate those Federal Agencies who are  helping: FEMA and the Army Corps of Engineers.                         Nomination of Jared Isaacman\n\nMr. President, I support the Isaacman nomination. In fact,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…clear to all of us from his  attacks on the courts, the rule of law, our democratic institutions,  our civil and legal rights, an open and free press, the dismantling of  Federal agencies, and attacks on our communities that, indeed, he does  not know what his constitutional duties are.\n\nI have to say, Mr. Speaker, we are a nation of laws, a nation  governed…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690721/holding-this-administration-to-account"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…try to  block the judiciary from holding and reining in Donald Trump and Elon  Musk from data mining, firing Federal employees, freezing Federal  funds, and dismantling Federal agencies. It raises the question: What  are they doing inside our Federal agencies?\n\nThat is why, today, I have introduced legislation and a resolution to  get to the bottom of…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689400/demanding-answers"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…respond.  The situation placed local law enforcement officers, code enforcement  staff, and nearby residents at serious risk.\n\nIt required coordination of local, State, and Federal agencies to  fully assess the threat and dismantle this operation. It was slow in  coming.\n\nNow, over the weekend, some of my colleagues have probably noted a  national story in…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699754/stopping-unregulated-biological-laboratories"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…understanding that for many constituents, reaching  out to a congressional office comes at a moment of frustration or  hardship. Kathryn worked tirelessly to navigate federal agencies that  can be difficult to access and slow to respond, and she never lost  sight of the human impact of her work.\n\nConstituents benefited not only from her knowledge, but…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699929/recognizing-the-service-of-kathryn-angell"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the reliability of our Nation's  electric sector, and twists it into a fully partisan exercise. That is  why we should reject this bill entirely.\n\nRight now, a number of Federal agencies have authorities that could  impact the power sector. FERC and the Department of Energy have the  ability to comment on those regulations if they have concerns and work…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…so that FERC and the Department of Energy would have the  final say on pipelines and power lines, respectively.\n\nWhile FERC and DOE could consult with other appropriate Federal  agencies, such consultation is optional.\n\nIf there is a disagreement between the State Department and the  Department of Energy or the State Department and FERC, this bill says…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695689/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…they do not apply for Federal contracts is that the  barriers to entry are simply too high.\n\nH.R. 787 will address this barrier facing small business owners and  mandate Federal agencies to use clear and accessible language in their  contracting opportunities.\n\nI am proud to co-lead this bill, and I thank the gentleman from Long  Island (Mr. LaLota) for…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691852/plain-language-in-contracting-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…medium-duty vehicles. 90 Fed. Reg. at 642.      Congressional Review Act (CRA)\n\nCRA, enacted in 1996 to strengthen congressional oversight       of agency rulemaking, requires federal agencies to submit a       report on each new rule to both houses of Congress and the       Comptroller General for review before the rule can take       effect. 5 U.S.C. Sec.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today I introduce the Protecting Federal  Agencies and Employees from Political Interference Act, which would  prohibit the relocation outside of the National Capital Region (NCR) of  the headquarters for any federal…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688344/introduction-of-the-protecting-federal-agencies-and-employees-from-political-interference-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…activities pursued  under the act. This is a practical and awe-inspiring bill to maximize  the research and development activities and capabilities and results of  our Federal agencies.\n\nMr. Speaker, I enthusiastically urge my colleagues to vote ``yes'' on  H.R. 1368.\n\nMr. Speaker, the gentleman from the West, Mr. Begich and Mr.  Whitesides, along with…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688987/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Supervisor  Education Act of 2025. The bill was reported favorably by the Oversight  Committee unanimously on December 2 with bipartisan support.\n\nThe bill would require Federal agencies to create and implement  training and development programs for agency supervisors. These  programs will help improve their management skills, communicate with  their colleagues,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698217/federal-supervisor-education-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…through Federal contracts. Today, nearly  40,000 Americans, including thousands of veterans, are employed on  these contracts providing essential products and services for Federal  agencies with excellence, reliability, and pride.\n\nServiceSource, based in my Congressional district, is one of 400  AbilityOne Federal contractors doing this work across the…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696023/recognizing-national-disability-employment-awareness-month"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…order was the largest act of union busting in our  Nation's history. It stripped away collective bargaining rights of over  a million Federal employees in over 40 Federal agencies.\n\nThe agencies covered by the executive order employ nearly 82 percent  of the unionized Federal workforce. They are workers in every single  congressional district.\n\nThese are…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697997/protect-americas-workforce-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Firearms Act (NFA) and the       Firearms and Ammunition Excise Tax (FAET), reduces       administrative burdens, and restores long-standing tax       treatment for federal law enforcement agencies. Today,       federal agencies such as the U.S. Marshal Service are not       exempt from paying the FAET on less-than-lethal devices.       Historical payments…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…President, I want to say right off the top, it  was truly an honor to join President Trump at the White House on  Monday. He assembled Senator Hagerty and I and some of the Federal  Agencies in the Oval Office to sign an Executive order and to announce  the deployment of the National Guard to Memphis.\n\nIt is going to be several Federal Agencies that are going…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695666/cloture-motion"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…support programs  that have no benefit to taxpayers themselves.\n\nI was excited to see President Trump taking an unprecedented approach  to curb excessive spending by our Federal agencies by establishing the  Department of Government Efficiency. Since established, DOGE has  illuminated the billions of dollars being drained on pointless projects  that do…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692496/rescissions-package-is-first-step"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…chartered National Woman's Relief Corps, Auxiliary to the       Grand Army of the Republic. Because organizations chartered       under title 36 of the U.S. Code are not federal agencies, CBO       estimates that enacting this bill would have no effect on the       federal budget.\n\nThe CBO staff contact for this estimate is Matthew       Pickford. The…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699502/moving-national-womans-relief-corps-incorporation-and-domicile-to-illinois-principal-office-to-murphysboro-illinois"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…(relating to establishing policies concerning spectrum       assignments and use by radio stations belonging to and       operated by the United States) and provide Federal agencies       with guidance to ensure that the conduct of       telecommunications activities by such agencies is consistent       with such policies;\n\n``(3) represent the interests…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690257/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…made in the 2015 Miles City RMP.\\24\\      Congressional Review Act\n\nCRA, enacted in 1996 to strengthen congressional oversight       of agency rulemaking, requires federal agencies to submit a       report on each new rule to both houses of Congress and to the       Comptroller General for review before a rule can take       effect.\\25\\ The report…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693085/us-government-accountability-office-legal-opinion"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…going to come back in after they broke it and  use our tax dollars to tell us that they are fixing it.\n\nWhat I am saying is that these programs are being done by other  Federal agencies. We don't need yet another one on top of them to take  our money and have it sit in some account.\n\nOh, by the way, when the gentlewoman says that no one has been  appointed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Adapt.\n\nIn June 2016, the Fraud Reduction and Data Analytics Act of       2015 (FRDAA) required the Office of Management and Budget       (OMB) to establish guidelines for federal agencies to create       controls to identify and assess fraud risks to design and       implement antifraud control activities. The act further       required OMB to incorporate…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…reimbursable and non-reimbursable agreements       between the Department of Energy and the National Aeronautics       and Space Administration; and\n\n(2) collaborate with other Federal agencies, as       appropriate.\n\n(e) Merit Review Process.--The Secretary and the       Administrator shall ensure any competitive awards made to       carry out the activities…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688985/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Ending Improper Payments to Deceased People Act. It is a commonsense,  bipartisan effort to strengthen the accuracy of the Death Master File,  improve data sharing across Federal agencies, and ensure that benefits  programs have the timely, reliable information they need to verify  eligibility, and a pulse, before payments go out the door.\n\nThe results,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698919/ending-improper-payments-to-deceased-people-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the bypass flows on the Basin  Fund, as well as the impacts of diminished hydropower generation at  Glen Canyon Dam on grid reliability.\n\nThe plan will also require the Federal agencies to identify the  impacts of these actions on any species listed as threatened or  endangered under the Endangered Species Act.\n\nI again thank Representative Hageman for…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691060/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…addressed through covered technical assistance.\n\n(6) An evaluation of how the Administrator carries out       covered technical assistance in coordination with other       Federal agencies providing technical assistance related to       water infrastructure.\n\n(7) An evaluation of how covered technical assistance       supports communities in understanding,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695402/water-resources-technical-assistance-review-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…effectiveness       of research and development activities carried out pursuant       to a memorandum or agreement described in subsection (b); and\n\n(2) collaborate with other Federal agencies as appropriate       to carry out such activities.\n\n(e) Report.--Not later than two years after the date of the       enactment of this Act, the covered officials shall…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687909/doe-and-sba-research-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…general public;\n\n(C) review current Federal responsibilities at each Mid-      Atlantic River Basin Commission, including the types of       actions taken by relevant Federal agencies in carrying out       such responsibilities;\n\n(D) describe the level and sources of Federal and State       funding received by each Mid-Atlantic River Basin Commission;…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695003/mid-atlantic-river-basin-commissions-review-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…out the voter registration application. Some do, and hopefully this  legislation will encourage more to do so.\n\nDuring the last election cycle, we even saw that some Federal  agencies were instructed to hand out registration forms without the  ability to discern whether the person receiving the form is a citizen  or not. So the noncitizen shows up…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}]