[{"senator": "Lou Correa", "party": "Democrat", "sentence": "…CORREA. Mr. Speaker, first of all, let me begin by thanking the  chair and the ranking member for their interest in good, managed,  efficient SBA offices. They are Federal taxpayer dollars being invested  to make sure that we continue to create jobs in our great country.\n\nThat being in mind, I would ask everybody to think about return on  investment…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692099/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…all Trump has to do is make an example of  a handful of universities, and others will simply comply and obey in  advance.\n\nWhy? As an academic president, when you have Federal dollars that  employ people at your university, would you permit a major protest  against a Trump policy if you know that is going to jeopardize Federal  funds? Maybe you allow…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…across the country.\n\nThis program funds partnerships between the EPA, States, local  governments, and community stakeholders. It is very successful in  leveraging not just Federal dollars, but on average the local NEPs  raise an additional $17 for every $1 in Federal funding, as my  colleague Representative Johnson also noted.\n\nThese non-Federal dollars…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698177/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…about law and order, he wouldn't gleefully refuse to  coordinate with State and local officials. He wouldn't have literally  defunded our police by freezing and slashing Federal dollars that help  hire, train, and equip law enforcement. He wouldn't be diverting  Federal resources and agents away from operations that investigate drug  cartels and drug…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696180/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…conservation  funds while the service reviews their plans.\n\nAt the same time, this bill would maintain the standards by which  these plans are reviewed, ensuring that these Federal dollars are used  responsibly and as Congress intended.\n\nMr. Speaker, I urge my colleagues to join me in supporting H.R.\n\nMs. RANDALL. Mr. Speaker, I support this legislation,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697623/make-state-wildlife-action-plans-efficient-act-of-2025"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…responsible for  increasing costs and limiting access to reproductive healthcare.\n\nRight now, any and all abortion coverage provided under marketplace  plans are not paid for by Federal dollars. However, this bill would  impose unprecedented restrictions on private dollars and is yet another  Republican attempt to ban reproductive healthcare coverage across this…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698303/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…remain in  that body that is closest to the people.\n\nNo longer. Under the dodgy dictatorship of DOGE, we have seen the  unconstitutional and haphazard seizure of billions of Federal dollars  critically needed in communities throughout our country for everything  from food safety inspections to healthcare for veterans. Although DOGE  has failed to meet any…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691336/pocca"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…need to build on the ADA's  promise--whether it is passing my bill, the Eleanor Smith Inclusive  Home Design Act, to make sure that all new residential housing built  with federal dollars is accessible or increasing the employment of  adults with disabilities.\n\nThis year, we have seen a number of legislative attempts to take away  rights from disabled individuals.…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694026/recognizing-the-22nd-annual-disability-pride-parade"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…their own  priorities. It means Russ Vought does not again have the legal  authority to pick and choose what projects to fund, robbing blue States  of funding and using Federal dollars for political retribution.\n\nNo doubt, there is a lot more I would have liked to do in these bills  to rein in an out-of-control administration. While I wish Republicans…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…intertwined the  Medicaid, provides early intervention from birth to age 3, oftentimes  the difference between a child meeting developmental milestones or  falling behind.\n\nThese Federal dollars change millions of lives across the country  every single year. However, Trump and congressional Republicans have  told American families that these investments don't…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…Despite his nonvoting status, Prince Kuhio played a significant role in  shaping Hawaii's future and was a tireless advocate for the  Native Hawaiian community. He secured Federal dollars for the dredging  and construction of Pearl Harbor, helped establish Hawaii Volcanoes  National Park, and laid the foundation for Hawaii's modern government  structure…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695588/hawaiian-history-month"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…spending at its approved level for the fiscal year  2025 budget. According to the CBO, this bill does not have any  budgetary cost to the Federal Government. There are no Federal dollars  involved. The issue here is just allowing the DC Government to proceed  to spend its own tax revenues.\n\nAccordingly, I urge all of my colleagues to support this measure…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688849/district-of-columbia-local-funds-act-2025"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…over $37 trillion, we can't afford to litter  sensible appropriation bills with wasteful spending.\n\nAn October 20 press release revealed BioMADE received $87 million in  Federal dollars under the Biden-Harris administration to produce lab- grown meat to reduce carbon emissions on military bases. In March 2023,  BioMADE received an additional $450 million…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693694/department-of-defense-appropriations-act-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…advancing priorities for wealthy Americans, which some of these they  did make permanent by subsidizing electric vehicles for politically  connected cronies to siphon off Federal dollars of the greenhouse gas  slush fund.\n\nNow, Democrats are uniting behind that policy to send billions more  of taxpayer dollars to big health insurance plans. With the Democrats'…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…percent of  those costs to the States.\n\nAmerican taxpayer dollars are being spent on this program, whether we  like it or not.\n\nReimbursement quietly channels billions of Federal dollars into care  for illegal immigration through State Medicaid programs. States like  California and New York are actually the most abusive of this law.  These sanctuary States…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…they had the opportunity to be able  to have that.\n\nAs I mentioned, 50 years ago, the Hyde amendment was put in place.  Every single part of our healthcare operation with Federal dollars is  all covered by the Hyde amendment. Whether it be Department of Defense  healthcare, whether it be Veterans' Administration, whether it be  Indian healthcare services,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…to Medicaid recipients than  Medicare recipients, which we often do?\n\nWhy would we continue to allow States like California and other  States to game the system, to get Federal dollars sent back in a money- laundering scheme, as has been reported widely by The Wall Street  Journal and others? They are openly and knowingly doing it. Why  wouldn't we fix…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…where you  have the provider taxes, you have this high rate that they are able to  collect, and they are juicing it using the provider taxes. They get  this 90 percent Federal dollars, and then they are openly--California,  for example, has stated they are gaming the system to get Federal  dollars to use that to subsidize illegal aliens and people who…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690587/economic-anxiety"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…there at this  point.\n\nMr. Speaker, H.R. 1069, the PROTECT Our Kids Act, makes clear that  schools receiving funding from the Chinese Communist Party will not  receive Federal dollars.\n\nFor too long, schools have turned a blind eye to the CCP's demands  for fear of losing CCP money. However, every dollar came with strings  attached: lessons glorifying…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697532/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…the Santee Sioux  Nation, who don't understand where Greeley is, where Gothenburg is--and  some, probably, where Omaha or Lincoln are.\n\nJust as important in bringing Federal tax dollars back home, it is  providing that tax relief to Nebraska taxpayers. Many of these projects  would otherwise fall on our local property taxes, which are considered  very…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699921/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…the Medicaid housing program. This fraud could help  explain why Minnesota saw the second highest in per-enrollee Medicaid  spending under the ObamaCare expansion, where Federal dollars are  underwriting nonexistent services and treatments. So Minnesota, with  all of the fraud going on there, has the second highest cost per  enrollee, and it shot up during…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699102/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…has no website, and it has no programs funded. They haven't done  anything.\n\nThey haven't spent any money making any lives better, yet, strangely,  it is still receiving Federal dollars to the tune of $4 million for  projects allegedly in the watershed of the regions of Illinois,  Indiana, Michigan, Minnesota, New York, Ohio, Pennsylvania, and  Wisconsin.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Trump administration and we Members of Congress look to provide aid  to farmers.\n\nThis is a top concern that I hear from many family farmers. My  farmers are concerned that Federal dollars meant to help the farmers  will simply get passed on to seed and fertilizer companies.\n\nThat concern brings me to my legislation and bringing it to the  attention of my…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697521/farmers"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…The truly amazing thing is the legislative analyst testified that  this update that the rail authority provided, even this incomplete  update, assumes there will still be Federal dollars. They are saying  there is a $7 billion budget shortfall for just the next few months,  and that has an unrealistic assumption that goes with it that there is  going to…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}]