[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…(defined as the ``Capital'') will fall outside of       the boundaries of the new State and remain under federal       jurisdiction. The Act also repeals the provision of federal       law that establishes the current mechanism for District       residents to participate in presidential elections, pursuant       to Congress's authority under the Twenty-Third…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…police officers that day.\n\nWe have an administration that treats White nationalist extremism as  a core competency in the hiring process and an administration that  focuses Federal law enforcement resources, not on violent offenders but  on prosecuting political opponents, unleashing masked ICE agents on  innocent people, and deporting children and grandmothers.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…knows D.C.  better than the president, to accomplish its mission.\n\nSection 740 is also unnecessary. In the case of a true federal  emergency in D.C., the president can deploy federal law enforcement  officers and the Armed Forces, and can request the support of MPD, as  the Capitol Police did during the attack on the U.S. Capitol on January  6, 2021, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694806/introduction-of-the-district-of-columbia-police-home-rule-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…District of Columbia Residency Act. This bill would require that a  majority of the members of the Commission of Fine Arts (CFA) be  District of Columbia residents.\n\nUnder federal law and presidential executive orders (EOs), the CFA  has review authority for federal property in D.C., certain military  property, certain coins and medals, D.C.-owned parks…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694733/introduction-of-the-commission-of-fine-arts-district-of-columbia-residency-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…contacted the family, and they didn't know where he slept during this  time away from home.\n\nUnfortunately, Mr. Huerta Cisneros' case is not isolated. Donald  Trump has turned Federal law enforcement officers into his own personal  secret masked police force to engage in political theater at the  expense of real lives. In that process, the rights and liberties…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…of Columbia Pretrial Services Agency (PSA), to reside in the  District of Columbia during their terms. There are residency  requirements for government positions in federal law, D.C. law and the  laws of jurisdictions throughout the United States. The primary reason  such laws exist is to ensure that certain government officials have a  connection to…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690239/introduction-of-the-requirement-of-the-director-of-the-court-services-and-offender-supervision-agency-for-the-district-of-columbia-and-the-director-of-the-district-of-columbia-pretrial-services-agency-to-reside-in-the-district-of-columbia"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Long Island. The bomb threats against my  offices came with the email subject line ``MAGA'' and from an email  address alleging the ``2020 election was rigged.''\n\nLocal and Federal law enforcement responded immediately and are  conducting full security sweeps, and investigations are ongoing.  Everyone, thank God, is safe, and I am grateful for the quick…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697230/political-violence"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…to introduce the  Qualified Immunity Accountability Act because no one is above the law  or the Constitution.\n\nAcross this country, we are witnessing a dangerous pattern: Federal  law enforcement officers--specifically, ICE agents--operating with near  total impunity. We have seen constitutional rights violated, and we  have seen communities terrorized.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699645/upholding-rule-of-law-for-federal-officers"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…of the United States. A dictator wishes to do away with  due process and disappearing loved ones to foreign countries without a  trace.\n\nThis administration is violating Federal law by sending people to  places like CECOT and, soon, maybe Libya, where they may very well face  torture or some other horrific treatment.\n\nFor anybody who thinks this may…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691401/motion-to-discharge-s-res-195"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…some of the things he said,  because, again, I just want to affirm that he is right on the urgency  to help our police officers. He is right that States should abide by  Federal law that passes from this body. But what we have now is a  President who, in his first term, didn't ever try something like this,  which is undermining the will of Congress.…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…against  Representative Stacey Plaskett but, amazingly, alleges no misconduct.  It does not allege a violation of the Constitution. It does not allege  the violation of a Federal law or a State law or a local law. It does  not even allege a violation of the ethics rules of the House of  Representatives. Yet, they want to censure her and throw her off…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, I, along with Representative Donald S. Beyer  Jr., introduce the Federal Police Camera and Accountability Act of  2025. This bill would require federal law enforcement officers to wear  body cameras and marked federal law enforcement vehicles to have  dashboard cameras. It would also require the Government Accountability  Office…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694762/introduction-of-the-federal-police-camera-and-accountability-act-of-2025"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…barriers that would  disenfranchise millions of Americans. This bill would also increase the  purges of registered voters, literally kicking people off the list.\n\nVery clearly, Federal law already prohibits noncitizens from voting  in Federal and State elections. Over 21 million Americans lack easy  access to the documents this law would require for voter…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689318/voter-suppression-plain-and-simple"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…authority NCPC and CFA have  over local D.C. land-use decisions. Until Congress passes those bills,  the agencies should be exempt from federal government shutdowns.\n\nUnder federal law, NCPC has approval authority for the development of  D.C.-owned buildings located in the ``central area,'' including the  location, height, bulk, number of stories and size…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696109/introduction-of-a-bill-to-provide-for-interim-appropriations-for-the-national-capital-planning-commission-and-the-commission-of-fine-arts-with-respect-to-any-fiscal-year-for-which-appropriations-are-not-otherwise-provided-for-the-commissions"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…introducing the Stop Body Camera Paywalls Act to  prevent any State or unit of local government that creates a paywall  for access to these public records from receiving Federal law  enforcement grants.\n\nAgain, we must make sure that we have transparency, especially when  it comes to Federal law enforcement grants. This bill is a necessary  step in…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698994/stop-body-camera-paywalls"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…groups doing that.\n\nI watched that Lakota helicopter that I mentioned before. That Lakota  helicopter is actually a military helicopter. Their job is not to  arrest. That is Federal law enforcement on the ground who is doing it,  but they are able to be an extra set of eyes in the air to be able to  identify folks that are getting around those gaps in the…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…of Congress and ignoring the needs and input  of local residents. Passing this joint resolution will disapprove this  Record of Decision and prevent this circumvention of Federal law from  happening again.\n\nAlaska has a strong record of responsible resource development. The  footprint of drilling pads on the North Slope has declined by 80  percent since…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "John Thune", "party": "Republican", "sentence": "…allow for additional consideration of this bill before final  passage, but any conversation--any conversation--has to include a  discussion of how to make it safer for our Federal law enforcement  agents to effectively carry out their duties.\n\nWe need to address not only issues like increased training for ICE  officers but things like preventing the constant…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699507/government-funding"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Atlanta, Boston,  Chicago, Denver, New York City, and Seattle, and moving them to less  costly and more accessible locations to better serve the mission and  comply with Federal immigration law. With Congressman Finstad's bill,  the Save SBA from Sanctuary Cities Act, Republicans are supporting this  plan with legislation, giving the SBA 120 days to deliver…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…sexually explicit conduct when  the offender intentionally includes the child in the depiction, even  passively. This is a straightforward, bipartisan fix that ensures that  Federal law captures these heinous acts and imposes the penalties that  they deserve.\n\nMr. BIGGS of Arizona. Mr. Speaker, I commend law enforcement for  their tireless work of protecting…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698897/child-predators-accountability-act"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…registering noncitizens to vote.\n\nNow, the requirements for voter ID and proof of citizenship in  particular have been twisted and misrepresented. Let me set the record  straight. Federal law mandates that only U.S. citizens may vote.  However, under the Supreme Court's interpretation, voters are not  required to show proof of citizenship. The risk is clear.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…produce coming across our border. They defunded the Cybersecurity &  Infrastructure Agency. They defunded FEMA, the Federal Emergency  Management Agency. They defunded the Federal law enforcement training  centers. They have defunded U.S. Immigration and Customs Enforcement-- that is ICE, what they were targeting. They have also defunded the  Secret Service.…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700299/government-funding"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…by a pro-Palestine extremist group. The four suspects are  now in Federal custody, and we know they will face the full force of  the law.\n\nGod bless the men and women in Federal law enforcement and in our  armed services who are really working around the clock to restore  safety and security here in our country.\n\nUnder President Trump, we have seen…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Safety Act and       provisions relating to the carrying of concealed weapons by       law enforcement officers, and for other purposes.\n\n(c) The bill (H.R. 2255) to allow Federal law enforcement       officers to purchase retired service weapons, and for other       purposes.\n\nMr. ROY. Mr. Speaker, for the purpose of debate only, I yield the  customary…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…certain land.--The land taken into       trust under paragraph (1) shall not be subject to any       requirements for valuation, appraisal, or equalization under       any Federal law.\n\n(c) Land Management.--Of the land taken into and held in       trust under subsection (b)(1), the portion of the Elwha River       subject to section 3(c)(3) of the Elwha…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697609/lower-elwha-klallam-tribe-project-lands-restoration-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…the `Special       Advisor'), who shall--\n\n``(1) be selected by the Secretary and the Commandant       through a competitive search process;\n\n``(2) have expertise in Federal Indian law and policy,       including government-to-government consultation;\n\n``(3) to the maximum extent practicable, have expertise in       legal and policy issues affecting…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…kind of like, I guess, New York West  or Los Angeles East, they did not see anything worth prosecuting when  you bite off the finger of an ICE agent.\n\nThen we went to the Federal law enforcement, and they convened a  grand jury to indict the person who bit off the finger of an ICE agent,  which you think would be relatively automatic. Nobody argued that…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…if necessary, under subsection (b)(3);\n\n(ii) conducting the appraisal under subsection (d); and\n\n(iii) any environmental analysis or resource survey       required under Federal law.\n\n(d) Appraisal.--\n\n(1) In general.--Not later than 300 days after the date of       enactment of this Act, the Secretary shall complete an       appraisal to determine…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694030/wabeno-economic-development-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…Act.\n\nMr. Speaker, I thank my colleagues for their thoughtful debate and  for their support on this important issue. This legislation addresses a  clear and dangerous gap in Federal law that predators have exploited to  harm children online.\n\nBy explicitly criminalizing threats to distribute child sex abuse  material, Congress ensures these heinous acts…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698861/combating-online-predators-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…foreign-born  population, which totals upward of over 50 million people or close to  16 percent.\n\nFact two: While only U.S. citizens are legally eligible to vote in  Federal elections, Federal law actually interferes with and prevents  States from using Federal data to check their voter rolls to ensure  that only citizens are voting, such that we end up in…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}]