[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…text images       Exum sent to his fellow Border Patrol buddies, literally       bragging about how many times he shot me. I got sick to my       stomach seeing how a federal law enforcement officer would       talk this way about shooting me--a woman who he swerved into.       It was both eye-opening and heartbreaking.\n\nThis hearing--a forum that had…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Speaker, I rise to strongly support this resolution because we  strongly support our local law enforcement officers. Yet, we also  strongly support our State, Federal, and Tribal law enforcement  officers, as well. Why are these brave officers not part of this  resolution? This is a strange development.\n\nIn the last Congress, the 118th Congress, we passed…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…better than the president, to accomplish its mission.\n\nSection 740 is also unnecessary. In the case of a true federal  emergency in D.C., the president can deploy federal law enforcement  officers and the Armed Forces, and can request the support of MPD, as  the Capitol Police did during the attack on the U.S. Capitol on January  6, 2021, and as the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694806/introduction-of-the-district-of-columbia-police-home-rule-act"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…Federal troops and the National Guard on civilians across  America, despite fierce opposition from local residents and political  leaders. He has sent armed and masked Federal law enforcement agents to  terrorize immigrant communities. Those agents have harassed and  detained U.S. citizens exercising their First Amendment rights.\n\nThe President has initiated…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…violation be       detained or transferred to federal custody. H.R. 2056 would       also eliminate rules governing information sharing between       the District and federal law enforcement on immigration       matters. In sum, the bill would scrap rules and practices       that are clear and familiar and replace them with nothing.       This will only…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692373/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…violation be       detained or transferred to federal custody. H.R. 2056 would       also eliminate rules governing information sharing between       the District and federal law enforcement on immigration       matters. In sum, the bill would scrap rules and practices       that are clear and familiar and replace them with nothing.       This will only…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…changes to the federal       code included in these bills win apply equally to all       persons, including individuals convicted of serious violent       crimes.\n\nFederal law enforcement entities, such as ICE and CBP,       already widely employ such devices, and have entered into       procurement contracts worth over $35 million for Taser       systems…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…of Homeland Security funding bill that is still being  negotiated and deliberated. It is an amendment to explicitly bar any  Federal funds from being used to deploy Federal law enforcement or  military personnel to polling places or election offices for the  purpose of voter intimidation or election interference.\n\nIt is amazing we would have to say that.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…introducing the Stop Body Camera Paywalls Act to  prevent any State or unit of local government that creates a paywall  for access to these public records from receiving Federal law  enforcement grants.\n\nAgain, we must make sure that we have transparency, especially when  it comes to Federal law enforcement grants. This bill is a necessary  step in a wider…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698994/stop-body-camera-paywalls"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…murders of George Floyd and Breonna Taylor       and the need to enact systemic police reform. In the wake of       the deployment of the National Guard and surge of federal law       enforcement in D.C., there has been an increase in instances       of police brutality and unwarranted searches. Congress must       not block D.C. from heeding the calls of…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696914/letter-led-by-the-leadership-conference-on-civil-and-human-rights-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…father of  three marines who had been working in the United States for decades, or  yesterday when ICE raided a baseball summer camp. This is not the best  use of our Federal law enforcement agents.\n\nI am a former Federal and State prosecutor. I deeply respect the rule  of law and understand the responsibility elected officials have to  protect it. We…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693662/weaponization-of-ice"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…NORTON. Mr. Speaker, I, along with Representative Donald S. Beyer  Jr., introduce the Federal Police Camera and Accountability Act of  2025. This bill would require federal law enforcement officers to wear  body cameras and marked federal law enforcement vehicles to have  dashboard cameras. It would also require the Government Accountability  Office…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694762/introduction-of-the-federal-police-camera-and-accountability-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…loopholes and politicizes what should have been a  simple, bipartisan measure.\n\nThe bill before us today would allow surplus firearms to be sold not  only to active Federal law enforcement officers in good standing, but  also to retired law enforcement officers.\n\nBecause the bill now has no background check requirement, it could  create a situation in…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…healthcare providers, and children. It allows  healthcare providers and parents to be fined and possibly jailed if  they help a minor access lifesaving care. It permits Federal law  enforcement to act as the national gender police, allowing them to  invade children's private medical records.\n\nThis bill puts even more children in harm's way and exacerbates…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698353/protect-childrens-innocence-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…Frankly, other than the ICE vests or jackets they are wearing,  which, by the way, can now be purchased for $29.99 on Amazon, they look  more like gang members than Federal law enforcement agents.\n\nIf a person runs away from these masked vigilantes, they will beat  and chase that person down. Mr. Speaker, if you ask to see their  identification or their…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "Mr. FRY. Mr. Speaker, pursuant to House Resolution 405, I call up the  bill (H.R. 2255) to allow Federal law enforcement officers to purchase  retired service weapons, and for other purposes, and ask for its  immediate consideration in the House.\n\nThe Clerk read the title of the bill.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691348/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…Immigration and Customs Enforcement Enforcement and  Removal Operations Field Office Director, Peter Berg. Peter is retiring  later this month after nearly 30 years in federal law enforcement.\n\nAfter graduating from the University of Illinois, Director Berg began  his career in 1996 as an Immigration Inspector with the former U.S.  Immigration and Naturalization…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692698/recognizing-st-paul-minnesota-immigration-and-customs-enforcement-field-office-director-peter-berg"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…Government.\n\nI have served here 15 years. I have seen my share of shutdowns, and I  know how much they hurt, how much they hurt the men and women of our  military, Federal law enforcement, folks who serve and protect our  country at home and abroad. And they should not have to wonder when or  if they will get paid.\n\nA shutdown isn't good for our reputation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695942/government-funding"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…that stands in our way.\n\nThat is why I am introducing the Protect America Act. This bill does  four things:\n\nFirst, it doubles the criminal penalty for assaulting Federal law  enforcement, and for the first time, it makes it a Federal crime to  ``inhibit, stymie, hamper, or interfere with'' Federal law enforcement  operations. That means the people…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "…better cooperation with local law  enforcement. Well, that is something that we would like too. We would  like to see it in sanctuary cities that are blocking our Federal law  enforcement officers from apprehending illegal immigrant criminals who  are in their jails.\n\nWork with us to be able to allow us to do that. That would be great-- I am sure the…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699924/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Because of that, their constituents and,  indeed, nearly 700,000 Tennesseans are without their SNAP benefits.\n\nBorder Patrol agents, our air traffic controllers, and Federal law  enforcement have been working a month now without pay. This is why you  have the AFGE and the controllers union saying: End the Schumer  shutdown now.\n\nWe also know that critical…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…South American and through Central American. Rather than a law  enforcement professional body, they drew these illegals into our  country where they were waived in by a Federal law enforcement body  transformed into a reception and processing force. The negative impact  was 100 percent the result of policy.\n\nOur colleagues across the aisle told us for years,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…pro-Palestine extremist group. The four suspects are  now in Federal custody, and we know they will face the full force of  the law.\n\nGod bless the men and women in Federal law enforcement and in our  armed services who are really working around the clock to restore  safety and security here in our country.\n\nUnder President Trump, we have seen that national…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…rights.\n\nSpecifically, this resolution recognizes the right to assemble and  protest peacefully, condemns unequivocally the violence perpetrated  against Federal, State, and local law enforcement, calls on local and  State-elected leadership to work with the Federal Government to end the  violent riots and restore peace, and expresses gratitude to…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…they were going to go after convicted  criminals. These people are not convicted criminals.\n\nThis resolution says that there is cooperation between State, local,  and Federal law enforcement. Really? As far as I know, the President of  the United States ordered the National Guard to go into California over  the objection of the Governor of California,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…agencies that may have been involved, for violation of their Fourth  Amendment rights and other statutory provisions that govern privacy  rights and/or that limit Federal law enforcement from pursuing  political witch hunts.\n\nI guess I am just absolutely shocked by my colleague on the other  side who believes that the Federal Government has the right…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696923/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…body, most Americans know I am  very plugged into law enforcement. I get calls every day from these  guys, boots on the ground across the country, including deep in Federal  law enforcement, and they support this law. Don't tell me that Federal  law enforcement doesn't want to do this or it is bad for the country in  some way. That is smoke. That is smoke…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693077/special-interest-alien-reporting-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…of like, I guess, New York West  or Los Angeles East, they did not see anything worth prosecuting when  you bite off the finger of an ICE agent.\n\nThen we went to the Federal law enforcement, and they convened a  grand jury to indict the person who bit off the finger of an ICE agent,  which you think would be relatively automatic. Nobody argued that this…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…attempting to  throw a lifeline to these sanctuary cities that are openly defying the  law. In order to receive Federal grant dollars, you can't withhold  information from Federal law enforcement. That is what they are doing.  That is what it means to be a sanctuary city.\n\nWhat you are saying is, we are not going to work with ICE or any  other Federal Agencies…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696003/unanimous-consent-requests"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…enforcement officers and first responders       who were killed in the line of duty.\n\n(b) Eligibility.--\n\n(1) In general.--A local, State, Tribal, territorial, or       Federal law enforcement officer or first responder who was       killed in the line of duty shall be eligible for the medal of       sacrifice established under subsection (a).\n\n(2) Exception.--…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699505/medal-of-sacrifice-act-of-2025"}]