[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…federal government has begun to change its approach to marijuana.  For example, for the last several years, Congress has prohibited the  Department of Justice (DOJ) from using federal funds to prevent  jurisdictions from implementing their medical marijuana laws. This bill  would similarly allow individuals to use marijuana in federally  assisted housing in…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698317/introduction-of-the-marijuana-in-federally-assisted-housing-parity-act"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…most from those who have the least.\n\nThe Norristown Area School District, just 15 miles from my district  of Abington, is owed three times as much, more than $750,000 in Federal  funds.\n\nThis is not about government efficiency. It is about greed,  incompetence, and cruelty.\n\nWhen Secretary McMahon testified before the Appropriations Committee,  I asked…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693699/providing-best-education-funding-for-all-families"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…start to attack the independence,  the academic freedom of our universities, it is a sure sign of a  democracy in trouble. When a President tries to dictate by withholding  Federal funds--the lifeblood of research universities--and withholds  those funds unless an academic institution agrees to adopt his cultural  agenda or fire certain faculty or allow…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696336/trump-administration"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…success.\n\nLet's call this what it is: Trump's resegregation agenda.\n\nWe know what happens when prejudice prevails. Opportunity is  obstructed, and red lines are drawn with Federal funds. We have seen  this story before.\n\nYet despite the dark clouds gathering above 1600 Pennsylvania Avenue,  Black Americans have long battled bigotry, broken barriers, and…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688144/recognizing-resilience-resistance-and-relentless-struggle-lessons-of-black-history"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…draft the periodic reports.\n\nPresident Trump has decimated and undermined our Federal agencies and  dedicated civil servants who fulfill their missions while also stealing  Federal funds promised to local communities all across the Nation. He  has created constant uncertainty for businesses with the  administration's ever-changing tariff regime.\n\nMr. Chair,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…and socioeconomic backgrounds, all with  the protections of organized labor.\n\nLast year, the Akron Sustainable Polymers Tech Hub was awarded  approximately $51 million in Federal funds, thanks to the historic  CHIPS and Science Act.\n\nI am proud to have worked with our local, State, and Federal  stakeholders to bring these vital funds back to our district…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695128/my-amendments-to-hr-3838"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…especially in our rural areas.\n\nThe block grant funding that the Trump administration keeps promising  comes with little accountability, making it unclear whether those  Federal funds will ever reach the students that need them the most.\n\nEducation lays the foundation for a strong future, as well as a  thriving, healthy community; a thriving, healthy…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698124/dismantling-the-department-of-education"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…announcing a new amendment to  the Department of Homeland Security funding bill that is still being  negotiated and deliberated. It is an amendment to explicitly bar any  Federal funds from being used to deploy Federal law enforcement or  military personnel to polling places or election offices for the  purpose of voter intimidation or election interference.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…efforts like the National Estuary Program,  which protect and restore our critical natural resources while  utilizing local knowledge and ensuring the efficient use of Federal  funds.\n\nThis is a program that is working. It is popular, and it deserves our  support. I urge passage of the ESTUARIES Act, as amended, and ask all  my colleagues to do the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698177/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…and ethnicity category. This includes about 23 percent       of nonelderly AIAN adults and 44 percent of [American Indian/      Alaskan Native] children.\n\nHow the Federal Government funds the states' Medicaid       plans.\n\nMedicaid began as an optional program in 1966 alongside       Medicare, with around 8 million people eligible for       enrollment.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "I rise in opposition to H.R. 1069, the so-called PROTECT Our Kids  Act. This bill would add a new stipulation that disqualifies public  schools from receiving Federal funds under the Elementary and Secondary  Education Act if the school receives contributions, materials, or other  resources from China or an individual or entity acting directly…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697533/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…so-called judge,       which essentially takes law-enforcement away from our       country.'' Two months later, when the same court temporarily       blocked the withholding of federal funds from sanctuary       cities, the White House denounced the judgment as an attack       on the rule of law by an ``unelected judge.'' Trump himself       responded by threatening…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…support of  their federal government. The ``Transportation Emergency Relief  Extension Act'' will ensure state and local governments have adequate  time to fully utilize federal funds awarded to repair roads and  infrastructure damaged by disasters.\n\nCurrent U.S. Department of Transportation regulations allow the  federal government to claw back ``emergency…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694581/introduction-of-the-transportation-emergency-relief-extension-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…president, when you have Federal dollars that  employ people at your university, would you permit a major protest  against a Trump policy if you know that is going to jeopardize Federal  funds? Maybe you allow it because you don't want to brazenly stand in  the way of free speech, but you just make sure that it is not too big a  protest or it is not too critical.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…budget being proposed by Republicans in the  House.\n\nIn addition, New Hampshire's Medicaid expansion, established on a  bipartisan basis, would end with any decrease in Federal funds, leaving  68,000 Granite Staters uninsured and devastating our hospitals and  community health centers.\n\nI have heard from literally thousands of Granite Staters on this…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689237/cuts-to-medicaid"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…may be  impacting their child's classroom and stops foreign nations from  reaching America's youth.\n\nSpecifically, the TRACE Act requires that as a condition of receiving  Federal funds under the Elementary and Secondary Education Act, public  schools would be required to provide each parent the right to review  any curricular material provided or purchased…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…parts, and ammunition. That lifeline  begins with our Army arsenals.\n\nMy amendment to the Department of Defense Appropriations Act protects  that lifeline by prohibiting any Federal funds from being used to  reduce the workforce at Rock Island Arsenal, Joint Munitions Command,  Army Sustainment Command, or any other active U.S. Army arsenal.\n\nRock Island…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693676/department-of-defense-appropriations-act-2026"}, {"senator": "John Rose", "party": "Republican", "sentence": "…served and repeatedly lied in an effort to enrich       herself,'' said U.S. Attorney Jaime Esparza for the Western       District of Texas. ``Rather than $109 million in federal       funds going to the care of military children throughout the       world, she selfishly stole that money to buy extravagant       houses, more than 80 vehicles and over 1,500…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695237/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…executive order titled: ``Protecting Children From Chemical and  Surgical Mutilation.'' This order defunds the chemical and surgical  mutilation of children and halts the use of Federal funds supporting  gender-affirming medical care for youth under the age of 19.\n\nH.R. 3492 works to codify President Trump's executive order and  amends section 116 of the United…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698346/protect-childrens-innocence-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…Exception.--When the Department of Transportation       procures, contracts for, or       otherwise obtains for its own account, or provides financing       in any way with Federal funds or advances funds or credits,       for the furnishing or obtaining of the equipment, materials,       or commodities, the Secretary of Transportation or recipient       of such…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692187/american-cargo-for-american-ships-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…laws shouldn't  be entitled to Federal tax dollars. Federal grant dollars are not  entitlements. They are not unconditional welfare for far-left  activists. If you want Federal funds, you have to comply with Federal  law.\n\nSanctuary cities are in open defiance of Federal law. They actively  prohibit their officials from cooperating with  Federal immigration…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696003/unanimous-consent-requests"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…pipeline by expanding K through 12 students' exposure to accounting  programs. As with other areas of STEM education, this bill would  qualify accounting instruction for Federal funds. This recognition  aligns with the increasing need for accounting professionals to have  high-level math and technology skills, including the ability to analyze  big data,…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699793/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…17-year-long failure to build anything despite  receiving massive funding at the State and Federal levels.\n\nThe audit specifically looked at what happened to the $4 billion in  Federal funds that were provided through recent grants. The result of  the audit showed that the State is woefully out of compliance, that it  has built nothing, and that there is no…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…Chinese Communist Party among young American  students.\n\nWith passage of the PROTECT Our Kids Act, schools that refuse to  confront this reality will no longer be eligible for Federal funds,  full stop. The message is straightforward and simple to education  administrators who don't understand the concept of American patriotism.  This behavior will not be…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697528/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…the country.  President Trump recognizes the importance of school choice, issuing an  executive order directing the Department of Education to guide States  on how to use Federal funds for K-12 scholarship programs.\n\nIt also instructs the Education Secretary to prioritize school choice  when awarding discretionary grants. That is real leadership focused…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689153/advancing-america-first-policies"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…2022, Congress passed the Research and Development, Competition,  and Innovation Act as part of the CHIPS and Science Act. That bill  prohibited researchers who receive Federal funds from participating in  malign foreign talent recruitment programs in which foreign countries  incentivize or compensate researchers for activities that present a  conflict…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688932/united-states-research-protection-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…community colleges.\n\nWhat they were instead were scams, individuals who were trying and  succeeding in committing financial aid fraud, siphoning more than $10  million in Federal funds and millions more in State aid, according to  the California community chancellor's own office.\n\nWe have asked the Attorney General and the Secretary of Education to  look…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…pipeline by expanding K through 12 students' exposure to accounting  programs. As with other areas of STEM education, this bill would  qualify accounting instruction for Federal funds. This recognition  aligns with the increasing need for accounting professionals to have  high-level math and technology skills, including the ability to analyze  big data,…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699755/9999"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…Republic of China or any of its related government entities.\n\nI want to thank Representative Rouzer, leader on the T&I Committee,  for his work on this legislation that ensures Federal funds can be used  to counter threats posed by our Nation's adversaries.\n\nMr. Speaker, I urge support of this legislation, and I reserve the  balance of my time.\n\nMr. EZELL.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692200/maritime-supply-chain-security-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…may have some potential relation to  someone's health, but they fall far outside the scope of what Medicaid  is intended for. They open the door for States to draw down Federal  funds or for services that are oftentimes entirely funded by the  States.\n\nIn 2023, as the then-subcommittee chairman for Energy and Commerce's  Health Subcommittee, I raised…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}]