[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…with protecting our  elections.\n\nSo, yes, over the next hour, with my Democratic colleagues, we will  peel  back the curtain on the tactics being used to undermine our Federal  elections, because our fundamental democracy is at stake.\n\nIn Rochester Hills, MI, Republican clerk Tina Barton worked hard to  help administer and uphold a free and fair election…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…times more billionaire spending in our elections now that billionaires  can pump money in by the millions. Just 100 families poured a  recordbreaking $2.6 billion into Federal elections in 2024. I don't  know how democracy survives in an environment in which 100 superwealthy  families are dumping $2.6 billion in special interest spending,  influence…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699104/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…dangerously flawed,  designed to create confusion and chaos in our electoral system rather  than strengthen it.\n\nThe SAVE Act claims to prevent noncitizens from voting in Federal  elections. At first glance, that may seem logical, if not for the fact  that it is already illegal and has been for decades. Noncitizens caught  voting in Federal elections already…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689394/gop-creating-chaos-in-electoral-system"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…clear; this bill is not simply a voter ID bill and  labelling it as such is a trick to convince Americans of its intent. It  is already illegal for noncitizens to vote in federal elections. Now,  Republicans want to force every American to provide burdensome and  expensive ``documentary proof of citizenship''--similar to what  Minnesotans already rejected--in…", "date": "2026-02-13", "source_url": "https://justfacts.votesmart.org/public-statement/1700083/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…promptly repealed by mandating the immediate repeal of the       provision of federal law that provides the current mechanism       for District residents to participate in federal elections.\n\nIn 1961, following the adoption of the Twenty-Third       Amendment, Congress exercised its enforcement authority by       enacting legislation (codified at 3 U.S.C.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Oakland, California, Montpelier, Vermont, and a number of       jurisdictions in neighboring Maryland. It continues to be       unlawful for non-citizens to vote in federal elections in the       District. In fact, federal law has prohibited non-citizens       from voting in federal elections since 1996. Our local law       cannot and does not attempt…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692373/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…repealed by mandating the       immediate repeal of the provision of federal law that       provides the current mechanism for District residents to       participate in federal elections.\n\nIn 1961, following the adoption of the Twenty-Third       Amendment, Congress exercised its enforcement authority by       enacting legislation (codified at 3 U.S.C.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Massive purges would inevitably remove many American citizens from  the voter rolls, and it is already wholly unnecessary. Federal law  prohibits noncitizens from voting in Federal elections. It is done with  one purpose in mind: voter suppression.\n\nWhat they have in mind is they think those that vote Democratic are  less likely to vote than Republicans if…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690523/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…serve the American people.\n\nIf you just look back at the past couple of decades since Citizens  United, since 2010--in 2010, in that cycle, $3.6 billion in total cost  of Federal elections by election cycle, then it goes up to $6.3  billion. By 2022 it is at $8.9 billion. By 2024 it is at $15.9 billion.\n\nThis past cycle was a record high. Again, all of…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…council, the State  Board of Education, attorney general, advisory neighborhood  commissioner, and ballot measures.\n\nThe D.C. law does not allow noncitizens to vote in Federal elections,  which is a crime under Federal law.\n\nRegardless of your views on the merits of noncitizen voting for local  elections, we have to acknowledge that D.C. is not the first…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692318/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…commonsense, simple bill, but I want you to remember a very few  important facts while he is talking.\n\nFirst of all, it is already illegal for noncitizens to vote in  Federal elections, period, full stop. If noncitizens are voting in  Federal elections, they should be prosecuted. We don't disagree on  that.\n\nSecond, nobody disputes the fact that voters…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…require Minnesotans and every American to provide burdensome  ``documentary proof of citizenship''--similar to what Minnesotans  already rejected--in order to participate in federal elections.  Standard REAL IDs, Tribal IDs and military IDs alone do not meet this  bill's extreme criteria. Married women or others whose name doesn't  match their birth certificate…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690125/safeguard-american-voter-eligibility-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…repealed by mandating the       immediate repeal of the provision of federal law that       provides the current mechanism for District residents to       participate in federal elections.\n\nIn 1961, following the adoption of the Twenty-Third       Amendment, Congress exercised its enforcement authority by       enacting legislation (codified at 3 U.S.C.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…Act, which would make it  harder for millions of Americans to cast their ballots.\n\nMr. Speaker, the facts are clear: It is already illegal for  noncitizens to vote in Federal elections, or in any elections. In fact,  under current law, noncitizens would face up to 5 years in prison for  attempting to vote in Federal elections and would even risk being…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689343/fighting-voter-suppression"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…unquestionably, unconstitutional. The Framers could  not have been more clear. Article I, section 4 of the Constitution  places the times, the places, and the manner of Federal elections in  the hands of the States, not in the hands of the President, not the  White House, not in an Executive order. There is no clause in the  Constitution or law on the…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700022/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…line is that Americans expect that only American citizens,  and not the 12 million illegal aliens who entered under the last  administration, are going to be voting in Federal elections.\n\nAmericans expect it, and they expect Congress to do something about  it. Mr. Speaker, I urge Congress to take action and pass the SAVE Act.", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689429/laws-have-loopholes"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…ROY. The good people of Arizona have two systems in place: They  check for citizenship for State and local elections, and they are  unable to check for citizenship in Federal elections. The point of this  bill is to ensure that we guarantee only citizens vote by allowing  those States to be able to check, by having systems, Federal systems be  open…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690006/safeguard-american-voter-eligibility-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…from noncitizen voters. This  week, the House will vote on the SAVE Act, legislation that strengthens  our election laws by requiring proof of citizenship to vote in Federal  elections.\n\nThe SAVE Act also requires States to create a program to remove  noncitizens from existing voter rolls. Ensuring safe and secure  elections should not be a controversial…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689357/securing-our-elections"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…identity theft offenses, including receiving rental assistance, Social  Security, and SNAP benefits, as well as voter fraud under stolen  identity, voting in several Federal elections, including the 2024  Presidential election, this is a real problem in Massachusetts right  now. I would argue that we need to pass this legislation to actually  take…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699944/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…SAVE America Act does not  federalize our elections. Article I, section 4 of the Constitution  makes clear that while States determine the time, place, and manner of  Federal elections, the Congress ``may at any time by Law make or alter  such Regulations''; that is, we in the Congress, in this body, have the  constitutional authority to set certain…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…citizenship. Why? It is  blatant hypocrisy, and the American people see right through it.\n\nThe SAVE Act ensures that only American citizens can register to vote  and vote in Federal elections. It protects the integrity of our system  and restores faith in democracy. In fact, in Iowa, every single time we  have passed election integrity laws, the percentage…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689398/supporting-american-elections"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Number one, everyone who shows up to vote in a Federal election will  have to show their photo ID.\n\nNumber two, States will only register American citizens to vote in  Federal elections.\n\nNumber three, States will actually have to remove noncitizens from  the voter rolls.\n\nEvery American--Republican, Democrat, or unaffiliated--wants to know  that their…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…literacy because Democrats have not read  the resolution. That much is clear.\n\nThis resolution is very simple. It ensures that only American  citizens can vote in our Federal elections. This isn't hard. Eighty- seven percent of Americans agree that only Americans should vote in our  elections.\n\nMr. Speaker, it makes me wonder why my friends on the other…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690009/safeguard-american-voter-eligibility-act"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…with citizens only.\n\nMr. Speaker, let's cut the crap. Right now, people can walk up, check  a box claiming that they are a citizen, and, boom, they are registered  for Federal elections with no proof and no ID.\n\nThat is not a system built on trust. It is a system vulnerable to  error, fraud, and exploitation.\n\nIn Colorado, the process was just expedited…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689994/safeguard-american-voter-eligibility-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…has been some confusion. It prohibits noncitizens  from voting.\n\nIt does so by requiring States to obtain proof of citizenship when  registering individuals to vote in Federal elections. Even though most  States prohibit noncitizens from voting in their elections, these  noncitizens are still registered to vote in some States and in some  cities around…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…of legislation concerning election  integrity in our country's history. S. 1383, the SAVE America Act, will  require voters to present photo identification to vote in Federal  elections and to provide proof of U.S. citizenship when registering to  vote.\n\nPublic opinion overwhelmingly supports this legislation, and it is  our duty to adhere to the will…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699936/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…first, I think it is something we should pay a great deal of  attention to.\n\nAbout 6 years ago, in this body, an amendment was offered allowing  16-year-olds to vote in Federal elections. Well over half the Democrats  voted in favor of 16-year-olds. Why would one want to do that?\n\nMr. Speaker, 16-year-olds have nowhere near the wisdom and experience…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693920/comatose-press-corps"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…the other side of the aisle:  American elections are for Americans.\n\nThe SAVE Act restores this vital principle by requiring proof of  citizenship and identity in the Federal elections that affect every  American. Americans should pay close attention to this vote, for it  will reveal those who would subvert their vote to foreign nationals.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690012/safeguard-american-voter-eligibility-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…give registration forms to everyone who receives a  driver's license, regardless of citizenship.\n\nThe bill before us will help States prevent noncitizens from voting  in Federal elections by requiring States to obtain documentary proof of  U.S. citizenship in person when registering an individual to vote in  Federal elections.\n\nMr. Speaker, you are sure…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "…dilution is vital to  determining the rightful winner.\n\nThis legislation is straightforward. It requires proof of citizenship  for voter registration and voter ID for Federal elections. It ensures  only American citizens participate in American elections and provides  States with tools to determine and verify the citizenship and maintain  accurate voter…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700015/veterans-accessibility-advisory-committee-act-of-2025"}]