[{"senator": "John Larson", "party": "Democrat", "sentence": "…especially alarming, Mr. Speaker, is now Mr. Musk--an  unelected official who operates outside of government, who doesn't need  to be approved by the Senate, who is neither a Federal employee nor a  volunteer, he has the ear of the President of the United States and can  get all the statistics and data that he wants--is currently going after  Social Security…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687913/social-security-is-an-earned-benefit"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…confirmation or congressional  creation of the agency or any confirmation of Elon Musk.\n\nMr. Speaker, I will remind you that the entire time that Elon Musk  was in office or as a Federal employee, he was, in fact, exercising  powers that were far greater than any special government employee would  be allowed to have. He was exercising powers that would be at the…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…dollars to Socorro, New  Mexico. This isn't just about jobs. It is about the future of our  communities, and what is happening is reckless.\n\nMadison, a former probationary Federal employee in Carlsbad, New  Mexico, told me: I lost my dream job on February 14. Many of us had  moved hours away from our families to serve. In Carlsbad alone, the  government…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687984/dire-consequences-of-funding-freeze-and-mass-firings"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…me like the President should be bringing people  together.\n\nLast night, one of my constituents from Albuquerque, NM, shared with  me that she had been furloughed as a Federal employee. She told me she  didn't know how she was going to pay this month's bills without a  paycheck. She felt that President Trump was doing nothing to end the  shutdown, and…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, I rise today because I got this message from  an Oregonian named Donna. She says: ``Please fight to protect Federal  employee retirement benefits. They should not be slashed. Federal  employees are currently putting up with so much to keep this country  running.\n\n``Immediately reducing our pay…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691729/federal-employees"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, I introduce the Thrift Savings Plan  Emergency Withdrawal Act of 2025, which would expand the circumstances  in which a federal employee recently separated from the federal  government can take a penalty-free withdrawal from their Thrift Savings  Plan (TSP) account. This bill would help former federal employees…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698468/introduction-of-the-thrift-savings-plan-emergency-withdrawal-act-of-2025"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…men. It is also one of the deadliest. This bill would direct the GAO to  report on key issues relating to esophageal cancer, including Federal  spending for it under the Federal Employee Health Benefit Program and  the screening rates among high-risk individuals within that program.  This bill will hopefully offer some significant amount of help in the…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691833/gerald-e-connolly-esophageal-cancer-awareness-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Interference Act, which would  prohibit the relocation outside of the National Capital Region (NCR) of  the headquarters for any federal agency located in the NCR or any  federal employee position with a duty station in the NCR. Last week,  the Trump administration directed federal agencies to submit ``proposed  relocations of agency bureaus and offices…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688344/introduction-of-the-protecting-federal-agencies-and-employees-from-political-interference-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…control their National Guards.\n\nThe Commanding General of the D.C. National Guard is the top official  in the D.C. National Guard, is appointed by the president and is a  federal employee. There are residency requirements for government  officials in federal law, D.C. law and the laws of jurisdictions  throughout the country. In fact, several states have…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694307/introduction-of-the-district-of-columbia-national-guard-commanding-general-residency-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…that my colleagues and all Americans can read it and  reflect on the enormity of President Trump's attack on the federal  workforce.              What it is Like to be a Federal Employee in 2025\n\n(Commentary published in the Federal News Network on June 13, 2025)\n\nI remember driving with my father down Rockville Pike in       Bethesda, Maryland as a little…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Information.--The       Secretary may disclose information described in subsection       (a)--\n\n``(1) if disclosure is ordered by a court;\n\n``(2) if the information is used by a Federal employee--\n\n``(A) for enforcement; or\n\n``(B) in support of the homeland and national security       missions of the Coast Guard as defined in section 888 of the       Homeland…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691006/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…weaponized to sabotage what Americans  had voted for. On their way out the door, lameduck Biden administration  officials signed collective bargaining agreements with Federal employee  union bosses specifically designed to tie the hands of incoming  President Trump.\n\nIn January, at our very first hearing this Congress, the House  Committee on Oversight…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…the Department of Homeland       Security who is engaged in the protection of Federal property       pursuant to section 1315 of title 40, United States Code, as       a Federal employee.\n\nMr. BARRETT.  3425, as amended.\n\nMr. Speaker, H.R. 3425, the POST Act of 2025, strengthens the Federal  Protective Service, or FPS, and their ability to secure Federal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695058/personnel-oversight-and-shift-tracking-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…States shall       submit a report to Congress that includes an evaluation of--\n\n(1) the total impact of esophageal cancer-related health       care spending under the Federal Employee Health Benefits       Program for Federal employees and retirees diagnosed with       esophageal cancer; and\n\n(2) how often individuals covered under the Federal…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691831/gerald-e-connolly-esophageal-cancer-awareness-act-of-2025"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "Ms. COLLINS. Mr. President, Members of Congress understand the needs  of our constituents far better than any well-intentioned Federal  employee located here in Washington.\n\nThe CDS projects provide funding for States, communities, and  nonprofit organizations. The process is completely open and  transparent.…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699433/consolidated-appropriations-act-2026"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…our conference to adding furloughed workers.\n\nSo we have completely amended the bill now. We have added furloughed  workers.\n\nIn the meantime, surprising to me, we had Federal employee worker  unions reach out to us, asking what they could do to help pass this  bill. They are sick and tired of being used as pawns in this political  dysfunction here.…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…people govern.''\n\nAll 2.4 million employees in the Federal workforce exercise powers  delegated by the President through our Constitution by virtue of his  election. Any Federal employee who doesn't respect the authority of the  people and the President they elected has no business working for them.", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688585/yosemite-belongs-to-the-people"}]