[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "However, the implementation and enforcement of this bill requires a  strong, independent, and bipartisan Federal Trade Commission.", "title": "Wastewater Infrastructure Pollution Prevention and Environmental Safety Act", "date": "2025-06-23"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "However, this administration and extreme  Republicans have offered no real plans, no real solutions, just more  empty promises with painful cuts and a whopping Federal deficit  increase looming on the horizon.", "title": "Voters Sent Us to Congress to Lower Costs", "date": "2025-03-25"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "Senator Carper knows the value of providing Federal support for  solutions that help more Americans receive healthcare in the setting  they prefer: their own homes.", "title": "Hospital At Home Program", "date": "2026-02-02"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "I worked my way through community college, university, and law school  with grants, loans, and work study, so I understand the importance of  federal financial aid.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "They are trying to tell us that, well, we have to make cuts to  Medicaid or other important programs in the Federal Government.", "title": "Terminating the National Emergency Declared to Impose Duties on Articles Imported From Canada", "date": "2025-04-02"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "The Founders thought that Federal law would be strictly limited in two  different ways: one, according to the subject matter; and two,  according to number.", "title": "Count the Crimes to Cut Act", "date": "2025-12-01"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "That was the decision to eliminate the Federal support for  public broadcasting--National Public Radio and public television.", "title": "Rescissions", "date": "2025-07-21"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "FEMA gets $5.7 billion, including $3.8 billion for Federal  assistance, which is a 20-percent increase above fiscal year 2025.", "title": "Department of Homeland Security Appropriations Act, 2026", "date": "2026-01-22"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "His  dedication to fighting fraud, waste, and abuse has helped shape the  federal civil service for more than half a century.", "title": "Commending the Honorable Gene Dodaro", "date": "2025-12-19"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "The Salvation Army continues to be a trusted partner at the local,  State, and Federal levels, providing critical services that address  poverty, hunger, and natural disasters.", "title": "National Salvation Army Week", "date": "2025-05-12"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "These cuts also mean and  include cuts to Federal jobs.", "title": "Better is Possible", "date": null}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "This legislation would direct the Federal  Communications Commission to establish a process to more thoroughly vet  internet service providers participating in the Universal Service  Fund's high-cost program.", "title": "Rural Broadband Protection Act of 2025", "date": "2025-04-28"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "When a small business owner submits a proposal to work with the  Federal Government, they invest considerable time and resources into  making their submission the best it can be.", "title": "Transparency and Predictability in Small Business Opportunities Act", "date": "2025-06-03"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "The WOSB Accountability Act will continue this work  by moving the Women-Owned Small Business Federal Contract Program to  full SBA certification.", "title": "Wosb Accountability Act", "date": "2025-06-03"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "ENFORCEMENT BY THE FEDERAL TRADE COMMISSION.", "title": "Informing Consumers About Smart Devices Act", "date": "2025-04-28"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "Peter is retiring  later this month after nearly 30 years in federal law enforcement.", "title": "Recognizing St. Paul, Minnesota Immigration and Customs Enforcement Field Office Director Peter Berg", "date": "2025-06-23"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "My constituents are facing an energy crisis in no small part due to  the skyrocketing costs of utilities in Colorado,  and that has happened during the last 4 years under Democrat control  both at the Federal and the State level.", "title": "State Planning for Reliability and Affordability Act", "date": "2025-12-10"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "Speaker, I point out that in 2005, 18 of the 21  members of a bipartisan Federal commission headed by former President  Jimmy Carter and former Secretary of State James Baker came out in  support of photo ID requirements more stringent than what Indiana had  at that time.", "title": "Providing for Consideration of S. Veterans Accessibility Advisory Committee Act of Providing for Consideration of H.R. Law- Enforcement Innovate to De-Escalate Act; Providing for Consideration of H.R. Undersea Cable Protection Act of and Providing for Consideration of H.R. Securing America's Critical Minerals Supply Act", "date": "2026-02-11"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Right now, there are many Federal programs.", "title": "The Big, Beautiful Bill", "date": "2025-05-15"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "They bring  together the expertise of our universities with the experience of  State, local, and Federal land managers.", "title": "Utah Wildfire Research Institute Act of 2025", "date": "2025-12-15"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "This accounts for the Federal lands that reduce the  tax base of counties and boroughs across the country.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Centers for Medicare Medicaid Services Relating to ``Patient Protection and Affordable Care", "date": "2026-01-13"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "Speaker, I thank the gentleman from North  Carolina for his work on this bill and the bipartisan work from the  Subcommittee on Crime and Federal Government Surveillance, which has  worked on this, and I appreciate that very much.", "title": "Child Predators Accountability Act", "date": "2026-01-12"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "Council from gutting  sentencing laws, reclaiming Congress' constitutional oversight over  this Federal District, as it should be.", "title": "DC Criminal Reforms to Immediately Make Everyone Safe Act", "date": null}, {"senator": "John Rutherford", "party": "Republican", "sentence": "It aligns with President Trump's agenda to close our border and  supports local, State, and Federal law enforcement officers that are  deporting dangerous criminal aliens out of our communities.", "title": "Department of Homeland Security Appropriations Act, 2026", "date": "2026-01-22"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Now, States can use a program named the Systematic  Alien Verification for Entitlements to verify that only citizens are  voting in the Federal elections.", "title": "Voting", "date": "2025-12-08"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Unfortunately, after decades of cooperative engagement between the  University of Utah and the Federal Government, there have been  questions as to whether the longstanding activities at Research Park  are consistent with the original land patent under the Recreation and  Public Purposes Act.", "title": "University of Utah Research Park Act", "date": "2025-12-15"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "They knew when we  had a partnership with Federal prosecutors in St.", "title": "-9999", "date": "2026-02-12"}]