[{"senator": "Shontel Brown", "party": "Democrat", "sentence": "…really costs is paid for by underserved  students and their families, because without the protections and  funding provided by IDEA, more students are left behind. Without  federally supported services that help with early detection, children  are less able to navigate a world that wasn't built for them.\n\nIDEA doesn't provide special treatment. It provides…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698947/protecting-education-for-children-with-disabilities"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…substance  abuse and addiction, basically to better understand the causes of  addiction and identify treatments and interventions that reduce  overdoses.\n\nTrump also halted all federally funded programs that provide critical  opioid-related services, including federally qualified health centers,  which serve a high proportion of patients disproportionately…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…including the State I live in and  represent, California, have already prohibited subminimum wages for  workers with disabilities. Good for them. These subminimum wage laws  federally have been used to justify paying people just a few cents per  hour for work.\n\nThe U.S. Commission on Civil Rights and the National Council on  Disabilities have called for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695575/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…grandparents, and her siblings. She had to move to go to high school,  becoming an educator herself, eventually running the TRiO Programs at  Virginia State University. These are federally funded programs run by  the Department of Education to work to ensure that children like her  have the support they need to go to and graduate college.\n\nMy parents understood…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…our housing code, and defending District agencies       and officers when they are sued. In no other place in the       United States are such local issues determined by a federally       appointed person with no local accountability. The proposed       legislation would be especially undemocratic in light of the       fact that, in 2010, an overwhelming…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…NORTON. Mr. Speaker, this week, I introduced a bill that would  exempt from Federal Government shutdowns the Federal and independent  agencies that are exclusively or primarily federally funded but have  jurisdiction over local District of Columbia civil and criminal justice  matters. This bill is modeled on a provision I have gotten enacted each  year since…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695983/introduction-of-a-bill-to-provide-for-interim-appropriations-for-the-district-of-columbia-courts-and-related-agencies-with-respect-to-any-fiscal-year-for-which-appropriations-are-not-otherwise-provided-for-such-courts-and-agencies"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…better, Mr. Speaker. You have to get up,  you have to get out, and you have to talk to somebody. You have got to  exercise. You have to seek help. You have got to dial 9-8-8, a  federally funded program that is manned 365 days a year and 24 hours a  day. You can pick up the phone and talk to someone anonymously. You  don't have to give your name, where you…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…recommend improvements to these letters, which often  contain complex legal language that confuses veterans.\n\nThe bill also sets deadlines for action: The VA must contract with a  Federally Funded Research and Development Center, or FFRDC, to evaluate  these communications within 30 days of the bill's enactment and submit  its recommendations within 90 days.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689677/clear-communication-for-veterans-claims-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…That is why I urge my colleagues to not only pass this  bipartisan legislation but also to continue to advocate for its  implementation.\n\nJust a few weeks ago, I visited a federally qualified health center  in my district. It is called the I Promise Health Quarters, which is  supported by the LeBron James Family Foundation. In a meeting with the  behavioral…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691943/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…coverage.\n\nThese cuts will have a resounding impact on individuals and the  healthcare industry and economy as a whole. Safety net hospitals like  Montefiore in my district and federally funded clinics like Boriken in  East Harlem face having to eliminate services or completely close.\n\nFamilies, seniors, and children who go to these clinics and hospitals…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696743/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, I introduce the Marijuana in  Federally Assisted Housing Parity Act. This bill would permit the use  of marijuana in federally assisted housing, including public housing  and Section 8 housing, in compliance with…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698317/introduction-of-the-marijuana-in-federally-assisted-housing-parity-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…a military ID, costs money. I will give you some examples.  The Real ID costs about $42. These are all numbers that I have gotten  based on research in either my State or federally.\n\nA passport costs $130. A birth certificate from a State agency is $12  in Virginia. A consular report of birth abroad is $100. A certificate  of citizenship is $1,385.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689341/fighting-voter-suppression"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…our housing code, and defending District agencies       and officers when they are sued. In no other place in the       United States are such local issues determined by a federally       appointed person with no local accountability. The proposed       legislation would be especially undemocratic in light of the       fact that, in 2010, an overwhelming…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…beautiful but often  mean a long drive to the hospital, I know that preserving rural  healthcare access is literally life and death in our communities.\n\nTribal health clinics, federally qualified health centers, rural  hospitals, and independent providers are facing challenge upon  challenge upon challenge. At Grays Harbor Community Hospital, I saw  firsthand…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696873/preserving-rural-healthcare-access-is-literally-life-and-death"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…January 16, 2026.                                    digest\n\nIn March 2025, the National Credit Union Administration       (NCUA) announced that it would no longer require federally       insured credit unions with more than $1 billion in assets to       disclose income from overdraft and non-sufficient funds fees,       and NCUA therefore ceased publishing…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…of the House Appropriations Committee, I am proud of the  work that we have done to provide robust funding for the Indian Health  Service and other critical priorities for federally recognized Tribes  in the fiscal year 2026 Interior appropriations bill.\n\nIf the Tribal population eligible for these services suddenly grows  by tens of thousands of people,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697785/ensuring-fairness-and-integrity-in-federal-tribal-recognition"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…counterintelligence risks, if       any, to commercial spaceports and distribute the assessment       to each FBI field office in an area of responsibility which       includes a federally-licensed commercial spaceport and the       leadership of each federally-licensed commercial spaceport,       in coordination with the Office of Commercial Space       Transportation.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698262/explanatory-statement-for-the-intelligence-authorization-act-for-fiscal-year-2026"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…agency made it clear the  project was not a priority and lacked the resources to complete it.\n\nWabeno is located in Forest County, where roughly 50 percent of the  land is federally owned and only about 10 percent of the land is fully  taxable, so there is limited private land available for small business  expansion.\n\nWe often talk up here about how…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694030/wabeno-economic-development-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…Water Resources Development Act of 2024 (40 U.S.C.       584 note), the Administrator of the General Services       Administration shall--\n\n(1) collaborate with tenants of federally-leased space to       better identify concerns among Federal agencies around       shared-space arrangements;\n\n(2) work to develop a criteria that would facilitate the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695013/shared-property-agency-collaboration-and-engagement-act-of-2025"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…businesses. This is obviously no secret.\n\nUnder current law, the U.S. Department of the Treasury can postpone  tax filing deadlines for taxpayers who have been affected by federally  declared disasters, but right now, Treasury does not have the authority  to provide relief for State-level declarations.\n\nState-level declarations are normally issued immediately…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689382/filing-relief-for-natural-disasters-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…statement opposing this  override, claiming it continues failed policies of the past and burdens  taxpayers with a local water project. This is not a new water project.  It is a federally authorized water system underway for decades with  consistent bipartisan congressional support. This exact project was  previously celebrated by this President himself. On…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698701/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…authorizes the Treasury Department, in consultation with FEMA, to  postpone tax filing deadlines for Americans living in State-declared  disaster areas just as they do for federally declared disasters.\n\nIf a State moves faster in declaring an emergency, the Treasury  Department can more quickly respond when it comes to an individual's  tax obligations.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689383/filing-relief-for-natural-disasters-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…beginning just 3 days later on July 8. Pretty doggone  quick.\n\nThe ROD calls for higher flows at the dam to combat the presence of  predatory smallmouth bass which threaten the federally protected  humpback chub. These higher flows bypass hydropower generators in order  to cool the river temperature below the dam in an attempt to disrupt  smallmouth bass…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691059/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…radius from current development--over 90 percent of North Dakota's  affordable, reliable coal, out of touch. It is gone.\n\nIt also blocks 213,000 acres, or 44 percent, of federally owned oil  and gas acreage from future development. This restriction alone  deprives the State--and we are a small State--of $34 million annually  and--get this--the State's…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696136/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Wisconsin (Mr. Steil).\n\nMr. Speaker, this bill, the GENIUS Act, and the bill we debated a few  minutes ago, the CLARITY Act, are all about consumer protection. There  are no rules federally across the board in the digital asset space at  all now. That is why we have seen consumers hurt by the lack of a  regulatory framework. I have to say, Mr. Speaker, in total…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693834/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the administration in  connection to an investigation of Jeffrey Epstein, which the  President's administration in 2019 indicted Epstein. They actually  moved forward and federally indicted him in 2019. Ghislaine Maxwell was  arrested by the Trump administration.\n\nI know the gentleman from Maryland will go on to say that the Biden  administration then…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696887/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…deductions, and even the  increased standard deduction, meaning that D.C. taxpayers who do not  itemize their tax deductions will not be able to claim the full amount  of the federally expanded standard deduction in their local tax  returns. In addition, individuals who take the standard deduction will  not be afforded an additional charitable deduction…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…small business than  National Beef Month?\n\nWhat began as a small downtown grocery store in 1932, Alewel's has  grown into a fixture of Warrensburg's local community.\n\nThis federally inspected meat processing and retail facility  developed old German recipes to create quality fresh meats and homemade  specialty products.\n\nRandy Alewel, the third-generation…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691505/recognizing-winners-of-2025-fourth-district-congressional-speech-competition"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…entity.--The term `eligible entity' means       any of the following:\n\n``(A) An institution of higher education.\n\n``(B) An appropriate State or Federal entity, including a       federally funded research and development center of the       Department.\n\n``(C) A nonprofit research institution.\n\n``(D) A private entity.\n\n``(E) Any other relevant entity the Secretary…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Federal agencies.\n\nSection 401 of the Clean Water Act has turned into a procedural  chokepoint with varying application and drawn-out State reviews,  undermining otherwise federally authorized projects.\n\nThis has resulted in energy shortages in certain areas of the  country, exposing consumers to high prices and our grid to increased  vulnerability.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698073/improving-interagency-coordination-for-pipeline-reviews-act"}]