[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…(defined as the ``Capital'') will fall outside of       the boundaries of the new State and remain under federal       jurisdiction. The Act also repeals the provision of federal       law that establishes the current mechanism for District       residents to participate in presidential elections, pursuant       to Congress's authority under the Twenty-Third…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…education plans, services, and due process  protections. These are real students whose ability to learn,  communicate, and thrive depends on fulfilling the promises made in  Federal law.\n\nThose promises are enforced, overseen, and protected by the  Department of Education.\n\nThe Department plays an essential role in ensuring that IDEA is  implemented fairly…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698937/protecting-education-for-children-with-disabilities"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…of Columbia Pretrial Services Agency (PSA), to reside in the  District of Columbia during their terms. There are residency  requirements for government positions in federal law, D.C. law and the  laws of jurisdictions throughout the United States. The primary reason  such laws exist is to ensure that certain government officials have a  connection to…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690239/introduction-of-the-requirement-of-the-director-of-the-court-services-and-offender-supervision-agency-for-the-district-of-columbia-and-the-director-of-the-district-of-columbia-pretrial-services-agency-to-reside-in-the-district-of-columbia"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the top official  in the D.C. National Guard, is appointed by the president and is a  federal employee. There are residency requirements for government  officials in federal law, D.C. law and the laws of jurisdictions  throughout the country. In fact, several states have laws that require  the top official in their National Guard to reside in the state,…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694307/introduction-of-the-district-of-columbia-national-guard-commanding-general-residency-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…section 766, as a State representative--one of my first votes in my  career. That bill then became the law for the entire country.\n\nIn the decades since the IDEA became Federal law, students, parents,  educators, administrators, and support staff have worked tirelessly to  deliver the promise of a world-class education to millions of students  with…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697522/50th-anniversary-of-individuals-with-disabilities-education-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, I introduce a bill that would make a  small but respectful change to federal law by adding the Mayor of the  District of Columbia to the list of named principals for whom the  President shall order the U.S. flag be flown at half-staff. Current law  states…", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692567/introduction-of-a-bill-to-permit-the-flag-of-the-united-states-to-be-flown-at-half-staff-in-the-event-of-the-death-of-a-mayor-of-the-district-of-columbia"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…corrupt, and harmful  starts to a Presidency in modern history. Before our very eyes, the man  who occupies the Oval Office is destroying the foundations of our  democracy.\n\nFederal law enforcement is arresting people with little due process,  even going as far as arresting a judge in Wisconsin. At least four U.S.  citizens--all of them children, two suffering…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690262/trump-administration-first-100-days"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…helped Mr.  Barron win re-election in 2018, and he continued serving in the General  Assembly through October 2021, when the United States Senate confirmed  him as the chief federal law enforcement official in the great state of  Maryland.\n\nWhen he took his oath of office, Mr. Barron became the first African  American to serve as Maryland's United States…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688210/recognizing-a-trailblazing-career-in-criminal-justice-us-attorney-erek-lawrence-barron"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…rightwing media,  but the fact of the matter is it is not true.\n\nSanctuary policies do not mean that there are no laws or that the  Federal Government can no longer enforce Federal law in those  jurisdictions. What sanctuary policies are is simply an affirmation  that immigration enforcement is the job of the Federal Government and  that State and local…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…education--is a dangerous attack on our democracy that will damage our  people, communities, and country.\n\nGiven that education is a key factor in economic well-being, federal  education law promotes equity and access so that students from various  backgrounds can thrive. President Trump, with the help of Elon Musk, is  gutting the Department of Education…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690128/alarm-at-the-trump-administrations-dangerous-attack-on-education"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…in their respective States. To       assist State agencies with the massive changes, USDA will       have staff available for technical assistance.\n\n27. As is required by Federal law, after receiving notice       from FNS, State agencies must recode their eligibility       systems to adjust for the reduced maximum allotments. See 7       C.F.R. 271.7(d)(1)(ii);…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…(defined as the ``Capital'') will fall       outside of the boundaries of the new State and remain under       federal jurisdiction. The Act also repeals the provision of       federal law that establishes the current mechanism for       District residents to participate in presidential elections,       pursuant to Congress's authority under the Twenty-Third…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…barriers that would  disenfranchise millions of Americans. This bill would also increase the  purges of registered voters, literally kicking people off the list.\n\nVery clearly, Federal law already prohibits noncitizens from voting  in Federal and State elections. Over 21 million Americans lack easy  access to the documents this law would require for voter…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689318/voter-suppression-plain-and-simple"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…However,  mandatory pretrial detention based solely on a charge is  unconstitutional and financial conditions for pretrial release  criminalize poverty.\n\nNeither D.C. nor Federal law requires pretrial detention or financial  conditions for pretrial release, but both laws permit each. Under both  D.C. and Federal law, pretrial release and detention are…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696979/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…introducing the Stop Body Camera Paywalls Act to  prevent any State or unit of local government that creates a paywall  for access to these public records from receiving Federal law  enforcement grants.\n\nAgain, we must make sure that we have transparency, especially when  it comes to Federal law enforcement grants. This bill is a necessary  step in…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698994/stop-body-camera-paywalls"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…groups doing that.\n\nI watched that Lakota helicopter that I mentioned before. That Lakota  helicopter is actually a military helicopter. Their job is not to  arrest. That is Federal law enforcement on the ground who is doing it,  but they are able to be an extra set of eyes in the air to be able to  identify folks that are getting around those gaps in the…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…for Alaska, as well as the  Trump administration.\n\nI urge my colleagues to reject unlawful regulatory overreach,  reinforce American mineral and energy security, and uphold Federal law  and Alaska Native land rights by supporting the Alaska delegation and  voting for this joint resolution of disapproval and rescinding this  Record of Decision.", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…those  rights.\n\nSpecifically, this resolution recognizes the right to assemble and  protest peacefully, condemns unequivocally the violence perpetrated  against Federal, State, and local law enforcement, calls on local and  State-elected leadership to work with the Federal Government to end the  violent riots and restore peace, and expresses gratitude…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…to pass. The  American soldier needs this bill to pass. Our air traffic controllers  need this bill to pass. The men and women who protect us here in this  Capitol and all Federal law enforcement need this bill to pass.\n\nMr. Speaker, I am one of those who represent a lot of Federal  employees, and they have been without a check for a long time. This is…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…the  appellate court said was not rational.\n\nJudge Boasberg is the one who issued surveillance subpoenas against  Members of this body and the United States Senate, against Federal law,  Mr. Chair. It was against Federal law.\n\nJudge Boasberg issued nondisclosure orders.\n\nMr. BIGGS of Arizona. Mr. Chair, when we see this pattern and we know  that he has…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699047/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…registering noncitizens to vote.\n\nNow, the requirements for voter ID and proof of citizenship in  particular have been twisted and misrepresented. Let me set the record  straight. Federal law mandates that only U.S. citizens may vote.  However, under the Supreme Court's interpretation, voters are not  required to show proof of citizenship. The risk is clear.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…the rates were in 2010 at $215 a month anymore  because under ObamaCare, if you are in the individual market, that is  not allowed anymore. That is absolutely prohibited in Federal law now.\n\nSo we have a very simple proposal: We do want to assist folks who are  stuck in this ObamaCare Marketplace to try to figure out how we help  them through this, but…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…pawns. Because of that, their constituents and,  indeed, nearly 700,000 Tennesseans are without their SNAP benefits.\n\nBorder Patrol agents, our air traffic controllers, and Federal law  enforcement have been working a month now without pay. This is why you  have the AFGE and the controllers union saying: End the Schumer  shutdown now.\n\nWe also know that…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…foreign-born  population, which totals upward of over 50 million people or close to  16 percent.\n\nFact two: While only U.S. citizens are legally eligible to vote in  Federal elections, Federal law actually interferes with and prevents  States from using Federal data to check their voter rolls to ensure  that only citizens are voting, such that we end up in…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…certain land.--The land taken into       trust under paragraph (1) shall not be subject to any       requirements for valuation, appraisal, or equalization under       any Federal law.\n\n(c) Land Management.--Of the land taken into and held in       trust under subsection (b)(1), the portion of the Elwha River       subject to section 3(c)(3) of the Elwha…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697609/lower-elwha-klallam-tribe-project-lands-restoration-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…the `Special       Advisor'), who shall--\n\n``(1) be selected by the Secretary and the Commandant       through a competitive search process;\n\n``(2) have expertise in Federal Indian law and policy,       including government-to-government consultation;\n\n``(3) to the maximum extent practicable, have expertise in       legal and policy issues affecting…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…kind of like, I guess, New York West  or Los Angeles East, they did not see anything worth prosecuting when  you bite off the finger of an ICE agent.\n\nThen we went to the Federal law enforcement, and they convened a  grand jury to indict the person who bit off the finger of an ICE agent,  which you think would be relatively automatic. Nobody argued that…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Federal immigration enforcement. We have also seen a  number of executive orders making it very clear that sanctuary  jurisdictions are unacceptable and are in defiance of Federal law.\n\nIn California, U.S. Attorney Bill Essayli has found a way to  circumvent effectively the sanctuary State using the powers of Federal  law enforcement, so we have come…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…concrete blocks at police, terrorized motorists, and vandalized and  looted local shops.\n\nThe Democratic vice mayor of Cudahy has called on criminal street  gangs to attack Federal law enforcement.\n\nThe Democratic mayor of Los Angeles said that for the riots to stop,  the Federal Government had to stop enforcing Federal immigration law.  You just heard…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693141/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…There is nothing controversial about that. There is nothing  controversial about saying that you should be able to ensure that only  citizens vote.\n\nLet's be very clear: Federal law has currently been interpreted to  prohibit States from being able to check citizenship. That is the  truth. That is why the State of Arizona, for example, has two systems--…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690006/safeguard-american-voter-eligibility-act"}]