[{"senator": "Lucy McBath", "party": "Democrat", "sentence": "…worker in this country should be paid this low. I don't care who  they are. Many States have raised their minimum wages. Unfortunately,  my State of Georgia has not. Without the Federal floor of $7.25,  workers in Georgia could legally be paid just over $5 an hour because  our State minimum wage is just $5.15. Who can live on that?\n\nInstead of trying to find…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698963/tipped-employee-protection-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…largest ag State in the Union. There are a lot of  farmworkers in my district. What happened? One day, we are going about  our business in Santa Ana, Orange County, masked Federal agents start  going into our neighborhoods, picking up hardworking neighbors. Oh,  yeah, you bet, people were concerned, scared, and nervous.\n\nA lot of people expressed their…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693145/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…blackmail  the state of Minnesota with a similar proposition--hand over the voter  rolls and the ICE surge would end. Now, Republicans in the House are  aiming for the same federal seizure of local voter rolls in every state  of our Nation.\n\nThis bill would also disenfranchise millions of women and other  Americans through a federal takeover of state…", "date": "2026-02-13", "source_url": "https://justfacts.votesmart.org/public-statement/1700083/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…fastest increasing cancer among American  men. It is also one of the deadliest. This bill would direct the GAO to  report on key issues relating to esophageal cancer, including Federal  spending for it under the Federal Employee Health Benefit Program and  the screening rates among high-risk individuals within that program.  This bill will hopefully offer…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691833/gerald-e-connolly-esophageal-cancer-awareness-act-of-2025"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…follow the law.\n\nIt is about power unchecked and principles abandoned.\n\nJust yesterday, we also learned of a woman from Oklahoma and her  children, all of them U.S. citizens. Federal agents broke into her  house and took her money. They basically terrorized them and left. If  we let them tear up due process for some, it is a danger to all.\n\nMr. Speaker,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690420/put-hardworking-american-families-first"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…I rise today in opposition to this rule  which allows for consideration of the Republicans' extreme budget that  slashes funding for vital programs like Medicaid, SNAP, and Federal  housing assistance to bankroll $4.5 trillion in tax breaks for  billionaires and big corporations.\n\nLast week, I got a devastating call from Susan who lives in Sandy,  Oregon.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688096/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…families. The waste  is the garbage coming out of people's mouths who don't care about  seniors and say things like it is just a complicated Ponzi scheme. It  is abuse by the Federal Government, abuse of people who worked hard  their entire lives to support themselves and paid into a system that  promised to one day support them.\n\nOur seniors rely on Social…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690424/social-security-administration-is-there-to-help-not-hurt-americans"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Ms. BONAMICI. Mr. Speaker, I rise today to applaud the House passage  of full funding for the Federal Defender Services. This is an issue I  have worked on for years. It affects the overall operation of the  Federal criminal justice system, and it continues to be nonpartisan.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699126/fsgg-federal-defenders-funding"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…been dead for 4 years. The Canadians  are not interested in building energy infrastructure connecting our two  nations thanks to Trump's tariffs, yet this bill would gut the Federal  Government's ability to review the environmental impact of oil and gas  pipelines that cross into Canada and Mexico.\n\nCurrently, the Federal Government reviews the entirety…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…land restoration and  treaty reserved rights, we are doing incredibly meaningful work, not  only alongside the Tribes that we serve, but in service of the  integrity of our Federal Government's commitments.\n\nI also want to extend a special thank you to Chairwoman Frances  Charles of the Lower Elwha Klallam Tribe for testifying before the  committee earlier…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697608/lower-elwha-klallam-tribe-project-lands-restoration-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…that is just what we know about. There is a lot we  don't know about because cryptocurrency literally means hidden money.\n\nIt allows for bailouts under section 13(3) of the Federal Reserve  Act. Jay Powell won't do it, but the next guy will.\n\nCongress won't stop him because crypto spends more in super-PAC than  any other industry by far, five times more…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693774/digital-asset-market-clarity-act-of-2025"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…who are following the rules, all  without warning, charges, or due process.\n\nThis administration is abusing its power to trample on the  Constitution and our civil rights. Federal agents have shot two of my  constituents, one fatally. In the other, when they brought about  charges, the case fell apart and the charges were dropped. That case  was alluded…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697451/fighting-dhs-immigration-raids"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…D.C., and  restrict judges' ability to make individualized sentencing decisions  for young adults. It is a bill that uses the nearly 700,000 residents  of D.C., who pay more federal taxes per capita than any state, as  political pawns.\n\nThis bill is a direct assault on the District's local sovereignty. It  would fundamentally alter D.C.'s criminal justice…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695721/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…care workforce  which will help the collective health of all Nevadans.\n\nThat's why I'm proud to support this program and why, year after  year, I've fought to secure essential federal investments in the  national AHEC program.\n\nOn behalf of my constituents at the Nevada AHEC program, their  national counterparts, and the thousands of Americans who benefit…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689206/recognizing-national-area-health-education-centers-week"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…That is a problem we are still dealing with today. Some of you may know  the story of the Baneberry shot.\n\nLast year, the Nevada Legislature passed a resolution urging the  Federal Government to maintain the moratorium on nuclear weapons  testing. That has been in effect since 1992. They cited risk of  environmental damage and also health hazards from…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699032/expiration-of-new-start"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…the       NTIA with respect to cybersecurity policy matters, including       the evaluation of the impact of cybersecurity matters pending       before the Commission, other Federal agencies, and Congress;\n\n``(I) in addition to the duties described in subparagraph       (H), perform such other duties regarding the policy       responsibilities of the…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693497/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…of this legislation offered by my good  friend and the chairman of the House Oversight and Government Reform  Committee, Representative Comer. This legislation would remove Federal  deed restrictions from a building and the surrounding parcel of land in  Paducah, Kentucky.\n\nFor more than six decades, the Oscar Cross Boys & Girls Club of  Paducah has…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697651/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…here today to disparage electric vehicles, and I am  certainly not here to discourage the manufacturing and the purchasing  of EVs either. What I am concerned about is the Federal Government  dictating which cars and which trucks are acceptable and which are not.  If Americans want to drive an electric or a hybrid car, that is fine.  However, the government--the…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691668/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "French Hill", "party": "Republican", "sentence": "…government  open for those 42 days. Yet, 14 times, Senate Democrats denied funding  to air traffic controllers, denied funding to farm assistance, and  denied funding for all the Federal programs, inconveniencing States,  hurting families, and hurting Federal workers.\n\nFurther, perhaps, unlike some, I certainly gave up my pay for those  42 days by direction…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697143/denouncing-the-horrors-of-socialism"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…support victims of violent crimes through counseling,  advocacy, and recovery services.\n\nImportantly, this fund is financed by fines and penalties paid for by  those convicted of Federal crimes. It is not taxpayer dollars. That  structure reflects that simple, but powerful, idea that accountability  should serve justice.\n\nToday, however, that promise is under…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698844/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…Dakota's energy sector, and it is really a tax on every aspect of our  lives. This tax was the number one concern of the energy stakeholders  in my State.\n\nThis heavy-handed Federal mandate punishes small and midsize  independent producers who are responsible for 90 percent of America's  natural gas. It threatens jobs, raises costs for families, and…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688186/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…agencies; and\n\n(D) produces data used by State and Tribal fish management       agencies to make management decisions regarding Great Lakes       fisheries;\n\n(5) annually, Federal, State, and Tribal agencies stock       approximately 21,000,000 hatchery-produced fish in the Great       Lakes to support--\n\n(A) native species recovery; and\n\n(B) recreational…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693992/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…clearly literacy because Democrats have not read  the resolution. That much is clear.\n\nThis resolution is very simple. It ensures that only American  citizens can vote in our Federal elections. This isn't hard. Eighty- seven percent of Americans agree that only Americans should vote in our  elections.\n\nMr. Speaker, it makes me wonder why my friends on…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690009/safeguard-american-voter-eligibility-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…how we should vote, against CBDC.\n\nThese bills promote free market innovation, protect privacy, and  ensure the next generation of finance is built on American values, not  Federal overreach.\n\nMr. Speaker, I urge my colleagues to support this legislation.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693545/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "Mr. PATRONIS. Mr. Chairman, I thank my friend, Aaron Bean, for  introducing this amendment.\n\nMr. Chairman, after working hard to obtain Federal approval in the  first Trump administration, a weaponized court system pulled Florida's  404 permitting out from under us, even though our program was  thoroughly vetted and…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698027/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…rule allows for essential mergers that drive  innovation, lower operational costs, and benefit consumers. Remember,  this rule was issued without coordinating with any other Federal  agency.\n\nThis is why the smart decision Republicans are making today will  codify and make a strong decision because we finally have true  competition against the big boys…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691497/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…years, our country has maintained both State- chartered and national banks. There are about 5,000 banks; 4,000 of  them are chartered at the State level and only 1,000 at the Federal  level. This system has been the engine for American economic growth,  providing businesses of all sizes with diverse financial services  tailored to local needs.\n\nIn Wyoming,…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691665/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…shortages in the  accounting profession by recognizing accounting as a STEM education  subject and adding accounting education programs as an allowable use of  K through 12 Federal grant funding. I want to thank Senator Rosen for  coleading this bill with me.\n\nAccountants play a key role in today's economy. They serve as trusted  advisers for companies…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699755/9999"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…offices. It also directs the  VA to use the tools for pensions and survivors' benefits, so families  aren't left behind.\n\nBy improving coordination across the VA and other Federal agencies,  we can reduce overpayments and prevent families from being hit with  unexpected debt notices.\n\nThis is a commonsense bill that would help to ensure that our  veterans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695484/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…January 1, 2026, parents of children under 8 years old  can open a MAGA investment account for their children. The government  would seed accounts for newborns with a $1,000 Federal deposit.\n\nThese investment accounts would be eligible to receive contributions  from family members, employers, nonprofits, and government entities.  They will help set up…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}]