[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…withholding of funding, the  impoundment of funding, the illegal rescission of funding, the illegal  termination of grants, and, I would say beyond that, the mass firing of  Federal employees--the lawless firing of Federal employees--the use of  Congress's power to appropriate money, one of the most important  powers--arguably, the most important power we…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696336/trump-administration"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…dismantle the Federal Government. In their efforts to  root out so-called ``government waste,'' President Trump and Elon are  targeting and illegally terminating the Federal workforce, the  employees who make our country run.\n\nThese are the air traffic controllers who make sure your flights land  safely, the workers responsible for sending Social Security…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688591/recognizing-federal-employees"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…wiped  out.\n\nI met with teachers worried about students who don't have the  resources to weather the hardships so casually inflicted by this White  House.\n\nI heard from Federal employees who lost their jobs but were more  concerned about the veterans and seniors and kids with disabilities  they could no  longer serve. I met with medical researchers whose…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689829/standing-up-for-americans"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…(IG) for the Federal Retirement  Thrift Investment Board (FRTIB). The FRTIB administers the Thrift  Savings Plan (TSP), the retirement savings and investment plan for  federal employees.\n\nIn 2022, the FRTIB launched a new recordkeeping system with the goal  of modernizing TSP's recordkeeping, improving customer service and  bolstering cybersecurity.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691138/introduction-of-the-federal-retirement-thrift-investment-board-inspector-general-act-of-2025"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…their limited bargaining rights does not improve efficiency.  It threatens the integrity of our civil service. These rights exist for  one essential reason: to shield Federal employees from political  pressure so that they serve the American people, not the agenda of any  one President or political party.\n\nNo worker should have to take a political loyalty…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697979/protect-americas-workforce-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, Virginia Federal employees are still  being fired, RIF'd, and harassed by this administration.\n\nLast week, I heard from a constituent who received a termination  letter from the Department of Health…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694177/demanding-answers"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Ms. STANSBURY. Mr. Speaker, Federal employees found themselves  targeted yesterday by yet another reckless scare tactic by Elon Musk.  As they were asked for five bullet points to demonstrate what they  accomplished…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687966/five-bullet-points"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…deficit and did  little to enhance the American economy.\n\nWe see the Trump trifecta in action. Trump and Musk, with the backing  of timid Republicans, have traumatized Federal employees. Republicans  have purged the military of competent, experienced leaders and have  usurped congressional, constitutional power of the purse and power of  the law by dissolving…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…Air traffic  controllers are mandated to retire at 56. Yet, this administration and  House Republicans are advancing a proposal to shrink the retirement  benefits for Federal employees who are retiring before 62, all to help  pay for tax cuts for the wealthy. We cannot expect to solve for  shortages by breaking our promises to air traffic controllers…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690741/united-states-postal-service-is-not-just-a-convenience"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today I introduce the Protecting Federal  Agencies and Employees from Political Interference Act, which would  prohibit the relocation outside of the National Capital Region (NCR) of  the headquarters for any federal agency…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688344/introduction-of-the-protecting-federal-agencies-and-employees-from-political-interference-act"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…override spending laws or impound  appropriated funds, a principle affirmed by numerous Supreme Court  rulings.\n\nDonald John Trump has withheld funds and terminated en masse Federal  employees and numerous Federal agencies and departments, including the  following:\n\nOne, directed the dismantling of the Department of Education.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…We have them because unions  negotiated them.\n\nWe are here because President Trump signed an executive order seeking  to end collective bargaining rights for  unionized Federal employees across several agencies. Congress granted,  not the executive branch, collective bargaining rights for Federal  employees decades ago, and they have been upheld for years…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697987/protect-americas-workforce-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…capacity. Elon Musk has said that the government ``should  privatize everything that we possibly can.'' They are laying off or  pushing into retirement tens of thousands of Federal employees. The  cruelty is the point.\n\nRussell Vought, Director of the Office of Management and Budget and  Project 2025 architect, has said of Federal employees: ``We want to…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…man in the world--who spent more money than anybody else to  get Donald Trump elected. He hired him to oversee an effort to  recklessly fire thousands of hard-working Federal employees and shut  down entire Agencies, undermining our national security.\n\nAmericans are living through a serious cost-of-living crisis right  now. Families are struggling with…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699113/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the Foreign Service to use Voluntary Early Retirement  Authority (VERA) when an agency is undergoing a reduction in force  (RIF) or other restructuring. While most other federal employees are  eligible for VERA if their agencies are undergoing a RIF or other  restructuring, the members of the Foreign Service are not.\n\nI strongly oppose the Trump administration's…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693054/introduction-of-the-foreign-service-voluntary-early-retirement-authority-act-of-2025"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Time on the  Taxpayer's Dime Act, a critical step toward restoring accountability in  the Federal workforce. This bill will end the abuse of official time  which allows Federal employees to engage in union activities while  being paid by the taxpayers.\n\nFor years, Federal employees have spent millions of taxpayer dollars  on union-related work instead…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689724/congratulating-glenvar-high-school-boys-swim-team"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…more than happy to talk to you about how do  we repair the damage done by ObamaCare and transition to a system that  works.\n\nBut they are playing politics. They are using Federal employees and,  quite honestly, the American public right now, whose flights are being  delayed, whose skies are less safe--they are using public employees and  the American public…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…ashamed of  yourselves for inflicting this pain on the American people, taking away  food stamps from 42 million Americans, defunding WIC, and not paying  our troops, our Federal employees, and our air traffic controllers. It  is a disgrace, and you should all hang your heads in shame.\n\nVote ``yes'' to pass the bill and reopen the government.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696694/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…Democratic leader's desire to play  politics with people's lives and paychecks.\n\nAmericans, including those in Louisiana, are paying the price.  Nationwide, 1.4 million Federal employees--many of whom, of course, are  living paycheck to paycheck--are furloughed or working without pay, and  13,000 air traffic controllers have already missed 1 paycheck…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…corps would do a little bit  more work on the problem.\n\nElon Musk and DOGE were here. They did a good job pointing out that  there were some, particularly in offices, Federal employees in the  District of Columbia, or even around the country, that maybe weren't  working that hard. Some of this happens in the private sector. More  likely, it will happen…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…currently  in debt. Functionally, we are borrowing about $6 billion a day.\n\nI was doing a little math standing in the back, off the top of my  head. If you had 70,000 Federal employees accept early retirement, and  they make $135,000 with benefits, you are cutting less than 2 days of  borrowing. You need to do it. Do not take that comment and say: Oh,…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…shutdown. Our air traffic controllers are not being paid. In fact,  starting tomorrow, the airlines are going to be canceling flights. Our  staffs are not being paid. Federal employees are not being paid. These  young men and women here, our pages, are not being paid. Our military  is only being partially paid.\n\nI am confused about SNAP payments. Some…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…attempts at tariffs before he started flip- flopping. We never know where he is at, right?\n\nHis tariffs are raising the costs of housing. In New Mexico, the  firing of Federal employees and the domino effects of the economic  uncertainty because of his tariffs are making jobs harder to find.\n\nMr. Speaker, Trump promised to lower prices on day one. Instead,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…supporting missions related to title 10, United       States Code;\n\n(4) the fact that members of the Armed Forces have service       requirements unlike those of other Federal employees, which       require them to continue to serve even if unpaid;\n\n(5) the impacts of historical shutdowns of the Federal       Government on members of the Coast Guard;…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Sec. 4. Immediately upon adoption of this resolution, the       House shall proceed to the consideration in the House of the       bill (H.R. 1637) to reinstate veteran Federal employees, to       require reports from executive branch agencies of the Federal       Government on the number of veteran employees fired from such       agencies, and for other…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…services and would have given us time to negotiate  long-term solutions. It was a yes vote to keep the government open and  to pay our troops, air traffic controllers, and Federal employees.\n\nEvery Democrat but one voted no. Every Democrat but one voted to shut  the government down. This is not opinion, and this is not messaging  like Democrats keep trying…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…FITZPATRICK. Mr. Speaker, I rise today in support of H.R. 2550,  bipartisan legislation to restore collective bargaining rights for  hundreds of thousands of unionized Federal employees.\n\nThis legislation reaffirms a core principle: A government that serves  the people must also respect the rights of those who serve within it.\n\nFederal employees work…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697991/protect-americas-workforce-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Speaker, I rise in opposition to H.R. 2550. Americans pay several  hundred billion dollars in taxes each year to fund the salaries and  benefits of more than 2 million Federal civilian employees. These  workers are paid to carry out the critical mission and functions of the  Federal Government, but the more than 340 million Americans who foot  the bill do…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…consequence of inaction. To continue the  government shutdown would be to repeat all the same mistakes my friends  across the aisle made in October of last year, throwing Federal  employees into chaos and confusion while they are forced to work  without pay, wreaking havoc on our airports while TSA and FAA are  unfunded, putting undue stress on our military…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…Active-Duty Reserves, National Guard,  civilians supporting them, the Department of Defense, the Coast Guard,  the intelligence Agencies; they are keeping us safe now, like all  Federal employees, not knowing when they will get another paycheck.\n\nOur military is less than 1 percent of our Nation. That is how many  people sign on the dotted line up to and including…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696488/terminating-the-national-emergency-declared-to-impose-global-tariffs"}]