[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…his goals to impose an illegal agenda.  Through his executive orders, he has threatened the revocation of  government security clearances and prohibitions on entering Federal  buildings to these law firms.\n\nTwo of the law firms--Skadden; and Paul, Weiss--immediately settled  to avoid sanctions and committed a collective $140 million in pro bono  work…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689393/protecting-the-legal-community"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…urgently needs the protection of the  CZMA because of serious flood risks that affect federal assets,  residents and businesses in D.C., including the National Mall and  federal buildings in the Federal Triangle area.\n\nThe CZMA provides planning and technical services to assist states in  protecting, restoring and developing coastal communities and resources.…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696521/introduction-of-the-district-of-columbia-flood-prevention-act-of-2025"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…Federal  Protective Service, to establish processes to strengthen oversight,  performance, and accountability of contract security personnel engaged  in the protection of Federal buildings and grounds that are owned,  occupied, or secured by GSA.\n\nFPS law enforcement officers and the contract guards who support them  risk their lives every day to protect…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695059/personnel-oversight-and-shift-tracking-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…supersedes the considered policy judgments  of the States, but it threatens the safety and security of Federal  agencies by forcing them to allow concealed carry in many Federal  buildings. Forcing Federal offices and buildings to allow concealed  carry is a completely unnecessary and dangerous risk.\n\nThe legislation also weakens training standards. Under…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…no public  input, and no regard for the law. Now the White House is quietly  soliciting bids to repaint another White House building and to demolish  four more historic Federal buildings here in Washington, D.C.\n\nThey are shopping our shared heritage to the highest bidder. Yes,  those bidders just happen to be some of the President's personal  friends…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697854/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…him tweet that  out. He has also added his name to the Kennedy Center.\n\nFor those of you who haven't come to Washington, D.C., he has put  banners of his picture up on Federal buildings. He is proposing to put  his likeness on gold coins.\n\nMs. CASTOR of Florida. Mr. Speaker, I think you get my drift here. It  was so galling as people are trying to pay…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698568/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…Amendment-protected conduct,  including the right to petition the government for redress of  grievances.\n\nSpecifically, he has barred attorneys at certain law firms from  access to Federal buildings, arbitrarily revoked security clearances  without a reasonable basis, threatened to cancel Federal contracts with  any entity engaging the targeted attorneys and firms,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…they really are. Americans show an ID to board a plane.  Americans show an ID to drive a car. Americans show an ID to open a  bank account. Americans show an ID to enter Federal buildings and for a  host of other reasons.\n\nOf course we should expect it for American elections. It doesn't  silence voters. It empowers voters. It only ensures that Americans…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…is going  after Harvard.\n\nOur President declared war on law firms: revoked security clearances,  threatened their viability by taking away their capacity to walk into  Federal buildings, ending Federal contracts. Why? Because if you can  control who a law firm is willing to represent, you can suppress  dissent.\n\nSome of our Nation's most reputable and…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…and improve public safety.\n\nThis is a commonsense reform that turns the tests that FPS is already  conducting into data that can drive actionable improvements, making  Federal buildings safer for employees and the American people who we  serve.\n\nThe POST Act also tackles another persistent problem: FPS' broken  shift tracking system.\n\nIn 2018, FPS launched…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695058/personnel-oversight-and-shift-tracking-act-of-2025"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…is too wracked by guilt to  punish its criminals, to enforce its laws, or to confront its enemies-- even when those enemies are beating police officers and firebombing  Federal buildings right before our eyes.\n\nWhen a government loses the ability or the will to defend its own  cities, its own institutions, its own people, then it ceases to be a  government…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696003/unanimous-consent-requests"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…order that has been  signed and issued by the President to change the General Services  Administration's policies to prefer classical and traditional  architecture in Federal public buildings.\n\nI think every American can imagine what we are talking about here.  When you look at the Capitol, our national monuments, the White House,  many courthouses, the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…being  thrown at officers, which is to say that the things that happened  before the National Guard got there, or our dedicated National Guard  members standing outside Federal buildings, making sure that no further  damage to property and life occurred?\n\nMr. Speaker, the assertion has been made repeatedly that the  President's deployment of the Guard…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}]