[{"senator": "David Schweikert", "party": "Republican", "sentence": "…through. In the early 2000s, there was this concept of  managed care that if we could help our brothers and sisters with their  earned benefit in Medicare, saying that we have fee-for-service, but  you have to pay all of these copays. What would happen if you could  align the incentives saying that we want insurers to manage a portfolio  of access to healthcare,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…data--it is almost $2 trillion a year. Remember, the MedPAC report  comes in and says, Medicare Advantage, when you do the risk adjustment,  it comes in at 120 percent of fee-for-service. That is a 25 percent  gap. In the original design, in 2005, the Medicare part C was supposed  to come in at 95 percent.\n\nI know it is geeky, but this is a stunning amount…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…Lakes alone has gone through the USPS' boundary review process  three times to no avail, which is, again, unfortunate.\n\nWhile the Postal Service operates, by the way, on a fee-for-service  basis and receives no direct appropriations--I want to make sure that  everybody understands that--my team, my staff, has talked to the  Congressional Budget Office to…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693863/establishing-new-zip-codes"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…motion under this section, take any additional       action necessary to grant the movant full relief.\n\n``(g) No Fees.--A person may not be required to pay a       filing fee, service charge, copay fee, processing fee, or any       other charge for filing a motion under this section.\n\n``(h) Confidentiality of Movant.--\n\n``(1) In general.--A motion under…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…open them up, which I am  sure every Member of Congress opens them up and goes through them, it  will tell you that Medicare Advantage right now is costing 120 percent  of fee-for-service.\n\nMedicare Advantage, which came into effect in 2005, is supposed to  come in at 95 percent of fee-for-service. That is a 25 percent delta.  We have been looking at charts…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…population that only takes the Medicare part A, which is the  hospital portion, the trust fund, and which also runs out in 12 or 13  years, it is 20 percent more expensive than fee-for-service.\n\nIf we take it back to the fact that when Medicare Advantage was  designed and it was supposed to come in at 95 percent of fee-for- service, do that delta. That is approaching…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…like this, but it is not a hard read.\n\nIn there, it will say that when we started Medicare Advantage in  2005, it was designed to come in at 95 percent of the cost of fee for  service, but its model was that we were going to incentivize the folks  who manage the care to make money by helping you be healthier. The  incentive was that we were going to…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…screwed up when the insurers were making money by scoring people as  sicker.\n\nIn 2005, the model for Medicare Advantage said it is going to come in  at 95 percent of the fee-for-service cost. Look, I am sorry to geek out  on this, but this is important.\n\nRemember, 55 percent of Americans are on Medicare Advantage. I  represent an area with terrific penetration…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Committee on Ways and Means. The MedPAC  report was all highlighted, and we showed the MedPAC report says:  Medicare Advantage, part C, is coming in at 120 percent of fee for  service.\n\nJust that delta from where it was supposed to be at 95 percent--I  know that is a lot of numbers--when we designed Medicare Advantage,  long before you and I got here,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…rounding errors  compared to this. I think it had that $84 billion was spent last year  in the differential between Medicare part D and Medicare part A. That  is Medicare Fee-for-Service and Medicare Advantage. It was supposed to  be at 95 percent. If anyone wants to go back and do their history, in  2005, when they started Medicare Advantage, if you do…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…hate to say, my own  joint economic economist, the CMS data and HHS data, and The Wall  Street Journal, everyone else looks into this--it is coming in at 120  percent of fee for service.\n\nWhy this is a big deal is when Medicare Advantage was designed--it  really came into effect in 2005--Senator Frist, who is a doctor--they  put together a plan with this…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}]