[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…costs on day one.'' But instead of working to  lower costs, the President has waged an unprompted trade war with  Canada that will cost Americans when they heat their homes, feed their  families, run their small businesses, or tend to their farm.\n\nIt's been one week since President Trump imposed twenty-five percent  tariffs on Canada. In retaliation,…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688917/impact-of-president-trumps-disasterous-tariffs-on-canada"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…sacrifice even more.''\n\nIf we cut Medicaid and SNAP, we are not trimming fat. We are cutting  hope.\n\nLet's be clear about the false choice we are being asked to make. Do  we feed the greed of billionaires, or do we feed and care for families  like Atalina's? We know who Republicans are choosing.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691491/gop-tax-scam-hurts-women-and-families"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…resolution that does not include       deep cuts to vital programs, services, and benefits the       American people use every day to help them see a doctor, pay       rent, or feed their families.\n\nJustice in Aging is an organization that is led by its executive  director, Kevin Prindiville. He writes:\n\nWith this vote, lawmakers endorsed taking away Medicaid…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…of three growing  boys--they are not little kids anymore; they are growing--through the  course of their upbringing, we have been able to control certain  things, like how we feed our kids. We go to the grocery store, and you  are shopping for what you are going to prepare for dinner. You have  readily accessible information--nutritional information--not…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…going out to seniors don't have protein.\n\nWhen Federal food dollars are cut off, it doesn't just hurt the  hungry, it hurts the producers. Congress must restore these funds to  feed our people, support the farmers, producers, and growers who make  and grow what makes and grows America.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690437/empty-shelves-at-food-banks"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…rule preserves the fish and wildlife  habitat and sustains the hunting, fishing, and recreation economy.  Every year, I and millions of other hunters rely on public lands to  feed our souls and to feed our families. The Sportsmen's Alliance  estimates that in 2022, recreational hunters alone generated $133  billion in economic output, created 1.3 million…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…workforce shortages.\n\nThe reality is that undocumented workers make up 14 percent of  construction workers and roughly 42 percent of our agricultural  workforce.\n\nFarmworkers help feed our Nation and allow grocery stores to stay  stocked with affordable fruits and vegetables. Unfortunately, this  reality is not what my colleagues on the other side of the aisle…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688133/republican-budget-betrayal"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…As a grandmother and mother, how about the  President of the United States having a Halloween party on Halloween  night and saying to the Supreme Court: Please don't make me feed the  children or the poor people in our country.\n\nMs. PELOSI. Mr. Speaker, going to the Supreme Court for that means  that ``cruelty'' has not even come close to the word that…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696718/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…where the President is soliciting foreign  governments for private gifts, including a $400 million jet in exchange  for favors; and who is systemically dismantling programs that feed and  house our people? He is trying to gut our healthcare systems and saddle  generations of our people with trillions of dollars in debt so that he  and his billionaire friends…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692793/we-say-no"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…jobs to the best of our  ability.\n\nWhen we see people who are hurting and we have the ability to help,  our job--or as Matthew 25 says: When we see somebody who is hungry, we  feed them. When we see someone who is homeless, we give them shelter.  When we see someone who is sick, we provide them care. When we see a  stranger, we welcome them. When someone…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…our neighbors, our Nation,  and the world.\n\nAgriculture is the backbone of Delaware's economy. From poultry farms  to vegetable growers to grain producers, Delaware farmers feed families  here at home and around the globe and contribute to an industry that  supports thousands of jobs in Delaware.\n\nUnfortunately, since taking office, the Trump administration…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688191/protecting-agriculture-the-backbone-of-delawares-economy"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…talk about ag. This proposal would halt funding for the  Rural Energy for America Program. Once again, cutting a billion dollars  in funding for programs that help schools and feed folks through food  banks. Cutting this funding would threaten the livelihood of our  American farmers and also threaten the nutrition of our children.\n\nLet's talk about our…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…amendments like this that not only put our national security at  risk but make this bipartisan process crumble before us in the House.\n\nMadam Chair, do you know who loves to feed this information through  sites that don't fact-check? Russia, Iran, the People's Republic of  China, and other adversaries do.\n\nRepublican leadership has continued to fail…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695250/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Republicans' cuts to Medicaid, SNAP,  and other essential programs are alarming. These are real people who  are depending on us to make sure they still have healthcare and are  able to feed their families.\n\nThese are real people who come to my townhalls, who write to us, and  who call my office. They are real people like Aneliese, a single  mother, who called our…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691411/gop-tax-scam-hurts-women-and-families"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…the destruction of tropical forests, acidification of the  oceans, rape as a weapon of war, illicit arms sales, and unsustainable  population growth in countries that cannot feed their own people today.  These daunting challenges require regional and global cooperation and  the active involvement of these UN organizations that provide the  necessary…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699129/us-withdrawal-from-united-nations-organizations-and-programs"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…emerging growth companies from 3  years to 2 years, cutting costs while protecting investors.\n\nIowa's innovators and America's innovators are creators of solutions  that help feed the world and drive America forward. We should remove  barriers, not continue to create or make them harder, because a startup  in Perry, Iowa, deserves the same shot at success…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697824/increasing-investor-opportunities-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "Mr. MORAN. Mr. President, the call to feed the world has been  answered by many Kansans, from farmers and ranchers to Senator Bob Dole  and President Dwight D. Eisenhower. American farmers are linked to  global markets…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691403/motion-to-discharge-s-res-195"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…broaden this to all Federal employees.  Again, as he said, they shouldn't have to go to food banks and they  shouldn't have to go to DoorDash to pay their child's tuition or feed  their family.\n\nBut we had a chilling report from the Senator from Texas, the chair  of the Commerce Committee, in terms of what is happening with air  traffic control in terms…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…family farms. The family farmers  and ranchers in my district are hardworking men and women who are up  and moving by sunrise and working well past sundown, ensuring they can  feed, clothe, and fuel the world. Their pride doesn't come from large  bank accounts, it comes from answering a call that requires hard labor  and lots of sacrifices to feed their…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…process that stifles innovation and leaves  American farmers falling behind their international competitors.\n\nI am proud to join a bipartisan group of Members on the Innovative  FEED Act to streamline this process and cut the approval time down by  years.\n\nNutrient supplements keep our food supply safe and our livestock  healthy and allow American farmers…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688957/president-trump-bringing-back-investments"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…prices, doubling investments  into crucial trade promotion programs like MAP and FMD, and expanding  crop insurance. These are all commonsense policies that allow our  farmers to feed, fuel, and clothe the world without the fear of losing  everything because of a bad crop year. This legislation was life- changing for the agricultural families in my district.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694904/no-place-like-home"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…protecting food security and not playing games with it.\n\nThis bill also delivers for our farmers and ranchers and for rural  development. It invests in the communities that feed this country and  keep the economy strong. It supports our troops and Federal workers. It  ensures our servicemembers and their families have the support they  need, and it…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…activist lawsuit.\n\nDouble-crested cormorants are waterbirds common to the Great Lakes  States and the Southeast. They are opportunistic and intelligent  predators that often feed at aquaculture facilities, where fish are  easy to catch. A variety of studies have determined that predation from  double-crested cormorants costs the aquaculture industry…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697641/cormorant-relief-act-of-2025"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…across our State are  raised with.\n\nThe Indiana State Fair is more than a tradition. It is a celebration  of farming, youth leadership, and the families who work every day to  feed our country. Presley's achievements highlight the importance of  programs like 4-H and FFA that prepare young leaders for the future.\n\nI know Presley will represent Indiana…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698931/recognizing-indiana-university-football-team"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "Mr. KENNEDY. Mr. President, as you well know, the American people are  the most generous people in the entire world. In our country, when you  are hungry, we feed you; when you are homeless, we house you; when you  are too poor to be sick, we will pay for your doctor. We spend  trillions of dollars a year helping our friends and neighbors…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…celebrate 250 years since our Founding Fathers signed the  Declaration of Independence.\n\nFor generations, American farmers have not only fed this country,  they have helped to feed the world, and they have done so by  continuously adapting and embracing new tools, technologies, and  practices.\n\nThe success of U.S. agriculture has been built through the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699123/pennsylvania-farm-show-recap"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…decline  in our military readiness despite unprecedented theaters of global  conflict. They would destroy our economy in their unending appetite for  continued tax increases to feed their spending binges.\n\nMr. Speaker, the choice is clear. We must deliver. We must deliver a  renewed, restored, and revived Nation and grant voters the America they  stood…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…should be allocated to covering healthcare costs for any person who is  in this country illegally.\n\nTo the American parents, whether rural or urban, who are struggling  to feed your children, I ask: Should illegal immigrants receive tax- funded meals day in, day out to eat on your dime?\n\nAgain, I heartily say: Absolutely not.\n\nTo the children at risk…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…New York Times [truly] believe that it is normal       for an Assistant Special Agent in Charge to prepare case       predication for the opening of an investigation and then feed       it to a street agent?\n\nIs it normal for an Assistant Special Agent in Charge       responsible for the most sensitive political investigations       in the FBI to be forced…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…realities on  the ground is vitally important, and I will continue pushing for a  fiscally conservative, 5-year farm bill that reflects the priorities of  our producers who feed, fuel, and clothe the world.\n\nWhile real wages are rising and inflation is nearing a 5-year low,  there is more to be done to lower costs for families and small  businesses.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698651/following-through-on-americans-priorities"}]