[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…administration as it is simply too much to       bear.\n\nThe National Institutes of Health limps along on invisible       crutches, its significance on life support, its staff feeling       diminished, dazed and confused. When this madness will end is       anyone's guess. With the Department of Health and Human       Services under Robert Kennedy Jr.'s…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…cares about  is his rich as hell--those were his words--his rich as hell donors and  helping them make more money.\n\nLet's be clear. Energy prices are too high. Americans are feeling  those high prices. Energy prices have been on the rise for the past  decade. And last year, one-third of Americans had to cut back on  necessary spending in order to pay…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688155/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…dairy and specialty crop producers, are losing access to stable export  markets. Our small businesses, like local breweries that depend on  Canadian aluminum for cans, are feeling the pinch.\n\nWhen tariffs slam the border, it hits the bottom line for small  businesses in Syracuse, Utica, Auburn, Cortland, and other communities  across my district.\n\nWhile…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695609/devastating-harm-caused-by-trump-administration"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…freedoms that we cherish have  always required vigilance, courage, and sustained commitment. Today,  that lesson is as urgent as ever. Across our country, communities are  feeling the weight of an administration that governs through extremism,  division, punishment, and exclusion.\n\nWe see it in attacks on our voting rights, in efforts to criminalize…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699198/building-a-beloved-community"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…are going through their monthly budget trying to figure out what they  can give up just to be able to pay for these premiums. I am speaking  for those who have the horrible feeling in the pit of their stomachs  because they know the risk of being uninsured, being one hospital visit  away from bankruptcy.\n\nMy Republican colleagues and, certainly, Donald…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698664/protecting-healthcare-for-millions-of-americans"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…month. That means housing  costs are often the largest part of a monthly budget, and this is even  before groceries, childcare, or healthcare.\n\nIt is not just renters who are feeling the squeeze. Homeowners are  feeling the squeeze, too. The median home value in Ohio's 13th District  is about $228,000. That may sound modest compared to national prices,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699021/rising-housing-costs"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…that matches  the moment of time that we are in, Mr. Speaker. Of course, strategic  tariffs that the previous President and the President before did have  helped, but we are feeling the squeeze in Michigan, and it is news  unfolding before our eyes.\n\nAgain, I reference the article here: ``A stunning number of electric  vehicle, battery factories are being…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…of their grocery bill.\n\nNow, to make matters worse, the Trump administration has unilaterally  paused Federal food assistance and canceled shipments to food banks. We  are feeling it. By withholding food and funds, the new administration  has turned its back on the American people.\n\nThey feel the rising prices, and they feel the harm. Food banks in…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690437/empty-shelves-at-food-banks"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…institutional       support and recognition of the unique barriers to college       completion for parenting students. Pregnant and parenting       students often experience feeling disconnected from the       larger education community and are not aware of who they can       speak to when they experience discrimination because of their       pregnancy…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…another to Big Oil from our friends across  the aisle.\n\nRepublicans just can't get enough, and so we are back here once again  giving another favor to Big Oil. One gets the feeling that the majority  is just warming up and that this is going to be a recurring theme in  this Congress.\n\nMeanwhile, we are 1 week away from a government shutdown. We are on…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Americas or with the  narcotraffickers, they have had the ability the entire time to bring a  resolution before us and have that debate in front of the American  public. I have a feeling that debate would produce some positive votes  if it were limited enough, but to allow a President to do it by secret  without Congress having the guts to have the debate…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…private-sector  workforce, and generating almost half of our Nation's economic  activity.\n\nDespite forming the bedrock of our local communities, small  businesses are increasingly feeling uncertain about the future of the  country. The small business landscape is littered with obstacles like  finding qualified workers, dealing with supply chain disruption as…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697219/made-in-america-manufacturing-finance-act"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…VA. Often, these folks are  forced to use their network of fellow veterans to share tips and tricks  to get their care. They move through this new medical world with the  gut feeling that they all could not be ill without their military  occupation playing some role. This is unacceptable.\n\nWe need data to help bridge the gap between anecdote and evidence…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690651/aces-act"}, {"senator": "Linda Sánchez", "party": "Democrat", "sentence": "…Higher prices on groceries, cars, housing, utilities, and  other basic necessities don't impact them.\n\nHowever, working families, small businesses, and farmers are  certainly feeling the pain of these trade wars. Trump's tariffs are  increasing prices on everything for them, and Republicans are letting  it happen on their watch.\n\nMy Republican colleagues…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699901/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…Newark and Hartford, we are looking at a kind of  desperation and sorrow that is unique--that is unique that also  comes with not just losing a loved one to gun violence but feeling  powerless in that exercise.\n\nMr. MURPHY. Feeling like there was nothing you could do and watching  your elected leader stand by and allow for this reality to continue to…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…November 2024.\n\nToo many Americans felt Democrats had become the party of the elites  and had stopped meeting people where they are, not understanding the  pain that they are feeling in their lives and their families at their  kitchen tables when they get up go to work and come home exhausted at  night.\n\nDemocrats need to learn from their mistakes. This…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689084/economic-populism"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…the  emergency siren is blaring. After 4 years of reckless regulations and  restrictions by the Democrat administration, energy prices have jumped  31 percent. Families are feeling it all across the country. To most  Americans, this is the definition of an energy emergency. To Senate  Democrats, it is an inconvenient truth.\n\nToday, Democrats are trying…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688189/energy"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…brother who had struggled  with addiction but had fought hard for his recovery. Gabriel relapsed  one day after his 24th birthday.\n\nFentanyl is a crisis. In Spokane, we are feeling the weight of it.  Last year alone, 270 lives were lost to fentanyl overdoses in Spokane  County. It is a national epidemic that we must address with urgency. We  must stop…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690498/recognizing-gabriels-challenge"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…of their pockets than they did before President  Trump took office. From the gas station, to the grocery store, to the  pharmacy, paychecks are going further. Families are feeling financial  relief, and more relief is on the way because there is more work for us  to do.\n\nLet's consider what the Democrats--the people on the other side of  the aisle--want…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700171/state-of-the-union-address"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…elective.  Kate Millett, the mother of these classes, said: The complete  destruction of the traditional marriage and the nuclear family is the  utopian goal of feminism.\n\nI have a feeling a lot of people don't realize that the utopian goal  of feminism was to get rid of the nuclear family. Obviously, Kate  Millett's successors are probably thrilled that we…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…benefits. Inevitably, they will  find the percentage of people getting married when they have children  falls because the generosity of the programs is such that there is a  feeling of: Why would I get married at all?\n\nThese programs also cause cheating or breaking the law because, of  course, they frequently don't catch it if you are getting cash off…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…so, in practice, that means  less operating room during heat waves and higher costs right when our  citizens need power the most--all of our citizens.\n\nHoosiers are already feeling it. According to the U.S. Energy  Information Administration, Indiana's average home electricity prices  are up roughly 11.5 percent year over year, and the Trump  administration…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695511/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-emissions-budget-and-allowance-allocations-for-indiana-under-the-revised-cross-state-air-pollution"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…we discuss these proposals that are important to  American families and taxpayers.\n\nMr. Speaker, I am just a little confused. My colleague mentioned  ``whiplash,'' and I am feeling a little whiplash over here because  Democrats liked Elon Musk. Then, the minority hated Elon Musk. Now, my  Democratic colleagues like him again?\n\nI am just a bit confused…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…dark\n\nWith elapsed some eighty years,\n\nThe adults' heartfelt davening (praying) with painful       groaning\n\nOf weighing memories while searching for the light,\n\nGratefully feeling still the loving hands faithfully\n\nPlaced on my curly head by proud Grandpa Zvi,\n\nSon of martyred Rabbi Yaacov and Dena of Zamosc,\n\nWith radiant grandma Rachel smilingly approving,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699495/recognizing-remarks-of-rabbi-dr-israel-zoberman"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…more of my colleagues have signed up to cosponsor this important  legislation. They have said: No more. Our heroes have to be able to do  their jobs to protect us without feeling threatened in the execution of  their duties.\n\nThe legislation would make it illegal for anyone, after being told to  stay back, to knowingly come within 25 feet of a Federal…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697550/halo-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…tax relief for seniors by lowering taxes on Social Security benefits,  because the key to affordability is bigger paychecks, not bigger  government.\n\nPeople are going to be feeling the effects of these tax savings in  their pocketbooks this tax season, where Georgia families can expect up  to $5,000 in savings. By unleashing American energy, we are bringing…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699063/how-republicans-have-delivered-for-americans"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…here as  Republicans is putting more money in your pockets, creating more  opportunities for the American people, for American families, and  families all across America are feeling it today.\n\nAmericans are no longer seeing these sky-high increases in prices  like we experienced over the 4 years of the Biden administration--not  at all.\n\nFive years ago,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699081/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…results for the  American people. We have seen real results on our southern border as  illegal crossings and the flow of illicit drugs has dropped  significantly.\n\nFamilies are feeling real relief at the gas pump and grocery store as  their wages are going up and opportunities are increasing. In our  schools and military, the emphasis is, once again, on…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699279/highlighting-republican-successes-in-2025"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…waste, prevent delays in care, and ensure that taxpayer dollars  are spent efficiently. Most importantly, it will help restore trust in  a system that too often leaves veterans feeling frustrated and  forgotten.\n\nMadam Speaker, I respectfully urge my colleagues to support this bill  and join me in making a practical, bipartisan improvement to the care  our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695398/va-hospital-inventory-management-system-authorization-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…even when it is  difficult, even when it is uncomfortable, and even when the outcome is  uncertain. This is one of those moments.\n\nMr. Speaker, some of my colleagues may be feeling pressure today to  accept the veto. I get it. However, I would ask every Member to  consider the pressure felt by the communities they represent,  especially those in rural…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698701/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}]