[{"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…border. What my community  and our community kept telling us back then during its creation,  literally, is they told us they are violating people's civil rights. We  do not feel safe with them in our community. People were jogging around  our parks and getting stopped to be asked what their legal status was.  They were militarizing southwest Detroit.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699666/horrific-ice-abuses"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…actions,  as dictated by our oath that we swear to the Constitution of article I,  as well, that lays out what our job is, that that is very much under  threat right now.\n\nI feel for my colleague. I don't know what is happening right now. I  hope that we are able to get greater clarity about that, but what we  see and what we saw on that video transpire,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692477/alex-padilla"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…America from an  Arctic region threat.\n\nWith that very thought in mind, in 1951, we signed an agreement with  Denmark that allows us to place military assets in Greenland that we  feel we need with the support and agreement of Denmark. They have not  reneged on that deal or thrown up roadblocks to American defense needs.  We are trying to burst into a room…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698929/greenland"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…and healthcare shock. Once again, our Republican  colleagues across the aisle chose politics over people, and Brooklyn,  New York, like other districts across the Nation, will feel that pain  most acutely.\n\nMr. Speaker, tonight, the Congressional Black Caucus has done what it  has always done: We center the people. We will bring forward the  stories from…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…have killed me or two       people that I love.\n\nHis soon-to-be brother-in-law and father-in-law were the two people  with him in the car.\n\nWe no longer felt safe. We didn't feel like we could leave       our home or operate normally in the world. How do you move on       from knowing someone tried to kill you and the people you       love?\n\n``The agents…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Alexandria Ocasio-Cortez", "party": "Democrat", "sentence": "…murder is a straightforward matter. It is one that is  especially important to help stabilize an increasingly unsafe and  volatile political environment where everyday people feel more at risk.\n\nWe can deeply disagree and come together as a country to denounce the  horror of this killing, and it is not a license for the abuse of power  and whitewashing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695806/censured-but-not-silenced"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…is hard to do when Republicans are cutting and  gutting the training programs that exist in this country.\n\nJohnson).\n\nMr. McGOVERN.  Stevens).\n\nMr. McGOVERN. Mr. Speaker, I feel the excitement on the other side of  the aisle.\n\nMr. McGOVERN. Mr. Speaker, Democratic Leader Jeffries has an  amendment to strike the devastating cuts to healthcare and SNAP,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…as a staff assistant. Ben not only excelled  in, but innovated upon, this position--implementing strategies and  policies that continue to this day. From making constituents feel at  home to battling the rats in the House Office Building basement, Ben  proved there was no challenge he could not face.\n\nBen's unique abilities, professionalism, and dedication…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692875/recognizing-departing-staff-member-benjamin-hong-starr"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…Homeland Security isn't just front page news--it is the thing that  people who haven't picked up a newspaper in years are talking about.\n\nWhy is that?\n\nIt is because people can feel that something is wrong in this  country, and they know it has to be stopped.\n\nPeople can watch the videos of the murders of Renee Good and Alex  Pretti at the hands of Federal…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699399/9999"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…fossil fuels  off next week; or that we don't respect the men and women who work in  our energy fields or in our energy processing across the country.\n\nIf there are Democrats who feel that way, I disagree with them,  because the worst thing we could do at this moment when we have the  energy abundance that we have, when we have the economic freedom we  have,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688166/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…here to the United States for her safety which is now being  undermined by this administration.\n\nMr. Speaker, imagine being a United States citizen and the horror you  would feel when your family member, again, someone who had been granted  legal protection, is taken in the middle of the night and driven to  Mexico, a country to which she has no ties.…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689390/president-trumps-immigration-enforcement-policies"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…consumers lose.\n\nMr. Speaker, I will take 1 minute or 2 to talk about the other  regulation because, after Members vote against the first of these  resolutions, you are going to feel so good that you are going to want  to vote against the second one.\n\nThis is the one that limits overdraft fees to $5 for the big banks,  the 175 biggest banks, or they can…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689952/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…no contact with their lawyer, no  contact with family. We do not know if they are alive, and they don't  know if anyone is even advocating for them--how hopeless that must  feel, how dark.\n\nSo is that enough of a pattern for my Republican colleagues? Do you  still need more? Because there is also Jerce Reyes Barrios. He is a  soccer player. He came…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…2025  playbook for a morally corrupt mass deportation machine.\n\nFor those of us with Black skin, the demonization of Haitian people  is something that we see, we hear, and we feel deeply.\n\nThis country must do better, and this President must extend TPS  status and call off the ICE surge now.", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699519/ice-coming-to-springfield-ohio"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…prosperity of communities in the San Fernando Valley  are among my most critical priorities. I am working with stakeholders  and leaders across my district to ensure that all people feel safe and  welcome in my district.\n\nMr. Speaker, I am proud to bring these resources that will improve  mental health and address substance abuse within the homeless  population.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699916/funding-for-los-angeles"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…here saying: I need more money for the program. I need  more money for--fill in the blank. I need more money for Medicaid. I  need more money for SALT. Why? It is because they feel like they have a  political interest in doing so.\n\nI am sure the gentleman had, like I did yesterday, the farm bureau  coming into your office and needing help. Guess what?…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690587/economic-anxiety"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…that farmers, whether they  grow corn, sorghum, soybeans, or any other grain, receive a fair price  that reflects the quality of their crop. It allows buyers of U.S. grain  to feel confident in the safety and quality of the products they need.\n\nThe United States Grain Standards Act also supports U.S. trade, a  crucial part of the American farm economy.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…current system. Americans are not allowed to control their own  healthcare dollars. Instead, those dollars are routed through insurers,  employers, and Federal agencies that never feel the pain of the cost  and never face the consequences or have to deal with the time  restraints.\n\nMr. Speaker, when you don't control the money, you don't control the  choices.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…them.\n\nHe was a strong conservative. He was warm, kind, and principled. In  my mind, he was exactly the kind of leader that Americans want. He is  going to be dearly missed. I feel robbed that I didn't get to work with  him more, and I will keep him and his family in my prayers.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698669/protecting-healthcare-for-millions-of-americans"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…need--offering not just food, but also kindness, dignity, and a sense  of belonging. For many, this meal is the highlight of their week--a  safe and welcoming space where they feel seen and cared for. In  addition to their weekly meal program, the Center runs a robust food  distribution service to combat food insecurity. Volunteers deliver bags  of groceries…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691893/recognizing-shawn-woodruff"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…countless lives he has brightened,  I am proud to recognize him today and thank him for reminding us all of  how one person truly can make a difference and make a community feel  like a home.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697389/recognizing-brother-gary-moses"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…dog goes home with  their Veteran, Jeanne remains a constant source of support--always just  a phone call away--even during late nights and weekends. She never lets  anyone feel alone or without help.\n\nIt is clear Jeanne White has made a profoundly positive impact on our  community, and I am grateful for her service. May we all strive to  serve our…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690843/recognizing-jeanne-white"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…detainer, you have to follow the law.\n\nWe didn't give the billion dollars to the District of Columbia  because they need to understand that actions have consequences. When I  don't feel safe at night, when my constituents come here and I tell  them to be careful, when my commanding officer stays at a hotel three  blocks from here and I tell him not to walk…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692372/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Elon Musk. Now, my  Democratic colleagues like him again?\n\nI am just a bit confused and ask that maybe someone can clear that up  for me because it goes back and forth, and I feel like there is lots of  whiplash going on.\n\nMrs. FISCHBACH. I yield 1 minute to the gentleman from Massachusetts.\n\nMr. Speaker, it sure does feel like Democrats are going back…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…what they were supposed to--they are not going to flood--and yet, after  Risk Rating 2.0, this is what happened. I don't know if people still  say ``ripped off,'' but they feel ripped off. They feel as if they did  what was right and they have been punished and penalized because the  premiums almost or in some cases more than doubled relative to what…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691629/risk-rating"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…religious, or homeschool settings.\n\nUnfortunately, forward-thinking solutions like this are not being  considered in my home State of Pennsylvania where there are some  families that feel trapped in a system that puts bureaucracy before  students.\n\nWe cannot allow the status quo to be accepted.\n\nSchool choice works, Mr. Speaker, and what are these politicians…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689153/advancing-america-first-policies"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…tragedy.\n\nPsalm 34:18 says: ``The Lord is close to the brokenhearted; he  rescues those whose spirits are crushed.'' It is our prayer that Doug's  family, friends, and team would feel that closeness as they honor, and  we all honor, his life and legacy.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698727/9999"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…in the tax code  that we could make that would affect people's behavior. Because tax  rates are so high, any change in the tax code affects people's  behavior.\n\nSome people feel we ought to make reductions to encourage more  research and development. Other people feel that we ought to--I feel we  ought to increase the personal exemption to give a special…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692064/monitoring-big-beautiful-bill-provisions"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…government that  is now accountable and responsive to the people once again.\n\nThat is what we are delivering. For everyday Americans, this means  real, positive change that they can feel, and they will feel much more  when this bill is done. Families back home will have real relief, an  average of $10,000 in their pockets, thanks to the largest working- and…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Denman.\n\nOften called the godmother of the Texas Republican Party, she passed  away on April 17 at the age of 91.\n\nI don't do a lot of the floor speeches on individuals because I feel  like if I do them for one or two and I don't do them for everybody that  I represent that gets tough. Obviously, veterans, police officers,  there are things that rise to the…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}]