[{"senator": "Jared Huffman", "party": "Democrat", "sentence": "…are being turned upside down: our National Park  Service and workers at a number of Federal agencies, farmers, and  firefighters. Everyone who depends on Federal services is feeling the  squeeze of this reckless agenda. Meanwhile, Republicans are preparing  their budget reconciliation bill, which is going to cost at least $4  trillion.\n\nMr. Chairman,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688067/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…extending tax credits for the Affordable  Care Act. Now this year, no longer is it theory. It is fact. It is no  longer talk. It is pain.\n\nThe fact is 20 million people are feeling the pain with their  healthcare costs going up. Millions more are losing health insurance.  In my district, tens of thousands are going to be paying more for  healthcare.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698808/breaking-the-gridlock-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Special Order hour today.\n\nMr. Speaker, fear, anger, terror, sadness, these are the emotions  that just scratch the surface of what my community and our immigrant  neighbors are feeling. Why should we expect anything less? This is  exactly what this administration wants: to force immigrants into the  shadows, to break their spirit, and to disrupt our communities.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690510/trump-immigration-policies"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…Newark and Hartford, we are looking at a kind of  desperation and sorrow that is unique--that is unique that also  comes with not just losing a loved one to gun violence but feeling  powerless in that exercise.\n\nMr. MURPHY. Feeling like there was nothing you could do and watching  your elected leader stand by and allow for this reality to continue to…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…bill will go up  to $1,400 a month. He has about 40 employees, and they would see  premium hikes, as well. Lester says: It is a lot of money for people. I  think everyone is feeling the anxiety.\n\nHe is worried about his family and the families of those 40  employees.\n\nI heard from Bron Hansboro, the owner of The Flower Guy Bron, a  Richmond small business:…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…all too familiar with the harms left  behind from an unregulated mining industry. Over a century of mining  left polluted waters, poisoned land, and generations of families  feeling the health impacts, including my own. Tribal nations had their  lands stolen and sacred sites desecrated by the mining industry.\n\nSome may argue that the mining industry is…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699693/critical-mineral-dominance-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…of their grocery bill.\n\nNow, to make matters worse, the Trump administration has unilaterally  paused Federal food assistance and canceled shipments to food banks. We  are feeling it. By withholding food and funds, the new administration  has turned its back on the American people.\n\nThey feel the rising prices, and they feel the harm. Food banks in…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690437/empty-shelves-at-food-banks"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…$4, and it looks like it's getting       smaller.\n\nI know what she means. Tria and Esther are not alone in their shared  frustration. Working families across the country are feeling the  squeeze at the checkout counter and are having to cut back on spending  for the holidays.\n\nThis struggle has been exacerbated for several reasons, one of them  being…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…institutional       support and recognition of the unique barriers to college       completion for parenting students. Pregnant and parenting       students often experience feeling disconnected from the       larger education community and are not aware of who they can       speak to when they experience discrimination because of their       pregnancy…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…cares about  is his rich as hell--those were his words--his rich as hell donors and  helping them make more money.\n\nLet's be clear. Energy prices are too high. Americans are feeling  those high prices. Energy prices have been on the rise for the past  decade. And last year, one-third of Americans had to cut back on  necessary spending in order to pay…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688155/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…this bad? Why have we ignored the vast majority of Americans who  want us to get it under control? Why have we ceded our democracy to the  highest bidder? I am not alone in feeling exasperated and feeling  frustrated and being angry.\n\nAs we look back at 16 years, in the wake of the Citizens United  decision, we should be honest with ourselves: Our politics…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699106/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…values shine  through in all he does today. Over forty years ago, Ronnie opened his  own business, Hair Innovations, where he provides salon services and  keeps New Mexicans feeling like the best versions of themselves to this  very day.\n\nKeeping a small business open in today's economic environment is no  small feat, and Ronnie has endured many challenges…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699893/recognizing-ronnie-torres"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…another to Big Oil from our friends across  the aisle.\n\nRepublicans just can't get enough, and so we are back here once again  giving another favor to Big Oil. One gets the feeling that the majority  is just warming up and that this is going to be a recurring theme in  this Congress.\n\nMeanwhile, we are 1 week away from a government shutdown. We are on…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…together to take on tough fights, including for families facing high  costs. This was a bipartisan initiative because across Virginia and  across the country families are feeling the squeeze.\n\nHousing costs are up, childcare is expensive, and utility bills are  rising. In Loudoun County, tolls add an extra burden to the cost of  getting to work.\n\nThis…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693866/recognizing-the-remarkable-work-of-sewa-international"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…want to raise prices on customers, but  the tariffs have made it impossible to plan for his business and for  his future.\n\nThey are not alone. Businesses, small and large, are feeling the pain  all across the Commonwealth. They are unable to plan, unable to predict  what this administration is going to do, and in many cases unable to  keep their employees,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691978/recognizing-fauquier-high-school-class-of-2025"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…the One Big Beautiful Bill Act, every step of  the way, the only people trying to block that effort have been  Democrats in Washington.\n\nThey are getting nervous. They are feeling the heat from people back  home, Mr. Speaker, that are angry, saying why did you vote--those  waiters and waitresses, who make $32,000 a year, when they keep hearing  them…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693719/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…here as  Republicans is putting more money in your pockets, creating more  opportunities for the American people, for American families, and  families all across America are feeling it today.\n\nAmericans are no longer seeing these sky-high increases in prices  like we experienced over the 4 years of the Biden administration--not  at all.\n\nFive years ago,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699081/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…we discuss these proposals that are important to  American families and taxpayers.\n\nMr. Speaker, I am just a little confused. My colleague mentioned  ``whiplash,'' and I am feeling a little whiplash over here because  Democrats liked Elon Musk. Then, the minority hated Elon Musk. Now, my  Democratic colleagues like him again?\n\nI am just a bit confused…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…deal with this issue of rising inflation and the increasing cost of  living.\n\nPresident Biden's policy, no doubt, contributed to the pain that  families were and still are feeling in their paychecks.\n\nOf course, it is one thing to identify a problem, but it is harder  still to do something about it. There is, obviously, no silver bullet  that can magically…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…benefits. Inevitably, they will  find the percentage of people getting married when they have children  falls because the generosity of the programs is such that there is a  feeling of: Why would I get married at all?\n\nThese programs also cause cheating or breaking the law because, of  course, they frequently don't catch it if you are getting cash off…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…elective.  Kate Millett, the mother of these classes, said: The complete  destruction of the traditional marriage and the nuclear family is the  utopian goal of feminism.\n\nI have a feeling a lot of people don't realize that the utopian goal  of feminism was to get rid of the nuclear family. Obviously, Kate  Millett's successors are probably thrilled that we…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…so, in practice, that means  less operating room during heat waves and higher costs right when our  citizens need power the most--all of our citizens.\n\nHoosiers are already feeling it. According to the U.S. Energy  Information Administration, Indiana's average home electricity prices  are up roughly 11.5 percent year over year, and the Trump  administration…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695511/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-emissions-budget-and-allowance-allocations-for-indiana-under-the-revised-cross-state-air-pollution"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…might. I  have always been opposed to proxy voting. I would say to my colleagues,  both on the other side of the aisle and my side of the aisle, if I were  to ever break that feeling that it is not the right way to run this  body, this might be the one that would tempt me. Yet, we can't.\n\nEven though we are looking now at a certain class that we are all…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…waste, prevent delays in care, and ensure that taxpayer dollars  are spent efficiently. Most importantly, it will help restore trust in  a system that too often leaves veterans feeling frustrated and  forgotten.\n\nMadam Speaker, I respectfully urge my colleagues to support this bill  and join me in making a practical, bipartisan improvement to the care  our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695398/va-hospital-inventory-management-system-authorization-act"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…more of my colleagues have signed up to cosponsor this important  legislation. They have said: No more. Our heroes have to be able to do  their jobs to protect us without feeling threatened in the execution of  their duties.\n\nThe legislation would make it illegal for anyone, after being told to  stay back, to knowingly come within 25 feet of a Federal…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697550/halo-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…tax relief for seniors by lowering taxes on Social Security benefits,  because the key to affordability is bigger paychecks, not bigger  government.\n\nPeople are going to be feeling the effects of these tax savings in  their pocketbooks this tax season, where Georgia families can expect up  to $5,000 in savings. By unleashing American energy, we are bringing…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699063/how-republicans-have-delivered-for-americans"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…the  emergency siren is blaring. After 4 years of reckless regulations and  restrictions by the Democrat administration, energy prices have jumped  31 percent. Families are feeling it all across the country. To most  Americans, this is the definition of an energy emergency. To Senate  Democrats, it is an inconvenient truth.\n\nToday, Democrats are trying…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688189/energy"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…results for the  American people. We have seen real results on our southern border as  illegal crossings and the flow of illicit drugs has dropped  significantly.\n\nFamilies are feeling real relief at the gas pump and grocery store as  their wages are going up and opportunities are increasing. In our  schools and military, the emphasis is, once again, on…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699279/highlighting-republican-successes-in-2025"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…dark\n\nWith elapsed some eighty years,\n\nThe adults' heartfelt davening (praying) with painful       groaning\n\nOf weighing memories while searching for the light,\n\nGratefully feeling still the loving hands faithfully\n\nPlaced on my curly head by proud Grandpa Zvi,\n\nSon of martyred Rabbi Yaacov and Dena of Zamosc,\n\nWith radiant grandma Rachel smilingly approving,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699495/recognizing-remarks-of-rabbi-dr-israel-zoberman"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…even when it is  difficult, even when it is uncomfortable, and even when the outcome is  uncertain. This is one of those moments.\n\nMr. Speaker, some of my colleagues may be feeling pressure today to  accept the veto. I get it. However, I would ask every Member to  consider the pressure felt by the communities they represent,  especially those in rural…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698701/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}]