[{"senator": "Val Hoyle", "party": "Democrat", "sentence": "…land passes to certain groups,  including U.S. military members and veterans. This legislation builds  on this framework by waiving entrance, standard amenity, and day-use  fees at over 2,000 Federal recreation sites for law enforcement  officers and firefighters.\n\nThese hardworking Americans put their lives on the line to protect  and serve our communities…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693929/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…threatens to  upend the district's economy, shutter small businesses, and disrupt  south Florida's tourist industry.\n\nAs it is currently written, this bill would impose excessive fees on  employment authorizations sought by asylum seekers and individuals  holding temporary protective status to work in the United States. At a  time of unprecedented worker…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691528/protecting-south-florida"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…two large grocery chains that would have raised food  prices; it worked to cap the cost of inhalers to $35 by challenging  anticompetitive patent practices; it took on hidden fees in the  ticketing and lodging markets; it unveiled rules to make it as easy to  stop a subscription as it was to start it; and it has worked to rein in  the monopoly power of…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689985/confirmation-of-mark-meador"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Republicans'  policies. We are already seeing inflation rise on consumer  goods as Trump's tariffs take place. Now, Republicans want to raise the  cost of auto loans, credit card fees, and mortgages for Americans by  forcing the dollar to become a relic of the past. That is why I will  vote ``no.''\n\nFurther, Mr. Speaker, Mr. Himes made a great argument and…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693736/anti-cbdc-surveillance-state-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…the SEC adopted a rule that  inadvertently discouraged capital flows into BDCs, constraining their  ability to serve small business. The rule is part of SEC's Acquired  Fund Fees and Expenses framework. AFFE requires mutual funds and other  investment vehicles that invest in BDCs to disclose as management fees  of the mutual fund the expenses and the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692711/access-to-small-business-investor-capital-act"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…them into  stone, prohibiting us from revealing them, no matter how painful they  get. Then they are pushing the costs even higher. Today, they are  voting to raise overdraft fees.\n\nAfter crashing the economy, eliminating jobs, and destroying people's  retirement savings, they are making it more expensive to be short on  money by $225 a year per family.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689842/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…healthcare in my  district, it also impacts our number one economy, which is healthcare  systems and hospitals.\n\nAdditionally, I introduced legislation to crack down on junk fees  that would drain family budgets, and I have worked in a bipartisan  manner to lower costs and improve clean water infrastructure in  communities that need it the most.\n\nI have…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699255/2025-final-priority-results-survey"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…all recognize it, and we all must  address it.\n\nOur federal budget operates on principles no different from those of  a business or family budget. Revenues come from taxes and fees, and  expenses from government operations. When revenues exceed expenses, the  government runs a surplus. When expenses exceed revenues, the  government runs a deficit.\n\nThe…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689288/introduction-of-the-sustainable-budget-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…found that 80 percent of payday loans are rolled over or renewed within  2 weeks. This practice can subject borrowers not just to high nominal  interest rates but also to high fees that can quickly surpass the  amount of money originally borrowed. These are hallmarks of predatory  lending and poor underwriting.\n\nAccording to a coalition of community organizations,…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699792/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…the Consumer Financial Protection Bureau, to stop  scams and protect everyday people. One of the most important things  they have done  recently: They capped bank overdraft fees at $5. If your account goes a  few dollars negative and your check bounces, the bank cannot charge you  more than $5. Most banks charge between $25 and $35. Again, the cap is…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689850/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…hard-earned dollars through market  losses.\n\nIn week 2 of liberation month, the Republican majority proposes S.J.  Res. 18 which will increase the annual cost of bank overdraft fees on  American families by an average of $225, collectively liberating all of  us of 5 billion more of our dollars in a given year.\n\nRemember, the average debit card overdraft…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689853/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…practices.\n\nLet me be absolutely clear: Overdraft protection is a profit center  for big banks disguised as a service fee. These institutions made over  $9 billion from overdraft fees last year alone.\n\nWhen a constituent in my district gets a $35 charge for a $5  purchase, that is not covering bank costs, that is a 700 percent markup  designed purely to boost…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689851/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…They  close down branches all throughout the communities. They lay off the  workers. They need less workers, and so they start laying them off.  They raise interest rates and fees on their customers.\n\nWe lose relationship banking, community involvement, and a personal  touch from your neighborhood bank. When these big bank mergers come in,  you don't…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Complex, demonstrating  the arbitrary nature of limiting commercial filmmaking and photography  to Union Square.\n\nThis bill would provide the Capitol Police authority to charge fees  to cover any costs incurred by the Architect of the Capitol (AOC) for  permit approval. The fees would be deposited into the Capitol Trust  Account, which was established to…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699181/introduction-of-a-bill-to-permit-commercial-filmmaking-and-photography-on-the-grounds-of-the-us-capitol"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…the SAVE Act does allow Americans to use their  passports to register to vote, but one-half of all Americans do not  have a passport, and a passport costs $130 plus additional fees. So the  SAVE Act would cost American voters who do not have passports billions  of dollars to secure them.\n\nAmericans are facing rising costs exacerbated by the recent Trump…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…nullifying  the Consumer Financial Protection Bureau's disastrous overdraft rule.\n\nLet me set the record straight, Mr. Speaker. This resolution of  disapproval doesn't increase fees, as my friends on the other side of  the aisle insinuate. In fact, what it does do is it invalidates a  regulation that will take this critical lifeline away from many of my…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689846/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…the professionals who have a legal obligation to maximize return for  the investor.\n\nPlan fiduciaries go through an extensive selection and monitoring  process, evaluating fees, risks, performance, and how each option  compares to available alternatives.\n\nIf the plan fiduciary places pooled asset funds, like mutual funds,  on the investment menu, the…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699155/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…6500) to extend duty-free treatment provided with  respect to imports from certain countries in Africa under the African  Growth and Opportunity Act, to extend customs user fees, and for other  purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 6500\n\nBe it enacted by…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…small business owner in Cheyenne uses a traditional payment  system to send a payment to a supplier overseas, they face delays up to  10 days and 2 to 5 percent transaction fees. This isn't just  inconvenient; it is a competitive disadvantage to American businesses.\n\nBut digital assets change all that. Stablecoins can complete these  same transactions…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691665/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…agents. As I  said before, the SCORE Act affirms the right of student athletes to  make money by endorsing products and services. To protect the athlete,  the SCORE Act caps agent fees at 5 percent of each contract's value.\n\nThe SCORE Act also allows for revenue sharing amongst student  athletes. Under this bill, up to 22 percent of the average athletic  revenue…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…plentiful.\n\nWhat has happened? Government decided to solve what socialists viewed  as problems.\n\nTo solve suburban sprawl, the socialists began imposing severe limits  and costly fees on construction permits. Builders could no longer  profit from building vast numbers of affordable homes, so they focused  their limited permits on the pricier models.\n\nTo solve…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697036/government-is-still-the-problem"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Californians have been paying an extra  fee on their phone service. This was due to legislation enacted by the  legislature and signed into law by the Governor. All of these fees were  collected for the purpose of creating a next-generation 911 system,  which, honestly, is something we need. The system is quite outdated,  antiquated, and not up to the…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "French Hill", "party": "Republican", "sentence": "…reforms to strengthen the public engagement       process;\n\n(xi) reforms to protest petition statutes;\n\n(xii) the standardization, reduction, or elimination of       impact fees;\n\n(xiii) cost-effective and appropriate building codes;\n\n(xiv) models for community benefit agreements;\n\n(xv) mechanisms to preserve affordability, limit disruption       of…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…investments based on environmental, social, and governance, or  ESG, factors. That is not free market. That is not capitalism.\n\nIt is proven that ESG factors often charge steeper fees, carry higher  risks, have lower returns, and are well-known underperformers. That is  precisely why this rule garnered bipartisan, bicameral disapproval in  the form of a Congressional…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699156/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…onto those reforms, in March, the President signed a  continuing resolution that provided authority for the Department of  Health and Human Services to collect registration fees from organ  transplant member institutions. This ensures the 2023 law can be  implemented properly.\n\nI encourage all Americans to consider being an organ donor and  understand…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690102/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…Additional Actions by Court.--The court shall, upon       granting a motion under this section, take any additional       action necessary to grant the movant full relief.\n\n``(g) No Fees.--A person may not be required to pay a       filing fee, service charge, copay fee, processing fee, or any       other charge for filing a motion under this section.\n\n``(h)…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…(B) does not engage in an active role in any investment       negotiations between the issuer and investors attending the       event;\n\n(C) does not charge event attendees any fees other than       reasonable administrative fees;\n\n(D) does not receive any compensation for making       introductions between investors attending the event and       issuers,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692725/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…family and community.\n\nI congratulate Manager Lester Gaunt, Coach Rick Baxter, Coach Rick  Bills, and players Mallory Bailor, Aubrey Baxter, Reagan Bills, Sadie  Divido, Kennedy Fees, Camilla Gaunt, Adalyn Hines, Mara Keefe, Kendal  Schilling, Leilah Schilling-Mansour, Haley Shepherd, and Nevaeh  Worthington.\n\nMadam Speaker, on behalf of everyone in Pennsylvania's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694805/critical-supply-chains"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…healthcare system.\n\nThis legislation supports the improvement of the Organ Procurement  and Transplantation Network by allowing the Secretary of HHS to collect  member registration fees to support the operation of the OPTN.\n\nThis bill also helps secure our medical product supply chain by  requiring the FDA to establish an office in a country that has signed…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697279/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…requirements; disclosure of information. Sec. 12. Closed Area stowage requirements. Sec. 13. Observers. Sec. 14. Technical assistance. Sec. 15. Arbitration. Sec. 16. Disposition of fees, penalties, forfeitures, and other moneys. Sec. 17. Additional agreements.       SEC. 2. AMENDMENT OF SOUTH PACIFIC TUNA ACT OF 1988.          Except as otherwise expressly…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691006/south-pacific-tuna-treaty-act-of-2025"}]