[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…departments,  and ultimately the Terrell County Sheriffs Department. Each step in his  career was a step closer to a life of service, each job a small promise  kept to his fellow citizens.\n\nIn 1992, the people of Terrell County placed their trust in John  Bowens and elected him, Sheriff. That trust was repaid every day, for  32 years. He served longer than…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699826/in-memory-of-sheriff-john-bowens"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…hospitals. It increases health insurance premiums for the  majority of Americans. Let me repeat: It increases premiums paid by  everyday Americans--the majority of our fellow citizens.\n\nHealth insurers are already proposing a median premium increase of 15  percent in 2026. That will be the largest in 5 years, and that is just  an estimate. You know,…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694385/9999"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…perfect future.\n\nMost of all, I believe in the fundamental goodness and fairness of  the American people.\n\nWhen we move beyond slogans, when we truly see each other as fellow  citizens on one shared journey, we find that what unites us is far  greater than what divides us.\n\nWhile the temptation is great, we cannot let this moment divide us.  We were…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690322/ending-of-dei-programs-through-executive-order"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…searching them and assaulting them.  And the parallels are unmistakable and frightening. We cannot, in this  body or anywhere in our great country, stand idly while our fellow  citizens are rounded up and subjected to this treatment. We should not  be standing idly as any human being, whatever their status, is  subjected to this kind of abuse.\n\nI will…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699087/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…cut  across the board for everyone. If Trump continues down his path of not  paying for benefits, it will be over a 36 percent cut. There are over 5  million Americans, fellow citizens, who have paid in all their life and  got nothing back from the government because Congress has not acted.", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688584/congress-has-not-enhanced-social-security-in-more-than-50-years"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…of exporting this injustice nationwide on a much  greater scale. Senator Padilla is right to sound the alarm about this,  and I am proud to join him. We want to help our fellow citizens  participate in our elections because only their participation will  ensure that the government is truly accountable to the people it  represents. And as the ranking member…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…showed  real leadership when he summoned this Congress to rise to the occasion.\n\nIn that second annual message to Congress on December 1, 1862,  President Lincoln said:\n\n``Fellow citizens, we cannot escape history. We of this Congress and  this administration will be remembered in spite of ourselves. No  personal significance or insignificance can spare…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "Mr. HOYER. Mr. Speaker, I rise to note the extraordinary act of  patriotism of one of our fellow citizens. I rise today to thank  MacKenzie Scott, formerly the wife of Jeff Bezos, for donating $50  million to Bowie State University, the largest single contribution in  the…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698077/thanking-mackenzie-scott"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Republicans let the premium tax credits expire.\n\nThis isn't me saying it. This is the CBO saying it, that the  majority's bill is going to throw millions and millions of our fellow  citizens off of their healthcare. Republicans are doing it and are  going forward with it like it is no big deal.\n\nAt the same time, my colleagues on the other side of the aisle…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…with them, and then the credibility you  bring to this discussion about the importance of the role of the  legislature to make the decisions about whether you and your fellow  citizens, the folks who made the decision to step forward and serve our  country--whether we, as elected representatives, have the  responsibility to make the decision whether…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696567/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…our National Guard, our Connecticut  National Guard. As I say, when you call out the National Guard, you  call out America, and they should not be abused to police their fellow  citizens, to act as local police in missions that they are not trained  or equipped to handle.\n\nI fear for the future of our National Guard and the future of our  military if the…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…the National Guard is patrolling, and  ICE agents are dramatically ramping up raids across the city, citizens  are starting Instagram pages and Facebook groups to inform fellow  citizens of their rights. Parents are patrolling schoolyards to protect  the rights of students and other parents. Around the country  journalists are investigating and relentlessly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…their lives for the first time in  history and fought not for power or land, but for the liberation of  others from tyranny during World War II.\n\nOver 2 million of our fellow citizens bore the injuries from that  conflict. In the decades that followed, our Nation and our allies  became prosperous not by closing our doors to the world or hiding from…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "John Rose", "party": "Republican", "sentence": "…means to serve your country, and my office will continue to       work tirelessly to prosecute those who illegally seek       personal gain at the expense of their fellow citizens.''\n\n``Corruption and fraud in U.S. Army programs jeopardize the       safety and security of our Soldiers and their families. When       discovered, fraudulent activities…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695237/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…various  nationalities and backgrounds. To this day, Orthodox  Christians throughout Louisiana who worship in churches across our  State are held in high regard by their fellow citizens.\n\nWe are pleased that during this visit to America, Ecumenical  Patriarch Bartholomew will, as he has during previous trips, meet with  our President at the White House…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695653/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…Walmart make him one of America's true success stories,  and not only that, but his spirit of charity and funding opportunities  for young entrepreneurs and in healthcare for fellow citizens.\n\nI am proud of what he has accomplished and the inspiration he has  given to thousands of people who have had the privilege of serving  under his leadership.\n\nMr. Speaker,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698690/recognizing-doug-mcmillon"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…months ago, I had the  privilege of speaking at a naturalization ceremony for brand-new  American citizens who took their oath to the United States and  officially became fellow citizens. I was inspired by each of their  journeys in becoming Americans and couldn't help but feel blessed to  have been born in a land that so many people seek to call their…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694111/americas-borders-are-safer"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…from compassionate, as a citizenry, to  continue to release career criminals. I would offer to yourself and the  country, Mr. Speaker, for your consideration, maybe my fellow citizens  have to realize that the best shot that some of these guys that are in  the game on the criminal side of this thing, the best shot they have at  rehabilitation is jail,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…increasing challenges and adversity, they show up  every day--facing risk and uncertainty--not for the recognition, but  out of a deep commitment to protect and serve their fellow citizens.  Their courage is matched by the strength of their families, who live  with the daily reality of what that service demands.\n\nThese public servants are more than officers.…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690972/national-police-week-2025"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "…serving our communities.\n\nThese families, often referred to as the Gold Shield families, carry  an unthinkable burden of loss. It is our duty not just as lawmakers but  as fellow citizens to ensure that their sacrifice is never forgotten  and see that their families are taken care of after they are gone.\n\nAn astounding example of this mission and inspiration…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691022/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…have, too, Mr.  President. In many countries, if you get down on your luck, they will  let you die in a ditch. But not in America. Not in America. We take  care of our fellow citizens. But it is expensive. We spend trillions of  dollars a year to do this, and that money we spend didn't just fall  from Heaven. We thank Heaven for it, but it came out…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…chemical or surgical mutilation of our  warfighters and their dependents under the guise of healthcare.\n\nOur government should not be in the business of mutilating our fellow  citizens, particularly our warfighters, with our tax dollars and with  your tax dollars, Mr. Chair.\n\nThis does not serve to advance our national security. It serves only  to advance…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…officers the ability to conceal carry firearms where it  may normally be restricted.\n\nOur law enforcement officers are committed to protecting their  communities and their fellow citizens, and they receive rigorous  training throughout their careers. By allowing these brave men and  women the opportunity to conceal carry where it is normally restricted,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690998/delivering-on-president-trumps-agenda"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…every community in this State.  You see your favorite restaurant or another cherished small business  that suddenly closes its doors for good, and you see so many of our  fellow citizens who are lacking the sort of opportunities that a well- governed State would allow them.\n\nSo I would hope that if anything could be a wake-up call, then this  latest stunning…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}]