[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Columbia Residents in the Bureau of Prisons Act of 2025.  This bill would require the Federal Bureau of Prisons (BOP) to place  D.C. residents serving sentences for D.C. Code felonies in BOP  facilities within 250 miles of D.C. Under the National Capital  Revitalization and Self-Government Improvement Act of 1997, individuals  serving sentences for D.C.…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690140/introduction-of-the-improving-reentry-for-district-of-columbia-residents-in-the-bureau-of-prisons-act-of-2025"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…America, you have to be a U.S. citizen to vote in a Federal election.  If you are not, you are subject to penalties for attempting to register  to vote, and you are subject to felonies and deportation if you do vote  and are not an American citizen. That is the current law.\n\nI also remind my friend, the gentleman from California (Mr.  McClintock), that an…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…what the Constitution  allows for impeachment, you can be brought before this body by way of  impeachment.\n\nYou can be brought before the Congress if you have committed 34  felonies. If you have committed 34 felonies, you can be brought before  the Congress for impeachment if you happen to hold one of the offices  presented to us by way of the Constitution…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…House and as an American citizen.\n\nToday, President Trump signed the Epstein documents release bill.  Lots of women were up here who were victims of Jeffrey Epstein's sexual  felonies, and they celebrated when the House passed it and the Senate  passed it, but it is clear today that classified documents therein will  not be released and documents that might…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697016/justice-should-be-required"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the Bail       Reform Act of 1984 fall within that carefully limited       exception. The act authorizes the detention prior to trial of       arrestees charged with serious felonies who are found after       an adversary hearing to pose a threat to the safety of       individuals or to the community which no condition of release       can dispel. The…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696979/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…even the  author of this bill has a story, too, before he tries to lecture D.C.  on safety.\n\nIt would be complete hypocrisy to have, hypothetically, someone  convicted of 34 felonies to lecture D.C. on what to do with youthful  offenders who have been scientifically shown not to have fully  developed brains under the age of 25, especially if said multi-count…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695555/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…She gets to use the warden as a go-between with  people outside of the institution.\n\nMr. Speaker, she had due process. Donald Trump had due process. He  was convicted on 34 felonies, but he had the right to counsel. He had  the presumption of innocence. He had a unanimous jury trial. They had a  right to cross-examine everybody and put their own witnesses…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…America  work. We should be putting that money into finding criminals that the  FBI should be finding.\n\nWe have a crime problem. That should be first. The people committing  felonies, rapes, murders, and child sexual abuse is what they said they  were going to go after in the immigration fights. Yet, now they are  going after statistics and records for…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693518/more-funding-for-fbi"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…serious crime, and it should denote serious  consequences.\n\nFurther, if a person is here illegally, commissioning and being  convicted of a felony is not a victimless crime. All felonies have a  victim.\n\nEnough is enough.\n\nIn the current state of the law, we must wait for an American to be  harmed before significant punishments are issued to those who are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…Those violent offenders were violent before they got  there.\n\nLet me talk about a couple of them. Do my colleagues want to defend  Steven Cappuccio? He was convicted of six felonies, including  assaulting a police officer.\n\nMr. Speaker, he was together with David Dempsey. David Dempsey was  sentenced to 20 years. He stomped on a police officer's head,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691168/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…heard of and the government can  still throw the book at them.\n\nEven former Harvard University Professor Harvey Silverglate estimates  that the average American commits three felonies a day without even  knowing it.\n\nDr. Silverglate clearly wasn't referring to violent felonies like  murder or felonies like money laundering or fraud, but instead to those…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697204/count-the-crimes-to-cut-act"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…chewing something.\n\nMs. Plaskett mentioned that she had multiple, multiple texts.  According to the records--and I don't know how many of her texts came  from those convicted of felonies, but at 2:25, minutes before Plaskett  began questioning Cohen at 2:28, Epstein messaged back ``Good work'' at  2:34, 1 minute after Plaskett finished her questioning of Cohen.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696890/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}]