[{"senator": "Lucy McBath", "party": "Democrat", "sentence": "…programs which support police departments and reduce  violent crime, hate crime, and crime against women.\n\nMr. Speaker, $646 million from the Federal Emergency Management  Agency, FEMA, for violence and terrorism has been terminated. I can go  on and on, but I won't.\n\nThese terminations include a grant totaled at over $8 million to the  National Policing Institute,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…major disasters. Unfortunately, I just  saw while we were waiting to start this process a few minutes ago, we  had three major natural disasters today across the country, but FEMA is  under attack, and the funding is being cut.\n\nWith respect to reconciliation, as we just talked about a moment ago,  the $881 billion in cuts to Medicaid are a shocking development.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…No. 40, ordered the suspension of EV charging funding.\n\nNo. 41, tried to rename the Gulf of Mexico.\n\nNo. 42, illegally rescinded $80 million in congressionally  appropriated FEMA funding for New York City bank accounts.\n\nNo. 43, fired--and then rehired--over 300 staffers at the National  Nuclear Security Administration, jeopardizing  the security of…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…all the law  enforcement that are working in the community, all the work that the  Governor's office is doing, all the work that we are--a partnership we  are now getting from FEMA, the Army Corps of Engineers, and Homeland  Security to try to address this as a national emergency and clearly to  try to gather information about the direct economic impacts…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…how he talks.\n\nWe know now why he threw a fit and acted so defensively--because,  sadly, we may well have been right. Donald Trump and Kristi Noem have  spent months attacking FEMA, calling for its elimination, slashing its  budget, and hollowing out its workforce. And, now, their own chaos is  catching up with them in the worst, worst way.\n\nNow, they…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693517/central-texas-floods"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…in  sensitive locations like courthouses and schools. That is 20 times more  agents, arrests, and illegal detention centers. Further, the Trump  Administration is diverting FEMA funds away from disaster recovery to  build and operate an inhumane new prison for migrants in Florida. This  funding will fuel more cruel actions and set our country on a more…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…people who lose access to the food benefits and  lose access to their healthcare in the HUD funding bill could lose  access to rental assistance, as well.\n\nI heard a lot about FEMA cuts. We had a water infrastructure  roundtable. I represent cities that have water infrastructure that is  over 100 years old. One of them received a grant to help upgrade…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…political war against universities and scientific research, and  illegally froze over $400 billion in congressionally appropriated  funds, including billions of dollars to FEMA, to everyone from local  firefighters to States that have been affected by natural disasters.\n\nThis White House has issued hundreds of controversial executive  orders, many…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…pass this legislation that will protect Federal workers from  attacks that threaten their livelihoods and their families.\n\nFederal workers are the backbone of our Nation. From FEMA teams  helping wildfire survivors to VA staff caring for our veterans to  Social Security workers making sure seniors can live with dignity,  these are the people who serve…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697870/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "Ms. ROSS. Mr. Speaker, I rise today with grave concerns about Donald  Trump's proposal to eliminate FEMA.\n\nIn September 2024, western North Carolina was ravaged by Hurricane  Helene, the most devastating storm in our State's history. We lost over  100 lives, and countless communities…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693055/president-trumps-proposal-to-eliminate-fema"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…robust funding and support, which is just what this bill delivers.\n\nWith the administration's aggressive funding and staffing cuts,  however, at the National Weather Service and FEMA and the increasing  severity and frequency of natural disasters due in my opinion to  climate change, the risks associated with those disasters continue to  rise.\n\nUnfortunately,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694198/coast-guard-authorization-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…let it happen again.\n\nThis administration has broken that promise. They have hollowed out  our national emergency response systems and are floating the idea of  eliminating FEMA altogether. That is not leadership. That is  negligence.\n\nDisasters don't care about ideology. In the last year, we have seen  natural disasters in California, Texas, North…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694969/20th-anniversary-of-hurricane-katrina"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…on the funds that they were  provided under reconciliation, but we cannot say the same thing to  other departments or other agencies under DHS, especially when we talk  about FEMA. FEMA gets $5.7 billion, including $3.8 billion for Federal  assistance, which is a 20-percent increase above fiscal year 2025.  Again, that money goes back to help firefighters…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699346/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…Border Patrol, when we needed  more resources. She sat in my office. I invited her in. And she told me  how she was a former Governor. She had received Federal support through  FEMA. She knew what it was like, and she was going to uphold those same  things that she depended on as a Governor, when it came to being the  Secretary of Homeland Security.\n\nSo…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…department from Milwaukee, for example, responded to over  600 calls, rescuing people from their cars who were trapped by the  surging floodwaters.\n\nAt Governor Tony Evers' request, FEMA teams have worked alongside  State and county authorities to fully assess the damage wrought by this  flooding. With that work largely done now, the Governor has requested a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695324/recognizing-milwaukees-severe-flooding"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…yielding.\n\nThis bill would nullify President Trump's Executive Order No. 14251,  which rightly excluded 40 national security agencies from collective  bargaining.\n\nAgencies like FEMA, the Coast Guard, the CDC, and the VA cannot  afford to be paralyzed by union red tape when lives are on the line.\n\nI want to emphasize that this is going to nullify an executive…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697990/protect-americas-workforce-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Americans, help from the Federal Government after a  natural disaster can take too much time to arrive. This bipartisan bill  authorizes the Treasury Department, in consultation with FEMA, to  postpone tax filing deadlines for Americans living in State-declared  disaster areas just as they do for federally declared disasters.\n\nIf a State moves faster in declaring…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689383/filing-relief-for-natural-disasters-act"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…in the tax code and ensure that  disaster victims are able to receive more timely relief.\n\nNumber one, it will authorize the Secretary of the Treasury, in  consultation with FEMA, to extend filing relief to taxpayers as soon as  the Governor of the State declares a disaster or a state of emergency.\n\nNumber two, Mr. Speaker, it will expand the current…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689382/filing-relief-for-natural-disasters-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…administration to end Risk Rating 2.0.\n\nIn 2019, my office worked with the Trump administration to  successfully delay Risk Rating 2.0 because of the lack of transparency  as to how FEMA was calculating the rates. President Trump understood  then and understands now that Americans are tired of being ripped off.\n\nWhen rivers swell, when coastlines have rising…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691629/risk-rating"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…them all for their dedication and effort.\n\nI also remind everybody, because we get tied up in a lot of stuff,  that, essentially, the Homeland Security bill is the Coast Guard, FEMA,  TSA, Secret Service, Border Patrol, and ICE. There are other parts in  there, but that is the majority of what we are talking about. Homeland,  what is that? That is the agencies…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699349/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…Department of Public Safety, the Mississippi Department of  Transportation headed by Brad White, Mississippi State Department of  Health, and Mississippi Forestry Commission. FEMA has also been on the  ground, providing $3.75 million in rapid emergency funding from  generators to tree removal and other urgent needs.\n\nI want to also recognize the extraordinary…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699701/9999"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…and that the vast majority of the funding in this bill-- more than 80 percent--is for nonimmigration and nonborder security  functions.\n\nIt includes, for example, funding for FEMA. We have just gone through  a horrific storm that has caused a lot of damage, and FEMA is very  important. It includes funding for TSA. Those of us who travel back and  forth…", "date": "2026-01-26", "source_url": "https://justfacts.votesmart.org/public-statement/1699384/appropriations"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…built strong partnerships with local, state, and federal leaders,  ensuring UWPC played a key role in disaster response and community  resilience efforts, including managing FEMA allocations and emergency  shelter coordination. Beyond programmatic and financial  accomplishments, Charles leaves a cultural legacy of collaboration,  compassion, and forward-thinking…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690203/recognizing-chuck-anderson"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…President, what you see depends on where you sit.  Last Friday, it was announced that the BRIC Program, or the Building  Resilient Infrastructure and Communities Program, run by FEMA would  end, and money which had been allocated would be pulled back from the  States which were receiving it.\n\nNow, most families across the country have not heard of the BRIC…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…gentleman from North Carolina (Mr. Moore), my fellow North Carolinian  and a fierce border security advocate. Congressman Moore has been a  leading voice in the fight to reform FEMA and to ensure its funds go  toward helping American citizens rather than to illegal immigrants,  especially those recovering from Hurricane Helene.\n\nMr. MOORE of North Carolina.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…4058.\n\nMr. GUEST.\n\nMr. Speaker, I rise today in support of H.R. 4058, the Enhancing  Stakeholder Support and Outreach for Preparedness Grants Act, with the  understanding that FEMA's preparedness grants for States, localities,  urban areas, and Tribal and territorial governments are vital to  strengthening the security of this great Nation.\n\nThis legislation…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696945/enhancing-stakeholder-support-and-outreach-for-preparedness-grants-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…know that if there is  anything my office can do to be of any assistance, don't hesitate to  reach out. President Trump has signed a declaration for individual  assistance. FEMA should be on the ground, working with families to try  to help identify any type of assistance that the families in need can  qualify for, and I encourage FEMA to continue to…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690765/recovering-from-north-carolina-floods"}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "…funding  Homeland Security.\n\nThat funding runs out Friday at midnight, and if Democrats allow this  to happen, it won't impact ICE operations, but what it will do is  interrupt FEMA. We just had a major winter storm on the east coast and  parts of the South. FEMA will be interrupted if Department of Homeland  Security is not getting funded.\n\nOur TSA agents…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699924/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…know, they are not wanting to fund DHS, and they are saying:  Oh, it is over ICE. ICE is funded. Their money is going to continue.  But what they are doing, they are defunding FEMA. They are defunding  TSA. So if your flights don't go next week, blame the Democrats.\n\nAnd this week we had a hearing in Judiciary Committee that looked at  another inappropriate…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700058/9999"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…the inability  of families to be able to afford.\n\nWhy are flood insurance premiums so high, you might ask? Flood  insurance premiums have skyrocketed across the country due to FEMA's  new risk assessment system, Risk Rating 2.0. At the heart of the  problem of Risk Rating 2.0 is that with much higher premiums, people  will quickly be unable to afford coverage…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688826/statements-on-introduced-bills-and-joint-resolutions"}]