[{"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "Ms. ELFRETH. Mr. Speaker, I rise today to call attention to this  administration's devastating cuts to FEMA's BRIC program, otherwise  known as the Building Resilient Infrastructure and Communities grants.\n\nTowns like Crisfield in Maryland, Baltimore, and dozens of  communities across…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690467/cuts-to-fema-bric-grants"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…his career in 1995 and worked his way up to  be fire chief. In addition to serving our community, Chief deMetropolis  also stepped up to serve our great country by serving on FEMA's Task  Force 5, which included a 20-day deployment to support Hurricane  Katrina victims.\n\nChief deMetropolis has always led by example by dedicating his life  to keeping the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699624/9999"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…programs which support police departments and reduce  violent crime, hate crime, and crime against women.\n\nMr. Speaker, $646 million from the Federal Emergency Management  Agency, FEMA, for violence and terrorism has been terminated. I can go  on and on, but I won't.\n\nThese terminations include a grant totaled at over $8 million to the  National Policing Institute,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…every single day, come to work, and play by the  rules are funded. In this body, there is agreement that we need to fund  TSA. We need to fund the Coast Guard. We need to fund FEMA, the Secret  Service, and cybersecurity. Those are integral parts of our government.  They serve a great purpose to the American people.\n\nThere is not a shred of difference…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700220/homeowner-energy-freedom-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…my thoughts tonight are with the  millions of Americans who will bear the brunt of this shutdown: the  families in the path of hurricanes who will go without the services of  FEMA, the veterans who will lack many of the helping hands in the VA,  the recipients of Social Security who will be unable to verify their  cards or perhaps receive payments that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695920/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, I rise because I am deeply concerned  about hurricane season and the state of FEMA and our national disaster  preparedness.\n\nA little bit of context: One of the reasons I got involved in  politics was as a student at Tulane University in New Orleans,  Hurricane…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692184/concerns-about-hurricane-season"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…how he talks.\n\nWe know now why he threw a fit and acted so defensively--because,  sadly, we may well have been right. Donald Trump and Kristi Noem have  spent months attacking FEMA, calling for its elimination, slashing its  budget, and hollowing out its workforce. And, now, their own chaos is  catching up with them in the worst, worst way.\n\nNow, they…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693517/central-texas-floods"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…let it happen again.\n\nThis administration has broken that promise. They have hollowed out  our national emergency response systems and are floating the idea of  eliminating FEMA altogether. That is not leadership. That is  negligence.\n\nDisasters don't care about ideology. In the last year, we have seen  natural disasters in California, Texas, North…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694969/20th-anniversary-of-hurricane-katrina"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…No. 40, ordered the suspension of EV charging funding.\n\nNo. 41, tried to rename the Gulf of Mexico.\n\nNo. 42, illegally rescinded $80 million in congressionally  appropriated FEMA funding for New York City bank accounts.\n\nNo. 43, fired--and then rehired--over 300 staffers at the National  Nuclear Security Administration, jeopardizing  the security of…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…and didn't get an  offer back until last night.\n\nMy wish is for my Republican colleagues to be just as upset as they  are about what is going to happen next week at TSA or at FEMA as for  the children that are being traumatized right now in this country, who  are being thrown into what is called the ``Baby Jail,'' outside of San  Antonio; for the lives…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700057/9999"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "Ms. ROSS. Mr. Speaker, I rise today with grave concerns about Donald  Trump's proposal to eliminate FEMA.\n\nIn September 2024, western North Carolina was ravaged by Hurricane  Helene, the most devastating storm in our State's history. We lost over  100 lives, and countless communities…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693055/president-trumps-proposal-to-eliminate-fema"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…robust funding and support, which is just what this bill delivers.\n\nWith the administration's aggressive funding and staffing cuts,  however, at the National Weather Service and FEMA and the increasing  severity and frequency of natural disasters due in my opinion to  climate change, the risks associated with those disasters continue to  rise.\n\nUnfortunately,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694198/coast-guard-authorization-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…wild weather event can hit any one of our States at any  time of its own choosing. And all of our States have been affected at  one time or another.\n\nNow, I want to talk about FEMA. Our experience in Vermont with FEMA  is that it is absolutely essential and actually quite helpful in the  immediate aftermath of the weather event.\n\nFEMA can preposition resources.…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…people who lose access to the food benefits and  lose access to their healthcare in the HUD funding bill could lose  access to rental assistance, as well.\n\nI heard a lot about FEMA cuts. We had a water infrastructure  roundtable. I represent cities that have water infrastructure that is  over 100 years old. One of them received a grant to help upgrade…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…on the funds that they were  provided under reconciliation, but we cannot say the same thing to  other departments or other agencies under DHS, especially when we talk  about FEMA. FEMA gets $5.7 billion, including $3.8 billion for Federal  assistance, which is a 20-percent increase above fiscal year 2025.  Again, that money goes back to help firefighters…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699346/department-of-homeland-security-appropriations-act-2026"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…in the tax code and ensure that  disaster victims are able to receive more timely relief.\n\nNumber one, it will authorize the Secretary of the Treasury, in  consultation with FEMA, to extend filing relief to taxpayers as soon as  the Governor of the State declares a disaster or a state of emergency.\n\nNumber two, Mr. Speaker, it will expand the current…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689382/filing-relief-for-natural-disasters-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…shutting down this Department has real consequences.  Democrats are threatening the work of the Federal Emergency Management  Agency, of the TSA, of key cyber security offices. FEMA training  centers, like the National Fire Academy in Maryland, are closed.  Roughly 45,000 Americans who are in training at one of these centers  can't go to class right now.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700181/state-of-the-union-address"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…yielding.\n\nThis bill would nullify President Trump's Executive Order No. 14251,  which rightly excluded 40 national security agencies from collective  bargaining.\n\nAgencies like FEMA, the Coast Guard, the CDC, and the VA cannot  afford to be paralyzed by union red tape when lives are on the line.\n\nI want to emphasize that this is going to nullify an executive…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697990/protect-americas-workforce-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…know, they are not wanting to fund DHS, and they are saying:  Oh, it is over ICE. ICE is funded. Their money is going to continue.  But what they are doing, they are defunding FEMA. They are defunding  TSA. So if your flights don't go next week, blame the Democrats.\n\nAnd this week we had a hearing in Judiciary Committee that looked at  another inappropriate…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700058/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…built strong partnerships with local, state, and federal leaders,  ensuring UWPC played a key role in disaster response and community  resilience efforts, including managing FEMA allocations and emergency  shelter coordination. Beyond programmatic and financial  accomplishments, Charles leaves a cultural legacy of collaboration,  compassion, and forward-thinking…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690203/recognizing-chuck-anderson"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…colleagues will come to a reasonable agreement so that we can get the  Homeland Security funding bill over the finish line soon.\n\nIt is essential that we get this bill passed for FEMA funding, for  our TSA agents, for our Coast Guard officers, and for our Nation's  cyber security. That is all part of this bill. In fact, I think it is  about 80, 85 percent…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699921/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…Protection--those are all the folks that actually handle customs duties  and produce coming across our border. They defunded the Cybersecurity &  Infrastructure Agency. They defunded FEMA, the Federal Emergency  Management Agency. They defunded the Federal law enforcement training  centers. They have defunded U.S. Immigration and Customs Enforcement-- that is…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700299/government-funding"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…the inability  of families to be able to afford.\n\nWhy are flood insurance premiums so high, you might ask? Flood  insurance premiums have skyrocketed across the country due to FEMA's  new risk assessment system, Risk Rating 2.0. At the heart of the  problem of Risk Rating 2.0 is that with much higher premiums, people  will quickly be unable to afford coverage…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688826/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…for  residents and visitors alike, and the existing A-frame carrying the  city's name remains a treasured piece of that early history. My office  will continue working with FEMA and our State, county, and local  partners to assist with the pier's restoration, ensuring this landmark  endures for future generations.\n\nFlagler Beach has always been defined…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697751/recognizing-lady-lake-florida"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…Department of Public Safety, the Mississippi Department of  Transportation headed by Brad White, Mississippi State Department of  Health, and Mississippi Forestry Commission. FEMA has also been on the  ground, providing $3.75 million in rapid emergency funding from  generators to tree removal and other urgent needs.\n\nI want to also recognize the extraordinary…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699701/9999"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…President, what you see depends on where you sit.  Last Friday, it was announced that the BRIC Program, or the Building  Resilient Infrastructure and Communities Program, run by FEMA would  end, and money which had been allocated would be pulled back from the  States which were receiving it.\n\nNow, most families across the country have not heard of the BRIC…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…know that if there is  anything my office can do to be of any assistance, don't hesitate to  reach out. President Trump has signed a declaration for individual  assistance. FEMA should be on the ground, working with families to try  to help identify any type of assistance that the families in need can  qualify for, and I encourage FEMA to continue to…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690765/recovering-from-north-carolina-floods"}, {"senator": "John Rutherford", "party": "Republican", "sentence": "…programs like VIPR.\n\nIt supports CISA, the Cybersecurity and Infrastructure Security  Agency, which is securing vital infrastructure from adversaries like  China.\n\nIt also provides FEMA with the resources it needs to support  communities following disasters, and it invests in the Coast Guard, who  is keeping fentanyl and other dangerous drugs off our shores…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699353/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…administration to end Risk Rating 2.0.\n\nIn 2019, my office worked with the Trump administration to  successfully delay Risk Rating 2.0 because of the lack of transparency  as to how FEMA was calculating the rates. President Trump understood  then and understands now that Americans are tired of being ripped off.\n\nWhen rivers swell, when coastlines have rising…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691629/risk-rating"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…gentleman from North Carolina (Mr. Moore), my fellow North Carolinian  and a fierce border security advocate. Congressman Moore has been a  leading voice in the fight to reform FEMA and to ensure its funds go  toward helping American citizens rather than to illegal immigrants,  especially those recovering from Hurricane Helene.\n\nMr. MOORE of North Carolina.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}]