[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…scheduling  while we work in a bipartisan fashion to make sure that we give the  most fulsome response possible to this crisis.\n\n724, the Temporary Extension of Fentanyl-Related  Substances Scheduling Act, which is at the desk; I further ask  unanimous consent that the bill be considered read a third time and  passed and that the motion to reconsider…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Just last month, the  Senate passed the HALT Fentanyl Act, which is legislation I  cosponsored, along with a lot of my colleagues, which would permanently  schedule fentanyl-related substances.\n\nImposing tariffs against Canada is not the way to fight fentanyl and  other drugs. This kind of legislation, like the HALT Fentanyl Act, is  something that is…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689483/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…history. All it takes is 2  milligrams--that is a fraction of the size of a penny--to cause an  overdose.\n\nBut we must do more than simply pass this bill. Since fentanyl- related substances were originally scheduled by the DEA, in 2018,  Congress has never allowed this authority to expire. So, by passing  this bill, we are merely maintaining the status…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688848/halt-fentanyl-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Ms. McCOLLUM. Mr. Speaker, I rise in opposition to S. 331, the HALT  Fentanyl Act.\n\nThis bill is not a solution to the proliferation of Fentanyl Related  Substances (FRS) in America. We need legislation and investments in  health interventions that will save lives while taking meaningful  action to stop illicit drug sales.…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692633/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…coupled with the Republicans' attacks on Americans'  healthcare will seriously threaten the improvements we have made.\n\nThe bill before us today permanently schedules fentanyl-related  substances on schedule I of the Controlled Substances Act. This is  based on a class definition disputed by scientists. I oppose this bill  because it is a permanent extension…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "Mr. GRIFFITH. Mr. Speaker, pursuant to House Resolution 489, I call  up the bill (S. 331) to amend the Controlled Substances Act with  respect to the scheduling of fentanyl-related substances, and for other  purposes, and ask for its immediate consideration in the House.\n\nThe Clerk read the title of the bill.\n\nMr. GRIFFITH.  331.\n\nMr. Speaker, unfortunately,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…people into despair, increasing the  amount of people taking illegal drugs for the first time.\n\nSince then, the heartbreaking stories about the toll illicit fentanyl  and fentanyl-related substances have on our communities have continued.  The rate at which Americans are dying from fentanyl poisoning is just  devastating.\n\nIn our first Health Committee…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…very important bill, and I strongly urge that  the House pass this particular bill.\n\nFor far too long, our communities have been plagued by poisonings  from fentanyl and fentanyl-related substances. Every one of our  congressional districts have been affected by this crisis. Kids are  dying. They are dying, and Congress has got to make this permanent.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692342/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Virginia's Ninth District to pass the HALT Fentanyl Act. In 2023,  we saw over 107,000 overdose deaths, 75,000 of those attributed to  synthetic opioids, especially fentanyl-related substances.\n\nCurrently, fentanyl and fentanyl analogues temporarily fall under  schedule I of the Controlled Substances Act, the CSA, due to a  temporary scheduling order that…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692343/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…age. That is  because it is cheap to make, easy to transport, and so potent. Just a  few milligrams can be lethal.\n\nAddressing the spread of illicit and illegal fentanyl-related  substances has been a top priority not only for myself but for many  other colleagues in this House. It is hard for me to believe what I am  hearing from the minority right…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692348/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…yielding.\n\nMr. Speaker, I rise today in strong support of the HALT Fentanyl Act,  which permanently extends President Trump's 2018 schedule I  classification of fentanyl-related substances.\n\nMr. Speaker, the United States is facing a poisoning epidemic, and it  is caused by illicit fentanyl and its related substances that are  pouring over our borders…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692349/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…resolution it shall be in       order to consider in the House the bill (S. 331) to amend the       Controlled Substances Act with respect to the scheduling of       fentanyl-related substances, and for other purposes. All       points of order against consideration of the bill are waived.       The bill shall be considered as read. All points of order…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…Americans continue to die each year from fentanyl  overdoses, and Ohio has been particularly hard-hit by the epidemic.\n\nPrior to the temporary rescheduling in 2018, fentanyl-related  substances could only be controlled individually, allowing cartel  chemists to easily create new uncontrolled compounds. This temporary  rescheduling proved to be effective…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692347/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Mr. Speaker, I rise today in strong  support of the HALT Fentanyl Act, critical legislation to crack down on  the criminals who produce, traffic, and sell fentanyl and fentanyl- related substances.\n\nEarlier this year, we were able to hear powerful testimony from two  of my constituents, Ray and Deb Cullen, who tragically lost their son,  Zach, to fentanyl…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692344/halt-all-lethal-trafficking-of-fentanyl-act"}]