[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Washington, in Olympia, we had a bill  signing, and it is no secret in the State of Washington that a guy  named Tim Eyman is probably the antithesis of what our Governor Bob  Ferguson believes.\n\nHe fights him on all sorts of initiatives to the people about  policies that Mr. Eyman wants to express. So he is a noted individual  in our State.\n\nSo Mr. Eyman…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692451/alex-padilla"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…the  makeup of the FTC by nominating new members--as President Trump has  done by nominating Mr. Meador--and appointing the Chair--as President  Trump did by selecting Mr. Ferguson--and even appointing a new Chair if  the President is displeased with his initial selection.\n\nHad the President not taken this illegal action, Republican  Commissioners would…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689985/confirmation-of-mark-meador"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Congress or the will of the American  people, Donald Trump has commenced an attack on education that we  haven't seen the likes of since the racist segregationist Plessy versus  Ferguson decision declaring separate but equal as an educational  doctrine.\n\nAt a time when racial segregation is increasing in our schools to  levels not seen since before the Supreme…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…vouchers to maintain racism, because  that is what segregation was. It was racism.\n\nI know who he is because I have read about him and what he did on May  18, 1896, in Plessy v. Ferguson, the case that allowed invidious  segregation to bloom and blossom and permeate society.\n\nI know who he is. Some of you don't know. You have not had a chance  to review his…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…Louis Police Department\n\nSpringfield Police Department: The `Use of Force' chart       says tasers are a Level 4 of 6 (6 being ``deadly force'').\n\nBallwin Police Department\n\nFerguson Police Department\n\nLake Winnebago Police Department\n\nJefferson College Law Enforcement Academy                                   MONTANA\n\nMissoula Police Department\n\nMontana…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, today, I rise to recognize Addelynn Ferguson  as  Ohio's 13th Congressional District Champion of the Week.\n\nAddelynn is a junior from Portage Lakes Career Center in Uniontown,  Ohio, and out of nearly 50 participants,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690574/champion-of-the-week-addelynn-ferguson"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…recipient of D  Magazine's Volunteer of the Year Award.\n\nFor more than two decades, Mr. Phillips has dedicated thousands of  hours to serving low-income families through the Ferguson Road  Initiative's Volunteer Income Tax Assistance (VITA) Program. His  unwavering commitment to accurate, free tax preparation has made him a  cornerstone of this vital effort--and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695269/recognizing-the-work-of-robert-phillips"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…did not have the opportunity  to come home: Las Cruces Police Officer  J.R. Stewart, Albuquerque Police Officer Bianca Quintana, Alamogordo  Police Officer Anthony ``Tony'' Ferguson, Alamogordo Patrolman James M.  Sides, New Mexico State Police Officer Darian Jarrott, and Curry County  Sheriff Michael Reeves.\n\nTo their friends, families, and colleagues:…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691300/national-police-week"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Democratic primary  in South Carolina was a private club, a White-only private club.\n\nThese were the kinds of laws that came out of the Slaughter-House  Cases and Plessy v. Ferguson, the same kind of laws that are being  signaled now in the Supreme Court in the Shelby v. Holder decision.  Just read it and you will see that what Justice Roberts wrote in…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…say with certainty that  these professionals are heroes in every sense of the word.\n\nHere in Pennsylvania, we are especially proud to recognize one of our  own. Chief Fred Ferguson of Moshannon Valley Emergency Medical Services  was recently named the recipient of the 2025 Pennsylvania EMS Educator  of the Year Award. This prestigious honor is awarded…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691586/recognizing-national-ems-week"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…enforcement officer with the last 6 years spent as the  chief of police in the Gettysburg Police Department.\n\nBefore arriving in Gettysburg, Chief Glenny started his career in the  Ferguson Township, Pennsylvania, Police Department, where he spent 26  years on the force.\n\nDuring his time in Ferguson Township, Chief Glenny held roles that  included patrol officer,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690998/delivering-on-president-trumps-agenda"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…over a trillion dollars just on interest.  This is more than we spend on our national defense.\n\nWe should heed this fact as a warning. As Hoover Institution  Historian Niall Ferguson points out, ``Any great power that spends more  on debt service than on defense will not stay great for very long.''\n\nWe must act now if America is to, once again, be a rising…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Toronto, SD, who was awarded the Congressional Medal  of Honor for his bravery in advancing through Italy and who was killed  there in 1943. He was 25 years old. Lieutenant Earl Ferguson, from  Philip, who died when his B-24 bomber was shot down while targeting an  oilfield in Romania. He was 26. And Private Glenn Dow, from Sioux  Falls, who was killed on…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691674/memorial-day"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Roxanne: CBS NEWS; Feldman, Randy: VIEWPOINT COMMUNICATIONS;       Feng, Emily: NATIONAL PUBLIC RADIO (NPR); Feng, Qingdong: NEW       TANG DYNASTY TV; Fenton, John: FOX NEWS; Ferguson, Amber:       WASHINGTONPOST.COM; Ferguson, Joseph: WASHINGTONPOST.COM;       Ferguson, Nicole: FOX NEWS; Ferguson, Patrick: CBC (CANADIAN       BROADCASTING CORPORATION);…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Politico; Fahlberg, Audrey: National Review; Faler,       Brian: Politico; Farah, Niina: E&E News; Feiner, Lauren: The       Verge; Feldscher, Jacqueline: Arkaea Media Group; Ferguson,       Brett: Tax Notes; Fertig, Natalie: Politico; Fields,       Ashleigh: The Hill; Fitzpatrick, John: Bloomberg Industry       Group; Fleisher, Gabriel: Wake Up To Politics.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698171/members-entitled-to-admission-to-the-119th-congress-periodical-press-gallery"}]