[{"senator": "Luz Rivas", "party": "Democrat", "sentence": "…people. Call me crazy, but I believe  that the work we do in Congress should improve the lives of the  American people.\n\nAs the Congresswoman proudly representing the San Fernando Valley in  California, I believe that the true test of how we are as a country is  how we treat our most vulnerable, and this bill fails that test.\n\nMr. Speaker, I urge my…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690944/gulf-of-america-act"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…bill would  harm their constituents. House Democrats all voted to save Medicaid and  SNAP, protect our immigrant communities, and stand with working  families across the San Fernando Valley and across the country.\n\nAs you heard from many of my freshmen colleagues who participated  today, Republicans are turning their backs on everyday Americans. We  all…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699584/stop-the-republican-affordability-crisis"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…today, we see some of the most densely populated and  at-risk areas in the Nation for air pollution are still in California.\n\nThe Los Angeles County area, including the San Fernando and San  Gabriel Valleys; the Central Valley, including Bakersfield and Fresno;  San Diego County; San Francisco Bay Area--these are all areas that see  dense populations…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…area has  the most polluted ozone in the country. This is due to the high  concentration of freeways and heavy trucking industry and communities  such as those in the San Fernando Valley like Pacoima and Sun Valley.  Stopping these efforts will worsen our air quality and the public  health of our communities that are already plagued with the effects…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690477/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "Ms. RIVAS. Mr. Speaker, I rise today to honor Sister Mary Jesus Ochoa  of the Order of St. Francis in San Fernando. This week, she celebrated  her 100th birthday.\n\nSister Mary Jesus is a member of the Franciscan Sisters of the  Immaculate Conception, who entered religious life in the 1940s.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698644/recognizing-sister-mary-jesus-ochoa-on-her-centennial-birthday"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Chamber grew up like I did where on a pretty regular basis, we would be  sent home from grade school because of the intensity and dangers of  smog that settled over the San Fernando Valley, the city of Los  Angeles.\n\nHow many of you grew up to more reports of unhealthy air quality in  the air quality index or hazardous air quality forecast for that  particular…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…to feel engulfed by the smog around  us.\n\nAs I began to share earlier today, that includes me. As many of you  know by now, I grew up in the community of Pacoima in the San Fernando  Valley, the northern part of the city of Los Angeles. And growing up in  the 1970s and 1980s--40 years after the gas masks that I spoke about a  minute ago--smog was still…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…helps prevent crises from  escalating and connects individuals with the service and long-term  support that they need.\n\nThe safety and prosperity of communities in the San Fernando Valley  are among my most critical priorities. I am working with stakeholders  and leaders across my district to ensure that all people feel safe and  welcome in my district.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699916/funding-for-los-angeles"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Anabelle, and Angelica took home an impressive combined  record of 104 wins and 12 losses into their recent CIF Southern Section  girls' championship meets.\n\nTheir parents, Fernando and Monica, are both former wrestlers and  currently coach at Santa Ana High School. Their guidance has helped  their daughters, the sisters, and many other champs at Santa…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689745/recognizing-jessie-echaury"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…that he  could see how his shutdown was creating hardship for Americans from  California to New Hampshire, Washington, and everywhere in between.\n\nIn my district, the San Fernando Valley in Los Angeles, nearly 31,000  people would have seen their healthcare costs rise if the ACA tax  credits expired, and nearly 11,000 people would have lost access to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698671/protecting-healthcare-for-millions-of-americans"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…of millions of students; and,  yes, managing the student loans and Pell grants that students need to  afford an education, just like I did when I was graduating from San  Fernando High School, trying to figure out how I was going to be able  to pay for college.\n\nYet Linda McMahon and Republicans in Congress will try to sell us on  the idea that education…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688250/nomination-of-linda-mcmahon"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…in the Union.\n\nFor 175 years, California was built by people from across the globe  who came in search of a better life. This includes my mother, who  immigrated to the San Fernando Valley in the 1960s and worked multiple  jobs so that my sister and I could live out the American Dream.\n\nStories like mine are what make California great, and it is what…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695175/happy-birthday-to-california"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…of Representatives:\n\nResolved, That the bill from the Senate (S. 1071) entitled       ``An Act to require the Secretary of Veterans Affairs to       disinter the remains of Fernando V. Cota from Fort Sam       Houston National Cemetery, Texas, and for other purposes,''       do pass with an amendment.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697948/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…fully commits to the standard set before  them.\n\nOn behalf of Indiana's Ninth District, the home of our Indiana  University Hoosiers, I commend Coach Cignetti, quarterback Fernando  Mendoza, and players on the team like Charlie Becker, D'Angelo Ponds,  Pat Coogan, Elijah  Sarratt, and the entire Indiana football program for the achievement  that has…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698931/recognizing-indiana-university-football-team"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "Mr. ROGERS of Alabama. Mr. Speaker, pursuant to House Resolution 936,  I call up the bill (S. 1071) to require the Secretary of Veterans  Affairs to disinter the remains of Fernando V. Cota from Fort Sam  Houston National Cemetery, Texas, and for other purposes, and ask for  its immediate consideration in the House.\n\nThe Clerk read the title of the bill.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697810/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Fernando Serrano has made through his work with the  Pasco County Human Services Team. The Pasco County Human Services Team  has proven itself to be a comerstone of resilience, innovation,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690698/recognizing-fernando-serrano"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…Christopher Acevedo, U.S. Army.\n\nCaptain Travis Mills, U.S. Army.\n\nMajor Gary Billings, U.S. Marine Corps.\n\nSecond Lieutenant Charles Neubecker, U.S. Army.\n\nMaster Sergeant Fernando Cruz, Jr., U.S. Marine Corps.\n\nSenior Chief Petty Officer Vincent Riggs, U.S. Navy.\n\nSenior Airman David Davis, U.S. Air Force.\n\nMajor Philip Shortino, U.S. Army.\n\nStaff Sergeant…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696747/recognizing-veterans-in-texas-third-congressional-district"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…living alumni strong. My wife, Mary, and I  have been cheering on our Hoosiers since our college days.\n\nWe will be talking about this play for a long time: Fourth and five,  Fernando Mendoza puts his head down, bounces off defenders, spins,  stretches, and powers in for the touchdown.\n\nCoach Curt Cignetti took over just two seasons ago. There were no…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699173/indiana-college-national-football-champions"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Christopher:       WJLA-TV/NEWSCHANNEL 8; Stubbs, Jr., James: NBC NEWS;       Stuhlmacher, Steven: WJLA-TV/NEWSCHANNEL 8; Styles, Jasmine:       WJLA-TV/NEWSCHANNEL 8; Suarez, Fernando: CBS NEWS;       SUBRAMANIAN, COURTNEY: BBC; Suda, Masaki: NHK; Suddeth,       James: FOX NEWS; Sudworth, John: BBC; Sugg, Anna: NEXSTAR       MEDIA GROUP; Suh, Stefan: WASHINGTON…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}]