[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…nearly $300  billion from agriculture and programs that combat hunger, including  food stamps.\n\nThis Republican bill cuts Medicaid, forcing states to pay more or  cover fewer people--it cuts benefits.\n\nI think of the 64,000 people in Connecticut, including 27,000  children, who can eat thanks to food stamps.\n\nIf this program is pushed back to the states,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691427/supporting-the-democratic-womens-caucus-on-defending-snap-and-medicaid-cuts"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…resulted in a massive decline in  manufacturing jobs last year--jobs the President promised he would be  creating and would be booming. In fact, U.S. factories employ 72,000  fewer people than they did in April of 2025, with more declines every  single month.\n\nThe President has also broken his promise many times over to the  farmers in Illinois. His tariffs…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700151/tariffs"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…gathered there for       lectures and exhibits, for celebrations of National Coin Week       and debates about the aesthetics of the buffalo nickel.\n\nBut as the years passed, fewer people traveled to Upper       Manhattan to see and discuss coins. Mentions of the society       sometimes appeared in newspaper roundups of out-of-the-way       places to visit…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…concern that  the Forest Service won't actually have enough staff and resources to  fight these deadly blazes, putting countless Oregonians at risk.\n\nFewer workers also means fewer people to care for our public lands  and less money coming into our local economies. It means taxpayer  dollars, which go to recruit and train these highly skilled  individuals,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690926/illegal-firings-could-devastate-oregon"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…hesitation.\n\nI serve as pastor of the Ebenezer Baptist Church, the spiritual home  of Martin Luther King, Jr. We all know that Dr. King was a victim of  gun violence. What fewer people remember or know is that in 1974, his  precious mother Alberta Williams King, the wife of the pastor of the  church, Martin Luther King, Sr., was shot and killed in our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695312/cloture-motion"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…that I might not get my benefits in       the future.\n\nSo, Donald Trump and Elon Musk, that is what your attack on Social  Security means for Americans: more problems and fewer people to fix  them; hours on the phone or hours waiting in line at an office, trying  to get help--all to get the benefits that people have  paid into their entire working lives.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690633/nomination-of-frank-bisignano"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…about cutting their services, cutting their medical services,  forcing longer wait times for them because when they call, when they go  to the VA to get help, there will be fewer people there to help them.\n\nI think about the veterans in my district that I talk to, and they  don't deserve to be mistreated like that.\n\nMy God, they want to come back and enter…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Medicaid is made sustainable for future  generations. That bill did not do a thing to address the underlying  reasons healthcare costs are going up. It just provided that fewer  people would end up getting health insurance, up to 17 million  according to the Congressional Budget Office.\n\nMr. Speaker, I heard a lot about the SNAP benefit cuts. I heard…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…seacoast of New Hampshire and Boston and New York. They are facing  $500,000 in added costs because of these tariffs. Now, on top of that,  he stands to lose business because fewer people are visiting the United  States. He also goes between the seacoast and Logan Airport--all of  that because the President has damaged the relationship we have with  one of…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689483/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…of how it works--these people are getting fired  independent of any performance review, independent of any assessment of  where do we need more people or where do we need fewer people or what  are some of the functions that no longer need to be done versus some  functions where we actually may need to enhance the staff to get a  better job for the American…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688257/department-of-health-and-human-services"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…some hypothetical scenario. This is the Democrats' game  plan. They want to raise taxes. They want to punish success. They want  more people dependent on government and fewer people building  independent lives. Republicans will not let that happen.\n\nWith H.R. 1, we are stepping in to lock in the Trump tax cuts  permanently and to provide targeted new…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693239/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…areas than there are current coal miners. Their entire  pension system and their healthcare system were based on a time when  there were always new people coming in and fewer people going out.\n\nIt is upside down now. If my friend had been here, he would have seen  in the Longworth Cafeteria or the Rayburn Cafeteria, day in and day  out, people with…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…overregulation.\n\nIn my district, the Second District of Kansas, the eastern part of  the State, it is, more or less, 80 percent of the small businesses in  the State employ 20 or fewer people. Eighty percent of them are really  small businesses. There are about 93 percent if you go under 500  employees. For a lot of us that sounds like a big number, in my part…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697349/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…and the program enters into what is  called an actuarial death spiral, which is to say the risk, instead of  being spread out over many, is concentrated in increasingly fewer  people, driving up their premiums even that much more; therefore, more  people drop.\n\nIf we do nothing, the National Flood Insurance Program will collapse.  This is important.…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688826/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…America is suffering. Americans don't recognize the  country we live in. Trump's tariffs have caused prices to soar. We have  the highest unemployment rate in 4 years so fewer people have jobs.  Those out of work can't even afford those expensive groceries, housing,  and appliances.\n\nRepublicans refused to extend the health insurance tax cuts in time,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…prosperity. When people breathe clean air, they  miss fewer work and school days, companies are more productive, kids  learn more, families save on healthcare costs because fewer people go  to the hospital for asthma and heart disease.\n\nIt doesn't stop there. To meet California's emission standards,  carmakers have built more fuel-efficient vehicles. That…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…controllers; to pay the staff; to pay everybody who is working. Yet  there was an objection. So I don't understand what is going on here.\n\nShould the emphasis be to pay fewer people or more people? Why would  we try to punish certain groups of people instead of paying all of the  people who are working? Why would we not do that?\n\nSo I don't understand the…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…actual cost of delivering healthcare.\n\nThere are a couple of other things that are highlights in the CBO  report. They estimate that in 10 years, we will have 5.3 million fewer  people in America. That is mostly from reduction in immigration and the  fact that our fertility rates continue to fall, but think of this.\n\nThat missing 5.3 million people is…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…expect almost zero population growth, so let's first do those who  want no immigration. In 2035, we have only 64 million that are under  18. With immigration, you still have fewer people. That is over 20  years.\n\nOkay, fine. Maybe that is the policy decision of our society. In that  case, don't stand in our way when people like me are trying to find  ways…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and organizing all items donated to us and  distributed out. This effort took place daily for 30 days. Without  Donna and her ability and willingness to coordinate, far fewer people  would have been helped. As the holidays came and went, Donna kept in  touch, wanting to donate her time with us in ``blue skies'' as well.  She completed the agency's stringent…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692146/recognizing-donna-telesco"}]