[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…interests of plan  participants and beneficiaries. The bill codifies two rules from the  first Trump administration that impose first-of-their-kind restrictions  on plan fiduciaries' abilities to consider what are called  environmental, social, and governance, or ESG, factors when making  investment decisions and exercise shareholder rights.\n\nThe appropriate…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Retirement Income Security       Act of 1974 (ERISA) to codify Trump Administration rules that       undermine workers' retirement security by, among other       things, chilling fiduciaries' consideration of a set of       important financial risks and I opportunities. This bill       misguidedly attacks Environmental, Social, and Governance       (``ESG'')…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…going to keep bringing bills to the floor to destroy the fabric of our  market-based economy, I am going to keep standing up for it.\n\nLet's be clear: ERISA already requires fiduciaries to act solely in  the financial interests of plan participants and beneficiaries. H.R.  2988 does not strengthen that standard. It simply assumes that a  handful of paternalistic…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699153/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, this bill unnecessarily restricts the free  market. It dictates what private sector fiduciaries can and cannot  consider when making investment decisions that directly affect the  savings and retirement savings of hardworking Americans.\n\nFor this reason and at the…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699158/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…ill, they are at greater  risk for financial abuse and theft of benefits than the population at  large. Unfortunately, despite the VA's best efforts at vetting proposed  fiduciaries, bad actors do arise from time to time. When that happens,  theft or misuse of benefits can financially devastate veterans.\n\nOn top of the financial harm, the strain of…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690671/veteran-fraud-reimbursement-act-of-2025"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…Speaker, I thank the ranking member for yielding  and for his leadership in opposition to this bill.\n\nEnvironmental, social, and governance are factors that retirement  plan fiduciaries may consider when making investments on behalf of  retirement plans covered by ERISA. Factors that may fall within ESG  include impact of the company's actions on climate…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699157/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…improved so that our Nation's most vulnerable veterans  receive the benefits that they have earned. Let me say that again: our  most vulnerable veterans.\n\nThe VA appoints fiduciaries for veterans who are unable to manage  their VA financial benefits. These fiduciaries are required to use a  veteran's VA benefits for the veteran's care and welfare. The…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690673/veteran-fraud-reimbursement-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…managed to protect workers' futures and  not to advance political agendas.\n\nOver the past several years, the Biden administration pushed a rule  that encouraged retirement plan fiduciaries to consider environmental,  social, and governance--ESG--factors, when making investment decisions.  That might sound harmless, but in practice, it shifts the focus away…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…savings of the American  people.\n\nH.R. 2988, the Protecting Prudent Investment of Retirement Savings  Act, ensures that Employee Retirement Income Security Act, or ERISA,  fiduciaries are focused on one thing, the financial bottom line.\n\nWe cannot allow woke fiduciaries to gamble with a worker's pension to  satisfy a political agenda. This bill reinforces…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…generated through  participant-controlled brokerage windows and similar arrangements with  the investment returns generated by investments selected and monitored  by plan fiduciaries.\n\nWhat does that mean in plain English? It means basically, do you want  to be involved in the decisions surrounding your investments?\n\nMost defined contribution plans,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699155/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…2022, the Biden administration heavy-handedly put the  retirement security of over 150 million Americans at risk by issuing a  deeply flawed rule to enable retirement plan fiduciaries to consider or  choose investments based on environmental, social, and governance, or  ESG, factors. That is not free market. That is not capitalism.\n\nIt is proven that…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699156/protecting-prudent-investment-of-retirement-savings-act"}]