[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…bill is premised on  the Republicans' mistaken belief that they know best when it comes to  investing workers' retirement savings.\n\nUnder the present law, the retirement plan fiduciary is required to  make prudent investment decisions in the best interests of plan  participants and beneficiaries. The bill codifies two rules from the  first Trump administration…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…of a set of       important financial risks and I opportunities. This bill       misguidedly attacks Environmental, Social, and Governance       (``ESG'') considerations in fiduciary decision-making as       ``woke'' rather than legitimate and important factors to be       considered in decision-making.\n\nH.R. 2270, the Empowering Employer Child and Elder…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…were relying on me for their  retirement. I had people who were 90- or 100-year-old retirees, and I  had first-year teachers who were 23 years old. I owed just as much of a  fiduciary duty to those 23-year-olds as the 90-year-olds.\n\nSo long-term factors and ESG factors matter even when corporate  executives who are focused on the short term don't care…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699159/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…our auto industry, and, frankly, the  stock market.\n\nSecondly, I am hearing very grave concerns about the state of Social  Security and Social Security's ability to meet its fiduciary  commitments to its millions and millions of recipients. Never once in  the history of that program has a payment been missed, but the actions  of DOGE are disrupting that…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688410/a-serious-and-profound-moment"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…Connolly. He cannot be here today as he bravely battles  cancer, and our thoughts and our prayers are with him.\n\nI echo the comments of Representative Bergman. Veterans in the  fiduciary program are some of the most vulnerable in the VA's care.  Because they are often elderly or mentally ill, they are at greater  risk for financial abuse and theft of benefits…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690671/veteran-fraud-reimbursement-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…of VA benefits, programs, and services to survivors. VA moved  the supervision of OSA from the Office of Outreach, Transition and  Economic Development to VBA's Pension and Fiduciary Service.\n\nThe VA made this move with the idea that it would increase emphasis  on the office and oversight of OSA as VBA has more capacity to properly  oversee the function.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689686/prioritizing-veterans-survivors-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…homeowners having to build a new roof on their home to  get insurance coverage.\n\nIt matters what insurance companies think about this because those  insurance companies have both a fiduciary duty and a financial  incentive to predict well to make that an accurate transmission channel  of climate risk into markets. And they are predicting storm clouds  ahead,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…radical policies  and favors to crony capitalists.\n\nThe bill declares that race, color, religion, sex, or national origin  may not be taken into consideration when selecting a fiduciary,  counsel, employee, or service provider of an ERISA plan.\n\nLastly, it implements a notice requirement on defined contribution  plans, explaining the difference between choosing…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699156/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…roles over decades--including Business Agent, Delegate, Trustee,  Steward, Legislative Coordinator, and Health & Welfare Fund Trustee and  has received substantial training in fiduciary responsibilities and  public employee benefit trusts.\n\nHer community involvement has been no less impressive. Ms. Hoover has  served as a Township Auditor, a Township Supervisor,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697487/recognizing-warminster-township-board-of-supervisors-judy-hoover"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…elements of the Department pursuant to the       plan required under subsection (a), the Secretary shall give       priority to the following elements:\n\n(1) The Pension and Fiduciary Service of the Veterans       Benefits Administration.\n\n(2) The Education Service of the Veterans Benefits       Administration.\n\n(3) Program offices of the Veterans Benefits…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695487/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…fiduciaries go through an extensive selection and monitoring  process, evaluating fees, risks, performance, and how each option  compares to available alternatives.\n\nIf the plan fiduciary places pooled asset funds, like mutual funds,  on the investment menu, the fees are almost always lower, which  bolsters the fund's net return, meaning more money in the…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699155/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…That means that  workers may be paying more and getting less--less growth, less  stability, and less certainty about their future.\n\nThis is not a theoretical issue. When a fiduciary chooses investments  based on nonfinancial criteria, the person paying the price is not the  bureaucrat in Washington or the corporate executive on a conference  call. The…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…of providing or maintaining       deposit insurance for the benefit of a third party, by or       through any of the following, each acting in a formal       custodial or fiduciary capacity for the benefit of a third       party:\n\n``(i) An insured depository institution serving as agent,       trustee, or custodian.\n\n``(ii) A trust entity controlled…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…agenda.\n\nWe cannot ignore the retirement security of our constituents. H.R.  2988 is a commonsense safeguard. When an American worker hands over  their hard-earned paycheck to a fiduciary, they expect that money to be  invested to maximize their return and not to fund a political  experiment or a green energy fantasy. This bill ensures that pecuniary  factors…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…suspend the rules and pass the  bill (H.R. 1912) to amend title 38, United States Code, to improve the  repayment by the Secretary of Veterans Affairs of benefits misused by a  fiduciary, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 1912\n\nBe it enacted by the Senate…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690673/veteran-fraud-reimbursement-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…veterans' surviving loved ones.\n\nHowever, the Biden-Harris administration moved this office from the  Secretary's office to the Veterans Benefits Administration Pension and  Fiduciary Service.\n\nThis decision to hide the Office of Survivors Assistance near the  bottom of the VA organizational chart reflected the Biden-Harris  administration's lack of commitment…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689687/prioritizing-veterans-survivors-act"}]