[{"senator": "Dave Min", "party": "Democrat", "sentence": "…leadership positively impacted the lives of  countless servicemembers.\n\nI am certain that his dedication and achievement will have a lasting  impact on the Army's ability to fight and win our Nation's wars.\n\nUpon retirement, Colonel Dinh is recognized for his distinguished  service and exemplary performance of duty, reflecting the highest  tradition of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695089/congratulating-colonel-dominic-v-dinh-on-his-retirement"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…place in all of our military,  including our U.S. Marines. We need to provide our marines and our  military men and women with the tools and the resources they need to  fight and win and the care they deserve when they return home.\n\nIt is not about the rhetoric or just the celebration of birthdays.  What really matters is what we do between the birthdays…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696623/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…American people, at this time when we are  confronting a crisis related to our democracy, the hue and cry is not  for you to always win.\n\nFor those who believe that you only fight when you win, you are not  going to win the hearts and minds of the American people. The American  people want to know if you will fight even though you may not win. Will  you fight?…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…bipartisan work is valued across red, blue,  and purple districts and States. We have successfully fought back  against attempts to muzzle its experts, and we will continue to fight  back and win.\n\nLet me be clear: Defunding NOAA will hurt Oregonians, Americans, and  people across this country. It puts the lives of fishers and their  crews at risk. It leaves…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691327/noaa-contributes-to-our-economy-and-well-being"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…started. We will fight  today. We will fight tomorrow. We will fight this week. We will fight  next week. We will fight this month. We will fight next month. We will  fight until we win this battle for the American people. That is our  commitment as House Democrats.\n\nThere are only two ways that this fight will end. There are only two  ways, Mr. Speaker,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696738/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…that we know will pass, that the  votes exist, in a bipartisan way, to protect the healthcare of everyday  Americans.\n\nHouse Democrats have made clear we are in this fight until we win  this fight, to cancel the cuts, lower the costs, save healthcare, and  extend the Affordable Care Act tax credits.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698365/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…days--we can withhold our votes without jeopardizing all of  the important Democratic priorities I just laid out and more. We will  be in the strongest possible position to fight for and win the drastic  changes we all know are needed to protect our communities: judicial  warrant requirements, no more detentions or deportations of United  States citizens,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…Guardians. We must ensure we have the highly skilled and  technically proficient acquisition cadre capable of bringing online the  next generation of systems necessary to fight and win in space.\n\nAs we develop those space systems, we are going to need both better- trained acquisition Guardians and more of them. The joint force will be  looking to these…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697798/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…undermine our democracy, to overturn the will of  our voters, and to deprive our people of fair representation. Yet,  this example shows that we still have the power to fight back and to  win.       California Governor Opposes Use of National Guard Against Crime\n\nMr. KILEY of California. Mr. Speaker, the Governor of California is  outraged at the prospect…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…Academy.\n\nAs a future cadet, he will be joining the ranks of the world's most  fearsome fighting force, the United States Air Force.\n\nGuided by the motto ``Aim High. . . . Fly-Fight-Win'' the U.S. Air  Force is the world's preeminent force in air, space, and cyberspace.\n\nThroughout our history, American Airmen have demonstrated tremendous  courage and strength,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692743/congratulating-john-epps"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…operating locations have changed as the needs of the  nation have evolved. Throughout it all, the men and women of the 55th  Wing have never wavered in their mission to fly, fight, and win. It is  my great honor to recognize their achievements and salute their history  today. Once again I say, happy birthday to the men and women of the  Fightin' Fifty-Fifth.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689070/recognizing-the-55th-wing-85th-birthday"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…American energy like never before.\n\nThis is more than a budget. It is a blueprint to take our country  back, Mr. Speaker. We are done playing defense. It is time to lead,  fight, and win, all for the American people.\n\nMr. Speaker, I urge my colleagues to vote ``yes'' on the previous  question and ``yes'' on the rule.\n\nThe material previously referred to…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…enrichment sites.\n\nTo the pilots, to the air crews, to everybody involved: Well done. I  spent 30-something years in the Air Force, and I have never been more  proud. Fly, fight, win.\n\nWhat is next? They shot missiles at our airbase in Qatar--the  Iranians did--today, about 16 or 19. One may have gotten through. I  think they called us. But just remember…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…Academy.\n\nAs a future cadet, he will be joining the ranks of the world's most  fearsome fighting force, the United States Air Force.\n\nGuided by the motto ``Aim High . . . Fly-Fight-Win'' the U.S. Air  Force is the world's preeminent force in air, space, and cyberspace.\n\nThroughout our history, American Airmen have demonstrated tremendous  courage and strength,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692699/congratulating-kai-agyemang"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…but they actually increase  depression, anxiety, and suicidal ideation among those for whom these  medical procedures are performed.\n\nThe purpose of our military is to fight and to win wars. It is to  create warfighters, killers, not to participate in the latest  progressive fad.\n\nUnder the Biden administration, we diverted money away from readiness…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…States Space Force guardians to ensure we have the highly skilled and  technical proficient acquisition cadre capable of bringing online the  next generation of systems to fight and win in space.\n\nThis bill revitalizes the defense industrial base and American  manufacturing, supports a well-deserved pay raise for our  servicemembers, creates a more lethal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695146/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}]