[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…and told that your child, who is in a  very dangerous situation, cannot get the healthcare that they need,  that is not going to help that servicemember be the best possible  fighter they can be for this country.\n\nWe should not be denying healthcare to the family members of our  servicemembers that they need, and that is what this amendment does.\n\nMr.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…airplane, something so fundamental and basic to a  military pilot, that they did not train enough to be capable enough to  do something that was so fundamental to be an effective fighter pilot.\n\nAnd then after--that was early in my NASA career. Later, as I started  flying to space with these guys, I realized that Russians and the  Russian military, in particular--because…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696346/trump-administration"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…Dr. Butler became the  first Grand Rapids boxer to win a National Golden Gloves title, an  accomplishment that cemented his legacy in the sport.\n\nDr. Butler was not just a fighter in the ring. He was also a fighter  for education and equality.\n\nGrowing up in Mississippi, he faced the harsh realities of poverty  and racism. His mother, determined to…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…from Las Vegas, NM. Her daughter Aurora was born with a chromosome 16  disorder. She had to have open-heart surgery. She spent her first year  alive on oxygen.\n\nAurora is a fighter, but without Medicaid, Karisa could never have  afforded the surgeries that saved Aurora's life. Because of Medicaid,  Aurora isn't just surviving; she is thriving. She is…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694383/9999"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…as a Representative of his beloved State  of Virginia.\n\nUnfortunately, he cannot be with us today. Anybody who knows  Representative Connolly knows he is a bulldog, he is a fighter, and he  is tenacious. He is facing some serious health challenges right now.\n\nMr. Speaker, I know you will join me and Representative Bergman and  everyone else in wishing…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690671/veteran-fraud-reimbursement-act-of-2025"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…also includes the subcommittee's multiyear effort to manage  the largest acquisition program in the history of the Department of  Defense. Yes, that is the F-35 Joint Strike Fighter program. This year,  the bill extends by 5 years the annual Government Accountability Office  report on the F-35. We have done many things for F-35 oversight in the  past…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697802/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…scientific evidence and that recommendations from these reports can be  revolutionary to how they fight fires and save lives.\n\nNIOSH produces these reports through its Fire Fighter Fatality  Investigation and Prevention Program, which was already significantly  understaffed, with only five investigators investigating these  incidents across the Nation.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689637/protecting-and-serving-our-firefighters"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…had access to  E85 ethanol at the fuel pumps. It has been a great gift of my career to  have served long enough to see that we have been successful.\n\nWe also flew the first fighter jet F-16 out of our base 20 years ago  using biofuels, and it worked. We are very proud of this industry as it  grows. My hat is off to Ohio farmers and Midwest farmers who…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698200/northwest-ohio-biofuels-summit"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…director of Grassroots Collaborative, where we opposed school  closures, championed affordable housing, and fought for critical  investments to our social safety net.\n\nAmisha is a fighter for peace, justice, and community. As a three- time cancer survivor currently in treatment, I want her to know that we  are with her as she continues this fight.\n\nOn behalf…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690325/national-fair-housing-month-amisha-patel"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…entered Polish airspace, some traveling up to 300 miles in the  country. For nearly 6 hours, NATO aircraft sought out and destroyed  these Russian intruders.\n\nThen this weekend, fighter jets intercepted another Russian drone  that entered NATO airspace--in this case, Romania.\n\nThe EU's chief diplomat Kaja Kallas promptly said of the recent  incident: ``The…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695519/north-atlantic-treaty-organization"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…for all Federal  workers.\n\nThis is such an important way to honor the legacy of our colleague,  our Ranking Member Gerry Connolly.\n\nGerry was a dedicated public servant, a fighter, and a mentor to all  of us on the Oversight Committee. Gerry worked to hold our government  accountable for over 30 years and was dedicated to improving the lives  of all…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691832/gerald-e-connolly-esophageal-cancer-awareness-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…import. We build tanks. We  can't import our defense industry base. We must build it. That is what  we do. Our region operates among the top 10 finest National Guard F-16  Fighter Wings in this whole Nation. Mr. Speaker, 20 years ago our,  pilots flew the first biofueled F-16 aircraft out of a major base in  our country.\n\nWe grow crops for biofuels…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…by Sikorsky  Aircraft in Stratford, Connecticut, in my district.\n\nI am also proud that Pratt & Whitney produces the F135 engine, the  power plant for the F-35 Joint Strike Fighter, in my district. The  highly skilled workers in this plant are critical for our defense  industrial base, and the rising cost of living is making it harder for  them to make…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693648/department-of-defense-appropriations-act-2026"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…extraordinary career of Colonel David L. ``Moon'' Halasi- Kun, who has honorably served our Nation for more than twenty-five  years and most recently as the Wing Commander of the 104th Fighter Wing  at Barnes Air National Guard Base in Westfield, Massachusetts.\n\nColonel Halasi-Kun's career is a testament to dedication, leadership,  and excellence in service. Commissioned…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698681/recognizing-colonel-david-moon-halasi-kun"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…cancer.\n\nOne of the bill's advocates was one that we are all going to talk  about, Mikaela Naylon, a 16-year-old girl in Colorado who battled bone  cancer. She was a fierce fighter for this bill. She talked to all of  us, and we all sent videos to her. Unfortunately, she died on October  30.\n\nHer mother told all of us, the sponsors and the cosponsors…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697278/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…American people back home, as well as making  sure that the people's voice is always heard here in D.C. She has  served me as a trusted adviser and a dedicated conservative fighter.\n\nI appreciate all of her hard work over the years for Team Scalise and  for the Republican Conference. While we are incredibly sad to see her  go, I know that her expertise…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694933/recognizing-lauren-fine"}, {"senator": "James Risch", "party": "Republican", "sentence": "…employs over 300,000 people  across various roles, like chip design, electronic automation, and  manufacturing. DRAM is also a vital asset to America's national  security. Every fighter jet, missile defense system, and intelligence  operation depends upon the reliable, secure, domestically produced  memory technology inspired by Dr. Dennard's original invention.…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691716/recognizing-national-dram-day"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…priorities for America's national security, and none of them--none of  them--come cheap: the Golden Dome for America, an American shipbuilding  renaissance, sixth-generation stealth fighter aircraft, the long- overdue modernization of our nuclear force. Reconciliation isn't enough  to support these major efforts, and neither is a perpetual freeze at  the Biden…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…and by 1943 was  stationed in England as a member of the Eighth Air Force's First Bomb  Group.\n\nSam was tasked with decoding incoming orders for American bombers and  their fighter plane escorts, which is a critical role that allowed our  planes to carry out devastating bombing runs over Europe.\n\nAfter his discharge in 1945, Sam and his wife moved to…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692145/doge-rescissions-package"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Year 2026.\n\nIn the Readiness Subcommittee, this bill addresses some of the  largest readiness challenges in the Department, including a specific  focus on the Joint Strike Fighter and amphibious ship readiness  concerns.\n\nThis bill reestablishes safety as a culture and seeks to partially  correct the mistakes that led up to the Black Hawk collision…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695145/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…civilians.\n\nColonel Andrew Shurtleff, who testified before the House Veterans'  Affairs Committee in March, is one of those veterans. He served our  country as an Air Force fighter pilot, and he started fighting stage IV  cancer in 2019 when he was just 41 years old. My prayers are with him  as he continues to battle cancer, and I wish him the very best.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690650/aces-act"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…rise today on behalf of the farmers, families, and  small businesses in Iowa's Third District and, really, rural  communities across America right now who need someone to be a fighter.\n\nWe have a good group here in Washington on both sides of the aisle  who are championing the importance of renewable biofuels, giving  Americans the freedom to choose cleaner,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699304/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…four  of my amendments. The first requires the Secretary of the Air Force and  the Director of the Air National Guard to work together to modernize  the Air National Guard's fighter fleet.\n\nLast year's NDAA required a similar report, but this report did not  fulfill several requirements, like consultation from the Director of  the Air National Guard and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695238/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…legislation in a very short  time.\n\nThe bill before us today makes several notable and timely  investments. One of the most important investments is the Navy's sixth- generation fighter, F/A-XX. Our Navy, our joint force, and our future  combatant commanders need this aircraft.\n\nRelying only on the Air Force's sixth-generation fighter, the F-47,  does not…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693649/department-of-defense-appropriations-act-2026"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…distance and increases the pool to the veteran population, not  just those who are Active Duty, but also to those who have previously  served as aviators.\n\nI am an Air Force fighter pilot with over 20 years of service, and I  fought alongside the best that this Nation has to offer. I have also  stood beside too many of my brothers and sisters as they…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693896/aces-act-of-2025"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…constituted in November of 1940 and later activated at  Hamilton Field, California, in January of 1941. The 55th deployed to  England in 1943 flying P-38 Lightning and P-51 Mustang fighter aircraft  as part of the ``Mighty'' Eighth Air Force. While providing escort for  allied bombing missions during World War II, the 55th Pursuit Group  earned two Distinguished…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689070/recognizing-the-55th-wing-85th-birthday"}, {"senator": "John Carter", "party": "Republican", "sentence": "…honor and commitment that make our military the  world's premier fighting force.\n\nLt. Col. Davison had a distinguished career specializing in the F-111  an craft, serving as a Fighter Pilot, Flight Examiner, Instructor, Test  Pilot, and Air Force Exchange Officer to Australia. His leadership  extended across various levels of the Air Force, including roles…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689349/saluting-the-service-of-lieutenant-colonel-jeff-davison"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…cars, more than 60 percent of our  machine tools, 80 percent of our pharmaceuticals, and nearly 90 percent  of the semiconductor chips we need for everything from phones to  fighter jets are foreign made. That is why the crisis that confronts us  today is not merely economic. It is about communism and slave labor  versus freedom. It is about who will…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "James Risch", "party": "Republican", "sentence": "…to meet       current and future threats by providing stand-off capability       via advanced, long-range strike systems for employment on       Japan Air Self-Defense Force fighter aircraft. Japan will       have no difficulty absorbing these articles and services into       its armed forces.\n\nThe proposed sale of this equipment and support will not…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696967/arms-sales-notification"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…along with the T-2C, A-4E, and F-16N.\n\nHe completed multiple deployments aboard aircraft carriers like the  Carl Vinson, Ranger, and Enterprise.\n\nHe also graduated from Navy Fighter Weapons School Adversary Course  and earned a master of science degree in systems management from the  University of Southern California.\n\nMost famously he was selected as…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}]