[{"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "Speaker, I stand with Leader Jeffries and House Democrats as we  continue our fight for affordable, quality healthcare in this country.", "title": "Lower Health Care Premiums for All Americans Act", "date": "2025-12-17"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "The last point I want to make is this: This fight that we are having  now in which only Democrats care about changing our campaign finance  laws, in which Republicans almost to a person have no interest in  trying to decrease the influence of corporations and billionaires in  our elections, it is ahistorical.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "Let's be clear: The healthcare we fight to make affordable and  accessible, the services we promise our veterans, the readiness we  demand of our agencies, none of it is real if we undermine the  employees who deliver these services on the front lines.", "title": "Protect America's Workforce Act", "date": "2025-12-11"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "That is why we are fighting so hard to stop this  bill.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "I am going to, and my colleagues will continue to, fight for every  student, every family, and every school in America, including those in  the San Joaquin Valley that I represent.", "title": "Denouncing Cuts to K-12 Schools", "date": "2025-07-21"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "I came to fight for  the people I represent: the aging parents in Sussex County, the  caregivers in Kent, and kids in Wilmington.", "title": "Nearly One in Four Delawareans Rely on Medicaid", "date": "2025-05-15"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "The accidents involved extremely hot and  difficult-to-fight chemical battery blazes and have led to loss of  multiple lives.", "title": "Recognizing National Blood Donor Month", "date": "2026-01-08"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "That is what Democrats are fighting for.", "title": "Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "I commend my colleagues for coming together to fight for  what is right.", "title": "Providing for Consideration of H.R. 2550 to Nullify the Executive Order Relating to Exclusions From Federal Labor-Management Relations Programs, and for Other Purposes", "date": "2025-12-10"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "When it has been extremely hard to fight against larger, richer, and  more powerful entities and to hold them accountable, communities go to  the courts.", "title": "Protecting the Legal Community", "date": "2025-04-01"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "She is someone  that yields from the great State of Texas where there are champions for  justice who are fighting to protect Social Security, who are fighting  to protect Medicaid, who are fighting to protect the very same programs  that are critical and have made this country great.", "title": "Defending Social Services and Programs", "date": "2025-04-08"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "I will fight for lives like Sandra's and  Naomi's.", "title": "Sandra's Story: Why Medicaid Matters", "date": "2025-05-20"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Speaker, I am absolutely dedicated to fighting to make sure that we get  big money out of politics and that we end Citizens United.", "title": "Restoring Election Integrity", "date": "2026-01-21"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "So while Republicans, those folks here in Washington, fight for  billionaires, Democrats are here fighting for you--for your healthcare,  for your ability to see a doctor, to see a doctor and get your  prescriptions without breaking the bank.", "title": "Continuing Appropriations and Extensions Act, 2026", "date": null}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "Speaker, this fight is far from over.", "title": "Protecting Women's Health Research", "date": "2025-05-01"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "Yes, we will fight fraud, waste, and abuse.", "title": "Republicans Are Not Cutting Medicaid", "date": "2025-05-06"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "Madam Speaker, this bill is another piece of the puzzle in the fight  against waste, fraud, and abuse.", "title": "Ending Improper Payments to Deceased People Act", "date": "2026-01-12"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "Speaker, I am proud to support this budget, and I am proud to  fight for President Trump's legislative agenda.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "Over the past 6 months, President Trump has delivered on his promise  to restore America's strength and dominance, and I look forward to  continuing the fight with President Trump leading the way to ensure  America's golden age lasts for decades to come.", "title": "Six Months of America First Leadership", "date": "2025-07-23"}, {"senator": "Young Kim", "party": "Republican", "sentence": "As a Member of Congress, I will always fight for the American Dream and  for our free market system that keeps it within reach for everyday  Americans.", "title": "Denouncing the Horrors of Socialism", "date": "2025-11-21"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "Let's give Main Street America someone who will fight with them and  for them.", "title": "-9999", "date": "2025-07-09"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Speaker, stand up and fight.", "title": "Tax Cuts and Credits", "date": "2025-05-07"}, {"senator": "John Joyce", "party": "Republican", "sentence": "I have been leading this fight since I arrived in Congress to protect  consumer choice and to foster further innovation in the auto industry.", "title": "Supporting Reversal of California Ev Mandate", "date": "2025-04-07"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "I will continue to fight for States' rights and for the rights of  South Carolinians to govern ourselves without Federal interference.", "title": "Dobbs V. Jackson Anniversary", "date": "2025-06-25"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "Yet, where we fight together to take it on and not take shots, we  actually begin to solve the problem.", "title": "Calling on Elected Officials and Civil Society Leaders to Counter Antisemitism and Educate the Public on the Contributions of the Jewish American Community", "date": "2025-05-14"}, {"senator": "David Valadao", "party": "Republican", "sentence": "When  they come home, they shouldn't have to fight another battle just to get  the benefits that they deserve.", "title": "Modernizing All Veterans and Survivors Claims Processing Act", "date": null}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "That is why Republicans have focused on a way forward on healthcare  that actually lowers costs, fights fraud, and gives power to the  patient, not profit to the insurance company, not ill-gotten gains to  the criminal.", "title": "Disrupt Explicit Forged Images and Non-Consensual Edits Act of 2025", "date": "2026-01-13"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "I will always fight to provide certainty for the future  and to put more money back into your pockets as we step into the golden  age in America.", "title": "Promises Made, Promises Kept", "date": null}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Louis County,       MN--Don Carlson; Northeast Technical Services; Grand Itasca       Clinic and Hospital; Lakehead Constructors; Ely Public School       District--Anne Oelke; Fight for Mining Minnesota; Road       Machinery & Supplies Co.; Feeley Township, Itasca County,       MN--Deb Langanki; Lake Country Power; Encampment Minerals,       Inc.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to Public Land Order No. 7917 for Withdrawal of Federal Lands; Cook, Lake, and Saint Louis Counties, Mn", "date": "2026-01-21"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "This resolution would have us pull back from the fight against  designated terrorist regimes and cartels in our own hemisphere, just  miles from our shores.", "title": "Removal of the Use of United States Forces for Hostilities Within or Against Venezuela", "date": "2025-12-17"}]