[{"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…that are approved and signed into law and  when the OMB is picking and choosing how appropriations laws are  implemented, they are right to be concerned.\n\nThis meeting has filled me with a renewed sense of optimism for the  days ahead, for it is clear that these young women and men are not  waiting for the future to arrive. They are shaping it. They…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695393/recognizing-more-action-for-students-organization"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…opponents, his political adversaries--a violation of basic norms of the  Department of Justice and of our democracy.\n\nHe is prosecuting political enemies in courts that he has filled with  MAGA zealots and has a Department of Justice that is run by his  personal lawyers. He is punishing constituents of Democrats by  canceling billions in Federal programs…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696345/trump-administration"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…can to ensure  Ukraine's protection and sovereignty because what happens to Ukraine  and its young democracy happens to theirs and happens to ours.\n\nThe conversations were filled with such emotion and a clear desire to  do the right thing. As cease-fire talks continue, may we strive for an  end to this devastating war, to its suffering for all of Europe,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690214/supporting-ukraines-independence"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…present us no further danger.\n\nBack to the Bay, in the dark of the night,\n\nWent the Gaspee Raiders to set her alight.\n\nThe fire spread through the Raiders' prize,\n\n'Til a blast filled the Narragansett Bay skies.\n\nThe fire had reached the Gaspee's magazines,\n\nAnd her gunpowder blew her to smithereens.\n\nAway sped the raiders into the dark,\n\nLeaving in the…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…next-door  neighbor. We are losing 5, 10, or 20 times the number of people that  the residents of those countries are losing because our gun laws are  like Swiss cheese. They are filled with holes. Let's close those  loopholes. It doesn't diminish anybody's Second Amendment rights.\n\nJustice Scalise said it himself in District of Columbia v. Heller.  You can…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…fires were the most destructive in our State's  history. Mr. Speaker, 1.4 million acres burned. More than 4,000 homes  were destroyed, and at least nine people died. Smoke filled the air for  days throughout the region.\n\nLast year, Oregon saw 1.9 million acres burn, setting a new record.\n\nMr. Speaker, I urge my colleagues to set aside political differences…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692450/wildfires-in-oregon"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…second most destructive wildfire in  California's history. Those we lost helped to shape the fabric of their  communities, and their absence has left a void that cannot be filled.  They are in our thoughts on this 1-year anniversary of the fire.\n\nWe remember Anthony Mitchell, Sr., a 68-year-old father, grandfather,  and great-grandfather who brought…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698642/marking-anniversary-of-los-angeles-fire"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…have it in our power  either to increase the hurt inflicted on our world or to contribute  toward its healing. The choice is ours.'' Together, we must work toward  a world filled with healing and hope.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695803/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…hosting this Special Order hour, and  for his leadership on nuclear nonproliferation issues.\n\nIn my many years as a Member of Congress, I have watched many a fiery  floor speech filled with overstatement and hyperbole, grandiose  pronouncements laced with exaggeration and puffery, but it is entirely  right and proper to say that the expiration of the New…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699031/expiration-of-new-start"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…that were in place to stop the spread of deadly  viruses like Ebola, no matter where they broke out in the world, and  the security contracts at detention camps that have been filled with  ISIS fighters were still being paid.\n\nAnd if our Nation was attacked by a foreign enemy or if we were  thrown into a global pandemic or even a global economic crisis,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690349/9999"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…fails to meet the  obligations we owe those who answered the call of duty.\n\nIn particular, I have heard the voices of veterans and their families  in northwest Indiana, voices filled with concern and fear. They are  worried that the cuts to VA staffing will strip away access to critical  care and essential services. We cannot and must not allow that  to…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692946/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…underserved by  traditional lending institutions.\n\nBy law, a BDC must invest at least 70 percent of their assets in  small- and medium-sized domestic companies.  Over time, BDCs have filled that critical gap in our capital markets by  funding businesses and industries in geographies often overlooked by  other financial institutions. BDCs are often the first institutional…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692711/access-to-small-business-investor-capital-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…yesterday. I was in the Houston Airport coming  home from a work trip when I saw our Colorado high school flashing on  the screens of every single television set in the terminal. It filled  me, as it did all Americans, with horror. How could something like this  happen in America?\n\nMy wife Susan was 6 months pregnant with our oldest daughter  Caroline, and all…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695673/cloture-motion"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…would think twice. It  didn't work. As a result, more people were using crack cocaine after we  passed the law, and the price on the street was going down instead of  up. We filled the Federal prisons primarily with African Americans who  had lengthy sentences--some of them over 20 years--for the simple sale  of crack cocaine.\n\nWe decided that was wrong.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693940/judicial-nominations"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Co-President of Wyoming Machine, a small family-owned sheet  metal fabricator in Stacy, MN who relies on Canadian aluminum for their  operations. The past few weeks have been filled with uncertainty for  their business, not knowing if Trump would roll back or increase the  tariffs. And just today, Trump imposed additional tariffs imported  aluminum, bringing…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688917/impact-of-president-trumps-disasterous-tariffs-on-canada"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…business interests are protected.\n\nHaving served as the top Republican on the Small Business Committee  for years now, I truly understand the need for this position to be  filled immediately, and we are fortunate that President Trump nominated  a highly qualified individual for this role.\n\nDr. Casey Mulligan's unique mix of academic success and real-world…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690896/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…countless hours of practice, the late nights and early mornings,  and the unwavering belief in one another.\n\nIt is about the community that stood behind them: the fans who filled  the stands, families who provided constant support, and coaches who  guided them every step of the way.\n\nI especially congratulate Coach Henson for his leadership.\n\nI also…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689630/manchester-squires-state-champions"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…true American patriot who  passed away on March 17.\n\nLloyd Peck served as a first lieutenant in the United States Marine  Corps during the Korean war. In civilian life, Lloyd filled many  various roles as an advocate for veterans. In addition to serving as  the commander of the Blair County War Veterans Council, Lieutenant Peck  was a founding member of…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688957/president-trump-bringing-back-investments"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…apologies to Minority Leaders Jeffries and  Schumer, but after today they will no longer get to hold the government  hostage, and they will not get to force a rushed, pork-filled Christmas  omnibus at the end of the year.\n\nRepublicans have actively restored a responsible, line-by-line  process. Over the next few months, we will continue this work and…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…Indiana grows.\n\nPurdue, my own alma mater, has long been a launchpad for many of  America's sharpest engineers and explorers, and he is rocketing that  tradition forward. We are filled with Hoosier pride back home to see  Yuri representing our State on a stage that is literally out of this  world.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697430/recognizing-future-astronaut-yuri-kubo"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…construction business. Do you think the electrician  could vote by proxy to get the house wired? Do you think the dentist  could vote by proxy to get the teeth fixed and fillings filled?\n\nIt is a joke. With all the problems this country has, here we are,  arguing over proxy voting.\n\nYou brought up the Speaker voting by proxy. I voted by proxy. Speaker  Pelosi…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689410/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…10, 12 hours of borrowing for an  entire year, and this is for a 10-year budget. That is what they gave  us.\n\nOh, but, David, when negotiations start, it will actually get filled  in. Except we are negotiating--we put $1.5 trillion of savings with the  hope of getting to 2, and they give us $3 billion. Remember, 1 trillion  is 1,000 billion.\n\nMr. Speaker,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…The Waterville Hotel stands as a vibrant hub, serving hearty  fare from burgers and fries to vegetarian dishes, complemented by local  craft beers and wines. The interior is filled with photographs spanning  generations, each snapshot a testament to traditions, memories, and the  moments shared.\n\nFor many, this hotel is far more than a place to eat or…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693585/congratulating-the-waterville-hotel"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…this bill much better and  has made it much better. I thank Ranking Member McBath for her support  as well.\n\nIt is our desire to bring these malevolent-hearted people who are  filled with evil and criminal intention to justice and to protect our  children.\n\nMadam Speaker, I urge the swift passage of this bill out of the House  and the Senate and to get…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698880/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…its       joys, ``For a stone shall cry out From the wall.'' Once       loving homes where the Divine forged an abode turned Into       blackened stones soaked from Hatred--filled wells of blood       and fire, With walls of witness wailing in silence Of strewn       bodies, young and old bonded. In death as in life, for the       land of ubiquitous.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697096/recognizing-october-7-revisited"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…drawing visitors from all over and  spotlighting the rich culture and community spirit of Savannah.\n\nThe market transforms historic River Street into a festive  destination filled with local vendors, holiday entertainment, seasonal  food and drink, and family-friendly activities. It brings together  residents and visitors alike and highlights the unique…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698573/recognizing-the-savannah-christmas-market"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…determined to be wetlands, dry washes, and ephemeral streams. Then  ask the question: Why is that a wetland?\n\nWhen we get great rains, what, once every 3 years, that wash gets  filled. When we do not allow grazing, what happens is there is time for  wildfires. The habitat is endangered, and things aren't better; they  are worse. This amendment helps cure…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698020/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…profound, and their strength and resilience are vital to the success of  our armed forces.\n\nAs Mr. Austin embarks on this next chapter, I wish him and his family  a future filled with peace, joy, and well-deserved rest. The United  States Army Reserve--and indeed, our Nation--is better because of his  service.\n\nI thank Steve for his extraordinary career…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696046/recognizing-mr-stephen-d-austin-assistant-chief-of-us-army-reserve"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…covered individuals;\n\n(D) gaps, if any, in the availability of credit for small       business concerns owned and controlled by covered individuals       that are not being filled by the Federal Government or       private sources;\n\n(E) obstacles faced by covered individuals in trying to       access credit;\n\n(F) the extent to which deployment and other…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687890/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…this loophole and allowing VSOCs to serve more student  veterans on campus by simply requiring a bachelor's degree in the  relevant field of study will get these positions filled with solid  candidates who are able to serve veterans.\n\nMr. Speaker, I am proud that our Republican Conference continues to  address these issues to cut through the red tape…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699486/veterans-readiness-and-employment-improvement-act-of-2025"}]