[{"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…rolling back programs that help build low-cost power. They  are making it harder to build new wind, solar, and transmission  projects. Projects that were already planned, financed, and under  construction to deliver cheaper electricity are now stalled or  scrapped. The result: higher prices for working families.\n\nHouse Democrats are fighting for affordable…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699895/prices-are-too-high"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…a direct assault on judicial independence and many of my  Republican colleagues know it, but too many won't say it out loud for  fear of political retribution or a primary financed by Elon Musk. This  is not conservative, it is not constitutional, and history will  remember.\n\nMr. Speaker, I urge my colleagues to vote ``no.''", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689721/no-rogue-rulings-act-of-2025"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…financing from SBICs.  Today, there are 319 SBIC-licensed funds participating in an array of  private investment and private credit strategies.\n\nIn 2023 alone, SBIC-licensed funds financed approximately $7.2  billion to 1,142 small businesses and startups across the country,  creating or sustaining more than 130,000 jobs. Importantly, financing  provided by…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687917/investing-in-main-street-act-of-2025"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…threatened its neighbors, threatened  Israel, the United States, and the world. Under the Ayatollahs, Iran  has been the largest state sponsor of terror in the world. It has  financed, trained, and directed Hezbollah, Hamas, Palestinian Islamic  jihad, and the Houthis. For the last 30 years, Iran has marched forward  in the pursuit of nuclear weapons, all…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692935/cancellation-of-iran-classified-briefing"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…the faces and voices that  will appear before them. They are the most moving and powerful  advocates: everyday Americans assaulted and brutalized by their own  government, financed by our taxpayer dollars.\n\nBut soon we will decide whether to spend on the Department of  Homeland Security. Without these far-reaching, fundamental changes  that, in effect,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…administrations,  the balance of the Crime Victims Fund, or CVF, has plummeted,  jeopardizing Federal support for these victims.\n\nThis fund does not use taxpayer dollars. It is solely financed by the  fines, settlements, and other monetary penalties collected from Federal  criminal prosecutions. From 2017 to 2023, the balance of CVF dropped by  over 92 percent.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698841/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…implications of this attack.\n\nIt was not just an assault on Israel. It was an attack on the  American vision for a safe and secure Middle East, which was led,  perpetuated, and financed by the Iranian regime.\n\nThe Hamas perpetrators not only set out to destroy the very existence  of the State of Israel, but they sought something larger. They wanted  to prevent…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…believe it has actually fallen further.  For years, 64 percent, and there may have been times when we crossed  over to 66 percent of our income basically came from labor that  financed the government.\n\nToday, we are down to touching--actually, we may be as low as 53  percent. That is a huge difference, and it is going to force us--those  who care about the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…Speaker, I move to suspend the rules and pass the  bill (H.R. 176) to amend the Immigration and Nationality Act with  respect to aliens who carried out, participated in, planned, financed,  supported, or otherwise facilitated the attacks against Israel, as  amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…Victims Fund through the Victims of Crime  Act  of 1984 to support victims of violent crimes through counseling,  advocacy, and recovery services.\n\nImportantly, this fund is financed by fines and penalties paid for by  those convicted of Federal crimes. It is not taxpayer dollars. That  structure reflects that simple, but powerful, idea that accountability…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698844/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…vast potential for deepening U.S.-      Africa supply chain partnerships in critical minerals. The       U.S. International Development Finance Corporation (DFC) has       financed--or is preparing to finance--mineral projects in a       number of AGOA countries, including Angola, Mozambique,       Tanzania, and Zambia.\n\nQ2: What is AGOA's impact on…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…John Sola. As a high  school student, he rented his first twenty acres of land as part of a  Future Farmers of America (FFA) project, and Dave Linder from Linder  Equipment financed his first tractor and disc. He later served as FFA  president during his senior year and earned his FFA State Farmer  Degree. Mr. Sola graduated from Tulare Union High School…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697013/recognizing-vincent-sola"}, {"senator": "French Hill", "party": "Republican", "sentence": "…leasing) or disposition of, or       equity loans on an existing structure, or acquisition       (including leasing) of vacant land if the structure or land       acquired, financed, or disposed of will be retained for the       same use.\n\n(C) The following housing-related activities shall be       subject to regulations equivalent or substantially similar…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…comes  through government. Does anyone see the circular problem of what we are  talking about? If my growth in the employment base is healthcare, and  over here those jobs are financed through government spending, and that  government spending is substantially borrowed, that is not a virtuous  cycle.\n\nWe have a structural problem. Remember, today your government…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…health,  and family planning,'' stray far from the mission of sustaining life  and serve no benefit to the populations they are intended to help.\n\nThese are wasteful programs financed by the American taxpayer, funded  by deficit spending; but no longer. This money is better off returned  to the Treasury, and PEPFAR's integrity is now being restored.\n\nMr.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…happens in the world when there is a shortage of borrowable  money? Remember, every day when we borrow at $6 billion a day that debt  has to be sold. Most of it is actually financed domestically, it is in  this pension, it is in this bank. And then there are the foreigners,  except the foreigners have been lowering their U.S. debt because they  are having…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…more spending. There is no more money.\n\nMr. SCHWEIKERT. Mr. Speaker, he actually just stopped me from  cursing, so he did good.\n\nMr. SCHWEIKERT. Yes, if you add in internally financed.\n\nMr. SCHWEIKERT. The CBO says we will end this year at about 37.2. My  number is 37.3, so yes.\n\nMr. SCHWEIKERT. Yes, 12 zeroes.\n\nMr. SCHWEIKERT. We distort.\n\nMr. SCHWEIKERT.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "James Risch", "party": "Republican", "sentence": "…to see more, it is certainly available in the Intelligence Committee.\n\nThe people carrying those drugs were terrorists, plain and simple.  They were trafficking drugs that financed a designated foreign  terrorist organization. These strikes were fully compliant and fully  justified under the President's article II constitutional authority-- and not only…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696121/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…rules and pass the bill  (H.R. 2035) to amend title 46, United States Code, to direct the  Secretary of Transportation to ensure that all cargoes procured,  furnished, or financed by the Department of Transportation are  transported on privately-owned commercial vessels of the United States,  and for other purposes.\n\nThe Clerk read the title of the…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692187/american-cargo-for-american-ships-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…incentivizes doing it better, faster,  cheaper, and in this case, much, much healthier.\n\nWe are looking at right now over $2.5 trillion over the next 10 years  of just Medicare being financed with debt, just debt. Now, add in what  is left in the trust fund, add in what is coming out of your payroll  taxes--I know it is political suicide around here to tell the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}]