[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…North  Carolina for yielding me the customary 30 minutes, and I yield myself  such time as I may consume.\n\nMr. Speaker, this process is an abomination, legislative malpractice.  Final text of this bill came out less than 24 hours ago. We met in  committee an hour after it was posted, and now, we are here considering  a rule that allows for only 1 hour of…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…neighbor provision, empowers the  EPA to step in when States' emissions are significantly contributing to  the air quality problems of another State.\n\nIn 2023, the EPA released its final Good Neighbor Plan, which would  ensure 23 States meet the Clean Air Act's good neighbor requirements by  reducing pollution that significantly impacts downwind States, like…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689118/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…democracies.\n\nEven worse, he is attacking our basic and fundamental right of due  process. That is the right to have any allegation presented before a  neutral arbiter who makes a final decision.\n\nLike a king, Donald Trump thinks it is okay for him to get to decide  what the law is. That is not how our system works. The Supreme Court  and our judiciary decide…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…penalty-free withdrawal to make up the  gap between the interim payments a retiree receives during the period  the Office of Personnel Management is calculating the retiree's final  annuity and the estimated final annuity. A retiree's interim payment is  generally only 60 percent to 80 percent of the finalized net payment.  Second, this bill would allow…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698468/introduction-of-the-thrift-savings-plan-emergency-withdrawal-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…points of order       against provisions in the bill are waived. The previous       question shall be considered as ordered on the bill and on       any amendment thereto, to final passage without intervening       motion except: (1) one hour of debate equally divided and       controlled by the chair and ranking minority member of the       Committee…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…to choose the person who  praised me, but I felt like I wouldn't get away with it before the  Presiding Officer. He might rule XIX me or something like that.\n\nSo here is the final bipartisan poem that gets our most highest honor  here in the Senate, and it comes from Emma Ross.\n\nEmma.\n\nYou can snap for Emma before the poem, but shouldn't you wait to…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…this.\n\nNow, straight-faced, worthy of an Academy Award, they want to pretend  that the Senate may repeal the payoff they just made law? As we head  into the fourth and, I pray, final year of this majority, I didn't  think anything could shock me more. I was wrong.\n\nThe American people are sick and tired of this. They are sick and  tired of watching politicians…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696924/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…people in their public schools fighting for them,  that they, too, will still have the services that they need and  deserve.\n\nThe Secretary of Education has often said that her final mission is  to close the Department. I would like to put her and everyone else on  notice that I, too, am on a mission, on a mission to make sure that not  only the kids that…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…bill about very basic concepts: Do you  believe in the Constitution or not? Do you believe in the rule of law  or not? Do you believe in due process or not? Do you believe that final  orders of the U.S. Supreme Court should be respected or not? Those are  the questions at issue on S. Res. 195.\n\nOur President, President Trump, has entered into an agreement…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691406/motion-to-discharge-s-res-195"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…they are free to leave?\n\nMr. NEGUSE. Mr. Speaker, it does, and I appreciate the Speaker's  response. Is it customary for a vote to go over 1 hour?\n\nMr. NEGUSE. Mr. Speaker, my final parliamentary procedure request:  Would it be permissible, Mr. Speaker, or would the Speaker entertain a  motion to adjourn, given that Republicans don't intend to complete…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693214/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…of 34 weeks. The current level included in the bill  seriously underfunds CEBAFs operations. A funding level of $166 million  for CEBAF operations should be included in the final legislation.\n\nMy second amendment No. 42, emphasizes the need for funding  critically needed infrastructure improvements at CEBAF. The workforce  at JLab is rapidly growing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694942/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…ingredient to community engagement, a  healthy serving of Hyland sauce.\n\nAs a master of puns, Hyland left a lasting impression with his humor.  Before retiring in 2015, at his final board of supervisors meeting, he  shared one last pun that perfectly encapsulated his wit: There once was  a supervisor who told 10 puns to his colleagues to get them to laugh,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687959/congratulating-dame-karen-pierce"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…Minneapolis.\n\nAs some Minnesotans may remember, I made a friendly wager with a New  York Member of Congress last year at the beginning of the Minnesota  Lynx-New York Liberty WNBA final series. That bet included that I would  don a Liberty jersey and give a speech congratulating them from here on  the House floor if they won the series. I would have, but I…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693881/taking-on-wnba"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…side are suggesting they are cutting red  tape, but it seems to me they are creating more red tape with this  resolution. Absolutely no one opposed the Department of Energy's final  rule on this topic, no one.\n\nIn fact, manufacturers are on record saying that consistent and clear  certification guidance is helpful and necessary to them. Today's  resolution…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688549/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…working at  NHDOT early in his career in 1986 and has risen through the ranks of  the department throughout his tenure. Before his role as NHDOT  Commissioner, he served as the Final Design Supervisor, Preliminary  Design Section Head, Chief Project Manager, Assistant Director of  Project Development, and Director of Project Development at NHDOT.\n\nAs a…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699267/recognizing-william-bill-cass-commissioner-of-new-hampshire-department-of-transportation"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…many of  our wingmen, detection that could have saved his life and their lives.\n\nShortly after that, on Friday, May 23, my friend Pablo lost his  battle with cancer. In his final days, one of the few comforts he knew  was that the ACES Act was on track to becoming law. His courage, voice,  and advocacy for other servicemembers should not be forgotten.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693896/aces-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…recorded vote on H.R. 5143, the District of       Columbia Policing Protection Act, does not reflect my       intended position.\n\nFor the record, I meant to vote ``Aye'' on the final       passage H.R. 5143, which repeals restrictions on the       circumstances under which law enforcement officers in the       District of Columbia may engage in vehicular…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695642/district-of-columbia-policing-protection-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "Mrs. FEDORCHAK. Mr. Speaker, I rise today to recognize WDAY Chief  Meteorologist John Wheeler.\n\nOn May 16, tomorrow, John will deliver his final forecast, sunsetting  a memorable 40-year broadcasting career.\n\nJohn joined WDAY in 1985 as the station's first on-air meteorologist.  Since then, he has weathered it all,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691313/congratulating-john-wheeler-on-his-retirement"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…purposes, and ask for  its immediate consideration in the House.\n\nThe Clerk read the title of the bill.\n\nMr. ROGERS of Alabama.  1071.\n\nMr. Speaker, I am proud to present the final National Defense  Authorization Act for fiscal year 2026.\n\nThis is a good product that was worked in a bipartisan, bicameral  fashion.\n\nThis year, we focused a lot of our efforts…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697810/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…the rules in that chamber. Under suspension, floor debate is       limited, all floor amendments are prohibited, points of order       against the bill are waived, and final passage requires a       two-thirds majority vote.\n\nAt the request of the Majority Leader and the House       Committee on the Budget, CBO estimates the effects of those…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697191/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…civilian nominees have  required cloture votes, an unprecedented number for recent  administrations; and of those 57 nominees, 17 received 60 or more votes  in support on their final confirmation vote--in other words, support  from a number of Democrats as well as Republicans. And yet Democrats  dragged out those nominations in the same way they dragged…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690974/business-before-the-senate"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…negative about anybody.  I say a lot of negative things about people, so I am really jealous of  a guy like Doug LaMalfa who manages never to say anything bad about  anybody.\n\nOne final thing, the other thing I know about Doug is we met every  Thursday morning in a Bible study known as Capitol Ministries, which is  really a Bible study for the erudite Christian,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698712/9999"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…acronym is FIGHT China. Two years ago, I  sponsored an amendment to the NDAA requiring transparency for these  outbound investments. It passed the Senate overwhelmingly with a final  bipartisan vote of 91 to 6. We don't see many votes here in the Senate  these days where there is such strong bipartisan support, so I am  grateful for that.\n\nRegrettably,…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688807/cormick-and-mmcr-fettermanhagerty-kim-cormick-schumer-sullivan-fetterman-and-others-for"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…determination, these young men made the Chanticleer Nation, the Grand  Strand, and all of South Carolina incredibly proud.\n\nThey battled their way into the College World Series final and left  it all on the field. From the first pitch to the final out, they  represented South Carolina with strength and skill.\n\nI congratulate Coach Schnall and all of the…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692819/recognizing-coastal-carolina-university-baseball-team"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…walk-in freezers impacting commercial vendors who store food,       beverages, flowers, and other goods that require chilling at       low temperatures.\n\nThe rule, issued in the final days of the previous       Administration, imposes complex energy conservation standards       for walk-in coolers and freezers, leading to unnecessary       costs on small…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689262/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…reality: We are living in a time  of global unrest, and maintaining a free and open Indo-Pacific is vital  to the security of both the United States and our partners.\n\nOn the final leg of the trip, I met with Taiwanese officials and saw  firsthand how we can strengthen U.S. posture and deepen collaboration  in the region. I was also struck by the warmth,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…February 22nd, the team won their first-ever state title at the  Xcel Energy Center in a suspenseful overtime game against Warroad. The  Wildcats claimed the win with a 4-3 final score.\n\nThe deciding goal almost went unnoticed, sneaking over the goal line  during a dramatic scramble at the net. Warroad came away with the puck,  but junior forward Zoe…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690120/recognizing-the-2025-class-1a-minnesota-state-girls-hockey-champions-the-dodge-county-wildcats"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…deterrence on the world stage and reinforcing economic and community  strength across the country.\n\nThe package also includes a 2-week continuing resolution for our  sixth and final bill, the Department of Homeland Security, which will  give the White House additional time for negotiations.\n\nPresident Trump is leading by example and engaging directly with…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…administration was attacking rural America, and they  used these misguided resource management plans as their tool to do  that.\n\nMr. WESTERMAN. Mr. Speaker, as we wrap up today on this final RMP, I  include in the Record this GAO report that found that the RMP is  subject to the CRA.                                                    U.S. Government…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…draft guidance; and\n\n(C) after considering any comments received and not later       than one year after the close of the comment period on the       draft guidance, publish final guidance.\n\n(c) Applicability.--Section 505(j)(3)(H) of the Federal       Food, Drug, and Cosmetic Act, as added by subsection (a),       applies beginning on the date of enactment…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}]