[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…for  tenants of protected classes and marginalized communities. A lifelong  champion for racial justice, McKinney founded Liberty Bank, Seattle's  first black-owned financial institution which countered racially biased  restrictions on loans to African Americans and expanded opportunities  for homeownership in Seattle.\n\nMcKinney was a friend to many,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698261/recognizing-reverend-dr-sammuel-mckinney"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…gentleman has, what a trigger  lead is. You go to a particular lender or mortgage broker, and you  apply for a mortgage. You want to deal with that mortgage broker or  that financial institution. If you wanted to deal with others,  you would go elsewhere. If you wanted to deal with several, you would  call several.\n\nWhen you seek a mortgage loan, of course…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692804/homebuyers-privacy-protection-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…can pose a threat to our  financial stability.\n\nCongress gave FSOC various tools, including the power to designate a  large nonbank company as a systemically important financial institution  for enhanced oversight and regulation. In Trump's first term, they  severely weakened the nonbank designation process. In a letter, former  Treasury Secretaries Geithner,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699825/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…``Nothing in       this Act may be construed as a basis for supporting the       exclusion or expulsion of Taiwan from continued membership in       any international financial institution or any other       international organization.''.\n\n(6) Taiwan held membership in the IMF for 9 years following       the recognition of the People's Republic of China…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…made public, could--\n\n``(i) impact monetary policy, financial stability, or       cybersecurity; or\n\n``(ii) significantly endanger the financial stability of       any financial institution.\n\n``(G) Repeal.--This paragraph shall be repealed on the date       on which the Board of Governors notifies the Congress and       publishes on a public website of…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699861/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…acquire or use the funds.\n\n(3) Exemptions.--The requirements described under paragraph       (1) may not be applied with respect to a natural person or a       financial institution, as the case may be, if the President       determines:\n\n(A) The funds described under paragraph (1)(A) were       primarily acquired through legal and noncorrupt means.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693876/taiwan-conflict-deterrence-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…need it the most.\n\nThe CFPB's failure to consider the cost associated with this  regulation, especially the real-world impact on consumers, their local  community's financial institution, and the broader financial system  only underscores the need to stop this price control before it is too  late.\n\nThe CFPB also creates a false narrative of choice by…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "French Hill", "party": "Republican", "sentence": "…rigorous procedural guardrails and enhance due  diligence protections and a stronger analytic framework before a firm  can be designated as a systemically important financial institution, or  SIFI.\n\nI thank, again, the gentleman from Illinois (Mr. Foster) and the  gentleman from Michigan (Mr. Huizenga) for their collaboration in  producing this solid,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699822/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Agent       Mentor-Protege Program' (in this subsection referred to as       the `Program') under which a financial agent designated by       the Secretary or a large financial institution may serve as a       mentor, under guidance or regulations prescribed by the       Secretary, to a small financial institution to allow such       small financial institution--…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}]