[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…working  people who worked hard and are deeply concerned about the drop in value  of their 401(k) retirement plans that they worked for.\n\nThose just lost enormous value in the financial markets as the Trump  tariffs traded away the value of their earnings. Meanwhile, the cost of  everything keeps rising. Where I live, the price of gas rose 75 cents  more…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…by strengthening and  modernizing the child and earned income tax credits, expanding paid  leave, providing penalty-free retirement withdrawals, and giving  Americans more financial flexibility in these tough times.\n\nThese aren't partisan bills. These are commonsense solutions. Yet,  House leadership refuses to bring a single one forward for a vote.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689057/voters-sent-us-to-congress-to-lower-costs"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…terrorist organization'' designation, which authorizes legal  and economic sanctions. In other words, designating a cartel as a  foreign terrorist organization limits that group's financial, property,  and travel interests. It does not authorize lethal military action. We  have searched high and low for a designation authorized by Congress of  a group that would…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…insurance costs  in 15 years, even as the cuts in this big, bad bill threaten to bring  more hospital closures.\n\nTrump's attacks on the Federal Reserve could cause another financial  crisis. Masked agents are roaming our streets, and reports of human  rights abuses at ICE detention facilities are growing. Far from ending  the wars in Gaza and Ukraine,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…that  the worst thing going for it right now, at a time when it has to adjust  to the PRC and Russia across a variety of focuses, is that it now needs  full flexibility.\n\nIn Financial Services and General Government, this bill funds the  Federal courts. Can we envision a time in our history when it was not  more important that the Federal courts be fully…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699571/consolidated-appropriations-act-2026"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "…over 70 percent of students benefit  directly from programs administered through the Department. When the  Department is gutted, when staff are fired, grants are frozen, and  financial aid systems break, it is our most vulnerable young people who  feel it first. These are low-income students, first-generation  students, students with disabilities, and families…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698938/protecting-education-for-children-with-disabilities"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Donald Trump's Labor Secretary, who  gave Jeffrey Epstein an unbelievable sweetheart plea deal, immunized  unnamed conspirators, and killed an investigation into Epstein's  financial crimes that could have brought down the entire criminal  network.\n\nMr. Speaker, I should just point out that we have heard now from the  two distinguished chairmen of the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696807/epstein-files-transparency-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…legislation multiple times  and has expanded the list of transactions that are considered  violations of the ISA.\n\nThese sanctions, combined with additional sanctions on Iran's  financial system and petroleum transactions, as well as aggressive  American diplomacy, are what drove Iran to the negotiation table to  finalize the Joint Comprehensive Plan of Action…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690687/solidify-iran-sanctions-act-of-2025"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…754,  the Investing in Main Street Act of 2025, which would spur innovation,  entrepreneurship, and growth in our small businesses nationwide.\n\nCurrently, banking rules allow financial institutions to invest up to  15 percent of their capital and surplus in SBICs. Small business  investing rules cap these same investments far lower at just 5 percent  of…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687919/investing-in-main-street-act-of-2025"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…gentleman has, what a trigger  lead is. You go to a particular lender or mortgage broker, and you  apply for a mortgage. You want to deal with that mortgage broker or  that financial institution. If you wanted to deal with others,  you would go elsewhere. If you wanted to deal with several, you would  call several.\n\nWhen you seek a mortgage loan, of course…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692804/homebuyers-privacy-protection-act"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…legislation.  Democrats have been hard at work to support ongoing legal cases by  joining our amicus briefs.\n\nWhen the Trump administration tried to dismantle the Consumer  Financial Protection Bureau, the agency that provides relief to  consumers, 200 Democrats filed an amicus brief when it went to court.  The amicus brief was cited by the judge in the…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690851/opposing-illegal-power-grabs"}, {"senator": "Grace Meng", "party": "Democrat", "sentence": "Ms. MENG. Mr. Chairman, I thank Ranking Member DeLauro for yielding.\n\nMr. Chairman, I rise in support of the 2026 Financial Services and  General Government and National Security, Department of State, and  Related Programs Appropriations Act.\n\nI thank Chairman Mario Diaz-Balart and Ranking Member…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699050/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…possible. This legislation  recognizes their value with a 3.8 percent pay raise, an increase in the  family separation allowance, and other provisions that will help ease  the financial pressures of military families.\n\nIt also extends the Child Care in Your Home pilot through 2029 and  requires annual reviews of childcare fee assistance.\n\nWe also include…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697807/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…and his young siblings while he continued to work to make sure he  pursued the American Dream.\n\nCarlo is a first-generation college graduate and has begun his career  as a financial auditor, and recently he earned his CPA license just  this past November. Now he is even closer than ever to achieving the  American Dream.\n\nMr. Speaker, I congratulate Carlo.…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689385/daca-and-the-american-dream"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…by the Department of Justice at the  direction of DOGE and Elon Musk.\n\nThose grants supported programs like the rural violent crime  reduction initiative, which delivered financial assistance directly to  dozens of rural law enforcement agencies across America and allowed  agencies to upgrade technology and equipment, hire and deploy  personnel, support…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…preamble to adoption without intervening motion except one       hour of debate equally divided and controlled by the chair       and ranking minority member of the Committee on Financial       Services or their respective designees.\n\nSec. 4. Upon adoption of this resolution it shall be in       order to consider in the House the bill (H.R. 1949) to repeal…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696900/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…recent cases,  with boys aged 14 to 17 hit hardest. Reports of these horrible crimes  are surging. NCMEC, the National Center for Missing and Exploited  Children, reports that financial sextortion cases jumped from over  13,800 in early 2024 to nearly 24,000 in early 2025. The FBI logged  nearly 55,000 sextortion reports in 2024 alone, with $33 million in…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698863/combating-online-predators-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…needs to be clear.\n\nThe fact of the matter is our country is hanging on by a very thin  fiscal thread. The bond markets are recognizing this. There was a  headline in the Financial Times today that foreign markets are starting  to pull out of Federal treasuries. Interest rates are doing what they  are doing. You can change the Fed chairman all you want,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Wiesenthal Center also  disclosed to my office that Credit Suisse engaged in misconduct during  in internal investigation. That investigation focused on the bank's  Nazi-linked financial accounts. Turns out, Credit Suisse serviced more  Nazi wealth than was known during and after World War II and tried to  keep it hidden. Thanks to these whistleblowers, I…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688777/sunshine-week"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…now have greater certainty and consumers greater protection  from bad actors.\n\nThis bill establishes a regulatory framework for digital assets that  aligns with our existing financial markets while accounting for the  unique characteristics of digital assets.\n\nMr. Speaker, our markets are the envy of the world. American  innovation is a critical element…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693769/digital-asset-market-clarity-act-of-2025"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "…small businesses, increase  red tape, and jeopardize food safety.\n\nThe Department of Energy estimates implementing this rule would cost  Americans $8 billion. This massive financial burden will fall on small  businesses that rely on commercial refrigeration for their daily  operations. Cafes, restaurants, and grocery stores would be forced to  purchase…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689126/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…rise in support of the rule and the underlying  legislation. This is an important week in the House as we take up  legislation to fund our military and advance several key financial  services bills, including efforts to establish a clear market structure  for cryptocurrency and protect Americans' financial privacy by blocking  a surveillance-style central…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693549/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…the United States pursuant to ANCSA to provide for the       economic and cultural well-being of our Inupiaq shareholders.\n\nASRC is committed to both providing sound financial returns       to our shareholders, through jobs and dividends, and to       preserving our Inupiaq way of life, culture, and traditions,       including the ability to maintain…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…the  House and Senate.\n\nHowever, the Biden-Harris administration vetoed the resolution,  choosing to prioritize leftwing environmental and social issues ahead  of retirees' financial security.\n\nAs chairman of the HELP Subcommittee, I remain committed to  protecting the retirement savings of workers, retirees, and their  families. The Protecting Prudent…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699156/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…``promote the development of the       Navajo Nation's resources and new sources of energy, power,       transmission and attendant resources to develop the economic,       financial, social and cultural well-being of the Navajo       People and the Navajo Nation.'' See Navajo Nation Council       Resolution CAP-20-13 (2013), NTEC is, thus, a Navajo Nation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…I talk about constantly, because it is my  intense frustration around here, is the Democrats and--I am sorry--many  of my Republican colleagues have turned healthcare into financial  engineering instead of: What does it cost to provide services? What  does it cost to help our brothers and sisters be healthy? We are  actually seeing that we had some projections…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…President, I have introduced legislation, as is  introduced on an annual basis. We have done so again this year to make  certain that the rate of disability compensation and other financial  benefits from the Department of Veterans Affairs for veterans and  military survivors keeps pace with the rate of inflation.\n\nThe annual Veterans' Compensation Cost-of-Living…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696621/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…good bill. It is an important bill.  Regulating stablecoins is long overdue at the Federal level, but make  no mistake, stablecoins aren't new.\n\nThe New York Department of Financial Services has regulated  stablecoins in the State of New York since 2018. They are time-tested  and proven, and they have been stable.\n\nIt is long overdue for us to provide…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693835/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…Revolutionary Guard Corps, the  Russian Mafia, and North Korean cybercriminals are no longer relying  solely on traditional cash couriers or shell companies. They now  exploit financial platforms, adopting increasingly sophisticated  approaches to fund acts of terrorism.\n\nThese organizations adapt quickly, using every loophole in the global  financial system…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693942/ofac-licensure-for-investigators-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…Chairman Hill for his leadership in  bringing this important legislation to the floor.\n\nThe bill we have before us today reverses perhaps the most  misunderstood rulemaking in financial services. On its face, you may  look at a proposal to cap overdraft fees and think, wow, that sounds  like a great idea. After all, who wants to pay more in fees?\n\nHowever,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689840/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}]