[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Academy of Pediatrics,  and the American Psychological Association, representing more than a  million doctors in the country, are saying: No, don't let the  politicians start finger painting all over the protocols for dealing  with an actual medical problem that millions of people have had to deal  with in our country.\n\nWe will stand with the families.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698345/protect-childrens-innocence-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…premiums are  doubling and tripling. We heard from people who don't understand why  you guys moved at the speed of light to give tax breaks to billionaires  but won't lift a damn finger to extend the tax credits that help ensure  people's health insurance premiums don't skyrocket.\n\nThis CR, this dirty CR, which does nothing to solve the healthcare  crisis,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…question  is, What will the Senate do to stand up for ourselves? That is  something that I hope every single Senator is thinking about right now.\n\nThis is not a time to put your finger up in the air and figure out  which way the wind is blowing, to try to think through what type of  reaction might come from the White House if we speak out against this.\n\nThis…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692477/alex-padilla"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…military and our servicemembers' sacrifices are disrespected and abused  by a man who was never brave enough to serve himself.\n\nI cannot let him keep giving our troops the middle finger while  eroding the hard-won trust and confidence they have earned from the  American public over generations of military service. These days, I may  no longer be wearing my…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696180/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…official act before I was sent home,       I sent those memos to the Global Health staff, to keep for       their records, in the event the blame game ends up pointing       the finger at them.\n\nThat brings us to today.\n\nThank you again for the opportunity to speak before you.  Senate Roundtable on the Dangerous Consequences of Funding Cuts to U.S.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…facts.\n\nMr. Speaker, President Trump, Elon Musk, and DOGE continue  dismantling Federal agencies, shredding constitutional norms.  Meanwhile, House Republicans refuse to lift a finger to rein in rogue  actors or defend the rule of law.\n\nIn the face of all of this, American farmers and rural America are  paying the price for all of this chaos.\n\nRight now,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…so fast in my life. It was  overnight.\n\nMeanwhile, their own voters are getting hurt by this administration,  and it is radio silence. They can't even be  bothered to lift a finger or do a townhall.\n\nMr. Speaker, where is the outrage over Trump wanting to cut 80,000  jobs at the Department of Veterans Affairs?\n\nWhere is the condemnation for Trump firing…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688503/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…pay for that project. They put in  there: Oh, if you don't pay, we get to control your port. Sri Lanka  should be encouraged: Don't give your port to China. Give your middle  finger to China, and you will able to borrow from American banks and  European banks and international lending associations.\n\nWe should never allow a credit rating agency under our…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…the morning, but you can be sure that he will have found a  way to abandon our troops again by the afternoon because Trump has made  a habit of giving our troops the middle finger.\n\nWell, I am sure as hell not going to let him get away with that. So  as many times as is necessary, I am going to keep coming back to this  Chamber. I am going to keep raising…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…their way and not supporting the men and  women in uniform as these men and women deserve.\n\nWhen this latest story came to light, the Secretary immediately began  pointing the finger at others. He and the White House have repeatedly  attempted to place responsibility for the September 2 strike squarely  on Admiral Bradley's shoulders.\n\nI served in the Army…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697387/caribbean-boat-strike"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…populist; he is a posturer. He throws out  these populist ideas to try to persuade people he is on their side, but  he never does anything to get them done. He never lifts a finger or a  phone. And the American people see that he talks a good game but never  does anything to accomplish what he wants to do when it comes to  lowering their costs. And the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…have to  go without coverage to pay the bills.\n\nThat is exactly what is happening right now. It is happening all  because this leadership here in this House refused to lift a finger.  They were too busy helping Big Banks, Big Oil, Big Tech, and whatever  billionaire needed a handout.\n\nThis Congress musters up the will to spend trillions of dollars on…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698593/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the entire Federal Government-- the House, the Senate, and the White House--for over a year.\n\nYet still, after an entire year in charge, Republicans continue to  point the finger at Democrats rather than take responsibility for their  own embarrassing failures and broken promises. Republicans and Trump  ran on fighting for working people, but every…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Trump's 35 percent tariffs on Canada have been  devastating. We depend on tourism. More than a quarter of the tourists  who visit Niagara Falls and the wine country in the Finger Lakes region  are from Canada. So many from Canada flood New York City every year.  And yet, this year, tourism and border crossings are down 20 percent.  Western New York…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696451/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…their supply chains that avoid massive and ever-changing  taxes at points of entry, but a renewed economic focus on making things  in the U.S. cannot happen at the snap of a finger.\n\nIt takes large investments and longtime horizons. This bill is a way  to approach filling the gaps in manufacturing financing. It raises the  loan limits for the SBA 7(a)…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697219/made-in-america-manufacturing-finance-act"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…there  because of the vagaries in the recovery cycle and all kinds of things  that happen in the court system that generate these revenue streams.  This is a way to put our finger in the dam until we figure out longer  term how we provide that sort of certainty.\n\nThere are a lot of different groups of crime victims. By the way,  none of them asked to…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698842/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "John Rose", "party": "Republican", "sentence": "…President Trump's Border Patrol reported only 7,181  illegal crossings compared to 137,473 similar crossings during the same  month in 2024. All of that without Congress lifting a finger. It is  clear that the accomplishment was because of the clear leadership of  President Donald J. Trump.\n\nIn Tennessee specifically, President Trump's tariffs and economic…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690428/the-first-100-days"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…America, I would argue the greatest immediate concern for America--is  shown by an incident that happened in Minneapolis.\n\nA little while ago, an ICE agent doing his job had his finger bitten  off by one of these radical protesters who seem to have descended in  Minneapolis. What happened afterwards, though, as horrific as that is,  was even worse.\n\nFirst…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…advance of this is simply this: I woke  up in Walter Reed Army Medical Center not too far from here a number of  years ago, and when I woke up, I was missing two legs and a finger. I  had been out of consciousness for a week plus.\n\nWhat I woke up to was being on a laundry list of medications. I had  an epidural. I had oral morphines and oxies. I had…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692956/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…version is called the SKL V3.1 and offers improved       fill port ruggedization, an enhanced brightness/contrast LCD,       and a touchscreen interface that supports both finger and       stylus input. The AN/PYQ-10A(C) V3.1 SKL provides a secure       means of distribution and storage of COMSEC material, mission       data, and configuration files…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691198/arms-sales-notification"}]