[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…have  allowed the Department to bar criminally bad actors from receiving  settlement funds and being reinstated.\n\nThere is a lot more to say on this topic, but let me just finish by  saying that I hope we can work together. I hope the chairman and I can  work together in a bipartisan way to put together our two resolutions  and devise one that will…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689835/9999"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Louisiana. Will the gentleman yield briefly?\n\nMr. Griffith. And while I----\n\nMr. Carter of Louisiana. I will address that.\n\nThe Chair. I will yield to you in a second. Let him finish,       yes.\n\nMr. Griffith. I don't have the floor. I have been yielded       time, so I have to finish and then I yield back----\n\nMr. Carter of Louisiana. Fair enough, sir.…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…some very unkind things with profanity. I could have held him in  contempt. All I had to do was say: Mr. Bailiff, take this man over to a  certain area and hold him until I finish the docket. I have to have a  further discussion with him.\n\nI could have held him in contempt, but I had heard enough of that  case to know that he was right about the facts…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…totally  with you, Mr. President. If you want to go after Elon Musk's contracts,  we are here for the fight, bro. Give me a ring, like, for real. We can  get this across the finish line because, I mean, obviously, I know you  guys were feeling the feelings for the first 130 days, and there is  always a honeymoon period, especially after you go through…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692039/consequences-of-doge"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…foster care and who  are experiencing homelessness. Furthermore, Dr. Paccione helped  implement the Colorado ReEngaged Initiative to allow thousands of  Coloradans who did not finish a four-year degree the opportunity to  earn an associate's degree. And under her leadership, Colorado was  ranked first in the Nation for educational attainment in 2022.\n\nThroughout…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698659/recognizing-dr-angela-angie-paccione"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…decade, the       gun industry used ambiguity in the existing regulation of       firearms to create a market for unfinished frames and       receivers, as well as kits to finish assembling them, which       were the basis for the ghost gun market before the ATF       promulgated a rule to regulate them as firearms. Aside from       frames or receivers,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…again, comes to the heart of  who we are as a community.\n\nI will also just say, I think it is important to put a warning label  on it, and then I will turn it to you to maybe finish out.\n\nThere is a lot of magic math going on right now on the other side of  that.\n\nHow do you take a group of people who both want to cut Medicaid in a  devastating way, want…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689544/h-con-res-14"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…financial and  academic resources the government provides reduces college  affordability and, once again, places students who are already at a  disadvantage further from the finish line. In addition, he signed an  executive order refusing Public Service Loan Forgiveness to non-profits  that he does not like.\n\nPresident Trump further is targeting higher…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690128/alarm-at-the-trump-administrations-dangerous-attack-on-education"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…is going to pass because a clear majority of this  House agree it is time to close these chapters of endless wars. I am  prepared to fight in conference to get this over the finish line.\n\nIt is time to once and for all end these forever wars.\n\nMr. MEEKS. Mr. Chair, in response to the chairman, I will say that we  asked those questions in the 117th and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695262/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…that this bill was led by Republican sponsor,  Congressman Jodey Arrington, and the many organizations and patient  advocacy groups who helped us push this bill across the finish line. I  am giving a big shout-out to the American Cancer Society Cancer Action  Network, PanCAN, the Prevent Cancer Foundation, the National Minority  Quality Forum, and so…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699298/we-will-beat-cancer"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…make sure the Sharp gets the upgrades that it needs.\n\nThe ANCHOR Act passed out of committee with bipartisan support, and I  urge my colleagues to vote to get it over the finish line.                            Betraying Our Veterans\n\nMs. McBRIDE. Mr. Speaker, earlier this month, I joined veterans,  families, and care providers to celebrate 75 years…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691492/protecting-american-maritime-research"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, before we finish today, I would like to  say that soon, the Senate will vote on a bipartisan piece of  legislation that will make an important DC funding fix.\n\nThis legislation will make sure…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688900/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…When Secretary Wright testified in the Senate Energy and Natural  Resources Committee, he said, ``Senator,'' speaking to me, ``I can't  overstate how critical I think it is to finish the job, finish the  cleanup at Hanford. Hanford gave a lot to this country, and we left a  mess that needs to be cleaned up.'' He went on to say, ``I am firmly  committed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695342/hanford-site-cleanup"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…because I want everybody to vote on it right now. It should never  have happened.\n\nMr. Speaker, I urge my colleagues to support the TAKE IT DOWN Act.  Let's get this across the finish line and deliver for the women and  children who are counting on us.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690184/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…accountability and transparency in our  critical communications networks.\n\nOur bill passed the House unanimously by voice vote in the last  Congress, but it didn't quite get over the finish line. We really have  no more time to wait, Mr. Speaker. Our adversaries continue to target  our communications systems, so Congress must take steps now to protect  our communications,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690264/foreign-adversary-communications-transparency-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…job to  do. We took the important first step by passing the budget resolution  just before the Senate adjourned, and now that we are back in  Washington, it is time that we finish the job.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}, {"senator": "French Hill", "party": "Republican", "sentence": "…that 2019 legislatively directed  study that was published in 2021 that are the basis for the law  proposal before us today.\n\nWith the help of my colleagues, this bill will finish the work  started some four decades ago in which I have been personally dedicated  since joining this House.\n\nWith this final addition, the Flatside Wilderness area can continue…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…freshman Braylen Garcia dominated the 2025  tennis season. Their doubles team was instrumental in Hempfield's 15- win start and claiming the Section One title, second place finish in  the Lancaster-Lebanon League, and fourth place finish in the district  3A team tournaments. Ending with a 16-4 record, the Hempfield Black  Knights advanced to states.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692412/congratulating-cooper-lehman-and-braylen-garcia-tennis-doubles-champions"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Institutions Subcommittee, this authorization  does go through my subcommittee, and I am happy to work with colleagues  across the spectrum here to get a good product across the finish line.\n\nMr. Chair, I am opposed to this en bloc because of this amendment.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695242/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…would be remiss if I did not  mention the ranking member of the full committee and the ranking member  of the subcommittee who worked so hard on getting this bill across the  finish line. I am very excited that this is a very nice bipartisan  effort on something that has to get done. There is a big focus that we  have to have on the People's Republic of…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…These talented students, who both live and study in northern  Michigan, showcased remarkable ingenuity, teamwork, and technical  skills. They earned an impressive third-place finish against nearly 80  teams from 22 States and 18 countries.\n\nAfter months of design and testing, their ROV successfully completed  complex tasks, while the team impressed judges…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693964/recognizing-the-achievements-of-the-alpena-community-college-remotely-operated-vehicle-team"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…reemphasize because some people, I think, still naively assume China  operates by the same rules the United States does.\n\nSo I am glad the President is as excited as I am to finish the job we  started with CFIUS reform.\n\nToday, I am proud to announce that I am introducing legislation to  finally tackle this issue called the Foreign Investment Guardrails…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688824/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…me in introducing this important bipartisan legislation.\n\nThis legislation passed the House with unanimous support last  Congress. Unfortunately, we couldn't get it over the finish line in the  Senate in time, so I thank Chairman Williams for his important  leadership in getting it back to the floor and across the finish line a  second time in the House.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687908/doe-and-sba-research-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…PERMIT Act is about delivering certainty and efficiency without  compromising environmental standards. I am proud to support it, and I  look forward to getting this across the finish line for Utahns and for  Americans across the country.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698029/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "John James", "party": "Republican", "sentence": "…ago, only one in five children with  disabilities had access to public education. Today, millions succeed  because of IDEA.\n\nWith the IDEAL Act, we reaffirm our commitment. We finish the job. We  keep moving forward, not backward.\n\nI urge my colleagues to support the IDEAL Act.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697119/marking-a-national-milestone"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…determination, carrying the weight of a State that believed in them.  From blocked kicks and dramatic momentum swings to a fourth-quarter  comeback and the first overtime finish in FCS title game history, this  contest delivered everything that makes college football unforgettable.\n\nThis win marked Montana State's first national championship in 41…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698834/congratulating-montana-state-university-bobcats"}, {"senator": "John Boozman", "party": "Republican", "sentence": "…advocacy  on behalf of the American dairy farmers helped to ensure this important  legislation progressed through the U.S. Senate. I look forward to  moving this bill across the finish line in the Senate, and I am hopeful  our colleagues in the House can build on this momentum.\n\nAgain, thank you, guys, so much for all of your work, your  collaboration. This…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697061/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…previous administration was derelict in doing. I am very happy  to stand here today with my Democrat and Republican colleagues in a  bipartisan fashion to get this across the finish line.\n\nThe American people deserve it. The cost of energy and the need for  our energy is going to be increasing. As the chairman just said, Mr.  Speaker, we need to win the…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688634/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…great privilege to get important bills like  H.R. 913, the SAFE Veterans Act of 2025, and H.R. 1793, the Veterans  Readiness and Employment Transparency Act of 2025, over the finish  line.\n\nI thank my friends, the gentleman from California (Mr. Obernolte) and  the gentleman from Arizona (Mr. Hamadeh), for their work alongside me  to modernize the Veteran…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699486/veterans-readiness-and-employment-improvement-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…serves the public interest, not a partisan agenda.\n\nI encourage my colleagues to support our bipartisan resolution that  Senator Klobuchar and I have introduced.\n\nAnd I will finish with another James Madison remark. As he noted, an  engaged and educated citizenry is necessary to advance the public good  and secure the longevity of our Republic.", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691703/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}]