[{"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…the baton from former Congresswoman Barbara Lee  in  carrying this legislation forward. I thank the lead across the aisle,  Representative Roy, for getting this past the finish line.\n\nThis bill also includes legislation like the Haiti Criminal Collusion  Transparency Act, which would curb the flow of illegal arms fueling  Haiti's crises and hold accountable…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697809/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…my  colleague from Alaska and with the chairman to make sure that both our  Chambers--both our parties' priorities can be put together in a way  that we see them reach the finish line. Therefore, in support of my  colleague from California and my colleague from Colorado, I must object  at this time.", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696960/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…to bring down both the supply of opioids  reaching our communities as well as the demand for them.\n\nThere is still work to be done, including getting this bill across  the finish line and restoring vital funding that was cut by the current  administration for treatment and recovery.\n\nI will continue fighting to ensure that our communities have the  support…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692340/calling-for-permanent-scheduling-for-fentanyl-analogues"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…provide datasets that are  stable and reliable into the future.\n\nThe Senate has already passed this reauthorization. I encourage my  colleagues to help get this bill over the finish line.\n\nLastly, I thank my colleagues on the other side of the aisle and in  the Senate, including Senator Peters who introduced the version of the  bill we will vote on today,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698193/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…the Department of Defense.\n\nKeep in mind, Mr. Speaker, that is not even the bottom line. Their  cost estimates keep growing and growing. A new arms race is a race with  no finish line. Let us be clear: There are no winners, only losers in  this race.\n\nIt doesn't have to be this way.\n\nWe must urgently renew and expand nuclear arms control treaties with…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694116/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…going to pass because a clear majority of this  House agree it is time to close these chapters of endless wars. I am  prepared to fight in conference to get this over the finish line.\n\nIt is time to once and for all end these forever wars.\n\nMr. MEEKS. Mr. Chair, in response to the chairman, I will say that we  asked those questions in the 117th and the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695262/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Regional  Water Authority--would have access, as the town of Minturn already  does, to the Bolts Ditch structure.\n\nIt builds on legislation that we successfully got across the finish  line several years ago. It is common sense. It is bipartisan, and it  means a great deal to the folks that I represent in western Colorado.\n\nI hope that my colleagues can support…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693453/bolts-ditch-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…fighting with each other, try to help  the American people, and vote for our plan.\n\nI implore my Republican colleagues: We need just 13 of you to push  this bill over the finish line.\n\nIf Republicans vote this bill down, they will unleash healthcare  chaos throughout the country.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697877/healthcare"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…that this bill was led by Republican sponsor,  Congressman Jodey Arrington, and the many organizations and patient  advocacy groups who helped us push this bill across the finish line. I  am giving a big shout-out to the American Cancer Society Cancer Action  Network, PanCAN, the Prevent Cancer Foundation, the National Minority  Quality Forum, and so…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699298/we-will-beat-cancer"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…roughly five minutes. His  quick response helped the runner regain a pulse, ultimately saving his  life.\n\nDuring the emotional ordeal, Dan missed seeing his fiancee cross the  finish line, but he told a local news outlet that if he had to do it  all over again, he would still jump in to help.\n\nFor his heroic actions, I want to extend my sincere gratitude…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696700/recognizing-dan-molnar-as-the-champion-of-the-week-for-ohios-13th-congressional-district"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…financial and  academic resources the government provides reduces college  affordability and, once again, places students who are already at a  disadvantage further from the finish line. In addition, he signed an  executive order refusing Public Service Loan Forgiveness to non-profits  that he does not like.\n\nPresident Trump further is targeting higher…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690128/alarm-at-the-trump-administrations-dangerous-attack-on-education"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…and that is our current Secretary of State Marco Rubio.\n\nThen-Senator Rubio gave an important speech in the Senate to get the  Uyghur Forced Labor Protection Act over the finish line just a few  years ago in 2021. Yet, now, as Secretary, he has overseen drastic cuts  to religious freedom and human rights programming that helps the  Uyghurs.\n\nI hope that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694800/uyghur-policy-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…in this House Chamber with two  more Members signing discharge petition No. 8 at the Clerk's desk in  this Chamber. We need only two more signatures to get it across the  finish line to put more sanctions on Russia. That would make a big  difference.\n\nPresident John F. Kennedy, a Navy man and the only President ever  awarded the Purple Heart, understood…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…because I want everybody to vote on it right now. It should never  have happened.\n\nMr. Speaker, I urge my colleagues to support the TAKE IT DOWN Act.  Let's get this across the finish line and deliver for the women and  children who are counting on us.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690184/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…swooped in to cast his vote--the decisive vote? Vice  President Vance. He showed up at the last minute and cast a tie- breaking vote in the Senate to push the bill across the finish line.\n\nA few short years ago, then-Vice President Harris broke a tie in this  very Chamber to pass the largest climate investment bill in history and  to lower prescription drug…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693251/one-big-beautiful-bill-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…offenders; Restoring Law and Order Act would increase  funding for law enforcement and help keep violent criminals behind  bars.\n\nWe should get all of these bills across the finish line and ensure  that President Trump has the tools he needs to restore law and order in  this country. We should pass these bills so that our law enforcement,  our judges, our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695666/cloture-motion"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…these innovators here at home and brings back  all those who left.\n\nThis is not a perfect bill, but it is a perfect bill for this moment.  Congress must keep its eyes on the finish line and send the GENIUS Act  to President Trump's desk this week.\n\nBottom line: The GENIUS Act is a proinnovation, profreedom, and  progrowth piece of legislation. It is a bipartisan…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693844/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…reliably in Oak Grove, Missouri.\n\nThese are reasonable Member-directed investments in America, our true  Article I authority.\n\nMr. Speaker, we are just inches away from the finish line. Let's not  slow this down. Let's get over the finish line. Let's deliver now for  what the American people sent us here to do: Donald J. Trump's America  First agenda backed…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699347/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…unlocks access to minable Federal coal while providing  the Crow Tribe with a piece of the revenue. With bicameral support, I  am confident we will get this bill across the finish line for our  Tribal communities and our State economy. More importantly, this is  another step in ensuring American energy dominance.\n\nIn closing, let me make one thing abundantly…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689193/work-highlights-of-western-caucus"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…unforgiving conditions for all  competitors.\n\nOf the 105 entrants, only 43 were able to complete the ride to  Auburn. However, the couple persevered through, crossing the finish  line in 17 hours 45 minutes.\n\nOver the span of more than 20 years of competitive riding, the two  have accumulated countless awards, including eight Tevis Cups and five  Haggin…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694130/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…few of the things that  are out there.\n\nIt takes hard work, skill, extensive knowledge, and a deep  understanding of the legislative process to get these things across the  finish line, and Jack has all of those qualities.\n\nIt also takes sacrifice, and Jack, his wife, Paige, and their two  boys, Joel and Barrett, know that all too well. I thank Jack and…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Speaker, in closing, I encourage a ``yes'' vote in  the memory of Bill Pascrell who did such a wonderful job on this  particular issue. I am glad we are getting it across the finish line.\n\nMr. Speaker, I encourage a ``yes'' vote on this bill, and I yield  back the balance of my time.\n\nMr. BILIRAKIS. Mr. Speaker, on that I demand the yeas and nays.\n\nThe yeas…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690175/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…thing that President Trump and Republicans  propose.\n\nEver since the Big Beautiful Bill was signed into law, and even when  lawmakers were working hard to make it over the finish line, our  Democratic colleagues said that they found political gold in this bill  and that this would be the pathway for them to win back the majority in  the House of Representatives…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…PERMIT Act is about delivering certainty and efficiency without  compromising environmental standards. I am proud to support it, and I  look forward to getting this across the finish line for Utahns and for  Americans across the country.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698029/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Congressional District excel, but it was  Manheim Township senior Adam Kingston who took home the gold. Kingston  maintained the lead for the entire 3,200-meter race and crossed the  finish line with a time of 8:51:25, a Lancaster-Lebanon League record.\n\nKingston's state title finishes a storied career at Manheim Township.  He was also a part of Manheim Township's…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691936/congratulating-adam-kingston-gold-medal-runner"}, {"senator": "Diana Harshbarger", "party": "Republican", "sentence": "…I have come to  find out that he didn't.\n\nAs a tribute to Dolly Parton, all I have to say is that we have been  working longer than ``9 to 5'' to get this bill across the finish line.  I am so thankful for the strong bipartisan partnership that made it  possible today.\n\nMr. Speaker, I urge all of my colleagues to support this legislation.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690269/american-music-tourism-act-of-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…this important topic. This bill passed the House by a voice vote in the  last two Congresses, and I look forward to working with the Senate to  see it finally cross the finish line.\n\nMr. Speaker, I urge all of my colleagues to support this bill, and I  reserve the balance of my time.\n\nMr. BABIN.\n\nMr. BABIN. Mr. Speaker, I have no further requests for…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688971/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…restore these rights to the Lumbee  Tribe, but there wasn't time for the bill to clear the Senate. Today is  our opportunity to get this crucial issue finally across the finish  line. A vote today for the Lumbee people will fix a historic injustice,  and I urge support of this amendment.\n\nMr. ROUZER. Mr. Chair, I yield 1 minute to the gentleman from…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…American families the largest tax  cut in American history. This process hasn't been easy by any means,  but it is worth every single debate we are having to get it over the  finish line. If we fail to get this bill passed and on President  Trump's desk, then middle- and working-class families will be the ones  who pay the price.\n\nSome of my Democrat colleagues…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…of money. This Congressional Gold Medal  will be the cherry on top for our team.\n\nMr. Speaker, I thank my colleagues for their unwavering support to  get this across the finish line. It was 40-plus years since they did  that, and 3 weeks, 2\\1/2\\ weeks before these games, the Soviets  dominated them at Madison Square Garden.\n\nMr. Speaker, named after…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695441/miracle-on-ice-congressional-gold-medal-act"}]