[{"senator": "Dave Min", "party": "Democrat", "sentence": "…who are working with him.\n\nThis administration is also lying about retaining employees to help  fight fires on the ground. Around 75 percent of those who were let go  had firefighting experience, and now we are having to rehire some of  them. This is what happens when you have 21-year-old hackers named  ``Big Balls'' deciding how to cut our agencies as…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689810/cuts-to-forest-service-endanger-millions"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…standards governing EV battery design  and heightened risks to passengers in EV accidents, including  electrical door releases becoming disabled and lack of information on  EV firefighting techniques and exposure to chemical toxins from those  fires.\n\nThis bipartisan bill addresses all of those issues, requiring the  U.S. Department of Transportation standards…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698776/recognizing-national-blood-donor-month"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…resources to make accurate and objective recommendations and changes,  which is why the NIOSH investigations and reports are so crucial.\n\nThese NIOSH reports are critical for firefighting communities in  Maryland and around our country because they save lives. When released,  crews across this country gather around kitchen tables and read the  reports together.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689637/protecting-and-serving-our-firefighters"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…restoration, and more.\n\nWe have heard from the administration that firefighters were exempt  from the cuts, but here is the thing: About 75 percent of the people  who were cut had firefighting training. In fact, they may have had  different titles, but they had something called red cards, which meant  they were ready, firefighting trained, and they leapt into…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…as standards for the  domestic makers of these same cylinders.\n\nCompressed gas cylinders are used every day in life for medical,  auto, defense, oil and gas, residential, firefighting, and other  purposes.\n\nIn January, the Pipeline and Hazardous Materials Safety  Administration issued a safety advisory notice regarding unsafe  cylinders being sold online…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692181/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…safety risks on vessels and  increasing the penalties for bad actors.\n\nThis bill fights oil spill pollution by bolstering vessel response  plans and ensuring timely, robust firefighting responses when vessel  incidents do occur.\n\nIt also requires the Coast Guard to evaluate international oil spill  coordination and ensures robust protections and response…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694197/coast-guard-authorization-act-of-2025"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of S. 160, the Aerial Firefighting  Enhancement Act.\n\nThis bill amends the Wildfire Suppression Aircraft Transfer Act of  1996 to reauthorize the sale of aircraft and parts by the Defense  Department for…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691859/aerial-firefighting-enhancement-act-of-2025"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…young child, he would visit the firehouse with his grandfather, who  himself was a proud volunteer firefighter. Those early memories and  experiences sparked a love for firefighting that never seemed to fade.\n\nAfter graduating from St. John's University in Queens, New York, in  1969 with a degree in Business and Marketing, he pursued a successful  30-year…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695286/recognizing-larry-newmans-40-years-of-service-with-the-yardley-makefield-fire-company"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…male-dominated fields.  She is currently the only female member of the Fire Crew at Cass, where  she recently passed the Pack Test and earned her Red Card for wildland  firefighting. She participates in daily physical training to prepare  for her upcoming Fire detail and is a dedicated member of the Camp  Crew. Her passion for public service and emergency…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692255/recognizing-ms-jayden-coffey"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…and equipment  mounting solutions for the fire service, military, and other industries  in over 38 countries.\n\nIn 2007, Dick established the Greater Lancaster Museum of  Firefighting, located next to his business. The museum showcases  historic firefighting artifacts, including those from local departments  and even pieces from the 9/11 Towers. It stands…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690585/recognizing-the-life-of-service-of-dick-young"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…much greater purpose.\n\nThe Brother's Keepers Motorcycle Club focuses on safety and  motorcycle awareness nationwide. However, realizing the strength of  their unity, these firefighting bikers have turned their fun and  relaxation into fundraising and charitable work. For example, their  Kentucky chapters collectively support the Shriners Hospital and…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694746/tribute-in-honor-of-brothers-keepers-motorcycle-club"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…North Africa, becoming the youngest member of a seasoned crew.\n\nThe USS Moreno played a critical role in the war effort, carrying out  dangerous missions that included firefighting, towing disabled  warships, deploying depth charges, underwater welding, and escort  operations. Radioman Scarpelli's skill as a radioman, communicating  through Morse code…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695850/recognizing-united-states-navy-radioman-petty-officer-3rd-class-natale-nate-john-scarpelli"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Aerial Firefighting       Enhancement Act of 2025''.       SEC. 2. MODIFICATION AND REAUTHORIZATION OF AUTHORITY FOR                     SALE BY DEPARTMENT OF DEFENSE OF AIRCRAFT AND…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691858/aerial-firefighting-enhancement-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…barriers to the timeliness of such       deployment.                      TITLE IV--OIL POLLUTION RESPONSE       SEC. 401. VESSEL RESPONSE PLANS.\n\n(a) Salvage and Marine Firefighting Response Capability.--      Section 311(j) of the Federal Water Pollution Control Act (33       U.S.C. 1321(j)) is amended by adding at the end the       following:\n\n``(10)…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}]