[{"senator": "Laura Gillen", "party": "Democrat", "sentence": "…to in their heroic efforts. This is a painful reminder of the  lasting cost of their selfless service.\n\nUnfortunately, thousands of our heroic law enforcement officers,  firefighters, and emergency personnel who bravely answered the call on  the darkest day in our Nation's history continue to suffer from life- threatening cancers, respiratory diseases,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691183/national-police-week"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…equipment it needs at all times.\n\nHis impact on the community extends well beyond the firehouse walls.  Mr. Fountain committed countless hours to mentoring newly minted  firefighters and leading the firefighters' union as president.\n\nThrough his example, Mike Fountain has shown us what leadership is  all about. Mike has ensured the readiness of the West…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694967/congratulating-mike-fountain-on-his-retirement"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…I trauma center, more than  $149 million in potential cuts loom. I know this hospital. I have been  there when my officers have been injured. I have been there when my  firefighters in Newark were injured. I have been there when heroic  citizens are injured and brought there. It is our level I trauma  center. People from all around our region are sent…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…result in an average  increase of $360 per month for more than 2.5 million Social Security  recipients, according to the Congressional Budget Office.\n\nThese are our teachers, firefighters, and other public service  employees who have dedicated their careers and their lives to serving  and ultimately improving their communities. At a time when people have…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690424/social-security-administration-is-there-to-help-not-hurt-americans"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…where I am wondering  what the hell are these folks doing. While our economy is in crisis,  while groceries and housing are at an all-time high, while our veterans  and our firefighters and our teachers are being illegally fired, while  Elon Musk is dismantling the U.S. Department of Education, and while  the Secretary of Defense is trying to cover up the…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689053/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Darah embodied the American Dream through hard work, integrity,  and devotion to family. For more than four decades, this truly good man  helped clothe our police officers, firefighters, workers, building  Superior Uniform Sales with grit, wisdom, and a gift for bringing  people together.\n\nHe was so friendly. He was a natural leader, a storyteller, and…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Extreme wildfires now  ravage my home State of Oregon every summer, and the threat is growing.  I am here today to speak out against cuts to programs that support  wildland firefighters and their frontline crews.\n\nFor years now, American families in the Pacific Northwest have lived  on the edge, wondering if this will be the year they are forced to flee…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692450/wildfires-in-oregon"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…cure, and so we need to have these types of resources  in place.\n\nAs wildfires grow more and more intense, as the risks of wildfire  become more and more ubiquitous, our firefighters are tired. They are  understaffed, underresourced, and underpaid. We need more funding to  protect our communities from megafires. Instead, this administration is  choosing…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689810/cuts-to-forest-service-endanger-millions"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…critically  important to our success as leaders. It is important to our teachers,  our taxi drivers, our nurses, our men and women in uniform, our police  officers, our firefighters, and the people that are working everyday  jobs who keep America moving.\n\nWhat makes America tick? Americans make America tick. Healthy  Americans make America tick. People…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…bankruptcy at least four times. Four times, filed for  bankruptcy--the President of the United States. Yet he contributes less  to servicing our national debt than teachers and firefighters and hard- working Americans who play by the rules each and every day. The average  American isn't afforded that luxury.\n\nAs a result, our Federal deficit has grown, inflation…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698425/unanimous-consent-requests-the-calendar"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…together artists, volunteers, and supporters from across  Colorado, all united in a common cause.\n\nThe Colorado Professional Firefighter Foundation provides vital  support to firefighters and their families, offering assistance in  times of crisis and honoring the sacrifices of these brave men and  women. The Make-A-Wish Foundation grants life-changing wishes…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692442/recognizing-and-commending-the-service-of-corey-rose"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…crucial, lifesaving  services to over 6,000 residents, covering over 40,000 square miles of  response area.\n\nStation 7 will be staffed around the clock by career and volunteer  firefighters and respond to calls of all types, medical, fire, and even  wildland support.\n\nThe work that these first responders do is critical, and they keep  all of us healthy, safe,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692238/backlog-in-irs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…families but billionaires?\n\nWe have billionaires in this country who pay an effective tax rate  that is lower than the effective tax rate for teachers, police  officers, and firefighters.\n\nWhat the hell is wrong with this place? I mean, the priorities here  are all screwed up. Let's have a debate about our values and our  choices, but, please, let's not…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…dozens of HIV-related research grants.\n\nDid you know that there is a National Firefighter Registry that was  set up to study the link between the hazards of the job and  firefighters developing cancers? Well, that registry has now been taken  down at Secretary Kennedy's bidding.\n\nThis is part of a heartless trend. They are destroying what decades  of…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691450/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "Ms. KAMLAGER-DOVE.  3614, the Fairness, Inclusion, Rehabilitation, and  Expungement for Firefighters Act.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691829/removal-of-names-of-members-as-cosponsors-of-hr-3614"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…husband to his wife, Lisa, for 32 years; a devoted  friend; and a man who consistently put others before himself. I extend  my deepest condolences to his family, his fellow firefighters, and all  those who had the privilege of knowing him.\n\nMay his memory be a blessing.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698769/recognizing-jim-monaghan"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…year because of the tax  cuts. Waiters, barbers, and bartenders keep $1,300 more by having to  pay no tax on tips. In my home State and in the Presiding Officer's,  nurses, firefighters, and police officers can keep $1,400 more by  having to pay no tax on overtime. New parents get a $1,000 Trump  account for every newborn child, to invest in their future,…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…diagnosed with PTSD. That is of all who served.\n\nFor those who served in combat zones, the rate of PTSD can reach up  to 20 percent. Among first responders, police officers, firefighters,  and EMTs, 80 percent have experienced at least one traumatic event  while on the job.\n\nBetween 10 and 30 percent of first responders will develop post- traumatic stress…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692714/recognizing-national-post-traumatic-growth-day"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…increasing law enforcement funding for our land  management agencies and for our Tribes.\n\nIt protects our communities, fully funding firefighter pay to support  wildland firefighters and prevent catastrophic wildfires.\n\nThe bill prioritizes upholding our trust and treaty responsibilities  with Tribal nations. I continue to say that I refuse to balance…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698758/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…moderated by Scouting  leaders and alumni, highlighting the diverse ways this program shapes  the  next generation of leaders, young men and women who will one day serve  as firefighters, teachers, doctors, small business owners, and yes,  even Members of Congress.\n\nWe are also hosting Eagles on the Hill, a reception that will bring  together Eagle Scouts…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694209/recognizing-the-congressional-scouting-caucus"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…fire  safety and prevention services to an area of 32 square miles, including  the City of Carver and Dahlgren and San Francisco townships, and  employs 32 paid on-call firefighters who respond to nearly 300 calls  per year.\n\nChief Trimbo led the department through many major changes and  challenges during his 22 years of service, including the construction…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696511/recognizing-carver-fire-chief-cally-trimbo-after-22-years-of-service"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…do some important work when it comes to the  priorities, like fully funding wildland fire management.\n\nWe prioritized the removal of hazardous fuels. We took care of the  firefighters who risk their lives to protect their communities,  property, and the environment. As we have seen, year over year, that  threat of fire from one end of the country to another…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Over the course of his career, Shawn has served  as President and two-time Chief, holding many officer positions while  providing guidance and training to new and current firefighters.\n\nShawn is a certified State Fire Instructor and has also led community  initiatives, including the Santa Run for Christmas and the Lancaster  Christmas Parade, helping…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699581/recognizing-shawn-christman"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…decades, Pastor Moore has worked as a firefighter in  North Texas and volunteer chaplain for the Celina Police Department. He  is a board member of the Celina Police and Firefighters Benevolent  Association, the Collin Baptist Association Board, the McKinney Area  Ministerial Alliance Board, and many more. Additionally, Pastor Moore  has worked with…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690155/recognizing-congressional-patriot-award-recipient-pastor-isiah-moore-jr"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "Mr. ROGERS of Kentucky. Mr. Speaker, I rise to pay tribute to the  Brother's Keepers Motorcycle Club of Kentucky. What started out as a  group of firefighters whose main purpose was to strengthen their  brotherhood through recreational motorcycle rides, has now grown into a  club with much greater purpose.\n\nThe Brother's Keepers…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694746/tribute-in-honor-of-brothers-keepers-motorcycle-club"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Auxiliary. Over the course of her long and distinguished  career, Doreen has held numerous leadership and administrative roles,  providing unwavering support to both the firefighters and the  community.\n\nTogether with her husband Victor, she helped establish and run the  famous Fish and Chips at the Annual Wendelville Field Days and has  contributed…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699525/recognizing-doreen-neilson"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Wyoming. They are going to be  able to keep $1,400 more this year in their paychecks.\n\nNow, the Democrat leader, Senator Schumer, was just on the floor, and  he talked about firefighters. Well, firefighters work a lot of  overtime. They need to stay on the job. They do that. No tax on  overtime now--that means more money in their pockets to take home.  Firefighters,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699081/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…this ban came from. It was  September 23, 2020. California was in the throes of the worst wildfire  recorded in our State's history. There was untold suffering. Our heroic  firefighters were doing everything they possibly could to get the blaze  under control. Governor Newsom came out and announced: Here is what we  are going to do. We are going to ban…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690484/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…suppression.\n\nThis will help facilitate the acquisition of excess military aircraft  for the aerial wildfire suppression fleet.\n\nThis lifesaving authority protects our aerial firefighters and brings  in revenue from military aircraft that are not needed. In fact, the  Congressional Budget Office anticipates this legislation will reduce  government spending.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691858/aerial-firefighting-enhancement-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…future of these talented  students with this executive order.\n\nSoon, the American workforce will be even stronger than ever.                  Honoring Michaux State Forest Firefighters\n\nMr. JOYCE of Pennsylvania. Madam Speaker, I rise today to honor the  courageous firefighters who have put their lives on the line to fight  the two wildfires in Pennsylvania's…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690194/repealing-green-new-deal-policies"}]