[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Office, which has  long been nonpartisan--used by Democrats and Republicans in Congress-- has made it clear that this would have to involve cuts to Medicaid. Add  that to the firings at the Department of Health and Human Services that  will undercut health services and research.\n\nI just met with a man this weekend from a small town right close to  Brainerd,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689542/h-con-res-14"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "Ms. ALSOBROOKS. Mr. President, I would like to use my time to  highlight the attacks currently being thrown at our Federal workers and  the unconscionable firings that are taking place.\n\nWe have heard baseless and callous criticisms of our Federal workers  from this administration for weeks now. They are wrong, and much of  what they…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688252/department-of-health-and-human-services"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…as a  combat veteran myself, I take this responsibility personally on behalf  of Arizona's more than 500,000 veterans and veterans across the  country. But with these mass firings of staff at the VA, President  Trump and Elon Musk are breaking that promise.\n\nIn the last month, thousands of VA employees, people who care for our  Nation's veterans, were…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688446/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…speak on Protect America's  Workforce Act.\n\nMr. Speaker, I represent 27,000 Federal employees who have been  through  an incredibly challenging year marked by reckless DOGE firings, chaotic  rehirings, and unprecedented uncertainties.\n\nThey have been stripped of their ability to collectively bargain  through President Trump's March executive order. They…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697989/protect-americas-workforce-act"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…up roughly 30 percent of our Federal workforce--or  more than 640,000 veterans in the civil service--and I rise today to  express my absolute outrage over the indiscriminate firings of nearly  6,000 of these veterans--from the VA to the Defense Department to the  Department of the Treasury.\n\nAt the VA, where veterans' input is particularly critical to…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688440/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…economy and  started entire industries, given us healthcare breakthroughs, fortified  our national defense, and reinforced our leadership in the world.\n\nMake no mistake, these firings and cuts to science and innovation  will hurt every single American. They will make us less safe, less  healthy, and less prosperous.\n\nI have the honor of representing in…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691395/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…oversee, and until recently, were only removed for  cause.\n\nHowever, since taking office, President Trump has fired over 20 IGs  across the government. The majority of these IG firings took place in  the first week President Trump took office and violated lawful removal  procedures as they came with no warning or rationale.\n\nIn fact, the Trump administration…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697210/hud-transparency-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…His plan would add $3  trillion to the deficit to give billionaires another tax cut--let me  repeat that again--to give billionaires a tax cut. All these cutbacks,  all these firings are going to fund tax cuts for billionaires.\n\nHe says Social Security is paying benefits to millions of people over  100 years old. That is totally wrong, debunked a hundred…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688503/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…healthcare. We need to fulfill our promises.\n\nAs VFW commander Al Lipphardt said at that hearing, apply pressure  and stop the bleeding.\n\nThese heartless and heartbreaking cuts, firings, freezes are un- American. My Republican colleagues, who have been almost entirely  silent, please do the right thing. Our country has made a sacred  promise. Our duties as…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…This bill effectively would reauthorize many of the unique  federal tax incentives for business investment in D.C. that expired in  2011. With the Trump administration's mass firings of federal  employees, budget cuts and proposed relocation of federal agencies, as  well as the continued prevalence of remote and hybrid work, this bill  is especially important.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697733/introduction-of-a-bill-to-designate-the-district-of-columbia-as-an-empowerment-zone"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "…have-nots to the haves.\n\nIt has been equally alarming to see that our veterans have not been  exempt from what we are all concerned about. In fact, if we look at the  mass firings that occurred, as directed by Elon Musk and his DOGE  effort, one-third of our Federal workforce is made up of veterans. They  have been at risk with those firings.\n\nWe know…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692955/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…SALINAS. Madam Speaker, I rise to sound the alarm about the Trump  administration's reported plans to fire nearly 7,000 workers in the  U.S. Forest Service.\n\nThese illegal firings could have devastating consequences for Oregon.\n\nWildfire season is just around the corner, and there is concern that  the Forest Service won't actually have enough staff…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690926/illegal-firings-could-devastate-oregon"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…political provocateur whose public record is filled  with hate and conspiracies. And don't take my word on these actions.  Ms. Loomer's own social media feed claims all of these firings and  dismissals almost as trophies.\n\nAnd just a few weeks ago we saw something that I believe should  trouble every Member of this body, regardless of which party you belong…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…young professionals  to pursue careers in STEM.\n\nFiring our future STEM workforce just as they are getting started in  their careers is shortsighted and irresponsible. These firings will  decimate the future Federal STEM workforce that will keep American  innovation competitive.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688132/fired-by-president-trump"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…branch have a legal and constitutional duty  to faithfully execute the CR. The CR does not change the underlying law  making the Trump administration's impoundments and mass firings  illegal. This is true as a matter of law.\n\nNothing in the CR changes the Impoundment Control Act, the foundation  of Congress's appropriations authority, and the authorization…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688900/full-year-continuing-appropriations-and-extensions-act-2025"}]