[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…searching for every possible way to weaponize the Congressional  Review Act to take down California's waivers.\n\nNow, who were those authors? The authors were partners at the law  firm of Boyden Gray, who represent oil and gas clients and who were in  court actively trying to repeal California's waivers. So it makes a  whole lot of sense when you realize that…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…offices of the bar administration  to intimidate the legal profession into silence.\n\nHere in America, Trump is engaged in a shameless campaign of  extortion against any major law firm that has taken a position against  Trump or Trump's interests. What he is doing is extraordinary, and it  is mind-blowing to me that it is just being ignored by my Republican…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…March 3, the Verkhovna Rada of Ukraine, which is their Parliament,  expressed its ``profound gratitude to President Donald Trump, Congress,  and the American people for their firm and consistent support of  Ukraine's independence, sovereignty, territorial integrity, as well as  for the security assistance packages provided to Ukraine, which have  helped…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688568/9999"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the 80th floor.  That impact brought down the Cantor Fitzgerald trading company whose  President is Howard Lutnick (who today serves as the U.S. Secretary of  Commerce). That firm handled Wall Street's major oil trader called e- bond's from the Middle East through its New York World Trade Center  offices by denominating them in dollars. It also ran a…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…Russia if we are  truly interested in peace. With Russia, in particular, weakness invites  aggression, and easing up on Russia only makes Ukraine's fight harder.  We must stand firm.\n\nI spent 25 years in the Army, defending America's national security  interests at home and abroad. When I retired a little over 2 years ago,  I traveled to Ukraine 14 times…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687990/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…together only saved the $19 million  EPA had remaining to oversee the program. All of the grant funding was  out the door, in private bank accounts, and in some cases, tied up in  firm legal commitments with third parties. At no point in our  discussions with the majority, directly or in our several conversations  with the Parliamentarian, was this score disputed.…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…On behalf of his valorous  people, he delivered his eloquent plea.\n\nBravo, President Volodymyr Zelenskyy. You singlehandedly challenged  the scions of the global order. Your firm supplication and urgent  request for liberty were extraordinary, rising far above global  niceties.\n\nYou delivered the raw choice, as our own Nation's Founders did:  Liberty…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…child to gun violence, determined not  to let another family go through the same grief. I continue to fight to  end gun violence because of these families. Even now, I stand firm amid  attacks against public health.\n\nHouse Republicans want to slash Medicaid by $880 billion. Their  budget is an attack against millions of Americans who depend on  Medicaid…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690242/health-disparities-in-minority-communities"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…in on shady, multibillion- dollar deals with foreign governments.\n\nSo what happened when the Democrats saw the new version of the bill  last week? We stood together, we held firm, and we made clear that we  were not giving them enough votes to get to 60 and move the bill  forward. That brought Republicans back to the negotiation table over  the last…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690905/genius-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Just last week, alarming new information came to light regarding  foreign governments making business deals using Trump's crypto. A $2  billion business deal using the Trump firm's stablecoins with a fund  backed by Abu Dhabi was announced at a conference in Dubai.\n\nThis arrangement represents a significant contribution by a foreign  government to President…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…happiness,  year after year, in the face of constant threats.\n\nAmerican liberty has been a multigenerational effort, admired around  the world with each generation standing firm. In just over 100 days,  Donald Trump, whose family has no record anywhere of military service  or sacrifice for this Nation, is carelessly throwing liberty to the  wolves.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Cities Improvement Act.\n\nLet's honor the victims by taking decisive action to protect our  Nation from future atrocities and future acts of cowardice. We are  America. We stand firm in our protection.\n\nMr. Speaker, I encourage my colleagues to join me in supporting H.R.  1374.", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688698/securing-the-cities-improvement-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Adler, chief  strategy officer of Rand Commercial; Adam Hammerman, vice president and  CEO of New York Medical College; and Brad Schwartz, a partner at Zarin  & Steinmetz law firm.\n\nThe Friedland Young Leadership Awards will be given to Samuel Adler  of Rand Commercial and Lee Lefkowitz, partner for Zarin & Steinmetz.\n\nMr. Speaker, I salute these talented…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698121/recognizing-jewish-business-network-awardees"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…loan officers. They may even give you misleading or  deceptive information.\n\nH.R. 2808 would curtail this abusive practice, limiting trigger lead  notifications to a financial firm that a consumer already has a  relationship with, like their current mortgage lender. If the consumer  opts in, and you can opt in, then you can have everybody call you.\n\nNow,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692804/homebuyers-privacy-protection-act"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…privilege of traveling to the Baltic. When we speak  with the people there, it is not a question of if Russia will invade.  It is a matter of when. Now is the time to stand firm in our support of  these allied nations to deter Russian aggression.\n\nWhat type of signal does cutting support send to the Kremlin? Cutting  off the BSI is a massive gift to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695263/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…wrong. The expenditure of these is  wrong. Now is the time we face it and put a stop to these. This is just  the first step in a long stairway to get this country back on a firm  financial footing.\n\nMr. Chair, I yield back the balance of my time.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699289/amendment-no-1-offered-by-mr-massie"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…statutory framework: the certificate of crossing.\n\nThis process will be overseen by FERC for oil and gas projects and by  the Department of Energy for electricity. It establishes firm timelines  for reviewing applications and puts subject matter experts, not  politicians, in charge of decisions.\n\nBy creating a consistent statutory framework that protects…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695691/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…to the Chinese  Government.\n\nAmerican education should teach American values, not communist  propaganda.\n\nMr. Speaker, I urge my colleagues to support this bill and take a  firm stand against foreign influence in our children's education.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697530/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…local Texas Realtor association committees and three statewide  committees before retiring from active participation. During a hiatus  from real estate, he also served as a law firm area manager for eleven  years, overseeing operations across three West Texas counties.  Throughout his life, Tom has demonstrated a consistent dedication to  improving the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698289/recognizing-the-success-of-tom-crowley"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…world. It is past time  we enforce accountability against our greatest adversary. The U.S. must  act decisively against the companies that profit from these abuses and  take a firm stand against totalitarian regimes.\n\nThe CCP asserts its control over the Uyghur people through threats,  intimidation, confinement, and physical and emotional abuse. Failing…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690655/no-dollars-to-uyghur-forced-labor-act"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…Corps, advising commands both in the U.S.  and in Vietnam. In 1966, while still on active duty, John married his  wife, Mary. After completing his service, he founded the law firm now  known as Post Polak, P.A., where he served as managing partner until  2008.\n\nToday, I am pleased to join the Borough of Mountainside in honoring  John Post as he serves…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691600/recognizing-john-post"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…transformation while remaining true to its founding principles.\n\nUnder Mr. Hebel's leadership, Bucks Country Gardens has thrived as  both a retail garden center and a landscape design firm. The garden  center offers an impressive array of plants, trees, and flowers as well  as fine outdoor furniture from trusted brands such as Castelle,  Hanamint, Telescope, and…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696583/recognizing-bucks-country-gardens-president-tom-hebels-retirement-after-years-of-service"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…be available to all and applied  fairly to every litigant.''\n\nFor these reasons, he has earned widespread support, including from  his law school, his coclerks, and his law firm colleagues.\n\nI am confident that Mr. Dunlap will make an outstanding judge on the  First Circuit. I also trust he will take great pride in serving his  State and our Nation.…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696500/nominations-of-joshua-d-dunlap-and-eric-chunyee-tung"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…agencies to look at the permits they issue and determine  which ones can be done by permit by rule, which means they have a  predetermined list of requirements for a permit and firm timelines on  making those decisions. An applicant can bring an agency everything on  that list, and the agency can either say: Yes, this is adequate for  a permit, and issue…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689196/work-highlights-of-western-caucus"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…the term ``COVID'' before. We had seen a tax reform  bill take place at the end of 2017 that people couldn't really wrap  their heads around.\n\nI was working for a consulting firm, and I remember talking to some  of the partners at the firm. I was a principal at the time--actually, I  was probably an engagement manager at the time.\n\nI remember them saying:…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…is never for sale.\n\nForced organ harvesting is pure evil, and if we don't act, then we  will be considered complicit.\n\nMr. Speaker, I urge every one of my colleagues to stand firm for  human dignity and support H.R. 1503, and I yield back the balance of my  time.\n\nMr. MAST. Mr. Speaker, on that I demand the yeas and nays.\n\nThe yeas and nays were ordered.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…people are watching the U.S.'s actions and  deciding whether or not they want to have much of anything to do with  us going forward. We need to be making sure that that is a firm yes  instead of a no.\n\nGreenland is an amazing place. It is a beautiful place. Again, I have  had an opportunity to visit it multiple times. It reminds me of Alaska,  my home…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…cyber attacks, or systems that evade human  oversight. Another final example would be accessing tools designed for  offensive cyber operations.\n\nUnder this bill, if a Chinese firm would like to rent access to a  cluster of advanced chips already subject to U.S. control in an  overseas data center, the Department of Commerce can require a license  if determined…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698858/remote-access-security-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…certainly witnessed consumer harm when the Financial  Services Committee heard unprecedented testimony from an expert called  in to clean up the failed digital asset crypto firm FTX and the mess it  left behind. In his words, never had he seen such an utter failure in  corporate controls.\n\nIn its wake, then-Chairwoman Waters wisely stated: ``We need…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693775/digital-asset-market-clarity-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…offering; and''.\n\n(b) Securities Exchange Act of 1934.--Section 12(b)(1)(K)       of the Securities Exchange Act of 1934 (15 U.S.C.       78l(b)(1)(K)) is amended by striking ``firm'' and inserting       ``firm, provided that the application of an emerging growth       company need not present acquired company financial       statements or information otherwise…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693855/greenlighting-growth-act"}]