[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…H.R. 1969, the No  Wrong Door Act, as amended.\n\nThis bill would reauthorize the Staff Sergeant Parker Gordon Fox  Suicide Prevention Grant Program, or Fox grants, for fiscal year 2026.\n\nAs the ranking member of the Veterans' Affairs Committee, one of my  top priorities has been and will continue to be veteran suicide  prevention. The Fox grant program…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691508/no-wrong-door-for-veterans-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Department of State, and Related Programs  Subcommittee.\n\nMs. LOIS FRANKEL of Florida. Mr. Chair, I thank Ranking Member  DeLauro for yielding.\n\nI rise in support of the fiscal year 2026 National Security,  Department of State, and Related Programs funding bill, a bipartisan  package that strengthens American leadership and aims to make our  country safer,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…of cloth. Yet, here we are for  the third year in a row voting to ban the Pride flag from spaces at the  Department of Defense.\n\nNearly half of the House Republicans' fiscal year 2026 appropriation  bills include bans on the Pride flag as well. I don't know what they  think this flag does. The Pride flag did not make me gay, and it will  not make DOD…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695261/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…benefiting no one.\n\nWe need the funding that this Congress provided to go through now  because starving children can't wait. To make matters worse, the  administration's fiscal year 2026 so-called skinny budget completely  eliminates funding for the Food for Peace program, a bipartisan program  that is the main source of funding for food assistance to…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690809/funding-food-aid-for-malnutrition"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…on agreeing to McCormick Amendment No. 25 to  H.R. 3838, the Streamlining Procurement for Effective Execution and  Delivery and National Defense Authorization Act for Fiscal Year 2026.               Amendment No. 29 Offered by Mr. Biggs of Arizona", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695208/9999"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "Mrs. MURRAY. Mr. President, today, I will be voting to move ahead  with the first spending bill for fiscal year 2026.\n\nNow, there is no doubt that the path forward on appropriations this  year has been made extremely challenging by President Trump's flagrant  lack of regard for Congress…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694203/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…rise in support of my proposed  amendments to H.R. 3838, the Streamlining Procurement for Effective  Execution and Delivery and National Defense Authorization Act for  Fiscal Year 2026.\n\nOhio's 13th Congressional District has long been known as the Rubber  Capital of the World, and my First Amendment upholds that legacy by  investing in American manufacturing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695128/my-amendments-to-hr-3838"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Congresses. The third, USS Groton SSBN 828 is ready  to start construction, subject to Congress approving the funds.\n\nFor this CR, The Navy requested an anomaly for full fiscal year 2026  Columbia program funding to Congressional leadership to keep this  program on track. In past years, this has been a normal request in  order to make sure production stays…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696732/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "Mr. SCOTT of Virginia. Mr. Chair, I rise in support of my amendments  to H.R. 4553, the Energy and Water Development and Related Agencies  Appropriations Act for Fiscal Year 2026, and in opposition to the  underlying bill.\n\nThe bill itself cuts over $750 million from the FY25 spending levels,  revokes $5 billion from the Bipartisan Infrastructure…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694942/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Subcommittee, which provides  funding for the ABMC, I am acutely aware that the programs that  Congress authorizes require funding to ensure proper implementation.\n\nIn both fiscal year 2026 House and Senate MILCON-VA appropriations  bills, we secured $500,000 to carry out this mission with ABMC, and I  look forward to working with my colleagues to ensure…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695467/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…communities  that is unique and accommodating to their expertise and deep knowledge  of local challenges and solutions.\n\nThe bill will authorize $31 million for each fiscal year from 2026 to  2030 to carry out the bill's objectives. No later than 1 year after the  establishment of the bill, the Comptroller General will conduct an  audit of the initiative…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692645/introduction-of-the-energy-transitions-initiative-authorization-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…the science.\n\nUnfortunately, the Trump administration has failed to see the  importance of this Federal investment in science for our country's  future.\n\nThe President's fiscal year 2026 budget proposes cutting the NSF  budget by 55 percent, including fundamental research, education, and  broadening participation efforts.\n\nOther agencies have been impacted…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. This week, the Senate is expected to take up the first  set of appropriation bills for fiscal year 2026.\n\nOn the substance, a number of the bills negotiated in committee make  significant reversals of DOGE's horrible cuts. Of particular importance  are the reversals these…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693852/appropriations"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…and there are other things.\n\nI might add, just so that the people on the committee here  understand, in June of 2025, the House Committee on Appropriations  advanced the fiscal year 2026 Department of Homeland Security  appropriations bill. It included bipartisan reforms and safeguards  designed to protect U.S. citizens and vulnerable communities.\n\nHowever,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…chaos and corruption lives on. The zombie  of DOGE lurches on here in the House with the delivery of a $9.4  billion rescission package to make those cuts permanent, a fiscal year  2026 budget delivered in front of the Committee on Appropriations to  eviscerate Federal programs, and, yes, the disgusting abomination of  reconciliation that is in front…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691867/zombie-of-doge-lurches-on"}, {"senator": "John Thune", "party": "Republican", "sentence": "…prosperous.\n\nWe have additional bills coming down the pike. The Armed Services  Committee under Chairman Wicker recently reported the National Defense  Authorization Act of fiscal year 2026, and the Appropriations Committee  under Chair Collins has reported out four bipartisan bills, which we  will begin considering this week.\n\nI said last year that I was…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693870/trump-administration"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…this resolution it shall be       in order to take from the Speaker's table the bill (H.R.       7148) making further consolidated appropriations for the       fiscal year ending September 30, 2026, and for other       purposes, with the Senate amendments thereto, and to consider       in the House, without intervention of any point of order, a       single…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…local law enforcement agencies continue to face  resource and equipment gaps that limit their ability to respond  effectively and keep their communities safe, and the fiscal year 2026  CJS appropriations bill addresses these needs by investing in crime- fighting technology and equipment for sheriff's offices and police  departments in Kansas and across…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Thune", "party": "Republican", "sentence": "…President, the appropriations process is officially  underway here in the Senate.\n\nLast week, the Appropriations Committee held its first markup of  appropriations bills for fiscal year 2026, and I am pleased to report  that the committee referred two bills to the floor with bipartisan  support. Today, I want to talk about one of the bills that came out of…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693501/agriculture-appropriations"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…striking ``$17,600,000 for       fiscal year 1992 and $17,900,000 for fiscal year 1993'' and       inserting ``$57,000,000 for fiscal year 2025 and $57,000,000       for fiscal year 2026''.\n\n(b) Under Secretary of Commerce for Communications and       Information.--\n\n(1) Under secretary; deputy under secretary.--\n\n(A) Under secretary.--The National Telecommunications…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690257/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Mr. Chair, I rise in support of my amendment to H.R. 3838,  Streamlining Procurement for Effective Execution of Delivery and the  National Defense Authorization Act for Fiscal Year 2026.\n\nMy amendment is intended to address the Janet Mello fraud case, the  Army civilian who was indicted and pleaded guilty to stealing over $100  million that were intended…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695237/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…can make this make sense.\n\nThis is last year. The red is spending. The blue is tax receipts.  That gap is debt. You will notice, actually, that our projection for  the fiscal year 2026 is our tax receipts--so tax collections are  actually up. They are actually up almost 17.8 percent, which is  wonderful. Most of it is capital gains. You know, the stock…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…their official websites, along with a certification  that neither they nor their immediate family members have any financial  interest in the items requested.\n\nAll of the fiscal year 2026 CDS requests submitted to the  Appropriations Committee can be found in a searchable table that has  been posted on the committee's website.\n\nMs. COLLINS. I urge our colleagues…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699433/consolidated-appropriations-act-2026"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Mr. President, had I been present for the rollcall vote  No. 648, on the motion to concur in the House amendment to S. 1071, the  National Defense Authorization Act for Fiscal Year 2026, my vote would  have been in the affirmative.\n\nMy absence is due to my attendance at the dignified transfer ceremony  at Dover Air Force Base to receive the remains of…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698316/vote-explanation"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…ready for the threats of tomorrow.\n\nI am proud that the Senate Armed Services Committee has made this a  top priority and that the National Defense Authorization Act for Fiscal  Year 2026 reflects that commitment.\n\nI look forward to voting for this must-pass legislation on the Senate  floor and to vote on it very soon.\n\nThat partnership between the United…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "Mr. SIMPSON. Mr. Speaker, I am pleased to begin consideration of H.R.  6938 today, which includes the fiscal year 2026 Department of the  Interior, Environment, and Related Agencies Appropriations Act.\n\nFirst, I commend Chairman Cole for his leadership over the  Appropriations Committee…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698758/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Biden-era spending levels for these same  Agencies.\n\nOnce we finish this package, we have more work to do. Appropriators  are working to finish the remaining bills for fiscal year 2026. One of  those is the Defense appropriations bill--which is an especially  important priority--to ensure that our military has the funding and  certainty it needs to maintain…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698828/appropriations"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "Mrs. BICE. Mr. Speaker, I rise today in strong support of the rule to  consider the final four fiscal year 2026 appropriations bills.\n\nThese appropriations bills, like the previous eight that came before  it, are fiscally responsible and represent a return to regular order.  The…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699306/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "Mr. CALVERT. Mr. Chair, I thank the gentleman from Texas for yielding  me time.\n\nMr. Chair, I rise in support of the fiscal year 2026 Military  Construction, Veterans Affairs, and Related Agencies Appropriations  Act. It is fitting that the appropriations bill to come to the House  floor this year is…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692941/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…House counterparts to  reconcile House and Senate priorities for these bills, as well as those  of the administration. This was not an easy task.\n\nIn developing the final fiscal year 2026 appropriations bills, the  House and Senate committees worked from a top line that is less than  what Congress would spend under a continuing resolution. Priorities  were…", "date": "2026-01-26", "source_url": "https://justfacts.votesmart.org/public-statement/1699384/appropriations"}]