[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…. .       It has accordingly with studied care, vested the question of       war in the Legislature.\n\n``[M]ost prone to it''--words written more than 200 years ago and so  fitting for today, when in but his first year in office, the President  used military power in Iran, Nigeria, Syria, Yemen, and most  significantly, in Venezuela.\n\nAfter months of…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699093/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…played a decisive role during World War II in intercepting enemy  communications, including the message that helped pave the way for the  D-Day invasion of Normandy.\n\nIt is fitting that a place that helped secure freedom will now serve  those who fought to preserve it. The center appropriately honors the  Puller family, including General Lewis ``Chesty''…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698917/korean-american-day"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…heartfelt  congratulations to Steve Dargan on this very special occasion. Steve  has dedicated a lifetime of service to the community he calls home, and  I cannot think of a more fitting accolade to recognize his dedication  and commitment.", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689392/recognizing-the-honorable-steven-steve-dargan-west-havens-2025-irish-person-of-the-year"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…and inducted into the Vicksburg Warren School  District's Athletics Hall of Fame. Now, in 2025, Millsaps College has  honored him as a member of its Athletics Hall of Fame--a fitting  recognition of his contributions to collegiate athletics and leadership  on and off the field.\n\nMr. Speaker, I ask my colleagues to join me in celebrating the  remarkable…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695590/9999"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…sent to a mosquito-infested swamp in Montford  Point, and that is where they served from 1942 all the way through  1949.\n\nI am pleased that this body, in its wisdom, saw it fitting and proper  to give the Congressional Gold Medal to those Montford Point Marines in  such a way that I would think was offering an apology for the way they  were treated while…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…processed and approved, including  careful vetting in line with existing immigration standards. This will  not only assist these veterans in their senior years but also provide a  fitting recognition of their critical service in the War.\n\nI encourage my colleagues to join me in supporting these veterans and  helping fulfill our promises to them and their families.", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691684/introduction-of-the-filipino-veterans-family-reunification-act-of-2025"}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "…their cuts to food assistance even more tone deaf  than ever.\n\nA fudge-filled, seven-layer cake? I guess the theme of the White  House event was ``let them eat cake.'' How fitting.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695067/condemning-benjamin-netanyahu"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…Miranda, and Robin Williams. Without Miller's  intellectual curiosity, detailed nature, and vigorous collaboration,  none of this would be possible.\n\nMr. Speaker, it is altogether fitting that the House recognizes Danny  Miller for his exceptional career and congratulates him on his well- deserved retirement.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697682/recognizing-the-retirement-of-danny-miller-as-co-executive-producer-of-fresh-air"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…he was a strong champion for conservation. He  sponsored the first bill to designate the Flatside Wilderness back in  1984, so the redesignation included in this bill is a fitting tribute.\n\nWilderness areas hold immense importance for a variety of reasons.  They support and provide essential ecosystem services, including clean  air, water, carbon sequestration,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691097/flatside-wilderness-additions-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…August, and her  dedication to building partnerships and advancing science-based  solutions is a big reason the program has been so successful in Mobile.\n\nIt could not be more fitting that, in the same year in which she  celebrates 16 years of leadership and her retirement, that her  Congressman has the honor of leading this reauthorization and advancing…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698177/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…and environment are  stronger because of Billy's decades of advocacy and leadership.\n\nBilly was also a veteran of the Marine Corps and served during the  Korean War. It is fitting that a Navy ship will now bear his name. The  USNS Billy Frank Jr. will offer salvage, rescue, ocean-going towing and  other support capabilities for U.S. Navy fleet operations,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689283/christening-of-the-usns-billy-frank-jr"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…Magazine as one of the City's 75 Most Influential People  and, in 2024, he was inducted into the Broadcast Pioneers of  Philadelphia Hall of Fame.\n\nMr. Speaker, it is altogether fitting that the House recognizes  Bernie Prazenica for his exceptional career and congratulates him on  his well-deserved retirement.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698974/recognizing-bernie-prazenicas-retirement-as-president-and-general-manager-of-wpvi-tv"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "Mr. COSTA. Mr. Speaker, I thank the gentleman for yielding me time to  do what is fitting and appropriate, and that is, honor the life of our  colleague, a life well lived, a Member of the House of Representatives  who did such a good job on behalf of his constituents…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698716/9999"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…and the Bill Pascrell, Jr. Overlook Park.\n\nThese places offer sweeping views of the Great Falls, a symbol of  American ingenuity, labor, and power.\n\nThere could be no more fitting a tribute to a man whose career  reflected those same qualities. For decades, Bill Pascrell fought for  the people of Paterson and the State of New Jersey. Anyone who visited…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691126/redesignation-of-paterson-great-falls-nhp-facilities"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…overcome division through sacred teachings and the admirable tenets of  honest work, charity, volunteerism, and sharing with those in need.\n\nMr. Speaker, it is altogether fitting that the House recognize Guru  Tegh Bahadur's supreme sacrifice for human rights and religious  freedom, and encourage all Americans to join in its observance on  November…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696204/recognizing-the-350th-anniversary-of-the-martyrdom-of-guru-tegh-bahadur"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…DeBellevue represents the very  best of the United States Air Force and of those Americans who have  answered our Nation's call with uncommon valor and lifelong dedication.  It is fitting that his service and legacy be entered into the  Congressional Record so that future generations may know and be  inspired by his example.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699080/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…preserving its heritage while preparing for the future is a model of  responsible and thoughtful community development. As Brooksville  celebrates its 170th anniversary, it is fitting to recognize the  contributions of its past and present residents, civic leaders,  educators, first responders, and volunteers whose dedication has  ensured the city's continued…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700091/recognizing-the-city-of-brooksville"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…bestowed upon Mother Teresa, the Dalai Lama,  and Archbishop Desmond Tutu. This honor recognizes his lifelong  commitment to faith, peace, and science.\n\nMr. Speaker, it is fitting that we welcome His All-Holiness  Ecumenical Patriarch Bartholomew back to Washington, D.C. and recognize  his remarkable contributions as a global religious leader, peacemaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695424/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…a national holiday in his 11th general  order when he was commandant of the Grand Army of the Republic. His  legacy of service continues to inspire Americans today.\n\nIt is fitting that the Woman's Relief Corps has made its home at the  General John A. Logan Museum in Murphysboro, Illinois.\n\nAlthough the Woman's Relief Corps received its congressional…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699501/moving-national-womans-relief-corps-incorporation-and-domicile-to-illinois-principal-office-to-murphysboro-illinois"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…its 100th anniversary. The community festival will  include a 5K walk/run, children's games and activities, as well as  plenty of vendors in the heart of downtown. It is a fitting way to  honor the town's impressive history while celebrating its bright  future.\n\nIt is an honor to recognize this special anniversary. I applaud the  community leaders and…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694485/100th-anniversary-of-fort-laramie-wyoming"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…hard to fault the President from acting  within them.\n\nRestoring the many guardrails that separate executive, legislative,  and judicial powers in our Constitution would be a fitting way for  Congress to celebrate our Nation's 250th anniversary. The Supreme Court  is doing its part by restoring the President's exclusive control over  executive agencies,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698660/lessons-from-caracas"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…rightful name. This is North America's largest peak. ``Denali,''  in the Koyukon-Athabascan language, means ``the great one,'' and that  is absolutely, positively, 100-percent fitting for this magnificent  mountain. We are going to live to fight another day on that because  nobody is going to take that mountain from us. I am certainly not  standing down…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…commitment to serving those  most in need. Their work exemplifies the purpose of community  development programs and demonstrates how thoughtful investment  can change lives. It is fitting that this exceptional project has been  recognized with the Audrey Nelson Award.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698647/recognizing-pasco-county-community-development-for-receiving-the-audrey-nelson-award"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…of Marines was created by a       resolution of the Continental Congress. Since that date many       thousand men have borne the name Marine. In memory of them it       is fitting that we who are marines should commemorate the       birthday of our corps by calling to mind the glories of its       long and illustrious history.\n\nThe record of our corps…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696624/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Church in Temple, and in 2019 became Chairman of the  Committee on Committees.\n\nLt. Col. Davison leads with strength, integrity, and drive in each  community he joins. He is a fitting recipient of a Congressional  Veteran Commendation, and I am proud to honor his outstanding  achievements.", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689349/saluting-the-service-of-lieutenant-colonel-jeff-davison"}, {"senator": "French Hill", "party": "Republican", "sentence": "…House of Representatives in reading President  George Washington's farewell address.\n\nHaving just celebrated the 294th birthday of our indispensable first  President, this is a fitting tribute as we celebrate the 250th year of  our Nation's creation.\n\nThe farewell address is a remarkable document. Published in the  American Daily Advertiser on September…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700272/president-washingtons-farewell-address"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…highlighting  exceptional Montanans each month who embody the spirit of our great  state and Nation.\n\nLast year, rodeo was officially recognized as Montana's state sport.  It's only fitting that the first Montanan I honor is Havre native Flint  Rasmussen.\n\nFor decades, Flint brought laughter, heart, and unforgettable energy  to rodeo arenas across Montana and…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699393/recognizing-rodeo-hall-of-fame-member-flint-rasmussen"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…aliens, both reported members of Tren de Aragua, the  gang notoriously known around the country, have been charged in her  killing.\n\nNaming the refuge after Jocelyn is a very fitting way to honor her  love for animals and to preserve her spirit within the very landscape  that she called home.\n\nI thank Chairman Westerman and Senator Cornyn for their leadership…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693448/jocelyn-nungaray-national-wildlife-refuge-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Wildlife Refuge to ``Jocelyn Nungaray       National Wildlife Refuge''.\n\n(4) Ms. Nungaray loved animals and, given the close       proximity of her hometown of Houston, it is fitting that the       Anahuac National Wildlife Refuge be renamed in her honor.       SEC. 3. RENAMING OF ANAHUAC NATIONAL WILDLIFE REFUGE.\n\n(a) Renaming.--The Anahuac National Wildlife…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693446/jocelyn-nungaray-national-wildlife-refuge-act"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…public service.\n\nI am pleased to support the ongoing work that has brought the Adams  Memorial closer to reality, ensuring that our Nation's first leaders  are remembered in a fitting and lasting way.\n\nI urge all my colleagues to support this bipartisan legislation.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697630/adams-memorial-great-american-heroes-act"}]