[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…home are suffering. He knows that  he can fix the problem by just putting the bill on the floor because it  will pass. There is a lot to discuss and debate when it comes to fixing  our  healthcare system, but right now, there is an immediate concern.  Premiums are spiking across the country, so the most immediate thing we  can do to lower healthcare…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…American energy  leadership to China. And it rewards the ultrarich.\n\nRepublicans should abandon these destructive policies. But, of  course, they aren't doing that. Instead of fixing their bill,  Republicans want to rush it because they don't want the American people  to find what is in it. And their fears are certainly justified because  the more and more…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693133/one-big-beautiful-bill"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…has been absolutely hectic.\n\nRather than constantly responding to the craziness from this  administration, by voting ``yes,'' Congress can finally focus on the  substance of fixing healthcare. The fact is this bill is a short-term  fix for extending tax credits. It is also a vehicle for our Senate  colleagues to use so that we in Congress can provide…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698808/breaking-the-gridlock-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…congressional inaction to protect its bottom  line.\n\nMonitoring the damage after a disaster matters, but monitoring alone  is not prevention. Studying the aftermath is not the same as fixing the  cause.\n\nMr. Speaker, the contrast is clear. I have legislated. I have shown  up. I have questioned those in power and refused to let East Palestine  be forgotten.\n\nOthers…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699687/norfolk-southern-train-derailment"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…abducting  people off the streets based on the color of their skin.\n\nThese immigration raids only serve one purpose: sowing fear and  intimidation.\n\nIf the Republicans cared about fixing our broken immigration system,  this wouldn't be the way to do it. If they did, they would work with  Democrats to ensure our border is secure, families stay together, and…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697072/condemning-deployment-of-cbp-to-north-carolina"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…like mobile apps, online shopping, and facial recognition  technology.\n\nThis is called surveillance pricing, and all of us need to wake up  and see that this technology is fixing prices and increasing costs for  our families.\n\nTarget, for example, charged higher prices to consumers who were  using their app when they were inside their stores, assuming…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694896/providing-recovery-for-flood-victims"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…the river that you are dumping effluent into and  ruining things for people downstream or whether it is our common  atmosphere, if you pollute, you should pay for the cost of fixing it.\n\nBetter still, you should pay enough that you don't pollute in the  first place and the neighbor's yard isn't a wreck of your trash and the  river isn't dirty downstream…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…House, Senate, and the White House. If they  refuse to pass a budget that protects healthcare, they own the  consequences. If they choose to shut the government down instead of  fixing the healthcare crisis that they created, the American people  will not forgive them.                        Restoring Lifesaving Food Aid\n\nMr. MAGAZINER. Mr. Speaker, I rise…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695636/government-funding-and-healthcare"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…and has passed a bill to fix  it, and the President has said that he will sign that bill. The Mayor  of D.C. has repeatedly spoken to House Republicans about the urgency of  fixing the city's budget. The clock is ticking, and if the fix isn't  passed, D.C. will have to lay off hundreds of teachers and police  officers and curtail critical services in…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…parents should buy their kids fewer dolls for Christmas. We  are not talking about fewer dolls for Christmas; we are talking about  necessities like food, like medicine, like fixing your car when it gets  damaged, like maybe going to see the grandkids whom you haven't seen in  2 years because you can't afford the trip. He said  kids at school should have…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697816/affordability"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…COURTNEY. Mr. Speaker, this week we are going to be taking up  legislation on H.R. 672, an act to establish new ZIP Codes for certain  communities.\n\nThis measure is aimed at fixing problems in about eight communities  all across the country where the post office's ZIP Code allocation  system has just completely fragmented these towns and cities because…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693853/improving-community-zip-codes"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…do so.\n\nThat is what is going on right now with our Federal Government. The  IRS has a backlog of tax refunds that is costing the American people a  lot of money. Instead of fixing the backlog and rooting out waste and  fraud, this administration is defunding the IRS and firing tax experts.  They are opening the door for more waste, fraud, and abuse,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692238/backlog-in-irs"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…going on here?\n\nOur country is producing drugs, paying more for them than other  customers around the world--the problem is so glaring that even  President Trump has identified fixing this issue as a priority.  Bipartisan feeling--change it, reduce the price of drugs.\n\nWhy is the United States such an outlier? One of the major reasons-- if you watch television,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694204/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…people  who are hurting and living on the edge get back on their feet;  investing in our children and pipelines for young people to have lives  that they can only dream of; fixing a broken system that makes it  difficult for people who are living on the edge to survive; raising  wages; lowering the costs of housing, food, energy, and healthcare;  and,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696976/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…other major issues in our country.\n\nWe will have leaders who are willing to fix our broken economy and  overhaul our tax code so that hard work pays off for every American.\n\nFixing the tax code does two things. One, it will ensure that the  superwealthy and big corporations pay all their taxes just like the  rest of us, and two, it will generate trillions…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699242/restoring-election-integrity"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…want us to fix it by doing the  same thing that has extended this problem. They want our family,  friends, and neighbors to suffer further pain as opposed to joining us  and fixing the problem as opposed to extending it.\n\nMy bill, the Association Health Plans Act, allows small businesses  and self-employed Americans to band together, like large companies,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698404/lower-health-care-premiums-for-all-americans-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…one has the lowest overdraft fees and the best consumer  accounts, instead we have the Federal Government trying to tell people  what the price can be. It is Federal price-fixing.\n\nWhat the opposition has argued today is that these fees are hidden.  They are not. Consumers opt into this product, Mr. Speaker. They know  what the fee is because it is…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Defense  Authorization Act for fiscal year 2026.\n\nThis is a good product that was worked in a bipartisan, bicameral  fashion.\n\nThis year, we focused a lot of our efforts on fixing the Pentagon's  broken acquisition process, which is failing our warfighters. The  fiscal year 2026 NDAA includes a series of reforms to put commercial  solutions first, eliminate…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697810/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "John James", "party": "Republican", "sentence": "…organizations.\n\nMr. Chair, the American people are tired of Democrats and Republicans  bickering. I imagine both Democrats and Republicans agree on fentanyl  and any direction on fixing this scourge is a step in the right  direction.\n\nMr. Chair, with this bipartisan legislation and action that we are  taking to save lives, I encourage all of my colleagues…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691886/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…because we are going to change their business model  and make them compete.\n\nGuess what, Mr. Speaker. That might be what we just accomplished in  this vote, which is less about fixing the expiring tax provisions,  which we are going to do, but maybe it will also give us that window  where we can change and improve the way we deliver these services.\n\nI can't…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…to actually talk about it because the  other side will run attack ads beating the crap out of you in the next  election because you dared talk about the morality of actually fixing  these things.\n\nLook, right now, I am in a 50/50 district. There is someone over at  the DCCC taking clips saying: He said the words ``Social Security.'' We  have our attack…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…not been  offenders of the woke and DEI problems that are rampant at many other  major universities with large endowments.\n\nAs long as my Democratic colleagues are keen on fixing provisions of  the One Big Beautiful Bill Act that were the result of this Byrd  process, I think it is only fair that we fix this one as well. Again, I  strongly support the…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693387/9999"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…higher rents. All of it  exploded, went out of control. It is a matter of fact. It is not a  matter up for debate. It happened in this country.\n\nDemocrats were not focused on fixing those things. Instead, they are  focused on their latest Trump obsession. When the border collapsed and  millions of illegal immigrants poured into communities across our…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…friends who are fiscal  conservatives but also want to modernize the delivery of services, help  me. We have spent almost a year diving into the data. What would happen  if fixing these misalignments, the waste and fraud--actually, it  doesn't get us where we need to be, but it starts moving us in the  right direction.\n\nMr. SCHWEIKERT. Mr. Roy, I think…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…creating Trump health freedom accounts and allowing Americans to shop  across State lines, encouraging competition.\n\nNot a single Republican ever voted for your plan, but we are fixing  it now. This is a good first step.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698387/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…changes in how  our Federal Government is working for them, particularly changes in the  disastrous policies from the last 4 years. I plan to help deliver on  those demands by fixing how Washington works and implementing President  Trump's agenda to make America first.\n\nThis resolution gives us the framework that we need to meet the  demands of those 77…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688081/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…they added $8 trillion to the national debt.\n\nThey did it by expanding the Federal Government, offering ObamaCare  to people making hundreds of thousands of dollars, price-fixing in the  drug markets and having premiums go up on seniors.\n\nThey did it by expanding the IRS by 80,000 IRS agents and by offering  tax subsidies to green energy corporations…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…in Wyoming. Compare that to the  September 2021 lease sale that netted over $1.3 million.\n\nThe people of Wyoming are elated that President Trump, on day one,  committed to fixing the sins of the previous administration by  declaring a national energy emergency.\n\nYou know, I was in Seoul, South Korea, last spring. And one day, we  had clear air. The…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…back and put it under Treasury.\n\nIf we as Members of Congress want to appropriate it again,  appropriate it again. I just gave you three pieces of legislation: I  gave you fixing Medicare Advantage, alignment of the incentives. Moving  to a talent-based immigration system, which, in the long run, is one of  the most powerful things we can do for GDP…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…out they gave us $1.84 trillion as a preliminary guess.  Hopefully, in the next couple of weeks, we will get an official score.\n\nIs this Republican or Democrat? It is just fixing the waste, fraud,  and misalignment in the program.\n\nLook, I fully expect within minutes I will have attack ads in my home  district beating the crap out of me, and I am in…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}]