[{"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…On Tuesday, November 4th, a cargo jet bound for Hawaii crashed  moments after takeoff. Unable to gain altitude, the jet went down just  beyond the airfield, erupting into flames as hundreds of thousands of  pounds of jet fuel ignited. The resulting fire engulfed an area the  size of nine football fields, and the thick, black plume of smoke could  be…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696618/recognizing-the-bravery-and-heroism-of-okolona-fire-protection-district"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…risk escalating a perilous  moment. What the senior Senator from Utah posted after the shootings  was reckless and beneath the dignity of his office. For a Senator to  fan the flames of division with falsities while the killer was still on  the loose is deeply irresponsible. He should take down his post  immediately and apologize to the families of the…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692580/national-protests"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…largest  wildfire of the year so far in the United States.\n\nI am grateful for the firefighters and local authorities who bravely  responded and who are continuing to fight the flames. Thanks to them,  the fire is now over 70 percent contained.\n\nMr. Speaker, while Oregon firefighters are out, saving lives and  homes, President Trump is freezing the funding…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693956/addressing-firefighter-funding-cuts"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…and any one of us and our families  or someone we love could be affected.\n\nDonald Trump doesn't take this moment to unite us as a country.  Instead, he has chosen to fan the flames. He refuses to bring us  together to unequivocally denounce all of the political violence that  we have faced. Instead, he has weaponized this moment and this tragedy  to go…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695732/charlie-kirk"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…heartbreaking and anti-American rise in religious discrimination and  hate-fueled extremism and to call particular attention to the ways this  administration has fueled the flames of Islamophobia and anti-Arab hate  that has hurt countless members of our Muslim American and Arab  American communities.\n\nNow, unfortunately, neither religious discrimination…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Champion of the Week.\n\nOn August 17, Joshua and his team responded to a call for a basement  fire. Joshua and his team acted swiftly, entering a burning home,  fighting back flames, and clearing a path to the basement.\n\nOnce underground, amidst thick smoke and scorching flames, Joshua and  his team conducted a methodical search and later found an 8-month-old…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694842/massive-cuts-to-energy-and-water-infrastructure"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…see how dangerous R.F.K., Jr.'s,  leadership has been. It just takes two eyes and 2 seconds, if that.\n\nI mean, one of the first things he did right off the bat was fan the  flames of a measles outbreak by ignoring the science, peddling quack  treatments, and spreading falsehoods about vaccines. The result, no  surprise, was the largest measles outbreak…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694964/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…of the Year by the National Association of Letter  Carriers.\n\nOn April 18, 2024, Mr. Deyasso witnessed a car drive off the highway  and crash into a barrier, erupting into flames. Without hesitation, he  rushed to the scene. Joined by a group of Good Samaritans, Mr. Deyasso  worked tirelessly to pry the car door open, fighting against intense  heat…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690461/recognizing-the-extraordinary-bravery-of-tesfaye-deyasso"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…three-minute escape time to less than one minute, making       these fires a rapid death trap. These fires present unique       safety risks and create major hazards like flames, exploding       projectiles, and thermal runaway. This causes an explosive,       domino effect within the cells of a battery making it       especially challenging for first…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…with nonprofits and Forest Service  employees, use that drip torch myself and participate in prescribed  fires in order to work to make sure that this area would not go up in  flames and threaten the entire city. It is this sort of work that some  of the employees in my district who were fired were doing. They were  protecting homes and protecting lives.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…We think it is good. I know you wanted this,  but we can't have that because we are $37 trillion in debt.\n\nI go back to this chart. There is a big yellow bar over here with  flames on top. It shows almost a trillion dollars of additional deficit  that the Senate bill would add if the policies they are currently  debating in the Senate are adhered to.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…of the use of national songs banned by the Soviet,  and this, by singing it, was their means of protest.\n\nFifty years of brutal Soviet occupation could not extinguish the  flames of freedom and all Baltic countries are again free and  prosperous and these three countries happen to be among the most pro- American allies.\n\nI wonder if we can learn a lesson…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689062/russia"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…volunteers have never hesitated to offer support through  mutual aid. When disaster strikes and the stakes are high, these men  and women grab their gear and get moving, facing flames, chaos, and the  unknown with unshakable resolve.\n\nTheir station, nestled on Dailey Hill Road, is home to a well- equipped fleet that reflects their forward-looking mindset.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693639/hornoring-the-kennedy-fire-department-on-its-100th-anniversary"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…this remains a strategic  weakness in our national security relative to China.\n\nAs we speak, CCP--the Chinese Communist Party--propaganda is flooding  the world to fan the flames of a narrative that Friedman seems to  embrace, and it is this: Their narrative is that President Trump has  broken the World War II liberal international trading system.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…the bonds that make East Palestine a special place  in which to live.\n\nI also want to recognize their heroism during the 2023 train  derailment. When disaster struck, with flames and toxic hazards  threatening our village, they stepped up with incredible bravery. Their  actions that night, and in the days that followed, will be remembered  for generations…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693528/congratulating-the-east-palestine-fire-department-for-150-years-of-service"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…healthcare will somehow become cheaper. It will become simpler and more  humane. That promise clearly has failed in a spectacular way. We are  watching it fail and go down in flames as we speak.\n\nThe Affordable Care Act was sold as a solution. It has locked  families instead into a system where premiums keep rising and  deductibles keep climbing, networks…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "Russ Fulcher", "party": "Republican", "sentence": "…Idaho loses revenue in timber sales due to wildfires  fueled by federal land mismanagement. In fact, in 2024 alone, a  staggering one million acres of the Gem State went up in flames.\n\nRural counties in Idaho are impacted even more so by extensive  federal ownership, as they are unable to tax large portions of land in  their jurisdiction.\n\nWith this funding…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697656/secure-rural-schools-reauthorization-act-of-2025"}]