[{"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…Resolution Copper, blew up a 46,000- year-old sacred aboriginal site in Australia in 2020.\n\nNow, just upstream from Phoenix, Arizona, BHP and Rio Tinto are  pushing to destroy Oak Flat, a sacred site for multiple Apache Tribes  that is listed on the National Register of Historic Places, to build  the Resolution Copper mine. This is a mine that would create…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699693/critical-mineral-dominance-act"}, {"senator": "Lauren Underwood", "party": "Democrat", "sentence": "…this is a safety issue for these children, it is a public  health issue. Frankly, it is about dignity. These parents aren't asking  for luxury. They are asking for a clean, flat surface and some basic  respect.\n\nMr. Speaker, we all know diaper changes are not optional, which is  why safe baby-changing stations shouldn't be optional, either.\n\nThe Baby…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692156/baby-changing-on-board-act"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…enforcement? Give me a break.\n\nMr. Speaker, 5 years ago, the Labor Day fires killed nine people and  destroyed thousands of homes in Oregon. Central Oregon is currently  fighting the Flat fire. Thanks to the hard work of our fire crews, it  is now at 52 percent containment.\n\nMr. Speaker, now is not the time to make life harder on our  firefighters. This administration…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694775/fighting-fire-with-fire"}, {"senator": "Ami Bera", "party": "Democrat", "sentence": "…clock there, so he  got there and said: I will get you to the airport, Mr. Congressman.\n\nFor those in Sacramento County, he got me from Elk Grove to the  airport in 10 minutes flat. Maybe there was a little bit of speeding  there.\n\nI congratulate Anthony. I wish I was there with him for the awards  ceremony. It is a well-deserved award.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699299/anthony-uribe-recognized-as-young-professional-of-the-year"}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "…their access to food. This follows the big, ugly  bill, which all but three Republicans voted for, making it the largest  cut to food assistance in our Nation's history.\n\nBy flat-funding the vital Meals on Wheels program for seniors in the  Health and Human Services appropriations bill, Republicans are ignoring  the real increase in food costs that Americans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695067/condemning-benjamin-netanyahu"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…March of  Dimes provides all that stuff, too, but we don't provide them with TANF  funds.\n\nNo. This is a diversion from the already underfunded TANF program  which has been flat funded for 30 years at $16.5 billion and now we  have, according to the chairman, millions of women, 2 million, and  7,000 centers that are now going to be able to access TANF…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…programs for the Department of the Treasury, including the  community development financial institutions, so critical for small  communities and communities of little means, were flat funded in the  fiscal year 2025 enacted level, instead of being eliminated. While it  is not everything we would want, it is a vast improvement over what was  requested.\n\nEven…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699056/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…harder to get by, not by some  marginal amount. They are doubling, tripling, and quadrupling monthly  premiums.\n\nWhat is their defense? They are looking people in the eye and flat- out gaslighting them: Costs aren't up; costs are down.\n\nTrump says: ``I don't want to hear about the affordability.'' Well,  get used to hearing about it. You are going to…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696729/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…further. Just last week,  the U.S. Energy Information Association found that natural gas prices  will rise by 16 percent in 2026, primarily due to increased LNG exports  amid flat production growth.\n\nSecretary Chris Wright promised to double LNG exports to countries  like China within 5 years. The next bill that we are going to consider  is all about…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…Trump is escalating the situation and making it more dangerous  for everyone. Just today, he said the National Guard is preventing the  violence on the street, and that is a flat-out lie. The National Guard  is standing on the sidelines, watching as local law enforcement handles  the situation.\n\nNow, he is sending in the Marines. This is not the mission…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692322/denouncing-ice-raids-in-southern-california"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…is my question:\n\nIs this really a bailout for the financiers on Wall Street who bought  this debt at 20 cents on the dollar but may get paid $1 on the dollar  or is this just flat-out enrichment? They didn't lose. They are winning  as other people suffer. So is this really a bailout or just a flat-out  ``Hey, fellas. Here is $40 billion. I love you, Donald…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696342/trump-administration"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…benefits, officials and advocates       say.                              `creating a fire'\n\nWith aging technology systems and a $15 billion budget that       has stayed relatively flat over a decade, Social Security was       already struggling to serve the public amid an explosion of       retiring baby boomers. The staff that reviews claims for two…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…special messages, GAO has reviewed updated apportionment  data to ensure [OMB's] instructions were consistent with the special  message.'' But for these rescissions proposals, OMB flat out refused  ``to provide GAO with updated apportionment data that would permit GAO  to conduct the same analysis for the President's special message of  June 3, 2025.''\n\nThis…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694158/senate-amendment-to-hr-4"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…kill them. This is the logic used by  dictators and despots to disappear and kill dissenters and political  opponents. A President who acts as judge, jury, and executioner is flat  out un-American. If we allow such conduct, then we are no better than  the terrorists and criminals we claim to fight.\n\nAdditionally, earlier this year the President approved…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…that if you listened to the White House. You  wouldn't know that if you listened to the Department of Energy or the  EPA because they are just lying about it. They are just flat-out lying  about the role that wind and solar can play in our system because they  are over here just doing the bidding of the natural gas and the coal  industry. That is who…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696132/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…Some expenses surprised       her, and she was suddenly out of money for the month. She was       okay, as she had groceries, gas, and her bills paid, until       she got a flat tire on the way to a school function. She got       the car to the tire shop.\n\nMr. BARR. Mr. Speaker, I will finish the story.\n\nThe tire was irreparable. She had to buy a new…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689846/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…within the film, the surface area of which is measured       by multiplying the length by the width of the side of the       package when the flexible packaging film is pressed flat       against the stack of wipes on all sides of the stack.\n\n(8) State.--The term ``State'' means each State of the       United States, the District of Columbia, and each…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692751/wastewater-infrastructure-pollution-prevention-and-environmental-safety-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…we have  really actually stable and much broader economic growth than we  expected. We are actually seeing some odd things.\n\nActually, the labor force participation is pretty flat. We had a  small tick up in some of the last unemployment data. Also, if you look  at this chart here, we are trying to explain the difference. Here is  the number of folks…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…includes the FY 2026  Agriculture, Rural Development, Food and Drug Administration, and  Related Agencies Appropriations Act.\n\nRepublicans have effectively locked in disciplined, flat spending  levels while supporting the Trump administration's policy priorities.\n\nThe Agriculture bill provides $26.65 billion in discretionary  spending, which is level with…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696739/continuing-appropriations-and-extensions-act-2026"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…historic reforms take important first steps to hold PBMs  accountable by delinking PBM compensation from the price of the drug.  This legislation replaces hidden incentives with a flat-fee model.\n\nBy requiring full transparency into how PBMs operate, this will give  employers and everyday Americans visibility into hidden costs and  rebates before they purchase…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700129/opening-of-kongsberg-defense-expansion"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…years removed from COVID, and my Democrat colleagues are  trying to say that if we don't extend those subsidies that somehow we  are denying people healthcare. That is just flat false. It is a lie.\n\nThe fact is, ObamaCare remains in place. Its subsidy structure  remains in place for better or worse, and those subsidies that they are  talking about would…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…to advance President Trump's America First agenda and deliver  upon the American people's mandate from November.\n\nWe have certainly heard our fair share of fear-mongering and flat-out  falsehoods from Democrats and their bedfellows in the mainstream media  about what our budget resolution entails. Let me be clear: This  resolution unlocks the path forward…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…more data, and the next month you get  more returns, and you can finally calculate.\n\nIn the JOLTS data, there is a fascinating number to look at. The  number of jobs was fairly flat, but unemployment looks like, our best  model, it is going to stay steady because we are finding we don't have  as many workers looking for jobs. It is really worth taking a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…to send a bill over here to fund government  through the end of January with three appropriations bills, which we  worked through regular order, to keep spending relatively flat. It  advances the priorities the American people sent us here to advance, to  back up the President who is securing the border, which he was sent to  Washington to do; to restore…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696681/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…with President  Trump, to reflect our well-established goal to return to pre-COVID  spending.\n\nLet's look at more. This Congress, working with the President, has  held spending flat for the last 2 years, and now it is flat through  January. If we honor our commitments, it will be flat through next  September. By holding government spending flat and growing…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…on both sides of the aisle who are actually doing the work line  by line and in the open.\n\nThis package cuts nearly $9 billion compared to last year. Financial  Services is flat-funded. National Security and State are cut by a  whopping 16 percent. It is proof that we can fund priorities without  growing our government.\n\nWe rein in Washington by cutting…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699059/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…service that financial  institutions provide to help consumers avoid having purchases declined.  Instead of the transaction being denied, the bank or credit union  charges a flat fee to cover the check on behalf of that consumer. It  lets that purchase proceed. It lets that payment to a utility company  proceed. It lets that payment for an important…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…history is over. That is good news, and  it must continue.\n\nWell, what about us--the Americans?\n\nEuropean allies continue to grow their defense budgets, but ours have  stayed flat across successive administrations. We are the ones leaving  capacity unused and political will untapped. We are talking, but we are  not doing--talking but not doing.\n\nThe President…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Thune", "party": "Republican", "sentence": "…$1.3 trillion--$1.3 trillion for the taxpayers to  subsidize, in the individual marketplace, the 23 or 24 million  Americans who receive their coverage there.\n\nThat is just flat staggering. Look at that. So we are looking at  2024, 2025 now--$150 billion a year over a 10-year period. As I said,  it ends up being scored by the CBO as $1.3 trillion.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…accounting for the other things. What are those other things?  This budget, the House budget, assumes that we are able to figure out  how to hold what we call discretionary spending flat.\n\nI don't know if the Speaker, who is the only other person in the  Chamber with me, believes that we will hold discretionary spending  flat, but history would say we wouldn't.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}]