[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…the fiscal year  2026 Military Construction, Veterans Affairs, and Related Agencies  Appropriations Act. Unfortunately, I must ask my colleagues to oppose  this fundamentally flawed legislation as well. This is not a position I  take lightly, and I lament that we have gotten to this point.\n\nAs ranking member of the House Committee on Veterans' Affairs,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692950/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "Mrs. TORRES of California. Mr. Speaker, I rise in strong opposition  of this deeply flawed bill because the American people deserve better.\n\nSince Trump returned to office, Republicans have created an  affordability nightmare, a mass transfer of hard-earned taxpayer…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696740/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Justice  statistics show that Black kids are twice as likely to be incarcerated  compared to White kids, despite committing crimes at the same rate.\n\nThis Republican bill is flawed. By treating children as adults, Mr.  Speaker, you deny them protections from abuse from adults in prison,  including bullying, physical violence, sexual assault, and rape.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695594/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…had been heralded as a hero for his role in ending  the war in the Pacific had his security clearance revoked, and it  effectively ended his brilliant scientific career.\n\nThe flawed AEC decision remained in effect for 68 years until my  predecessor, Senator Patrick Leahy, along with 42 of his Senate  colleagues--Democrats and Republicans--petitioned then-Secretary…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…those concerns  are heard.\n\nFERC Commissioners in recent years have not been shy about using  their powers to publicly highlight and comment on Federal actions that  they deem flawed or insufficient. Agencies can, and do, respond to that  feedback, as we saw with the EPA during the previous administration.\n\nWhat no agency has the power to do now is to arbitrarily…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…the Biden record of  decision today, it would create legal and regulatory chaos, not  clarity.\n\nThat is because it would revive the Trump era leasing plan that is  legally flawed and under active litigation, effectively leaving no  valid framework for how leasing could proceed. Just a way of saying, my  guess is, it would have more lawsuits that would…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697560/hj-res-131"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…training is needed. You can just imply that if you want a raise or  promotion, it would be nice to get the training. That is not really  required. The legislation is based on the flawed premise that if you  provide workers with certain opportunities or benefits, employers must  be able to pay them less. That doesn't make sense.\n\nWe should not let employers…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698955/flexibility-for-workers-education-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…and hoping the bill passes.\n\nWe may draw the conclusion that this amendment was made in order so  that the Republican majority could say they have an open process on  this flawed bill and avoid yet another criticism of all of their closed  rules.\n\nWith respect to the substance of the amendment, I am concerned that  it needlessly pits two things that…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…now the Israeli Government's obligation to  hold accountable the soldiers who beat him and the jailers who  mistreated him.\n\nIsraeli authorities have defended this inherently flawed and  discriminatory system as a necessary response to an ongoing state of  hostilities. There are at least three problems with that argument:\n\nFirst, these are children. Children…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697313/palestine"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Bedford to  the FAA, later this evening, Senate Republicans will vote to advance  Donald Trump's nominee to lead the FAA, Bryan Bedford.\n\nTo say that Mr. Bedford is a deeply flawed nominee would be putting  it mildly. Throughout his career as an airline executive and during his  hearing, Mr. Bedford has shown a callous disregard for the 1,500-hour  rule…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693275/nomination-of-bryan-bedford"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…Donald Trump's trade war that is pummeling the  stock market, and nothing to protect Americans' retirements. Instead,  this is a messaging bill, sloppily written and dangerously flawed,  designed to create confusion and chaos in our electoral system rather  than strengthen it.\n\nThe SAVE Act claims to prevent noncitizens from voting in Federal  elections.…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689394/gop-creating-chaos-in-electoral-system"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Senate sends  us. Instead, we are simply taking the language directly from the Senate  with no amendments, even when the chairman and other House Members know  that this bill is flawed.\n\nUnfortunately, because President Trump demanded the bill be passed  without any changes, that is what the Republican Congress will do.\n\nOne of Chairman Hill's changes to…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…at car dealerships offering to sell  pickup trucks for $1 to general purpose chatbots advising small  businesses to break the law.\n\nIn other words, a small business using a flawed AI model risks steep  reputational and legal harm. Many of these incidents are attributable  simply to AI's current technological immaturity and the growing pains  that come…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699205/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…going to stop talking about this because this document  which was enacted into law is a perfect encapsulation of the difference  between the political parties. My party is flawed--obviously, my party  is flawed--but I have never seen my party propose a bill that  transferred so much money from the poor to the rich, and I have never  seen my party propose…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Home Builders' estimate that building a  home to meet the 2021 International Energy Conservation Code standard  would add as much as $31,000 in costs to a new home.\n\nThis is flawed. It is intentionally misleading. Republicans are  trying to demonize energy codes that actually save Americans money and  deliver increased comfort, health, and climate benefits,…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700221/homeowner-energy-freedom-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Clerk read the title of the joint resolution.\n\nMr. Speaker, I rise today in strong support of this resolution to  overturn the Consumer Financial Protection Bureau's deeply flawed final  rule on larger participants in general-use digital payment  applications.\n\nIt sounds complicated, Mr. Speaker, but it is not. This is a midnight  rule created by the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689950/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…administration IRS notice  providing simplified guidance on applying the corporate alternative  minimum tax to partnerships. The corporate alternative minimum tax is a  fundamentally flawed, Democrat-enacted book minimum tax. Not one single  Republican voted for it.\n\nAs Republicans predicted, the book minimum tax has proven to be  highly complex and burdensome.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699912/9999"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…established.''\n\nIn addition, when Congress reduced the ObamaCare penalty to zero  during President Trump's first term, the Department of Justice refused  to defend the underlying flawed law. Clearly, the DOJ is fully  empowered to decline to defend statutory provisions that no longer rest  on a valid constitutional basis. It has exercised that authority before…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697383/restoring-second-amendment-rights"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…entire school  day. For some, school meals may be the only meals they receive that  day.\n\nThis notion that whole milk consumption is linked to childhood  obesity is deeply flawed. In fact, studies suggest that higher cow's  milk-fat intake is associated with a lower risk of childhood obesity.  While it is important to limit fatty, sugary, and highly…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698186/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Unfortunately, it is too late to bring  Sarah's life back, but her death should not be meaningless, relegated  to headlines with no action. It is not too late to look back on the  flawed decisions that allowed her killer to enter the United States in  order to correct these mistakes and to prevent future harm.\n\nFurthermore, this crime at the hands of an Afghan…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…bipartisan coalition in both  Chambers of Congress. This bill is about returning whole and reduced  fat milk to school cafeterias. It reflects updated science, addresses  years of flawed Federal policy, and responds to what parents, schools,  and health professionals across the country already know: Kids need  access to milk that they will actually drink.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692463/national-dairy-month"}, {"senator": "John Thune", "party": "Republican", "sentence": "…development expensing provision is already  helping South Dakota businesses innovate.\n\nThen there is the death tax relief. South Dakotans believe the death  tax is fundamentally flawed. It threatens too many family farms and  ranches and family businesses. Republicans agree. And so in the Working  Families Tax Cuts, Republicans permanently raised the death…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698212/senate-accomplishments"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "Mr. CLYDE. Mr. Chairman, in January, just days into the President's  first term, Judge Deborah Boardman issued  a nationwide injunction using deeply flawed legal grounds against the  administration's birthright citizenship order.\n\nMonths later, Judge James Boasberg attempted to halt the lawful  deportation of violent Tren de Aragua…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699053/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…Hazardous Air Pollutants, NESHAP, for  Rubber Tire Manufacturing.\n\nOn May 6, 2025, I voted in favor of this resolution of disapproval. I  did so because this rule is fundamentally flawed and does not reflect  the intent of section 112 of the Clean Air Act. For example, the EPA's  own risk review for the previous rubber tire NESHAP found that this new  rule…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692022/hj-res-61"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…California, which would undo the listing of  the longfin smelt in the San Francisco Bay-Delta Distinct Population  Segment under the Endangered Species Act.\n\nThe listing was based on flawed science in response to an ESA-related  lawsuit and adds yet another piece of regulatory red tape preventing  water from reaching California's Central Valley and communities…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690599/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…charters  would add significant ambiguity for both banks and their customers.\n\nThankfully, the current OCC under President Trump has recently  indicated they will abandon this flawed rule. However, without this  Congressional Review Act resolution, there is nothing to prevent a  future administration from reintroducing this damaging rule that would  prevent…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…President, I rise in support of the resolution that  Senator Cramer and I introduced to overturn the Bureau of Land  Management resource management plan for North Dakota.\n\nThis flawed plan, finalized during the closing days of the Biden  administration, undermines BLM's multiple-use mandate and restricts  access to vast, taxpayer-owned energy reserves in…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696141/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "Ms. SALAZAR. Mr. Speaker, I am here today because I oppose this  resolution. It is fundamentally flawed. It is trying to invoke the War  Powers Resolution of 1973, which doesn't even apply in the case of  Venezuela.\n\nThe War Powers Resolution applies when there is active combat…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698241/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…since its enactment in 1973, the ESA's track  record is abysmal. Fewer than 2 percent of listed species have been  delisted. That isn't a success story. That is proof of a flawed  perpetual regulatory machine that prioritizes special interest agendas  over sound science and our soldiers' needs.\n\nMr. BIGGS of Arizona. Madam Chair, let me reiterate: Activist…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695254/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…Importantly, the Council may not then vote on a proposed designation  unless this determination is made.\n\nLet me remind my colleagues that the SIFI designation process has  been flawed from the start. First, it targeted individual companies for  designation without any process or notice.\n\nSecond, it failed to evaluate whether designation would actually  mitigate…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699824/financial-stability-oversight-council-improvement-act-of-2025"}]