[{"senator": "Bill Cassidy", "party": "Republican", "sentence": "Mr. CASSIDY. Mr. President, this is a theme I have been speaking of  which affects States across the Nation, which is the National Flood  Insurance Program and the threat that it might lapse and the inability  of families to be able to afford.\n\nWhy are flood insurance premiums so high, you might ask? Flood  insurance…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688826/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…resilience. We were able to keep those  homes from flooding in the first place. This is the type of work that  we need to do. And if we do it, then never is a National Flood  Insurance Program claim filed.\n\nThe family saves; the taxpayer saves. Investing now saves money down  the line.\n\nThat is why back in 2018, during President Trump's first term,  Congress…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…first, it  worked. They go from $12,000 a year to $758, from $4,500 to $751. This  is an investment which would lower the cost of flood insurance, saving  the National Flood Insurance Program money; therefore, it is worthwhile  to raise your home.\n\nNow, however, under a new system called Risk Rating 2.0, it doesn't  matter. Here, they pay tens of thousands…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691629/risk-rating"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…I am tired of hearing people say there is no off-ramp or  way out of the shutdown. Here it is, the way forward: Open the  government.                       National Flood Insurance Program\n\nMr. President, I spoke on this floor a month ago about the  consequences of a government shutdown on our country and upon  Louisiana, particularly the half million…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}]