[{"senator": "Chris Murphy", "party": "Democrat", "sentence": "…what, the people should be in charge, not  corporations. That wasn't a partisan idea. It is now, unfortunately.\n\nI am grateful to Senator Kelly for bringing us down to the floor to  talk about the way our citizens feel like they don't have power, the  way that the Citizens United decision has left our voters feeling like  the game is rigged. But it is kind…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699117/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "Mr. BOOKER. Mr. President, I want to thank Senator Mark Kelly for  bringing people to the floor to talk about that which is,  unequivocally, the greatest threat to American democracy right now. It  is the cancer that is metastasizing more and more and more.\n\nSince the Citizens…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699090/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Act--as they began open  enrollment 1 month ago--started to see their health insurance premiums  spike.\n\nLast week, in honor of Prematurity Awareness Month, I stood on this  floor  to talk about how the Affordable Care Act expanded insurance to  millions of Americans, how Medicaid expansion expanded insurance to  millions of Americans, and how critically…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…country.\n\nIt is common, during the 13 years that I have been in the Senate, for  folks to talk about immigrants as a problem. It is very uncommon for  people to take this floor and talk about immigrants as a strength. And  based on my experience in 31 years now, coming on 32, in elected office  in Virginia, I believe immigrants are a strength and not a…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "Mr. KAINE. Mr. President, I rise at a late hour with few folks on the  floor to talk about the most serious issue we could ever talk about on  the floor of the U.S. Senate: the prospect that America may soon be in  a war.\n\nThere is no part of the Constitution…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…parts of  our lungs, where they do the most damage.\n\nAnd so I am grateful to be talking about the good neighbor rule. That  is actually the purpose of my coming to the floor, to talk about the  rule that applies to those powerplants and States that are supposed to  be good neighbors. And, according to this rule, they would be good  neighbors, but the…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689118/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…voices not being heard. That is the intent of what is going on here.  None of this is about election integrity or protecting the ballot box.\n\nWhen Republicans come to this floor to talk in front of the cameras,  they say it is about this, but it is blatantly lying to the American  people.\n\nOur job in Congress is to make it easy for people to participate…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699996/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…being sent  out of this country.\n\nMr. Speaker, I want to say that, over the last hour, the American  public has heard directly as Members of Congress came to this hallowed  floor to talk plainly about the grave constitutional crisis unfolding  in our country. We have heard the names Kilmar Abrego Garcia and Andry  Hernandez Romero. We have spoken of students…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…programs is that we have to use every single  opportunity--be in committee, be in the conversations we are having  with colleagues, and every moment we can get to the House floor and  talk about what is at stake in this precise moment.\n\nWe have to make sure that everyone hears we are doing everything we  can to protect these critical programs because many…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "Ms. ESCOBAR. Mr. Speaker, I thank Mr. Takano for yielding. I am so  grateful for his leadership and for bringing us together on the House  floor to talk about what is happening here in our country every day.\n\nAmericans are sounding the alarm about the crisis that our country is  in. It is not just an economic crisis, as…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690507/trump-immigration-policies"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Mr. MERKLEY. Mr. President, I come to the floor to talk about debt  and the challenge that confronts us.\n\nOver the last few decades, we have seen a lot of sources of red ink.  Among them are the war in Afghanistan, the war in…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the broken promises and the lies. Enough. I  talk to Republican colleagues all the time who privately confess to me  that this is a disaster, and then they come on the floor and talk to  the press and say everything is beautiful. That is just not reality.\n\nThis President and this administration are taking this country in the  wrong direction. We have…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…that tariffs will bring  manufacturing back. Like Rinehimer, he cast his ballot for Trump last  year.''\n\nMr. Speaker, with the short time left, I say that I came to the floor  to talk about the harm being caused by the Trump administration, the  corruption in crypto, and the harm to people just trying to live their  lives.\n\nTrump's regime is going after…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "Mr. WYDEN. Mr. President, I was on my way to the floor to talk about  clean energy policy this afternoon, but I have to join my colleagues in  addressing the shocking video out of Los Angeles. I have now looked at  it. If you are following…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692429/alex-padilla"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…this  country, but we are a nation of immigrants and should never forget it.\n\nMr. DURBIN. Mr. President, I want to thank Senator Mark Kelly for  bringing us together on the floor to talk about Citizens United.\n\nSenator Kelly has the honor of representing the State of Arizona.  When I was a Member of the House of Representatives, I served with a  Congressman…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…crisis, and we are incurring a  deficit of $2 trillion a year.\n\nThe most rapidly growing part of the Federal budget is Medicaid. You  will have people come to the floor and they will talk about Medicaid  cuts, but Mr. Speaker, only in Washington is a slight decrease in the  increase in a program called a cut or slashing because that is not the  way…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690364/united-states-has-trillion-in-federal-debt"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…recent op- ed in the New York Times just a few days ago. It kind of made a stir. A  lot of people thought it was a really good op-ed. I didn't.\n\nI wanted to come to the floor and talk about this op-ed because it is  making the rounds. It is by the columnist Thomas Freidman, and it is on  national security, economic security, and trade issues relating…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Mr. BARRASSO. Mr. President, I just heard the minority leader come to  the floor and talk about our Republican plan for healthcare, and he  called it ``insulting.''\n\nWhat is insulting is that the minority leader and the Democrats want  to send $83 billion of…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "French Hill", "party": "Republican", "sentence": "…about 60 percent of all the home  construction loans in our country.\n\nTherefore, that is why the ranking member and I, and our committee,  have chosen to come to this House floor to talk about some specific  housing measures. I want to make sure that the American people know  that we know that the supply of housing has to be financed. Some 60  percent of…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Mr. BARRASSO. But, Mr. President, I come to the floor today to talk  about a different topic, and that topic is coal--and, specifically,  Wyoming coal, which is world-class coal, clean coal, low-sulfur coal.\n\nThis is Wyoming coal. We…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689762/coal"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…President Trump will take the  podium, and he will have a joint address to Congress, and, clearly, to  the Nation.\n\nI just heard the minority leader of the Senate come to the floor and  talk about President Trump's promises. Well, let me talk about those  promises--promises made, promises kept by President Trump.\n\nHe has only been in the office now for 7 weeks,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688471/joint-session-of-congress"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "Mr. TILLIS. Mr. President, I appreciate the opportunity to come to  the floor and talk about a couple of things.\n\nEarlier today, we had a classified briefing on the situation in  Venezuela. I have to say that I am very impressed and thankful for the  expertise,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}]