[{"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…where students can thrive. From before the first bell  rings until long after the last student leaves, custodians work to  create an environment where learning and growth can flourish.\n\nMr. Speaker, it is my honor to recognize the custodians in our  schools throughout the Commonwealth of Massachusetts, and the entire  United States. I ask that my colleagues…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697118/recognizing-national-custodian-appreciation-day"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…starting their lives, gunned down seemingly  because they were Jewish.\n\nLet this be a call to all of us: We must never allow the malicious  poison of anti-Semitism to fester and flourish. While we still must  learn more about this tragic incident, we do know that when anti- Semitism is rife in the air, all kinds of individuals cling to it and,  sometimes,…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691653/capital-jewish-museum-shooting"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…northwest Ohio to the world-class Toledo Museum of Art.\n\nThe American Numismatic Society has chosen Toledo, located on  beautiful Lake Erie, as the place where its future can flourish. We are  so grateful that the society saw what we know so well: a community that  opens its doors wide to history and also a world-class museum that  inspires.\n\nMr. Speaker,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…grid.\n\nWhat happens when there is not enough of something? The people  selling that thing raise the price. And that is exactly what is  happening.\n\nThat is not a rhetorical flourish. Like, they have overnight prices.  They have people whose job it is to find how we are going to meet  everybody's needs, so when you flick that switch, everything just  works.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699020/energy-costs"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…End Child Poverty Act would provide a universal  child benefit of $458 per child per month. It would bring us closer to  a nation where all children have the opportunity to flourish, not just  grow. This plan will make it easy for our families to afford the  basics. I hear it from them: Formula, diapers, and childcare are all  out of control. It will…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697023/economic-dignity-for-all"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…home State. The implementation of IDEA and outcomes for students  with disabilities vary dramatically across State lines. Now Natalie is  receiving the support she needs to flourish. Her school has set up an  individual education plan with goals for her academic achievement,  occupational therapy, communication, and motor skills. Her home school  district…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697522/50th-anniversary-of-individuals-with-disabilities-education-act"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…from  the entire strategy. It is well known that global corruption fuels  instability, weakens governments, and its absence is extremely  dangerous and allows bad actors to flourish.\n\nThe national security strategy abandons our allies, our principles,  and the values that have guided American leadership for decades.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697955/national-insecurity-strategy"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…I stand with Pranoy. I stand with  the  disability community, and I will stand against any attempt to rip away  Medicaid from children who deserve the same opportunity to flourish as  any other American, to live out their potential and flourish.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691367/i-stand-with-the-disability-community"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…these resources to ensure that they  were included in last year's WRDA. These programs allow communities in  my district to have access to the infrastructure they need to flourish.\n\nHere is how: Under the Summit County new authority, $25 million would  have been authorized to fund projects such as Akron's water main and  lead service line replacement…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694842/massive-cuts-to-energy-and-water-infrastructure"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…care and social       services on behalf of the church, we firmly believe that all       people have the right to those necessities needed to live,       found a family and flourish. As you address reconciliation       priorities, we urge you to prioritize those most in need and       working families and protect the Medicaid program.\n\nWe are hearing…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689540/h-con-res-14"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…energy costs and grocery  costs at the grocery store.\n\nThis budget will usher in a new golden era that the American people  are yearning for and where free enterprise can flourish, energy  production is unleashed, and our fiscal health is restored.\n\nThis budget does so by extending the Tax Cuts and Jobs Act, which  delivered wage increases of 4.9 percent…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688066/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…Recognizing that company sizes and market dynamics constantly evolve,  my bill requires the SEC to update its definition of ``small entity''  every 5 years.\n\nFor our economy to flourish, Congress and regulators must ensure that  all policies consider their impact on America's millions of small  businesses.\n\nMr. Speaker, by creating a more focused regulatory…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693958/small-entity-update-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…has animated our corps from generation to       generation and has been the distinguishing mark of the       marines in every age. So long as that spirit continues to       flourish marines will be found equal to every emergency in       the future as they have been in the past, and the men of our       Nation will regard us as worthy successors to the…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696624/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…roots that will support growth  for generations. May his retirement be full of relaxation, quality time  with family and the satisfaction of watching all he built continue to  flourish.", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696636/recognizing-the-retirement-of-steve-kennedy"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…message I heard from all of these impressive Texas entrepreneurs,  job creators, and pillars of the community was simple: The Trump tax  cuts helped their businesses grow and flourish, providing benefits not  only to themselves and their families but to their employees and their  broader communities.\n\nStories I heard from my fellow Texans like Andy, Luis,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…H.R. 1949, led by my friend Representative August Pfluger from Texas,  fixes this. It lifts restrictions on the import and export of natural  gas and allows American LNG to flourish once again.\n\nMr. Speaker, America should never ever voluntarily surrender its  energy advantages, not when our production strengthens families, their  paychecks, and communities,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697084/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…restore commonsense  energy solutions to put America first.\n\nIn just the last 2 months, we have seen what happens when government  gets out of the way. Energy prices drop, jobs flourish, and we become a  net energy exporter.\n\nMr. Speaker, that is the kind of future we should be fighting for,  not where Washington bureaucrats make it harder for American businesses…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688631/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…help make America the crypto  capital of the world. These bills provide simplified rules of the road  for the crypto industry, which so desperately needs these provisions to  flourish. Specifically, they create federal standards for stablecoins,  provide clear definitions for different digital assets, and prohibit  the Federal Reserve from issuing its central…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693546/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…doing so, the Foundation exemplifies the best of our national  values: tolerance, opportunity, service. and hope. Its enduring  commitment reaffirms that freedom and democracy flourish when  individuals are empowered, informed, and engaged in their communities.\n\nFor fifty years, the Philip Jaisohn Memorial Foundation has honored  those ideals through its…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696635/recognizing-the-50th-anniversary-of-the-philip-jaisohn-memorial-foundation"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…healthy community, and it is an important staple of  American life.\n\nMr. Speaker, I commend our community service organizations for  everything they do to help our communities flourish.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695366/recognizing-celebrate-community-week"}]