[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…is only the most visible and tangible evidence of a  corrupt administration--and, particularly, the crypto corruption, where  hundreds of millions of dollars are literally flowing into the bank  accounts and pockets of President Trump and his family. And everyday  Americans are suffering losses because of it.\n\nThe investors in his meme coin--tens of…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691071/9999"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…world- class education, but a vision without funding is a hallucination. If  the Federal funding and protections backstopping education for students  with disabilities stop flowing, as insufficient as they may be right  now, we will see a nationwide regression. We cannot let that happen to  Natalie or to any child in our country. They deserve our Nation's…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697522/50th-anniversary-of-individuals-with-disabilities-education-act"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…Federal Energy Regulatory Commission in order to continue operating  a facility. Hydropower dams in my district are critical to keeping the  lights on and keeping the power flowing, and several, including the  Rock Island Dam at Chelan County PUD, are due for relicensing at the  end of 2028.\n\nThe relicensing process is typically very lengthy, in part…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693476/hydropower-licensing-transparency-act"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…target and control, they don't  surrender power, they expand it.\n\nLike the military-industrial complex, they find new enemies and new  missions, new excuses to keep the money flowing and the machinery of  fear alive.\n\nThat is why we will not look away. This is bigger than one community  and bigger than one city. It is about the kind of country we are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695742/ice-and-dhs-lost-credibility"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…free. It is  inexpensive because solar is free. Once you  have built the infrastructure to capture the solar rays, once you have  built the infrastructure to capture the wind flowing by, God made those  resources free.\n\nFor a fossil fuel plant, you still have to build it, but once you  have built it, you have to bring in the fossil fuel, pipe in the fossil…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…permanently lost the argument. Clean energy is cheap energy.  Everyone knows it, even Republicans now.\n\nIn their desperation to keep Americans' energy bills high to keep the  profits flowing for oil and gas, Republicans have started peddling the  falsehood that clean energy isn't reliable. I want to be clear: There  is no such thing as a perfectly reliable power…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…answers, and put  pressure on them to act.\n\nThey finally listened. Let's be clear: This didn't happen on its own.  It happened because we put pressure on them.\n\nNow the money is flowing, and I hope it is the entire $7 billion that  goes to our schools throughout the country. Let's make sure that we  know where it first happened. It happened when the flood…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693899/denouncing-cuts-to-k-12-schools"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…taken away from me when I am less than 2 years from retirement.\n\n``Who is going to run the government? You know, provide services that  keep the planes in the sky, the power flowing, the food safe, and warn  of pending major life-threatening events, events like hurricanes and  infectious diseases? Who will want to work for the American people  after this…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691729/federal-employees"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…alongside the       railroad, agriculture, and industry--serving as a vital link       in both Ohio's past and its future; and\n\nWhereas, its 406.8 square miles of rich farmland, flowing       rivers, and vibrant towns have been home to generations of       Ohioans committed to hard work, community, and service; and\n\nWhereas, for 175 years, Fulton County has…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693801/proclamation-for-fulton-countys-demisemiseptcentennial"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…fees aren't actually paid by  the investor.\n\nThis has led many funds to avoid BDCs altogether, and it has kept  BDCs out of key investment indexes. That means fewer dollars flowing to  small businesses on Main Street.\n\nH.R. 2225 fixes this. It allows funds to exclude expenses related to  BDCs from their AFFE calculation, while still disclosing their…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692712/access-to-small-business-investor-capital-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Sesame Street, $500,000 for electric buses in Rwanda,  and millions more for climate projects in Southeast Asia and Latin  America, as well as taxpayer dollars that have been flowing to radical  gender ideology programs around the world. That is not the role of the  Federal Government, and that is not an appropriate use of taxpayer  dollars of American…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692312/recognizing-new-freedom-farm-and-lois-mcgill"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…a survivor's spared life,\n\nA wondrous cloth, never abandoned nor lost,\n\nHe managed to safeguard on the run\n\nTwice from Poland, in Siberian exile and Kazakhstan,\n\nStained by flowing tears,\n\nThe beauty marks of refugees,\n\nAn added layer of essential warmth\n\nWhich sustained a ravaged body and tested soul,\n\nWrapping me, his other saved possession,\n\nIn a…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699495/recognizing-remarks-of-rabbi-dr-israel-zoberman"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…be immeasurable.\n\nTo Lisa, Jim, and their son, Patrick, please know that your  colleagues on this House floor on both sides of the aisle are in pain  with you. Our tears are flowing with yours, and your congressional  family stands with you in prayer and support.\n\nNow, standing in Jim's place, I will turn to the business before us.\n\nRepresentative Roy…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…obligation to reopen the Federal Government to make sure that  law enforcement officers were getting paid, air traffic controllers  were getting paid, and SNAP benefits were flowing once again, so we  voted for it. Today is the opportunity to clean up this provision.\n\nThere are far better ways to address the abuses of the Biden  administration, and those…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696929/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…precisely what  he has done.\n\nIf you want to go through some of these, let's start at the southern  border.\n\nUnder President Biden, criminals, terrorists, and traffickers were  flowing across that border, but because President Trump on day one took  Executive action to secure that border, illegal crossings are at their  lowest level in decades. This is something…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…anything. They didn't stand up for the American people. They were  silent.\n\nWhere were our good friends with the 15 to 20 million illegals coming  into this country, with the drugs flowing in, with the children that  were trafficked? Where were they? They were quiet. They didn't say a  thing. Mr. Speaker, it is anti-American.\n\nThis package is not about tightening…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692389/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Federal Government in a single year.  Meanwhile their top executives are paid over $600,000 annually, and the  group spends more than $700,000 on lobbyists all to keep the money  flowing.\n\nContrast that with the conditions our military servicemembers faced  during the same time: moldy barracks, sewage overflows, and rodent  infestations to highlight a few.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690710/outrageous-government-funded-incentives"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…don't play by  our rules. They are not afraid to cheat or steal our technology if it  is possible.\n\nOn the other side of the coin, U.S. investments from the United  States are flowing into China and have for a long time. A 2021 estimate  was that the market value of U.S. investments in China was valued at  more than $1 trillion.\n\nNow, the reason why that…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688824/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…his remarks.\n\nMr. Speaker, you have heard today from our colleagues and myself  about the outrageous government-funded incentives and plans to keep  illegal aliens not only flowing into this country but also to stay in  this country. This scheme goes beyond waste. It represents, candidly, a  betrayal of the American people and the American taxpayers,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…is not about 301, unfair trade  practices, although there are plenty of grievances against our northern  neighbor in that regard. This isn't about USMCA. The USMCA products  flowing from Canada to the United States are exempt. Eighty-five  percent of the products, we are not talking about that. It is not about  232.\n\nThis is about one particular authority…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699974/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…China.\n\nThis resolution is not about politics. It is about putting working  families before bureaucrats. It is about keeping the lights on in  America and keeping paychecks flowing in Montana.\n\nWhen the Federal Government acts recklessly, it is the responsibility  of Congress to step in and course correct. That is exactly what H.J.  Res. 104 does.\n\nThe…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694891/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…threat to the security of our Nation.\n\nYes, I think we should investigate that. Yes, I think we should get  to the bottom of that. Yes, I want to know how those dollars are  flowing. Yes, I want to know why the people of San Antonio have to be  turned upside down or the people of Charlotte, North Carolina, have to  be turned upside down because a radical…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…priorities we should all share.\n\nLet's pass the WIPPES Act. Let's give our local public works  departments, utilities, and consumers the tools they need to keep our  systems flowing and our communities safe.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692752/wastewater-infrastructure-pollution-prevention-and-environmental-safety-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…in the  banking day without a stigma. These are challenges. They were  challenges before the financial crisis, but it continues today.\n\nThis bill allows banks to keep credit flowing through the economy  while reducing risks that a panic-induced bank run would lead to  unnecessary bank failures.\n\nThe discount window has been underused and burdened by operational…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699861/bringing-the-discount-window-into-the-21st-century-act"}]