[{"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…Barrera.  Nearly three centuries later, we continue to celebrate the enduring  spirit, culture, and resilience that define our community.\n\nThroughout its history, Laredo has flown under seven different flags:  Spain, France, Mexico, the short-lived Republic of the Rio Grande, the  Republic of Texas, the Confederate States of America, and ultimately,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691267/recognizing-the-270th-birthday-of-laredo-texas"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…boats? If so, why would there be 10,000 American servicemembers in the  vicinity? Why fly three B-52s from the United States to the region? Why  have B-1 supersonic bombers flown off the coast of Venezuela in just  the last few weeks for a so-called ``bomber attack demonstration''?\n\nThat is not my definition of the mission. That is what the Pentagon…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696564/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…about the so-called worst of the worst. These are people  that are active, contributing members of our community. These are legal  residents who hold green cards who are being flown to Texas with no  legal representation, no access to counsel.\n\nAnd you know what happens sometimes? They get down there; they go  through another screening; and the Federal…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…is 1 of 10 Iranian Christians, including 3 children, who are  detained in Panama. These people sought safety and refuge in the United  States. Instead, they were rounded up, flown thousands of miles away,  and imprisoned in detention camps in brutal conditions. They are afraid  for their lives as they wait to be sent back to their home countries to…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688337/migrants-fleeing-religious-persecution"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…improperly, and yet he is being made the villain. He is  not the villain. He is the hero in this process, and he ought to be  acknowledged as such.\n\nI am going to have a flag flown over the Capitol of the United States  of America in honor of Mr. Goldberg for what he has done. I will not  allow his reputation to be tarnished without a fight to protect…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…and mobilize  within our communities, and these organizations deserve an expression  of appreciation.\n\nI believe that organizations that go to this length should have a  flag flown over the United States Capitol to honor what they have done,  Mr. Speaker. I have in my hand such a flag. This is the flag that was  presented to me upon my arrival in Congress…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692296/and-still-i-rise-denouncing-the-presidents-authoritar-ianism-and-recognizing-the-impeachment-warriors"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…gesture.\n\nTo take a $400 million airplane from Qatar as the plane of the United  States of America's President is cheap, demeaning, and harmful to our  country that has always flown high as the finest nation on this Earth.  It is also graft and corruption.\n\nMr. Speaker, the emperor wears no clothes.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691019/nice-graft"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…small but respectful change to federal law by adding the Mayor of the  District of Columbia to the list of named principals for whom the  President shall order the U.S. flag be flown at half-staff. Current law  states that the President shall make this order ``upon the death of  principal figures of the United States Government and the Governor of a  State,…", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692567/introduction-of-a-bill-to-permit-the-flag-of-the-united-states-to-be-flown-at-half-staff-in-the-event-of-the-death-of-a-mayor-of-the-district-of-columbia"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…have also dared to  have the courage to say out loud that they are transgender. These are  qualified, trained, and decorated servicemembers. They have deployed  into combat, flown missions overseas, and led troops through danger.\n\nNow, this administration is telling them that despite their  qualifications and their exemplary quality of service that they…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693974/transgender-americans-serve-with-honor"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…United States but Air Force One. And why does this  matter? Air Force One is not just a random luxury airplane. It is a  symbol of and a projection of American power. It has flown 15 different  Presidents. It carried President John F. Kennedy's body after his  assassination and saw President Johnson be sworn in under unprecedented  circumstances. It…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690968/qatar"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…much time is  remaining.\n\nMr. TAKANO. Mr. Chair, let me just say that I don't understand why-- to acknowledge and to allow a flag to be displayed in a workstation or  to be flown during Pride month in certain areas--the other side  believes that LGBTQ+ people are such a threat to recognize their  service in the military.\n\nWe are a country of inclusion.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695261/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Bill Hagerty", "party": "Republican", "sentence": "…necessity.\n\nIf the President had been forced to act in accordance with this  resolution last week, the element of surprise would have been entirely  lost, and the successful mission flown by our brave airmen would have  been much different and, likely, much costlier.\n\nOf course, Congress must be consulted. Of course, we can debate the  scope and strategy of…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693130/motion-to-discharge-sj-res-59"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Kaktovik, Nuiqsut, Point Hope, Point Lay, Utqiagvik, and       Wainwright. None of our communities are connected by a       permanent road system; all supplies must be flown or barged       in, making the cost of living extremely high and economic       opportunities generally low.\n\nOver fifty years ago, the Federal Government directed       Alaska…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Because of the One Big Beautiful Bill Act, we  have the freedom to make more summer family memories without breaking  the bank.\n\nIt is not just about driving, either. If you have flown lately, you  have probably experienced the delays, cancelations, and chaos plaguing  America's airlines and our airports.\n\nPresident Trump's big, beautiful bill tackles this…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692964/taking-a-step-toward-true-energy-dominance"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…all, shared with us the importance of having both Air Force  and Navy sixth-generation fighters: Admiral Paparo, commander of the  INDOPACOM, a man for whom I have worked for, flown with, and highly  admire; General Allvin, chief of staff of the Air Force; Admiral Kilby,  the Acting CNO; and General Caine, our Chairman of the Joint Chiefs.\n\nThese experienced…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693649/department-of-defense-appropriations-act-2026"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "…consume.\n\nMr. Chair, this amendment, which passed in the House NDAA last year,  would ensure that base commanders follow Federal law by ensuring that  only approved flags are flown on military installations.\n\nPatriotic Americans understand that the American flag is to be  revered.\n\nAnybody who has served understands the sacrifice that has been made  to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695264/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…casework requests. Her  unmatched availability and commitment have directly improved customer  experience for countless constituents.\n\nI have requested the United States flag to be flown over our Nation's  Capitol in recognition of Mrs. Maddalena's extraordinary achievements  and contributions. I thank her for all she has done.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695488/recognizing-the-contributions-of-trellis-maddalena"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…NASA Armstrong Flight Research Center was the location  where many of the technologies for Project Apollo were tested,  including where the lunar landing research vehicle was flown in the  1960s in preparation for the historic American Moon landing.\n\nWith a deep, embedded history in the aerospace industry, my region  continues to defy odds, make historic…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687922/space-dominance"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…us this is really just a drug bust. We had to bomb the entire  capital. We had to remove all their air defenses. We have an armada of  20,000 ships and hundreds of airplanes flown from all over the world,  but it really was just a drug arrest; it really isn't a war.\n\nBut this young man came in to us, and he explained to us that we  probably don't know…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699091/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…prisoner of war, Capt. Carey served in  key leadership positions in the Navy and became a passionate  motivational speaker and author.\n\nI have requested the United States flag be flown over our Nation's  Capitol to commemorate and honor our Vietnam Veterans to ensure their  heroism and sacrifices will never be forgotten.", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688919/recognizing-the-service-of-our-vietnam-veterans"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…restoration process and will join a B-17  Flying Fortress to become the newest centerpiece of the museum.\n\nThese two machines represent the complete collection of the aircraft  flown by the Mighty Eighth throughout the Second World War in both the  European and Pacific theaters.\n\nMr. Speaker, I thank the Barksdale Air Force Base for reallocation  and preservation…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693104/recognizing-the-national-museum-of-the-mighty-eighth-air-force"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Launch  Alliance's Vulcan rocket in the first certification mission.\n\nThe GEM 63XL boosters are the longest monolithic, single-cast solid  rocket boosters ever manufactured and flown. The boosters delivered  more than 900,000 pounds of thrust, nearly two-thirds of the vehicle's  total thrust at liftoff.\n\nIt is not just about technology. It is about what…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687925/space-dominance"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…the MAPS Generation II, a next-generation system  that allows vehicle crews to operate in GPS-denied environments,  preserving our battlefield advantage.\n\nAs someone who has flown combat operations in environments where GPS  denial can be a critical disablizer to our U.S. forces, this allows us  to not only fight forward but to make sure that we can…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693653/department-of-defense-appropriations-act-2026"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…an area the size of Minnesota,  wholly above the Arctic Circle, with none of the communities connected  by a permanent road system, necessitating all supplies needing to be  flown or barged in. Like much of rural Alaska, it has some of the  highest costs of living anywhere in the Nation.\n\nThe discovery of Prudhoe Bay in 1968 could not have come at a…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…of Soto Cono Air Base, Honduras. I'm pleased to  honor Capt. Hammond for his continued excellence in proudly serving our  country.\n\nI have requested the United States flag be flown over our Nation's  Capitol in recognition of Capt. Hammond's extensive contributions to  our nation. Congratulations to Capt. Hammond, and I wish him the very  best.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690077/recognizing-the-military-service-of-nathan-l-hammond"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Kaktovik, Nuiqsut, Point Hope, Point Lay, Utqiagvik, and       Wainwright. None of our communities are connected by a       permanent road system; all supplies must be flown or barged       in, making the cost of living extremely high and economic       opportunities generally low.\n\nOver fifty years ago, the Federal Government directed       Alaska…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}]