[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…threat once again.\n\nIn 2017, the Obama administration applied for a mineral withdrawal of  the Rainy River Watershed--the watershed is up here--which is the  headwaters that flows into the Boundary Waters Wilderness and Voyageurs  National Park. It started a 2-year environmental study, which included  extensive public input and scientific review.\n\nWhile…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…by other  financial institutions. BDCs are often the first institutional  investors to step in. Despite this success, a 2006 SEC rule has  inadvertently discouraged capital flows into BDCs, constraining their  ability to serve small businesses. The rule--part of the SEC's Acquired  Fund Fees and Expenses (AFFE) disclosure framework--requires mutual…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697831/increasing-investor-opportunities-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…across the aisle. It has been suggested that all of  this water is wasted out to the ocean for fish, and you have to explain  again how the delta system works. That water that flows out to the  ocean, almost all of it, the vast majority of it, is for one reason: to  make sure that the saltwater in the Pacific Ocean does not intrude far  enough into the…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…access to  critical water infrastructure, and promote efficient regional water  supply management while protecting the wilderness area.\n\nIt would also support higher in-stream flows for Cross Creek, reduce  energy consumption, and foster long-term economic benefits for Eagle  County. This is a priority for this community, and I thank  Representative Neguse…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693455/bolts-ditch-act"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…and with Chairman Turner and now with Chairman Crawford, we  have fought for that decade to keep the Permanent Select Committee on  Intelligence immunized from the sewage that flows through this Chamber,  the partisan attacks, the hideousness. By and large, we have been  pretty successful, with one exception, when that committee got involved  in the political…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696894/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…generated more than $236 billion in income in 2022 and paid  nearly $66 billion in local, State, and Federal taxes.\n\nThe Congressional Budget Office estimates that immigration flows to  the United States that are projected currently will likely increase  American gross domestic product by nearly $9 trillion between now and  2034, if we don't screw it up.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…since 2005, and the UAE doesn't want to abandon  Sudan's wartime gold trade. According to mining industry sources and  research by Swissaid, nearly all of Sudan's gold trade flows through  the UAE.\n\nThe United States needs to stand up and say enough is enough.\n\nFor people who say ``Well, what difference does it make? That is  Africa. That is a long way…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690103/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…wouldn't have been good for our business because different  investors have different time horizons. You have got short-term  investors who are concerned about next year's cash flows, but then you  can have long-term investors, like pension funds, endowments, and  family offices, who are going to be concerned about longer term risks  including, but not…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699153/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…is because this bill opens the door to mutual fund investments in BDCs.\n\nDespite the success of BDCs, in 2006, the SEC adopted a rule that  inadvertently discouraged capital flows into BDCs, constraining their  ability to serve small business. The rule is part of SEC's Acquired  Fund Fees and Expenses framework. AFFE requires mutual funds and other…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692711/access-to-small-business-investor-capital-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…nation  in which the Founders--and many of you spoke so eloquently to this--a  nation in which the Founders said: We do not want to have a King. We  want to have government that flows up from the people, not down from a  monarch.\n\nSo they put together their best ideas. They wrestled with it at the  Constitutional Convention. They went through many versions…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…is a trust issue.  People don't just feel broke. They feel shut out.\n\nUnder President Trump, influence isn't just whispered behind closed  doors; it is put up for sale. Money flows in and policy flows out. That  is not normal. That is not acceptable. In this administration, access  is bought instead of earned. If you are a billionaire or a special  interest,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699585/stop-the-republican-affordability-crisis"}, {"senator": "Jake Auchincloss", "party": "Democrat", "sentence": "…quilt of borrowed time,      With midnight shifts and morning prayers,      Hands that hold when budgets say let go.      Here, in this web of grace we weave,      Because what flows through us is stronger      Than their ledgers and our stubborn refusal      To let spreadsheets tell us what a life is worth.\n\nAgain, this comes from Betsy Johnson, an autism…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690834/advocating-against-medicaid-cuts"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…it is very much within the  watershed of the Boundary Waters Canoe Area Wilderness. In fact, it is  right on the edge. It is just a couple of miles upstream on a river  that flows right into this area. Let's stop kidding ourselves. To try  to say that it is outside the border on this map and, therefore, the  Boundary Waters have nothing to worry about…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…mission he began. His success proved       that the military is strengthened, not compromised, by       diverse leadership. The respect he commanded showed that       authority flows from character and capability, not color or       gender.\n\nThe transformation of military culture is far from       perfection, but Gregg showed us how to advance it--through…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688378/recognizing-virginias-fourth-district-black-history-month-essay-contest-1st-place-high-school-winner-tanvi-palavalas"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…celebrated the completion of  a $13.5 million water project to restore the Delaware, Clark, and  Horseshoe Islands in Walbridge Park on the Maumee River, the largest  river that flows into the Great Lakes.\n\nThis restoration means cleaner water, aquatic and wildlife habitats  renewed, and a healthier Lake Erie. As co-chair of the Great Lakes Task  Force,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695469/resisting-the-temptation-to-divide"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…policy, which will be critical for holding China to account.\n\nOne of the avenues that China has exploited to gain the upper  economic hand is through both inbound and outbound flows of capital. By  investing in U.S. companies, the People's Republic of China and the  Chinese Communist Party can obtain access to intellectual property and  know-how. And,…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688807/cormick-and-mmcr-fettermanhagerty-kim-cormick-schumer-sullivan-fetterman-and-others-for"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…immigration enforcement is working. Illegal  border crossings are down 95 percent. Daily border encounters are down  by 93 percent. Got-aways are down by 99 percent. Fentanyl flows are  down 54 percent. Mr. Speaker, there were 2,000 ICE arrests every day  recently. ICE is finally cleaning up the open-border policy of the  Biden administration. Yes, they…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…have all heard the saying: There is no such thing as  a free lunch. It turns out mom and dad were right. Everything comes at  a price, and nothing is free.\n\nEvery dollar that flows into American classrooms from foreign  countries comes with strings attached. This is particularly true for  China, whose strategy is to gain a foothold in America's educational…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…corporate  now passes through, so some of it was a corporate structure. You always  have to be careful when you say: Why are corporate taxes down so much?  It is now because it flows through on the individual line. I am just  trying to make that point.\n\nTake a look at this. Here is Social Security and retirement taxes.  Well, that is FICA. Actually, you…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…Article II of the Constitution is crystal clear: The executive power  is invested in the President of the United States. Let me repeat: All  authority in the executive branch flows from the people to the duly  elected executive. Anyone operating outside of the pleasure of the  President in the executive branch is simply part of an unconstitutional  fourth…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697985/protect-americas-workforce-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…which requires the Bureau of Reclamation and the Western Area  Power Administration, or WAPA, to enter into a memorandum of  understanding to address the impacts that bypass flows at Glen Canyon  Dam have had on the Upper Colorado River Basin Fund.\n\nIt is worth taking a moment to highlight why we are here today. Under  the Biden administration, the Bureau…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691059/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…a bad thing. This is a good thing.\n\nThose large institutions are capable of serving large, multinational  corporations that make the United States a destination for capital  flows in our country. They are a magnet for foreign direct investment.  They help us with countering terrorism. They give us a global  visibility that we wouldn't have if we didn't…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…A5: AGOA can become more bilaterally beneficial. Linking a       unilateral trade preference program with a mining investment       incentive could significantly boost capital flows into       Africa's mining sector. Such a framework could unlock greater       capital flows into Africa's mining sector, while ensuring       that off-take agreements from…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…requires the Bureau of Reclamation and  the Western Area Power Administration, or WAPA, to enter into a  memorandum of understanding aimed at addressing the impacts that bypass  flows at Glen Canyon Dam have had on the Upper Colorado River Basin  Fund.\n\nThese flows are an attempt to manage an invasive smallmouth bass  population that imperils the federally…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691060/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…they can't get a fair shot at investment.\n\nRight now, our capital markets suffer from an extreme geographic  imbalance. The data is stark. Nearly 70 percent of venture capital  flows to three States, Mr. Speaker: California, New York, and  Massachusetts.\n\nThis leaves entire regions of the country struggling to access  funding. It leaves communities in the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697190/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…with particular focus on       manufacturing, services, trade (with an emphasis on digital       trade), and U.S. jobs.\n\n(2) Trends in global cross-border investment and data flows       and the underlying factors for such trends.\n\n(3) Federal Government policies that facilitate foreign       direct investment attraction and retention from responsible…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692697/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…if there are problems that arise. The intelligence community's  ability to detect and prevent attacks against our homeland depends on  coordinated and efficient information flows.\n\nWe expect smooth interaction and joint maneuvers from our Nation's  warfighters, and we depend upon the same thing across all components of  our intelligence community.…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696796/dhs-intelligence-rotational-assignment-program-and-law-enforcement-support-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…electricity. We need every electron we can  produce to beat China.\n\nTalking about China, China is struggling and working as hard as they  can to beat us to control the data that flows around the world through  AI. It  is our job on this committee to see that that doesn't happen for this  country, and that is because we have to have enough energy.\n\nAgain,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Democratic colleagues don't believe that there is a crisis  there, but my Democratic colleagues don't believe there is a fentanyl  crisis under any circumstance. Any fentanyl that flows into the  country, they don't see any of it as a national emergency.\n\nWe have yet to find a place where Democrats say that drugs are a  national emergency. They made it clear…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699965/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…D.C.\n\nThat is why a lot of us new folks ran for office. Back at home, we  actually balanced budgets. We are forced to work with a balanced budget  amendment. Here, money just flows. If we dare cut spending in any  possible way, somehow we are seen as heartless. I don't buy that.\n\nFor years, they talked about prescription drug changes. Guess what?  The…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691176/president-trumps-delivery-on-his-promises"}]