[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "Section  1983 is a law enacted following the Civil War, as part of the Ku Klux  Klan Act, which allows lawsuits by individuals whose civil rights have  been violated.", "title": "Justice Ketanji Brown Jackson", "date": "2025-04-07"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "Speaker, I am    =========================== NOTE ===========================\n\nOn page H1260, March 25, 2025, in the third column, the  following appeared: minutes as the designee of the minority  leader.)  Mr.", "title": "Economic Populism", "date": "2025-03-25"}, {"senator": "Al Green", "party": "Democrat", "sentence": "I include in the  Record the following Proclamation recognizing Dr.", "title": "Certificate of Congressional Recognition Proclamation Presented to Apostle Dr. Dana Carson in Honor of 40 Years of Ministry", "date": "2025-06-05"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "The challenge and       barriers created by this current requirement were clearly       exposed during both the recent COVID pandemic restrictions as       well as the Capitol campus restrictions following the January       6, 2021 attacks on the Capitol.", "title": "District of Columbia Judicial Nominations Reform Act", "date": null}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Sagan, of  course, is the physicist who helped us understand the idea of a nuclear  winter, which is the hemisphere-wide Dark Age caused by the radioactive  ash sent into the atmosphere following multiple nuclear detonations.", "title": "Risk of Conflict with Nuclear Weapons", "date": "2025-07-23"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "It is my  great honor to recognize the efforts and include in the Record the name  of the following individuals:\n\nSteve S.", "title": "Recognizing the Korean American Association of the Washington Metropolitan Area and the 2025 Korus Festival Volunteers", "date": "2025-10-06"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "Still, care was taken to preserve as much of the original  diner as possible, and Henry's successfully reopened the following  year.", "title": "Recognizing Henry's Diner", "date": "2025-07-29"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "In 2009, following the tragic loss of his sister, Bishop Williams  convened leaders at Albany State University and asked, ``What can we  do?'' Out of that conversation grew a sustained, collaborative response  to violence and community pain--an enduring testament to his capacity  to turn grief into constructive action.", "title": "In Memory of Bishop Dr. Frederick Williams, Sr.", "date": "2026-01-30"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Speaker, I include in the Record the following  essay from Virginia's Fourth District Black History Month Essay  Contest--1st Place High School contest winner, Tanvi Palavalas.", "title": "Recognizing Virginia's Fourth District Black History Month Essay Contest--1St Place High School Winner, Tanvi Palavalas", "date": "2025-03-03"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Families face new expenses of childcare, diapers, baby  clothes, and more, while many parents must take time off leading up to  and following the birth of a newborn.", "title": "Economic Dignity for All", "date": "2025-11-20"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "It  forced healthcare providers to choose between following their sworn  oath to care for patients or facing criminal charges.", "title": "Dobbs Decision Anniversary", "date": "2025-06-25"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Speaker, before I do that, I would like to enter the following  documents into the Congressional Record: The January 2023 notification  to Congress, the letter we all received; the redacted environmental  assessment; and the complete environmental assessment.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to Public Land Order No. 7917 for Withdrawal of Federal Lands; Cook, Lake, and Saint Louis Counties, Mn", "date": "2026-01-21"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "McMahon repeatedly stating that she is not familiar with Project 2025's  proposals on higher education, it is abundantly clear that this  administration is following Project 2025 to a tee.", "title": "Nomination of Linda McMahon", "date": "2025-02-27"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "Speaker, I include in the Record the following letter  from the National Taxpayers Union, signed by 469 economists, opposing  the Trump Administration's sweeping national tariffs as dangerous  economic policy, for consideration by the Supreme Court as it evaluates  the potential violations of the International Emergency Economic Powers  Act (IEEPA):\n\n469 Economists: Biggest Trade Threat is if Tariffs Are Left in Place\n\nIn the case of Trump v.", "title": "Opposing the Trump Administration's Sweeping National Tariffs", "date": "2026-02-03"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "3838 to the       Committee on Armed Services with instructions to report the       same back to the House forthwith, with the following       amendment:\n\nAt the end of subtitle B of title V, insert the following       new section:       SEC.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "283\n\nResolved, That the following named Member be, and is       hereby, elected to the following standing committee of the       House of Representatives:\n\nCommittee on Foreign Affairs: Mr.", "title": "Electing A Member to A Certain Standing Committee of the House of Representatives", "date": "2025-04-01"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "Congress makes the following findings:\n\n(1) The Iran Sanctions Act of 1996 (Public Law 104-172; 50       U.S.C.", "title": "Solidify Iran Sanctions Act of 2025", "date": "2025-05-05"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "The following Senator is necessarily absent: the  Senator from Kentucky (Mr.", "title": "-9999", "date": "2026-02-12"}, {"senator": "John Joyce", "party": "Republican", "sentence": "By April of the following year, Buzz was credited with eight air-to- air kills, as well as numerous successful bombing runs on Japanese  airfields, one of which earned him the Distinguished Service Cross  citation.", "title": "Supporting Reversal of California Ev Mandate", "date": "2025-04-07"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "973) is amended by inserting after paragraph (12), as so       redesignated, the following:\n\n``(13) The term `regional terms and conditions' means any       of the terms or conditions attached by the Administrator to       the license issued by the Administrator, as notified by the       Secretary.''.", "title": "South Pacific Tuna Treaty Act of 2025", "date": "2025-05-13"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "Not later than 270 days after the date of the enactment of       this Act, the United States Postal Service shall designate a       single, unique ZIP Code for each of the following       communities:\n\n(1) Eastvale, California.", "title": "Establishing New Zip Codes", "date": "2025-07-21"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "(5) Communications network.--The term ``communications       network'' means any of the following:\n\n(A) A system enabling the transmission, between or among       points specified by the user, of information of the user's       choosing.", "title": "Promoting United States Wireless Leadership Act of 2025", "date": "2025-07-14"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "In essence, this is following through on the things that our  President has truthed.", "title": "Bringing America Back to its Roots", "date": "2025-12-12"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "(2) Elements.--The threat assessment shall include the       following:\n\n(A) An identification of current and potential criminal       threats posed by members of Tren de Aragua and affiliates       seeking to--\n\n(i) unlawfully enter the United States through the       southwest, northern, or maritime border; or\n\n(ii) exploit any security vulnerabilities along the       southwest, northern, or maritime border.", "title": "Tren De Aragua Border Security Threat Assessment Act", "date": "2025-11-19"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "The Bottles and Breastfeeding Equipment Screening Act       (Public Law 114-293) is amended by adding at the end the       following new sections:       ``SEC.", "title": "Bottles and Breastfeeding Equipment Screening Enhancement Act", "date": "2025-11-17"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "The following Senators are necessarily absent: the  Senator from Texas (Mr.", "title": "En Bloc Nominations", "date": "2025-10-03"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "Following his service in Tallahassee, Mayor Bovo was elected to the  Miami Dade County Commission, where he served from 2011 to 2020.", "title": "Recognizing Hialeah, Florida Mayor Esteban Bovo", "date": "2025-04-28"}]