[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…restructuring  within the Department of Education's Office of Special Education have  left only a fraction of the staff to manage billions in IDEA funds and  ensure States follow the law.''\n\nShe continued: ``Without Federal oversight, States will have less  accountability, fewer resources, and more leeway to deny or reduce  services. Families will be left…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698934/protecting-education-for-children-with-disabilities"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…put, we cannot continue to allow foreign adversaries to  control technology that can fuel domestic and political polarization  and civil unrest. We need the President to follow the law that Congress  passed and bring TikTok under U.S. ownership.", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692683/tiktok"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…actually blocking, like the  bipartisan effort to release the Epstein files.\n\nI will make it simple. Stop rewriting history. Stop wasting time.  Stop dishonoring the police. Follow the law, for God's sake. Hang the  plaque.\n\nMr. McGOVERN. Mr. Speaker, is the gentleman prepared to close?\n\nMr. McGOVERN. He has no more speakers?\n\nMr. Speaker, what we have heard…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…should know that we will stand strong for working  families in America. They deserve healthcare. It is about saving  healthcare and holding Donald Trump accountable to follow the law. When  there is a budget, when it is passed by Congress and signed by the  President, he cannot be allowed to simply ride roughshod over it and  disregard it.\n\nIt is the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695920/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…leaders who were  describing it as terrorism and saying it was absolutely inexcusable and  indefensible. Now, all of a sudden, we have the majority which will not  even follow the law by posting a plaque in honor of the officers who  gave blood and sweat and tears on that day.\n\nOne of them, Officer Hodges got caught in the doorway. The whole  world saw…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…evidence.'' When testimony begins, jurors observe each witness take an  oath under penalty of perjury to ``tell the truth and nothing but the  truth.'' Judges, also sworn to follow the law, enforce rules of  evidence--including by striking irrelevant or unreliable testimony from  consideration by the jury. In some cases, judges must also pre-qualify  proposed…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690041/valuing-truth-fullness-lessons-from-jury-trials"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…the VA, where countless people have been illegally fired, some of them  hired back.\n\nAnd that is why we are insisting that there be a guarantee that the  President will follow the law when we pass a budget. It is not a  hypothetical danger that he will disobey it. In fact, he has ordered  rescissions, impoundments, clawbacks. If we pass a law, we have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695873/9999"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…America has the authority to  rein in a President who commits impeachable offenses. Impeachable  offenses. Saying that Members of Congress that advocated for people to  follow the law, saying that these Democrats should be lynched, at some  point there is a line. This is the line. This is the solution.\n\nWe are in a countdown to impeachment. I intend…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…in limbo for years. It means  prioritizing dangerous individuals, not hardworking parents who have  built their lives in our communities.\n\nPeople who play by the rules, follow the law, and adhere to the  guidelines laid out before them should never be targeted because of the  color of their skin and denied due process. Our society should not  accept…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695521/visit-to-bluebonnet-detention-facility"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…undermining our  Constitution under Article I. That is the beginning of the  Constitution. I recommend every American go back and look. It puts  everyone in danger when you don't follow the law.\n\nOperating dilapidated oil platforms in Venezuela is really not the  President's job. That is what he says he is going to do. Now, the  President does have responsibility…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…full stop. If noncitizens are voting in  Federal elections, they should be prosecuted. We don't disagree on  that.\n\nSecond, nobody disputes the fact that voters should follow the law  and indicate who they are. We agree on that, too. Nobody is debating  that on the floor today.\n\nWhat we are debating is whether we are going to believe the BS  conspiracy…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…made it crystal clear that they are not interested  in permitting reform or bringing down the price of energy.\n\nThe bottom line is this. The Trump administration needs to follow the  law. They need to reverse their illegal stop work orders, and they need  to start approving legally compliant energy projects--full stop.\n\nFinally, I will say one last thing…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698581/permitting-reform"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…like George Bush or H.W. Bush  or Clinton or Obama. They all looked. You know, they wanted someone to  have some philosophical kinship with them. But they said: Will they  follow the law? Do they know this law?\n\nNot this administration. It is so different than all the others in a  very bad way. Donald Trump doesn't care about the law or what the  Constitution…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693417/nomination-of-whitney-d-hermandorfer"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…talent.\n\nThe National Science Foundation affirmed that our amendment, this  adjustment, would improve their ability to ensure institutional  compliance because people want to follow the law. They need the  guardrails, and they need the clarity of the law. So even minor  differences in definitions can have large consequences and can make  implementation difficult.…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688933/united-states-research-protection-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…have got to tell the truth about them.\n\nRight now, the Social Security trust fund is empty in 6.5 years. That  means 7 years from now, if you are on Social Security, if we follow the  law as it is today and Congress continues to fail to act, you get a 24  percent cut. Our model says we double senior poverty in 7 years. We  will double the number of baby…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…about something very simple: Abide by Federal  detainers. If the Federal Government says you have arrested an illegal  immigrant who has a criminal detainer, you have to follow the law.\n\nWe didn't give the billion dollars to the District of Columbia  because they need to understand that actions have consequences. When I  don't feel safe at night, when…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692372/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Democrat-run sanctuary cities, fueled by woke  politics, have become magnets for chaos, stretching public resources to  the brink, and crowding out citizens who actually follow the law.\n\nWhat happens? Well, it often depletes the public resources meant for  U.S. citizens.\n\nMoving SBA offices into nonsanctuary jurisdictions is a step in the  right direction.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692100/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…crisis.\n\nI have to say that Congressman Knott pointed out how the border is  finally secure, and it didn't require a change in law. It simply  required a President who would follow the law.\n\nWhat do we have going on now that things have changed? My colleagues  on the other side of the aisle, respectfully, are not showing up in  towns that were damaged by…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…all of our school districts now. We know that the lawyers on staff  have means by which to make sure that the appropriate t's are crossed  and i's are dotted. They can follow the law. We must do that.\n\nAdvocacy groups, such as Defending Education, have done tremendous  work to ensure we know about the CCP's influence, but it shouldn't take  a third-party…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697438/transparency-in-reporting-of-adversarial-contributions-to-education-act"}]