[{"senator": "Lucy McBath", "party": "Democrat", "sentence": "…only primarily funded by the manufacturer, they did       not mimic real-life situations, having exclusively healthy       subjects, a short exposure time, and no long-term follow-up.       Moreover, domestic violence continues or for some populations       even escalates during pregnancy, and there is evidence that       the use of a TASER on a pregnant…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…Wilmington VA and the  tens of thousands more across Delaware are treated not as political  props but as patriots deserving dignity.\n\nThis Memorial Day, I urge my colleagues to follow the famous charge  of President Lincoln. Any Nation that does not honor its heroes will  not long endure. No mission is more important or righteous.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691492/protecting-american-maritime-research"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…from its rails.\n\nEvading the Gaspee's cannon balls,\n\nThe Hannah sailed for the Namquid shoals.\n\nFast and light, Hannah crossed the shallow,\n\nBut when the Gaspee attempted to follow,\n\nShe ran aground on the Warwick shore,\n\nIn a falling tide, and could move no more.\n\nThat night dark longboats with muffled oars,\n\nCame slipping quietly down the shore,\n\nTo…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…years of audited financials when  they go public. In some situations, an EGC must provide 3 years of  financials, such as an EGC acquiring another company or conducting a  follow-on offering after its IPO.\n\nThis bill will eliminate this regulatory hurdle by ensuring EGCs only  need to provide 2 years, not 3, of audited financials across the board,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693856/greenlighting-growth-act"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "Mr. GARAMENDI. Madam Chair, I want to follow along on the path that  our ranking member has laid out, but before I go there, I do thank my  Republican colleagues, particularly Chairman Rogers, for his efforts in  committee…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695144/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…servicemembers to obey lawful orders and to refuse  illegal orders.\n\nWe can't order a servicemember to commit a crime. It is that simple.  If someone is a servicemember, he can't follow an order that requires  him to commit a crime.\n\nRecently, my Democratic colleagues merely reminded our servicemembers  of their lawful duty. The President's reaction was that…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697546/holding-war-criminals-accountable"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…personally the benefit  of AGOA, and I witnessed the entrepreneurial spirit of the people. As  internet access becomes broadly available, rapid economic growth and  opportunity will follow.\n\nWe have the ability to benefit from this inevitable growth in Sub- Saharan Africa, and we should do something about it.\n\nMadam Speaker, I am honored to be a part of this…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…release from a health care professional, that--\n\n(A) states that the student is capable of resuming       participation in such activities; and\n\n(B) may require the student to follow a plan designed to       aid the student in recovering and resuming participation in       such activities in a manner that--\n\n(i) is coordinated, as appropriate, with periods…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695777/by-mr-padilla"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…simply put, we cannot continue to allow foreign adversaries to  control technology that can fuel domestic and political polarization  and civil unrest. We need the President to follow the law that Congress  passed and bring TikTok under U.S. ownership.", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692683/tiktok"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…examine, evaluate, audit, and  investigate to support the initiatives of President Trump and Secretary  Kennedy.'' Last time I looked, an inspector general isn't there to  follow the President's marching orders; they are there to make sure  that the train stays on track and that nobody is out there pilfering  the boxcars.\n\nMr. Bell has spent his whole…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697900/9999"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…like George Bush or H.W. Bush  or Clinton or Obama. They all looked. You know, they wanted someone to  have some philosophical kinship with them. But they said: Will they  follow the law? Do they know this law?\n\nNot this administration. It is so different than all the others in a  very bad way. Donald Trump doesn't care about the law or what the  Constitution…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693417/nomination-of-whitney-d-hermandorfer"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…What we are seeing is  not law enforcement. It is State-sponsored terror, and this has to stop  now.\n\nMr. Speaker, I am calling on this administration to get out of our  city, follow the law, and hold those responsible for this accountable.  Enough is enough.", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699493/protests-in-portland"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…and particularly with contaminated  foods and medical products that are imported, there is a need for the  FDA to expand its presence. That cannot be done for free.\n\nWe must follow the Senate's lead on funding the FDA. The Senate bill  provides $3.5 billion for the vital agency, $332 million over the House  bill and roughly equally to the 2025 level.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "Ms. CANTWELL. Mr. President, I rise to speak today on important  public policy issues related to my State's economy and appreciate the  opportunity to follow our senior Senator, Senator Murray, who is  articulating the impact of some of these so important public policy  issues on the State of Washington.\n\nTrade is the lifeblood…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…sign language interpreter. A student who just needed a  little bit of speech therapy in order to be a part of the class would  not have that, making it nearly impossible to follow daily lessons or  participate in discussions.\n\nWeakening IDEA would not only cut funding or reduce services, but it  would threaten the future of these students who with just…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…information from the       internet qualified as a rule of agency organization,       procedure, or practice. There, the manual outlined procedures       for SSA employees to follow in processing and adjudicating       benefits claims. Because the manual was directed to and       binding only on SSA officials without imposing new burdens on       claimants,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693059/us-government-accountability-office-legal-opinion"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…serve. She led with grace and conviction, never backing down from a  challenge, and always striving to make a difference for those she  served. It is for me a profound honor to follow in her footsteps.\n\nHer legacy is one of faith, courage, and love, and the highlight of  her life was her husband, Jason, and her family. These descriptions are  all fitting…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689230/moment-of-silence-in-remembrance-of-the-honorable-mia-love"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…The GENIUS Act is a proinnovation, profreedom, and  progrowth piece of legislation. It is a bipartisan solution to a global  challenge, empowering U.S. markets to lead, not follow.\n\nLet's pass this bill and secure American financial leadership in the  global digital economy. I encourage all my friends in this body to  unequivocally vote ``yes'' on this…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693844/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Organization, the idea behind that was that somehow  communist China would change with being part of the rules-based  international order. Well, of course, we know China doesn't follow the  rules and has taken advantage of the United States for decades. But  under President Trump, that will no longer be the case. For example,  last month, the White House…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688807/cormick-and-mmcr-fettermanhagerty-kim-cormick-schumer-sullivan-fetterman-and-others-for"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…I can't believe this is even a debate we need to  have on the floor of the House.\n\nMr. Chair, you are going to hear opposition to science today from  people who tell you to follow science. Women are biologically distinct  from men, and we love it. Every single one of my colleagues knows this  truth, even if they are too afraid to say it.\n\nMy colleagues…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…themselves.\n\nI encourage us here not only for those of us in California to  encourage a change in action on the part of our State's own leadership  but for Congress itself to follow the anti-Newsom playbook in making  sure that we don't see costs across the entire country rise to the  level they have in California.                        Safety of Autonomous…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…Mr. Speaker, yesterday was Veterans Day. Veterans  didn't fight for the red. They didn't fight for the blue. They fought  for the red, white, and blue. Maybe tonight we can follow their  example.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696737/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…unparalleled ability to adapt and respond under  pressure. The team leveraged the Human Services. Needs app to  streamline disaster case management, supporting 1,351 residents. Their  follow-up system, in partnership with other agencies, ensured  personalized service for every individual. This innovative approach  epitomized their ability to harness technology…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691971/recognizing-rebecca-seils"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…own values, and their own interests on the  global wireless stage. As the next generation of wireless technologies  take shape, it is critical that America leads and does not follow.\n\nThis bipartisan bill will cement our continued leadership by  directing the National Telecommunications and Information  Administration, or NTIA, to encourage participation…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693510/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…forefathers wanted. He was also killed for his  Christianity. I have come to realize he was far more of a religious  leader than he was a political leader.\n\nWe have to now follow what he would have wanted, had he survived. I  think that is two things. First of all, in America right now, church  attendance was down. We can all be wonderful Christians…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695805/what-charlie-kirk-stood-for"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…crisis.\n\nI have to say that Congressman Knott pointed out how the border is  finally secure, and it didn't require a change in law. It simply  required a President who would follow the law.\n\nWhat do we have going on now that things have changed? My colleagues  on the other side of the aisle, respectfully, are not showing up in  towns that were damaged…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…discipline.  From studying Russian and leading his family on a 19-day European tour  to interviewing local veterans, he has taken on challenges that show  real initiative and follow-through.\n\nRia, a student at Moravian Academy, volunteered at a camp for  children with special needs, worked to better herself academically,  played on her school's tennis…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692462/recognizing-adam-wyatt-and-ria-gandotra"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…talk about future debts  and deficits, CBO is instructed to act like we just keep spending the  money. The actual Social Security law says you have to cut benefits. If  you follow the Social Security law, that is a 24 percent cut.\n\nIn reality, about halfway through 2032, be prepared to have your  check cut by 24 percent. Our calculation is a few months…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…have turned a blind eye to the atrocities committed by  our supplier. Communist China owns 13 of the 19 industrial mines in the  Congo, and they utilize child slave labor and follow zero environmental  laws.\n\nMy amendment would require DOD to help develop a strategy to reshore  critical mineral production and end our reliance on Communist China.\n\nMr. Chair,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695238/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…resources to administer  elections.\n\nToday, Congress has the opportunity to build on this momentum and  ensure that these protections are part of our laws, that every State  can follow these  practices, and that voters across the Nation can feel confident in the  integrity and security of their elections.\n\nCongress must commit to supporting election officials…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689997/safeguard-american-voter-eligibility-act"}]