[{"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…Bryant is now the twenty-second board chair in  DART's forty-two-year history, and he becomes the youngest individual  ever to lead the Board.\n\nMr. Bryant joined the DART Board following his appointment by the  Dallas City Council in 2024 to fill a vacancy, and he was reappointed  to a full two-year term in May 2025. Over the past fifteen years, he  has served…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696402/recognizing-mr-randall-bryants-selection-as-chairman-of-the-dart-board-of-directors"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…many countries are now  refusing to accept any Burmese refugees--including, regrettably, the  United States, which recently banned all travel to the U.S. by Burmese  citizens following an executive order from President Trump.\n\nRather than slamming the door, the Trump administration should  reverse this misguided decision and allow Burmese refugees who have…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697902/burma"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…weeks that followed, her family found  themselves in a desperate battle with Emory Hospital.\n\nThe hospital believed that the anti-abortion bill that Georgia  enacted in 2022 following the gutting of Roe v. Wade tied the  hospital's hands and mandated that Adriana's body, her brain-dead body,  remain hooked to machines. Mr. Speaker, this was not because…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692035/adriana-smith"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…lot of money for many people in my  district--in this case, an exorbitant poll tax.\n\nThis bill is only the latest Republican attempt to erect barriers to  the ballot box, following recent attempts to make it more difficult to  vote by mail or by ballot drop boxes. Just last week, the President  signed a sweeping executive order with several onerous…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…the necessary skills needed to thrive today.\n\nFounded in 2001 by Baldwin and Crystal Hamilton, It's About the Kids  Mentor Program began outreach in Marietta, Georgia, then following the  Hamiltons' move to Dallas in 2012, they expanded their reach to Dallas  and most recently have expanded to Shreveport in 2024. The Hamiltons  have intentionally poured…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692965/recognizing-the-work-of-the-its-about-the-kids-mentor-program"}, {"senator": "Linda Sánchez", "party": "Democrat", "sentence": "…ratified it. There is a lawful  review process that goes into effect next year to find ways to improve  it.\n\nThat is how responsible governments handle trade disputes, by  following the law, not through weird social media tantrums about  bridges and hockey trophies or through childish threats to annex a  sovereign nation and make it the 51st State.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699972/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…circles, swing dancing, and visiting artist programs--and organized a  Spring Sing performance at UCSB's Campbell Hall that brought together  hundreds of students and families.\n\nFollowing her retirement in 2007, JoAnne continued her public service  by directing the Santa Barbara County Spelling Bee, co-founding the  Santa Barbara Martin Luther King, Jr. Committee,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698084/the-year"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…course, is the physicist who helped us understand the idea of a nuclear  winter, which is the hemisphere-wide Dark Age caused by the radioactive  ash sent into the atmosphere following multiple nuclear detonations. It  would wipe out food supplies and cause untold deaths from starvation,  even beyond the millions killed by the blasts.\n\nFor us today, the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…repeals the 1991 and 2002 Authorizations for  Use of Military Force (AUMF) related to U.S. military actions in Iraq,  the bill does not repeal the 2001 AUMF that was passed following the  terrorist attacks September 11, 2001. I have long supported a repeal of  the 2001 AUMF because it was intended to authorize military action  against Al-Qaeda in Afghanistan,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…first  major opinion reaffirmed that Medicaid patients unlawfully denied care  or abused by healthcare providers can sue under section 1983. Section  1983 is a law enacted following the Civil War, as part of the Ku Klux  Klan Act, which allows lawsuits by individuals whose civil rights have  been violated. It is a powerful tool for Americans to seek…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689666/justice-ketanji-brown-jackson"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Ms. McCLELLAN. Mr. Speaker, I include in the Record the following  essay from Virginia's Fourth District Black History Month Essay  Contest--1st Place middle school contest winner, Augustus Rezba-Patel.\n\nWomen are 17 percent of active-duty…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688375/recognizing-virginias-fourth-district-black-history-month-essay-contest-1st-place-middle-school-winner-augustus-rezba-patel"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…education at Rockhurst High School,  before attending the University of Missouri-Columbia, where he would  graduate with honors in 1980 with a bachelor's degree in journalism.  Following graduation, Gerard briefly enjoyed working as a reporter for  the Kansas City Labor Beacon, before joining the staff of U.S. Senator  Thomas F. Eagleton. As the Senator's…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688302/recognizing-mr-gerard-j-grimaldi-on-his-retirement-and-expressing-appreciation-for-a-lifetime-of-dedicated-service-to-our-community"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…staffers drive to the Capitol to deliver the documents--two  are necessary because of parking restrictions.\n\nThe physical transmittal process also imposes costs on Congress. The  following congressional offices and committees are involved in the  physical transmittal process: the offices of the Speaker and President  of the Senate, the House and Senate Parliamentarians,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689607/introduction-of-the-district-of-columbia-electronic-transmittal-of-legislation-act"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…repeating his lies that, by the way, he still continues to  repeat today--his lies that the election was stolen from him. But here  in the Senate we were just doing our jobs in following the Constitution  and participating in the peaceful transfer of power. Then things  started to change. Information came in pieces, and we could hear noise  building outside…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698511/9999"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…detaining and  deporting our neighbors without due process.\n\nThat hypocrisy is not a coincidence. It is a deliberate, resounding  message from an administration that believes that following the  Constitution is a mere suggestion.\n\nMy office has documented hundreds of cases marked by excessive force,  racial profiling, and the unlawful arrest of legal residents.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697461/fighting-dhs-immigration-raids"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…fact, this was Frank's first reception and first  touchdown of his NFL career. Frank's touchdown is the result of an  unwavering work ethic and a commitment to excellence.\n\nFollowing a commendable collegiate career at the University of  Wyoming, Frank went undrafted in the 2024 draft, but he did not let  that deter him. He signed with the Denver Broncos…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699338/congratulating-frank-crum"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Mr. BARRASSO. The following Senators are necessarily absent: the  Senator from Mississippi (Mrs. Hyde-Smith), the Senator from Louisiana  (Mr. Kennedy), and the Senator from Mississippi (Mr. Wicker).", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696454/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…equally divided and controlled by the chair and  ranking member of the Committee on Appropriations, or their respective  designees, and one motion to recommit.\n\nMr. Speaker, following last week's progress in advancing three  separate appropriations bills through the committee and on the floor,  we have returned this week to continue our work. H.R. 7006…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699072/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the Tribe, to safeguard structures within the Osceola  Camp from flooding events.\n\nThe Miccosukee Tribe is currently located in the Greater Everglades  in southern Florida. Following Federal recognition of the Tribe in  1962, the Miccosukee's northernmost villages within what became  Everglades National Park were managed under a special use permit until…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698658/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…speak up and  help Office of Advocacy hold Federal agencies accountable for the red  tape that is crushing their day-to-day operations.\n\nThe Red Tape Hotline was created by following President Trump's  executive order, ``Unleashing Prosperity Through Deregulation.'' The  DUMP Red Tape Act codifies the executive order and ensures that small  businesses…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697346/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…privileged resolution and ask for its immediate  consideration.\n\nThe Clerk read the resolution, as follows:                                H. Res. 283\n\nResolved, That the following named Member be, and is       hereby, elected to the following standing committee of the       House of Representatives:\n\nCommittee on Foreign Affairs: Mr. McCormick (to…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689428/electing-a-member-to-a-certain-standing-committee-of-the-house-of-representatives"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…one Bronze Service Star, the Global War  on Terrorism Service Medal, the Sea Service Deployment Ribbon with one  Bronze Service Star, and the Presidential Unit Citation.\n\nFollowing his honorable discharge in 2023, Mr. Moceri returned to  Michigan and continues to serve his community as a Construction Project  Manager with Moceri Companies, supporting…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699292/recognizing-united-states-marine-corps-veteran-domenico-s-moceri"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…paragraph (2), by striking ``and'' at the end;\n\n(2) in paragraph (3)(F), by striking the period at the end       and inserting ``; and''; and\n\n(3) by adding at the end the following:\n\n``(4) that the Secretary shall prioritize the adoption of       improved grain grading technology to provide for efficient,       accurate, and consistent grading of grain.''.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "Mr. CRUZ. Mr. President, for the Committee on Commerce, Science, and  Transportation I report favorably the following nomination lists which  were printed in the Records on the dates indicated, and ask unanimous  consent, to save the expense of reprinting on the Executive Calendar  that…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699538/executive-reports-of-committee"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Miracle on Ice Congressional       Gold Medal Act''.       SEC. 2. FINDINGS.\n\nCongress finds the following:\n\n(1) The USA Olympic men's ice hockey team competed at the       1980 Winter Olympics, officially the XIII Olympic Winter       Games and known as the 1980 Lake Placid games,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690279/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…IMPS.\n\nThirty-two (32) M404 ER GMLRS Unitary pods with IMPS.\n\nSixty-four (64) M57 Army Tactical Missile System (ATACMS)       pods.\n\nNon-Major Defense Equipment: The following non-MDE items       will also be included: Low Cost Reduced Range Practice Rocket       pods; interactive electronic technical manuals; integration       support services;…", "date": "2025-10-02", "source_url": "https://justfacts.votesmart.org/public-statement/1695978/arms-sales-notification"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…by striking ``and'' after the       semicolon;\n\n(B) in subparagraph (B), by striking the period at the end       and inserting ``; and''; and\n\n(C) by adding at the end the following new subparagraph:\n\n``(C) any intelligence information under this Act is       shared, retained, and disseminated consistent with the       protection of privacy rights, civil…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696751/strengthening-oversight-of-dhs-intelligence-act"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Davis-Monthan AFB in Tucson,  Arizona. There, she served in leadership roles, completed a Community  College Air Force (CCAF) degree, and enhanced pathology specimen  operations. Following the birth of her second and third child, she  moved to Cannon AFB, New Mexico in January 1996, where she managed the  Drug Urinalysis Program for six to seven years. Her…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696274/recognizing-technical-sergeant-martha-socorro-ybarra-usaf-retired-with-a-congressional-veteran-commendation"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Sam lost his silent struggle. His story is a    =========================== NOTE ===========================\n\nOn December 3, 2025, on Page H5013, in the third column, the  following appeared: faced daily. Tragically, in 2021, Sam lost his  silent struggle. His story is a\n\nThe online version has been corrected to read: faced daily.  Tragically, in 2020,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697382/the-fight-against-suicide"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…veterans,  and the families of over 140 crew members.\n\nIt was a powerful moment marking the beginning of a new era. The USS  Iowa is the third naval vessel to bear that name following a battleship  that served with distinction in World War II, both in the Atlantic and  the Pacific, in the Korean war and in the Gulf. That proud legacy now  continues beneath…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689656/recognizing-the-uss-iowa"}]