[{"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…American in this body until I took the oath of  office 95 years later. That is what happened with Jim Crow 1.0, and  what we are seeing happening now is Jim Crow 2.0.\n\nI am very fond of quoting George Santayana's admonition: Those who do  not remember the past are condemned to repeat it.\n\nI worry that we are dangerously close to repeating this democratic…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…opportunity to exercise the power bestowed on us  by our Framers to authorize the use of force--or decline to do so--but  to reassert some constraint on an Executive grown too fond of the use  of military power.\n\nWe took the first step last week when a bipartisan majority of this  body voted to set before the Senate a War Powers Resolution on  Venezuela.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699093/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…from the master's table  for the average American earning under $200,000 a year versus tax cuts  for the wealthiest corporations and individuals.\n\nThat is the math. I know how fond you are of math. That is the  arithmetic.\n\nLet me tell you, the handouts to the wealthiest will come on the  backs of the least of us, from affordable healthcare through the…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688030/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…we are also  committed to our Constitution, to a system of checks and balances that  wisely places the power to make war in our hands, not with an Executive  who may grow too fond of using it.\n\nThat is why Senator Kaine and I have introduced a resolution to  direct the President to stop engaging in armed strikes against these  vessels or the country from…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "Mr. WHITEHOUSE. Mr. President, in fond memory of Dame Jane Goodall,  1934-2025, Explorers Club Fellow, Honorary Member, and Explorers Club  Medalist, by L. M. Levie:\n\nThere's a tale explorers tell, of a girl with…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696844/the-ballad-of-jane-goodall"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…they wrote.\n\nAs the Founders wrote, the power was given to the legislative branch  to declare war because the power to make war was something that an  Executive might grow too fond of. So the power was given to Congress,  to this legislative body. Let's use that power. Let's reassert our  authority. Let's say through this resolution that if the President…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696564/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…Play-Doh, Monopoly, and Nerf, and took their iconic tuber, Mr. Potato  Head, to new heights in the Hollywood film ``Toy Story.''\n\nGrowing up in Pawtucket, Rhode Island, I have fond memories of Mr.  and Mrs. Potato Head statues popping up across Rhode Island. Under  Alan's guidance, Hasbro teamed up with the State of Rhode Island for a  tourism campaign…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693984/recognizing-arthur-coia-of-rhode-island"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…allow them to retire, as has been happening, we risk  putting aside one of the most powerful tools we have to actually  enforce any deal that we may get.\n\nThe President is very fond of talking about this deal he is going to  get on Iran nuclear. We listened to him talk about how he was going to  get North Korea. I support efforts to try to do that.\n\nIf…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…want to cut $545 million from the FBI, cutting its workforce by  more than 2,000 personnel. That sounds like defunding law enforcement  to me.\n\nI know they don't seem to be as fond of Federal law enforcement as  they are of local law enforcement, but do they really want to cut more  than half a billion dollars from the FBI to be fighting criminals and…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Party.\n\nIn a free-market economy, we can rent from whoever we want. In a  socialist state, all the property is owned by the government. Right  now, my office is in a place called Fond du Lac, Wisconsin. If I want  to live in Fond du Lac, Wisconsin, first of all, I pay rent. I am  guessing that in Fond du Lac, Wisconsin, there are maybe 400 different  landlords.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…at a charity fundraiser and presented to  then-Congressman Joel Pritchard as a gift to his office in the early  1970s.\n\nCongressman Pritchard, as the story goes, wasn't too fond of the  painting. In true Washington fashion, he decided that the honorable way  to handle it was to regift the baby chick to the next new member of the  Washington delegation.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698645/tax-relief-for-working-families"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…support to  teachers. These grandparents have the ability to help young people in  need learn independence, self-confidence, and social skills.\n\nMr. Speaker, many of us have fond memories of our own grandparents,  and I am glad that for the past 60 years the foster grandparent program  has helped connect seniors with young people to form these wonderful…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695216/recognizing-americorps-seniors-foster-grandparent-program"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…and country. He would give you the shirt off  his back, if you really needed it. He taught his family the value of  being tough and rolling with what life gives you. He was fond of the  saying ``rub some dirt on it, you'll be fine'', which carries weight  with everyone who knew him.\n\nFrank took immense pride in being a Night Stalker. These men and…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696142/recognizing-frank-esten-cook-iii-and-his-service-to-his-country"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…she embraced the romance of the West. She loved the open range  and never tired of participating in the cowgirl life from baking bread  to moving cattle. Juli was particularly fond of the natural beauty and  wildlife we are blessed with in Wyoming.\n\nHer fondness for the West led Juli to work towards preserving the  history and legacy of Wyoming, and Juli…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687885/recognizing-the-legacy-of-juli-spitzer"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…while we are in a shutdown, Members of Congress  don't get paid, but they will get paid. They will get their money in  arrears after we open the government back up.\n\nI am rather fond of the Constitution, as most people are. I am well  aware of the 27th amendment which says:\n\nNo law, varying the compensation for the service of the       Senators and Representatives,…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…then we will be the  first generation of Americans who have left our country worse than we  found it.\n\nIf we are to usher in that golden age of America that President Trump  is fond of talking about, we must advance a budget resolution bill that  doesn't just include tax cuts or deregulation or good energy policies.  All that is good, but also, admittedly,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…conservatives but now support  tariffs, let me remind them that Milton Friedman said tariffs ``raise  prices to consumers and waste our resources.''\n\nTo those who still have a fond memory of Ronald Reagan on my side,  Ronald Reagan said:\n\nProtectionism costs consumers billions of dollars, damages       the overall economy, and destroys jobs.\n\nRonald Reagan's…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}]