[{"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Speaker, I rise today to oppose the cruel and  morally bankrupt healthcare agenda moving through this Chamber that  would gut Medicaid; gut Medicare; collapse our healthcare systems; and  cut food assistance to millions of children, seniors, and veterans  across this country."}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "Speaker, I rise today because the Republicans' budget  scheme pushed through in the middle of the night last month is putting  school meals for hungry kids and food assistance for working families  at risk."}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "They will pay for it by making cuts to  Medicaid to the tune of $880 billion and deep cuts to SNAP benefits,  food assistance to families."}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "Republicans  shut down the government instead of finding bipartisan solutions to  keep care affordable and took a 7-week paid hiatus, doubling healthcare  costs for working families, cutting off food assistance right before  Thanksgiving, and letting Trump spend his days pardoning  insurrectionists, enriching billionaires, cozying up to dictators, and  building himself a new ballroom, all while taking food away from  families in need."}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "They want to take away food assistance from children  and needy families."}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "We won't be restoring food assistance today for the millions of  Americans who benefit from SNAP because House Republicans voted to cut  the number one program that keeps kids and seniors out of poverty by  over $180 billion."}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "The biggest cut in food assistance in history  is contained in this bill."}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Programs and services from food assistance to education to health  research, which this administration has illegally frozen and  dismantled, and which their budget decimates funding for, support  veterans around the country."}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "I reject this bill that gifts tax cuts to the wealthy, paid for by  denying and depriving low-income, poor people, senior citizens, and  sick people, the health care, food assistance, housing assistance, and  economic development opportunities that they need."}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "This is on top of the catastrophic attacks of DOGE on veterans,  teachers, Social Security, and vital programs, and on top of the attack  the GOP and Trump's reconciliation tax plan would have on Medicaid and  food assistance."}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "In fact, in just a couple of weeks, on October 1, our State  legislature will convene in the wake of Republicans' disastrous big,  ugly bill, which will gut healthcare and food assistance programs, to  actually shore up the programs that will save and support thousands of  lives in our State."}, {"senator": "Al Green", "party": "Democrat", "sentence": "The cuts to Medicaid, Medicare, and the  Supplemental Nutrition Assistance Program (SNAP) alone will take health  care and food assistance away from millions of veterans, seniors, and  families across the country."}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "Speaker, I rise today to speak out against the big,  ugly bill, which even Elon Musk has called a ``disgusting  abomination.''\n\nThe big, ugly bill undermines the programs millions of Americans rely  on to survive, like healthcare and food assistance."}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "As a provider of healthcare myself, as a doctor, and as a recipient  of Medicaid services--my first three children were born on Medicaid--in  addition to the fact that as a child, I was receiving food assistance  not only from free school lunch programs but church programs,  recognizing the vital need associated with Medicaid as well as with  these food programs, we need to rightsize these programs."}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "They  denied food assistance for hungry families."}, {"senator": "Chip Roy", "party": "Republican", "sentence": "At the  same time that prices are going up, they are slashing food assistance."}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Among the  findings were error rates when it comes to food assistance benefits  that could cost a loss of $2.5 billion in Federal funds."}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "Food assistance  provided by the United States leads to greater stability in regions of  the world important to America's strategic interests."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Senate Republicans have voted 13 times to fulling fund  government including food assistance."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "President, on Thursday, I sounded the alarm as the  lapse in government funding endangered food assistance for 42 million  Americans and rapidly approached."}, {"senator": "Tom Cole", "party": "Republican", "sentence": "The pain has been all too real for far too  many Americans, including families struggling without paychecks,  seniors on the brink of hunger with food assistance lapsed, airports in  chaos, and communities bracing as programs that they rely on were  stalled or stopped altogether."}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "They claim this budget slashes food assistance."}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "Across the board, the  State is at risk of losing billions to fraud in food assistance,  unemployment benefits, and in the State's Medicaid Program."}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Democrats knew their actions threatened food assistance."}]