[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…any other State in the Nation. As much as I may  love that authority, that does not exist.\n\nBut, yes, over a dozen other States have voluntarily followed in  California's footsteps, not because they were forced to, but because  they chose to in order to protect their constituents, their residents,  and protect our planet.\n\nAnd the truth is, they do…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Peter Marks, who is one of the heroes  of Operation Warp Speed and one of the lead scientists at the FDA.  There are hundreds of others, unfortunately, following in their  footsteps.\n\nTo shed light on this issue, for example, this last March, together  with my colleague,  Don Beyer, I led 37 House Members in a letter to  the Trump administration expressing…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…and community trust that has fostered safer  and healthier communities, trust that is based on good science. It is  careless and dangerous, but he continues to follow in the footsteps of  the President and create false narratives to spread fear and distrust.\n\nThis anti-vaccine mission he is on is going to prevent families and  children from getting the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695621/vaccines-protect-our-communities"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…that future generations  can learn from mistakes of the previous. That is why it is important to  recognize educators like Ed Donnellan and encourage others to follow in  his footsteps.\n\nMr. Speaker, please join me in honoring Ed Donnellan and wish him  continued success in educating students on America's past.", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691693/recognizing-edward-l-donnellan-jr-as-the-winner-of-the-2025-mary-k-bonstell-teacher-of-the-year-award"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…to  the safety and security of all Americans. Today, his legacy lives on  through the Black family, with their daughter, Corporal Are'wynn Black,  following in her parents' footsteps in the Marine Corps.\n\nOn behalf of a grateful Nation, I offer my deepest thanks and best  wishes to Sergeant Major Troy Black, to 1st Sergeant Major Stacie  Black, and to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694958/recognizing-the-retirement-of-sergeant-major-troy-e-black"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…encouragement  and support needed to succeed. Her historic appointment as the first  woman to lead a school as principal paved the way for generations of  women to follow in her footsteps, serving as a beacon of progress and  possibility.\n\nMrs. Benton's leadership extended beyond the classroom. She  championed innovation in education, built meaningful partnerships…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695981/recognizing-mrs-shirley-knox-benton"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Antoinette Brown Blackwell not just  for what she achieved but for the path she paved for generations to  follow.\n\nLet us honor her on her 200th birthday and follow in her footsteps as  we fight to protect every American's right to vote.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691473/antoinette-brown-blackwell"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…partisan weapon, if Israel is used as a partisan  weapon, it is bad for Jews and it is bad for Israel.\n\nI urge my other Republican colleagues to follow in Mr. Van Drew's  footsteps here because if they do care about Jews and they do care  about Israel, then neither should be used as a partisan weapon in a  political game.\n\nMr. Speaker, I thank Mr. Van…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692173/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…and our staffs.  James consistently fought alongside Gerry for the people of Virginia's  11th Congressional District.\n\nIn 2019, he followed in his political mentor and boss' footsteps and  was elected to serve on the Fairfax County Board of Supervisors,  representing the Braddock district, where he has continued to be a  powerful advocate for his community.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695220/welcoming-the-honorable-james-walkinshaw-to-the-house-of-representatives"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…General Lopez's service is beyond worthy of recognition by Congress.  He represents the best of our servicemembers, and his leadership will  inspire others to continue in his footsteps for years and decades to  come, serving our Nation and the military families of the central  coast.\n\nMr. Speaker, I ask my colleagues to join me in recognizing and  thanking…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697745/brigadier-general-frederick-r-lopez-post-office-building"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…of the Supreme Court: Judge Ketanji Brown Jackson.\n\nJustice Jackson's confirmation shattered the glass ceiling and paved  the way for future women of color to follow in her footsteps. Her name  will be remembered in history for generations to come.\n\nWhen the Supreme Court first met in the Capitol Building in February  of 1801, there were a million slaves…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689666/justice-ketanji-brown-jackson"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…scant signs that either government is  interested in extending it.\n\nPresident Donald Trump can and should take forward steps on nuclear  arms control. He can follow in the footsteps of other Republican  Presidents. President Eisenhower, in his ``Atoms for Peace'' speech,  expressed the moral imperative to warn Americans and the  world of the destructiveness…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…to the work of  leaders on the ground and Black America. I am grateful for all those  who have paved the path of progress for me and all future leaders to  follow in their footsteps.\n\nMr. Speaker, we face extraordinary and unprecedented challenges in  this moment, but this month and always, we will celebrate the strength  of America's diversity, the…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687898/black-history-month"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…with the Saudis to dollar denominate all its oil revenue  trades, bringing enormous financial benefit to the U.S. financial  markets. Moreover, it is important to follow the footsteps of Richard  ``Dick'' Cheney, then Secretary of Defense, and late Vice President  during the George Bush II Presidency from 2001 to 2009. When he left  his position as U.S.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…and compassion. She always  took the time to learn everything she could about her employees and was  a conscientious friend and mentor to many who aspired to follow in her  footsteps. She was also a fierce advocate for women's equality in the  workplace and in society. She credited her mother and grandmother for  encouraging her and her sister to pursue…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689506/recognizing-the-life-and-legacy-of-sepi-saidi"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…community. Along with  Congressman Latimer, we now represent portions of the district she once  served. I know I speak for George in saying that we are proud to follow  in her footsteps.\n\nHer commitment to bipartisanship is something I have tried to carry  forward in her honor. Nita knew that real solutions come from working  across the aisle, and her ability…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689209/in-memory-of-the-honorable-nita-m-lowey"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Nation's  values.\n\nDelman answered the call to service when he enlisted in the United  States Army in March 1989, right out of high school. He followed in his  older brothers' footsteps, one serving as a Military Police Officer and  the other as a Combat Engineer. He entered as a Delta 19, which meant  riding motorcycles. He served in the Scout Platoon,…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696279/recognizing-delman-leon-orme-with-a-congressional-veteran-commendation"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…Nationals in the fifth round of  the 2025 MLB Draft. Known across North Carolina for his power at the  plate and his elite play at shortstop, Coy is a force.\n\nHe follows in the footsteps of other Davie County stars, including  Carson Whisenhunt, drafted a few years ago out of East Carolina by the  San Francisco Giants and three-time MLB All-Star Whit Merrifield,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693987/recognizing-coy-james-and-davie-countys-baseball-legacy"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…again, I thank my colleague, Bonnie Watson Coleman,  for working with me on this piece of legislation. I urge my colleagues  to vote for this initiative and to follow in the footsteps of our  predecessors in the 68th Congress in 1926 who set an example that will  last for generations to come.", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699869/for-americas-250th-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…grace and conviction, never backing down from a  challenge, and always striving to make a difference for those she  served. It is for me a profound honor to follow in her footsteps.\n\nHer legacy is one of faith, courage, and love, and the highlight of  her life was her husband, Jason, and her family. These descriptions are  all fitting for a woman whose…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689230/moment-of-silence-in-remembrance-of-the-honorable-mia-love"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Mr. HARIDOPOLOS. Mr. Speaker, on May 10, 2025, the Fourteenth Annual  Footsteps in the Sand Kidney Walk took place in Cocoa Beach.\n\nThis event this year raised $22,000 for kidney patients in need.\n\nToday, I rise to honor the memory of those individuals…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691332/fourteenth-annual-footprints-in-the-sand-kidney-walk"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…upholding the  principles of dedication, diligence, and service.\n\nComing from a family with a deep-rooted tradition in the Postal  Service, Joseph was honored to follow in the footsteps of his father,  Joseph, and his two brothers, Paul and Jeff. His career was defined by  an unwavering commitment to his duties, demonstrating an exemplary work  ethic that…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688925/recognizing-joseph-bongarzones-retirement-with-the-united-states-postal-service-after-37-years"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…Commission, and an  advisory board member of the Tennessee Public Service Commission.\n\nReverend Middlebrook was a loving father to his three children, two  of whom followed his footsteps to work in public service.\n\nMr. Speaker, I encourage my colleagues to support this bill, and I  reserve the balance of my time.\n\nMr. Speaker, I encourage my House colleagues…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697619/reverend-harold-middlebrook-post-office-building"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…Tennessee Public Service Commission.\n\nBeyond his leadership, Reverend Middlebrook is a loving father to  three children, as was stated earlier, two of whom followed in his  footsteps to work in public service.\n\nReverend Middlebrook spent his life befriending and mentoring folks  in our community. Many friends of mine and I have sought his counsel.  Just…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697620/reverend-harold-middlebrook-post-office-building"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…rise today to honor Jay Burke  III, the Grand Marshal of the 201st Savannah St. Patrick's Day Parade.\n\nThis prestigious role is made even more special as Jay follows in the  footsteps of his father, James F. ``Jimmy'' Burke, Jr., who led the  same parade 28 years ago in 1997.\n\nTheir legacy is a testament to the deep tradition of this event, one  of America's…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688723/patricks-day-parade"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…have made significant progress when it comes to  each of those 10 items.\n\nWhen it comes to EV mandates, just about a week and a half ago, the  Senate followed in the House's footsteps and passed my resolution to  overturn Gavin Newsom's ban on gas-powered vehicles.\n\nAny day now, President Trump will sign my resolution into law and  Gavin Newsom's unworkable…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…Congresswoman Adelita Grijalva.\n\nCongresswoman Grijalva has concentrated her career on issues  advocating for students and supporting families.\n\nAs she follows in her late father's footsteps--and, boy, those are  some footsteps, especially with those bolo ties, wow--I have no doubt  she will bring to the Halls of Congress the same energy that has  defined her…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696710/welcoming-the-honorable-adelita-s-grijalva-to-the-house-of-representatives"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…dedication not only to the land but to the  family. After serving our Nation in the Air Force during the Vietnam  war, Jeff returned home to carry on the farm. He followed in the  footsteps of his father, who took over the farm at the age of 13. Now,  four generations later, Jeff farms alongside his sons, Jeb and Pete.\n\nJeff has truly been an innovator in the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695599/recognizing-jeff-wilson"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…team spirit are invaluable, and their  years of unwavering service and dedication set an example for their  colleagues and raise the bar for those who will follow in their  footsteps. I applaud all our honorees, and I am proud to stand before  you and our great Nation on their behalf to recognize the importance of  their public service.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698362/recognizing-employees-of-the-us-house-of-representatives-who-have-reached-25-years-of-service"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…stationed with Army Special  Forces, General Rasch's connection to the military began early in life.  He graduated from the University of Georgia and followed his father's  footsteps, joining the Army as a second lieutenant in 1989.\n\nHis military journey also led him to his wife, Shawndell Mann, a  fellow soldier he met while in Alaska. Together, they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695727/congratulating-lieutenant-general-robert-a-rasch-jr"}]