[{"senator": "Adam Gray", "party": "Democrat", "sentence": "…its ``UC Merced 2020 Project'' which was the largest social- infrastructure public-private partnership in U.S. higher education at  the time. This project doubled the campus footprint, adding new  classrooms, research labs, housing, student wellness facilities,  recreation and more. Eleven UC Merced 2020 project buildings earned  LEED platinum certifications.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695846/recognizing-the-university-of-california-merced"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…agents and send them home. And they did that in the number of a couple  hundred. And now they are bringing home the remaining Metro Surge ICE  agents to get to the original footprint.\n\nBut ICE withdrawing from Minnesota is just the beginning. We need  accountability for the lives lost and the extraordinary abuse of power  in the hands of these agents.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…are investments for nearly 300 construction projects, including  new family housing construction and child development centers.\n\nThere are also investments to bolster our footprint in the Pacific  and support our NATO projects. These are incredibly important to our  soldiers, to our veterans, and to our national security.\n\nNo doubt there is more I would…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694203/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…program has served as a  model for neighborhoods nationwide, empowering residents and their  communities to adopt more sustainable lifestyles and reduce their  ecological footprint.\n\nThe All-America City award from the National Civic League recognizes  outstanding communities that leverage civic engagement, collaboration,  inclusiveness, and innovation…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694723/recognizing-the-city-of-lakewood"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…requires lots  of energy. The firm has been working for years to maintain  competitiveness in a terrible international glass environment while  reducing its environmental footprint.\n\nMaking glass requires huge amounts of power, as I said, and the  funding Libbey was awarded would have helped it transition to more  powerful glass furnaces with cleaner…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691905/department-of-energy-project-cancelations"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…engineering, drilling, and  maintenance; and lower energy costs for industry, public facilities,  neighborhoods, and all kinds of companies.\n\nGeothermal energy has a small land footprint. It can even be co- located with other renewables or energy-hungry data centers, which so  need it.\n\nIf we are serious about building a resilient energy-independent  future,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…existing cemeteries.\n\nLocated in eastern Arizona, the communities in Pinedale and Alpine  are surrounded by the Apache-Sitgreaves National Forest. Given the  large Federal footprint, both communities have struggled to expand  their respective cemeteries, which are currently located on U.S. Forest  Service land and operated under a special use permit.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691144/apache-county-and-navajo-county-conveyance-act-of-2025"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…support of H.R. 3062, the Promoting  Cross-Border Energy Infrastructure Act.\n\nMr. Speaker, our hardworking energy developers need a clear framework  to expand America's energy footprint, not more bureaucracy and  uncertainty.\n\nMy colleague talked about energy prices. Well, just look at the gas  pump. I mean, the gas pump is down substantially.\n\nHere is the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695690/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…prepared for  real-world missions in the high north. There is simply no substitute  for the terrain and conditions Alaska provides.\n\nThis legislation does not expand the military footprint or limit  public access beyond what is already established. Importantly, this  bill does not bypass environmental review. In fact, the military has  engaged in robust consultation…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697634/public-lands-military-readiness-act-of-2025"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…The U.S. Coast Guard is fundamental in protecting our border and  domestic security. This bill boosts funding for the Coast Guard and  provides funding to counter China's footprint in the Indo-Pacific.\n\nLastly, as a member of the Select Committee on the CCP, the Chinese  Communist Party, I am pleased to see this bill refocuses the  Cybersecurity and…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699356/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…systems via an application programming       interface or another reporting mechanisms;\n\n(ix) allow for the submission of geospatial data associated       with project location, footprint, and impact;\n\n(x) support automatic documentation of submission and       process timelines; and\n\n(xi) allow the following metrics to be tracked over time--\n\n(I) estimates…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…devoted to private-sector growth in Latin America. Empowering  the IDB Invest helps expand opportunities for U.S. businesses and  strengthens their economic partnership and footprint in Latin America  and counters growing influence from our global competitors.\n\nWe cannot overlook also, Mr. Chairman, the importance of adequate  funding for the Securities…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699048/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…been widely deployed in a number of cities  across the country.\n\nIn California, Waymo has been operating for years now in San  Francisco and in Los Angeles, and now their footprint is actually about  to expand to the wine country and even into the Sacramento area. They  may even be coming to Washington, D.C., soon.\n\nTesla has a self-driving feature…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Jay's entrepreneurial resume, which is legendary in Alaska, began  in 1986 at the tender age of 22 years old when he started a chicken  wing restaurant, expanding his business footprint to other eateries  across Fairbanks and, eventually, purchasing the iconic Fairbanks  landmark called Pike's Landing.\n\nFor anyone going to Fairbanks, you have got to stay…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…electricity? Because they aimed  everything at electricity. There was a war on our gas industry, or  fossil fuel industry, and that is the very industry that reduced our  carbon footprint by 1,400 tons. The nearest nation to us is 200 tons.\n\nMr. Speaker, they are trying to put the very people who put us in  this position out of business.\n\nThe Home Appliance…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700167/dont-mess-with-my-home-appliances-act"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…lab-grown meat over domestic beef or poultry rewards the  government-funded bioindustry and punishes the American cattle ranchers  who have a far smaller so-called carbon footprint than these big  corporations.\n\nIn 2024, Florida and Alabama banned lab-grown meat to protect farmers  and the cattle industry. This year, Mississippi, Montana, and Indiana…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693694/department-of-defense-appropriations-act-2026"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…carry astronauts deeper into space than ever before, including the  planned missions to the Moon under the Artemis program and eventually  to Mars.\n\nThe combined economic footprint of Utah's space-related businesses,  along with those in the aerospace, defense, and advanced materials  sectors, already account for 20 percent of our annual GDP, and the…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687925/space-dominance"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…operate in the Arctic while       maintaining the highest standards of safety and environmental       sensitivity. New advances in technology have greatly reduced       the footprint of development, allowing for greater       consolidation of facilities and the preservation of more       acreage within development zones for wildlife habitat. For…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…that our economy can grow and so that people can  create wealth for themselves and their families and their  beneficiaries. We are talking about reducing the government's footprint  so that the magic of American innovation can take place, unstifled by  unnecessary regulations.\n\nThis bill will allow America to return to being the land of  opportunity,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…the biggest impacts  on the environment and what the future holds, actually, the No. 1  predictor is the world economy--that if we have a strong world economy,  the carbon footprint is going to be less. So we think about: Well, why  is that? And we should answer the question: Why is that so? If there is  a strong world economy, then the infrastructure…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698992/unanimous-consent-request-s-res-550"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…disapprove this  Record of Decision and prevent this circumvention of Federal law from  happening again.\n\nAlaska has a strong record of responsible resource development. The  footprint of drilling pads on the North Slope has declined by 80  percent since the 1970s, while new and safer technology has expanded  the reach of underground drilling by a significant…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}]