[{"senator": "Lou Correa", "party": "Democrat", "sentence": "…Anaheim and to Anaheim High School.\n\nAt St. Boniface, where we both attend, he helped found the Orange  County Congregation Community.\n\nWe are both diehard Anaheim High School football fans, and at  Anaheim, he served as a sports team manager. Upon graduation, Jimmy  joined the football booster club and took over as president in 1976,  and he has held that…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693460/congratulating-kendall-pierson"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Mr. MORELLE. Mr. Speaker, I rise today to celebrate the Monroe Red  Jackets high school football team, led by Coach Terrell Cunningham and  New York State Gatorade Player of the Year Messiah Hampton, who made  history as the first-ever Rochester City School District Class…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698991/congratulating-monroe-red-jackets"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…at Camp Minisink, a camp for African-American youth in  New York City.\n\nLynne met her husband of 47 years, William O. Wagstaff, Jr., at  Central State. He was a Kappa and a football player, two criteria she  later joked were on her checklist for potential mates in college. They  were married on August 5, 1978, and purchased their first home in Mount…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695505/recognizing-the-life-of-millie-ortiz-sheehan"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…healthcare practitioners setting up shop there or staying there.\n\nI don't care who you are. I come from Alabama, we treat Nick Sabin,  and rightfully so, as the greatest college football coach of all time,  but I can tell you one thing about this: Nick Sabin could not close a  recruiting pitch to a business to come relocate in a county that does  not have…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690245/health-disparities-in-minority-communities"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "Mr. CARTER of Louisiana. Mr. Speaker, I rise today to humbly honor  and celebrate the heroic accomplishment of the Saint Augustine High  School 1975 Football Team, proudly located in Louisiana's 2nd  Congressional District, of which I represent in Louisiana.\n\nFrom 1951, its first year as a Catholic high school in New Orleans,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695287/recognizing-the-50th-anniversary-of-an-historic-athletic-achievement-in-the-history-of-the-louisiana-high-school-athletic-association-lhsaa"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…its motto ``learn by doing''.\n\nIn the past 125 years Cal Poly SLO has educated more than 230,000  individuals who have gone on to be everything from astronauts to iconic  football players, and even world-famous musicians.\n\nThe university's partnerships with local communities, industry and  government exemplify the vital role public higher education…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699776/recognizing-the-california-polytechnic-state-university-san-luis-obispo"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…championship for South El Monte.\n\nMr. Speaker, I congratulate the Lady Eagles volleyball team on this  historic achievement.                     El Monte High School Eagles Football\n\nMr. CISNEROS. Mr. Speaker, I rise today to recognize the amazing  victory of the South El Monte High School Eagles football team in the  2025 CIF Division 14 championship…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697339/congratulations-to-the-lady-eagles-volleyball-team"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Parliamentarian is vulnerable to the political power of this  body. This body can overrule the Parliamentarian. The majority can do  it with a simple 51 votes.\n\nImagine a football game in which one team has more players than the  other. One team commits a foul. The ref blows a whistle on the foul  that the majority team committed, and the majority team…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…argument is about universal access. For years, the  Republican leadership in this institution has attempted to avert this  very moment. For us this is not to be about spiking the football. This  is not to be about an end-zone dance. This is about to declare a major  victory for the American people.\n\nDespite what I have heard, they have used every maneuver and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698788/breaking-the-gridlock-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…to hundreds of volunteers and donations, thousands of Orange  County families had a Thanksgiving dinner with their families.                Recognizing Anaheim High's Flag Football Team\n\nMr. CORREA. Mr. Speaker, I rise today to celebrate the Anaheim High  School girls' flag football championship win.\n\nEarlier this month, the Anaheim girls' flag football…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697343/recognizing-thanksgiving-food-drives"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "Ms. STEVENS. Mr. Speaker, after Monday's college football national  championship, I rise to express my concern about the trend of private  equity firms attempting to buy up college sports. These deals will be  bad for athletes, students,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699263/college-sports"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "Mr. MULLIN. Mr. Speaker, I rise to congratulate the College of San  Mateo's football team, the Bulldogs, on becoming back-to-back  champions. Their dramatic 28-27 victory in the California Community  College Athletic Association Championship was their impressive…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699641/congratulating-college-of-san-mateos-football-team"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "Mr. CLYBURN. Mr. Speaker, I rise a proud South Carolina State  University alumnus to congratulate its football team on their new  title, the 2025 HBCU national champions. The Bulldogs erased a 21-point  half-time deficit, scoring three touchdowns in the third quarter to win  the Cricket…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699194/south-carolina-state-university-football-team-2025-hbcu-national-champions"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…have excelled across a wide range of fields: In  band, in chorus, and in orchestra, on the stage and in the art room.  They brought home a golf State championship and led the football team  all the way to the State championship game.\n\nThey left their mark on Kettle Run, and I look forward to watching  all that they will accomplish in the future.\n\nI congratulate…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691978/recognizing-fauquier-high-school-class-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…was affectionately known as the ``Dean'' of the senate.\n\nI first met Donny as a young man when we both attended La Salle  Academy in Providence, RI. We played high school football together, and  indeed he was a remarkable gentleman then, both on and off the field.  One of the things we discovered is that--Donny was about 6 feet 2  inches. He was a wide…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691451/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…just happens to be in my district, became Super  Bowl stars. Mike and Maria also attended the University of Georgia  together where they began their respective careers as a football coach  and a sports broadcaster.\n\nOn Sunday, Mike coached his team to a convincing 29-13 victory, and  Maria made history as the first Black woman to ever host the Super Bowl…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699950/recognizing-mike-macdonald-and-maria-taylor"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…kicks and dramatic momentum swings to a fourth-quarter  comeback and the first overtime finish in FCS title game history, this  contest delivered everything that makes college football unforgettable.\n\nThis win marked Montana State's first national championship in 41  years, ending a drought that stretched back to 1984. With Montana  programs reaching the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698834/congratulating-montana-state-university-bobcats"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…integrity, mentoring officers and  strengthening public safety to ensure that his community remained safe.\n\nBilly's impact, Mr. Speaker, stretched far beyond the badge. He  played football for the Fernandina Beach Pirates and went on to play  for Newberry College. When he returned home, he constantly coached for  Babe Ruth baseball and Pop Warner football, and…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691576/recognizing-alhambra-theater-dining"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "Mr. ROGERS of Alabama. Mr. Speaker, I rise today to recognize the  Coosa Christian School football team for winning the Alabama High  School Athletic Association (AHSAA) 2A State Championship.\n\nAt Protective Stadium in Birmingham, Alabama, on December 5, 2025,  the Coosa…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697936/recognizing-coosa-christian-school-for-winning-the-ahsaa-class-2a-state-championship-in-football"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school football  team in Ohio's 5th Congressional District. The young men of the Avon  High School football team have represented their school ably on their  way to achieving the Division…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698001/recognizing-avon-high-school-on-winning-the-division-ii-state-football-championship"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…Montana. He arranged the preconstruction  meetings, organized the delivery of the supplies, and was even able to  get a price reduction to save money. He then rallied his football team  and his troop to replace the wall, completing the job in 20 hours and  placing over 600 cinder blocks.\n\nColter has made his country and his State proud. We thank Colter…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689243/recognizing-eagle-scout-colter-lumley"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…drum major leads the band  through warm-ups and performances.\n\nSince 1977, it has been a tradition for the drum major to do a front  flip as the band enters the field at home football games. Ellie  continues this tradition.\n\nAs any visitor to Beaver Stadium can attest, the Blue Band plays a  central role in Penn State's game day and represents the highest…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696938/congratulating-ellie-sheehan"}, {"senator": "David Taylor", "party": "Republican", "sentence": "Mr. TAYLOR. Mr. Speaker, I rise today to recognize the Ironton  Fighting Tigers for winning their first football State championship in  35 years.\n\nWith an incredibly strong work ethic and a commitment to excellence,  the Ironton High School football team spent all season training and…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689087/congratulating-ironton-fighting-tigers"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…visits in Washington, D.C. We are grateful for her  service with our team and wish her success as she returns to the Great  State of Iowa, and all the victories Iowa State football can provide  her.\n\nThe distinctive accomplishments of Nicole's service reflect well upon  herself, the people of Iowa, and the United States.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688151/recognizing-nicole-schmitt"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…and Vice President of a local  veterans' resource center. She is an active member of her local honor  guard, where she performs live taps at services and provides honors at  football games, ceremonies, and parades, ensuring that the sacrifices  of our service members are remembered with dignity and respect.\n\nToday, she serves as a Veteran Service Officer…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700088/recognizing-united-states-navy-petty-officer-second-class-katrina-gramer"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…efforts are supported through Easter egg hunts, 5K races, broom  sales, and food stands at the Manheim Farm Show. This does not include  past traditions like car shows at the football field and plastic boat  races on the creek. Ultimately, the money raised within the community  is reinvested back into the community.\n\nThe Manheim Lions are currently led…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696418/recognizing-100-years-of-the-manheim-lions-club"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…focus on getting back to  church, getting our Nation, our families, and our communities back to  church. Would that this Sunday everybody that is going to be at a  National Football League game or parked in front of a TV watching an  NFL game, would that every single American doing that would be in  church with devices off, TVs off, having supper with…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "Mr. KENNEDY of Utah. Mr. Speaker, today I rise to congratulate both  the Corner Canyon and the Lone Peak High School football teams who  recently faced off in the Utah 6A State Championship. Their matchup  showcased exactly what Utah embodies: determination, grit, and  exceptional spirit.\n\nCorner…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697704/congratulating-corner-canyon-and-lone-peak-high-school-football-teams"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "Mrs. HOUCHIN. Mr. Speaker, today I rise in recognition of the 15-0  Indiana University football team for their historic season, winning the  Rose Bowl, then the Peach Bowl, and now advancing to the College  Football Playoff National Championship.\n\nThis team rose to the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698931/recognizing-indiana-university-football-team"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…and  congratulations on the Lasker Award.\n\nCongratulating Kirk Ferentz, the Big Ten's Winningest Coach\n\nMrs. MILLER-MEEKS. Mr. Speaker, I rise today to congratulate Iowa  football coach Kirk Ferentz for becoming the Big Ten's all-time  winningest coach.\n\nWith the Iowa Hawkeyes 47-7 win over UMass Minutemen on September 13,  Coach Kirk Ferentz broke…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695572/congratulating-dr-michael-welsh"}]