[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…negotiate  these 15 and then pick 15 more and 15 more. Imagine how much money we  can save, not just for the seniors--that is obvious--but also for the  taxpayers because  we are footing part of this bill. And then, ultimately, it will bring  down drug prices, like they have in other countries.\n\nBut firing the men and women who carry out these price negotiations…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…sending in the National Guard and militarizing soldiers against  citizens in those cities and States. They are right here at Union  Station in Washington, D.C. The taxpayers are footing a million dollars  a day for these National Guard members to pick up trash. They are doing  the job that sanitation workers would be doing in the District of  Columbia.\n\nWe…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…that feeds  40 million Americans and delivers billions in revenue back to the farm  country.\n\nWorking families in urban, suburban, and rural communities across  America are footing the bill for Trump's chaos.\n\nThe bottom line is that Trump's broken economy isn't working for  anyone.", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690373/first-100-days"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…most. It will be American small  businesses that are burdened. It will be American consumers that are  harmed. At the end of the day, it will be the American people who are  footing the bill for the Trump tariffs.\n\nWhen we talk about American people, let's be clear. This is the  middle class. These are working-class, hard-working people who will be  impacted.…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689471/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…those who believe a select group of  Senators have the right to profit from being caught up in a legitimate  criminal investigation, and they are OK with American taxpayers footing  the bill.\n\nThey have claimed that this provision was never meant to enrich  Senators, but the reality is, there is nothing in the law to prevent  that from actually happening.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699110/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…reliability.  Americans can see through the nonsense here to the truth, and that is  that Republicans are waging a culture war against wind and solar.  American families are footing the bill with higher monthly utility  bills.\n\nFor a moment, I want to try to take Republicans at their word, that  this bill is all about electric reliability, ensuring that…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…engagement  in Asia. Recognizing its diplomatic status here in the United States  shows our commitment to the region's future and to working with our  Asian partners on equal footing.\n\nSecond, the Western Hemisphere, of which we are a part, is obviously  incredibly important to the United States. CARICOM, the Caribbean  Community, plays a crucial role…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694823/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…big drop in score has not allowed me to get my own       place. I'm not able to continue to pursue my dream of being a       voice actor due to not having proper financial footing to get       back to school. I can't travel and do things I would like to       do. I am working, but things are very financially tight. The       medicine I need is being…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…organizations like the Foster and Adoptive Care  Coalition do every day, and it is what Annie Malone has done for  generations, helping young people aging out of the system find their  footing.\n\nAs we celebrate with the people we love, I hope we also think about  how we can help others. That is how we make this season matter.\n\nMadam Speaker, I wish St. Louis happy…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698411/recognizing-annie-malone-and-foster-and-adoptive-care-coalition-in-st-louis"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…NOAA's funding by more than 25 percent, to decimate  the Office of Oceanic and Atmospheric Research would, as the former  director of that office said, take our scientific footing back to the  1950s. Their mission is to develop the best possible science to save  lives and property in a changing climate. To cut it is not fiscally  conservative, it is…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691327/noaa-contributes-to-our-economy-and-well-being"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…those who  can least afford it and delivered to those who need it least. Talk  about corporate welfare.\n\nWhile the rich will get their tax cut, working families will be stuck  footing the bill for Trump's tariffs. It is not too late for  Republicans to change course. I pray that enough of them find the  courage to push back against this plan, to listen…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Republicans colleagues, will make gas  prices go up for families and businesses.\n\nOur law was a reasonable, commonsense, and a carefully tailored  safeguard to prevent consumers from footing the bill of Big Oil's  methane waste, paired with Federal funding to help big oil companies  reduce their waste.\n\nReducing methane waste in the atmosphere saves consumers…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688145/methane"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…controllers worked without pay, Senators  gave themselves the ability to sue for at least $500,000 if their  electronic records were seized.\n\nAmerican taxpayers should not be footing the bill for this Republican  windfall provision. I am proud of my House colleagues for acting  quickly to address this dishonest and embarrassing display.\n\nI will be voting…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696864/calling-for-quick-action"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…across  the country are paying the price, and parents are torn from their  children, leaving households and communities economically devastated.  Taxpayers in this country are footing the bill for a system not  designed to keep us safe, but to funnel money into the pockets of a  powerful few.\n\nIt does not have to be this way. We can invest in alternatives…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697457/fighting-dhs-immigration-raids"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…administration.\n\nIf our goal is to stop offshoring and revitalize American  manufacturing, why are we punishing the companies that are driving  innovation, the ones who are footing the bill?\n\nEarthQuaker Devices isn't some multinational conglomerate dodging  taxes and hiding profits offshore. They are a small business that  turned a passion for music…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691573/earthquaker-devices-sounds-the-alarm"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…grown more than 35 times larger since  the end of the Chinese Civil War. The island has crucial insights to  offer an institution that seeks to put its borrowers on stable footing.  It is long overdue for Taiwan to receive the recognition and  representation it rightfully deserves at the IMF.\n\nMr. Speaker, I urge all my colleagues to join me in supporting…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…waited months just to hear back about their  applications. It is absolutely shameful.\n\nMy constituents were patching their roofs and clearing debris by  hand. FEMA was busy footing the bill for nice hotel stays in New York  for folks who weren't even supposed to be in the country. This was a  willful effort by the other side to just enable this border…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…families during training, combat, and even periods of transition.\n\nMadam Chair, this is a strong mark that sends a forceful signal of  change. It places our military on a secure footing and, if necessary,  enables it to win decisively in conflict.\n\nI also thank Chairman Rogers and Ranking Member Smith for their  steadfast support in passing this bill, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695145/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…important to be here today to express my support for S. 269,  the Ending Improper Payments to Deceased People Act. It is commonsense  legislation that taxpayers should not be footing the bill for people  who are deceased.\n\nThe purpose of this legislation is to permanently authorize the  Social Security Administration to share its full Death Master File…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698921/ending-improper-payments-to-deceased-people-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…often remaining enrolled despite missing or falsified information.\n\nIn 2023, $21 billion in subsidies were paid out with no evidence of  tax reconciliation. Taxpayers were left footing the bill, as reused  Social Security numbers, subsidies paid on behalf of deceased  individuals, and billions in unreconciled payments expose a system  unable to protect public…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698431/republicans-have-delivered-in-2025"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…expenditure of these is  wrong. Now is the time we face it and put a stop to these. This is just  the first step in a long stairway to get this country back on a firm  financial footing.\n\nMr. Chair, I yield back the balance of my time.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699289/amendment-no-1-offered-by-mr-massie"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…have a balanced budget  resolution, to have a commitment to enforceable spending reduction  targets that would bring the debt to GDP down and put our Nation on  good fiscal footing and a sustainable path.\n\nMr. Speaker, I urge my colleagues today to demand that the House  budget resolution and that our fiscal framework with our budget targets  guide the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…wind and solar. The  result is interconnection queues flooded with projects that only have a  5 percent completion rate.\n\nMeanwhile, Democrat policies have left ratepayers footing the bill  for two grids. One grid props up wind and solar with massive  transmission costs. The other is the backup power we all rely on when  the Sun is not shining and the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…on  the open market.\n\nWAPA makes these purchases using the Basin Fund, which is funded by  hydropower revenues, not appropriations. In other words, utility  customers end up footing the very expensive bill to address the impacts  of predatory smallmouth bass.\n\nThe loss in revenues not only means higher electricity prices but  also negative impacts on…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691060/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…continued to see in our education system. It will give families  the opportunities that they deserve and that they are entitled to. It  will put our country on much stronger footing for generations to come.                       congratulating tahoe yacht club\n\nMr. KILEY of California. Mr. Speaker, I rise today to congratulate  the Tahoe Yacht Club as…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…President Trump call it one big, beautiful bill? It is  because it does a lot of critically important things all in one  resolution that helps get this country back on a strong footing.\n\nWhat else it does is it produces incredibly needed savings, Mr.  Speaker, savings that the American taxpayers want, as well. They want  their tax dollars being spent better.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Federal housing agencies to  maximize the impact of our current Federal housing programs.\n\nH.R. 6644 is a critical step toward putting our housing sector back  on the right footing, and I urge my colleagues to join me in support.\n\nMr. HILL of Arkansas. Mr. Speaker, Mr. Rose certainly talked about  cost savings due to the deregulatory nature of this bill,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…timely filing is impractical.\n\nThe U.S. Tax Court is the only venue where taxpayers can dispute a  tax estimate without first paying that tax. Taxpayers must stand on  equal footing when going toe-to-toe with the IRS. Without the guarantee  of rights, taxpayers are put in a situation where the  IRS is essentially saying: Heads, I win. Tails, you lose.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697269/tax-court-improvement-act"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…That will get us a lot more building.\n\nYoung families who want to buy a home will be able to, thanks to  historic savings that will put our country on a stronger financial  footing.\n\nPregnant women, children, seniors, single mothers, the disabled, and  the low-income Americans among us receiving Medicaid and SNAP will have  the peace of mind of knowing…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…percent rate. Often remaining enrolled despite missing or falsified  documentation, these ObamaCare subsidies continued for these fraudulent  applications. Taxpayers are left footing the bill as reused Social  Security numbers, subsidies paid on behalf of deceased individuals, and  billions in unreconciled payments expose a system unable to protect  public…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698804/breaking-the-gridlock-act"}]