[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Senator yield for a question?\n\nMr. SCHIFF. I thank the Senator for yielding.\n\nI just watched footage of our colleague--my California colleague-- Senator Alex Padilla, being forcibly removed from a briefing by the  Secretary of Homeland Security's staff. He went there to observe and to  ask questions, and I watched with horror on this video, seeing these…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692501/alex-padilla"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…enabling Russia's plans to carve up Ukraine, a catastrophic  decision that will only encourage future aggression and pain for  innocent civilians.\n\nHe has even threatened to forcibly annex Greenland from our ally  Denmark.\n\nAnd, earlier this month, the Trump administration released its new  National Security Strategy.\n\nAnd some folks may wonder: What is…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…this heinous  crime.\n\nThese steps are vital to address the forcible harvesting of organs, a  grave violation of human rights and bodily autonomy. The PRC has been  accused of forcibly harvesting organs from victims who range from  prisoners of conscience, including religious and spiritual adherents,  to ethnic minorities. Shining a spotlight on these crimes…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690646/falun-gong-protection-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the D.C.  National Guard was not deployed to the Capitol for several hours,  likely costing lives and prolonging the attack. At Lafayette Square,  the D.C. National Guard forcibly removed peaceful protestors.  Currently, the D.C. National Guard is deployed in D.C. in response to a  crime emergency declared by President Trump.\n\nNot only does presidential…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694829/introduction-of-the-district-of-columbia-national-guard-home-rule-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…it is a threat to the due process rights of  everyone in this Nation.\n\nInjustice anywhere is a threat to justice everywhere.\n\nUnderstand what we saw today: A U.S. Senator forcibly removed from a  room in a Federal building--a Federal official forcibly removed from a  Federal building after he identified himself as a U.S. Senator. But  after he was out…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692454/alex-padilla"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…both  sides of this aisle about this horrendous incident that occurred.\n\nWe are a democracy, but we can lose that democracy. It can be gone  unless all of us speak out and forcibly reject what happened to a U.S.  Senator and to send the message that in this democracy it is just, it  is right, it is part of our responsibility to speak up, to ask  questions,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692471/alex-padilla"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…the  border while Palestinian families starve.\n\nInstead of agreeing to a cease-fire, war criminal Netanyahu is now  preparing a full-scale assault to ethnically cleanse and forcibly expel  the entire Palestinian population from Gaza and to flatten and  permanently occupy the land. This was always their plan. He said it  himself.\n\nIsraeli forces have killed…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691384/the-nakba-never-ended"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…States will not stand by while hunger is being used  as a weapon of war.\n\nAnd we cannot separate the current starvation in Gaza from the  Netanyahu government's strategy of forcibly displacing Palestinians  from their land. You know, the leaders of Israel have explicitly stated  their vision for Gaza.\n\nSo this is not like a discussion or a debate trying…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694438/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…attention to another case that  has captured the public conscience, that of Andry Jose Hernandez  Romero, a 31-year-old gay Venezuelan makeup artist and asylum seeker  who was forcibly disappeared without due process.\n\nAndry entered the United States legally, fleeing persecution for his  sexual orientation and political beliefs. He passed an initial asylum…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…the requirements       placed upon them. The termination of TPS is not simply the       expiration of a benefit, it is stripping individuals of their       lawful status and forcibly rendering them undocumented.       People who have been authorized to work, pay taxes,       contribute to Social Security, and build their lives legally       would overnight…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…beings for economic profit.\n\nThe State Department's 2023 Human Rights Report highlights troubling  allegations regarding the Government of the People's Republic of China  forcibly harvesting organs from prisoners of conscience, including  religious and spiritual adherents.\n\nMr. Speaker, I worry deeply about the administration's proposed State  Department…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690629/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…Trump issued an executive order dismantling  the United States Institute of Peace. Subsequently, law enforcement  removed the president of the United States Institute of Peace forcibly  from his office, and then the Trump administration fired every employee  and dismantled the office.\n\nA district court has ruled that he acted improperly because the  Congress…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697480/united-states-institute-of-peace"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…indicate that individuals with       limited English proficiency or those unable to immediately       provide documentation verifying their legal status were       detained or forcibly removed on the spot. These actions have       led to widespread confusion, fear, and distress--impacting       not only the Korean American community but also many       residents…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…grandparents to pay for it. This isn't just about  politics. It is an attack on everybody who has to clock in and out  every day for work.\n\nYesterday, House Republicans wanted to forcibly remove me from a  committee for calling out this administration's grift, but they don't  have a single damned thing to say when it comes to protecting  healthcare for children…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688241/republican-hypocrisy-and-gop-budget-plan"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Security agents to the homes of  individuals with varied alien status, including permanent residents and  asylum seekers, arrest them, and either detain them indefinitely or  forcibly deport them. Lawyers representing the subjects have been  denied access to their clients as well as access to the warrants and  other official documents. Judicial orders have…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691184/letter-to-secretary-noem-and-secretary-rubio"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…making an arrest  of an unauthorized visitor;\n\nWhereas Representative McIver is alleged to have ``slammed her  forearm into the body'' and ``restrain'' an HSI officer by ``forcibly  grabbing him'';\n\nWhereas Representative McIver is alleged to have further interfered  with an Immigration and Customs Enforcement Deportation Officer engaged  in the performance…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694802/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…making an arrest  of an unauthorized visitor;\n\nWhereas Representative McIver is alleged to have ``slammed her  forearm into the body'' and ``restrain'' an HSI officer by ``forcibly  grabbing him'';\n\nWhereas Representative McIver is alleged to have further interfered  with an Immigration and Customs Enforcement Deportation Officer engaged  in the performance…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694096/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…States economically and militarily.\n\nPresident Xi, the head of the People's Republic of China, and the  Chinese Communist Party have threatened time after time after time to  forcibly attack Taiwan and to consolidate Taiwan with mainland China.\n\nWe also know that the battle for the future of the world will  literally be determined by who wins the race for…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697555/china"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…issue. Where are the Democrats  complaining about Lebanon's human rights atrocities?\n\nThe Democrats were silent when the Lebanese military shot protesters,  silent when they forcibly repatriated Syrian refugees, and silent when  the Lebanese military failed to prevent Hezbollah from indiscriminately  targeting our ally Israel. Yet, they tell us to turn…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…are Iranian proxies, launched the deadliest attack in history  against the nation of Israel.\n\nAnd all the while, China prepares for war. They have actually  threatened to forcibly take Taiwan. President Xi has ordered the  People's Liberation Army to be ready to do so by 2027, of course,  escalating tensions in the Indo-Pacific and engaging in provocative…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…No Accountability for Allegedly Facilitating Sex                        Trafficking of a 15-Year-Old\n\nBack in 2008, a then fifteen-year-old girl began to       allegedly be forcibly trafficked for commercial sex, which       allegedly continued for a decade across Miami-Dade County.       She was allegedly frequently expected to perform commercial…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…these experiments in  regime change again and again. And what has it brought? Instability,  chaos, suffering, and resentment.\n\nIt is the height of arrogance to think we can forcibly remove the  dictatorship in Venezuela and expect a different result. We should  learn from history. Liberty cannot be imposed at the point of a foreign  bad act. The United…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}]