[{"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…southwest side.\n\nJoann is a U.S. Army disabled veteran who has dedicated her life to  service both in uniform and in her neighborhood. She has spent decades  being a driving force of opportunity, making sure to uplift her  community and ensure that other veterans receive the respect that they  deserve.\n\nAs the founder of the Hearst Community Organization,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688288/recognizing-joann-williams"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…name of the  Persian Gulf to the Arabian Gulf. Today, he arrived in the Middle East,  where he is expected to accept a luxury 747 worth $400 million from  Qatar to replace Air Force One.\n\nFrom attempting to rename the Persian Gulf to accepting luxury  airplanes as unprecedented personal gifts, Donald Trump would rather  waste time on ridiculous political…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690994/cleaning-up-government"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…workers, people who have gotten their positions based on merit, people  who are distinguished in their careers, have outstanding experience,  great credentials, but he is trying to force them out so he can replace  them with people who are politically loyal to him.\n\nI just want to chat a little bit about the firing of these people  because I know a lot of folks…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…doing  prescribed burns, doing the work that will prevent catastrophic  wildfires.\n\nIn my district, Fire Chief David Walker says the Forest Service is  the primary firefighting force for something called the Lake Wenatchee  area. It is a favorite vacation spot for Washington families.\n\nWhen you gut the Forest Service's fire response operation, that means…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…Counties.\n\nAl and Carmen were married for 57 years before she passed away just a  few years ago in 2020. In the years after her passing, the Castellano  children were the driving force behind the foundation until its  operations concluded in 2023. The impact of their monetary  contributions is exceeded only by the change they cultivated on behalf  of the…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691561/recognizing-life-and-contributions-of-alcario-al-castellano"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…the fiscal year 2026 Military Construction,  Veterans Affairs, and Related Agencies Appropriations Act in its  current form.\n\nI represent a district that is home to Robins Air Force Base, Fort  Benning, and Marine Corps Logistics Base Albany. These installations  are more than just military sites. They are the backbone of communities  where servicemembers…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692954/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…crisis.\n\nI am disappointed in many of my colleagues on the other side of the  aisle. They continue to defend the U.S. embargo and the status quo.  They claim that they want to force the Cuban Government to treat its  own people better, yet now when they have a chance to speak out against  the Trump administration's callous indifference to the welfare of…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692909/do-not-forget-the-crisis-in-cuba"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…criminal       conduct such as drunk driving, harassment, property damage,       theft, and stalking. Every officer credibly accused of       domestic violence remained on the force, including one       officer who admitted to punching his wife so hard in the face       that he fractured her eye socket, and another officer who       used a car to run over…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…thank Ranking Member McGovern for yielding.\n\nMr. Speaker, I rise in strong opposition to this rule and the  underlying bill.\n\nFor the first time in history, this bill would force States to pay  for part of SNAP benefits, and it would require States to increase  their share of administrative costs.\n\nThis is an unfunded mandate, plain and simple.\n\nLet's…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693203/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…any other aspect of who you  are because you are an American, a patriot first.\n\nThis decision to remove proven patriots for no justification causes  serious weakness to our force. It turns away proven courage. It wastes  billions in taxpayer investment, decades of hard-earned experience, and  is a direct blow to readiness because this decision isn't…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693974/transgender-americans-serve-with-honor"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "Mr. MENENDEZ. Mr. Speaker, I rise to speak in opposition to H.R.  1949.\n\nMr. Speaker, this bill would force the Department of Energy to  rubberstamp every LNG export and strip the Department of its ability to  review whether those exports are actually in the public interest.\n\nAt…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697095/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the Senate,  the House, or the American people. That is what leads to trouble--big  trouble.\n\nLet's be very clear. Donald Trump does not have the authority to use  military force to carry out his current plans in the Caribbean, without  authorization from Congress. If Trump acts without congressional  authorization, the Senate stands ready with a bipartisan…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…great Kansas Citian, Ms. Alice Kitchen. The fruits of  Alice's advocacy for women, children, and marginalized communities will  live on for generations to come. Alice was a force to be reckoned with,  stopping at nothing to ensure that others could live free of abuse,  injustice, and discrimination. Her undeniable impact will continue to  grace Kansas…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698825/recognizing-the-life-and-memory-of-alice-kitchen"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…civilian  oversight of the police department; improved public access to body-worn  camera video; and imposed limitations on the purchase of military  weapons and the use of force. D.C. police chiefs have requested more  authority to discipline officers for at least 25 years before enactment  of this law. This bill would take away this authority from…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…further prohibit any support of Ukraine  as they fight to defend their country from an illegal Russian invasion.  Putin is attempting to rewrite the map of Europe through use of force.  He is doing so in violation of international law. He is deliberately  killing civilians, targeting hospitals and schools, destroying the  economy and the livelihood of Ukraine…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…36(b)(5)(C), AECA)\n\n(i) Prospective Purchaser: Government of Belgium.\n\n(ii) Sec. 36(b)(1), AECA Transmittal No.: 22-63; Date:       November 8, 2022; Implementing Agency: Air Force.\n\n(iii) Description: On November 8, 2022, Congress was       notified by congressional certification transmittal number       22-63 of the possible sale, under Section 36(b)(1)…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696021/arms-sales-notification"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…implementing a new  record management system, obtaining body-worn and in-car dash cameras,  and acquiring taser devices for the department. His efforts helped to  modernize the force and enhance public safety.\n\nBeyond these contributions, he has shared his vast experiences and  leadership abilities with generations of the department's officers.  Above all,…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694744/recognizing-buckingham-township-police-department-lieutenant-william-moffetts-35-years-of-service"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…the Aviator Cancers Examination Study Act, or  the ACES Act.\n\nFar too many of our military aviators and aircrew are being diagnosed  with cancer at troubling rates. A 2021 Air Force study supported by  additional Department of Defense research found that aviators face a 29  percent higher likelihood of testicular cancer, a 24 percent higher  likelihood…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693896/aces-act-of-2025"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…constituent,  Jack Gray, upon his acceptance to the United States Merchant Marine  Academy.\n\nAs a future midshipman, he will be joining the ranks of the world's  most elite naval force, guided by the motto: ``Acta Non Verba''\n\nThe service and sacrifice of America's military personnel have  safeguarded our Nation since its inception, defending our way of life…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692770/congratulating-jack-gray"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Defense Authorization Act for Fiscal Year 2026, my vote would  have been in the affirmative.\n\nMy absence is due to my attendance at the dignified transfer ceremony  at Dover Air Force Base to receive the remains of the two Iowa National  Guard servicemembers who were killed in Syria this past week. I  appreciate the opportunity to record my position.\n\nHad…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698316/vote-explanation"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Commendation. Her 20-year service to our country  followed by her heavily involved community service is a template for  American Exceptionalism.\n\nTSgt. Ybarra enlisted in the Air Force in May 1986, through the  delayed enlistment program and began active duty on September 15, 1986,  from the Syracuse, NY Military Entrance Processing Station (MEPS). She  completed…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696274/recognizing-technical-sergeant-martha-socorro-ybarra-usaf-retired-with-a-congressional-veteran-commendation"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…reconciliation budget: incentives to invest in America, to build new  plants of equipment, for working people to have some things to actually  draw them back into the labor force, no tax on tips, no tax on  overtime, some of these things.\n\nIf you actually look at one of the reasons those things are in there,  and we are actually starting to see some…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…reflects the program's  commitment to addressing diverse community challenges with tailored  support. Led by Ann, the leadership team within RSVP Pasco has also  been a driving force behind its success. Ambassadors have taken on  vital roles in recruitment, outreach, and event planning. When the  CARES Senior Center closure displaced 25 volunteers, RSVP…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690139/recognizing-ann-wilkinson"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Speaker, I make no apologies for supporting these bills that we  have in this rule today and supporting the fact that American energy is  predominant and should remain a major force in the world instead of  ceding everything to the Chinese.\n\nMr. GRIFFITH. Mr. Speaker, this Epstein situation is very serious,  and I take it as such. We have victims whose…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…comerstone of resilience, innovation, and  unwavering commitment to the community. Amidst the devastating impacts  of Hurricanes Helene and Milton, they emerged as an indispensable  force, transforming challenges into triumphs and ensuring no resident  was left behind. The team managed and helped coordinate efforts for  shelters that housed 485 residents. When…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690698/recognizing-fernando-serrano"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…today with profound respect and  gratitude to recognize the exceptional service and unwavering  dedication of Robert Anthony Longo, a proud veteran of the United  States Air Force and our esteemed Veteran of the Month for April 2025  from Michigan's 9th Congressional District. His lifelong commitment to  duty, both in uniform and beyond, exemplifies…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689738/recognizing-robert-longo-as-april-2025-veteran-of-the-month"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…secret of his  intentions. Folding Taiwan into the People's Republic of China is  central to his vision of national rejuvenation. He has made it clear he  is willing to use force to make that happen.\n\nThe warning signs are in plain view. China is ramping up aerial  incursions, conducting illegal exercises that simulate a blockade  around Taiwan, threatening…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690686/taiwan-assurance-implementation-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…score political points  here at home.\n\nLet's just take, for example, our former colleague Sam Nunn. On  multiple occasions, including the 1974 and 1985 NDAAs, he pushed to  force allies to carry more of the costs of U.S. forward deployment.\n\nAnd yet, when a majority leader of his own party tried to force a  phaseout of U.S. troops from Europe, our former…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…with partners and allies around the  world and across many different areas.\n\nIn fact, just yesterday, a Federal district court judge in California  ruled that the reductions in force--the layoffs, the RIFs--announced by  the administration during this current shutdown were illegal because  they were targeted and partisan.\n\nSo many things have happened this…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696237/9999"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…faithfully serving our  community and country.\n\nAfter graduating from The Citadel with a political science degree in  May 1979, Mark commissioned into the United States Air Force. He served  as a Command Intelligence Officer during the Gulf War and Global War on  Terrorism for many years. In his last assignment, Mark became the  Director of Intelligence…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696968/recognizing-congressional-patriot-award-recipient-mark-kipphut"}]