[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…end those programs,'' look at them  not as waste but as an investment.\n\nYes, if there is waste, let's eliminate it. But as the national  commander of the VFW--Veterans of Foreign Wars--said to us in one of  our hearings, when he was wounded in combat, the surgeon who took the  shrapnel out of his arm did it with a scalpel; he did not cut the arm  off…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…instead of putting  Americans first, we are stepping into a foreign nation and promising to  run it for the foreseeable future. An administration that had promised  to end foreign wars has begun a new one. A President who had decried  the use of force for regime change or to engage in nation building has  just committed our country to both.\n\nNo doubt Russia…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698678/venezuela"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…But I think it is important that we put this decision to go into  Venezuela in context. It is confusing. President Trump campaigned for  nearly 2 years on staying out of foreign wars. That was a huge  signature part of his campaign. So why do we find ourselves now ``in  charge,'' in his words, of Venezuela?\n\nLet's put it in context. All fall, the White…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698619/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…corrupt leader of Venezuela,  Nicolas Maduro--military action that we were repeatedly told would  never come to pass, by a President who promised to avoid starting new  foreign wars, engaging in nation building, or conducting regime change  operations.\n\nThis operation was not about narcotics, nor was it about democracy,  nor was it about oil. The military…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699093/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…explained. He is abandoning it because of the protests of veterans  and VSOs who spoke out. And I thank them. I am here to say ``thank  you'' to the American Legion, Veterans of Foreign Wars, the DVA, the  Iraq and Afghanistan Veterans--I could go through the entire list. And  to all the veterans posts and organizations, thank you for helping to  save those…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693321/9999"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…What is happening? We were the first ones on the  ground after 9/11 from another country.\n\nThe Canadians were there.\n\nWe were the ones that stood by your side in so many foreign wars. We  are the one that, for so many of our States, is the No. 1 trading  partner. How can this be happening?\n\nAnd, frankly, it pisses them off, and so individual families…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…my colleagues had been in the hearing today, the joint hearing  of the House and Senate Veterans' Affairs Committees, to hear Commander  Al Lipphardt of the Veterans of Foreign Wars, the VFW--a really heroic  Vietnam veteran, injured there, with shrapnel in his arm. As he told  us, the surgeon removed the shrapnel piece by piece; he didn't cut off…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Clinton balanced the budget.\n\nBush--the first President in American history that didn't call for  the common sacrifice to go to war. We spent trillions of dollars in  those foreign wars. And guess what he said. No common sacrifice. Only  about 1 percent of our people will fight in those wars. I am going to  give you a tax cut.\n\nWell, that makes no sense.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…relate to housing and groceries and energy  and childcare and so much more.\n\nWe show the contrast that, while Donald Trump and Republicans are  spending all of their time on foreign wars, on ballrooms, on private  jets, Democrats are the ones focused on helping people pay the bills  for the things they need every day to live their lives decently.", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698474/cost-of-living"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…for Use of Military  Force, or AUMF, to justify military actions completely unrelated to  Iraq. Leaving it on the books invites future Presidents to drag us into  reckless foreign wars. The American people do not want those wars, and  Congress has not yet authorized those wars, nor will it. They will have  to come to Congress for that power.\n\nI am honored…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697809/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…pilot with more than 3,000 flying  hours, including over 550 hours in combat. In 1972, he and the other  Vietnam war aces were awarded the MacKay Trophy and the Veterans of  Foreign Wars Armed Forces Award. He retired from Active Duty February 1  of 1998, after 30 years of honorable service.\n\nFollowing his retirement from the Air Force, Colonel DeBellevue…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699080/9999"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…was involved with the Boy Scouts of America and was a  member of the Honorable Order of Kentucky Colonels, the University of  Kentucky Alumni Association, the Veterans of Foreign Wars, and a life  member of the Pearl Harbor Survivors Association. He received the  Mayor's Spirit of Lexington Award.\n\nVaughn P. Drake, Jr. was a true patriot, a great American,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690221/in-memory-of-vaughn-p-drake-jr"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…serving those who have served.\n\nMrs. Gramer has devoted herself to supporting veterans and their  families. She has held leadership positions within her local Veterans  of Foreign Wars Post, maintains membership in her local American Legion  Post, and has served as both Co-Director and Vice President of a local  veterans' resource center. She is an active…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700088/recognizing-united-states-navy-petty-officer-second-class-katrina-gramer"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…to see the names of  their loved ones and comrades who otherwise may not be able to make the  trip to Washington.\n\nI would like to thank the Town of Hilliard, Veterans of Foreign Wars  Post 10095, and all the volunteers who dedicated their time and effort  to bring this distinct honor to Northeast Florida.\n\nMr. Speaker, we will never be able to repay…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690073/town-of-hilliard-remembers-our-vietnam-veterans"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…interest payments, the United States is sending a  message of weakness.\n\nYet Congress has reportedly chosen to ignore the deficit, raise the  debt ceiling, and continue to fund foreign wars. Instead of budgeting,  Congress decided to kick the difficult decisions down the  road. Unfortunately, continuing spending at the Biden administration  levels is a path…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Speaker, it is my honor to recognize the Veterans of  Foreign Wars Ottawa Post 3134 for their 80 years of dedicated service  to the Veteran community of the Iron River area.\n\nThe Veterans of Foreign Wars (VFW), established in 1899, is an…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696860/recognizing-the-80th-birthday-of-the-veterans-of-foreign-wars-ottawa-post-3134"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…benefits they need when transitioning back into  their communities after service.\n\nAs the chairman said, this is also supported by The American Legion,  the Veterans of Foreign Wars, and the Paralyzed Veterans of America  because they understand the importance of what we are trying to do in  this legislation.\n\nBy updating the way the VA communicates,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695436/delivering-digitally-to-our-veterans-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Altoona, elected to 11 terms in  the U.S. House, served with the United States Navy in both World War I  and World War II, and was a national commander of the Veterans of  Foreign Wars from 1934 to 1936. He retired as a rear admiral from the  United States Navy Reserve in 1959.\n\nThe legacy of devoted service that distinguished the life of  Representative…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696753/improving-domestic-energy-market"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…combat support. Upon  retiring, Ms. Prehoda continues to serve her country through  memberships in various Veteran organizations such as the American  Legion, Veterans of Foreign Wars, the Marine Corps League, and many  more.\n\nMr. Speaker, let us all join in recognizing Valerie Prehoda for  receiving the prestigious honor of being inducted into the Michigan…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696846/recognizing-valerie-prehoda-on-her-induction-into-the-michigan-tech-president-council-of-alumnae"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…President of Oak Cliff Junior Chamber of  Commerce and was a member of Rotary International, the Texas Silver- Haired Legislature, the Reserve Officers Association, Veterans of  Foreign Wars, and the American Legion. Ralph also assisted with  Salvation Army and Red Cross drives to support those in need. As a  result of his outstanding work, he was recognized…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690225/recognizing-congressional-patriot-award-recipient-ralph-odell"}]