[{"senator": "Val Hoyle", "party": "Democrat", "sentence": "…communities meet an  essential public service need.\n\nThis legislation would direct the Secretary of Agriculture to convey  small parcels of land within the Apache-Sitgreaves National Forest to  Apache County and Navajo County for the expansion of existing  cemeteries.\n\nThese cemeteries are running out of space. Without this bill, local  families face serious barriers…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691142/apache-county-and-navajo-county-conveyance-act-of-2025"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…Wilderness  Additions Act, introduced by my colleague from Arkansas (Mr. Hill).\n\nThis bill would expand the boundaries of the Flatside Wilderness Area  in the Ouachita National Forest by approximately 2,212 acres and  redesignate the area as the Flatside-Bethune Wilderness.\n\nRepresentative Bethune represented Arkansas here in the House of  Representatives,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691097/flatside-wilderness-additions-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…to finish the study, and they  followed the scientific recommendations and the public input. In 2022,  a comprehensive environmental assessment was finally completed. The  Forest Service recommended a mineral withdrawal to protect the Boundary  Waters of Minnesota, just as it had for the waters in Montana and  Washington.\n\nCurrently, we have 17 years…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…divided, the land was taken out of trust  and ultimately lost  to the Tribe. It passed through private ownership to a timber company  and, decades later, was acquired by the U.S. Forest Service.\n\nThrough all those years, the Quinault people were cut off from land  that held deep cultural and ecological value.\n\nAllotment 1157 includes some of the last remaining…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697702/quinault-indian-nation-land-transfer-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…How they held the mirror to us,       showing evolution's trace. But in nineteen-eighty-six she       flew far above this wood, And she saw the devastation where       the forest once had stood.\n\nShe was no more mere observer, now she'd fight to save and       teach, And she traveled `round the planet, bringing hope       within her reach. On three…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696844/the-ballad-of-jane-goodall"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…there is not a single family who has not been  touched over the last 100 days: People who have lost their jobs,  teachers and firefighters, people who work for the VA and the Forest  Service, who work for our national security programs, scientists and  engineers, people who just started their jobs and people who have been  there for countless decades.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690395/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…to cause somebody who is here to decide they want to be  back there. These are people who walked here from Venezuela. They went  through the Darien Gap. They dealt with the forest. They dealt with the  snakes. They dealt with the predators. They dealt with the drug  dealers.\n\nThey came into our country at great personal risk. They are going to  see a…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…``new probation and parole officers and others needing       TASER 10 Certification.''\n\nBillings Probation and Parole Officers training to prepare       for use.\n\nLake County Forest Preserves Police Department                                   NEBRASKA\n\nLincoln Police Department\n\nClay County Sheriff's Office                                    NEVADA\n\nSparks…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…roads are  because the vast majority of time, that is where the elk aren't.\n\nElk need habitat security. If there is food and water and a place to  securely bed on national forest land in New Mexico, and that spot is a  couple of miles or more from an open road, the odds that elk live there  are really, really high. So it is almost like the roadless…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…also honors the frontier spirit that  defines rural New Mexico. Communities like Silver City, Cloudcroft,  Quemado, and many others throughout New Mexico continue to lead in  forest conservation, outdoor recreation, wildfire resilience, and  natural resource management. They deserve a Federal partner that  matches their commitment, and today, they are…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…30,000 people to evacuate.\n\nCompared to most, we were relatively lucky. Given wind conditions and  the brave work of our firefighters, many of whom were employed by the  U.S. Forest Service, the fire was quickly contained.\n\nAs southern California began to emerge from the devastation and focus  on rebuilding, firefighters and other fire service workers…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689808/cuts-to-forest-service-endanger-millions"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "Mr. MIN. Mr. Speaker, I rise today to urge the Trump administration  to consider reversing its reckless and dangerous terminations of Forest  Service employees.\n\nI represent an area in Orange County that is prone to the same types  of wildfire risks that we saw devastate Los Angeles not too long ago.  We are about…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689810/cuts-to-forest-service-endanger-millions"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…their  communities.\n\nMore than 2,400 employees have been dismissed from the Department of  Veterans Affairs, undermining care for those who have served our  country.\n\nThe U.S. Forest Service is losing the very employees that provide  Americans access to our national treasures and public lands. These cuts  also threaten wildfire prevention as our State enters…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687984/dire-consequences-of-funding-freeze-and-mass-firings"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Northwest,  Representative Bentz from Oregon.\n\nThis bill would direct the Secretary of Agriculture to convey  approximately 150 acres of Federal land in the Mount Hood National  Forest to the City of The Dalles, Oregon.\n\nThis land is vital to the City's watershed and supports roughly 80  percent of its annual water supply. Local ownership of this land will…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697753/dalles-watershed-development-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…and its unlawful summary mass firings of  professional civil servants like air traffic controllers, food and drug  inspectors, pediatric cancer researchers in my district, Forest  Service, and firefighters. They are getting run out of town now. I  don't hear a lot about Elon Musk. He has lost some elections for my  friends across the aisle, so they…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "Mr. STAUBER. Mr. Speaker, as a former county commissioner, I rise in  strong support of the Secure Rural Schools Reauthorization Act of 2025.\n\nSince the National Forest System was created, nearly 200 million  acres of rural America have been put aside for conservation,  recreation, and responsible natural resource development, like mining…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697654/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…accountability, and identify areas of further reform.\n\nThe consequences of NEPA are felt across this country, from  manufacturing and construction in my district to critical forest  management, mining, and housing projects. These delays impact our  economy, but they also constrain our efforts to achieve energy  dominance, protect our national security,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697709/studying-nepas-impact-on-projects-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…championship.\n\nThey capped an incredible 2025 season with an 11-7 victory over  Loudoun County. Along the way, they won the Region 4D championship with  a 14-3 win over Jefferson Forest and claimed the Tommy Girani Cup,  achieving all three of their goals.\n\nTheir journey was defined by resilience and determination. After  falling short in last year's quarterfinals,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693527/congratulating-central-high-school-womens-softball-team"}, {"senator": "Ryan Zinke", "party": "Republican", "sentence": "…places to mine, but you have got to go with the science  and not the hype. When a mine is not located in the wilderness, it is  not located in the buffer, it is located in a Forest Service holding,  which by nature, which by law is multiple use, then mining is an  appropriate use in it.\n\nMr. Speaker, on the basis of this, we are facing a crisis in our…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699276/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…community hub while also supporting our timber industry that is the  lifeblood for many of our communities.\n\nFor generations, Arkansas counties with large swaths of Federal  forest land have received a share of Federal timber harvest revenue on  Federal land. Unfortunately, reduced timber revenue since the 1990s, as  a result of declining rates of timber…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697657/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Journeyman's Electrician  in 1995. Apart from work, he became a Master Mason in the Milam Lodge  No. 2 in Nacogdoches, TX in 1972 and continues as an active Mason in  the Huntsville Forest Lodge No. 19 as a Tiler. He is a self-taught  Farrier working with Horses and Livestock and has devoted countless  hours working with FFA students as a Board of Director with…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696281/recognizing-richard-reagan-horn-with-a-congressional-veteran-commendation"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…speak in favor of my bill,  the Apache County and Navajo County Conveyance Act of 2025.\n\nThis legislation would transfer Federal land currently under the  purview of the U.S. Forest Service to Navajo and Apache Counties.\n\nFor more than a decade, the communities of Pinedale and Alpine have  struggled to find appropriate cemetery space to meet the needs…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691143/apache-county-and-navajo-county-conveyance-act-of-2025"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…comes with  reauthorizing SRS. It matters a lot for Utah.\n\nTo be clear, rural counties, timber counties, would rather have the  jobs that come with timber production and sound forest management,  management for resource production. However, in the meantime, while we  are fixing the policies that prevented that, SRS is essential for the  rural counties.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697663/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…renowned wildfire  mitigation program.\n\nMarshal Lacey was onsite and led the efforts to combat the Waldo  Canyon fire and saved my own home and thousands of others in the Black  Forest fire that devastated our community, in addition to helping  recover victims of Hurricane Katrina.\n\nMr. Speaker, I ask that my colleagues join me in congratulating and  thanking…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689254/recognizing-the-retirement-of-colorado-springs-fire-marshal-brett-lacey"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…became  the top commander of the U.S. Corps of Artillery. After the war, a  grateful new nation granted the remarkable patriot a land grant on the  coast of Maine.\n\nWith vast forest lands and fast-moving rivers, General Crane's  settlement soon became a bustling lumber center with two sawmills. The  fertile soil produced productive farms of crops and livestock,…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693257/town-of-whiting-200th-anniversary"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…USS Dwight D. Eisenhower  (CVN-69), and various Shore Commands.\n\nHis final duty station was Naval Air Station Jacksonville, Detachment  Astor, located in the Ocala National Forest. He served as an operations  officer where he conducted training with 50 air squadrons in various  air to land operations. Retiring in 1999 as a Navy Chief, Mr. Askew  went…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688857/thanking-mr-jeffrey-askew"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…principal and coordinator of innovation for Walker County Schools,  where he led Gilbert Elementary to national recognition by establishing  Georgia's first public school forest kindergarten and earning U.S.  Department of Education Green Ribbon status. Beyond his work in public  education, Mr. Harris has private-sector experience as a businessowner…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697167/recognizing-matt-harris"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "Mr. SESSIONS. Mr. Speaker, I rise today to honor William ``Bill''  Forest Harris of Cameron, Texas, by presenting him with a Congressional  Veteran Commendation. His persistent efforts in fostering beliefs of  sacrifice and respect reflect his value…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696330/recognizing-william-bill-forest-harris-with-a-congressional-veteran-commendation"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…task is complicated by the fact that critical  infrastructure, the Crow Creek Reservoir and the surrounding timbered  area, is located on both City-owned and federally managed Forest  Service lands.\n\nThe City operates these facilities under a special use permit, which  is inefficient and costly and limits the City's ability to  expeditiously expand and…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697752/dalles-watershed-development-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…forests have precipitated many of these catastrophic fires in addition  to several other policy failures.\n\nThe good news is that we are restoring common sense when it comes to  forest management. We just passed on a bipartisan basis a couple of  months ago the Fix Our Forests Act, which will streamline the sort of  environmental regulations that stop us…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}]