[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…gentlewoman and the sponsor of this amendment voted for added  $4 trillion to the debt. Why don't we start there?\n\nThere is a basic argument here: Why does the U.S. engage in foreign  aid? There are four real arguments for that.\n\nNumber one, economics: Again, we are the most economically powerful  nation in the world. We have the largest economy. We benefited…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…they are cutting programs that will to lead to,  I saw one estimate, 1.6 million people who will die over the next year  based on these cuts that he is making right now to foreign aid.\n\nWe stopped funding AmeriCorps, which means less teachers in areas  that are in desperate need of teaching assistants. We have a lot of  schools out there who are short…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…misinformation on the social  media platform he bought and broke.\n\nThey highlight select examples of programs they deem wasteful which  amount to a fraction of a penny of the foreign aid budget--some of  which began under the first Trump administration--and they make  baseless claims of fraud and insubordination, blaming anyone else but  themselves for the…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…abroad and  invests into vital programs that support humanitarian aid, development,  and democracy building. This bill, while imperfect, rebukes President  Trump's attacks on foreign aid by allocating $5.5 billion for  humanitarian assistance, $9.4 billion to support the State Department's  Diplomatic Programs, and $3.5 billion for global health programs…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699388/supporting-hr-7006"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…further rescissions  because we have already seen this administration's willingness to  rescind funds approved in a bipartisan fashion by Congress, canceling  support for foreign aid and public broadcasting programs that enjoy  broad bipartisan backing.\n\nThe administration has also announced plans to exploit a little-known  mechanism known as a pocket…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695661/healthcare-subsidies-and-rescissions"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…children globally.\n\nBefore he became Secretary of State, Trump's own Secretary of State,  Marco Rubio, understood the value of food aid. He once said: ``We don't  have to give foreign aid. We do so because it furthers our national  interest.''\n\nHe is right. This is not just charity. This is about strengthening  our alliances, bringing stability to fragile…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692971/restore-funding-for-malnourished-children"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…have it both ways.\n\nAgain, not 1 week ago, Republicans jammed a rescissions package  through this Chamber, axing billions in bipartisan funding to public  broadcasting and foreign aid, purely on a party-line vote. Less than a  day later, Russell Vought comes out and says the appropriations process  should be ``less bipartisan.''\n\nFrankly, I don't want…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693852/appropriations"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…agreements that Republicans just made in March. It is about  the fact that Congress had approved this funding before Elon Musk took  a literal chain saw, an illegal chain saw, to foreign aid and public  broadcasting and a whole bunch of other things that Americans care  about. Then guess what? The courts said no.\n\nNow, Trump has ordered his minions here in this…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692533/rescissions-act-of-2025"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…means that our adversaries, particularly China, have a  golden opportunity to swoop in to the rescue and build good will with  nations all around the world.\n\nMr. Speaker, foreign aid is not just charity. It serves our interests  as a country, as well, when we build good will with nations that have  rare earth minerals and can assist us in intelligence…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692267/calling-on-trump-administration-to-restore-food-aid"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…bill did to  public broadcasting--NPR and PBS--legacies of President Johnson's Great  Society that help our citizens stay informed. Think of the harm done to  life-saving foreign aid that keeps children fed and vaccinated from  dreadful diseases that can and will cross our borders in check. And the  Big Ugly Bill does substantial harm to critical programs…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694255/condemning-chaotic-and-harmful-failings-of-this-congress"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…associations.\n\nWe should never allow a credit rating agency under our control to  ding a country that is subject to this kind of blackmail from China.                         Foreign Aid is a Good Thing", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…people who have no understanding or interest in  public service or government functions.\n\nElon Musk's DOGI efforts are disrupting critical medical research and  treatments, foreign aid, veterans' care, criminal investigations, and  health, housing and human services across the Nation and beyond.\n\nIt takes a remarkable combination of arrogance and stupidity…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687998/department-of-government-inefficiency"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Ms. BONAMICI. Mr. Speaker, I rise to condemn the House GOP's  rescission request that would take back $9.4 billion in Federal funding  Congress appropriated for foreign aid, the State Department, and public  media.\n\nWe know how devastating the loss of this funding would be for people  around the globe. Ending these investments will undoubtedly…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692414/rescissions-package-corporation-for-public-broadcasting"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…permission not to spend it--$9 billion.\n\nThat is what we voted on and the House voted on last week. What was  in this bill were primarily two major elements. One element was foreign  aid, humanitarian assistance around the world paid for by the United  States. The other element was public broadcasting--National Public  Radio, for example. So $8 billion was…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693932/rescissions"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…already run out of contraceptives completely, and 13  more were on the verge of running out due to President Trump's and Elon  Musk's reckless destruction of USAID and cuts to foreign aid.\n\nSeeking to destroy safe, lifesaving contraceptives is emblematic of  the Trump administration's approach to foreign aid. Destroying these  birth control products would…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696465/womens-health"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…interwoven within this important package.\n\nLet me make this abundantly clear, Mr. Speaker: Not only does this  legislative package contain no poison pills, but it also cuts foreign  aid by 16 percent. That is more than $9 billion.\n\nFurther, this package is part of an agreement that keeps fiscal year  2026 spending below the level that has been forecasted…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699072/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…forth and  passed by Congress, taxpayer dollars would still be funneled to  ideologues at PBS and NPR and taxpayer dollars would continue to be  funneled to all manner of foreign aid repositories that do not align  with the fiscal sensibilities and values of the American people. That  money, the people's money, would continue to be squandered. That is…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693717/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…fiscal  discipline and getting our Nation back on track. H.R. 4, the  Rescissions Act of 2025, cuts unnecessary spending and ensures tax  dollars are not wasted on reckless foreign aid. There will be no more  tax dollars to fund DEI programs in Serbia. There will be no more taxes  to fund DEI musicals in Ireland and no more tax dollars to fund  electric…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692531/rescissions-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…unprecedented success in reining in  wasteful spending and the President's willingness to not spend  everything that we give him. That is unusual.\n\nThe list of egregious foreign aid projects is endless. Here are just  a few: $3 million for Iraqi Sesame Street, $18 million to improve  gender diversity in the Mexican street lighting industry, $2.5 million…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693709/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…that it could have there. It is  a disgrace that Americans' hard-earned tax dollars are being used to  support these programs and organizations under the guise of necessary  foreign aid.\n\nIn addition to this, Congress continues to prop up the Corporation  for Public Broadcasting to promote public media stations like PBS and  NPR. Taxpayer dollars should…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692496/rescissions-package-is-first-step"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Save  your grandkids. You have got to do it by thinking.\n\nThe idiots I get--sorry, Mr. Speaker. I want to retract that.\n\nI will get people who say if we just didn't have foreign aid--and you  send them the charts saying it is 5 days of borrowing. This isn't easy,  but it is math.\n\nFor my friends on the left that keep saying: Make the tax code more…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…most: We cut their funding.\n\nFor far too long, Washington bureaucrats have taken advantage of the  American taxpayer, sending their hard-earned money to fund the corrupt  foreign aid complex, and pushing government funding for educational  programs that groom our children. That stops today.\n\nThe Rescissions Act of 2025 is not just a bill. It is a part…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692537/rescissions-act-of-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "Mr. DAVIDSON. Mr. Speaker, America's resources should always serve  America's interests, and 22 rescissions to wasteful foreign aid and  biased media totaling $9.4 billion is a good start.\n\nI commend this legislation because as the national debt climbs toward  $37 trillion, U.S. taxpayers deserve a government…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692522/rescissions-act-of-2025"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…I thank the chair for yielding me time.\n\nMr. Speaker, I rise in support today of H.R. 4, President Trump's  big, beautiful rescissions package.\n\nThis bill slashes radical foreign aid at the State Department, USAID,  and the U.S. Institute of Peace for woke gender ideology and equity  nonsense that mocks American values. Why are we bankrolling wokeism…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692529/rescissions-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…President, I call up my amendment No. 1266 and ask that  it be reported by number.\n\nMr. PAUL. Mr. President, I compliment President Trump and DOGE for  exposing waste and abuse in foreign aid spending. It boggles the mind  to think that some in Congress defend spending $2 million on sex  changes in Guatemala, thousands on an LGBT opera in Colombia, and  thousands…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688899/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…have in the past seen measures come to the floor that divided the  Republican Conference but that were able to pass with bipartisan  support on continuing resolutions or on foreign aid bills. There is no  reason that cannot be done here, and let the House work its will. That,  after all, is the best expression of the will of the people.\n\nWhat about the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698374/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…Mr. Speaker, of this, we are talking about $9.4 billion in  rescissions, funds that should never have been appropriated in the  first place. This includes $8.3 billion from foreign aid programs--some  which I just read--$1.1 billion from the Corporation of Public  Broadcasting. Taxpayers should not be forced to subsidize a leftwing  media operation like…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692389/providing-for-consideration-of-hr-rescissions-act-of-2025"}]