[{"senator": "John Garamendi", "party": "Democrat", "sentence": "…Flexibility Act'' would  allow States to choose to designate accredited, nonprofit land trusts  to hold conservation easements purchased with federal funding under the  U.S. Forest Service's Forest Legacy Program. Current law requires that  only the federal or state governments can hold conservation easements  purchased under the Forest Legacy Program.\n\nAllowing…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689872/reintroduction-of-the-forest-legacy-management-flexibility-act"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…lands. They are not meant for just  one industry. They are meant for everybody that uses those public  lands.\n\nWhen I served on the U.S. Federal committee to advise the Forest  Service, we got all of these stakeholders together to implement the  2012 planning rule, and it was the same deal. We did it deliberately.  We did it with all stakeholders at…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696880/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…directs the Secretary  of the Interior to expedite and approve any mine that the  administration deems a priority, and it tells the Department of the  Interior and the Forest Service to identify any public lands that  should be a priority for mining, without any public input or Tribal  consultation.\n\nIn the eyes of this administration mineral dominance…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699693/critical-mineral-dominance-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…the land was taken out of trust  and ultimately lost  to the Tribe. It passed through private ownership to a timber company  and, decades later, was acquired by the U.S. Forest Service.\n\nThrough all those years, the Quinault people were cut off from land  that held deep cultural and ecological value.\n\nAllotment 1157 includes some of the last remaining…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697702/quinault-indian-nation-land-transfer-act"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…and fisherman, actually. One  of them is, today, the President and CEO of Trout Unlimited, who served  as the senior policy and communication advisor to the chief of the  Forest Service when this rule was crafted back in 2001.\n\nWhen my friends draw a coveted Coues deer tag in the Bootheel of New  Mexico in what is a famous unit, Unit 27, where are they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…its unlawful summary mass firings of  professional civil servants like air traffic controllers, food and drug  inspectors, pediatric cancer researchers in my district, Forest  Service, and firefighters. They are getting run out of town now. I  don't hear a lot about Elon Musk. He has lost some elections for my  friends across the aisle, so they are…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…President, I rise to introduce the Ackerson Meadow  Land Exchange Act. This legislation will facilitate a simple land  exchange between the National Park Service and the U.S. Forest Service  in the Sierra Nevada.\n\nThis bill would transfer 160 acres of Stanislaus National Forest land  to the National Park Service to be managed as part of Yosemite National…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695778/by-mr-padilla"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…country's proudest legacy. They are our  natural heritage, a national treasure, and the agencies responsible for  stewarding them, like the Bureau of Land Management and the Forest  Service, diligently manage these resources for the future through the  careful development of these resource management plans and forest  plans.\n\nThe BLM plans, or the RMPs, are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694887/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "Mr. MIN. Mr. Speaker, I rise today to urge the Trump administration  to consider reversing its reckless and dangerous terminations of Forest  Service employees.\n\nI represent an area in Orange County that is prone to the same types  of wildfire risks that we saw devastate Los Angeles not too long ago.  We are about a…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689810/cuts-to-forest-service-endanger-millions"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "Ms. SALINAS. Madam Speaker, I rise to sound the alarm about the Trump  administration's reported plans to fire nearly 7,000 workers in the  U.S. Forest Service.\n\nThese illegal firings could have devastating consequences for Oregon.\n\nWildfire season is just around the corner, and there is concern that  the Forest Service won't…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690926/illegal-firings-could-devastate-oregon"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…people to evacuate.\n\nCompared to most, we were relatively lucky. Given wind conditions and  the brave work of our firefighters, many of whom were employed by the  U.S. Forest Service, the fire was quickly contained.\n\nAs southern California began to emerge from the devastation and focus  on rebuilding, firefighters and other fire service workers with…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689808/cuts-to-forest-service-endanger-millions"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…Enforcement Administration, and the Office on  Violence Against Women and COPS Office under the Office of Justice  Programs.\n\nSimilarly, the Interior bill protects the Forest Service from over $1  billion in Trump cuts. It protects clean water programs from those  massive cuts. It protects air and pollution grants from outright  elimination. It protects…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698874/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…her friendship, and for being an advocate on behalf of her  constituents.\n\nMr. Speaker, I rise today to demand answers on the recent funding and  staff cuts to the U.S. Forest Service. Last week, I led a letter to the  administration urging a reversal of these shortsighted decisions. We  are still waiting for a response.\n\nIn my district, a wonderful,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689809/cuts-to-forest-service-endanger-millions"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…finish the study, and they  followed the scientific recommendations and the public input. In 2022,  a comprehensive environmental assessment was finally completed. The  Forest Service recommended a mineral withdrawal to protect the Boundary  Waters of Minnesota, just as it had for the waters in Montana and  Washington.\n\nCurrently, we have 17 years left…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…uncomfortable. It leads to heart and lung disease. It causes cancer. It  shortens lives.\n\nThat is why, during a recent House Natural Resources Committee  hearing, I pressed the U.S. Forest Service chief to do more to protect  our firefighters. Within hours, the Forest Service made clear that  masks would be made available to wildland firefighters.\n\nThis is welcomed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695520/servicing-the-right-to-breathe-clean-safe-air"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Natural Resources Committee for their  bipartisan and unanimous support.\n\nAs noted, my bill seeks to transfer ownership of a vacant Federal  building owned by the U.S. Forest Service at 1069 Fourche Avenue in  Perryville, Arkansas, to Perry County.\n\nThis property is no longer in use by the Forest Service, and there  are no plans for its utilization…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698159/conveyance-of-specified-forest-service-property-to-perry-county-arkansas"}, {"senator": "Ryan Zinke", "party": "Republican", "sentence": "…places to mine, but you have got to go with the science  and not the hype. When a mine is not located in the wilderness, it is  not located in the buffer, it is located in a Forest Service holding,  which by nature, which by law is multiple use, then mining is an  appropriate use in it.\n\nMr. Speaker, on the basis of this, we are facing a crisis in our  country…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699276/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…in favor of my bill,  the Apache County and Navajo County Conveyance Act of 2025.\n\nThis legislation would transfer Federal land currently under the  purview of the U.S. Forest Service to Navajo and Apache Counties.\n\nFor more than a decade, the communities of Pinedale and Alpine have  struggled to find appropriate cemetery space to meet the needs of…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691143/apache-county-and-navajo-county-conveyance-act-of-2025"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…reauthorize the Secure Rural Schools and Self- Determination Program (SRS) through Fiscal Year 2026 and provide lapsed  payments for 2024 and 2025.\n\nAdministered by the U.S. Forest Service and U.S. Bureau of Land  Management, SRS funding goes to counties to help maintain schools,  infrastructure, and other essential community services for many rural  counties…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697660/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…term ``Secretary concerned''       means--\n\n(A) with respect to National Forest System lands, the       Secretary of Agriculture, acting through the Chief of the       Forest Service; and\n\n(B) with respect to lands managed by the Bureau of Land       Management, the Secretary of the Interior, acting through the       Director of the Bureau of Land Management.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691068/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…that tragedies like this do not occur again.\n\nWildfires are truly an urgent crisis that must be immediately  addressed, and Congress must do more to better support the Forest  Service, our firefighters, and rural communities in forested areas.\n\nBetween 2013 and 2022, we saw an average of 61,000 wildfires annually  with an average of 7.2 million acres…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691520/recognition-of-may-as-wildfire-awareness-month"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…There are potentially 1,609 acres with a reduction of 77 percent  of total acres that is now potentially being faced.\n\nWe have then as well some reports of folks with the Forest Service  and positions that are in jeopardy.\n\nIn the Camino Fire Safe Council, we have also gotten some reports of  activity when it comes to their grants, as well.\n\nThat is just…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "Mr. STAUBER. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 3187) to require the Secretary of Agriculture to convey a  parcel of property of the Forest Service to Perry County, Arkansas, and  for other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698160/conveyance-of-specified-forest-service-property-to-perry-county-arkansas"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…rely on a strong tax base. As a result, Congress made a commitment  to provide resources to rural communities and schools that have tracts  of land managed by the U.S. Forest Service.\n\nSince 1908, Federal law has required that 25 percent of the revenue  generated through timber sales in national forests is returned to the  local county. These funds…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697653/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…``Allotment 1157'' on       the map entitled ``Quinault Indian Nation Land Transfer Act''       and dated February 2, 2024, shall be administratively       transferred from the Forest Service to the Department of the       Interior and taken into trust for the benefit of the Quinault       Indian Nation.\n\n(b) Land Part of Reservation; Administration.--The land…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697703/quinault-indian-nation-land-transfer-act"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…land use plans and RMPs       implement, interpret, or prescribe law or policy.\\31\\ For       instance, in B-238859, Oct. 23, 2017, we found that an       amendment to the Forest Service's Tongass Land and Resource       Management Plan (Tongass Amendment) implemented law by       establishing new criteria for the sale of timber to non-      agency parties.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693059/us-government-accountability-office-legal-opinion"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…``Pinedale Cemetery Expansion'' and dated May 23, 2022.\n\n(3) Secretary.--The term ``Secretary'' means the Secretary       of Agriculture, acting through the Chief of the Forest       Service.\n\n(b) Conveyance Required.--Subject to this section, if the       County submits to the Secretary a written request for       conveyance of the property described in…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691144/apache-county-and-navajo-county-conveyance-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…land use plans and RMPs       implement, interpret, or prescribe law or policy. For       instance, in B-238859, Oct. 23, 2017, we found that an       amendment to the Forest Service's Tongass Land and Resource       Management Plan (Tongass Amendment) implemented law by       establishing new criteria for the sale of timber to non-      agency parties.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…sites and extends fee waivers to Federal lands  managed by the Bureau of Land Management, the Fish and Wildlife  Service, the Bureau of Reclamation, and the United States Forest  Service.\n\nThis allows Americans to experience our national history, natural  treasures, and natural resources that preserve and protect the legacy  that began in 1776.\n\nThis legislation…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697764/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…fee; and\n\n(2) the Secretary of Agriculture shall waive standard       amenity recreation fees for September 17, 2026, for each       visitor to each site managed by the Forest Service that       charges a standard amenity recreation fee.\n\n(b) Definitions.--In this section:\n\n(1) Entrance fee.--The term ``entrance fee'' has the       meaning given the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697765/semiquincentennial-tourism-and-access-to-recreation-sites-act"}]