[{"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…provisions to the HOME program at HUD to  ease compliance for small properties and to recognize community land  trusts as eligible HOME fund recipients.\n\nThe package also expands foreclosure mitigation counseling to  delinquent borrowers and raises the public welfare investment, or PWI,  cap to 20 percent to free up capital for historic investments in  affordable…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699805/housing-for-the-21st-century-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Collins: On April 3, 2025, you abruptly announced  the closure of the Veterans Affairs Servicing Purchase program (VASP),  leaving tens of thousands of veterans at risk of foreclosure. These  actions were taken unilaterally, leaving veterans, veterans service  organizations, and mortgage services unsure how the closure would be  administered, and what…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689686/prioritizing-veterans-survivors-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…lot of unbelievable and painful things were happening, of course,  Mr. Speaker. First of all, the housing industry was going kaput to say  it lightly. There was a massive foreclosure crisis. There was a run on  banks like in equity firms like Lehman Brothers. They had this whole  Wall Street endeavor that the Bush administration alongside the House…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…provided no answers and no alternatives to  VASP. Ending this critical support without a clear plan is not just  reckless, but it is cruel. That is why I am introducing the Foreclosure  Assistance Immediately Reinstated, or FAIR Act, to reinstate the VASP  program and make it clear that VA's job is to help veterans stay in  their homes, not push them into…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689694/montgomery-gi-bill-selected-reserves-tuition-fairness-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Section 215(a) of the Cranston-Gonzalez National Affordable       Housing Act (42 U.S.C. 12745(a)) is amended--\n\n(1) in paragraph (1)(E), by striking ``except upon a       foreclosure by a lender (or upon other transfer in lieu of       foreclosure) if such action (i) recognizes any contractual or       legal rights of public agencies, nonprofit sponsors,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}]