[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…imprisoned at Dilley Detention Center, a for- profit prison. Your mother told us you were in pain. I can only imagine  the pain she felt, too. Your small body vomited up the formula you  drank. The water there is dirty. The stress and trauma of being  shackled and locked up in the precious days of postpartum made nursing  impossible. You were finally…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700186/state-of-our-union-is-traumatizing-our-children"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…goods and services originating from  the United States. His Liberation Day scheme, which imposed 10 percent  tariffs on all countries, as well as additional tariffs based on a  formula for reciprocity widely mocked as nonsensical, led to the most  significant drop in the financial markets since the 2020 crash  triggered by the COVID-19 pandemic.\n\nAdditionally,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…does not go far enough to negate House language  falsely questioning the safety of Mifepristone and encouraging the FDA  to explore liability protections for certain infant formula  manufacturers, over which the agency has absolutely no jurisdiction  whatsoever.\n\nWhile the overall funding package may reopen the government for 1  month or 2, this bill…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696744/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Congresswoman Pettersen and Senator  Gallego, and I led over 100 Members of Congress in urging the State  Department to immediately surge humanitarian aid and ready-to-feed  infant formula to families in Gaza to save lives.\n\nIn a written response, the State Department expressed concern about  the crisis, but words without action are not only empty, they are…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697473/president-trump-is-a-threat-to-our-republic"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "Mr. CLYBURN. Mr. Speaker, I request that we allow a vote to let the  10-20-30 formula be applied to the low-income areas affected by this  bill.\n\nMr. CLYBURN. Mr. Speaker, I seek unanimous consent.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693241/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…to  these clinics.\n\nMr. Speaker, I hear the tortured explanation of how this fits into  the core duties of the TANF bill, and I hear them talking about the  diapers and the formula and all the wonderful things. The March of  Dimes provides all that stuff, too, but we don't provide them with TANF  funds.\n\nNo. This is a diversion from the already underfunded…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…bombs and bullets at aid sites themselves.\n\nAt the time, I held up this picture of Jinan Iskafi. She died in her  parents' arms, the victim of a military blockade on infant formula.\n\nHere joining Jinan are children suffering from famine conditions that  exist right now, this month--Amer, Maryam, and Shamm.\n\nThere is an ongoing famine in Gaza, and the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…residents  of the states and therefore D.C. is almost always treated as a state in  federal programs.\n\nFirst, this bill would treat D.C. as a state in the High-Density  States Formula for certain grants from the Mass Transit Account of the  Highway Trust Fund. Currently, only states are eligible for these  grants. Second, this bill would treat D.C. as a…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698538/introduction-of-the-district-of-columbia-transportation-funding-equality-act"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…They are taxes that the American people have paid.\n\nWhat did Donald Trump tax when he imposed these sweeping, unlawful  tariffs?\n\nHe taxed your groceries. He taxed your baby formula and your  strollers. He taxed the inventory sitting on the shelves of small  businesses that are just trying to survive.\n\nIn my home State of Nevada, families have paid nearly…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700196/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…story of a mother from  Delaware whose daughter lives with a condition that means she cannot  eat food without getting sick. Her daughter relies on Medicaid to pay  for the formula that keeps her alive.\n\nWithout it, she won't just struggle. As her mother wrote plainly to  me: ``If she loses Medicaid, she will die.''\n\nMr. Speaker, we must not gut Medicaid…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691433/gop-tax-scam-hurts-women-and-families"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…closer to  a nation where all children have the opportunity to flourish, not just  grow. This plan will make it easy for our families to afford the  basics. I hear it from them: Formula, diapers, and childcare are all  out of control. It will provide, again, a long-overdue safety net for  our families.\n\nWe know right now this bill, the End Child Poverty Act,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697023/economic-dignity-for-all"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…discriminating against you based on your health  conditions and health status. They protect you from infectious  diseases. They conduct inspections to make sure that infant formula is  safe.\n\nI want to tell you that Secretary Kennedy has committed to bringing  radical transparency to the HHS. I would love radical transparency, but  at the end of February,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…That is why I  am so mad about these bills.\n\nRepublicans' so-called Pregnant Students' Rights Act pretends to help  pregnant students. It provides no childcare, no diapers, no formula, no  housing, nothing pregnant students actually need. What it does do is  it controls. Republicans seem to be always about controlling women,  controlling people in their…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…Social Security offices in high-rent  districts, which would include all of Los Angeles. They are cutting  funding to SNAP, which helps young mothers who are looking for baby  formula for their babies and folks who need help buying food so that  maybe their children's bellies aren't empty when they are going to  school. Services by farmers who actually…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…travel with dignity, confidence,  and peace of mind.\n\nIt requires TSA to work with maternal health experts to create clear,  science-based guidelines for screening breast milk, formula, and  pumping equipment. It ensures TSA officers receive proper training so  that every parent can travel with confidence that they will not be  forced to discard essential…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696792/bottles-and-breastfeeding-equipment-screening-enhancement-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…move to suspend the rules and pass  the bill (S. 260) to amend the Bottles and Breastfeeding Equipment  Screening Act to require hygienic handling of breast milk and baby  formula by security screening personnel of the Transportation Security  Administration and personnel of private security companies providing  security screening, and for other purposes.…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696791/bottles-and-breastfeeding-equipment-screening-enhancement-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and more than 65,000 pounds of food was distributed. These  critical volunteers also ensure families receive essential items for  their infants and young children to include: formula, diapers, pull  ups, baby wipes and wash, as well as age specific clothing. In 2024,  more than 44,000 diapers and 9,500 items of clothing were distributed.  These volunteers…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692185/recognizing-susan-pugh"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…have come behind this microphone and show the  charts saying, I want every dime of my Social Security. Of course. Of  course. Most people don't realize the Social Security formula actually  is progressive. If you are a high-income earner, you get less  of your money. If you are lower income earner, your FICA tax, you  actually get more, but in the mean,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…The specifics of this tax started at $900 a metric ton in '24,  increasing to $1,200, and then $1,500 in the subsequent years. While  the statute directs the EPA to develop a formula to impose and collect  a tax based on intensity, Biden's EPA did so by ignoring well- established international standards.\n\nActually, one of the things I have heard here today…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688184/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…more than 65,000 pounds of food was  distributed. These critical volunteers also ensure families receive  essential items for their infants and young children to include:  formula, diapers, pull ups, baby wipes and wash, as well as age  specific clothing. In 2024, more than 44,000 diapers and 9,500 items of  clothing were distributed. These volunteers…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691836/recognizing-patricia-schneider"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…9  percent of the entire economy.\n\nWell, for Social Security they will say just raise the cap. Okay, but  don't give any benefits. That is the other part. Keep the benefit  formula where it is today. Tax people on every dime above that formula.  What is that today? It is about $170,000 today. Take every dime above  that, put the full 12.4 percent Social…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…businesses, period.\n\nI have fought to protect similar exemptions for students from family  farms and small businesses. Last year, new FAFSA provisions altered the  Federal formula for student aid, counting assets in small businesses  and family farms as part of the family's net worth. My Family Farm and  Small Business Exemption Act seeks to correct…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690715/help-small-businesses-thrive-again"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…remained only a fraction of their  historical highs.\n\nTo offset this lost revenue, Congress created the Secure Rural  Schools program in 2000 to offer an alternative funding formula that  takes historic production levels into account. This program has been a  lifeline to hundreds of rural counties and school districts across the  country who have seen…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697653/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the poor, those  who need it, single moms, people who are sick, the frail--that  population, even under today's law, gets a Federal--we will call it a  match; it is really a formula--a match of 50 to 70 percent, depending  on the jurisdiction. Is that correct?\n\nMr. ROY. Let's fast-forward. What we are really talking about--for  everybody at home watching…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690587/economic-anxiety"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…spending is on autopilot. It is what we call mandatory. It is  interest, it is Social Security, it is Medicaid, it is Medicare, and it  is other promises that are built into the formula. Members of Congress  almost never ever get the chance to vote on any of this red. The only  time it will ever really come up is if we have a reconciliation budget.\n\nAll the…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…framework with our budget targets  guide the final reconciliation bill.\n\nMr. Speaker, again, this may be the last best opportunity to save our  country from fiscal ruin. The formula is all there in the House budget  resolution.\n\nMr. Speaker, I urge my colleagues to demand that that is what drives  the bill at the end of the day. God bless America, and…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…dark on a       solid light background; and\n\n(B) has a contrast percentage of at least 70 percent       between such symbol or label notice and the background, using       the formula (B1 - B2) / B1 * 100 = contrast percentage, where       B1 is the light reflectance value of the lighter area and B2       is the light reflectance value of the darker area.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692751/wastewater-infrastructure-pollution-prevention-and-environmental-safety-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…and support mothers, fathers, children, and families. They are  for the families from pregnancy through childbirth and beyond with  parenting classes and assistance such as formula, diapers, and whatever  else that family may need.\n\nThe attempt to strip TANF funding from these centers was never about  fiscal responsibility. It was a targeted, ideological…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699227/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…ensure Americans receive lifesaving information in  times of need.\n\nThis bill is pro-law enforcement. It includes increased funding for  State and local police through the Byrne Formula Grant Program and COPS  hiring grants, while also making cuts to wasteful grant programs.\n\nI thank Chairman Cole for his steady leadership. This has been a  courageous effort…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698761/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…families and pregnant women. We just passed the Supporting Pregnant and  Parenting Women and Families Act, ensuring that young families have  access to prenatal vitamins, formula, and diapers. It also ensures that  TANF dollars can be used to support pregnancy resource centers.\n\nThe Pregnant Students' Rights Act provides guidance and resources to…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}]