[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the Trump administration normalizing the  threat of Nazism and White supremacy.\n\nThis policy has all the markings of a dog whistle. It is a ``stand  back and stand by'' in the form of an office memo. Not 4 days ago, 15  Jews were slaughtered in cold blood--a beautiful picture of a little  10-year-old girl celebrating the first night of Hanukkah--and a…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…millions of  American families.\n\nInstead, in this administration's first 100 days, I have seen this  Republican majority capitulate to the largest sales tax in U.S. history  in the form of Trump tariffs, costing the average American family  perhaps $4,900 annually at the checkout counter. I have seen this  Republican Congress authorize the imposition of even…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690476/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…domination by  monopolies at home or abroad.\n\nIt has been said on the floor of this House and on the floor of the  United States Senate that monopolies are inconsistent with our form of  government. It is true.\n\nThe antimonopoly spirit is as old as America. It is rooted in the  simple idea that power has to be checked. Just like political power,  economic…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689083/economic-populism"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Representative from Florida, for being such a great leader in opposing  not just anti-Semitism but all forms of racism, bigotry, and anti- Semitism. One could say it was the original form of racism. It goes  back millennia, and it mutates and appears in different guises and  different forms and at different periods in history.\n\nMr. Speaker, anti-Semitism and…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…the bedrock of ethical behavior and rules that govern human conduct.\n\nMy colleagues in Texas and Louisiana have State laws that post them  inside public facilities. In one form or another, secular laws are  written with these commandments in mind to provide civil sanctions  against those who would commit murder or lie in a court proceeding  under oath.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698929/greenland"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…expression of the American values of courage  and honesty, acknowledging that our Founders and our Nation were  not perfect at its inception, but that we must continually strive to  form a more perfect union, to learn from the lessons of the past, lest  we repeat them, and to acknowledge the humanity of those who were  enslaved.\n\nTelling the history of George…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699712/rewriting-history"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…to encourage de-escalation       tactics, we oppose H.R. 2189/S. 1283 and H.R. 4242 as written       and urge members of Congress to oppose these bills in their       current form.                       Unnecessary for Law Enforcement\n\nThe sponsors of these pieces of legislation contend that       their purpose is to increase access to and limit liability…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…will share a story of Florence from North Bend, Oregon. She  is a mother, a caregiver, and a fighter. She lives with a rare  neuromuscular disease, myasthenia gravis, a rare form of angioedema.\n\nFor her, Medicaid isn't just a safety net, it is a lifeline. It  covers the critical treatment and specialist care that keep her out of  the ER and out of the…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691434/gop-tax-scam-hurts-women-and-families"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…country, but they didn't want to hear it. They were so desperate to  give away tax cuts to the rich, and now those people watching at home  are going to be paying the bill in the form of higher healthcare costs.\n\nHowever, it is not too late. We can still restore funding for  healthcare so that everyone back home isn't hit by double-digit cost  increases on…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695636/government-funding-and-healthcare"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…for civilian energy--it was still not enriched to the level to  build a bomb. It would have had to be enriched to 90 percent. It would  have had to be converted to metallic form. It would have had to be  arranged with an extensive system of explosives that compress it in  order to start a chain reaction. That is a very difficult engineering  feat. Third,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693126/motion-to-discharge-sj-res-59"}, {"senator": "Greg Casar", "party": "Democrat", "sentence": "Mr. CASAR. Mr. Speaker, pursuant to clause 2(a)(1) of Rule IX, I rise  to give notice of my intention to raise a question of the privileges of  the House.\n\nThe form of the resolution is as follows:\n\nResolution censuring Representative Cory Mills.\n\nWhereas, Representative Cory Mills has on several occasions conducted  himself in a manner…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695580/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…address a topic of paramount importance to the American  people, and proud to acknowledge a colleague who has taken a very bold  stand. This is a colleague who has engaged in a form of protestation  that will not always be received initially with the kind of respect  that it merits.\n\nYet, as I have said before, dear friends, when you engage in  protestation,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…Mr. Speaker, this budget is a bad deal. It takes billions of dollars  from programs that working families rely on and gives that money to the  very wealthiest Americans in the form of $7 trillion in tax breaks.\n\nIt slashes funding for programs like Medicaid. Nearly 2 million  people in my State of New Jersey rely on Medicaid for healthcare. It  raises…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689914/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…issuing illegal stop work orders on fully permitted generation  projects, President Trump is waging a war on affordable, American-made  energy. Most recently, that came in the form of canceled energy  projects. Last week, the Trump administration unlawfully canceled  nearly $8 billion in Federal investments in 223 energy projects across  21 States, including…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…continue to collect       this information as part of its separate credit union       examination process and would continue publishing this       information in aggregated form.\n\nThe Congressional Review Act (CRA) requires that before a       rule can take effect, an agency must submit the rule to both       the House of Representatives and the Senate,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…and it is a concrete example that NPR's CEO was  giving false testimony to Congress.\n\nMr. Speaker, you either understand that you are biased and need help,  apparently in the form of taxpayer grants, or you haven't witnessed any  bias. You can't have it both ways.\n\nThen there is PBS. Again, I honestly don't know where to begin. On  top of the concrete,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…you now have your  premiums together, but it is defined as being separate.\n\nOnly in government can you define ``separate'' as meaning  ``together.''\n\nSo we still have this one form of healthcare in America that violates  this 50-year-old compromise: We don't use taxpayer dollars and compel  Americans who actually value children to pay for the taking of…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…have given the Biden  administration credit as well.\n\nBy and large, the records I have made public in this and the last  Congress are directly from whistleblowers in unredacted form to which  my office applied limited redactions or the records are from the  government in response to whistleblower disclosures that I have shared.\n\nThere have been examples…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…equality in the realms of political, social,  cultural, and economic rights, as well as equal participation of women  in political leadership, Mr. Speaker; abolishment of any form of  discrimination; the right to choose one's own clothing--figure that  out, how simple that should be, the right to choose one's own clothing  freely; the right to freely…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…persuasions have supported tighter  election laws for decades. In 2005, former President Jimmy Carter, a  Democrat, joined former Secretary of State Jim Baker, a Republican, to  form a Commission on election integrity. They identified voter ID laws  as the single most important reform that was needed--20 years ago.\n\nA vast majority of the American people…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…freedom is felt, and where opportunity isn't just a  promise; it is a way of life.\n\nAt the heart of Texas-26, Flower Mound shows what happens when faith,  family, and hard work form the foundation of a community.\n\nI congratulate the local leaders whose dedication made this  recognition possible. Flower Mound isn't just the best place to live in  America,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690708/flower-mound-texas-named-best-place-to-live-in-america"}, {"senator": "French Hill", "party": "Republican", "sentence": "…construed to prevent a State from submitting the       initial certification required under subparagraph (A) after       the required deadline under that subparagraph.\n\n``(2) Form of state certification not presented in a state       plan.--The initial certification required under paragraph       (1)(A), if not submitted with a State plan under paragraph…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…deductions,\n\n``(dd) nonrefundable credits,\n\n``(ee) credits under section 24, 25A, 32, 35, or 36B,       credits claimed with respect to undistributed long-term       capital gains on Form 2439, credits for Federal taxes paid on       fuels claimed on Form 4136, and any other refundable credits,\n\n``(ff) income tax,\n\n``(gg) other taxes,\n\n``(hh) total tax,\n\n``(ii)…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689359/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…including shore infrastructure;\n\n``(C) administrative and logistical support; and\n\n``(D) technology.\n\n``(7) Any other matter as determined relevant by the       Commandant.\n\n``(b) Form.--Each plan under subsection (a) shall be       submitted in unclassified form, but may include a classified       annex.\n\n``(c) Briefing Required.--Not later than February…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…have  said previously, proof of citizenship when registering to vote and the  presentation of a valid ID when at the ballot box. Currently, only 13  States do not require any form of voter ID. Having this requirement  should be the standard and not the exception.\n\nMy Democratic colleagues claim that requiring a photo ID to vote is  too burdensome. Some…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699945/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…their  billing practices. I called on that CEO to resign, and he was held  accountable, and he did. That company ultimately paid $62 million back  to my constituents in the form of accountability.\n\nNow, Optum, the healthcare company, which is a subsidiary of  UnitedHealth Group, the single largest health insurer in our country  and really one of only…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689084/economic-populism"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…has emerged relating to the       involvement of the Haqqani Network in terrorist attacks       targeting the United States Military or United States       civilians.\n\n(iii) Form.--The report required by this subparagraph shall       be submitted in unclassified form but may include a       classified annex.       SEC. 3. REPORT ON DIRECT CASH ASSISTANCE…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692738/no-tax-dollars-for-terrorists-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…people of Ukraine and the  Government of Ukraine under the administration of the United Nations.\n\nIn other words, he wants the people of Ukraine to give up their  democratic form of government and be run by the United Nations.\n\nThen, finally, President Putin said to President Trump: Oh, yes.  There is one other thing, too, before I will agree to a cease-fire…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689486/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…these squatters  illegally go into their homes, overstay their time in those homes, or  whatever it might be.\n\nIt is a big deal to help our servicemembers in any way, shape, or  form that we can to get people illegally out of their homes. It just  takes an undue stress off our servicemembers so that they can focus on  the missions at hand, which, again,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695472/servicemember-residence-protection-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…receive support from TFA as an organization throughout their time  teaching, and then they are also simultaneously pursuing a teaching  credential. Sometimes that takes the form of a master's of education,  which is what I received.\n\nFor example, when I was teaching 10th grade English, 1 day a week,  after spending the whole day teaching, I would then…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}]