[{"senator": "Julie Johnson", "party": "Democrat", "sentence": "…for $2 million to help our Dallas Police Officers  tackle violent crime, gangs, and drug trafficking. I am working to  secure over $1 million to upgrade security at Dallas Fort Worth  International Airport because keeping Americans safe should not be up  for debate.\n\nWe can fund these programs, but instead of trying to make government  work, Republicans…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688712/dont-vote-for-a-bill-that-dismantles-the-government"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "Mr. VEASEY. Mr. Speaker, I honor Sharon Lavonne Harris Rischer, a  beloved member of our Fort Worth community, who passed away on February  12, 2025, at the age of 70. Sharon was a dedicated daughter, mother,  sister, aunt, and friend, whose impact will be felt for generations…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687993/recognizing-sharon-lavonne-harris-rischer"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "Mr. DOGGETT. Mr. Speaker, Saturday was a great day for progress in  Texas, from Houston to Fort Worth. For almost a year after the tragic  death of our late colleague, Sylvester Turner, the citizens of the 18th  Congressional District of Texas in Houston have been denied…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699521/welcoming-the-honorable-christian-d-menefee-to-the-house-of-representatives"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…pivotal role in preserving  the rich customs, language, values, and traditions of the Igbo people,  while also fostering cross-cultural understanding throughout the  Dallas-Fort Worth Metroplex. The annual Igbo Day Celebration is much  more than a cultural gathering--it is a powerful celebration of  identity.\n\nICAN DFW has been instrumental in building…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694153/recognizing-the-igbo-community-association-of-nigeria-dalles-fort-worth"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…humor. His legacy goes far beyond the wins. He helped the University of  Texas-Arlington Movin' Mavs wheelchair basketball program start, and he  was also very active in the Fort Worth chapter of Kappa Alpha Psi.  Coach LeGrand, or Snake, as everybody affectionately called him, was  someone everyone loved.\n\nMadam Speaker, you would see him in downtown Fort…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693978/9999"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "Mr. GOLDMAN of Texas. Mr. Speaker, I rise today to honor Mr. Jeffrey  L. DeWitt on his retirement from the Fort Worth Fire Department after  37 years of dedication and service to the City of Fort Worth. Founded  152 years ago, the Fort Worth Fire Department is a nationally  recognized agency…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689725/9999"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…bachelor's degree in  criminal justice from East Texas A&M University. He began his lengthy  law enforcement career in 1974 as a Department of Public Safety officer  at Dallas Fort Worth International Airport. He worked his way up the  ranks to become a Highway Patrol trooper, Narcotics Service Sergeant,  Texas Ranger, and Texas Ranger supervisor. After retiring…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690196/recognizing-congressional-patriot-award-recipient-sheriff-lane-akin"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…community in Texas, not even a few days old, with a  150,000-square-foot Muslim community center, was opened in Houston,  called EPIC City. It is in Plano, outside of Dallas-Fort Worth and it  has raised all sorts of questions about their intentions to create an  effectively Muslim-only community where sharia law no doubt would and  will be practiced. Now…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…basis with one of  my fellow colleagues, Lloyd Doggett, from Travis County, Texas.\n\nMr. Speaker, today, we became the beneficiaries of seeing the Corps  of Engineers from the Fort Worth District visit us to talk about the  water needs and the infrastructure of our water programs in Texas.\n\nToday, I rise to recognize Kathleen Spillane, chief of the Civil…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691207/recognizing-kathleen-spillane"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…outside of that program, with even fewer protections and  less vetting.\n\nBut the following week after Thanksgiving, another parolee nearly  committed a terrorist attack in Fort Worth, TX. Thanks to the Federal  and local law enforcement, they were able to apprehend him and prevent  him from carrying out that attack.\n\nI am grateful to the Department of…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…served.\n\nIn his professional life, Mr. Branch has spent more than 25 years  owning and operating multiple businesses that serve Royse City, Caddo  Mills, and the greater Dallas-Fort Worth Metroplex. Throughout his  career, he has earned widespread respect for his openness,  transparency, and steadfast dedication to doing what is right,  regardless of popularity.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698298/recognizing-the-success-of-james-branch"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…and leading the world in the engineering and manufacturing of  heating and air-conditioning products.\n\nI also visited Alliance, TX, which is actually in Tarrant County or  Fort Worth, which is now a massive, master-planned, mixed-use  development in North Texas. Alliance is home to a number of important  businesses, residential neighborhoods, and a thriving…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…civic and philanthropic causes. At just 23 years old, he  became the youngest treasurer of a Jewish Community Center in the  United States when he assumed that role at the Fort Worth Jewish  Community Center. His leadership and vision led him to soon become  president of the Center as well as Treasurer of the Fort Worth Art  Museum, now The Modern, setting…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693060/recognizing-the-75th-birthday-of-marshall-brachman"}]