[{"senator": "George Latimer", "party": "Democrat", "sentence": "…civic commitment of  an organization of active and concerned citizens in Scarsdale who labor  to involve everyday residents in the important issues of the day, the  Scarsdale Forum.\n\nThe organization traces its roots back over 120 years to 1904, with a  charitable and educational mission at its core. The forum sponsors  events and seminars addressing…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699265/recognizing-the-scarsdale-forum"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…a federal law enforcement officer would       talk this way about shooting me--a woman who he swerved into.       It was both eye-opening and heartbreaking.\n\nThis hearing--a forum that had no official status in the U.S. Senate  but  provided a platform to these victims of government brutality and  overreach--was, indeed, eye-opening and heartbreaking…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…authoritarian governments.\n\nAnd while it is foolish and shortsighted, it is also not surprising  to hear Defense Secretary Hegseth recently declare, at the Reagan  Defense Forum, an end to what he calls ``idealistic utopianism,'' while  calling for a renewed focus on the Western Hemisphere.\n\nSo what exactly does a renewed focus on the Western Hemisphere…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…across the finish line. I  am giving a big shout-out to the American Cancer Society Cancer Action  Network, PanCAN, the Prevent Cancer Foundation, the National Minority  Quality Forum, and so many others.\n\nThanks to their tireless advocacy, H.R. 842 is the most cosponsored  bill in the 119th Congress with 339 cosponsors in the House and 68  cosponsors in…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699298/we-will-beat-cancer"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…fostering cooperation and partnership. In addition to his many other  community-focused initiatives, he convened monthly joint military-- community meetings, creating an essential forum for dialogue,  coordination, and mutual support among base leadership, local  stakeholders, and elected officials.\n\nAs he steps down from this role, I am proud to join our…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700086/recognizing-gene-fisher-and-his-dedicated-service-to-the-county-of-ventura"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…concept point 9 months later, but he did talk about HSAs.\n\nI was looking at that, doing a little research, and an economist,  Doug Holtz-Eakin, who works for the American Action Forum, a  conservative think tank, said this: ``There is a place for health  savings accounts to augment insurance and fill things out around the  edges, but it can't be the core…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…and minorities could no longer  be excluded from the clinical studies that guide lifesaving treatments.\n\nCo-founded the Congressional Caucus for Women's Issues, a bipartisan  forum that remains a cornerstone of women's advocacy in Congress today.\n\nSecured a historic increase in federal breast cancer research  funding, exceeding $400 Million, and mandated…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695548/moment-of-silence-for-mary-rose-oakar"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…for Haitian nationals. Therefore, I include  in the Record their testimonies:\n\nThank you, Congresswoman Ayanna Pressley and Senator Ed       Markey, for holding this public forum to hear directly from       TPS holders like myself.\n\nMy name is Jose Urias, and I am a TPS holder from El       Salvador. I am also one of the Co-Coordinators of the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…exemplary  philanthropic contributions. His relentless leadership has been  recognized by a variety of organizations such as the United Nations,  UNESCO, and the World Economic Forum. He has also dedicated his time  serving on the Executive and Central Committees and Faith and Order  Commission of the World Council of Churches.\n\nPatriarch Bartholomew has…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695458/welcoming-the-ecumenical-patriarch-bartholomew-of-constantinople-to-washington-dc"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Islands' top exports to the U.S., including tuna, cane  sugar, ginger and taro, would be eligible for duty-free treatment under  GSP but for this lapse.\n\nThe Pacific Islands Forum (PIF), the leading multinational political  organization for the Pacific Islands region, has prioritized the  region's need to build trade capacity and infrastructure and has…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697950/supporting-the-prosper-in-the-pacific-act"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…leadership, he has  received numerous awards and international recognition.\n\nPatriarch Bartholomew has addressed the United Nations, the European  Parliament, and the World Economic Forum, earning accolades from around  the world. In recognition of his global contributions, he received the  Congressional Gold Medal in 1997. In September 2025, Patriarch  Bartholomew…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695550/recognizing-his-all-holiness-bartholomew-archbishop-of-constantinople-and-ecumenical-patriarch"}, {"senator": "Lizzie Fletcher", "party": "Democrat", "sentence": "…Coalition and later her work in the Office of  Congressman Eric Swalwell, where she served as a senior legislative  assistant, senior advisor, and inaugural director of Future Forum.  During that time, Sarah also earned her Master of Arts in Security  Studies from Georgetown University.\n\nAt the start of the 116th Congress, in January 2019, Sarah joined…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695833/recognizing-sarah-kaplan-feinmann"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…its longstanding contributions to economic development,  entrepreneurship, and civic engagement in the Greater Chicago region.\n\nFounded in 1988, TACCGC has served as a vital forum for professionals  and business leaders from a wide range of industries, fostering  collaboration, supporting business growth, and strengthening the local  economy.\n\nBeyond…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698927/commending-the-taiwanese-american-chamber-of-commerce-of-greater-chicago"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "Mr. SCOTT of Virginia. Mr. Speaker, I include in the Record the  following:   opening remarks from civil rights forum on trump's attacks on students,                           workers, and families\n\nWe have seen this Administration attack diversity, equity, inclusion,  and accessibility in…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Law Project, the Economic Policy Institute, and the National  Partnership for Women and Families; one letter from SEIU; and one  letter from the U.S. Sustainable Investment Forum. The link is: https:/ /house.app.box.com/s/xpixugm5qpckl4kxrc4h4u55i3to8roy\n\nMr. Speaker, right now across the country, workers are struggling to  pay their bills and meet…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Freedom, AdvanceUSA, Concerned Women for American Legislative Action  Committee, the Coalition for Jewish Values, the Commission of the  Southern Baptist Convention, Eagle Forum, Family Watch International,  Faith and Family Foundation, Independent Women's Forum, Students for  Life Action, the Family Policy Alliance, and the Faith and Liberty in  the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "John Thune", "party": "Republican", "sentence": "…course, I should also mention that, before any floor  consideration, all of these nominees will have gone through the  committee process, which will have provided still another forum for  Members to air concerns.\n\nThe amendment to the rules Republicans are proposing is an idea with  a bipartisan pedigree. It would restore Senate precedent, and it would…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695295/rules-change"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…(3) Although Taiwan is not an IMF member, it is a member of       the World Trade Organization, the Asian Development Bank, and       the Asia-Pacific Economic Cooperation forum.\n\n(4) According to the January 2020 Report on Macroeconomic       and Foreign Exchange Policies of Major Trading Partners of       the United States, published by the Department…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…and immunities to the European                Organization For Nuclear Research (CERN). Sec. 4. Extension of privileges and immunities to the Pacific Islands                Forum. Sec. 5. Extension of privileges and immunities to the Caribbean                Community. Sec. 6. Extension of certain privileges and immunities to the African…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694822/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…deregulatory agenda President Trump instituted, which resulted in  the creation of the SBA Office of Advocacy's Red Tape Hotline, captures  this reality.\n\nIt does so by creating a forum by which to partner with the small  businesses of America, who can identify sector-specific regulations  that impose undue regulatory compliance challenges and costs.\n\nBy voting…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697347/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…``covered platform'' means a       website, online service, online application, or mobile       application--\n\n(i) that serves the public; and\n\n(ii)(I) that primarily provides a forum for user-generated       content, including messages, videos, images, games, and audio       files; or\n\n(II) for which it is in the regular course of trade or       business…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690186/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…to get involved in politics, Ronald Reagan, did back in the  day.\n\nI said that I want to be like that guy, and it was for a lot of  reasons. I just got back from the economic forum out there in  California and saw the museum. I was reminded of what a statesman  leader he was and how he was the right person to work with Tip O'Neill  and our Democratic…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…college, university, or other institution of higher       education;\n\n(C) a nonprofit organization;\n\n(D) an angel investor group;\n\n(E) an incubator or accelerator;\n\n(F) a venture forum, venture capital association, or trade       association, other than an association created solely for the       purpose of sponsoring an event described under this       subsection;…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692725/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…one of the districts in California, or  anywhere else in the country, should have the ability to make  nationwide decisions as a district court judge.\n\nThis bill would prevent forum shopping and somewhat restore checks  and balances to our judicial system in the country by providing that we  have a randomly selected three-judge panel.\n\nAlso included in…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Brotherhood of Electrical Workers Local       Union 1426; International Brotherhood of Electrical Workers       Local 160.\n\nUp North Jobs Inc.; Minnesota Conservative Energy Forum;       Green Bridge Metals; City of Babbitt, MN--Mayor Andrea       Zupancich; Duluth Area Chamber of Commerce; Laurentian       Chamber of Commerce; Hermantown Area Chamber…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…debate, tackling the timely question of artificial general  intelligence. With four career State titles and a remarkable 29-3  record, Claire's leadership is unmatched.\n\nIn public forum, seniors U.V. Singh and Grayson Smith went  undefeated, while sophomore Dylan Hancock earned Salem's first-ever  congressional debate title with near-perfect speaker scores.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691284/congratulating-salem-high-school"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…ranchers is  incredibly important to the rural communities I represent in Missouri,  a point I have made in my travels to the regions going back to 2015  when I attended the AGOA forum in Gabon.\n\nAfter we take this step, we can build further. Americans would  benefit if African nations graduated into formal bilateral trade  agreements with the U.S.\n\nRight…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…African continent.\n\nOK, you say, what is the harm in that? Well, I am going to tell you  in a second.\n\nChina also convinced Mauritius to become a partner in what is called  the Forum on China-Africa Cooperation trade and security agreement.  That is between China and 53 African nations. What does that do? That  also maintains a commitment to building nuclear…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699482/9999"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…and public safety communications.\n\nA hallmark of the body has been the collaboration between the  representatives of private industry, government, and other stakeholders  in a forum that facilitates information sharing and the advancement of  important issues.\n\nLast fall, we saw one of the most significant attacks on our Nation's  communications networks…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693435/communications-security-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…following organizations have endorsed this resolution, including:  AMAC Action, America First Policy Institute, the D.C. Police Union,  Heritage Action, the Independent Women's Forum, the International  Franchise Association, the National Association of Convenience Stores,  the National Association of Wholesaler-Distributors, the National  Restaurant Association,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}]