[{"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "She has rebounded wonderfully, and she will be happy  to know that going forward she will have an alternative.", "title": "Whole Milk for Healthy Kids Act of 2025", "date": "2025-12-15"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "I look forward to seeing the work that she will continue to do in  shaping the spiritual lives of those around her.", "title": "Recognizing A'shellarien Addison", "date": "2026-01-13"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "I am deeply grateful to a number of my colleagues on both sides of  the aisle, and I am looking forward to Senator Cassidy's comments just  now.", "title": "Support for Patients and Communities Reauthorization Act of 2025", "date": null}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "Speaker, I thank my colleague, Representative Boebert, for  bringing this forward.", "title": "Finish the Arkansas Valley Conduit Act", "date": "2025-07-21"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "It is pretty straightforward.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Walk-In Coolers and Walk-In Freezers''", "date": "2025-03-27"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "As we  continue to build a thriving and sustainable future, we look forward to  having businesses like Applewood Seed at the forefront of our state's  economic success.", "title": "Recognizing Applewood Seed Company", "date": null}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "I look forward to continuing a productive partnership with       the Committee--one that respects the will of DC residents and       honors the principles of home rule.", "title": "Common-Sense Law Enforcement and Accountability Now in DC Act of 2025", "date": "2025-11-19"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "I look forward  to seeing what the next 50 years will bring for FRH as they continue to  provide critical housing resources for our community.", "title": "Recognizing Foothills Regional Housing", "date": null}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "First, this bill was already the largest cut in Medicaid in American  history, but now these cuts have been rushed forward and will happen as  soon as next year.", "title": "Budget Reconciliation", "date": "2025-05-22"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "I strongly urge a ``yes'' vote on this bipartisan motion so that we  can take a meaningful step forward in this Congress to address the  healthcare crisis in the United States of America.", "title": "Providing for Consideration of H.R. Breaking the Gridlock Act", "date": "2026-01-07"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "With Nicolas Maduro now in the rearview mirror, we must look forward  and craft policies that support a free and democratic future for  Venezuela and policies that return war powers to the United States  Congress, as enshrined in the United States Constitution.", "title": "Venezuela", "date": "2026-01-08"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "He is now the determinant to go forward and  reduce government in a way that is not utilizing the strength of  inspectors general or institutional memory that can best guide the  academics to do that with the greatest degree of efficiency.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Waste Emissions Charge for Petroleum and Natural Gas Systems: Procedures for Facilitating Compliance, Including Netting and Exemptions''", "date": "2025-02-26"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "We passed an authorization, and in that  debate, Syria stepped forward and said they would give up their  chemical weapons program.", "title": "Motion to Discharge--S.J. Res. 59", "date": "2025-06-27"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "Only one Republican  has stepped forward and cosponsored my legislation to eliminate the  capital gains allowance, the tax incentive for investing in Chinese  stocks.", "title": "Problems Caused By Doge Cuts", "date": "2025-02-27"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "He  met the test that night and continued forward.", "title": "Building A Beloved Community", "date": "2026-01-20"}, {"senator": "Greg Murphy", "party": "Republican", "sentence": "I applaud Representative Buchanan, Representative Panetta, and  Chairman Smith for bringing this forward.", "title": "Chronic Disease Flexible Coverage Act", "date": "2025-03-04"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "Speaker, the intent of Congress in enacting the  CLARITY Act is clear: to reestablish the United States as the global  leader in digital asset markets by ensuring our regulatory framework is  clear, forward-looking, and functional.", "title": "Digital Asset Market Clarity Act of 2025", "date": "2025-07-23"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "This legislation passed the House Judiciary Committee by a voice vote  earlier this year, and I am looking forward to seeing it pass the full  House.", "title": "Trafficking Survivors Relief Act", "date": "2025-12-01"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "With respect to the resolutions of inquiry, let me put out there that  it is my strong preference, as I have said multiple times on the floor  of the House, that we come up with a system that allows the body to  work its will and that we allow individuals to be able to move forward  in good faith to get information and ask questions of the executive  branch, no matter who is in power.", "title": "Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the National Park Service Relating to ``Glen Canyon National Recreation Area: Motor Vehicles''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the United States Fish and Wildlife Service Relating to ``Endangered and Threatened Wildlife and Plants; Endangered Species Status for the San Francisco Bay-Delta Distinct Population Segment of the Longfin Smelt''; Providing for Consideration of H.J. Res. Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine Pollution Control Standards; Heavy- Duty Vehicle and Engine Emission Warranty and Maintenance Provisions; Advanced Clean Trucks; Zero Emission Airport Shuttle; Zero-Emission Power Train Certification; Waiver of Preemption; Notice of Decision''; Providing for Consideration of H.J. Res. Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine Pollution Control Standards; Advanced Clean Cars Ii; Waiver of Preemption; Notice of Decision''; Providing for Consideration of H.J. Res. Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine and Nonroad Engine Pollution Control Standards; the `omnibus' Low NoX Regulation; Waiver of Preemption; Notice of Decision''; and for Other Purposes", "date": "2025-04-29"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "This gives our  defense industry the base they need to continue the important work they  do in so many of our communities and paves the road for a smoother  procurement process going forward.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "I look forward to stopping in  again to see all of them in the future.", "title": "Fun with Math", "date": "2025-12-03"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Today, we celebrate Justin's achievement and look forward to his next  incredible successes both on and off the field.", "title": "Fletc Celebrates 55 Year Anniversary", "date": "2025-06-26"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "I look forward to continuing to work with stakeholders and veterans  groups to find ways to make even more improvements to the Fox Grant  Program, but I won't let perfect be the enemy of the good.", "title": "No Wrong Door for Veterans Act", "date": "2025-05-20"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "That conviction is why so  many of my pro-life colleagues step forward to lead legislative efforts  to protect vulnerable preborn babies and their mothers.", "title": "Rounds, Mr. Wicker, Mr. Lankford, Mr. McConnell, Ms. Lummis,", "date": "2026-01-27"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "We look forward to watching him lead Team  USA to victory.", "title": "Congratulating Ellen Lampton", "date": "2026-02-10"}, {"senator": "French Hill", "party": "Republican", "sentence": "I look forward to seeing Keaton's continued impact in central  Arkansas  and wish him the best of luck in his bright future in banking.", "title": "Keaton Beasley Teaches Importance of Financial Literacy", "date": "2025-03-24"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "3301, the ELEVATE  Act, and thank Congressman Nunn for his leadership on this forward- looking and bipartisan bill.", "title": "Encouraging Local Emerging Ventures and Economic Growth Act of 2025", "date": "2025-06-23"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Industries       pursuing the responsible development of these resources, from       the mining companies who have invested in the region to the       suppliers to the high-skilled workers seeking employment,       have been negatively impacted by the enactment of the mineral       withdrawal, as have the communities in the region that want       to see mining projects move forward for the betterment of the       local and statewide economy.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to Public Land Order No. 7917 for Withdrawal of Federal Lands; Cook, Lake, and Saint Louis Counties, Mn", "date": "2026-01-21"}, {"senator": "James Risch", "party": "Republican", "sentence": "President, I rise today to raise a point of order on  the War Powers Resolution before the Senate, which I reserve the right  to do at the close of my remarks and after Senator Kaine moves the  matter forward.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "John Thune", "party": "Republican", "sentence": "I am looking forward to hearing the  President discuss his accomplishments so far and outline his vision for  our country.", "title": "Joint Session of Congress", "date": "2025-03-04"}]