[{"senator": "Judy Chu", "party": "Democrat", "sentence": "…Wildfires, like all natural disasters, know no political parties, and  never in our country's history has Congress placed policy conditions on  aid for disaster victims.\n\nI look forward to passing this legislation and then continuing our  work to support survivors with a supplemental disaster aid package.\n\nMr. Speaker, this bipartisan bill is a commonsense…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689384/filing-relief-for-natural-disasters-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…methods and human ingenuity to continue to  create custom seed blends that fit the needs of any customer. As we  continue to build a thriving and sustainable future, we look forward to  having businesses like Applewood Seed at the forefront of our state's  economic success.\n\nOn behalf of the people of Colorado's 7th Congressional District, it  is my honor…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695842/recognizing-applewood-seed-company"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…invite President Trump to Ohio to visit these companies. He can  change these decisions by his Secretary of Energy.\n\nAmerica can't look in the rearview mirror. We have to look forward to  America's new energy future, and the Department of Energy's misguided  decisions will really hurt American advanced manufacturing.\n\nOhio knows what it means to get left…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691905/department-of-energy-project-cancelations"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…more expensive healthcare, but that is what the Republicans and Donald  Trump have given them in just 1 year in office.\n\nSo Democrats will show the American people another way forward, a way  focused on lower costs, more prosperity, and an agenda focused on the  working- and middle-class families of America--not the billionaires,  not the special interests,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…resources.\n\nMr. Speaker, I am proud to support my colleagues who have worked on  this important bipartisan legislation both here in the House, as well  as the Senate. I look forward to seeing it passed into law, and I  reserve the balance of my time.\n\nMr. JOHNSON of South Dakota. Mr. Speaker, I have no further speakers.\n\nMr. FIGURES.  Bonamici).\n\nMr.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698191/save-our-seas-amendments-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…terms of national  security, consumer protection, and systemic risk.\n\nI am so pleased that the majority leader has said that we will have  an open amendment process, and I look forward to filing a series of  amendments to address the problems in the bill. I hope that, together,  we can come up with a much better version.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691451/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…approach led to a permanent extension of the  Bush tax cuts and the first of what would be three downgrades--three  downgrades--to our country's Federal credit rating.\n\nFast-forward to 2017 when, instead of working with Democrats to enact  responsible tax reform, Republicans followed the same old, tired  script. They pushed through a partisan law that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695675/cloture-motion"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…for our families.\n\nI implore the Members of Congress to stand up for the Federal  workforce that has been traumatized and decimated this year, while we  continue to put bills forward that put more work on the backs of those  that are left and ignore the fact that there is not a sufficient  workforce to do any of the work that we have in these bills that…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697891/electric-supply-chain-act"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…commission and earn the support from both Democrats and Republicans alike in the Senate. Byron Conway has a proven track record and temperament for this position, and I look forward to seeing him faithfully serve Wisconsin’s Eastern District with fairness and distinction.\"", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1681935/senate-confirms-baldwin-johnson-nominee-for-us-district-court-for-the-eastern-district-of-wisconsin"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…business of keeping people online. Rather,  they serve as a platform for community engagement. I believe these  platforms can serve as a model for content moderation, and I look  forward to working with my colleagues to find ways to continue to  provide protection for platforms that promote respectful exchange among  users.\n\nI have long advocated for free…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698531/sunset-section-230-act"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…was not a legitimate President, and unauthorized military action  is illegal without the consent of Congress.\n\nWith Nicolas Maduro now in the rearview mirror, we must look forward  and craft policies that support a free and democratic future for  Venezuela and policies that return war powers to the United States  Congress, as enshrined in the United…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698765/venezuela"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…places when  President Biden was the President, but it is still an important bill.\n\nThis is a commonsense bill. It is bipartisan, and I am happy to be a  cosponsor. I look forward to the gentlewoman from South Carolina, the  gentlewoman from Georgia, the gentlewoman from Colorado, the gentleman  from Illinois, and all the other people who have been…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697207/count-the-crimes-to-cut-act"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…had a process of approval through the United States  Senate, and is functioning through a ghost agency of government  oversight of efficiency. He is now the determinant to go forward and  reduce government in a way that is not utilizing the strength of  inspectors general or institutional memory that can best guide the  academics to do that with the greatest…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688179/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…gentleman for yielding.\n\nMr. Speaker, I rise in strong opposition to this resolution. S.J.  Res. 31 is irresponsible, especially as we wait to see whether  Republicans will bring forward their budget bill to strip healthcare  from millions of Americans to give tax breaks to billionaires.\n\nHowever, this resolution would allow 1,800 facilities that emit the…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691592/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…nothing to do with public safety. In fact, what  is going on in Minnesota is hurting public safety. As Senator Klobuchar  said, police chiefs of suburban communities have come forward and said:  This is not sustainable. This is dangerous.\n\nA police chief told the story about how one of his own officers, who  was off duty, was stopped for no reason by ICE…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…support: stronger families, a more resilient workforce,  and a healthier economy. Let's give employers the tools to help give  workers the support they need and move our country forward.\n\nMr. Speaker, I thank Representative Messmer for bringing this bill  before us. I encourage my colleagues to support it, and I yield back  the balance of my time.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699006/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…employment,       have been negatively impacted by the enactment of the mineral       withdrawal, as have the communities in the region that want       to see mining projects move forward for the betterment of the       local and statewide economy.\n\nCongress now has the opportunity to correct a detrimental       action that ran contrary to our national interest,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Record during consideration of H.R. 2643 on the       House floor. I appreciate the cooperative manner in which our       committees have worked on this matter, and I look forward to       working collaboratively in the future on matters of shared       jurisdiction. Thank you for your attention to this matter.            Sincerely,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694815/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…development, or transportation.\n\nThe PERMIT Act is about delivering certainty and efficiency without  compromising environmental standards. I am proud to support it, and I  look forward to getting this across the finish line for Utahns and for  Americans across the country.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698029/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "…their  bipartisan leadership on this issue. Their work demonstrates the kind  of accountability and integrity that Congress needs more of. Their  efforts are a critical step forward toward rebuilding trust in our  institutions, and I look forward to working with them to codify this  into law.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691215/stock-trading-ban-for-members-of-congress"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…urge my colleagues on both sides of the aisle to support H.R. 6019  to repeal this legislation. I thank my colleague, Congressman Austin  Scott, for bringing this legislation forward.\n\nMr. AUSTIN SCOTT of Georgia. Mr. Speaker, wow. There has been a lot  said in the last few minutes.\n\nLet's be clear: Senate Democratic leadership knew about the language,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696929/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…threaten our most dependable power  sources with the American people paying the price.\n\nThe Reliable Power Act puts an end to this by preventing Federal  rules from moving forward if they threaten the ability of the grid to  keep the lights on. This legislation ensures proper coordination  between FERC, the Federal Energy Regulatory Commission, and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698277/reliable-power-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…across America because we believe  that America is back. The respect is back, especially after the  failures of what happened in Afghanistan.\n\nWith this in mind, how do we move forward? One of the things that has  really disappointed me is this debate we have had about Medicaid. I  happen to know a lot about Medicaid because I  am a former member of the…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692334/election-promises-made-promises-kept"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…and the entire team on this remarkable  accomplishment.\n\nThrough unity, tradition, and excellence they have cemented their  place in Columbus and Miami-Dade County history. ``Forward'';  ``Adelante.''", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689833/congratulating-christopher-columbus-high-school-explorers"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…humility are shown in everything he does, always reminding us of how  important it is to give back to our community and to our country.\n\nI can personally attest to the genuine and forward-thinking spirit  that Jeff brings to every opportunity. His leadership strengthens South  Carolina agriculture, ensures the future of family farming, and honors  the heritage…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695599/recognizing-jeff-wilson"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…banks thrive in today's competitive environment, providing for  a shot clock on the review of those merger applications and providing  better outcomes for consumers.\n\nI look forward to marking up this important legislation in the House  Financial Services Committee this week.\n\nThe OCC's merger rule under the Biden administration would have taken  us in…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "John James", "party": "Republican", "sentence": "…disabilities had access to public education. Today, millions succeed  because of IDEA.\n\nWith the IDEAL Act, we reaffirm our commitment. We finish the job. We  keep moving forward, not backward.\n\nI urge my colleagues to support the IDEAL Act.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697119/marking-a-national-milestone"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…practical solutions. S.J. Res. 31, like  other measures undoing ill-advised Biden-era policies, represents a  decisive step in the right direction.\n\nLet's get back to smart, forward-thinking policies that actually  serve the American people, not far left activists and D.C. bureaucrats.\n\nMr. Speaker, I urge my colleagues to support this rule, and I reserve…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…offices, and think  strategically about the House's future physical space needs. Derek has  always remained open to ideas and solutions and is committed to finding  the best path forward for the institution in service to its Members,  staff, and the taxpayer.\n\nI am fortunate to have worked with Derek and know he will be missed  by many House Members and staff.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696851/thanking-derek-harley-for-his-service-to-the-house"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…Along with Senate Ag Committee chairman Senator Boozman, we have done  a lot of work, and we are ready to go when the President and the  Secretary decide it is time to move forward with a plan that will help  bridge that gap and keep our producers afloat. Doing so will give the  administration's trade team needed leverage in these negotiations with…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696017/9999"}]