[{"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Executive-in-Residence for George Mason University's  Recreation Management Program, Chairman of the Board of Visit Fairfax,  and a member of the Board for The Community Foundation for Northern  Virginia.\n\nMr. Speaker, Paul Gilbert's decades of vision, leadership, and  dedication to our parks system will benefit our region for generations  to come.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697129/recognizing-nova-parks-executive-director-paul-gilbert-on-the-occasion-of-his-retirement"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…athlete. He was named to the Dean's List, served as  Chair of the Political Science Club, and received several athletic  honors, including selection to the National Football Foundation  Hampshire Honor Society, the ESPN The Magazine Academic All-District  Team, and NCAA Football All-American honors.\n\nMr. Younger continued his academic pursuits at the Mississippi…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695590/9999"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…Modeling Education Act is just one  answer to this challenge. It is a bipartisan bill, and it directs $10  million of already-appropriated money to the National Science  Foundation for a grant program that will support the modernization of  mathematical and statistical modeling for education across this Nation.\n\nAs a former educator myself and an engineer…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688979/mathematical-and-statistical-modeling-education-act"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…Native Hawaiian community. He secured Federal dollars for the dredging  and construction of Pearl Harbor, helped establish Hawaii Volcanoes  National Park, and laid the foundation for Hawaii's modern government  structure and its county system, which remain in place today. Prince  Kuhio also established Hawaii's Hawaiian Civic Club, beginning a  movement…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695588/hawaiian-history-month"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…essential. It provides $6 a day in food  assistance to hungry Americans, just $6. It is a small amount, but it  is enough to lift up millions out of poverty and create a foundation of  health and well-being. Just $6 can create a pathway to opportunity.\n\nInstead, Republicans want to take away food from hungry people, not  to balance the budget, because…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691770/151-days-without-a-vote-to-lower-costs"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…schoolteacher, I know very well the value  of education as a tool for upward mobility.\n\nThe knowledge and skills our young people learn in our schools are  crucial to securing a good foundation for vocations and professions-- that provide financial security and family stability for decades to  come.\n\nThe destruction of the Department of Education is compounded by…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. PALLONE. Mr. Speaker, I rise today to recognize the American  Hungarian Foundation (AHF) in New Brunswick, New Jersey as it  celebrates its 70th Anniversary this year. Since its incorporation in  1955, AHF has provided a cultural bridge between Hungary…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689612/9999"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…advance China's interests.\n\nThis wholesale, thoughtless, and illegal destruction of USAID is  playing out across the government. DOGE has told the U.S. African  Development Foundation and the Inter-American Foundation, agencies  established and funded with direct appropriations by Congress, that  their budgets are being slashed.\n\nElon Musk doesn't know…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…lawlessness that are happening  every day, right now, in the streets of America, in the neighborhoods  of our great country.\n\nThey are a betrayal of the rule of law that is the foundation of our  Nation. It should shock America's conscience, and I believe it has, as  it has shocked mine. These kinds of brazen, abusive, lawless tactics do  not represent our…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699087/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…advocate, Nabaraj KC has earned  recognition on local and national levels. As President of the College  Point Civic and Taxpayers Association and the Dil Kumari KC Memorial  Foundation, he has led initiatives that raised more than $3 million  worth of food, personal protective equipment, and other important  resources to communities in need during the COVID-19…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695611/recognizing-navin-kc-luna-shrestha-and-nabaraj-kc"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…will lose care and support that keep  them healthy and independent. That is the bottom line. No rationalizing  away what is happening here.\n\nThis is from the Cystic Fibrosis Foundation. I could give you so many  examples. I don't want to use up all the time. The Cystic Fibrosis  Foundation says:\n\nWhile people with chronic illnesses like cystic fibrosis…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Muscogee Association of Educators. On May 9,  2021, Judy was awarded the Jim Buntin Leadership Award for Excellence  in Education for the Muscogee Educational Excellence Foundation, which  was a special honor for her as this award was named after her close  friend and former Muscogee County School Superintendent.\n\nJudy eventually moved to California…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690837/in-memory-of-the-honorable-judy-thomas"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…organizations.  Even after retiring from the Chaffey College Governing Board, Kathleen  will continue to support students across the region as a member of the  Chaffey College Foundation Board.\n\nFor her outstanding service to our students and community, it is my  honor to recognize Kathleen Brugger. Her commitment to the Inland  Empire and beyond is worthy…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697315/recognizing-chaffey-college-trustee-kathleen-brugger"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…preference  before us today for extension is a family less vulnerable to gang  coercion, extortion, or recruitment.\n\nThere is no path to stability in Haiti without creating a foundation  for economic opportunity. The HOPE/HELP program does exactly that. We  simply cannot afford to abandon the thousands of Haitian families who  depend on this program, nor…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698851/haiti-economic-lift-program-extension-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…it will endure for future generations.\n\nOn his retirement, Dave said: ``When I first joined RIMA, my goal was  to strengthen our voice, expand our reach, and build a solid foundation  for the future.'' He has certainly done that, stabilizing the industry  after years of decline, with more than 1,500 manufacturing companies in  Rhode Island now employing…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697432/recognizing-sarah-dully-rhode-island-teacher-of-the-year"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…performance, she has received  a number of awards recognizing her exceptional teaching abilities,  including the Outstanding Teachers of America Award from the Carlston  Family Foundation, the Olmsted Prize for Excellence in Secondary School  Teaching from Williams College, and most recently the Teacher of the  Year Award from Mono County.\n\nMs. Taylor is known…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…CEO in 2010 and has  marked his tenure as a vocal advocate for people with disabilities.\n\nBefore his position with UDS, Bill was the Chief Operating Officer  for the Inglis Foundation, a Philadelphia housing and community  services organization for disabled individuals, and he was Regional  Vice President for Apria Healthcare and CEO for the Kairos Foundation.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690790/congratulating-bill-kepner-on-his-retirement"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…Community Partner of the Year; Vectra Bank Colorado, Outstanding  Corporate Member of the Year; Rebecca Gomez, Gil Padilla Outstanding  Ambassador of the Year; El Pomar Foundation, Outstanding Non-Profit  Member of the Year; and Freddie Martinez Agency, for the Joseph P.  Roybal Outstanding Small Business of the Year.\n\nI congratulate all the awardees…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700094/congratulating-the-latino-chamber-of-commerce-of-pueblo-dinner-dance-awardees"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…emergency  service providers, it creates a challenge to adequately meet the health  and safety needs of our communities.\n\nAccurate workforce data is not just numbers. It is the foundation for  equitable funding, targeted training, disaster responsiveness, and  enhanced workplace safety. It empowers us to stand behind the men and  women who respond to more…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693039/supporting-our-first-responders"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "Mrs. CAMMACK. Mr. Speaker, today we recognize and cerebrate the  legacy of a group of individuals whose passion for the game of baseball  helped lay the foundation for college athletics at Santa Fe College in  Gainesville, Florida.\n\nIn the 1970-71 academic year, at what was then known as Santa Fe  Junior College (SFJC), a group of players…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691678/recognizing-the-gainesville-nine"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…building armed drones, and expanding its nuclear  weapon program at an alarming rate.\n\nThe Iran threat is wide-ranging and multifaceted, and the Iran  Sanctions Act is the foundation of our tools to combat this threat. We  know this threat isn't going away anytime soon, so let's stop fooling  ourselves that a sunset makes any sense on these provisions.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690688/solidify-iran-sanctions-act-of-2025"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…is going on here, that I am  likely to taint the witnesses and act irresponsibly. What have I ever  done as a Senator to make you think that is me? There was no factual  foundation that I would do anything illegal if you told me. I did  nothing illegal except to be Trump's friend, apparently. I inquired as  to whether or not I should vote to certify…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699105/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…allow us to modernize math curricula and improve K-12 science,  technology, engineering, and mathematics (STEM) education.\n\nWhile this bill directs the National Science Foundation to grant  awards to educational institutions, it does not award any new funding.  As we look at reining in the out-of-control government spending and  bureaucracy, we must…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688977/mathematical-and-statistical-modeling-education-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Party, the State of  Jefferson, and the Nevada County Republican Party. It was a full-time  passion for both Nancy and Eddie.\n\nEddie joined the Nevada County Fairgrounds Foundation in 2011 as a  director. In 2015, Eddie and Nancy, as well as their daughter, Barbara,  and son-in-law, Larry McDonald, were named the Family of the Year by  the Nevada County…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…Chicago. After three months of radiation, Gary slipped into a  coma from which he did not recover. Soon after his passing, Gary's  family started Voices Against Brain Cancer Foundation to raise money  and awareness for the fight against the illness. As its founder so  bravely states, ``I couldn't save the life of my son, but perhaps I can  save the life…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691692/recognizing-brain-cancer-awareness-month"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "Mr. BABIN. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 1350) to provide for Department of Energy and National Science  Foundation research and development coordination, and for other  purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688989/doe-and-nsf-interagency-research-act"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…the March for Life has endured for 53 years speaks  volumes about our Nation's heart and soul. Deep down, we know that  protecting those who cannot defend themselves is the foundation for  every meaningful cause in today's society. That conviction is why so  many of my pro-life colleagues step forward to lead legislative efforts  to protect vulnerable…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699386/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…electronic warfare engineer and director of engineering.\n\nLopez has been an active member for his community, serving on the  board of directors at the Pierre Claeyssens Veterans Foundation in  Santa Barbara and has served with the National Academies of Science and  Engineering.\n\nMr. Speaker, I encourage my colleagues to support this bill, and I  reserve the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697744/brigadier-general-frederick-r-lopez-post-office-building"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Extension office, and advance educational programs for  youth. In 1995, with a mission to ``Make the Best Better'', Marlene Law  was a founding member of the Citrus County 4-H Foundation. Her actions  planned and produced the 1st Citrus Stampede Rodeo to benefit the  Citrus County 4-H program, Past Foundation president, Hal Porter  recounted ``We had a dream,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691259/recognizing-marlene-law"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…in his  commitment to J&J's Credo, has greatly enriched Johnson & Johnson.\n\nHis commitment to improving healthcare goes beyond his day-to-day  work. Calvin serves on the Foundation Board of Overseers for the  Children's Hospital of Philadelphia, represents Johnson & Johnson on  the Healthcare Leadership Council as the associations 2024 to 2025  Chairman…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697247/congratulating-calvin-w-schmidt-on-his-service-to-johnson-johnson"}]