[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…materials, critical minerals, or  key military components. Furthermore, by cutting all funding for  Ukraine, this bill dangerously ignores history at our own peril.\n\nAt our founding, Patrick Henry heroically proclaimed: ``Give me  liberty or give me death.'' He knew liberty's cost and our new Nation's  responsibility to uphold the values that our European…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693693/department-of-defense-appropriations-act-2026"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…have the right to vote, to hold public  office, or to own property 250 years ago. Some women were property 250  years ago. Women were a footnote to the story of our country's founding  250 years ago.\n\nToday, 250 years later, women make up 125 Members in the Congress,  and the Democratic Women's Caucus is 96 strong. Women now make up more  than 58 percent…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689165/womens-history-month"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, since its founding, the Valluvan Tamil  Academy, or VTA, has played a vital role in teaching the Tamil language  to children in Virginia. Tamil, one of the world's oldest languages, is  spoken…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692089/recognizing-valluvan-tamil-academys-15th-annual-day-celebration"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…means.\n\nIn one of the previous debates with the War Powers Resolution, War  Powers Act being debated on the floor, Senator Kaine reminded us of  that historic moment when the Founding Fathers decided to write this  Constitution, which we have all sworn to uphold and defend. And leading  that Constitutional Convention, of course, was the greatest general…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696557/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…families, working families, and the vulnerable  and stands tall on their behalf and wants to utilize the good offices  of this institution to make sure that it does what the Founding Fathers  intended it to do, and that is to provide opportunity for people in  this Nation. That is what my friend, Congressman Deluzio, is all about.\n\nOne thing about this…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689082/economic-populism"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "Mr. CARBAJAL. Mr. Speaker, this year marks 125 years since the  founding of Cal Poly San Luis Obispo. From its inception, Cal Poly has  been a pillar of the San Luis Obispo community embodying the spirit of  its motto ``learn by doing''.\n\nIn the…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699776/recognizing-the-california-polytechnic-state-university-san-luis-obispo"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the world or hiding from  the challenges of the Communist bloc, our forebearers met tyranny head- on. We met the threats that we faced and stood together on our Nation's  founding commitment of life, liberty, and the pursuit of happiness,  year after year, in the face of constant threats.\n\nAmerican liberty has been a multigenerational effort, admired…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Vance's statements are alarming.\n\nNATO has been the bulwark against Russian aggression in Europe since  1949. The alliance has more than doubled its membership since its  founding. Central to the enlargement is NATO's open-door policy,  enshrined in article 10 of the North Atlantic Treaty, which affirms a  core NATO tenet that any European nation that…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Foundation, and as citizen chair for a school  district's bond campaign. Representative Bird spent countless hours  volunteering in students' classrooms, which led to her co-founding the  Adams 12 Community Action Network, dedicated to empowering students by  providing equal learning opportunities at local schools.\n\nOn behalf of the people of Colorado's…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698814/recognizing-colorado-state-representative-shannon-bird"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…Carnegie Classification R1: Very High Research  Activity, cementing its role as a driver of discovery, talent and  economic mobility. As the first American research university founding  in the 21st century, UC Merced continues to be a top-100 research  university and the fastest-growing public university in the Nation,  supporting high achieving and dedicated…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695846/recognizing-the-university-of-california-merced"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…rise today to recognize and commemorate  the 10th Anniversary of the Epsilon Sigma Boule of Sigma Pi Phi  Fraternity, based in Prince William County, Virginia. Since its  founding on June 13, 2015, Epsilon Sigma Boule has exemplified the  highest standards of leadership, scholarship, and community service.\n\nSigma Pi Phi, also known as the Boule, is…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692968/recognizing-epsilon-sigmas-10th-anniversary"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…nimble and innovative small businesses to drive forward  technological innovation and meet critical agency needs.\n\nThese programs have been endlessly scrutinized since their founding,  but economic analysis has shown an overwhelmingly successful program  with an outsized return on investment for taxpayers.\n\nUnfortunately, the SBIR and STTR programs are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695450/extension-of-sbir-and-sttr-authority"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…servicemembers.\n\nToday, we honor the generations of Black veterans whose courage,  advocacy, sacrifice, and patriotism have moved our country and world  forward.\n\nSince our Nation's founding, our military has relied on Black  Americans to answer the call to serve. Quite frankly, it occurred prior  to our founding. From the Revolutionary War and Crispus Attucks…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…of the District of Columbia the right to elect their own city  officials and to govern themselves in local affairs. As the Nation  approaches the 200th anniversary of its founding, it is particularly  appropriate to assure those persons who live in our Capital City rights  and privileges which have long been enjoyed by most of their  countrymen.''…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…$1.9 billion in the 2024  races. That is a sixfold increase in 6 years. That is the rich and  powerful buying their government. It is an absolute travesty.\n\nNo one in the founding community of our Nation who wrote the  Declaration of Independence, who wrote the Constitution, wanted to  design a system where the megarich ran the place as a cabal of elites,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…create a resident-focused fee structure, and  otherwise improve the experience for Americans.\n\nThe STARS Act highlights Constitution Day to encourage reflection on  America's founding principles. Get out and enjoy this Nation's natural  resources, learn something new, or just celebrate with loved ones in  one of our parks.\n\nFree access encourages families…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697764/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize and honor the  City of Brooksville as it commemorates the 170th anniversary of its  founding. This significant milestone offers an opportunity to reflect  upon the city's rich history, enduring spirit, and the generations of  citizens who have shaped Brooksville into…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700091/recognizing-the-city-of-brooksville"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…pivotal role in the creation of both Fisher House I and  II, providing families of hospitalized veterans a place to stay during  long-term care. She was also instrumental in founding the monthly  Operation Helping Hand dinners at JAHVH SCI, ensuring that veterans and  their families received nourishment, fellowship, and support.\n\nBeyond her service, Mary…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697717/recognizing-mary-ann-keckler"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…these       rights, governments are instituted among men, [receiving]       their just powers from the consent of the governed.''\n\nTo secure the blessings of liberty, the Founding Fathers of       the United States of America created a written constitution       under the inspiration of Almighty God. The preservation of       this sacred document and…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688744/declaration-of-mothers-a-proclamation-and-pledge-for-the-preservation-of-freedom-and-virtue"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…Stimpson has also championed long-term improvements, including  modernizing the city's zoning code and launching a nationally  recognized urban blight reduction program. As a founding member and  chairman of the Alabama Big 10 Mayor Association, his influence extends  beyond Mobile, strengthening the voice of Alabama's cities across the  state.\n\nOn behalf…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696270/recognizing-the-accomplishments-of-mayor-william-s-sandy-stimpson"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…been a cornerstone of our community,  dedicated to empowering individuals and families, promoting self- sufficiency, and improving the quality of life for so many.\n\nSince its founding, ACCAP has provided essential services, ranging  from housing assistance and food programs to transportation and early  childhood literacy initiatives, such as Dolly Parton's…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689395/recognition-of-accaps-60th-anniversary"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…only thrives  when government stays in its place, preserving liberty, not suffocating  it with unchecked regulation and unbridled spending.\n\nThis legislation reclaims that founding promise. It is the principal  vehicle for advancing President Trump's America First agenda,  unleashing a rising tide of prosperity, securing our border,  modernizing our…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693192/one-big-beautiful-bill-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…self-respect will  argue otherwise.\n\nOur leaders debated fully whether or not to grant this power to the  President. To a man, from Jefferson to Hamilton, the spectrum of our  Founding Fathers, they all agreed with the words that Madison wrote  that the executive is the branch most prone to war, and, therefore, the  Constitution, with studied care, vested…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…introducing  paramedic services to Bakersfield in 1975, placing the community among  the first in California to benefit from pre-hospital advanced life  support care.\n\nSince its founding, Hall Ambulance expanded its reach across Kern  County, serving communities from Wasco to Frazier Park, Taft to Boron,  and many regions in between. Under the continued leadership…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699607/recognizing-hall-ambulance"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…anniversary of the Mojave Water Agency, an institution that has stood  as a pillar of responsible stewardship, innovation, and public service  in California's High Desert since its founding in 1960.\n\nFor over six decades, the Mojave Water Agency has safeguarded one of  our region's most precious resources: water. Formed by local voters in  response to declining…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694201/recognizing-the-mojave-water-agency-on-the-occasion-of-its-65th-anniversary"}, {"senator": "James Risch", "party": "Republican", "sentence": "…threat presents itself.\n\nCongress has also spoken on the power of the President in the War  Powers Act. Now, we have heard a lot on the floor today about how  important the Founding Fathers thought declaration of war was. They  were absolutely right. It is just as right today as it was then. There  is a lot of difference between then and now. Then we…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693132/motion-to-discharge-sj-res-59"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "Mr. KEAN. Mr. Speaker, I rise today to recognize the Westfield Fire  Department as they celebrate 150 years of service to our community.  Since its founding as a volunteer fire department in 1875, the WFD has  grown into a career department, providing essential fire protection  services to the residents of Westfield and the surrounding…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692630/recognizing-the-westfield-fire-department-on-their-150th-anniversary"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…outdoor living. After a decade of collaboration, Mr. Hebel assumed  ownership, guiding the business through decades of growth and  transformation while remaining true to its founding principles.\n\nUnder Mr. Hebel's leadership, Bucks Country Gardens has thrived as  both a retail garden center and a landscape design firm. The garden  center offers an impressive…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696583/recognizing-bucks-country-gardens-president-tom-hebels-retirement-after-years-of-service"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Afghanistan, he was  gravely injured by an improvised explosive device, losing both legs  above the knee.\n\nDespite these injuries, Josh returned home to continue to serve,  founding Angel Peak Adaptive Sports with his wife, Samantha, to help  other wounded veterans and athletes experience the freedom of adaptive  skiing.\n\nYet, the unlevel terrain and…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700140/recognizing-joshua-elliott"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…strongest parallel of all comes from our own civil rights  movement, a time when America confronted its deepest flaws, yet emerged  stronger, more just, and more faithful to its founding ideals.\n\nDr. Martin Luther King, Jr., once said: ``The arc of the moral  universe is long, but it bends toward justice.''\n\nThat arc bends when brave people stand up. It bends…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}]