[{"senator": "Ron Wyden", "party": "Democrat", "sentence": "…continue to make the healthcare  system more expensive, more exclusionary, and less effective. It will  all be done at the expense of the American people. This goes beyond the  fox guarding the henhouse; it is giving the fox free rein to  investigate henhouses from coast to coast. And while that might be the  MO of this administration, it is dangerous…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697900/9999"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…the Federal Railroad Administration.\n\n4. Calendar Number 265: Marc Andersen, of Virginia, to be       an Assistant Secretary of the Army.\n\n5. Calendar Number 355: Christopher Fox, of Virginia, to be       Inspector General of the Intelligence Community, Office of       the Director of National Intelligence.\n\n6. Calendar Number 359: Macon Hughes, of Texas,…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696058/nominations-en-bloc"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…carved above those pillars on the  Supreme Court: ``Equal Justice Under Law.'' Hold a vote in the House of  Representatives on release of the files.\n\nThe leader of the Senate told FOX News:\n\nI'm always a believer in transparency--I think more is       always better.\n\nToday we voted on transparency, and the vote from across the aisle  was: Case closed. No…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…``Make sure the American public knows the full  weight of what happened.''\n\nHe said that he would do that. That was his quote.\n\nNow, in February, Attorney General Pam Bondi told FOX News that  Epstein's client list is: ``Sitting on my desk right now to review.''\n\nNow, they claim there was never a list. This weekend, Donald Trump  claimed that the files…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693624/release-the-epstein-files"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…want a Congress and a White House that solves problems  rather than creates them. Americans aren't asking to rename the Gulf of  Mexico. In fact, public polling, including on FOX, says that nearly 70  percent of Americans oppose that executive order and this legislation  to rename the Gulf of Mexico.\n\nLike many Americans, I follow the news each day with…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…administration have been pretty  good on this. Elon Musk said that funding for emergency food aid will  be restored. Marco Rubio has repeatedly said he was going to do it.  They even got FOX News to write a glowing online article about their  plans to restore funding.\n\nYet, it has been 6 months since they cut this funding off. It has  been 6 months, and every day…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693095/calling-on-trump-administration-to-restore-lifesaving-food-aid"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…has also provided  leadership to numerous community organizations, including TriCity  Family Services, the LivingWell Cancer Resource Center, the Community  Foundation of the Fox River Valley, and the Batavia Community Chest.  Notably, his tenure with the Rotary Club of Batavia has spanned nearly  four decades and includes service as club president,…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690141/recognizing-robert-bob-p-hubbard-as-batavias-2024-citizen-of-the-year"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Industry       Association; Edward Krauze, CEO, Greater Capital Area       Association of Realtors; Solomon Keene, President & CEO,       Hotel Association of Washington, DC; Malcom Fox, Executive       Director, Opportunity DC.\n\nMs. NORTON. Mr. Speaker, while the D.C. business community may not  have supported the D.C. law that is the subject of this disapproval…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699680/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the leadership at the Department of Defense is also a  national embarrassment. The mess Secretary Hegseth creates regularly  shows the consequences of picking an inexperienced FOX News host to  lead a massively complex life-or-death Federal Agency. Donald Trump is  learning it the hard way: If you pick a FOX News cable host to lead the  largest, most…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697368/trump-administration"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "Ms. BALINT. Mr. Speaker, we all know that the Republicans' so-called  big, beautiful bill is wildly unpopular. Every poll, including FOX  News, shows that Americans think it is rotten, and it is.\n\nThat is why Trump is trying desperately to rehabilitate the bill in  the eyes of the public, but Americans aren't…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693089/what-americans-want"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…that won their WPIAL championships this fall season. Those  champions are as follows:\n\nIn football, they are Aliquippa, Avonworth, and Seton LaSalle.\n\nIn boys' soccer, they are Fox Chapel, West Allegheny, and Deer Lakes.\n\nIn girls' soccer, they are North Allegheny and Fox Chapel.\n\nIn girls' tennis, they are Shady Side Academy and Quaker Valley.\n\nIn girls'…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699040/congratulating-wpial-champions"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…already have the concept of a plan, and  it will be so much better healthcare. Yeah, well, we will be announcing  it in about 2 months, maybe less.'' Nothing happened.\n\nIn a FOX News interview, the President said: ``We are signing a  healthcare plan within 2 weeks, a full and complete healthcare plan.''  Nothing happened.\n\nJuly 2020, the President said:…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…was not just the House Republicans who opposed helping working  families. The Trump White House also hated this amendment and sent out  a statement of opposition. They went to FOX News to complain that we  are doing our job to serve the people. Call me crazy, but I believe  that the work we do in Congress should improve the lives of the  American people.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690944/gulf-of-america-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…for using that very same satire--Jimmy Kimmel, Stephen  Colbert, suppression of free speech.\n\nI don't see this administration saying anything about limiting the  free speech on FOX, OAN, or Newsmax. Free speech is okay if you agree  with it, but if it disagrees with you, then out it goes.\n\nThat is the way it is in Putin's Russia and in Kim Jong-un's North…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695811/brendan-carrs-words"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…who has declared bankruptcy six times.  The American people are hurting because of President Trump and the  Republican policies, and they should not be mocked for that. Even FOX  News reported last night that 76 percent of Americans view the economy  negatively.\n\nAmericans are struggling to afford basic necessities. A new report  from The Century Foundation…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "Mr. GILL of Texas. Mr. Speaker, if FOX News or talk radio or any  other conservative media outlet came to me and asked us if we should  provide them with taxpayer-funded handouts, I would say no, and I  believe that…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692538/rescissions-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…famous firefall.  Remote cameras at the park are now blocked by protest signs. A Yosemite  biologist told gullible reporters that the staff cuts would doom the  Sierra Nevada red fox to extinction. Others warned that layoffs would  result in visitors stuck in restrooms and fires raging out of control.\n\nThis is human sacrifice, dogs and cats living together,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688585/yosemite-belongs-to-the-people"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…he shortly after, in  May of 1991 was the creator of the Central York School District  Elementary Track meet--which was later renamed in honor of long-time  principal Jefferey Fox (who supported the initiative), to the Jefferey  Fox Track Meet. Starting with just five events the track meet has grown  to now include myriad events including dozens of runs,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690717/recognizing-brian-wisler"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…chairman of the Committee on Natural Resources, I have often said  that some of our most meaningful work increasing access to our public  lands will maybe never be a headline on FOX News or CNN, but it will  make the front page of your local paper.\n\nEstablished by Congress in 1972 to enhance public recreation, the  Glen Canyon National Recreation Area is…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…everybody else here regularly. He also loved people  sufficiently to give them nicknames.\n\nMy nickname had something to do with the villain in ``Ocean's  Twelve.'' I was the ``Night Fox.'' I don't know if I agree with that  characterization. He was the guy that did a break dance across a laser  dance floor to steal things. Maybe some around here would think…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698668/protecting-healthcare-for-millions-of-americans"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…pass two noncontroversial bills as a bipartisan pair. The first is H.R.  2815. This is sponsored by Congressman Begich from Alaska. It is the  identical companion to my Cape Fox Land Entitlement Finalization Act.  And the second is H.R. 972, sponsored by Representative Dina Titus of  Nevada. It is the identical companion to Senator Cortez Masto's Sloan…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700283/cape-fox-land-entitlement-finalization-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…to carry oil       from Canada to Texas--leaving South Dakotans reeling and       1,000 people immediately out of work.\n\n``Where is it that they can go for their green job?'' Fox       News reporter Peter Doocy asked Psaki at her Monday afternoon       press briefing, referring to Biden's promise to create good-      paying union jobs in the green energy…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…receptors. It doesn't  make people mad. It doesn't get you on television.\n\nIf you tell the truth about the drivers of U.S. sovereign debt, you  will never end up on MSNBC or FOX News or any of those because no one  wants to hear the actual math. We want things that anger people. It  turns out that good accounting isn't really that exciting, but it is…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…Islamic takeover of the  United States, and they are in on the scam on the American taxpayers.\n\nThanks to Nick Shirley's efforts, more fraud is being exposed in  other States.\n\nFOX News recently reported that Somalia's Permanent Representative to  the United Nations, now serving as President of the U.N. Security  Council, is linked to an Ohio home healthcare…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…I not only attended that Banking hearing, but  several of my colleagues did too.\n\n. . I do not       believe that he committed a crime during the hearing.''\n\n--Interview with Fox Business, 2/4/26\n\nSenator Mike Crapo:\n\n``I'd like to see this resolved as quickly as possible,''       adding that it's important for the Fed to remain ``free of       political…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…enacted by the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Cape Fox Land Entitlement       Finalization Act of 2025''.       SEC. 2. DEFINITIONS.\n\nIn this Act:\n\n(1) Cape fox.--The term ``Cape Fox'' means the Cape Fox       Village Corporation,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698209/cape-fox-land-entitlement-finalization-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Benson, Charles Benson, Giulia Canello, Chase Connor, Joshua       Cook, Brooke Crabtree, Johannes Csaszar, Hannah Csaszar,       Lucas Estrada, Marco Ferri, Noah Forman, John Fox, Nirek       Gada, Anya Gada, Andrew Graham, Alyssa Hayman, Sara Husain,       Reed Joeckel, Shailey Karri, Lucy Lampkin, Anavi Modi, Arushi       Panwar, Chase Pariseleti,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692400/congratulating-the-2025-congressional-award-gold-medalists"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "Adams, Douglas: PBS NewsHour; Adams, Jacob: THE DAILY       SIGNAL; Adams, Jonas: NATIONAL PUBLIC RADIO (NPR); Adams,       Kimberly: MARKETPLACE RADIO; Adams, Lori: FOX NEWS; Adkinson,       Nicholas: ABC NEWS; ADLERBLUM, ROBIN: ABC NEWS; Adly, Jill:       NEXSTAR MEDIA GROUP; Advani, Reena: NATIONAL PUBLIC RADIO       (NPR); Aebli, Roger:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…This is very evil, and it is straight from the pit of Hell.  Terrorists are driving around in Toyota Land Cruisers in Somalia,  bought and paid for by the American taxpayers.\n\nFOX News recently reported that members of Minnesota's Democratic  Representative Ilhan Omar's inner circle--people working for her--were  personally profiting from this fraud.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…to the United States Military Academy in  West Point, New York.\n\nLucas is the son of Becky and Mike Gaston and the grandson of Hazel  and Joe Gaston, as well as Nancy and Ted Fox of Brookville.\n\nAs a student of Brookville Area High School, Lucas is active in the  classroom and on the athletic field and throughout his community.\n\nLucas is serving as the…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691782/congratulating-lucas-gaston"}]