[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…States  Congress, as enshrined in the United States Constitution.\n\nThat is why I and the executive board of the Congressional Hispanic  Caucus will propose a forward-looking framework for a democratic and  stable Venezuela. As members of the Congressional Hispanic Caucus, we  come from different nations in Latin America and the Caribbean. We are  immigrants,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698765/venezuela"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Republicans are using their majority to  advance an agenda that serves the wealthiest Americans at the expense  of our Nation's working families. The Republican budget is a framework  that instructs the Energy and Commerce Committee to cut $880 billion.  That level of cut is impossible without decimating Medicaid. The  Agriculture Committee will have…", "date": "2025-04-14", "source_url": "https://justfacts.votesmart.org/public-statement/1690119/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…a couple of reasons why. One, the resource management plan  that was adopted replaced a plan that was nearly 40 years old. This  resource management plan provided a modern framework that balances  responsible energy and mineral development with the protection of  wildlife habitat, water resources, cultural sites, and recreational  opportunities. It provides…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694909/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…FCC to engage in the exploration of 6G technology in  the early stages of development, the FUTURE Networks Act will enable  American values to be embedded within the global framework for this  technology and to ensure it will be available to all Americans.\n\nI thank Communications and Technology Subcommittee Ranking Member  Matsui and Representatives Allen…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690230/future-uses-of-technology-upholding-reliable-and-enhanced-networks-act"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…Agriculture, I rise today in support of both the  CLARITY and GENIUS Acts.\n\nThese bills aren't perfect, but digital innovation is critical to our  economy, and I support a regulatory framework that protects consumers  in the financial system.\n\nHowever, I am concerned about the ability of certain officials to use  these assets for self-enrichment at the highest…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693837/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Musk, who is behind these steps to decimate the Agency, disruption can  sometimes be constructive, but not when you burn down the house, burn  down an Agency, burn down a framework of laws that have been carefully  built and reflect not only an intellectual commitment but also a  deliberately constructed way to balance the needs of environment and…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689118/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Kirsten Gillibrand", "party": "Democrat", "sentence": "…Senators Hagerty, Alsobrooks, Scott, Lummis, and I  introduced the bipartisan GENIUS Act, which is the strongest effort to  date to regulate and create a clear regulatory framework for the  payment stablecoin industry.\n\nIt has a number of commonsense provisions relating to consumer  protections, reserve requirements, illicit finance, national security,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692380/9999"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…access to Venezuelan  oil or face the consequences of a blockade. That is it. That is the  plan.\n\nNot in the plan: positive change for the people of Venezuela. There  is no framework for elections or democratic transition, no serious  assessment of the rival political factions inside Venezuela--factions  that have been waiting for precisely this moment…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…negotiation and collaboration  with regulators and stakeholders, former Chair McHenry and I even  drafted payment stablecoin legislation that would create a strong  Federal framework and put consumer protection front and center.\n\nMy bill would foster innovation, while properly addressing the  concerns I have long held about safeguarding our Nation's consumers…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…recognize or understand this.\n\nWhile this bill addresses significant privacy concerns, it is also  important that we recommit to adopting a bipartisan, comprehensive  privacy framework that starts with data minimization and protects all  Americans and provides heightened protections for our children  nationwide.\n\nI thank Representative Moulton for his leadership…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690180/informing-consumers-about-smart-devices-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…powers.  All privileged motions kind of fit into the ZIP Code of enabling a  Senator to challenge potential overreach by the Executive. They are  very much, kind of, in the framework of the checks and balances.  Executives have power, but the legislature should have power as well,  and the legislature should have the ability to challenge overreach by…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…not just difficult, but dangerous. To terminate TPS now, at       this moment of unprecedented crisis, would be to ignore       reality and abandon the moral and legal framework of TPS. We       would be sending children, mothers, fathers, workers,       students, and community members back to circumstances where       their safety cannot be guaranteed.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…people know that we  stand by them in their quest for democracy, respect for their rights,  and deeper integration into the Euro-Atlantic community. This also  provides a framework for appropriate cooperation with the Georgian  Government going forward.\n\nMadam Speaker, I am pleased with the bipartisan work of this bill,  look forward to its passage,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690699/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…ability of us to address  the challenges of America for decades and decades to come. It is really  an attack on the next generation.\n\nHere is a fourth reason: It tears down the framework of  accountability, the last two standing pillars, crafted by 100 Senators  all voting yes in 1974.\n\nI encourage my colleagues, as they get together in their caucuses on…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…discouraged capital flows into BDCs, constraining their  ability to serve small businesses. The rule--part of the SEC's Acquired  Fund Fees and Expenses (AFFE) disclosure framework--requires mutual  funds and other investment vehicles that invest in BDCs to disclose the  management fees, expenses, and AFFE of the BDC itself.\n\nThis has the effect of…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697831/increasing-investor-opportunities-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…into our  schools, push for the largest investment in American agriculture in a  generation, advocate for career and technical education, and establish  a Federal regulatory framework for digital assets like cryptocurrency.\n\nOn the policy front, I helped to ensure the passage of the Secure  Rural Schools Reauthorization Act. I secured numerous provisions…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698682/recognizing-the-honorable-steny-hoyer"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…misleading, and false.\n\nWarren Buffett has paid a record amount in taxes. I think that is  worth noting. That has been in the press very widely in the last few  days.\n\nThis budget framework delivers on House Republicans' and the  President's promise to minimize tax burdens for Americans across the  income spectrum, promote security in our communities, and unleash…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688061/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…restricted. Federal lands were blocked from responsible energy  development, and the Strategic Petroleum Reserve was drained.\n\nSimply put, again, the budget resolution is a framework that will  allow us to deliver on the demands of the American people to secure the  border, eliminate wasteful spending, revitalize Biden's broken economy,  and safeguard…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Project,  Jamie Gillespie from the White House, Robert Rector from The Heritage  Foundation, together with three Congressmen.\n\nThe purpose of the program was to provide a framework to deal with  the antimarriage bias in American welfare programs. The panel was put  together at the request of 16 organizations and other concerned  citizens who work with…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…review.      Recent Actions Regarding the NPR-A\n\nFollowing issuance of the 2022 ROD, BLM published a final       rule in the Federal Register on May 7, 2024, to revise the       framework for designating and assuring maximum protection of       the Special Areas' significant resource values and to protect       and enhance access for subsistence activities…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694269/us-government-accountability-office-legal-opinion"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…in 1916, the United States Grain Standards Act gave  the Federal Government the authority to set official marketing  standards for grains and oilseeds. It also provided a framework for  inspection and weighing procedures.\n\nBecause of the United States Grain Standards Act, the American grain  industry has developed an enduring reputation for consistency…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…1962, the Miccosukee's northernmost villages within what became  Everglades National Park were managed under a special use permit until  1998, when Congress placed that permit framework with the MRAA,  authorizing the Tribe's use of the area and noting it as Indian  Country.\n\nThe original law did not include Osceola Camp. H.R. 504 would include  the Osceola…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698658/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…good resolution, but  to me, it is important we have the guardrails in the initial  resolution.\n\nI think there is a reason for the initial resolution. It is to set up  the framework for what this reconciliation will look like.\n\nUnfortunately, today--unusual for me--I will not be able to support  this resolution on the floor. I will be voting ``no'' on…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689909/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…2017 and 2018 and held hearings on  cryptoassets, Congress has finally recognized the unique nature of  stablecoin products.\n\nUnder this bill, we established a regulatory framework that targets  the activity, not the technology. After years of indecision, Americans  finally have an administration that is ready to embrace those products.  The time to…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693829/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…to protect consumers from fraud. That is an untenable  situation in a market growing by the billions.\n\nFor too long, the United States has operated without a clear Federal  framework for dollar-backed payment stablecoins, leaving consumers  vulnerable to fraud, innovators in limbo, and our global  competitiveness at risk.\n\nThat is why I am proud to have…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693840/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…administered land for certain purposes in accordance with       BLM's responsibilities for land use management under FLPMA.       The North Dakota RMP establishes a broad framework for land       use management, governing approximately 58,500 acres of BLM-      administered surface land and 4.1 million subsurface acres of       BLM-managed land and…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693059/us-government-accountability-office-legal-opinion"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…companies or other       entities owned, directed, supported, or influenced by the       Chinese Communist Party is a threat to U.S. security and       merits an aggressive policy framework to protect U.S.       interests, jobs, intellectual property, and security.       SEC. 3. FOREIGN DIRECT INVESTMENT REVIEW.\n\n(a) Review.--The Secretary of Commerce and the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692697/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…yielding this time. I rise today in support of H.R. 3062, the Promoting  Cross-Border Energy Infrastructure Act.\n\nMr. Speaker, our hardworking energy developers need a clear framework  to expand America's energy footprint, not more bureaucracy and  uncertainty.\n\nMy colleague talked about energy prices. Well, just look at the gas  pump. I mean, the gas…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695690/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…fiscal year 2025 budget resolution.\n\nLet's be clear about what we are voting on today. We are not voting  on the budget. We are not voting on the numbers. We are voting on the  framework, a starting point for building a budget that delivers on  President Trump's priorities.\n\nThose priorities are securing our border, strengthening national  security, energy…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689887/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…affordability, they neglect  the fact that we can address affordability by reducing costs to  potential homeowners.\n\nAt least we can agree that we have a cumbersome regulatory framework  that needs to be fixed. This helps fix and is actually a proactive step  in addressing the affordability crisis. One of those things has to do  with homeownership, and by…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698040/promoting-efficient-review-for-modern-infrastructure-today-act"}]