[{"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…a lifelong Republican who loved one of our great Presidents with  his whole heart, I think maybe the greatest economic patriot we have  seen in the White House, President Franklin Delano Roosevelt.\n\nI was reminded today of a great speech that President Roosevelt gave  81 years ago. ``The Economic Bill of Rights,'' it has been called. He  talked about…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689083/economic-populism"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…disabled  people or differently abled people have made such tremendous  contributions to our culture and to our society. I am thinking of very  famous people like Thomas Edison, Franklin Roosevelt, and Fannie Lou  Hamer, people who have had polio, who have been in wheelchairs, and  physicists who have contributed.\n\nIt is important to leave nobody behind because…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698944/protecting-education-for-children-with-disabilities"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "Mr. TRAN. Mr. Speaker, in 1787, after the Second Continental  Congress, Benjamin Franklin was asked: Do we have a monarchy or a  republic?\n\nHe solemnly replied: a republic, if you can keep it.\n\nFor nearly 250 years, those immortal words have lived at the heart…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689123/a-republic-if-we-can-keep-it"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…offices; but the so-called Department of Government  Efficiency, DOGE, is attempting to weaken and dismantle a system which  has stood tall for almost a century, created by Franklin Delano  Roosevelt.\n\nMore than 11,000 Americans turn 65 each day. Many will graduate to  access benefits and, ultimately, Medicare for their own health.  Congress must ensure…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699878/protecting-social-security"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…conservatives, rural people, suburban people,  urban people.\n\nWhy are they doing this, then? Why are they going after something  that has been as sacred as Social Security since Franklin Roosevelt put  the program together? Why? It is simple: So they can cut taxes for the  rich.\n\nThis is a heist. If JD Vance had any intellectual honesty, he would  acknowledge…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689776/social-security"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Ezell      Fallon      Fedorchak      Feenstra      Finstad      Fischbach      Fitzgerald      Fitzpatrick      Fleischmann      Flood      Fong      Foster      Foxx      Franklin, Scott      Fry      Fulcher      Garbarino      Gimenez      Golden (ME)      Goldman (TX)      Gonzales, Tony      Gooden      Gosar      Gottheimer      Graves      Griffith…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…that  this administration has exacerbated.\n\nWhile Citizens United greatly harmed our body politic, we will not  let it prove fatal. In a 1938 address to Congress, President Franklin  D. Roosevelt issued a stark warning: `` . . . the liberty of a  democracy is not safe if the people tolerate the growth of private  power to a point where it becomes stronger…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699248/citizens-united-16th-anniversary"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…served as the mayor of Ridley Park for 28 years before his  death last month at the age of 91.\n\nFrom student council president at Sharon Hill High to a standout  athlete at Franklin & Marshall College where he was inducted in the  hall of fame, Hank was a born leader.\n\nHank raised a family in ``Delco,'' where he became an executive at  Sun Company and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694966/remember-mayor-henry-eberle"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Fedorchak      Figures      Fine      Finstad      Fischbach      Fitzgerald      Fitzpatrick      Fleischmann      Flood      Fong      Foster      Foxx      Frankel, Lois      Franklin, Scott      Fry      Fulcher      Garbarino      Gill (TX)      Gillen      Golden (ME)      Goldman (TX)      Gonzales, Tony      Gonzalez, V.      Gooden      Goodlander…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…celebration of the  175th anniversary of its establishment.\n\nIn addition to the unincorporated areas, the Leyden Township borders  include part of Rosemont, Schiller Park, Franklin Park, part of  Northlake, River Grove, Elmwood Park, parts of Melrose Park, Park  Ridge, the most western part of Norridge and Bensenville, east of  County Line Road.\n\nLeyden…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697323/9999"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…as a responsible partner and guardian of  liberty across our world. He leans toward dictators.\n\nWhat is that all about?\n\nIt took 80 years for America, with our leaders like Franklin  Roosevelt, John F. Kennedy, Ronald Reagan to meticulously secure our  place as leader of the free world. We didn't seek it, but we did our  job.\n\nAmerica is the global beacon…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…people gave the MAGA movement a narrow majority 6 months  ago, but now they are having second thoughts. There is no golden age  ahead, just a recession. Contrast this with Franklin Delano Roosevelt,  who, in 100 days, saved America.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690483/trumps-100-days"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Dean's Beans coffee for keeping us caffeinated during the entire  march.\n\nI also thank local law enforcement--Deerfield and Springfield Police,  and the Hampden, Hampshire, and Franklin County Sheriff's Departments-- for keeping us safe along the march.\n\nI thank our media sponsors--New England Public Media and WRSI 93.9,  The River--for broadcasting the walk…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697684/16th-annual-march-for-the-food-bank"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…would  have been authorized to fund projects such as Akron's water main and  lead service line replacement project, Fairlawn's West Market Street  waterline replacement, New Franklin's South Main Street stormwater  replacement project, Barberton's Stratford Street waterline project,  and Fairlawn's Rosemont Preserve project.\n\nAdditionally, under Stark…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694842/massive-cuts-to-energy-and-water-infrastructure"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Ezell      Fallon      Fedorchak      Feenstra      Fine      Finstad      Fischbach      Fitzgerald      Fitzpatrick      Fleischmann      Flood      Fong      Foxx      Franklin, Scott      Fry      Fulcher      Garbarino      Gill (TX)      Gimenez      Goldman (TX)      Gonzales, Tony      Gooden      Gosar      Graves      Green (TN)      Greene…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689975/no-rogue-rulings-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Ezell      Fallon      Fedorchak      Feenstra      Fine      Finstad      Fischbach      Fitzgerald      Fitzpatrick      Fleischmann      Flood      Fong      Foxx      Franklin, Scott      Fry      Fulcher      Garbarino      Gill (TX)      Gimenez      Goldman (TX)      Gonzales, Tony      Gooden      Gosar      Graves      Green (TN)      Greene…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690048/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…across the Nation and reminded us why  we love this game. We look forward to their continued success in the  years to come. Chants Up.                     Honoring Robert Franklin Childs III\n\nMr. FRY. Mr. Speaker, I rise today to honor the life and legacy of a  dear friend of mine and a fixture in the Surfside Beach community, Mr.  Robert Franklin Childs…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692819/recognizing-coastal-carolina-university-baseball-team"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "Mr. STEIL. Madam Speaker, I move to suspend the rules and pass the  bill (H.R. 250) to direct the Joint Committee on the Library to procure  a statue of Benjamin Franklin for placement in the Capitol.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                  H.R. 250\n\nBe it enacted by the Senate…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688218/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…recognize the  public service and community leadership of C. Stewart McCleaf, who was  sworn in on January 5th to begin his fourth term as a Washington  Township Supervisor in Franklin County, Pennsylvania.\n\nOver the years, Stewart has served in leadership positions with the  Township Board of Supervisors, Rouzerville Business Association,  Pennsylvania…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698643/recognizing-the-public-service-and-community-leadership-of-c-stewart-cleaf"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…that is never dimmed. May BEAM continue to shine, lighting the  path forward for those who need it most for years to come.                 Honoring the Life of Carrol Eugene Franklin\n\nMr. BEAN of Florida. Mr. Speaker, today I rise with a heavy heart but  a grateful spirit to honor the life of my friend, Commissioner Carrol  Eugene Franklin, who passed…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694060/may-beam-continue-to-light-the-way"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…rise in support of H.R. 2916, my bill to ratify the  land claim settlement agreement between the Saint Regis Mohawk Tribe,  the Mohawk Council of Akwesasne, New York State, Franklin and St.  Lawrence Counties, the towns of Fort Covington and Bombay, and the New  York Power Authority.\n\nFor more than 40 years, the Saint Regis Mohawk Tribe and the Mohawk…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697676/resolving-the-akwesasne-mohawk-land-claim-in-the-state-of-new-york"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…of our economy.\n\nIndiana's Sixth continues to be home to safe and prosperous  communities in which to raise families. It was highlighted by my visit  with the leadership of Franklin College and a number of state of the  city addresses that occur in the month of January, including  Greenwood's, where I attended Mayor Mark Myers' 14th state of the city…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688262/return-the-united-states-to-a-balanced-budget"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…today.\n\nThe parallels runs deep, deeper than we sometimes see.\n\nWhen America endured the Great Depression, it was a time of doubt,  fear, and uncertainty. But leaders like Franklin Roosevelt reminded the  American people that despair is never destiny. Let me repeat that.  Despair is never destiny. He told them that courage, unity, and faith  could rebuild…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…FFA's commitment to advancing agriculture education  through their comprehensive learning model.\n\nLuke earned his national secretary position after serving as the  Felicity-Franklin chapter officer and Ohio State officer for 2 years.\n\nIn addition to his service in the FFA, Luke is currently pursuing a  degree in agriscience education at the Ohio State…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691474/recognizing-luke-jennings"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…are forever indebted to their  sacrifices. We will forever honor all of the Americans who were at the  naval base in Pearl Harbor, Hawaii, that day.\n\nMr. Speaker, President Franklin D. Roosevelt said:\n\n``No matter how long it may take us to overcome this premeditated  invasion, the American people in their righteous might will win through  to absolute…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698053/pearl-harbor-remembrance-day"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…debating here today.\n\nIt is important to remember that public-sector unions are  fundamentally different from their private-sector counterparts. In  fact, none other than Franklin Delano Roosevelt, a major champion of  private-sector unions, believed that public-sector unions made no  sense. FDR wrote: ``The process of collective bargaining, as usually…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…did I accomplish the year before? That is a  great time to do it with America. Where are we?\n\nIt reminds me, Mr. Speaker, at the Constitutional Convention in 1787,  Benjamin Franklin famously looked at the chair behind the presiding  officer that was carved with a Sun and he asked a question that still  echoes throughout history: Was the Sun rising or…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…friend and colleague from Pennsylvania (Ms. Houlahan), this is  really the product of her hard work. I was proud to partner with her  and accept an invitation. If Benjamin Franklin were here today, he  would give Representative Houlahan a big hug of gratitude for finally  recognizing him.\n\nMadam Speaker, I rise today in resolute support of H.R. 250,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688220/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Mr. WESTERMAN. Mr. Speaker, I rise today to recognize an exceptional  young leader from my district, Jayden Coffey, a student at Cass Job  Corps in Franklin County, Arkansas, and the latest recipient of the  Westerman Award--a quarterly honor given to students who demonstrate  outstanding character, leadership, and service.\n\nJayden…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692255/recognizing-ms-jayden-coffey"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…gentleman from the  greatest State in the country. I appreciate his willingness to be here  to support this week and his message on this really important Police  Week.\n\nMr. SCOTT FRANKLIN of Florida. Mr. Speaker, I thank my well-rested  friend and colleague from Utah for the time.\n\nMr. Speaker, this evening as we recognize National Police Week, I  rise to honor…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}]