[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…drugs or other challenges that drive up costs.\n\nThere are systems that we could create that could create more  transparency and eliminate more real fraud and go after the fraudsters  themselves in a more efficient manner.\n\nThere are so many things that we could do if we came together as a  body. But what are we doing instead? Following our President…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…notifies all the other users who have been in contact with that banned  person on the service. This will help to reduce the number of people  who fall victim to identified fraudsters looking to extort money from  dating app users.\n\nMr. Speaker, this bill is an important first step in addressing harm  in the online dating space. However, there is a lot…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692728/romance-scam-prevention-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…today I rise to voice a concern from my  constituents, Jeff and Bev.\n\nLast week, Trump's billionaire Commerce Secretary was speaking with  another billionaire about how only fraudsters would complain about  missing a Social Security check. Trump's billionaire Commerce Secretary  said that if Social Security didn't send out checks for a month, his  mother-in-law…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689244/millions-depend-on-social-security"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…bringing this legislation forward along  with my colleague from California (Ms. Simon).\n\nMr. Speaker, I rise today in strong support of the Assisting Small  Businesses Not Fraudsters Act, legislation that will help ensure that  small businesses who need and deserve support get it, while cutting out  fraudsters seeking to exploit vital relief programs.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687933/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…better for the American people. Donald Trump, during  the shutdown, found the time to play golf week after week after week.  Donald Trump found the time to pardon serial fraudsters like George  Santos and Rudolph Giuliani. Donald Trump found the time to meet with  the Chinese Communist Party. Donald Trump found the time to destroy the  east wing of…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696738/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Unfortunately, President  Trump has determined that those who served our Nation no longer deserve  protections against bad actors who seek to profit off their benefits.\n\nAs fraudsters' ability to create more complex scams and become more  convincing in their deceit thanks to emerging technologies like  artificial intelligence, the time to create informed…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699190/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Now, let us be clear: We want to address the national debt, root out  waste, fraud, and abuse, and build a government and programs that can  serve everyone, but when the fraudsters themselves claim to have the  fix, the American people see right through it.\n\nYet, DOGE's end does not mark the end of our work. We know that the  time to organize is now,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697304/ode-to-doge"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…innovators       in the free market fear they might be outdone by federal       technocrats. Public Citizen believes these self-described       crypto innovators are craven fraudsters looting the       vulnerable with a Ponzi scheme.\n\nPublic Citizen does support exploration of a Central Bank       Digital Currency (CBDC). This federal digital coin, in…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…database.\n\nMichelle King was the deputy commissioner for operations at the  Social Security Administration for only 28 days before stepping down  because she refused to grant the fraudsters at DOGE access to the  Social Security database and all the sensitive personal data it holds  on everyday Americans. Bravo to Michelle.\n\nThe administration got rid of her…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689396/trump-administration-lies-about-social-security"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…collaboration.\n\nTogether, they help expand access to capital for businesses central  to our national security, expand the reach of the SBA's Office of Rural  Affairs, hold fraudsters accountable for exploiting the pandemic relief  programs, and modernize the SBA's IT infrastructure.\n\nThese bills are quite simply common sense and would meaningfully  improve…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697219/made-in-america-manufacturing-finance-act"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…introduce this bill.\n\nMr. Speaker, I urge my colleagues to support this effort to  prioritize small businesses in the future through funding opportunities  by preventing pandemic fraudsters from accessing Federal small business  funds.\n\nLike other communities around the United States, in California's 12th  District, small businesses are the lifeblood of our…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687934/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…controls. Upon taking  office, the Biden administration reinstituted longstanding antifraud  controls and put new safeguards into place to curb the flow of pandemic  dollars to fraudsters.\n\nBefore issuing a loan, the SBA would screen applicants on the  government's Do Not Pay list and then check its internal database for  fraudulent flags or holds. Borrowers…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687932/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…things about  Trump.\n\nWhen Republicans come to the floor and talk about fraud, just  remember that they are the ones who pardoned over and over and over  again healthcare fraudsters while at the same time screwing over the  American people by taking away their healthcare.\n\nMr. Speaker, let's be honest about what is happening here because  this really…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "…the program over and over in the state of the Union, and after  the Secretary of Commerce said people could go a month without  their Social Security check unless they were fraudsters.\n\nIt is their money. Leave it alone. That is the pledge. Mr. Speaker,  Republican Members of Congress can ignore their constituents, but  listen to the lesson from Wisconsin…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689813/listening-to-our-constituents"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…America leads the way  in this growing space.\n\nThe CLARITY Act takes commonsense steps to make crypto work for  everyday users, including measures to stop snake oil salesmen,  fraudsters, and hucksters, and puts the Trump family's coins under  regulation.\n\nThis legislation supports American-led innovation by encouraging  developers and entrepreneurs to build,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693783/digital-asset-market-clarity-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…fraudulent applications going in  where someone is just bleeding the system got approved. The system  doesn't stop the fraud.\n\nThis is your money, Mr. Speaker. You are paying for fraudsters, and  you are paying for brokers who are going to jail.\n\nOur debate here is: Well, we want to give another $40 billion to the  fraudsters, but there will be a portion of…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…billion in potentially fraudulent funds in its COVID-era programs.\n\nThis level of fraud undermines the integrity of the SBA. It is  essential that we track these criminal fraudsters down and hold them  accountable for their actions.\n\nTwo of these SBA COVID-era programs, the Restaurant Revitalization  Fund and the Shuttered Venue Operators Grant, directed…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697225/sba-fraud-enforcement-extension-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…programs is set to expire this  December.\n\nThese two programs combined provided over $44 billion in grants and  funding for small businesses during the pandemic. Unfortunately,  fraudsters stole COVID relief funds from small businesses across the  country. These fraudsters hope that the statute of limitations for  their crimes will pass, allowing them to skirt…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697227/sba-fraud-enforcement-extension-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Business Administration didn't have the  ability to bounce off the Social Security mortality or death file.\n\nWe have designed these walls to functionally--it is as if the  fraudsters designed our data systems here in the Federal Government.  Let's go fill out things, go get money, and steal the taxpayers' money,  but we are going to make sure that there…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Security number that follows them around for the rest  of their life. Every year, there are kids whose Social Security numbers  are lost or stolen in the mail and exposed to fraudsters.\n\nBecause children don't open bank accounts, they don't apply for lines  of credit, and they don't seek employment, it can take them years to  discover that their identity…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697265/social-security-child-protection-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Democrats and the ObamaCare people, but not a  single Republican voted for it.\n\nOne Social Security number was used repeatedly to enroll people into  ObamaCare policies, and the fraudsters used it 125 times.\n\nAll together, investigators, through the Government Accountability  Office, discovered $21 billion lost to ObamaCare fraud. That is  insulting.\n\nIf Democrats…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "Mr. LaLOTA. Mr. Speaker, the fundamental question this bill addresses  is: Should a Federal contract intended for women go to men and  fraudsters, or should a Federal contract intended for women-owned small  businesses actually go to women?\n\nFortunately, even though we Republicans and Democrats disagree on a  lot in…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691799/wosb-accountability-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…year. A waitress  working for tips will keep an extra $1,300. A lineman working overtime  after a storm will keep an extra $1,400.\n\nWhile Democrats defend illegal immigrants, fraudsters, and  bureaucrats, Republicans are standing up for the American people,  putting more money in their pockets. President Trump promised no tax on  tips, overtime pay, or car…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693189/one-big-beautiful-bill-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…How sad, Mr. Speaker, that that is  the case.\n\nMr. Speaker, this budget does not steal from the least of these. It  does not. What it does do is everything it can to stop fraudsters, to  stop bureaucratic waste, and to stop bad things from happening to those  least because those in the government are not serving them well.\n\nLet's talk about these predictions.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…The fact  is that the only groups losing coverage are able-bodied grownups who  refuse to get off the couch and look for work, illegal aliens who  refuse to go home, and fraudsters.\n\nWhat happens when millions of legitimate Medicaid recipients who have  been terrified by the Democrats realize that their benefits are  untouched? Well, we are going to…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693629/democrats-big-mistake"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…programs.\n\nWhile we continue to have conversations on how to better align small  businesses' contracting goals with merit-based principles, this bill  would reduce the ability of fraudsters to exploit the system that is  currently in place.\n\nBy mitigating the ability to defraud government contracts, we help  ensure that taxpayer dollars are used as intended…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691798/wosb-accountability-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…their voters want photo ID to be established when you vote,  why would they be opposed to that? Because they want people who  shouldn't be able to vote--illegal immigrants or fraudsters--to vote  for them. That is the truth.\n\nSo we have now the most secure border in the history of our country,  and we are trying to execute on the immigration laws that we…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…has made our Nation an investment  magnet and development hub, but thus far, our regulatory system has  failed the digital assets industry. Under the current framework,  fraudsters go unpunished, consumers remain unprotected, and the best  and brightest minds in the industry have picked up and left for other  countries.\n\nThe CLARITY Act finally establishes…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693781/digital-asset-market-clarity-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…58,000 SSNs receiving subsidies matched Social Security       death records.\n\nAt least 7,000 were dead before coverage even began,       insinuating identities were used by fraudsters.\n\n$94 million in taxpayer-funded subsidies were sent to       health insurers on behalf of deceased individuals.\n\nBad actors engaged in unauthorized enrollment activity to…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698438/uncovering-widespread-fraud-in-obamacare"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…unelected, heavyhanded bureaucrats who  think they know better than the American people. And it is certainly  not going to continue to be stolen like it has been by these fraudsters  in Minnesota, while the Democrats look the other way.\n\nIn all, American workers are going to see higher take-home pay, more  money in their pockets, thanks to what we passed…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699081/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]