[{"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…order with several onerous provisions that  would risk disenfranchising millions of Americans.\n\nDemocratic bills, like the John R. Lewis Voting Rights Advancement  Act and the Freedom to Vote Act, would stop these attacks on our  democracy and ensure every American is able to cast a meaningful vote.\n\nMr. Speaker, when the American economy is on the precipice,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…(and, not to forget, the US's role in fomenting       that instability over the years). Our Haitian neighbors, like       all people, deserve to live with dignity, peace, and freedom.       That is what allows people to not only be healthy, but to       thrive, and to contribute to our Commonwealth in countless       ways.\n\nIn addition, it's important…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…amidst  significant health challenges, he remained dedicated to sharing God's  goodness, writing, preaching, and singing about His grace. He authored  two impactful books, ``Freedom in Worship'' and ``Stuck in A Rut,'' and  expanded his ministry globally through TBN and various national and  local media outlets.\n\nAs we remember Overseer Carter, we acknowledge…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…wait another day. We must pass  the John R. Lewis Voting Rights Advancement Act to restore what the  Supreme Court gutted when it ripped out preclearance. We must pass the  Freedom to Vote Act to guarantee that every citizen, no matter the ZIP  Code that they live in, their income, or ancestry, can register, vote,  and be counted with dignity.\n\nWe must…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…It has some words on it. Mr. Speaker, it has these words:\n\n``Give me your tired, your poor, Your huddled masses yearning to  breathe free.''\n\nThe United States stands for freedom and for liberty and justice for  all.\n\n``The wretched refuse of your teeming shore. Send these, the  homeless, tempest-tost to me.''\n\nBring them to us, the United States of…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…the 250th anniversary of the Declaration of Independence and the ideals  and founding principles of our country, like the rule of law and  separation of powers. Individual freedom, dignity, and equality are  being ruthlessly undermined today by this administration.\n\nMr. Speaker, I hope this Chamber's commitment to America's founding  principles is not…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699868/for-americas-250th-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…our campaign finance system  stronger and more transparent.\n\nThat is why I have led the effort, alongside Ranking Member Padilla,  to advance commonsense bills, including the Freedom to Vote Act, to  shine light on secret money and make sure Americans know who is trying  to influence their votes. We came very close to passing my bill in the  last Congress.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699114/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…Sunday, there are mass  protests in Georgia protesting deprivation of freedoms and liberties.\n\nThe Georgian Dream has orchestrated crackdowns on citizens, including  banning the freedom of speech and assembly in Georgia, using violence  against protesters, and abusing the court process to wrongfully  imprison and charge protesters.\n\nThe Georgian people have…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690701/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…core of our democracy is all about-- or, as Lincoln so well summarized, government of, by, and for the  people.\n\nThere are several things essential to make this happen: the freedom  of speech, for one; the freedom of assembly, for another. But perhaps  nothing encapsulates the opportunity of a citizen to participate in the  direction of their own country…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690536/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…he say? He told the mob to ``stop the steal'' and to ``fight  like hell.'' Then, he deployed them to the Capitol of the United States  of America, the beacon of democracy, freedom, and liberty for all the  world, and the Capitol was breached.\n\nThere, of course, was no steal, and the courts said so in court after  court after court after court. However,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698552/january-6-attack"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…sending a clear  message--a message of strength and of unity. As the United States has  for the better part of a century, we must continue to stand up to  tyrants and defend freedom. We have learned that isolationism and  appeasing autocrats is a losing strategy. As President Trump and his  administration continue to push for negotiations between Ukraine…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691085/liberty-versus-dictatorship"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…denying women  their reproductive rights and failing to deliver for American families.\n\nMr. Speaker, I urge my colleagues to stand for women and families,  for dignity and for freedom, and vote ``no.''", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699228/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…illegally deported. It is sickening. It is immoral. Arrest a judge to  try to threaten and scare judges, which he has done before, saying he  is about impeachment and other things? Freedom of expression and the  rule of law are under attack. Government has been weaponized against  the free press, against academic and judicial independence, against  anyone who…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690262/trump-administration-first-100-days"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…many of our families in the Michigan 12th Congressional District.  The most beautiful, Blackest city is in the 12th District, the city of  Detroit.\n\nIt is a celebration of freedom, Black resilience, and the ongoing  fight for justice for all. In our community, we remember and honor  generations of Black Americans who fought for liberation.\n\nAs we speak,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692494/violations-of-rights-by-ice"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…whose life's work has been defined by  faith, peace, and reconciliation.\n\nHis All-Holiness has long been a tireless advocate for interfaith  dialogue, human rights, religious freedom, and environmental  stewardship. For decades, he has traveled the world promoting  understanding and respect among faith traditions and urging us to  safeguard our common…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696208/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…semiquincentennial.  America is turning 250 on July 4, 2026. This time capsule represents  one way that Congress will participate in the Nation's yearlong  celebration of democracy and freedom.\n\nAmongst our toughest challenges of the day, this legislation reminds  us that we can all work together. The contents of the capsule will be  selected by the Speaker of the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688200/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…Representative McBath, who is the ranking member on our Subcommittee of  Crime and Federal Government Surveillance, and supported by Members of  both parties who understand that freedom collapses when the law becomes  unknowable.\n\nThis bill is co-led by staunch conservatives like Representative Roy  and myself and our colleagues, who occasionally think differently…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697204/count-the-crimes-to-cut-act"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…and country of  origin, the amount of funds that are being put into our public schools,  and any terms of that contract.\n\nThe CCP is anti-American to its core. We stand for freedom of speech,  expression, and religion. They stand for none of our values. Confucius  classrooms are propaganda, and they are often set up near our military  bases, just to…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697407/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…across the globe.\n\nIn the years that followed, democracy and Western values flourished,  but authoritarian regimes like the Chinese Communist Party have chosen  repression over freedom, indoctrinating their citizens to embrace  socialism and communism, ideals fundamentally opposed to American  values of liberty, freedom, and self-determination.\n\nNow, we…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697409/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…landmark bill has strengthened the partnership with Taiwan and  shaped America's foreign policy in the Indo-Pacific region.\n\nI will recognize that Taiwan is a trusted leader in freedom,  democracy, and trade, and is also a needed partner in security against  shared threats.\n\nAs chairwoman of the East Asia and Pacific Subcommittee, I have  worked on bipartisan…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690020/recognizing-taiwan-as-a-trusted-leader-in-freedom-democracy-and-trade"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…National Blue Ribbon  School.\n\nFrom the American Revolution to our time, Strong has always been a  town of patriots, with a veterans memorial paying tribute to those who  defend freedom. Among the most illustrious veterans is Lt. James  Porter. After graduating from West Point in 1869, he served with the  7th Cavalry in the Reconstruction Era South under…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699397/225th-anniversary-of-the-town-of-strong"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…1991 as the 270th Archbishop of the 2,000-year-old Church  founded by the Apostle Andrew. For more than three decades, he has  stood at the forefront of the cause of religious freedom, interfaith  dialogue, and peacebuilding, making him the longest-serving Archbishop  of Constantinople in the history of Christianity.\n\nBorn Demetrios Arhondonis in 1940 on…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695424/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…example to us all. As we  approach America's 250th birthday, let us honor veterans like John  Gilman not only with medals but through our daily commitment to live up  to the freedom they fought to defend.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696843/focusing-on-results"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…was wounded in the line of duty  and later returned home.\n\nFor his sacrifice, he was awarded the Purple Heart, a lasting  testament to his courage, humility, and devotion to freedom. The world  owes a debt to Mr. Brewton and to his generation that can never be  repaid.\n\nBorn and raised in Pensacola, FL, Mr. Brewton returned home after the  war. He raised…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700061/9999"}, {"senator": "John Rose", "party": "Republican", "sentence": "…of our military heroes. This  calculated betrayal was not only a staggering act of theft but a cruel  assault on the very families who sacrifice the most for our Nation's  freedom. By draining critical resources, she robbed military children  of the opportunities and security promised through 4-H.\n\nThe American people deserve answers, and they deserve…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695237/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "…conservation  standards for commercial refrigerators and freezers.\n\nIn the final months, the previous administration prioritized their  energy policies over Americans' prosperity and freedom. This  unnecessary and costly mandate would burden small businesses, increase  red tape, and jeopardize food safety.\n\nThe Department of Energy estimates implementing this…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689126/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…our national security, we must pass the  PROTECT Our Kids Act. It helps prevent foreign adversaries from  exploiting our classrooms and promotes education grounded in truth,  freedom, and American values.\n\nMr. Speaker, I urge my colleagues to support the legislation, and I  yield back the balance of my time.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697532/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…healing hand  on him, for strength for his family, and for protection over every man  and woman who serves.\n\nMr. Speaker, tragedies like this remind us that the cost of our  freedom is not free. None of these men and women were drafted or forced  to put on the uniform they wear. They boldly answered the call to serve  in defense of our freedom and safety,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697294/national-guard-shooting"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…United Negro College Fund. During his  time as a pilot, Pat volunteered to transport hundreds of American and  allied troops through the Middle East during Operation Iraqi Freedom.  On top of that, Pat and Beth have poured countless hours into  volunteering with local schools, educational programs, and park  district programs.\n\nIt is an honor to bestow…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694136/recognizing-congressional-patriot-award-recipient-pat-terrell"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…reasons God gave us a body in which whole milk clearly tastes better  than 2 percent milk and way better than skim milk.\n\nMr. Speaker, I urge my colleagues to strike a blow for freedom and to  bring the healthiness of our children back to what it was 50 years ago  and pass the Whole Milk for Healthy Kids Act.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698182/whole-milk-for-healthy-kids-act-of-2025"}]