[{"senator": "Seth Magaziner", "party": "Democrat", "sentence": "This bill claims to be about free markets."}, {"senator": "Christopher A. Coons", "party": "Democrat", "sentence": "House of Representatives for unanimously advancing this critical bipartisan legislation, and I will continue to advocate on behalf of Taiwan and the Taiwanese people, as guided by United States law.\"\n\n\"The House passage of this important legislation will help to strengthen Taiwan's democracy, its free market economy, and its standing on the world stage,\" said Senator Coons."}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "It is revealing that so-called innovators       in the free market fear they might be outdone by federal       technocrats."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "In fact, I voted to  advance his nomination out of the Commerce Committee because he has  expressed support for strong antitrust enforcement that benefits  consumers and small business, lowers prices, and spurs innovation,  including continuing many cases currently ongoing at the Commission to  free markets from the stranglehold of entrenched monopolies and stop  anticompetitive mergers."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "\"Under this President, the farming sector now finds itself relying more on government aid than free markets."}, {"senator": "Cory A. Booker", "party": "Democrat", "sentence": "This type of behavior does not reflect free market forces and is absolutely unacceptable."}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "For that to be the case, you have to have a cop on the  beat that understands the job, is focused on anticompetitive behavior,  and is driven to make sure that the free market works in the maritime  space."}, {"senator": "Dianne Feinstein", "party": "Democrat", "sentence": "\"We stand with the Chinese people, and call on the Chinese government to stop its egregious abuses, especially in light of the current non-violent protests happening in Hong Kong.\" \n\n\"Hong Kong represents a brave bastion of individual freedom, democracy, and free market capitalism in the face of China's constant authoritarian threat."}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "What is more alarming is that this trade policy also undermines the  Republican Party's historic commitment to free markets and open trade."}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "Public officials being able to sell access using crypto undermine our  democracy and free market system."}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "The American free market has led to some of the most incredible  technological advances of all time, so it is important that we  modernize our export control process to help protect it."}, {"senator": "Marco Rubio", "party": "Republican", "sentence": "Rubio: The thing is, we talk about [China's trade practices] as being unfair, that it's not how the free market is supposed to work!"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "It is no longer a free market in healthcare."}, {"senator": "Young Kim", "party": "Republican", "sentence": "Now more than ever, as socialist ideas gain traction here at home-- and as our Nation's largest city and financial capital has elected not  just a socialist, but a communist as mayor--we must firmly demand our  capitalist free market system, which empowers Americans of all  backgrounds to achieve freedom, opportunity, and prosperity."}, {"senator": "Richard C. Shelby", "party": "Republican", "sentence": "This type of behavior does not reflect free market forces and is absolutely unacceptable."}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "Our bill, the Anti-CBDC Surveillance State Act, prevents future  administrations from weaponizing this technology against the American  people while ensuring that any development of digital money reflects  our American values of privacy, individual sovereignty, and free market  competitiveness."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "This is just one example of Big Oil saying it wants a free market, but lobbying for taxpayer-funded corporate welfare."}, {"senator": "David Schweikert", "party": "Republican", "sentence": "How about if you are the most libertarian or free market?"}, {"senator": "Cory Gardner", "party": "Republican", "sentence": "Taiwan's commitment to freedom, democracy, and a free market economy is an example for the entire Indo-Pacific region,\" said Senator Risch."}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Mandates disrupt the free market."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Beware the next time Big Pharma claims what we are trying to do to  lower drug prices, in their words, ``undermines the free market.'' Just  remember this."}, {"senator": "Marco Rubio", "party": "Republican", "sentence": "That is why I am wholly committed to furthering our national development through a new American industrial policy compatible with and complementary to our free market system.\""}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "These bills promote free market innovation, protect privacy, and  ensure the next generation of finance is built on American values, not  Federal overreach."}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "That  is another reason why life is so much better in a free market economy."}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Or should we do it the way we always have in America, and that is let  the free market win out?"}]