[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…promoters that we believe do       not want to be displaced by a better, government-sponsored       digital currency. It is revealing that so-called innovators       in the free market fear they might be outdone by federal       technocrats. Public Citizen believes these self-described       crypto innovators are craven fraudsters looting the       vulnerable…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…marketplace. For that to be the case, you have to have a cop on the  beat that understands the job, is focused on anticompetitive behavior,  and is driven to make sure that the free market works in the maritime  space.\n\nMr. Speaker, this bill pushes forward all of those goals. I urge  support of this bill, and I yield back the balance of my time.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698123/federal-maritime-commission-reauthorization-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…week, we saw new reports that insiders made nearly $100 million  on Melania's meme coin.\n\nPublic officials being able to sell access using crypto undermine our  democracy and free market system.\n\nLet's look at this for what it is. This is how authoritarian regimes  do business.\n\nTrump has turned the Office of the Presidency into a personal  moneymaking machine,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, this bill unnecessarily restricts the free  market. It dictates what private sector fiduciaries can and cannot  consider when making investment decisions that directly affect the  savings and retirement savings of hardworking…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699158/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…costly, and more  than half the fleet is already scheduled to retire. NERC reliability  data shows increasing forced outage rates for coal plants in recent  years.\n\nThis is not free market competition. This is protectionism for  expensive incumbents while families are footing the bill.\n\nThe third thing I would like to talk about is reliability. Opponents…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700230/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…Ronald Reagan often warned: ``Government  is not the solution to our problem; government is the problem.''\n\nHousing affordability is a good place to start. When and where a free  market is maintained, homebuilders have every incentive to meet the  housing needs at every income level. The profit margin might be bigger  at the top, but the sheer numbers of…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697036/government-is-still-the-problem"}, {"senator": "James Risch", "party": "Republican", "sentence": "…value human rights and value the individual way, ahead of the  state. On the other hand, you have countries like China that are  communist. They are socialists. They are not free market or capitalist  motivated. And they have no regards for human rights. The best example  of that is the genocide that they commit against the Uighur Muslims in  China, and…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690343/9999"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…NCRI's plan for the  autonomy of Iranian Kurdistan.\n\nEight, justice and equal opportunities in the realms of employment  and entrepreneurship for all the people of Iran in a free-market  economy: restoration of the rights of blue-collar workers, farmers,  nurses, white-collar workers, teachers, and retirees.\n\nNine, protection and rehabilitation of the environment,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…useful fools to be used in order to get to the  business of power, which is all socialist, communist, whatever you want  to call it. If it is not democracy, freedom, and a free-market economy,  it is just a bad ideology. Unfortunately, that is what they do to  achieve power. They use us.\n\nJust look at Venezuela. Oh, my God, Venezuela is in the news.…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697160/denouncing-the-horrors-of-socialism"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…going to grow like crazy.'' We can, but you  have to do policies that maximize productivity. ``Productivity might  cause creative destruction.'' We are not allowed to do free-market  economics anymore. Remember, we are populists now.\n\nIf you embrace that you are going to drive this country--we will  still be greater than any country on Earth, but we…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…SCHWEIKERT. You have to understand. Okay. You are not going to  raise taxes. I despise raising taxes.\n\nMr. SCHWEIKERT. I want as much velocity in the economy. I am a  classic free-market economist.\n\nMr. SCHWEIKERT. But borrowing money is a tax hike, and it is a tax  hike with interest on it.\n\nMr. SCHWEIKERT. It is just to be paid at a future date. Yet, because…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…traction here at home-- and as our Nation's largest city and financial capital has elected not  just a socialist, but a communist as mayor--we must firmly demand our  capitalist free market system, which empowers Americans of all  backgrounds to achieve freedom, opportunity, and prosperity.\n\nI know what America represents because I remember my first glimpse…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697152/denouncing-the-horrors-of-socialism"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…deeply flawed rule to enable retirement plan fiduciaries to consider or  choose investments based on environmental, social, and governance, or  ESG, factors. That is not free market. That is not capitalism.\n\nIt is proven that ESG factors often charge steeper fees, carry higher  risks, have lower returns, and are well-known underperformers. That is…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699156/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…has a  good handle on why capitalism is good.\n\nFirst of all, we ought to require all defenders of capitalism to not  call capitalism ``capitalism.'' We ought to call it a free-market  economy. The major reason we would rather live in a country with a  free-market economy than in a country that is a socialist economy is  the government has so much more…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…products for consumers, destroying our conventional,  traditional banking system.\n\nOur banking system, in contrast to Europe and China, is the envy of  the world due to its free market principles, dynamism, and diversity.  Banks of all different sizes serve customers, communities, and  businesses with all different needs. Capitalism promotes market  demands,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693730/anti-cbdc-surveillance-state-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…should also note that the timing of this regulation  was 7 weeks after Americans overwhelmingly rejected the Biden-Harris  regulatory regime.\n\nTo my colleagues who support the free market, this job-killing  regulation eliminates consumer choice by effectively enabling nameless  and faceless bureaucrats to choose which companies may operate and  which companies…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688294/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "John Rose", "party": "Republican", "sentence": "…privacy is among  the most fundamental. Establishing a central bank digital currency  would not only usurp consumers' privacy and individual freedoms, but it  would also hinder free market innovation.\n\nDigital assets are here to stay. I agree strongly with President  Trump that the United States should be a leader in this space. However,  the last administration…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693729/anti-cbdc-surveillance-state-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…payment stablecoins to  enhance the payment rails.\n\nAs the United States grapples with modernizing our own payment  systems, we are confronted with a choice. Do we empower free-market  solutions that protect privacy and protect individual liberty, or do we  centralize control over payments in the hands of the Federal  Government?\n\nMr. Speaker, the choice…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693734/anti-cbdc-surveillance-state-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…rates are not so high. As the cost of energy goes down, it  will lower the cost of anything and lower inflation on other goods as  well. Anybody who remotely believes in the free market believes there  will always be a market for new housing.\n\nThere are apparently some places around the country where it is hard  to build new housing, but that, in general,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…where you can make a profit by fixing the incentives within  the system or you can basically get a cramdown. Which one do you want  to do? Do you want to prove that you are a free market manager, that a  free market system actually can deliver healthcare and do it better,  faster, more efficiently, and more morally because you give a darn  about your patients?…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}]