[{"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…respect for the  Constitution. What we have seen continue to rise, instead, are grocery  prices. We are seeing the cost of living grow out of control as  families experience freezes in critical funding that supports their  households. We are seeing housing costs continue to skyrocket as well.\n\nAgain, we were promised the exact opposite, which is that…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…Defense civilian workforce, barring arbitrary layoffs for DODEA  teachers and childcare staff, and shielding public shipyard employees  from reductions in force or hiring freezes.\n\nI am very grateful that this bill moves forward a reform that I have  worked on for years. It authorizes automatic Selective Service System  registration for eligible men,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697807/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…the Transportation, Housing and  Urban Development, and Related Agencies Subcommittee, I rise in strong  support of this bipartisan legislation in large measure because it  freezes funding for the Department of Homeland Security at its current  level while allowing for several days, 10 to be exact, for us to  continue to zero in on that segment of the…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699579/consolidated-appropriations-act-2026"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "Mr. WHITEHOUSE. Mr. President, the world is undeniably round; water  undeniably freezes at 32 degrees Fahrenheit; and equally undeniably,  the climate is changing, and the changes in the climate are human- caused by fossil fuel emissions. Fossil fuel emissions…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…reluctantly, to  oppose Richard Topping as the next VA Financial Officer, and I say  ``sadly and reluctantly'' because the VA really needs leadership now at  a time of mass firings, freezes on hiring, cuts, and the kinds of chaos  that we are seeing at this great institution that serves our Nation's  heroes. We need a really experienced, steady, principled financial…", "date": "2025-07-24", "source_url": "https://justfacts.votesmart.org/public-statement/1694219/9999"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…need to fulfill our promises.\n\nAs VFW commander Al Lipphardt said at that hearing, apply pressure  and stop the bleeding.\n\nThese heartless and heartbreaking cuts, firings, freezes are un- American. My Republican colleagues, who have been almost entirely  silent, please do the right thing. Our country has made a sacred  promise. Our duties as Members…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…chopping block as the Trump  administration cedes, in this bill, our glass industry and America's  lead in solar energy to China.\n\nGrocery prices are up 2 percent, yet the bill freezes SNAP, a cut for  45,000 families in my district, which is an $18 million monthly blow to  local grocers.\n\nThe bill ensures billionaires get $300,000 in tax breaks every year…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693166/one-big-beautiful-bill-act"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…not really sure.\n\nAbsolutely nothing adds up.\n\nThese DOGI efforts have introduced fraud, waste, and inefficiency  into every agency they have touched with their invasions, freezes, and  suspensions.\n\nFederal workers have been fired then rehired as their functions were  quickly proven to be indispensable rather than nonessential. Employees  have been…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687998/department-of-government-inefficiency"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…activities within the NIH relating in any capacity to  the health of LGBTQ Americans, including active research programs, and  President Trump violated court orders to halt funding freezes to  organizations like the NIH.\n\nRepublicans rejected legislation to cap insulin costs for millions of  people with diabetes nationwide. Now they want to raise costs for…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…servants dedicate their lives to serving the American  people. The administration has created chaos and confusion that adds to  the difficulty of their jobs through Federal hiring freezes, which have  left them short-staffed.\n\nIn addition to showing our appreciation for these critical public  servants and first responders, I hope my colleagues will work with…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693929/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "Mr. VASQUEZ. Madam Speaker, I rise today to address the dire  consequences of the Federal funding freezes and mass firings that are  devastating communities across the country, including in my home State  of New Mexico.\n\nOver the past few weeks, I have spoken with New Mexicans…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687984/dire-consequences-of-funding-freeze-and-mass-firings"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…than ever before in so many industries, small businesses are living  through some of the most truly uncertain times in American history,  from the threats of Federal funding freezes to the threats of trade  wars against our neighbors and allies.\n\nIn Congress, I am fighting every single day to ensure that New  Hampshire small businesses get true advocates…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687955/small-business-advocacy-improvements-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Do the right thing. But if you don't, I ask my colleagues on the other  side of the aisle: Join us from that other side of the aisle; join us  in decrying these cuts, the freezes, the firings, the terminations.  They are illegal and immoral.\n\nAnd we will move forward. We will continue to fight because American  values are at stake.", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…She was his senior adviser when Doug  Collins wanted to end the veterans' suicide crisis line, which  epitomized the cruelty and stupidity of those cuts in workforce, hiring  freezes, ends in contract.\n\nAnd despite a formal request from myself and Senator Peters, the  Republican chairman of the Committee on Homeland Security and  Governmental Affairs refused…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694542/9999"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…they can give tax  breaks to their billionaire buddies.\n\nEvery day for the last 6 weeks, we have heard horror stories of mass  firings across the Federal Government, funding freezes, and Elon Musk  and his minions having access to every American's private, personal  financial and healthcare information. This is what I hear about when I  go home. The list…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688549/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…publicly name individuals and entities  involved in forced organ harvesting in China. It imposes targeted  sanctions under the Global Magnitsky Act, including visa bans and asset  freezes, against those responsible. It strengthens reporting  requirements for the State Department, ensuring that U.S. foreign  policy fully accounts for the scope of organ trafficking…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}]