[{"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…by accident. It happened because  our mothers, grandmothers, great-grandmothers, aunties, sisters, and  cousins dared greatly and forged new paths for us to walk on. The  freedoms and privileges we enjoy today are because of those who came  before us. These are their stories.\n\nOver the next hour, we will hear from women Members across the  country who…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689165/womens-history-month"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…what we can do  with our bodies, and that is not freedom.\n\nI stand with all our servicemembers, including our trans  servicemembers, who are willing to fight and die for our freedoms. I am  going to fight for their freedom to be who they are, to fight for an  America where we all belong. We should not be at war with each other.  We all belong.\n\nMs. JACOBS.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…the  rule of law.\n\nIn purpose and effect, he has attempted to suppress dissent and  opposition, casting a chilling effect over the public discourse and  striking at the core freedoms essential to a free society and  Democratic elections under the Constitution.\n\nWherefore, Donald John Trump, by such conduct, has demonstrated that  he is unfit to govern…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…smell and feel wrong, given our history and given our values.\n\nI think what is most abhorrent about what is going on in Minneapolis  is that it runs against the fundamental freedoms of who we are as  Americans.\n\nNow, the President, who ran, in many ways, on the issue of  immigration, has managed to piss off everybody--left, right, and  center. Whether…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…Army for 20 years, and my grandfather served in  the Army, as well. Through them, I learned about service, leadership,  and dedication to country.\n\nOur veterans defended our freedoms, and we owe it to them to provide  real support when they return home. Yet, veterans face distinct  barriers when starting a business, from accessing capital to overcoming…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687887/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…of Soviet-style propagandist playbooks. It is Putin who wants to take  Ukraine's resource-rich land. It is Putin who wants to strip its people  of their rights and their freedoms, and it is Putin who wants to  destroy another European democracy. It is Putin who is a cancer on the  world, a liar, a torturer, a murderer, and a war criminal.\n\nIt is appalling…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…great respect and admiration that I recognize Mauro Reza  for his selfless service to our country. His story is a testament to  the courage of those who have fought for our freedoms, and I urge my  colleagues to join me in expressing our gratitude for his dedication.", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689403/congratulating-mauro-reza-boots-on-the-ground-alliances-veteran-of-the-year"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…changing their policies, they are seeking to change the rules.\n\nJohn Lewis was not bludgeoned on a bridge in my hometown for the  Republicans and Donald Trump to take these freedoms away from us. This  is a blatant power grab, and Democrats will not stand for it.\n\nVote ``no'' on this disastrous legislation.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700009/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…design their role is national and is not  limited to one state or one county. Limiting the ability of federal  courts to carry out their duty would undermine the rights and freedoms  of all Americans.\n\nThe No Rogue Rulings Act of 2025 would prevent federal district court  judges from providing nationwide injunction relief when one of  President Trump's…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690122/no-rogue-rulings-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…of tyranny are a threat to liberty  everywhere, and Ukraine stands on the front line. If support for  Ukraine is withdrawn, Russia and its allies' assault on fundamental  freedoms will spread.\n\nMay no one in this generation become swallowed by the tiger. Those  who do not know and study history are doomed to repeat it.\n\nProper funding in this bill will…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693693/department-of-defense-appropriations-act-2026"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…those who have been wounded or killed in  action while serving in the U.S. Armed Forces. It represents not just  injury, but sacrifice--the physical cost of defending our freedoms.\n\nCorporal Donald served honorably for over six years, including  deployments to both Afghanistan and Iraq. His time in uniform coincided  with some of the most dangerous…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691113/recognizing-the-incredible-service-of-united-states-marine-corporal-joseph-donald"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…known to be true: Terrorizing is the point. Violating our rights is the  point. Fear is the point.\n\nCreating a public enemy is meant to convince Americans to sacrifice  our freedoms for the promise of security. Let me be very clear. Nothing  that the Department of Homeland Security is doing is making us any  safer.\n\nIn this moment, under Secretary Noem…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697453/fighting-dhs-immigration-raids"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…toward  privatizing VA services and blocks women who are veterans from being  able to get abortion services at the VA in most cases. Republicans are  trying to restrict the freedoms of the people who are willing to fight  and die for our freedoms. Republicans are unbelievable.\n\nI am glad that we are here on the floor debating, Mr. Speaker. I just  don't…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…rights. In his annual State of the Union  Address to Congress on January 6, 1941, President Franklin Delano  Roosevelt underscored the importance and shared commitment to four  freedoms. Many of you know them.\n\nThe first freedom is freedom of speech and expression; the second is  the freedom of every person to worship their own way; third is the  freedom…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…The benefits our veterans received after they served our country are  not gifts or handouts. They are part of a sacred obligation to ensure  that those who have defended our freedoms can live with dignity,  security, and opportunity.\n\nWhen veterans struggle to meet their basic needs, it is not just a  personal burden. It is a national moral failure.\n\nEnsuring…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696762/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…resolution today is just one example of her commitment to her  constituents and our entire Nation. The contrast between the successful  policies under market capitalism and the freedoms associated with,  particularly, our robust democracy here in America and socialism across  the world and in history could not be starker.\n\nI cannot express this enough: This…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697143/denouncing-the-horrors-of-socialism"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…has  stood as a pillar of strength, sacrifice, and service. From the  earliest days of our Nation's founding to today's complex challenges,  Army soldiers have defended our freedoms, upheld our values, and  protected the American people with unwavering courage.\n\nThis historic anniversary reminds us of the countless sacrifices made  by generations of men…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692323/taking-an-important-step-for-rural-america"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…countless hours to  fundraising efforts that provided construction projects for disabled  veterans, ensuring safe homes and greater mobility for those who  sacrificed for our freedoms. He further demonstrated his compassion and  solidarity by volunteering at local VA hospitals and participating in  funeral escorts to honor fallen service members and veterans.…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696272/recognizing-christopher-aaron-mcgowen-with-a-congressional-veteran-commendation"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…strong and capable  military is the best way to do that.\n\nIn a few short weeks, we will celebrate Independence Day. I encourage  all Americans to recognize and appreciate the freedoms that the Army  has defended for 250 years, and I will continue to defend that in the  future. And I want to thank President Trump for bringing attention to  the 250th birthday…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692460/executive-calendar"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…be here in the people's  House once again.\n\nJust a week ago, when I was celebrating with friends the July Fourth  holiday, watching the fireworks go off and celebrating the freedoms we  enjoy, many people actually came up to me in Palm Bay.\n\nIn fact, one mom came up to me and said: How can you vote to take  away my child's Medicaid? He is disabled. For…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693529/read-the-bill"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…research and development efforts into the  potential design and development options of a United States CBDC.''\n\nPresident Trump understands a CBDC's threat to our American freedoms.\n\nIn his January 2025 executive order, President Trump explicitly  prohibited any Federal agency from issuing or advancing a CBDC without  direct congressional authorization.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693734/anti-cbdc-surveillance-state-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…Department's healthcare facilities, similar to my CHIP IN  for Veterans Act. This is the very least we can do for the troops and  the families who have sacrificed so much for the freedoms that we hold  dear.\n\nBeyond the details, we must keep sight of the bigger picture. Our  adversaries--nations that hate America--well, they are sharing weapons  and resources…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695027/9999"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…find that the situation in Venezuela,  including the government of Venezuela's erosion of human rights  guarantees, persecution of political opponents, curtailment of press  freedoms, use of violence and human rights violations and abuses in  response to antigovernment protests, and arbitrary arrest and detention  of antigovernment protestors, as well…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…patriot, a great American, and an  inspiration to us all. I am forever grateful to him and other members  of the Greatest Generation for sacrificing and fighting to preserve the  freedoms that we hold dear. It is my honor to recognize his life and  his service before the United States Congress.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690221/in-memory-of-vaughn-p-drake-jr"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…support  members of our military.\n\nI congratulate President Armacost, Director Angie Carpenter, and the  entire UND community for their dedication to those who defend our  freedoms.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697044/recognizing-university-of-north-dakota-upon-earning-gold-award"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…man. We  live in freedom because others have made the ultimate sacrifice. As a  Nation, we must never take for granted, the liberties we enjoy today,  recognizing that these freedoms have been hard-won by the honor,  commitment, and sacrifice of our Veterans. Each Member in this chamber  and every citizen in these United States should be humbled by the…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691306/recognizing-the-honor-flight-of-southern-oregon"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…rule. The  resolution is not just about restoring access to trails. It is about  standing up for the rights of my constituents, protecting local  economies, and preserving freedoms that define our Nation.\n\nLet us be clear: Conservation and access are not mutually exclusive.  We can protect our natural heritage while ensuring that Americans can  go see…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690403/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Usually, when I  think of Europe, I think of Europe as being kind of like the United  States, right? You take an airline to London or Paris or Rome, and you  expect the same freedoms and prosperity you do in the United States.\n\nIn this hearing, we heard of a woman who is a member of the Finnish  Parliament. She was charged with a crime and has had to go…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…making Savannah the largest Jewish settlement in the  English colonies in North America at the time; and\n\nWhereas, the belief in the greatness of the American way of life, the  freedoms enshrined in American law and jurisprudence, and the  opportunities sustained by American democracy drew generations of  Jewish immigrants to America, including Jews fleeing…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688926/designating-april-29-as-endjewhatred-day"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Act, in order to protect our kids and to protect  our country.\n\nThe Chinese Communist Party is responsible for severe human rights  abuses and the suppression of fundamental freedoms, with a long and  well-documented history of censorship, oppression, and disregard for  human rights.\n\nHowever, it is equally well understood that the CCP aggressively  pushes…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697530/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}]