[{"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…important way to bolster our alliance structure in East  Asia and the Pacific and do what we do best as a nation: work with our  allies toward a common cause, in this case, a free and open Indo- Pacific.\n\nThe AUKUS agreement accomplishes these ends by providing Australia  with additional submarine training and technology in Pillar I, as well  as knitting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694780/aukus-reform-for-military-optimization-and-review-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…contributed to this partnership's success. The enduring engagement  between the Hawaii National Guard and the Philippine armed forces has  advanced the strategic goals of a free and open Indo-Pacific and  strengthened the bonds between our two great nations.\n\nLet us honor this important milestone not just as a celebration of  the past but also as a reaffirmation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695815/recognizing-the-25th-anniversary-of-the-hawaii-national-guards-state-partnership-program"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…advance our shared interests and values,  particularly in the context of growing geopolitical competition and  threats by our shared adversaries to endanger the pursuit of a free and  open Indo-Pacific.\n\nOver the last three Congresses, we have introduced versions of the  BLUE Pacific Act, which would advance a comprehensive, long-term U.S.  strategy in the…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693346/introduction-of-the-blue-pacific-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…the vast Pacific Ocean, have a  collective maritime area that exceeds the land area of Russia and China  combined. These jurisdictions are key partners in maintaining a free  and open Indo-Pacific and meeting vital security and economic  challenges. It is imperative that we develop, maintain, and grow these  relationships.\n\nRecognizing this, successive…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697950/supporting-the-prosper-in-the-pacific-act"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…our commitment to  working as allies, as partners, to positively contribute to defense  security around the world, including leveraging our shared capabilities  to shape a free and open Indo-Pacific and to counter the rising threat  that China poses.\n\nI recently returned from a bipartisan, bicameral codel to Australia  and the Indo-Pacific, and all were…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694781/aukus-reform-for-military-optimization-and-review-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…advance our shared interests and values, particularly in the context of  growing geopolitical competition and threats by our shared adversaries  to endanger the pursuit of a free and open Indo-Pacific.\n\nTo bolster U.S. engagement with this region, we have reintroduced our  Pacific Partnership Act, which passed the House unanimously in the  118th Congress.…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693376/introduction-of-the-pacific-partnership-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…advance our shared interests and values, particularly in the context of  growing geopolitical competition and threats by our shared adversaries  to endanger the pursuit of a free and open Indo-Pacific.\n\nI urge my colleagues to join me in supporting this legislation to  sustain and expand U.S. engagement in this critical region.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694767/supporting-the-partner-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Reunification Act, which seeks to reunite World War II Filipino  soldiers with their children, so that we can honor those living in our  community who fought to protect the free and open Indo-Pacific that we  have today.\n\nEach and all these lives of achievement are but a small sampling of a  broader community that has achieved so much and contributed so…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695943/recognizing-filipino-american-history-month"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…to who we are. After all, what is more American than the  ability to question authority? Questioning authority is, in fact, how  we came to be a Nation.\n\nWe all lose when free and open debate is replaced with violence or  threats. We must not lose our right and our responsibility to speak up  against abuses of authority.\n\nPower in America has always been…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…superiority.\n\nI urge my colleagues to support this bill to send a strong message to  our adversaries and friends alike that the United States is serious  about preserving a free and open Indo-Pacific with our allies.\n\nMr. Speaker, I thank the Foreign Arms Sales Task Force co-chairs,  Representatives Zinke and Dean, for leading this bill with me.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694782/aukus-reform-for-military-optimization-and-review-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…and Guam and met with leaders in Palau, the Philippines, and  Taiwan. That trip underscored a simple reality: We are living in a time  of global unrest, and maintaining a free and open Indo-Pacific is vital  to the security of both the United States and our partners.\n\nOn the final leg of the trip, I met with Taiwanese officials and saw  firsthand how…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…China also uses informational warfare, and it would love to influence  what American students learn in classrooms, from kindergarten through  college.\n\nThe CCP uses our free and open society against us, bankrolling civil  organizations with nice-sounding names to sponsor exchange programs and  curriculums that hide the truth about China.\n\nEarlier this…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697437/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…today in support of H.R. 1069, the  PROTECT Our Kids Act. For far too long, American education has been  undermined from within by actors who have taken advantage of our free  and open society to advance the nefarious and anti-freedom objectives  of the Chinese Communist Party.\n\nUnder the veneer of cultural and educational exchange, the CCP and  operatives…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697528/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Reagan's vision for America can be seen in our trading  relationships with Canada. In 1986, President Reagan said:\n\nOur trade policy rests firmly on the foundation of free and       open markets. . . . I . . . recognize the inescapable       conclusion that all of history has taught: The freer the flow       of world trade, the stronger the tides for…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "French Hill", "party": "Republican", "sentence": "…large outside financial institutions has garnered a tremendous amount  of bipartisan work.\n\nThis House wants to make sure that we prepare this country for a  prosperous, free, open Web3 technology as we go into seeing the  benefits of writing applications on a blockchain. We will see  competition in blockchains, just as we saw competition in operating…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693731/anti-cbdc-surveillance-state-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…strong message that the United  States will stand shoulder to shoulder with our friends, including our  Indo-Pacific partners, from the Philippines to Palau, to promote a  free, open, and prosperous region.\n\nThis bill is not just about diplomatic immunities; it is about  American leadership on the global stage.\n\nMr. Speaker, I am proud to co-lead this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694824/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…held by Hamas.''\n\nI am for that. That is why I cosponsored Mr. Evans' resolution.\n\nNumber three, it says: Be it resolved that the House of  Representatives ``affirms that free and open communication between  State and local law enforcement and their Federal counterparts remains  the bedrock of public safety and is necessary in preventing terrorist  attacks.''…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692193/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…bureaucrats think you need.\n\nFinally, of course, you are overwhelmingly wealthier because in a  free market economy, Mr. Speaker, you are free to work hard, and you  are free to open up your own business. By doing that, all of society is  wealthier, as opposed to the socialist state in which everybody has to  work for the government. There is no guaranteed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…partnership.\n\nThe AUKUS partnership is a groundbreaking defense partnership between  the United States, the U.K., and Australia, created with the intention  of keeping a free and open Indo-Pacific and strengthening defense trade  between the U.S. and our closest allies.\n\nThe AUKUS partnership presents a unique opportunity for the U.S. to  strengthen…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694783/aukus-reform-for-military-optimization-and-review-act"}]