[{"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…make ends meet. All  of this is for billionaires and corporations to get tax cuts they do  not need and that our country cannot afford.\n\nI am pleased to do this with my friend, Chairman Schweikert. I also  believe in math, and I rarely brag, but I am good at math.\n\nAmericans have been clear. They want lower prices and an economy that  works for them.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…and that the  motion to reconsider be considered made and laid upon the table.\n\nMr. BLUMENTHAL. I want to respond very briefly to my colleague from  Mississippi and my friend, the chairman of the Armed Services  Committee. We have worked together, as he does always, in a bipartisan  way on armed services issues. So what I am about to say is not personal…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "Mr. BEYER. Mr. Chair, the PERMIT Act is the bill you offer when you  don't want to protect clean water. It is a very sad and extreme bill.  With respect to my good friend, Chairman Babin, this amendment only  makes it worse.\n\nIn 2023, the Supreme Court gutted clean water protections that we  have relied on since the 1980s, and now, the Trump administration…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698038/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Erin Kolodjeski, Philip Tizzani, Ed Etzkorn, and Laurie Mignone, who  worked tirelessly to produce this legislation.\n\nI thank our counterparts in the majority, led by my friend, Chairman  Cole, and the subcommittee chairs,   David Joyce and Mario Diaz-Balart.\n\nThese two bills are a continuation of our efforts to reassert  Congress' power of the purse,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…well that we are grappling in Florida  where the largest utility has requested what looks like the largest  rate increase in the history of the country. I hear my good friend, the  chairman of the committee, talk about this. They care a lot about  consumer costs, but their rhetoric does not match their record.\n\nExample number one is the big, ugly bill.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695767/national-coal-council-reestablishment-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…about digital assets than anybody on the opposite side of  the aisle.\n\nMs. WATERS.\n\nMr. Speaker, Democrats are not the only ones who want to study CBDC.  In 2021, my dear friend, Chairman Hill, worked with Representative  Foster to introduce the Central Bank Digital Currency Study Act.\n\nChairman Hill also wrote a letter to the Fed asking for information.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693736/anti-cbdc-surveillance-state-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…up for the rule of law and reject this harmful  legislation.\n\nMr. Speaker, I have a lot more to say, but I reserve the balance of  my time.\n\nIt is interesting that my friend, Chairman Hill, raised process  concerns over the CFPB, Consumer Financial Protection Bureau, rule that  would include following the Administrative Procedure Act.\n\nMr. Speaker,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…send a shout-out to Chris Bigelow, the appropriations staff director.\n\nOf course, I thank our Republican counterparts on the committee under  the leadership of my dear friend, Chairman Cole.\n\nWhen we began this process, we set out three goals: protect  Democratic priorities, eliminate any poison pills, and reassert  Congress' power of the purse. I am…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698760/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "Mr. BARR. Mr. Speaker, I thank my friend, Chairman Hill, for bringing  this important resolution of disapproval to the House floor, nullifying  the Consumer Financial Protection Bureau's disastrous overdraft rule.\n\nLet…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689846/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…(4) protecting public health.\n\nMr. Speaker, I rise today in strong support of H.R. 1082, the Shandra  Eisenga Human Cell and Tissue Product Safety Act, led by my good friend  Chairman Moolenaar from the great State of Michigan. This bill was  borne out of a heartbreaking tragedy that we hope will never be  repeated again.\n\nIn 2023, a Michigan constituent…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692768/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…is built. This legislation is  designed to restore that faith, to save our elections, and to save  election integrity.\n\nI am proud to have worked on this bill with my friend, the chairman,  and with my colleagues on this side of the aisle. I would note that  five of my Democratic colleagues joined us last summer to vote for this  bill, hardly a partisan…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690006/safeguard-american-voter-eligibility-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…children. It is our job to stand up for them.  That is why I rise today in support of the Coercion and Sexual Abuse  Free Environment Act introduced by my colleague and friend, Chairman    Andy Biggs.\n\nThis bill will ensure accountability for anyone who intentionally  compels a minor to engage in self-harm or other degrading acts. As  child abuse continues…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698880/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…remains to be done.\n\nLast year, Mr. Chair, over 50,000 Americans lost their lives to  opioid overdoses. That is why this bill is so important to reauthorize.  I thank my friend and the chairman for including my bill, the 9-8-8  Lifeline Cybersecurity Responsibility Act in this bill. I hope everyone  in the Chamber is aware of the 9-8-8 lifeline and the vital…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691879/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I thank my friend, Chairman Griffith, for  yielding time.\n\nMr. Speaker, this rule is an example of unsubstantiated bureaucratic  overreach that does not have any added impact to public health benefits…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688524/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…live in the heart of our largest cities or  in the most rural, remote communities, have uninterrupted access to the  healthcare that they have earned.\n\nI thank my good friend Chairman Bost and Ranking Member Takano for  their support in advancing this bill as one part of the effort to  support our veterans.\n\nI also thank my friend Mark Berry, a former…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695454/protecting-veteran-access-to-telemedicine-services-act-of-2025"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "Mr. BURLISON. Mr. Chair, I thank the gentleman for yielding.\n\nMr. Chair, I rise today in support of the PERMIT Act introduced by my  good friend and chairman of the Water Resources and Environment  Subcommittee, Congressman  Mike Collins.\n\nThis bold legislation delivers a long-overdue blow to the radical  environmental agenda…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698024/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, I thank my friend, the chairman of the full  committee of the Committee on Energy and Commerce, for yielding.\n\nMr. Speaker, I rise in support of my bill, H.R. 3109, the REFINER  Act. This legislation…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697029/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…similarly allow our vast natural resources to advance  our national security interests.\n\nMr. Speaker, I urge my colleagues to support this legislation, and I  thank my friend, the chairman of the committee, for bringing forth this  bill.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697081/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…from Chinese  propaganda, and shine a light on how China tries to influence our  education system.\n\nI thank my colleagues for their work on this legislation and my good  friend Chairman Walberg from Michigan for moving the bills through the  committee and bringing them to the floor.\n\nMr. Speaker, I urge my colleagues to vote for the bills.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697437/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…that bipartisan work in both Chambers. Wow, we  are actually legislating. We are seeing bills passed in both Chambers.  It is exciting for me to see the good work of my friend, Chairman Tim  Scott of the Banking Committee, in leading a policy-driven effort to  put America's financial leadership first. S. 1582, as written by Bill  Hagerty, does exactly…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693834/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "Mr. JOHNSON of Louisiana. Mr. Speaker, I thank my friend, Chairman  Cole, who has done an extraordinary job in this process.\n\nMr. Speaker, we all know why we are here. House Democrats voted to  shut down the government. It was 54 days…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696723/continuing-appropriations-and-extensions-act-2026"}, {"senator": "John James", "party": "Republican", "sentence": "Mr. JAMES. Mr. Chair, dramatic pause for effect, I rise today to  speak in favor of the SUPPORT for Patients and Communities  Reauthorization Act of 2025. I thank my friend, Chairman Guthrie, for  his very hard work and leadership in getting this done.\n\nFentanyl is a scourge on our Nation, leaving a trail of heartbreak  and destruction in its wake.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691886/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Madam Speaker, I thank my friend, the chairman of the  Committee on Energy and Commerce, for getting this bill here to the  floor.\n\nMadam Speaker, I rise in support of H.R. 3628, the State Planning for  Reliability…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697887/state-planning-for-reliability-and-affordability-act"}]