[{"senator": "Dina Titus", "party": "Democrat", "sentence": "…Endowment for Democracy, prohibiting funding for that  important organization.\n\nBy eliminating NED's appropriation, U.S.-based nonprofit  organizations, local partners, and frontline democracy defenders in  dangerous contexts will be put in immediate jeopardy, undermining  efforts to support emerging democracies and those resisting  authoritarian rule…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699042/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…ravage my home State of Oregon every summer, and the threat is growing.  I am here today to speak out against cuts to programs that support  wildland firefighters and their frontline crews.\n\nFor years now, American families in the Pacific Northwest have lived  on the edge, wondering if this will be the year they are forced to flee  their homes at night…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692450/wildfires-in-oregon"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…percent increase. Moreover, since February 2025, SSA reduced staff by  nearly 6,000 employees through encouraging retirements and voluntary  resignations, including 2,000 from frontline positions. In August 2025,  SSA diverted 2,000 field office staff away from serving customers in  the front office to answer national 800 number calls indefinitely.  Field…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697776/claiming-age-clarity-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…response and recovery by leveraging private sector resources. Moreover,  Good360's preparedness model reduces waste, improves efficiency, and  strengthens the capacity of frontline communities to withstand and  recover from future disasters.\n\nGood360's innovative use of advanced data and resource matching  technology accelerates donation routing and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694807/recognizing-good360-in-honor-of-national-preparedness-month"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…died for.\n\nEarlier this year, the Department of Labor planned to shutter dozens  of the Mine Safety and Health Administration field offices across the  country. These are the frontline offices that work to keep mines safe  and help to review plans, inspect sites, and make sure someone is there  to look out for workers when lives are on the line.\n\nEventually,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…will dry out. Insurance rates and electric  bills will spike.\n\nSome Arizonans saw triple-digit increases on their electric bills  this summer. More evictions will follow. Frontline workers will stay  home or end up hospitalized. Our local economies will lose millions.\n\nWe have to take this seriously, but this administration has shown a  profound disregard…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695656/extreme-heat-caucus"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…plain sight, a direct  assault on the rule of law and on the American people.\n\nTo my colleagues in this Chamber: We are not just Representatives of  our districts. We are the frontline defenders of our Republic. We  cannot merely just watch history unfold, we must shape it.\n\nIt is on each and every one of us to tell the truth. Donald Trump is  coming for…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691330/threat-to-suspend-habeas-corpus"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Confederate flags  and symbols of White supremacy as patriots. That is gaslighting on  steroids. The true patriots are our brave Capitol Police officers who  fought on the frontline and held the line for as long as they possibly  could. The true patriots are the Americans that stand up for democracy  and speak out against authoritarianism. The true patriots…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698517/anniversary-of-january-6"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…pollutants,  and ends longstanding air quality rules that keep children with asthma  out of the ER. Ending these safeguards could cause thousands more  asthma attacks per day in frontline communities.\n\nThis bill also greenlights unchecked offshore oil and gas leasing. It  guts environmental reviews and public comment requirements. It  threatens fisheries,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…The truckloads in question represent over 600,000 meals that the food  bank will not be able to put on the tables of Delawareans.\n\nYes, the Food Bank of Delaware plays a frontline role in combating  hunger, but they offer more than just food. They provide dignity, hope,  and a sense of community.\n\nFood banks, which are already stretched thin, are now…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689020/food-banks-facing-urgent-crisis"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Ukraine's independence, sovereignty, territorial integrity, as well as  for the security assistance packages provided to Ukraine, which have  helped stabilize the situation on the frontline.''\n\nThe people of Ukraine are beyond grateful. If you walk through the  streets of Ukraine and you are identified as an American, people will  come up to you and thank you.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688568/9999"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…thermal imaging  technologies to better locate victims in low-visibility environments.  As we look ahead, I remain committed to working with Metro Fire to keep  them on the frontline of emergency and disaster response, with the  resources necessary for any situation they may face.\n\nMr. Speaker, I ask my colleagues to join me in commending the  dedicated…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698078/recognizing-sacramento-metropolitan-fire-districts-25th-anniversary"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…opportunities to  work with the private sector and others developing and implementing our  latest technologies.\n\nThis bill also authorizes CBP's Innovation Team to work with  frontline agents and officers to develop pilot programs that help them  do their job in keeping America safe.\n\nTheir work is another great example of why Federal workers are so  important…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688687/emerging-innovative-border-technologies-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…have got premiums going up; and now we have  providers closing.\n\nThe fourth consequence is pretty obvious: When providers close,  people get fired, so people lose their jobs. Frontline healthcare  workers who are doing good work in the communities and having people  rely on them, they lose their jobs. That is consequence four.\n\nThen, consequence five is…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…about it. Eliminating these standards is climate  sabotage. Overturning even a few of them jeopardizes that future. It  locks in dirty fossil fuel use. It worsens pollution in frontline  communities that are already burdened by asthma, heat, and high energy  bills. We cannot slam the brakes on progress just for fossil fuel  profits.\n\nA vote on this next…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690527/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…the ranking member, Mr. Cuellar of  Texas, worked together to produce a serious and responsible bill.\n\nH.R. 7147 is focused on outcomes, not partisan rhetoric. It equips  frontline personnel, strengthens enforcement, and provides the  certainty DHS needs to carry out its mission effectively.\n\nI thank our Members and staff for their work, and I urge…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699354/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…funding its first psychedelic- assisted therapy study in over 60 years. That was a critical milestone,  but research alone is not enough.\n\nWithout a plan to turn findings into frontline care, we risk failing  the very people this research is meant to help: our veterans.\n\nWe know the stakes. Too many servicemembers come home bearing  invisible wounds. While…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692940/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…business-as-usual status quo send to  rank-and-file employees?\n\nWhen they hear of senior executives filling each other's pockets with  improper bonuses, what does that tell the frontline VA police officer,  the hospital housekeepers, and the food service staff?\n\nIt tells them that the efforts they bring to the job really don't  matter. It tells them that…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…understand took place. When they had a corporate tax rate  decrease, they have shown me their books, and the areas that they  prioritized were to increase wages for their frontline workers. They  said every single person at the firm got a pay increase. They grew real  wage growth without massive inflation that takes place sometimes under  a reconciliation…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…to some of  the most dangerous, kinetic combat zones, particularly Helmand  Province, fighting alongside UK units at the height of the insurgency.  Danish forces accepted frontline combat roles--some lost their lives as  a result of it--not low-risk symbolic missions.\n\nFor a small democracy, sustaining this level of risk over more than a  decade reflects…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…sharing that enables automated       transfer of relevant environmental review and authorization       data among Federal agencies.\n\n(B) Automated project screening to assist frontline staff       with reviewing project sponsor provided information for       completeness and accuracy and determining if a categorical       exclusion or other general authorization…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "Mr. McCLINTOCK. Madam Speaker, as has been noted, H.R. 183 simply  extends the lifetime national parks pass to the frontline public safety  officers who risk their lives every day to protect our families and  communities. It is the same courtesy we already extend to U.S. military  members and their…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693930/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…Border  Protection work under incredibly stressful conditions to protect our  borders, providing a mechanism to boost their well-being will improve  the mental health of our frontline officers and agents.\n\nThis legislation would enhance CBP's Support Canine Program by  creating a pilot program to adopt dogs from local animal shelters to  serve as therapy…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696972/providing-emotional-assistance-with-relief-and-love-act"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "Mr. McGUIRE. Mr. Speaker, Charlottesville Hyperbarics has become a  frontline in the fight for veterans suffering from the invisible wounds  of war.\n\nThey recently launched the Hyperbaric Wellness Foundation and have  partnered with the HOW Foundation…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700045/hyperbaric-oxygen-therapy-for-veterans"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…simultaneous conflict in  multiple theaters.\n\nIf the administration means what it says about restoring deterrence,  it would recognize how plans to reduce security cooperation with  frontline NATO allies invite more brazen Russian incursions into the  alliance's territory and airspace; it would recognize how China is  watching closely for signs of weakening American…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}]