[{"senator": "Sarah McBride", "party": "Democrat", "sentence": "…the table.\n\nThose grocery bills aren't rising in a vacuum. Across The First  State, shoppers are seeing coffee up 21 percent and beef up 11 percent.  Flour, sugar, and canned fruits are each up more than 30 percent. These  are costs that hit parents, seniors, and working people the hardest.\n\nAt Our Daily Bread, a food bank in Middletown, they are now serving…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697421/delaware-day"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…of  construction workers and roughly 42 percent of our agricultural  workforce.\n\nFarmworkers help feed our Nation and allow grocery stores to stay  stocked with affordable fruits and vegetables. Unfortunately, this  reality is not what my colleagues on the other side of the aisle want  to admit.\n\nOn Monday I offered an amendment to the budget resolution…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688133/republican-budget-betrayal"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…businesses, they own their own homes,  and yet we cannot regularize their status. We support Dreamers.\n\nWe are in support of farmworkers. They have to pick the crops and the  fruits that come to our dinner table, and many of them are staying home  in fear of being deported. Mr. Speaker, you can expect food prices to  go up.\n\nOf course, we are in support…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688134/republican-budget-betrayal"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Unfortunately, the report made no mention of the administration's  drastically insufficient budget request for WIC or the need to fully  fund vouchers issued to participants for fruits and vegetables.\n\nHouse Republicans must do more than pay lip service to the goal of  making healthy food available to children and families. They must fund  WIC at the Senate's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…nutritious food. The United Way of New York City  is anchoring one produce prescription project, Connect2Food, that  provides hungry people with $80 per month to purchase fresh fruits and  vegetables.\n\nThis innovative work is teaching us that increased investments make  it a little bit easier for families in need to make healthier choices,  while also supporting…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689401/end-hunger-now-with-innovative-ways-to-feed-hungry-people"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…healthy foods.\n\nThis is me being a little critical of people saying they are MAHA-- Make America Healthy Again--and then immediately cutting kids' access  to fresh, healthy fruits and vegetables.\n\nI love this doctor. It is almost like you are doubling down on the  injury to our children. We are cheapening highly processed and sugar- filled, nutritionally…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…it is likely that a court will turn these  grants back on.\n\nBut it is also such bad policy. It is cruel and inhumane, but it is  also illogical. We literally are seeing the fruits of the labor of  these groups, and not just in saving a life or two. You are talking  about a 30- and 40-percent reduction in violence in these cities. And  what will happen…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…to mankind the magnanimous and too novel example of a  people always guided by an exalted justice and benevolence. Who can  doubt that in the course of time and things the fruits of such a plan  would richly repay any temporary advantages which might be lost by a  steady adherence to it? Can it be, that Providence has not connected  the permanent felicity…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…``Brace for higher prices on berries,  bell peppers, and . . . beer. Target CEO Brian Cornell told CNBC . . .  that tariffs on Mexico may force the company to raise prices on fruits  and vegetables.''\n\nThe Wall Street Journal said all of these things, Mr. Speaker. I  couldn't have said it better myself.", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688624/tariffs-whack-trump-voters"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…wealth last week, the President adjusted some tariffs, but nothing he  did is reshoring American reinvestment here in our country. Our Nation  imports three-quarters of our fruits and vegetables. We need  agricultural reinvestment here in the good old USA.\n\nNAFTA caused the cataclysmic outsourcing of U.S. manufacturing in  autos and trucks. The President…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689822/tariffs-are-taxes"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…that  end, this bill provides many welcome investments.\n\nIt fully funds SNAP and WIC, replenishes the SNAP and WIC contingency  funds, and fully funds cash value vouchers for fruits and vegetables  for women and children.\n\nIt also helps rural America by providing $1 billion in single family  direct home loans, $120 million over the House level, and funding…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696744/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…Speaker, I rise today with immense sorrow along with  Missouri's 5th Congressional District, to commemorate the life and  legacy of a great Kansas Citian, Ms. Alice Kitchen. The fruits of  Alice's advocacy for women, children, and marginalized communities will  live on for generations to come. Alice was a force to be reckoned with,  stopping at nothing to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698825/recognizing-the-life-and-memory-of-alice-kitchen"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…blindingly obvious were going  to be costing more because we do not produce any of those goods here in  this country.\n\nIncluded in his order are coffee, tea, fruit juices, tropical fruits,  spices, bananas, oranges, and tomatoes. Obviously, if you talk to  anybody who has been in a grocery store lately, the prices for all of  those products have gone up by large…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696749/congress-must-take-action-on-tariffs"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…decade and now serving as the vice director of the Magdala Center,  Father Kelly's work in the Holy Land has impacted people from all walks  of life from all over the globe. The fruits of his labor will  undoubtedly have a lasting impact for generations to come.\n\nAs we honor him on the House floor today, we also pray that many more  people will encounter…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697127/welcoming-reverend-eamon-kelly"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…President promised, in the  campaign and recently in an address to all of us here in Congress, to  make America affordable again; to deal with the high prices of  groceries, of fruits and vegetables, of housing, of housing supplies,  of energy--to deal with high prices. Millions of Americans who voted  for President Trump said they did so out of frustration…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689488/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…to mankind the magnanimous and too novel example  of a people always guided by an exalted justice and benevolence. Who  can doubt that in the course of time and things the fruits of such a  plan would richly repay any temporary advantages which might be lost by  a steady adherence to it? Can it be, that Providence has not connected  the permanent felicity…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700269/president-washingtons-farewell-address"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…agriculture.  He knows about the water issues in California.\n\nThis is an issue that is important to our whole country. It is not  just important to California because most of the fruits, nuts, and  vegetables grown in this country are in the Central Valley of  California. Without water, you can't grow any of them.\n\nIf we are taking water away from the Central…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690599/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…their hatred of Donald Trump dripping from every word, I  fear that discussion  must await calmer times, cooler heads, and wiser voices.\n\nIn the meantime, let us rejoice in the fruits of this action. They  include the removal of the worst despot in the Western Hemisphere; the  revival of the Monroe Doctrine; the ejection of malignant powers  insinuating…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698660/lessons-from-caracas"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…diet-related chronic condition and is food-insecure or refers       such a veteran to receive a benefit, including a voucher or       debit card, for the purchase of fruits and vegetables to       improve a diet-related chronic condition.''.                                  ______\n\nBy Mr. DURBIN (for himself and Ms. Murkowski):\n\nS. 3707. A bill…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699386/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Bob's talents and craft as a  Master Gardener are enjoyed by students and appreciated by staff.  Affectionately called Gardener Bob, he brings the art of growing one's  own fruits and vegetables to the Cypress Elementary Cubs. As part of  the school's 4th Grade Science Lessons, students learn the farm-to- table concept by preparing the soil, planting…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691924/recognizing-robert-obrien"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…facing time constraints,  frozen food offers an affordable, easy way to enjoy balanced meals.  Nearly every American household relies on frozen foods, whether it is  vegetables, fruits, breakfast items, or even complete meals.\n\nThis March, let's take a moment to recognize the hard work of our  Nation's frozen food producers and the critical role that frozen…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689069/frozen-food"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…from our garden. That was it. Fresh vegetables, and we had, I think,  four or five different fruit trees: a pear tree, a peach tree, several  others. So we would have fresh fruits as well. And then for dinner--we  called it supper--beef was the main dish always, but still with more  fresh fruits, maybe some potatoes, some new potatoes. And, yes, we put…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}]