[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…American electric  car manufacturers--these will make the modern commute, the future of  family vacation, all that, more expensive as we become all that more  reliant on fossil fuels to go anywhere.\n\nIt will also hurt the future earnings of our apprentices, our  tradespeople, our engineers by killing in the cradle a sector of the  American economy to the…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…profession entirely or bring their talents to other countries.\n\nAs we fight to protect healthcare for millions of Americans, let us  also not forget to fight for research that fuels that care. We cannot  stand for this assault on medical research funding. We need to continue  to work on a bipartisan basis to make sure that funding does continue.\n\nIt is…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698206/nih-funding"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…not just in electric vehicles and  batteries, but on all fronts. We should be investing in new forms of  transportation, more in biofuels, and more in sustainable aviation  fuels. We cannot retreat from the future of energy and transportation,  and certainly not from our history of leading the world at the  forefront of new technologies.\n\nI would like…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…to make everything more expensive, even the energy we buy.\n\nThe inconvenient truth that Republicans don't want to acknowledge is  that clean energy can compete with fossil fuels. They don't like that.  They are trying to put their thumb on the scale, and that is where this  week's bills come into play.\n\nThe first bill we are discussing right now, H.R.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…have difficulty re-entering  and continuing school, face increased restriction on freedom of  movement, disruptions to family life, behavior and mental health  issues, and it fuels resentment and hatred.\n\nAnd third, Israeli settlers routinely and increasingly engage in  provocations, threats, and violence--sometime deadly violence--against  Palestinians…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697313/palestine"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…abandons that tradition in favor of a narrow  transactional approach. Notably, the word ``corruption'' is absent from  the entire strategy. It is well known that global corruption fuels  instability, weakens governments, and its absence is extremely  dangerous and allows bad actors to flourish.\n\nThe national security strategy abandons our allies, our principles,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697955/national-insecurity-strategy"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…gasoline, but guess what. They  walked away from it again.\n\nInstead, and I can tell you this for the farmers I represent, half  their income comes from raising grains that go into fuels. Without that  market, they wouldn't exist.\n\nThis is serious business for agricultural America, and instead,  Speaker Johnson has set up another delay, a council set to report…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…billion in tax breaks.\n\nHe penalized their competition. The renewable energy that is cheaper  and cleaner? He put up all kinds of obstacles to favor dirty, more  expensive fossil fuels. He green-lighted LNG terminals. He blocked new  solar and wind. He took the United States out of the Paris climate  accords. That is the example of how this money corrupts.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…skyrocketing demand, including from data  centers, families in New Jersey saw a 20 percent spike in electricity  bills this summer.\n\nFurther, Republicans claim that we need more fossil fuels to compete  with China. If that is their concern, why advance a bill that makes it  easier for China to purchase even more of our domestic energy? Why are  we driving up our…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697095/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Research       shows that the likelihood of a future arrest jumps from 24       percent after one day in jail to 45 percent after three days,       proof that unnecessary detention fuels instability and       recidivism. When someone cannot afford bail, they can sit in       jail for days, months, or even years without a conviction.       That is not justice--it…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…utility corridors. However,  the dead vegetation cannot be removed from Federal land without a  timber sale. This has created unnecessary red tape and led to the  buildup of dry fuels around utility lines.\n\nWe cannot continue with the status quo. Inaction can be deadly. I  know because we have seen it. The 2017 Thomas fire, which created the  conditions…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691069/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…strip states of their ability to enforce their own  clean water laws concerning natural gas pipelines.\n\nH.R. 3628 would force states to show arbitrary preference for fossil  fuels over clean, cheap energy.\n\nH.R. 3638 would require the Department of Energy (DOE) to issue a  supply chain report, asking DOE to do more with less after Elon Musk  and DOGE…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698075/opposition-to-permitting-bills"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…represent. Seven of the eight counties I represent in  northwest Ohio are predominantly rural and home to hardworking farmers  who produce the nutritious food that feeds and fuels our Nation. They  deserve our unwavering support because what America makes and grows  makes and grows America.\n\nYet their work has never been harder. Over the past year, they…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699499/a-plea-for-small-family-owned-farms"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…the  entire grid across the country. It is not a given that additional  dispatchable resources aid reliability themselves. You have to rely on  a mix of generation, different fuels, and wires to make sure everyone  can get the power they need all the time.\n\nWhen you put your finger on the scale of a certain power source and  then put barriers to others,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695752/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…On the supply side, well, Trump is cutting off our cheapest and  quickest-to-deploy sources of energy that can meet this demand. Trump's  sham energy emergency pushes fossil fuels as the solution, but those  fossil fuels are polluting, they are pricey, and they are getting  pushed abroad to the highest bidder as exports. These fossil fuel  exports actually…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696132/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…percent of Americans every day heat their homes, their water,  or their food with natural gas. Natural gas is responsible for over 40  percent of the electricity generation and fuels more than half of our  industrial sector's process heat.\n\nWhile the natural gas tax fails to recognize this reality, let's look  at what is  true. Fracking and shale gas have…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688160/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…today. You can see for yourself  how shortsighted policies can drive up electricity costs from one State  to the next. When Democratic States sidelined reliable, conventional  fuels and mandated rushed transition to renewables, consumers paid  more.\n\nI don't know about New York or California, but Ohio cannot afford  rolling blackouts, price spikes, or…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698277/reliable-power-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…legislation is essential to ensuring that the U.S. can reliably  produce enough refined products domestically. The Energy Information  Administration projects global demand for liquid fuels to increase by  about 20 million barrels per day by 2050. Alarmingly, over the last  several years, North America has lost an estimated 1 million barrels of  fuel per day due…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697029/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…seen professors silenced,  student groups threatened, and our intellectual property stolen.\n\nAt the same time, these institutions, many of which proudly divest  from fossil fuels and boycott Israel, are more than willing to accept  foreign funding from adversaries who seek to undermine our Nation.\n\nThe DETERRENT Act is our line in the sand. It demands…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689036/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…pipeline is a good example.\n\nMr. Speaker, it is our refineries, the men and women who run them,  and the communities built around those businesses that turn our  resources into fuels and products that power everyday life.\n\nThe REFINER Act takes on a question that Washington has ignored for  far too long: Are we doing enough to protect and expand America's…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697030/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…in buildings. Whether it be a home, factory, or school, they  need to be zero-sum. Either buy credits somewhere or come out with a  zero-sum model, but you can't use fossil fuels, in particular natural  gas, in this case.\n\nI think these bills correct that problem. These bills help in a small  way with the economy. It is amazing to me the things that…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700197/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Unfortunately, decisions made by the last administration favoring  intermittent, unreliable sources, often at the expense of on-demand,  dispatchable resources like fossil fuels, have made the grid operators'  jobs nearly impossible.\n\nWe know that baseload and dispatchable power resources provide the  essential reliability services necessary to maintain…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695753/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…water bill does, and ways that  we can burn that coal and our natural gas even cleaner than we are  doing today, even though we produce electricity cleaner with our fossil  fuels than any other country in the world.\n\nGuess what we can do, Mr. Speaker. If we can continue to move forward  and build new plants and show how this new technology can be used,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…company in my district that employs 20 people, but they  are having a massive impact on the changing space world. They developed  a satellite that will experiment with cryogenic fuels in orbit, a key  technology for orbit refueling. This innovation will pave the way for  long-distance space travel, making missions to Mars and beyond more  viable and more…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…militias or nations to descend into  chaos, opening up an opportunity for adversaries to step in and coerce  a country for natural resources or military capabilities.\n\nHunger fuels desperation, and desperation fuels unrest. In the Sahel  region of Africa, violent extremism is on the rise. Terrorist groups  exploit food insecurity to win recruits and enforce…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691403/motion-to-discharge-s-res-195"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…to what  my colleague from New Jersey just said about this bill, much of which  is just simply not true.\n\nEnergy is the foundation of everything we do. It powers our homes,  fuels our farms, and drives our economy. If we want to stay a global  leader, we must build the pipelines and power lines that move energy  from where it is produced to where it…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695691/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Improved quality, durability, engineering       performance, and resilience.\n\n``(C) Improved efficiency of resource consumption and       material demand.\n\n``(2) Alternative fuels.--The term `alternative fuels'       means any solid, liquid, or gaseous materials, or a       combination thereof, used to replace or supplement any       portion of fuels…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…to consider no coal leasing and limited coal       leasing alternatives and to disclose the public health       impacts, both climate and non-climate, of burning fossil       fuels from the planning area.\n\nOn November 20, 2024, in response to the court's order, BLM       issued the Buffalo RMPA, which is the subject of this       decision. The Buffalo…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695880/government-accountability-office-opinion-letter"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Solenis LLC.\n\nKirscher Transport; General Equipment & Supplies Inc; JBW       Consulting Engineers; PX4 Software; Gerdau Amersiteel US Inc;       QT Environmental; Wolverine Fuels; Alaska Miners Association;       Furin & Shea Welding & Fabricating, Inc.; Universal Polymer       And Rubber; TJR Technical Services, Inc.; Beaver Bay, Inc.;       AMIGOS;…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…Caucus for leading  the charge to strengthen rural America's future.\n\nAs a fourth-generation North Dakotan, I have seen how the hard work  of our energy and agriculture producers fuels our economy, strengthens  our communities, and secures our very way of life.\n\nThat is why on Monday, I introduced a resolution to overturn the  Biden administration's reinstatement…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689195/work-highlights-of-western-caucus"}]