[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…and I  speak with students, parents, and educators in Congress and at home in  Oregon, and I can't count the number of times where parents have said  to me: Please, please fully fund IDEA.\n\nAccording to the Department of Education, Secretary McMahon is now  exploring additional partnerships to move the administration of special  education programs under…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698934/protecting-education-for-children-with-disabilities"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…leaders,  I urge all of my colleagues on both sides of the aisle to support the  bipartisan Arts Education for All bill. For those keeping track, it is  H.R. 2485, and to fully fund the Every Student Succeeds Act, especially  title I and title IV-A.\n\nThis is so students do better in school and become creative, critical  thinkers. It is so our economy…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695492/national-arts-in-education-week-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…critical treatment.\n\nThese are life-or-death issues for the patients, and yet       this funding now is threatened, yet this research now is       threatened. Please continue to fully fund the congressionally       directed medical program.\n\nI am going to read a few more and then pause, just in case my  colleague wants to ask a question.\n\nBut this is Kerry…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…participants and working to improve them.\n\nUnfortunately, the report made no mention of the administration's  drastically insufficient budget request for WIC or the need to fully  fund vouchers issued to participants for fruits and vegetables.\n\nHouse Republicans must do more than pay lip service to the goal of  making healthy food available to children…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…toxic waste in hotspots, and to protect our fresh  drinking water. It is complex with lots of industry, lots of  agriculture, lots of people, and lots of freshwater.\n\nWe must fully fund the GLRI. Every dollar brings back four to our  economy, and that just makes common sense.\n\nLet me be clear to this new administration: Keep your hands off our  lakes. We…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690375/great-lakes-tariffs-and-trade"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…budget cuts. These are broken promises to children with  disabilities. We cannot build a stronger nation by cutting off critical  support for those who need it most. We must fully fund and support the  essential mission and fulfill the commitment of the Individuals with  Disabilities Education Act.\n\nMrs. HAYES.  Tlaib), who is a champion for children.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…deserve our Nation's  support.\n\nAs we look ahead to the next 50 years of the IDEA, our moral  obligation to students with disabilities must not waver. We must,  finally, fully fund the IDEA. We must forcefully reject the Trump  administration's continued attacks on public education. Ultimately, we  must make sure that every child in America--no matter…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697522/50th-anniversary-of-individuals-with-disabilities-education-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…important that is. I tell you: Over my years and decades  as an education advocate, I have never had anyone say to me: We need  less money for IDEA.\n\nIt is always: Please fully fund IDEA.\n\nPeople know that public education is an investment. They know that  our students are our future. Yet we are seeing a Congress here where  our colleagues, Representative…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698126/dismantling-the-department-of-education"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…good.\n\nWhat are Republicans doing the first week back? Are they doing  something to lower food costs as Trump's tariffs drive prices up? No.\n\nAre they doing something to fully fund the government before it shuts  down in less than a month? No.\n\nAre they doing something to help with skyrocketing healthcare prices  or reversing their devastating cuts…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…can, all I see  is the bipartisan support for a war machine budget that can't pass an  audit?\n\nI want people to look at this and pay attention because they will  never, ever fully fund Medicaid, universal school meals for every  hungry child, or guarantee healthcare as a human right in our country.  I think maybe it is because many of my colleagues in this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695276/taxing-excessive-ceo-pay"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…students. I have been an education advocate for  decades, and no one has ever said we need less money to meet the needs  of students with disabilities. It is always a plea to fully fund IDEA.\n\nAnother mom told me that her kids attend a title I school and get  enough to eat because of school breakfast and lunch programs. It is a  fact that high-poverty schools,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689037/majority-of-americans-support-department-of-education"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…remainder and/or unallocated       Section 32 funds for general contingency purposes.\n\n13. While Section 32 funds are essential to Child Nutrition       Programs, they do not fully fund Child Nutrition Programs.       Rather, Congress must fund the remainder through annual       appropriations.\n\n14. As an example of the dual funding streams for Child…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…not do business with anyone who defrauded the government.\n\nMr. Speaker, the single most important action that Congress can take  to recover fraudulent pandemic funds is to fully fund the inspector  general and give the office the resources it needs to go after the bad  actors.\n\nFormer Representative Luetkemeyer and I sponsored two bills, which  became…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687932/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…Mr. Speaker, by concurring in the Senate amendments to H.R. 7148, the  Consolidated Appropriations Act, 2026, we will end the Democrats'  second government shutdown and fully fund the following departments and  agencies for the remainder of fiscal year 2026:\n\nPresident Trump's Department of Defense, President Trump's Department  of Labor, President…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…efficient mobility, and housing  affordability.\n\nWe prioritize aviation safety by allocating over $22 billion for the  Federal Aviation Administration. These dollars will fully fund air  traffic control operations and enable the hiring of 2,500 new  controllers. It will jump-start the modernization of outdated  facilities and equipment, strengthening…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699577/consolidated-appropriations-act-2026"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…provides critical funding support to America's farmers,  ranchers, and rural communities. It ensures both USDA and FDA can  safeguard our Nation's food and drug supply and fully fund nutrition  programs, including SNAP and WIC.\n\nAdditionally, the bill closes the hemp loophole that has resulted in  the spread of unregulated, intoxicating hemp-derived products…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696739/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…yield myself such time that I may consume.\n\nMadam Speaker, the House has done a tremendous job these last few  months as we have finalized true bipartisan, bicameral bills to fully  fund our government in a Member-driven, district-focused way.\n\nSix of those bills have been signed into law by President Trump,  fully funding those departments and agencies…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…me quickly walk through what is in this bill: $453 billion in  total funding, $150 billion in discretionary funding, $300 billion for  mandatory programs, $131 billion to fully fund veterans' medical care,  $2 billion for military family housing, and over $1.2 billion for Guard  and Reserve construction facilities.\n\nThis supports President Trump's initiative…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692937/american-economy-gaining-momentum"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…thank the  full committee chair, Mr. Cole, my colleague from Oklahoma, for his  leadership in helping to return us to regular order and producing a  series of bills that will fully fund the government by the January 30  deadline.\n\nI also thank my colleague from Connecticut, the ranking member, Rosa  DeLauro, who was part of this combination. We have seen…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699349/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…State Department under  the direction of Secretary Rubio.\n\nThe bottom line, sir, is if it is not having to do with our national  security interests, we are not funding it. We fully fund CFIUS to stop  foreign threats from buying up America, keep longstanding pro-life  protections in place, and deliver a bill with no poison pills. This  package keeps spending…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699059/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…hope that will mean that we will immediately reopen government as  soon as the House acts and the President signs it into law.\n\nI am also very pleased that we were able to fully fund three  appropriations bills that passed with overwhelming bipartisan support  on August 1.\n\nI thank my colleagues. I know of no other requests for time.\n\nI yield back the…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696664/continuing-appropriations-and-extensions-act-2026"}]