[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…about an hour ago, in one of the conversations, that we  could do so much more and we should try to be partnering with our  Republican colleagues to provide that essential function of oversight.  That is one of the checks and balances, and we should be deeply engaged  in making it as effective as possible because here is quite a list of  the things going…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…working.  That is in spite of the fact that the number of nondisabled adults on  Medicaid who don't work is very low--about 8 percent.\n\nHow do these work requirements actually function? Well, in Arkansas,  which is one of the two States that tried this and then pulled it back  because it was a failure, the reporting portal was only open during the  day and…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…winner, Augustus Rezba-Patel.\n\nWomen are 17 percent of active-duty U.S. military members       today. They serve in combat and leadership roles and are       vital to the function of the U.S. military. But it wasn't       always this way. When Charity Adams-Early joined the military       in 1942, women were restricted to certain occupations and…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688375/recognizing-virginias-fourth-district-black-history-month-essay-contest-1st-place-middle-school-winner-augustus-rezba-patel"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…months  now, and that cripples national security. That is a national security  risk. No new programs are possible, and procurement is excessively  expensive because it cannot function over multiple years without  effective system-wide modernization. Any military leader will say that  the worst thing going for it right now, at a time when it has to adjust…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699571/consolidated-appropriations-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…functions to a new       Administration for a Healthy America (AHA). If this becomes       reality, there will no longer be a federal agency whose       specific purpose, function, and expertise is to address       mental health and substance use disorders. Given the current       opioid public health emergency, and our nation's ongoing       mental…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…that serve young adults and adults, as well.\n\nIt will eliminate funding to the Denver Health and Hospital Authority  for infrastructure to allow the hospital to continue to function as a  medical safety net for the Denver community.\n\nIt will eliminate funding to Temple University Hospital in  Philadelphia to purchase modern, diagnostic X-ray technology…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699285/amendment-no-1-offered-by-mr-massie"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Fiduciary Service.\n\nThe VA made this move with the idea that it would increase emphasis  on the office and oversight of OSA as VBA has more capacity to properly  oversee the function.\n\nHowever, the survivors' community has been critical of this move,  characterizing it as a downgrade of the function and a diminishing of  the importance of survivors in…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689686/prioritizing-veterans-survivors-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Without Medicaid, he wouldn't be able to afford  his seizure medications, which means he would have seizures every week  like he did before. This would leave him unable to function or work.  Before he had Medicaid, he would have a seizure. It would take him days  to recover. His health is inconsistent, which makes it hard for him to  hold down a job.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 225, the HUD Transparency Act  of 2025, sponsored by Representative De La Cruz.\n\nOversight is a core function of the Financial Services Committee.  Inspectors general also play a critical role in providing transparency  about the functions of government, as well as holding government…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697210/hud-transparency-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Womack,  Scott Peters and Zachary Nunn. Our bill will create a National  Commission on Fiscal Responsibility and Reform, similar to other such  commissions past, to serve this function.\n\nThe commission would consist of eighteen members split between  Democrats and Republicans, and would be charged with proposing  recommendations designed to achieve a balanced…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689288/introduction-of-the-sustainable-budget-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…degrees? Which, by the way, is very much what we are headed for  right now. What happens at 3 degrees? Here is what he says:\n\n[T]he financial sector as we know it ceases to function.       And with it, capitalism as we know it ceases to be viable.\n\nSame scenario: climate risk, insurance collapse, mortgage failure,  property values crash.\n\nThe Mortgage…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…their company.\n\nThis is the entire government, but that is not what is happening  here. They are firing people across the board, without regard to merit,  without regard for function. They are firing some of the newest  employees who are eager and excited to have their jobs. They are firing  some people who are simply up for promotion which puts them in…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…Medicaid.\n\nConner's medicines, the medicines that have kept him alive, cost  thousands of dollars a month. A middle-class family can't pay that.  Medicaid does.\n\nHis lung function is compromised, so he needs a $12,000 machine to  breathe. He needs help in school. He wants to go to college, but he  needs a little help because he is severely handicapped…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689793/defending-medicaid-for-families-like-the-currans"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…our  elections. It will fundamentally reform the FEC, so our Federal  campaign finance laws no longer go unenforced.\n\nIndeed, at present, the FEC has no quorum and cannot function in a  law enforcement capacity at all. House Democrats will put a cop back on  the beat.\n\nVitally, House Democrats will move to ratify a constitutional  amendment to overturn…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699248/citizens-united-16th-anniversary"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…cells--in one or  more organs of the body. When the immune system goes into overdrive and  too many of these clumps form, they can interfere with an organ's  structure and function. When left unchecked, chronic inflammation can  lead to fibrosis, which is the permanent scarring of organ tissue. This  disorder affects the lungs in approximately 90 percent…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689983/recognizing-the-month-of-april-as-sarcoidosis-awareness-month"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…even pieces from the 9/11 Towers. It stands as a tribute to  volunteerism, which Dick regarded as the backbone of strong  communities. He often said, ``Communities cannot function without the  selfless sacrifices that volunteers contribute. We've got to encourage  more volunteers.''\n\nDick also served his community as an elected member of the Lancaster…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690585/recognizing-the-life-of-service-of-dick-young"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…I hold our Parliamentarians in very  high regard. They perform and she performs a vital role in this  institution, and her wise counsel is critical to making this Senate  function.\n\nI want to make two things crystal clear: The procedural action we  have taken today is not about the filibuster and not about the  Parliamentarian. Instead, the procedural…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…best beach towns in the South.\n\nJekyll Island was ranked as the fifth best beach town in the South,  celebrated for its beauty, pristine wilderness, otherworldly nature,  and function as a refuge for local wildlife.\n\nTybee Island was ranked fourth on the list, being praised as a little  island packing a big punch. Tybee contains over three miles of beaches,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689617/commending-jekyll-island-club-resort-and-sea-island"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…consider the  extraordinary stakes.\n\nWe have the opportunity in this Congress to remove deep  vulnerabilities in our elections and to restore America's trust in this  core function of our Republic. I can think of few things more important  than that, and for that reason, I implore my colleagues on both sides  of the aisle to join me in supporting the…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…revenue, from  Agencies that provide critical resources to our farmers to law  enforcement, military, and our veterans, just to name a few.\n\nWe need the appropriations process to function. Congress needs to do  its job and fund the government. And I, for  one, do not intend to be an obstacle. So in order to move the package  forward, I allowed my language to…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694557/9999"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…election.\n\nSo the bottom line here is--the theory that some of my colleagues are  hanging their hats on is that this is legitimate because it is actually  a law enforcement function. I respect what you are saying, but I don't  agree. This is clearly beyond issuing a warrant. This is clearly beyond  using law enforcement power. The game plan is not only…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…delivering quality care  to their patients and clients in Blairsville and Union County, Georgia.\n\nMr. Barth has provided extensive care for disorders that affect  speech, function, movement, and swallowing. His specialization lies in  restoring mobility in patients, reducing pain, rehabilitating injuries,  and increasing movement and overall health.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699261/recognizing-wayne-barth"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…land. She refused. I said she needed to  do her job. She went to jail for 5 days, and she should have because  you can't let your personal opinion take over your government function.  You can't just obey the laws you like.\n\nIt is the same thing here--and every liberal clapped when I did that.  It is the same thing here. If you have got a Governor or a…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…stood up  and objected to the President's open-border policies or his runaway  inflation policies. The State of the Union could not be delivered. The  institution could not function.\n\nWhat is even more remarkable, though, than the conduct of this 1  Member is the fact that all but 10 of his colleagues on their side of  the aisle chose not to censure this…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…supports child  development and academic success.\n\nMilk provides 13 essential nutrients, including calcium, vitamin D,  and potassium. These nutrients support bone health, immune function,  and long-term well-being. However, today nearly three in four school- age children are not getting their recommended daily intake of dairy.\n\nSince whole milk was removed…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692463/national-dairy-month"}, {"senator": "James Risch", "party": "Republican", "sentence": "…the jurisdiction of the committee.''\n\n(c) ``Advice and Consent'' Clauses.--The committee has a       special responsibility to assist the Senate in its       constitutional function of providing ``advice and consent''       to all treaties entered into by the United States and all       nominations to the principal executive branch positions in…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…duplicative,  whether they might be contradictory, and whether maybe they go too far  or not far enough.\n\nWe feel like the people's House, for sure--Congress in its Article I  function--ought to know how many crimes there are and what penalties  are associated with those crimes so that the American people can know  this.\n\nMr. ROY. Mr. Speaker, I thank the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697203/count-the-crimes-to-cut-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…technology.\n\n(6) Tokenization.--The term ``tokenization'' means the       process of creating a token.       SEC. 3. DEPARTMENT OF COMMERCE LEADERSHIP ON BLOCKCHAIN.\n\n(a) Function of Secretary.--The Secretary shall serve as a       principal advisor to the President for policy pertaining to       the deployment, use, application, and competitiveness…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692733/deploying-american-blockchains-act-of-2025"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…Autism spectrum disorder (ASD) is a developmental disability that  generally appears before the age of 3, impacting social interaction,  communication skills, and cognitive function. Today, 1 in 36 children  in the United States are diagnosed with autism, and approximately 5.4  million Americans are living with autism spectrum disorder.\n\nAutism prevalence…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689495/recognizing-april-as-national-autism-awareness-month"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…enrichment,  and reading.\n\nIt has often been stated that libraries aren't about the books but  about the people. Nowhere is that perspective more clearly evident, in  form and function, than in the Williamsburg Public Library.\n\nOn behalf of everyone in Pennsylvania's 13th Congressional District,  I congratulate the residents of the borough of Williamsburg…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695425/president-trumps-peace-through-strength-agenda"}]