[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "It is always a plea to fully fund IDEA.", "title": "Majority of Americans Support Department of Education", "date": "2025-03-25"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "The internet can be a tremendous educational resource, opening new  doors for curious students, and digital literacy skills are fundamental  to succeeding in this digital economy, but that economy also creates a  new system of haves and have-nots.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Federal Communications Commission Relating to ``Addressing the Homework Gap Through the E-Rate Program''", "date": "2025-05-06"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "Republicans  are stealing from the American people to fund these tax cuts.", "title": "Millionaires' Tax Breaks in Big, Ugly Bill", "date": null}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "We are  here because my Republican colleagues think our national budget is too  tight to ensure that our seniors and families can afford healthcare,  but it is flush enough with enough cash to fund escapades in Venezuela  and billions of new spending on ICE and giving billionaires permanent  tax cuts.", "title": "Protecting Healthcare for Millions of Americans", "date": "2026-01-08"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "4 to the Committee on       Appropriations of the Senate with instructions to report the       same back to the Senate in 3 days, not counting any day on       which the Senate is not in session, with changes that--\n\n(1) are within the jurisdiction of such committee; and\n\n(2) would strike any rescission of funding that supports       public broadcasting in Massachusetts.", "title": "H.R. 4", "date": "2025-07-16"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "Democrats stand ready to work collaboratively with our Republican  colleagues to fund the government in a bipartisan spirit.", "title": "Healthcare Subsidies and Rescissions", "date": null}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "1582) and the CLARITY Act (HR 3633) pose       risks to both retirement funds and to the overall financial       stability of the U.S.", "title": "Guiding and Establishing National Innovation for U.S. Stablecoins Act", "date": "2025-07-17"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "Because of our rich and diverse  culture of innovation and entrepreneurship, our small companies--across  sectors--have successfully competed for SBIR/STTR funds since the  programs' inception.", "title": "Extension of Sbir and Sttr Authority", "date": null}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Today, a number of our colleagues, including myself, voted against  continuing to fund ICE.", "title": "-9999", "date": "2026-02-12"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "The House  has just passed the Crime Victims Fund Stabilization Act, with strong  bipartisan support.", "title": "Applauding Stabilizing Crime Victims Fund", "date": "2026-01-14"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "Title I of the Elementary  and Secondary Education Act: money in low-income areas to offset the  effect of funding education with the real estate tax, guaranteeing that  low-income areas will be at a disadvantage, so we put money in Title I.", "title": "Education is of Great Importance to Congressional Black Caucus, Congress, and Constituents", "date": "2025-04-07"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "Luke  Church Administrative Board, Girls in the Game, Chattahoochee Council  of the Boy Scouts of America, Jordan Vocational High School College and  Career Academy Advisory Board, RiverCenter for the Performing Arts,  Columbus State University Military Affiliated Student Support Fund, the  Rotary Club of Columbus, and the Miracle Riders.", "title": "In Memory of the Honorable Judy Thomas", "date": "2025-05-07"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "We need to  replenish the disaster relief fund and immediately pass Governor  Stein's request for additional Helene recovery funding.", "title": "Recognizing the One-Year Anniversary of Hurricane Helene", "date": null}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "It is to fund a tax cut.", "title": "H. Con. Res. 14", "date": "2025-04-03"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "They championed Proposition 10 for tobacco tax  revenues to fund early childhood development through the  transformational First 5 initiative which has benefited millions of  California children.", "title": "Rob and Michele Reiner Tribute", "date": "2025-12-17"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "I am afraid that  Barack Obama's dream of fundamentally transforming our country would  have been complete.", "title": "President Trump is Getting It Done for the American People", "date": "2025-03-05"}, {"senator": "French Hill", "party": "Republican", "sentence": "Community Development Fund Amendments.", "title": "Housing for the 21st Century Act", "date": "2026-02-09"}, {"senator": "Young Kim", "party": "Republican", "sentence": "It requires the Treasury Department to advocate  for Taiwan to join the International Monetary Fund, or IMF.", "title": "Taiwan Non-Discrimination Act of 2025", "date": "2025-06-23"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "That includes the use of anonymous digital  platforms to launder money, to fund terrorism, and to bypass the very  sanctions this Chamber has helped lead.", "title": "Financial Technology Protection Act of 2025", "date": "2025-07-21"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "One of the key aspects and the things that are  important under title I is making sure that we have underfunded  communities well represented.", "title": "Advancing America First Policies", "date": "2025-03-26"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "Americans pay several  hundred billion dollars in taxes each year to fund the salaries and  benefits of more than 2 million Federal civilian employees.", "title": "Protect America's Workforce Act", "date": "2025-12-11"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "909, the  Crime Victims Fund Stabilization Act.", "title": "Crime Victims Fund Stabilization Act of 2025", "date": "2026-01-12"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "Despite this reality, the consensus among too  many in Washington is that they would rather see President Trump fail  than work together to fund the government responsibly.", "title": "We Are Better Together", "date": null}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Seven years from now, the  Medicare part A trust fund, which is about 38 percent of Medicare  spending--the rest comes out of the general fund and members'  participation, I think is about 15 percent, the fees they pay--but that  38 percent, that trust fund is gone in 7 years, meaning hospitals,  surgery centers will have an 11 percent cut, but I know we are all  going to talk and work on how we are going to revolutionize the cost of  healthcare.", "title": "Dismantling California's Citizens Redistricting Commission", "date": "2025-07-23"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Speaker, what is even more outrageous is that Newsom, after  opposing Prop 36 to make crime illegal again in every way that he can,  is refusing now to properly fund the initiative.", "title": "The California Redistricting War", "date": null}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "In 1988, Stan took a position as the assistant director of the  Economic Development Corporation of Erie County, where he assisted in  the management of three industrial parks, a new incubator facility, and  a revolving loan fund program.", "title": "-9999", "date": "2025-12-01"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "1001) to provide for a memorandum of understanding to  address the impacts of a certain record of decision on the Upper  Colorado River Basin Fund.", "title": "Memorandum of Understanding to Address Potential Impacts of A Certain Record of Decision on the Upper Colorado River Basin Fund", "date": "2025-05-13"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "It  has no website, and it has no programs funded.", "title": "Energy and Water Development and Related Agencies Appropriations Act, 2026", "date": null}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "This bill, which passed with almost unanimous support out of the  Financial Services Committee, seeks to ensure the United States remains  the most entrepreneurial country in the world, where the next great  companies are founded and funded.", "title": "Developing and Empowering Our Aspiring Leaders Act of 2025", "date": "2025-12-01"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "When we borrow money from the Social Security trust fund or  these other things, which all that money has already been borrowed, we  have to pay interest back.", "title": "The Math", "date": "2025-05-06"}]