[{"senator": "Jim Costa", "party": "Democrat", "sentence": "…Congressional District, I am here to share some good news for the  people of not only the Central Valley but across the country. The House  has just passed the Crime Victims Fund Stabilization Act, with strong  bipartisan support.\n\nAs one of the original founders of the bipartisan Congressional  Victims' Rights Caucus, this is good news. I am proud to…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699068/applauding-stabilizing-crime-victims-fund"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…10  of the most egregious abominations in this bill.\n\nOne, the GOP tax scam is a massive giveaway to the wealthiest in our  country. We are talking about investment and hedge fund managers paying  a lower tax rate than regular income earners like schoolteachers or  firefighters. It would cut taxes for the top 5 percent of taxpayers  while reducing critical…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "…its 30-year history, the PDNHF has helped reduce  smoking, promoted diabetes awareness and increased physical activity  and healthy eating, created a medical forgivable loan fund, programing  to support oral health, support for the community through the COVID-19  pandemic, and support in growing El Paso's quality of life assets.\n\nThe community is grateful…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695206/recognizing-the-30th-anniversary-of-the-paso-del-norte-health-foundation"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Jordan Vocational High School College and  Career Academy Advisory Board, RiverCenter for the Performing Arts,  Columbus State University Military Affiliated Student Support Fund, the  Rotary Club of Columbus, and the Miracle Riders.\n\nOn a personal note, I have had the privilege of knowing Judy for many  years. I am incredibly grateful for her support…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690837/in-memory-of-the-honorable-judy-thomas"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…is not in session, with changes that--\n\n(1) are within the jurisdiction of such committee; and\n\n(2) would strike any rescissions to programs within the       Economic Support Fund account that support human rights.\n\n6. A motion to recommit the bill H.R. 4 to the Committee on       Appropriations of the Senate with instructions to report the       same…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693615/hr-4"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…students. I have been an education advocate for  decades, and no one has ever said we need less money to meet the needs  of students with disabilities. It is always a plea to fully fund IDEA.\n\nAnother mom told me that her kids attend a title I school and get  enough to eat because of school breakfast and lunch programs. It is a  fact that high-poverty schools,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689037/majority-of-americans-support-department-of-education"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…unlawful behavior, including drug trade and other illegal       activity.'' Now, he's the self-proclaimed crypto president.\n\nIn May, the Trump family announced an agreement with a fund       backed by Abu Dhabi that ``would be making a $2 billion       business deal using the Trump firm's digital coins,''       according to the New York Times. That deal involved…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…in those so-called hotspots, away  from their homes, because it was the only way they could access their  homework.\n\nNow, to combat that homework gap, Congress established a fund in 2021  for schools and libraries to loan Wi-Fi hotspots to students and  educators. The program was an enormous success, ensuring nearly 18  million students at over 10,000…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690726/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…them into a car.  We must protect sensitive locations, and the racial profiling must end.\n\nToday, a number of our colleagues, including myself, voted against  continuing to fund ICE. Budget shows our values. That extra $75  billion, as I explained, triples the Agency's funding, giving it more  money than the FBI. That was wrong.\n\nThat money could have…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…Colorado, and engaging the broader community are just a few of the ways  Mr. Yeremyan shows up for Coloradans. He also previously served on the  boards of the Lone Tree Arts Center Fund and the U.S. Bank Development  Network, and currently contributes his time and expertise as a board  member of the Coalition Against Global Genocide (COAGG).\n\nI commend Mr.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697495/recognizing-byuzand-yeremyan"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…against workers based on race, color, religion, sex, sexual  orientation, gender identity, or national origin. These actions ensured  that taxpayer dollars were not being used to fund discrimination.\n\nBut despite the President's reckless actions and the acquiescence of  congressional Republicans, we need to assure the public that many are  still fighting…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…require us to put politics aside and focus on the people. We  have 22 days to do it, Mr. Speaker. We have 22 days to decide: Are we  going to come together, find common ground, fund this government in a  way that helps people and puts people over politics, or are we going to  let it all shut down?\n\nI didn't come here to shut down the government. I also…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…holding back critical assistance that was  appropriated last year for our State.\n\nMr. Speaker, Congress also has a critical role to play. We need to  replenish the disaster relief fund and immediately pass Governor  Stein's request for additional Helene recovery funding. We can't  abandon western North Carolina.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695772/recognizing-the-one-year-anniversary-of-hurricane-helene"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Homeland Security  Secretary, and $40 billion to Argentina, the American people are left  with nothing but higher costs.\n\nThis bill also fails to fully cover the Toxic Exposures Fund, which  was created to support veterans exposed to burn pits and Agent Orange.  We made a promise to stand by the men and women who served our country  in uniform. This bill…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…foremost were devoted parents.  They cared deeply about people and they demonstrated that every day in  their community. They championed Proposition 10 for tobacco tax  revenues to fund early childhood development through the  transformational First 5 initiative which has benefited millions of  California children. And they stood up for equality and dignity…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698360/rob-and-michele-reiner-tribute"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…sent cargo pallets of cash on cargo planes to  these bloodthirsty mullahs in hopes of currying their favor and  cooperation. However good the intentions, the result was to help fund  the oppression of the Iranian people and the export of terrorism  throughout the world.\n\nI believe the time has now come to provide the same assistance, not  to the oppressors…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…of my bill, H.R. 910, the  Taiwan Non-Discrimination Act.\n\nThis bill is simple. It requires the Treasury Department to advocate  for Taiwan to join the International Monetary Fund, or IMF.  Unfortunately, China has consistently blocked Taiwan's participation in  international forums, including IMF. China pursues these tactics  because they know that financial…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692794/taiwan-non-discrimination-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…ambitious plan. It is just another example of why we need to end this  project once and for all. There is absolutely no reason that State or  Federal taxpayers should continue to fund a project that is going  absolutely nowhere, especially when our roads are in such bad shape,  among the worst in the entire world.\n\nIt is time to redirect this spending toward…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…to interest payments, the United States is sending a  message of weakness.\n\nYet Congress has reportedly chosen to ignore the deficit, raise the  debt ceiling, and continue to fund foreign wars. Instead of budgeting,  Congress decided to kick the difficult decisions down the  road. Unfortunately, continuing spending at the Biden administration  levels…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…are going to have success here.\n\nMr. Speaker, I think we are going to look back at this point down the  road and say that this was a key part of why we were able to better  fund schools that are in tough communities, to better fund special  education needs, and to make sure that we are still fulfilling all of  the FAFSA and student loan requirements…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…safety of our Nation's aviation system. In a previous Congress, I  introduced the Aviation Funding Stability Act, which allows the FAA to  draw from the Airport and Airway Trust Fund to make certain that  critical operations continue when there is an appropriations lapse. In  March of this year, I reintroduced this bill as we faced this threat of  a shutdown.…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696174/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…to participate in the latest  progressive fad.\n\nUnder the Biden administration, we diverted money away from readiness  and lethality to promote extreme gender ideology and to fund sex  changes in our military.\n\nUnder the Trump administration, we have finally recognized gender  dysphoria for what it is, a mental illness which precludes military  service.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…have a choice.\n\nThis is the Social Security Medicare actuary report, another thing I  know every Member here has actually read. Seven years from now, the  Medicare part A trust fund, which is about 38 percent of Medicare  spending--the rest comes out of the general fund and members'  participation, I think is about 15 percent, the fees they pay--but that…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…get our  spending under control. Despite this reality, the consensus among too  many in Washington is that they would rather see President Trump fail  than work together to fund the government responsibly. It is  frustrating, and rather than coming to the table to work together, they  prefer to grandstand to try to score some political points.\n\nWe are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695600/we-are-better-together"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…jewelry.\n\nMr. Speaker, what is even more outrageous is that Newsom, after  opposing Prop 36 to make crime illegal again in every way that he can,  is refusing now to properly fund the initiative. It needs funding for  various reasons, one of the most important of which is to get help to  people who have drug issues and need treatment.\n\nThat was a big…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…strengthens our democracy and fosters accountability.\n\nThis incredible resource exists thanks to the commitment of  American's cable and satellite providers who voluntarily fund C-SPAN as  a nonprofit service.\n\nLet's be clear. Millions of Americans are being denied access to this  vital coverage because major TV streaming platforms like YouTube TV and…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689056/recognizing-the-46th-anniversary-of-c-span"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…rules and pass the  bill (H.R. 1001) to provide for a memorandum of understanding to  address the impacts of a certain record of decision on the Upper  Colorado River Basin Fund.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 1001\n\nBe it enacted by the Senate and House of Representatives…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691060/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…approach of this process is a  testament to the leadership of my friend and fellow Oklahoman, Chairman\n\nTom Cole.\n\nThis package will strengthen American military superiority and fund  the E-7 Wedgetail program at Tinker Air Force Base. It also ends open- border policies of the Biden era, champions measures to make America  healthier, and allows the Nation…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699306/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…strengthens the ability of capital to  reach more founders and more communities. It achieves this by allowing  larger venture funds to invest directly in smaller, regional funds, a  fund-of-funds investment.\n\nThis mechanism is a game changer, Mr. Speaker. It means more funding  for startups, more opportunities for businesses that might otherwise be  overlooked,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697190/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…borrowing $70,000, $72,000 every second? Do you think you can  keep that going?\n\nRemember, once again, I am going to try to show versions of this. In  7 years, the Medicare trust fund is empty. In 2032, 7 years, halfway  through that year, the Medicare trust fund is empty. In 2033, the first  full year, our best estimate is that there is about $140 billion…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}]