[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…unambiguously instructed of their  responsibilities vis-a-vis Congress.\n\nWe must ensure that the Executive Branch follows the law and ensures  Appropriated and obligated funds are used for their intended purpose.\n\nI urge our colleagues on both sides of the aisle to support this  commonsense legislation.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693088/introduction-of-the-appropriations-compliance-and-training-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…new amendment to  the Department of Homeland Security funding bill that is still being  negotiated and deliberated. It is an amendment to explicitly bar any  Federal funds from being used to deploy Federal law enforcement or  military personnel to polling places or election offices for the  purpose of voter intimidation or election interference.\n\nIt…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…be placed on it.  During negotiations, we proposed such constraints, but our Republican  colleagues refused to include almost all of them.\n\nWe sought to prevent any funds from being used to detain or deport  U.S. citizens, a commonsense measure. They refused to commit to that.\n\nWe proposed prohibiting interior enforcement by non-ICE personnel,  like…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699345/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…world is outraged at the attempt to change the  historically significant name.\n\nThat is why, today, I am proud to introduce the Persian Gulf Act to  prohibit any Federal funds from being used to rename the body of water  and prevent government documents from referring to the Persian Gulf by  anything except that name.\n\nAs Donald Trump acts only for himself,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690994/cleaning-up-government"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…eligibility       requirements, application requirements, calculation and       distribution of funds, and, in some cases, reporting       requirements and limitations on how funds could be used.       Although participation in the programs was voluntary, we       concluded that the actions substantially affected non-agency       parties because they directly…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693338/us-government-accountability-office-legal-opinion"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…as expenses of the mutual funds simply makes it  impossible for mutual funds to invest in BDCs.\n\nThe SEC rule artificially inflates the expense ratios of those mutual  funds that are used to invest in BDCs, and so many of them don't. The  result is misleading. Investors see a fund's expenses as higher than  they actually are simply because the fund decides…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692711/access-to-small-business-investor-capital-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…entities.\n\nCritically, this bill includes new transparency and oversight  requirements to close loopholes that were abused by the Trump  administration and to help ensure these funds are used as Congress  intended.\n\nAll told, these five bills we passed reject President Trump's and  House Republicans' worst ideas to defund programs that Americans  actually count…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…Mr. Speaker, I would like to clarify that this bill actually allows  these funds to be free of any accountability. It actually changes the  way in which these TANF funds are being used.\n\nRight now, there has to be accountability if States use TANF funds  for the crisis pregnancy centers. What this bill does is, by amending  section 404 of the Social…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…use the full force of the United  States Government to make sure these American families  went hungry and fought twice in the Supreme Court to block legally  available funds from being used to help feed them. It further chipped  away at the Consumer Financial Protection Bureau and fired an entire  office dedicated to helping rural and struggling communities,…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…(Program). The  $50 billion Program was established by the One Big Beautiful Bill Act  (H.R. 1). While the Program's title refers to rural health, H.R. 1  permits the Program's funds to be used for health care services,  providers and technology outside rural areas.\n\nSenate Republicans, who created the Program, made only the 50 states  eligible for funding, likely…", "date": "2025-08-19", "source_url": "https://justfacts.votesmart.org/public-statement/1694752/introduction-of-the-equal-treatment-of-the-district-of-columbia-under-the-rural-health-transformation-program-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…of their  citizens, and create more prosperous communities for the long term.\n\nThe United States, as the largest donor to the IDA, helps to direct  where and how these funds are used. My bill would exempt IDA securities  from Securities and Exchange Commission regulations, just as other  World Bank arms have been exempt for decades. This ensures that…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693972/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…ammunition. That lifeline  begins with our Army arsenals.\n\nMy amendment to the Department of Defense Appropriations Act protects  that lifeline by prohibiting any Federal funds from being used to  reduce the workforce at Rock Island Arsenal, Joint Munitions Command,  Army Sustainment Command, or any other active U.S. Army arsenal.\n\nRock Island Arsenal is…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693676/department-of-defense-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Dakota just in the coal industry alone.\n\nThis CRA is also crucial to prevent an estimated loss of $34 million  annually in State revenues from oil and gas production. These funds are  used to finance K-12 public education in the State.\n\nWhat does this mean for children in North Dakota? Failing to pass  this CRA could result in a $441 reduction in the amount…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Bill 1855, which  conveyed funding and property designated for Susquehanna Township,  while he was the President of the Susquehanna Township Board of  Commissioners. Those funds were used to create the Susquehanna Township  parks, an example of how Stan's leadership directly improved Citizens'  quality of life.\n\nIn addition to his public service, Stan was…", "date": "2025-12-05", "source_url": "https://justfacts.votesmart.org/public-statement/1697565/recognizing-mr-stanley-r-lawson-sr"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…allow  storage facilities for aircraft deicing fluids and equipment to be  acquired through the Airport Improvement Program, AIP, funds.\n\nUnder the current structure, AIP funds can be used to acquire  aircraft deicing equipment, and when it comes to the storage facilities  that house that very same equipment, airports are forced to utilize  alternative…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695010/facility-for-runway-operations-and-safe-transportation-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Service.\n\nSince 1908, Federal law has required that 25 percent of the revenue  generated through timber sales in national forests is returned to the  local county. These funds are then used by local governments to provide  critical support services for schools, roads, and other essential  needs.\n\nTimber harvesting in the national forest system reached its…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697653/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…tracking efforts.\n\nIn conclusion, this bill funds critical government agencies and  programs and preserves and protects Congress' responsibility of  overseeing how these funds are being used.\n\nMr. Chair, I urge my colleagues to vote ``yes.''", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699055/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…legislation that would prohibit United States State Department  contracts with companies tied to forced labor in the Xinjiang region of  China.\n\nOur bill would ensure that U.S. funds are not used to finance  projects in partnership with companies or organizations that import  products mined or manufactured in the Xinjiang Uyghur Autonomous Region  of the People's…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690655/no-dollars-to-uyghur-forced-labor-act"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…instance, in Venezuela, if you don't want any American boots on the  ground, I think you could come forward and pass through the  appropriations process a prohibition of funds to be used to have  American ground forces in Venezuela. If you don't like the seizing of  the oil for the mutual benefit of Venezuela and the United States, you  could say that…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 2390) to amend title 46, United States Code, to clarify that port  infrastructure development program funds may be used to replace Chinese  port crane hardware or software, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692200/maritime-supply-chain-security-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…program. Under  Shae's leadership, the booster program has flourished. They have  organized numerous fundraising events and supported multiple school  organizations. These funds have been used to purchase new equipment,  upgrade facilities, and provide scholarships for student-athletes.  Shae's innovative ideas and relentless drive have not only increased…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691987/recognizing-shae-burgess"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…dollars are  wasted every day with little to no government oversight. Congress  cannot continue to let blank checks go out the door without revisiting  the way that these funds are used to help the American people.\n\nThis is why I am proud to support the rescissions package sent to  Congress by President Trump. This package will claw back $9.4 billion…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692496/rescissions-package-is-first-step"}]