[{"senator": "David Schweikert", "party": "Republican", "sentence": "…2033. If  you are watching this and don't plan to be around in 2033, you don't  have to care. The one that we have had almost no discussion about is  that the Medicare trust fund is gone in 2033. That means if it lives  off its income, its tax receipts from the FICA taxes, it is still an 11  percent cut.\n\nThe next time we get someone here saying that we…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…we have to deal with the reality. If the primary driver of debt in  America is demographics, it is functionally Medicare; in a few years,  Social Security, when the trust fund is gone; and interest.\n\nIf you go back 20 years ago, the number of 18-year-olds we had then  compared to the number of 18-year-olds today is almost identical. The  number of our…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…everything out of the general fund, okay, we can do that.\n\nMy estimates come in at about $638 billion in 2033 just to make up  the shortfall of the Social Security trust fund being gone and the  Medicare trust fund being gone. That is, what, 60 percent of today's  defense budget.\n\nWhy is math such an anathema to this place?\n\nLet's walk through a couple…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…less than 6\\1/2\\ to 7 years,  Medicare will go from $1 trillion to $2 trillion. Also, in 7 years,  Medicare is gone.\n\nExcuse me. Let me rephrase that. The Medicare trust fund is gone, and  that will result in around an 11 percent cut, particularly to  hospitals.\n\nIt is demographics. Baby boomers are moving into their peak  utilization years of these…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…duties, we are going to be fine, so,  Schweikert, shut up. We don't have to tell people how much trouble we  are in. Don't go and mention that the Social Security trust fund is  gone in 7 years and that they are taking a 24 percent cut. Don't tell  anyone that the Medicare trust fund is gone in 7 years and that their  hospital is probably going bankrupt.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…between, in 7 years, the $1  trillion we spend this year on Medicare becomes $2 trillion. We double  the spend on Medicare in the next 7 years, and in 7 years, the trust  fund is gone, meaning if you are a hospital or a doctor and part of  your revenues that you receive on Medicare patients is from the  Medicare Part A trust fund, it is gone. It is gone…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…The baby boomers have moved into their retirement  years. We have a societal promise we have to keep. We made a promise,  but once again, in 7 years, the Medicare trust fund is gone. In 7  years, the Social Security trust fund is gone. We are going to lie our  heinies off around here. If we just tax rich people more--and I will  show you the slides.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…allowed in any of  this package.\n\nMr. SCHWEIKERT. Oh, no. Who else has been working for a decade now to  save it?\n\nRemember, in 2033, about halfway through the year, the trust fund is  gone. Is that a Republican or a Democratic problem? I would say it is a  morality problem. We will be doubling senior poverty in America in 8  years.\n\nHow often are we allowed…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…coming in this year, but I have been doing a running  calculation of a higher interest rate.\n\nWe don't get to touch Social Security. Social Security has its own  trust fund, which is gone in 8 years. Then, all of a sudden, we have to  figure out--what is it, the first full year of Social Security trust  fund being empty is $600 billion or $609 billion,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…know we will all be just giddy to actually  read it and see what it says. If we look at last year's, it basically  said: In 2033, so 7 years, 8 years from now, the trust fund is gone. It  is empty. That is because every month Social Security gathers payroll  taxes and there is a shortage, so they take their special T-bills,  because they have loaned…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Medicare  spending--the rest comes out of the general fund and members'  participation, I think is about 15 percent, the fees they pay--but that  38 percent, that trust fund is gone in 7 years, meaning hospitals,  surgery centers will have an 11 percent cut, but I know we are all  going to talk and work on how we are going to revolutionize the cost…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…you are trying not to double senior poverty. That is how  immoral this place is.\n\nRemember, our math from last year is the first full year with the  Social Security trust fund gone. Just the shortfall is over $600  billion. The scale of what we are talking about is brutal.\n\nMr. Speaker, you intend to be here for another decade, so you are  going to…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…willing to have a conversation of how we are  going to save it?\n\nThe first year, my math, actually the Joint Economic economists'  math, the first year--so if the trust fund is gone in 2033, in 2034 it  is over $600 billion just to make up that shortfall. That makes what we  are talking about here in the budget resolution tiny. Those are only  like…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}]