[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…recognize the cartels are a  scourge and they must be confronted aggressively and dismantled  thoroughly.\n\nBut that is not what is happening here. Let me begin with the most  fundamental question: What is the operation actually meant to  accomplish?\n\nThe administration has emphasized fentanyl as the primary  justification for these strikes. Yet their own…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Delgado.\n\nRaised by a single mother who worked in the fields and cleaned  houses, Martha was determined to earn the American Dream. She graduated  with high honors from Godinez Fundamental High School in Santa Ana and  then went on to earn a bachelor's degree in public health from UC  Merced in 2019.\n\nMartha's passion for innovation led her to University Lab…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688313/daca-recipients-need-pathway-to-citizenship"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…properties of nuclei, such as the quark and  gluon structure of protons and neutrons. The research conducted at this  facility has vastly improved our understanding of the fundamental make- up of matter and is actively supporting collaborative research globally  in medium energy physics. Currently, numerous PhD students and  researchers are waiting to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694942/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…housing for all.\n\nOn behalf of Illinois' Third Congressional District, it is my honor  to commend Eric Sirota for his work to ensure safe, just, and  affordable housing as a fundamental human right.\n\nI thank and congratulate Eric.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699030/recognizing-eric-sirota"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…share what is at stake for  students with disabilities as this administration continues its attacks  on the Department of Education.\n\nLast year, one of our Nation's most fundamental laws, the Individuals  with Disabilities Education Act, or IDEA,  reached its 50th anniversary. IDEA opened the doors to opportunities  and protected the rights of millions…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698941/protecting-education-for-children-with-disabilities"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…threatens to cut off and constrict that  world.\n\nThe internet can be a tremendous educational resource, opening new  doors for curious students, and digital literacy skills are fundamental  to succeeding in this digital economy, but that economy also creates a  new system of haves and have-nots. In education, that divide is called  the homework gap. It is…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690726/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…has used trade to prop up Argentina's President before a key  election because that country's President has said nice things about  President Trump, hardly the basis for a fundamental economic decision  affecting the life of every American.\n\nAnd he has used trade to punish the entire country of Brazil for the  prosecution of its former leader, another…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696448/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…Selma  public school system for 36 years where she shaped minds and uplifted  children. As a librarian, she was a strong advocate for reading,  initiating the Reading is Fundamental, RIF, program in 1973, delivering  books to children throughout Alabama, Mississippi, and Tennessee. It is  a program that still serves children in Selma and Dallas County…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695554/american-cancer-society-fly-in"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Reduction Act so that  those who have very sophisticated finances and very powerful advisers  that try to avoid ever paying their taxes don't get away with it,  because it is a fundamental fairness all across America.\n\nOrdinary working people have the money taken out of their paychecks  every week. Just because people have enormous paychecks and fancy  consultants,…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688893/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…anywhere  is a threat to justice everywhere, that when you have a President that  so exceeds his constitutional authority, that he begins to do things to  infringe upon the fundamental rights and securities of other Americans,  it is a threat to all Americans.\n\nThis is why right across the way--I can almost see it looking through  these windows--why the…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692454/alex-padilla"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…firing of the striking air traffic  controllers in 1981.\n\nI am committed to stand shoulder to shoulder with my colleagues to  swiftly reverse this unjust action and defend the fundamental rights of  every worker to bargain for an equitable future.", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689606/protecting-federal-employee-unions"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…international students were being disappeared from American streets  without due process; when American universities were being intimidated  into silence, challenging that fundamental idea of freedom of thought,  freedom of expression; when the law firms that represent clients that  may not be favored are attacked and attacked and attacked? Where were…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…example stands as a rebuke to the cynicism that too often  characterizes our politics. Gabby reminds us that we can disagree and  disagree strongly while still recognizing the fundamental humanity in  one another. We can fight for our principles without demonizing our  opponents.\n\nOn this 15th anniversary, we honor those who we lost by recommitting  ourselves…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698819/fifteenth-anniversary-of-arizona-mass-shooting"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Constitution that  rejects both equality and liberty. He has made it clear that under his  constitutional philosophy, there is no protection for rights that most  Americans take as fundamental, including the rights to reproductive  freedom, marriage equality, and even private consensual relationships.  That is not constitutional interpretation; it is a radical…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696538/government-funding"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…the knowledge to know that their classmates  are not going to be gunned down or that they could go there and be next  on the list? What about that freedom? That seems as fundamental as any  other freedom that is articulated in the Constitution of the United  States, which, after all, guarantees us our rights as citizens in this  Nation, including our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695673/cloture-motion"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…handed it to unelected judges, but Dobbs finally made it  right.\n\nThe Court didn't outlaw abortion, as my friends on the left tried to  claim. What it did was restore the fundamental truth that States and  the citizens who live in them have a right to decide how we protect  life.\n\nIn South Carolina, we have chosen to stand for the unborn, and I  stand…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692891/dobbs-v-jackson-anniversary"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…judges  are asserting this authority by themselves. This is an outrageous abuse  of public trust and judicial power, and it has opened a Pandora's box  that threatens the fundamental constitutional order.\n\nThe Congress is elected to make law, and the President is elected to  enforce it. The judiciary is appointed for the sole purpose of  resolving cases…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689722/no-rogue-rulings-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…York Public Schools acknowledged  receiving large donations from Italy and South Korea. These blatant  attempts to inject foreign ideologies into our schools undermines the  fundamental purpose of American education. It goes without saying that  we should be teaching American values in American schools.\n\nThis is what happens when institutions of learning…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…to  decline.\n\nAt the center of socialism is the mistaken belief that profit is  waste, and if it can be removed from the equation, everything will be  cheaper. That is the fundamental misconception behind Mamdani's  government grocery stores. Yet, profit is not waste. Profit is the  essential ingredient that spurs competition, drives innovation, demands…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697036/government-is-still-the-problem"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…that, as they do the big things for our community,  we should be able to do the small things.\n\nTeaching my boys to say thank you to police officers, the most basic,  simple, fundamental elements of being a dad, in my opinion, shouldn't  be a question of whether you do it. Watching them walk over to a  complete stranger, but they are in uniform, and they…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…provides for one motion to  recommit.\n\nMr. Speaker, I rise in support of this rule and in support of the  underlying legislation. The rule before us once again exposes a  fundamental divide in the House. Republicans are focused on protecting  American lives, American infrastructure, and American national  security. Democrats are focused on protecting…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…fails three ways. They  misled the public by creating a false narrative that whistleblower  disclosures provided to me and Senator Johnson were somehow illegal.\n\nMoreover, a fundamental precept of whistleblowing is the First  Amendment. I thought the New York Times and its left-leaning  compatriots loved the First Amendment.\n\nHere, in this January 18 article,…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…that was enacted in northeast       Minnesota by the Department of the Interior (DOI) in January       of 2023 on more than 225,000 acres of federal lands.\n\nMinerals are fundamental to everything in our modern world,       from wiring in homes, to energy technologies and       infrastructure, medical technologies, transportation, defense       capabilities,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…the gentleman from Michigan (Mr. James), my friend and  colleague. If the United States hasn't learned anything else from the  war in Ukraine, it should be this, this is a fundamental principle: No  nation, let alone America, should be reliant on adversarial nations for  energy and refined materials, critical minerals, rare earth elements  that would…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699994/securing-americas-critical-minerals-supply-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…have vast distances between homes and businesses and in which law  enforcement resources are often spread thin.\n\nThis bill sticks up for those communities and upholds the fundamental  American value of respecting property rights by providing additional  legal requirements that ensure Federal immigration law is properly  enforced.\n\nMr. Speaker, I urge…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689825/safeguarding-property"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…decide: some district judge, or the guy who put his name on the ballot;  some bureaucrat, or the guy who ran for the office and got elected by  we the people?\n\nThat is the fundamental question. Guess what? We just got two  decisions from the United States Supreme Court who seemed to reinforce  that fundamental principle that the guy who runs and heads…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689717/no-rogue-rulings-act-of-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…such as--\n\n(A) basic plasma science and engineering, including       applications in astrophysics, materials science, fusion       science, and accelerator science;\n\n(B) fundamental biological and computational science and       engineering, including computational neuroscience and       neuromorphic computing, including in collaboration with the…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688989/doe-and-nsf-interagency-research-act"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "Mr. LaLOTA. Mr. Speaker, the fundamental question this bill addresses  is: Should a Federal contract intended for women go to men and  fraudsters, or should a Federal contract intended for women-owned small  businesses…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691799/wosb-accountability-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…with over  $50 trillion in debt.\n\nWhat does that mean? It means more interest. It means likely higher  inflation because, at some point, we can't afford this. That is the  fundamental question.\n\nNow, I have a bunch of my colleagues, to the point of the gentleman  from Arizona, running around saying that we can't touch Medicaid. Why  can't we? Medicaid…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "John Rose", "party": "Republican", "sentence": "…time.\n\nMr. Speaker, I rise today in support of H.R. 1919, the Anti-CBDC  Surveillance State Act.\n\nAmong the many rights that we enjoy as Americans, privacy is among  the most fundamental. Establishing a central bank digital currency  would not only usurp consumers' privacy and individual freedoms, but it  would also hinder free market innovation.\n\nDigital…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693729/anti-cbdc-surveillance-state-act"}]