[{"senator": "Brad Sherman", "party": "Democrat", "sentence": "…accounting. Like the most important bills that come to the floor of the  House, it deals with accounting. In this case, it deals with accounting  for the expense ratios of mutual funds.\n\nThis bipartisan bill, H.R. 2225, the Access to Small Business  Investor Capital Act, makes a narrow technical correction of the  Federal securities rules that had a major…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692711/access-to-small-business-investor-capital-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…and Impoundment  Control Act, normally referred to as the Budget Act, the 1974 Act. It  came about because two things were going on: One is that President  Nixon had impounded funds, and the Supreme Court said, no, you can't do  that. That is unconstitutional. You can't steal the power of the purse.  In the Constitution, that power of the purse is given…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…want to cut rather  than leading our government in a way that makes our constituents' lives  better.\n\nWe saw it at the beginning of this year, when the administration  froze funds that Congress passed into law to support local  infrastructure upgrades, cancer research, childcare programs, opioid  addiction centers, and so many more.\n\nJust a few weeks…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…ones that says: If the Pentagon can't pass an audit, then  we shouldn't be able to fund them.\n\nI really believe no money for Pentagon waste. The amendment would  prevent any funds, again, being allocated to this.\n\nMr. Speaker, when you talk about waste and when you talk about fraud,  you look at the Pentagon budget.\n\nHowever, instead, what did we do?…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691614/budget-cuts-will-harm-families"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…including children, seniors, and  people with disabilities in our district.\n\nThese cuts will also impact EMS and ambulance services across our  Nation. This budget will shrink the funds available to these  departments and make it impossible for them to keep operating.\n\nThe impact will also be felt in rural areas where hospitals and  community health centers…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694018/budget-betrayal"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…enhances our  military readiness and the quality of life for servicemembers while  funding the delivery of care and benefits for our Nation's veterans.\n\nMilitary construction funds are included for infrastructure that  supports our servicemembers' quality of life at home and abroad and for  the construction of facilities vital to our national security.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694129/9999"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…their children will  survive beyond the age of 2.\n\nI urge the White House to put the lives of women and children above  politics by allowing these contraceptives, purchased with funds agreed  to by a large majority of congressional Republicans and Democrats, to  be made available to those who need them most. Women and girls in  dozens of the poorest countries…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696465/womens-health"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…Forgiveness to non-profits  that he does not like.\n\nPresident Trump further is targeting higher education institutions as  if they were the enemy, withholding billions in research funds,  removing visas from students and faculty, illegally-halting grants, and  threatening to revoke their nonprofit status simply because their work  does not align with the President's…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690128/alarm-at-the-trump-administrations-dangerous-attack-on-education"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Members of the House of Representatives  joined a group of 42 Senators, including 10 Republican Senators, in  calling on Secretary McMahon and Director Vought to release the funds  by July 15. That date has obviously passed, but we have received no  answers.\n\nAlthough the administration did release the 21st Century Community  Learning Center grants yesterday,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693986/withheld-education-funds"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…follows:\n\n1. Obstruction of justice and abuse of executive powers. Trump denied  due process and defied Federal court orders.\n\n2. Seizing Congress' power of the purse. He froze funds and  dismantled agencies without congressional approval.\n\n3. Abuse of trade powers and international aggression. His reckless  tariffs hurt American families, and he even threatened…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690991/the-truth-still-matters"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…military.\n\nPresident Trump is showing what happens when you let big money buy  politics. In fact, he told Big Oil just last year that if they gave him  $1 billion in campaign funds, he would deliver. Well, promises made,  promised kept, literally invading a foreign country to take their oil.\n\nHere in this Chamber, just a few days ago, it was discovered…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699236/restoring-election-integrity"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…science and technology. Because of our rich and diverse  culture of innovation and entrepreneurship, our small companies--across  sectors--have successfully competed for SBIR/STTR funds since the  programs' inception. In 2022, California companies won a total of $887  million in SBIR/STTR awards. I celebrate the success of California's  small businesses. But…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695449/extension-of-sbir-and-sttr-authority"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…expansive  power over Federal funding, Federal spending away from Russ Vought, and  reclaim it for the Congress. If not, the President and Russ Vought will  be in charge of the funds, and we will have no say.\n\nAt the same time, funding for the Department of Homeland Security  will continue at its current level for 10 days. It is important to note  that…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Development,  USAID, ``corrupt'', ``beyond repair,'' and ``a ball of worms'' that  needs to be eliminated. He claimed that there is a ``gigantic fraud  loophole'' where government funds given to NGOs lack sufficient  oversight.\n\nIn March, Elon Musk called Social Security ``the biggest Ponzi scheme  of all time,'' and policy followed his comments.\n\nThen this…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692137/which-elon-musk-to-believe"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…violence prevention efforts. They have waged a  political war against universities and scientific research, and  illegally froze over $400 billion in congressionally appropriated  funds, including billions of dollars to FEMA, to everyone from local  firefighters to States that have been affected by natural disasters.\n\nThis White House has issued hundreds of…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…order titled: ``Protecting Children From Chemical and  Surgical Mutilation.'' This order defunds the chemical and surgical  mutilation of children and halts the use of Federal funds supporting  gender-affirming medical care for youth under the age of 19.\n\nH.R. 3492 works to codify President Trump's executive order and  amends section 116 of the United…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698346/protect-childrens-innocence-act"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "Mr. MASSIE. Madam Speaker, Congress created the Department of  Justice. Congress funds the Department of Justice. Congress is  responsible for the oversight of the Department of Justice.\n\nWhen will we see justice? I will tell you what I have not seen. I  have…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700177/justice-for-epstein-victims"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…letter to Comptroller General Brown, Acting Comptroller  General of the GAO, requesting this study.\n\nIt says:\n\nOne of Congress' most crucial duties is to steward public       funds by assuring they are spent in accordance with the law       and not siphoned off by criminals. Unfortunately, several       high-profile incidents of fraud in recent years…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…step  forward on this appropriations package if it had included my language  to close the bad-actor loophole, then what does being an advocate  actually mean?\n\nThis package funds a significant portion of the Federal revenue, from  Agencies that provide critical resources to our farmers to law  enforcement, military, and our veterans, just to name a…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694557/9999"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the       Fourth District of Arkansas, expressed support for the Forest       Service proposal. He offered legislation to enact its       recommendations and to appropriate funds for roads and timber       leasing in the disputed areas. He stated that the forest       industry would ``support wilderness,'' but only ``responsible       wilderness.''…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…business concern owned and controlled by       women'' has the meaning given the term in section 8(m) of the       Small Business Act (15 U.S.C. 637(m)).\n\n(e) No Additional Funds Authorized.--No additional funds       are authorized to carry out the requirements of this Act and       the amendments made by this Act.\n\nMr. Speaker, I rise today in support…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691798/wosb-accountability-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…Washington Monument strategy to maintain a bloated Federal  workforce that is crushing American taxpayers. Every dollar of  discretionary spending, which fully or partially funds every department  within the Federal Government, is now borrowed. Instead of long-overdue  streamlining, the Democrats are pushing for a tax increase that will  amount to about…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688585/yosemite-belongs-to-the-people"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…there  were nearly $40 million in contracts with the CCP or CCP-linked  organizations. This is just what we know about.\n\nInstitutions have accepted billions in anonymous foreign funds  without any transparency or accountability. There was even a recent  study from the Institute for the Global Study of Anti-Semitism and  Policy showing how this has infiltrated…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689035/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…clean extension of funding 13  times. Republicans have voted for it 13 times.\n\nThe Trump administration is putting a temporary bandaid on the  program, tapping into emergency funds that will cover half a month of  food stamps.\n\nMeanwhile, I have Iowans calling my office, asking me where they can  get food for their families.\n\nThis is a sad commentary…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696506/government-funding"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…most of which were Jews, but not all,  people from dozens of countries, including Americans, were attacked and  killed.\n\nWe focus on Hamas, but Hamas only exists because Iran funds and  supports it. Just as we saw President Trump free the last American  citizen who was being held hostage because of Iran, those problems and  challenges continue to happen…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691211/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…country.  President Trump recognizes the importance of school choice, issuing an  executive order directing the Department of Education to guide States  on how to use Federal funds for K-12 scholarship programs.\n\nIt also instructs the Education Secretary to prioritize school choice  when awarding discretionary grants. That is real leadership focused on…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689153/advancing-america-first-policies"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…tirelessly for rural healthcare access and the expansion of  community wellness programs. Jim grew the foundation's endowments from  $3 million to an astounding $150 million, funds that will benefit the  community for generations to come.\n\nJim also played a key role in introducing innovation and excellence  in Montana health services, helping to bring…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693079/congratulating-jim-duncan"}, {"senator": "John James", "party": "Republican", "sentence": "…How do we pay for these roads, Mr. Speaker? We pay for these roads  with gas taxes, and the gas taxes that these gas trucks would not be  paying would take directly from the funds that we need to build our  roads all across the country.\n\nIn addition to air pollution, Republicans care about clean air. We  care about clean water. We also care about common…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690473/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…happened to the $17  billion that has already been spent and whether, perhaps, there might  be fraud at issue, or at least waste or a lack of diligence in the use  of taxpayer funds.\n\nI don't think it is any coincidence that, as these efforts ramp up,  the legislature is now considering a bill, which the Governor himself  provided language for in a budget…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699738/national-oversight-for-biological-labs"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…Acquired Fund Fees and Expenses those fees and expenses that       the investment company incurred indirectly as a result of       investment in shares of one or more Acquired Funds that is a       business development company.\n\nMr. Speaker, I rise today in support of H.R. 2225, the Access to  Small Business Investor Capital Act. I thank Congressman Sherman…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692712/access-to-small-business-investor-capital-act"}]