[{"senator": "George Latimer", "party": "Democrat", "sentence": "…Development,  USAID, ``corrupt'', ``beyond repair,'' and ``a ball of worms'' that  needs to be eliminated. He claimed that there is a ``gigantic fraud  loophole'' where government funds given to NGOs lack sufficient  oversight.\n\nIn March, Elon Musk called Social Security ``the biggest Ponzi scheme  of all time,'' and policy followed his comments.\n\nThen this…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692137/which-elon-musk-to-believe"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…on.  Apparently, not too many of my colleagues on the other side have  incorporated this message: Congress and only Congress has the authority  to pass laws and to appropriate funds. That is exactly what they are  trying to take away from us.\n\nWe have seen this time after time. Now, it is with the illegal sweeps  of immigrants, including immigrants who…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…It is why I have been working to champion bipartisan healthcare and  health solutions, like bills to invest in urban, rural, and Tribal  healthcare; to invest congressional funds into building clinics; to  sponsor legislation to address the fentanyl crisis; to recruit and  train more nurses and healthcare professionals; to recruit more  counselors to…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696976/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…for Medicaid so  that working people aren't stuck with higher costs for their health  insurance. Not only can we do this, we must.\n\nI want to vote for a bipartisan budget that funds the government and  protects healthcare for the American people, but if, as has been  advertised, the Republican majority tries to rush a vote on a budget  that does not fix…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695636/government-funding-and-healthcare"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…not counting any day on which  the Senate is not in session, with changes that--(1) are within the  jurisdiction of such committee; and  (2) would ensure that no recipient of funds from the Corporation for  Public Broadcasting that is designated as a Primary Entry Point,  National Primary, State Primary, State Relay, State Relay Network,  Local Primary,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693619/hr-4"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…of the aisle. In particular, I want to shout out Jennifer  Chartrand, Jason Gray, and Ed Etzkorn.\n\nThrough this bill, we have the solemn responsibility of appropriating  the funds necessary to defend our Nation and to protect the safety and  well-being of our men and women in uniform. However, I must oppose this  bill which abandons our allies, damages…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693648/department-of-defense-appropriations-act-2026"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…save the  Federal Government any money, since the local D.C. budget consists  entirely of locally raised revenue. The Senate immediately passed the  District of Columbia Local Funds Act  to reverse this cut. Although President Trump and the National  Fraternal Order of Police called for the House to immediately pass the  District of Columbia Local Funds…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692302/protecting-our-nations-capital-emergency-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…implemented by  the Virginia Department of Energy, which is part of the Virginia State  government. We currently have a Republican Governor. This is an  allocation of grant funds to the Youngkin administration's Virginia  Department of Energy so they can do carbon capture and storage.\n\nThis is a way to take current coal technologies and make them cleaner…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…The success of this program can be seen with companies like Apple,  Intel, and FedEx, which all receive early-stage financing from SBICs.  Today, there are 319 SBIC-licensed funds participating in an array of  private investment and private credit strategies.\n\nIn 2023 alone, SBIC-licensed funds financed approximately $7.2  billion to 1,142 small businesses…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687917/investing-in-main-street-act-of-2025"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…Act, reducing the number of people without  insurance in our constituency to less than 10 percent. That would be  changed.\n\nThere would be $3 million in energy and conservation funds that would  be withheld from farmers in my district.\n\nIf you want to put the American people first, we must reject this  debacle and begin on a real bipartisan basis to pass…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688104/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…businesses that follow the rules, pay taxes, and create jobs in our  communities.\n\nLet's set the record straight. First, the Small Business Act already  prohibits the use of funds for individuals not lawfully within the  United States. Contrary to any statement that my colleagues may make  that Democrats have supported this, this is incorrect. The statute…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…in their 60s, who visited with me last week with their  premium notice, are looking at an increase from $300/month to $2,449/ month. The only way they can pay that is to draw funds from their  retirement 401k, triggering tax penalties on top of the increased out- of-pocket costs. My office heard from many other constituents with  similar shocking increases,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696732/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…began war without telling  Congress. In 1974, we were in the midst of the Vietnam war. Congress  did know that, and Congress had passed some legislation at least  appropriating funds for it and somewhat authorizing it during the  Johnson administration. Congress knew about the war in Vietnam.\n\nObviously, there was a draft, and 56,000 Americans were killed…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…especially in our rural areas.\n\nThe block grant funding that the Trump administration keeps promising  comes with little accountability, making it unclear whether those  Federal funds will ever reach the students that need them the most.\n\nEducation lays the foundation for a strong future, as well as a  thriving, healthy community; a thriving, healthy economy;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698124/dismantling-the-department-of-education"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…military.\n\nPresident Trump is showing what happens when you let big money buy  politics. In fact, he told Big Oil just last year that if they gave him  $1 billion in campaign funds, he would deliver. Well, promises made,  promised kept, literally invading a foreign country to take their oil.\n\nHere in this Chamber, just a few days ago, it was discovered…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699236/restoring-election-integrity"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…return; a Democrat with  a 105 percent return.\n\nI could keep going down. There is a lot of Americans who would like  to have returns along those lines. In fact, there are now funds out  there that follow and trade along with the congressional Members of  Congress to see what they are trading. That is ridiculous.\n\nYou should come to Congress. You should…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691214/stock-trading-ban-for-members-of-congress"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Prospective Purchaser: Kingdom of Saudi Arabia.\n\n(ii) Total Estimated Value:\n\nMajor Defense Equipment* $0.\n\nOther $500 million.\n\nTotal $500 million.\n\nFunding Source: National Funds.\n\n(iii) Description and Quantity or Quantities of Articles or       Services under Consideration for Purchase:\n\nMajor Defense Equjpment (MDE): None.\n\nNon-Major Defense Equipment:…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697340/arms-sales-notification"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…pipeline by expanding K through 12 students' exposure to accounting  programs. As with other areas of STEM education, this bill would  qualify accounting instruction for Federal funds. This recognition  aligns with the increasing need for accounting professionals to have  high-level math and technology skills, including the ability to analyze  big data,…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699755/9999"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…Washington Monument strategy to maintain a bloated Federal  workforce that is crushing American taxpayers. Every dollar of  discretionary spending, which fully or partially funds every department  within the Federal Government, is now borrowed. Instead of long-overdue  streamlining, the Democrats are pushing for a tax increase that will  amount to about…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688585/yosemite-belongs-to-the-people"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…17-year-long failure to build anything despite  receiving massive funding at the State and Federal levels.\n\nThe audit specifically looked at what happened to the $4 billion in  Federal funds that were provided through recent grants. The result of  the audit showed that the State is woefully out of compliance, that it  has built nothing, and that there is no viable…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…order titled: ``Protecting Children From Chemical and  Surgical Mutilation.'' This order defunds the chemical and surgical  mutilation of children and halts the use of Federal funds supporting  gender-affirming medical care for youth under the age of 19.\n\nH.R. 3492 works to codify President Trump's executive order and  amends section 116 of the United…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698346/protect-childrens-innocence-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…alike--has applied for and been approved for funding from this program.  States have big plans.\n\nThe Texas Tribune reports:\n\nThe state's health care agency said it will use the funds       to strengthen rural health care clinics in a variety of ways,       including: creating wellness and nutrition programs to rural       providers; educating and attracting…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698574/rural-health-transformation-program"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…Funding and  Congressionally Directed Spending projects. These projects will improve  clean and drinking water infrastructure throughout this country.\n\nThis bill also fully funds all of our, what I call, must-pays, such  as PILT payments--payments in lieu of taxes--to States and territories  and payments to Tribes through Contract Support Costs and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698758/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Rose", "party": "Republican", "sentence": "…least August       29, 2023, Mello formed a business she called Child Health and       Youth Lifelong Development (CHYLD). The sole purpose of CHYLD       was to receive grant funds from the 4-H Military Partnership       Grant program, which Mello fraudulently secured by way of her       position as a CYS financial program manager.\n\nOnce Mello received…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695237/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…legislature, and that Governor Newsom initially killed, found that  the State spent $24 billion on homelessness over a 5-year span and  failed to track the actual uses of those funds or whether they made any  measurable improvement on the homelessness problem in our State. By the  way, they didn't. The homeless population increased by some 50,000  individuals.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…most of which were Jews, but not all,  people from dozens of countries, including Americans, were attacked and  killed.\n\nWe focus on Hamas, but Hamas only exists because Iran funds and  supports it. Just as we saw President Trump free the last American  citizen who was being held hostage because of Iran, those problems and  challenges continue to happen…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691211/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…funding for broadband networks in our rural communities.\n\nThe Rural Broadband Protection Act requires the FCC to establish a  process for upfront vetting of providers seeking USF funds. It also  directs the FCC to set penalties for providers that do not meet their  commitments. This will ensure that USF recipients deliver on their  promise to serve our rural…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690153/rural-broadband-protection-act-of-2025"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…This is actually more than appropriate to keep those parks open.\n\nThey had a manning issue, which was brought on by themselves, by not  manning when they had the appropriate funds. Then when the President  put a limitation on that, we addressed that. It was opened up again. We  actually helped them recruit and staff. We actually opened up to local  governance,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694870/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…accepted excessive contributions to his campaign committee  in the form of personal loans and contributions that may not have  derived from Representative Cory Mills' personal funds, and may have  accepted through his campaign committee in-kind contributions or other  contributions not lawfully made;\n\nWhereas individuals who served in the military with…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697012/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…piece of legislation, totaling $453 billion, that  ensures we support those who have worn the uniform and continue  building the strongest military in the world. This bill fully funds  veterans' medical care, backing up the words we often say on this floor  and throughout our districts that we support our veterans and thank  them for their service.\n\nLet…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692937/american-economy-gaining-momentum"}]