[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…these judges have been instrumental in pausing Trump's attack  on birthright citizenship, and preventing ICE from going into sensitive  locations such as churches, synagogues, funeral homes, schools, and  emergency rooms.\n\nThis is what they are trying to do. They are trying to impose this  very aggressive agenda against protections from the Consumer Financial…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689393/protecting-the-legal-community"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…congressional liaison tragically passed  in 2023, it was David who compassionately stepped in to coordinate  communications to congressional staff and provide details regarding  funeral arrangements.\n\nIn all, David McCormack represents the very best of America's public  servants--dedicated, thoughtful, and unwavering in his commitment in  service to others.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689823/recognizing-the-retirement-of-david-mccormack"}, {"senator": "John Larson", "party": "Democrat", "sentence": "Mr. LARSON of Connecticut. Mr. Speaker, it is my honor to include in  the Record the Eulogy of Dorothy Christiana, delivered at her funeral  by her grandson, Sam Iacobellis. Her granddaughter Nina Bloom provided  the prayers of her passing and was followed by Sam, whose eloquence,  tone, humor, with compassionate…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688362/eulogy-by-sam-iacobellis-for-dorothy-christiana"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…to honor a remarkable educator,  dedicated public servant, and longstanding friend, the Honorable Judy  Thomas. Sadly, Judy passed from labor to reward on April 19, 2025. A  funeral service to celebrate her remarkable life will be held on  Thursday, May 8, 2025, at St. Luke Church in Columbus, Georgia.\n\nThe genesis of Judy Thomas's life began with her…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690837/in-memory-of-the-honorable-judy-thomas"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…honor the life of Mr. Adrian Earl Jenkins, Sr.--a gentle giant of  faith, family, and fearless service, whose quiet strength lifted a  community for more than 9 decades. A funeral service celebrating his  remarkable life was held on January 29, 2026, at Mount Zion Baptist  Church in Albany, Georgia.\n\nAdrian Earl Jenkins, Sr. was born May 7, 1928, in…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699459/in-memory-of-mr-adrian-earl-jenkins-sr"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…patriotic soldier, broadcast hall of famer and friend of  longstanding, Mr. Clifford Odell Rutledge. Sadly, Cliff passed from  labor to reward on Sunday, February 16, 2025. A funeral service to  celebrate his extraordinary life will be held on Wednesday, February  26, 2025, at Nichols Chapel AME Church in Phenix City, Alabama.\n\nCliff's journey began with…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688153/in-memory-of-clifford-odell-rutledge"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…for 25 years and had relocated to Kyiv when Russia  invaded his hometown in the southern Kherson region nearly 4 years ago.\n\nA nurse who worked with Smolyak said, before his funeral, that he was  very kind, always calm, and even-tempered. He saved so many people.\n\nMr. Speaker, we must do more to deter illegal Russian aggression,  inspire more healers,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698971/russian-air-attack-on-kyiv"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…His transition from labor to reward marks  the close of a life lived in humble service and bold leadership, and  his memory will continue to inspire generations to come. A funeral  service to celebrate his remarkable life will be held on Saturday,  January 31, 2026, at The Gethsemane Worship Center International in  Albany, Georgia.\n\nBishop Williams…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…talking about?  Who are these families who are going to see their health insurance  premiums spike? They are restaurateurs, beauticians, landscapers,  mediators, chiropractors, funeral directors, farmers, freelancers,  contractors, and gig workers. They are the ones caught in the cross  fire of a political battle that has now reached a stalemate.\n\nRoughly,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…veterans to die.  Mr. Chair, don't let them tell you this bill is about liberty and  freedom.\n\nMr. FROST. Mr. Chair, there is no liberty in a coffin, and there is  no freedom in a funeral. Veterans will die if this passes, and anyone  who votes for it should be ashamed of themselves.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692961/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…spiritual leader, gifted musician, astute entrepreneur, and  dear friend of longstanding, Overseer Roosevelt Carter, I, who passed  from labor to reward on June 15, 2025. A funeral service to celebrate  his remarkable and committed life was held on Sunday, June 22, 2025, at  First Monumental Faith Ministries in Albany, Georgia.\n\nThe journey of the resilient…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…our constituents who will be impacted by this body's  failure to act. These include restaurant owners, beauticians, barbers,  landscapers, florists, mediators, chiropractors, funeral directors,  farmers, small business owners and their employees, gig workers, the  self-employed, and more.\n\nWe have told stories of people worried about how they are going…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…all.\n\nWe know that the longer we do nothing, the more likely it is for  someone else to have their family torn apart like I have or for someone  else to attend a wake or a funeral instead of a wedding or a graduation  ceremony. It doesn't have to be this way.\n\nMr. Speaker, I just--if we want to say it this way--celebrated the  12th anniversary of my…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697534/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…means  to take that oath seriously, not just in uniform but in life, which is  why I will be offering an amendment to the Defense appropriations bill  to ensure that military funeral honors remain reserved for those who  have defended the Constitution, not for those who have sought to  overthrow it.\n\nLast year, the administration offered military honors…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698491/anniversary-of-january-6"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…profound sorrow but also  with deep gratitude to pay tribute to a man whose life was a testament  to faith, service, and love--Sheriff John Bowens of Terrell County,  Georgia. A funeral service to celebrate his remarkable and purposeful  life was held on Saturday, February 7, 2026, in Dawson, Georgia. Born  August 17, 1946, in Dawson, Georgia, John Bowens…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699826/in-memory-of-sheriff-john-bowens"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…future in jeopardy. A 2-year funding mechanism will bring  much-needed stability to the program.\n\nMy third amendment will require the DOD to increase the efficiency of  the Funeral Honors Program. The Funeral Honors Program helps the  families of fallen veterans give their loved ones the dignified and  respectful burial that they have earned. This program…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695238/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…of God, went home to be  with his Lord and Savior, Jesus Christ, on September 29, 2025. He was  94.''\n\nThat is the opening paragraph of an obituary for Pastor Bjorge, whose  funeral is tomorrow. I will obviously miss it, being here in  Washington, but I did want to, first of all, seek unanimous consent to  submit his obituary to be printed in the Record…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Anna Luna", "party": "Republican", "sentence": "…lecturing the American people on how this is going to require them to  show their papers. Last time I checked, during COVID they demanded that  if you simply wanted to go to a funeral, be with your loved one  while they are dying, or get married, then you have to show your  papers. In fact, in New York  City, Mr. Speaker, they were literally asking you…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700010/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Kabul, Afghanistan. One of them was Wyoming's own Rylee McCollum.  He embodied the best of Wyoming. He was a marine. He joined the Marines  on his 18th birthday.\n\nI spoke at his funeral. He was Wyoming's wrestling champion. He was  about to become a father. He was just 20 years old when he died. He was  the same age as Sarah Beckstrom from West Virginia.", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697356/wyoming-servicemembers"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…father in 1985  that brought Jon back to Farmington to lead the family business. He was  a fourth-generation owner of Cozean Memorial Chapel and was inducted  into the National Funeral Directors Association Hall of Excellence.\n\nHe was a man of quiet dignity, sincere kindness, and genuine interest  in people. Jon was a fixture at community events. He invested…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697134/recognizing-dr-jon-cozean"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "Mr. SCHMIDT. Mr. Speaker, I was absent from the house to attend the  funeral of Kansas City, Kansas, Police Officer Hunter Simoncic, who was  killed in the line of duty last month. Had I been present, I would have  voted YEA on Roll Call No. 221, YEA…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694871/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…father, and a friend.\n\nThe way that he died, though tragic, is a testament to the way he  lived. Deputy Ohlmeyer was struck as he was serving as a motorcycle  escort for a funeral procession and was hit by a car from behind. In  his final moments, he was serving someone else.\n\nI am told that those who did not have a family were invited to be  part of…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699609/9999"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…unarmed Air Force veteran who was shot that day in  this building.\n\nRecently, Senate Democrats attempted--think about this--attempted to  strip Ashli Babbitt of her military funeral honors. Now, why would they  do that? Ashli Babbitt was wrongfully killed on January 6, 2021. The  Federal Government admitted it, and they paid money to her family as  part…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698541/9999"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Congressman Schulze served  in the House of Representatives. He was known for being a fair-minded,  commonsense legislator who worked with Members on both sides of the  aisle.\n\nFuneral services will take place on Saturday in Malvern,  Pennsylvania. Our thoughts are with his wife of 33 years, Nancy, his  four children, and all of his family.\n\nMay God bless…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698746/moment-of-silence-for-congressman-richard-t-dick-schulze"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…their way to visit their daughter in  college in Pennsylvania.\n\nGrace Maxwell, an engineering student from Wichita, was returning to  college after attending her grandfather's funeral at home in Kansas.\n\nDustin Miller, an IT professional who grew up in El Dorado and was a  lifelong Chiefs fan, told his mom he was going to try to make it back  in time to…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699417/9999"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…greater mobility for those who  sacrificed for our freedoms. He further demonstrated his compassion and  solidarity by volunteering at local VA hospitals and participating in  funeral escorts to honor fallen service members and veterans.\n\nIn 2022, Aaron returned to his hometown of Nacogdoches, reuniting  with his high school sweetheart, Melissa Milford…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696272/recognizing-christopher-aaron-mcgowen-with-a-congressional-veteran-commendation"}, {"senator": "French Hill", "party": "Republican", "sentence": "…scheduled witnesses--the most Senator Bumpers       remarked he had seen in his nine years in the Senate. Senator       Pryor would have joined them, but was attending the funeral       of his Mother. These hearings would be followed by a second       set of hearings in Washington in April 1984.\n\nSo, let's pick up the ``back story'' as to the role of…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…commission. A disturbing inclusion is the eulogy by the late       Moshe Dayan, the iconic Israeli leader who back in April 30,       1956, spoke at Nahal Oz's first funeral. Dayan, initially       arriving the day before for planned four weddings only to       face the brutal murder of Roi Rutberg, Nahal Oz's security       chief, by infiltrating…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690665/israel-at-77"}]