[{"senator": "Mark Pocan", "party": "Democrat", "sentence": "…be teachers. We lost long-term public employees.  That affected services.\n\nThis bill will restore longstanding collective bargaining protections  and ensure that any future administration cannot demolish these rights  again.\n\nWe hear our Federal employees across the country. We value them, and  we are fighting with them. We stand on behalf of the Federal…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697978/protect-americas-workforce-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…or an arbitrary quota.\n\nSo, to the Trump administration, let me say this: You cannot claim to  love our country at the same time you are trying to destroy our future.\n\nAlready, this administration has worked to cut healthcare for  millions of Americans, including DACA recipients. They are cutting  education benefits and opportunities for DACA recipients,…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694421/daca"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…including at  Nuremberg, individuals are responsible for war crimes and unlawful  killings even when acting under superior orders. That principle must  apply here as well. A future Administration committed to the rule of  law will have a responsibility to investigate these actions fully and  hold accountable those responsible for unlawful killings carried out…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698324/supporting-the-war-powers-resolutions"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…the skyrocketing healthcare costs. But now, instead of putting  Americans first, we are stepping into a foreign nation and promising to  run it for the foreseeable future. An administration that had promised  to end foreign wars has begun a new one. A President who had decried  the use of force for regime change or to engage in nation building has  just…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698678/venezuela"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…and apprehension about the future of this country. And the poll numbers  only reflect not only the downward spiral of our economy but of our  confidence in the future.\n\nThis administration has been cruel, and it has been dumb. It is  unmatched for its meanness and stupidity--the harm and hurt done to  everyday Americans in real life and realtime; the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…the last 5 years  for all kinds of political persuasions. And I want people to imagine  that if they will do this in Minneapolis, there is no stopping them--or  some future administration--from doing this to you for what you care  about.\n\nNow, I think it is lucky that we grew up in this country, and we are  taught over and over about the values of freedom…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…continues to do so because the prior President, President Biden,  decided to try to eliminate it for the first time in history. We are  trying to prevent it so that no future administration can do that. Mr.  Speaker, I do want to talk about one individual. We hear all kinds of  examples over here.\n\nLet me talk about a 21-year-old named Faith who found…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…skyrocketing prices across the board. It is a crisis, and  Republicans are simply ignoring it.\n\nThis bill is basically a thinly veiled attempt by Republicans to  obstruct any future administration's EPA regulations that keep our air,  lands, and water clean. This bill would allow the Federal Energy  Regulatory Commission, or FERC, to block any regulation from…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…vehicle, it is not simply eliminating that  provision, along with all the other provisions in the resource  management plan, it is potentially risking the ability of a future  administration, including this one, from issuing any resource  management plan that provides a similar benefit.\n\nWhat happens when a court 2 years from now, 3 years from now, or 5…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694899/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…States. Why? Because they have terrible  policies.\n\nThis bill is quite simple: It restores the definition that Congress  originally intended. If an administration, any future administration,  wants to change policy, rather than that coming from the bureaucrats,  it should come before Congress. Congress set the efficiency standards  in 1975, and if Congress…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698562/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…of those tools that we have to take a big hammer to a bad policy.\n\nI am glad that we are taking that big hammer to a terrible policy. We  are also making it so that a future administration can't enact another  bad policy like the ones that were put into place with these three RMPs  that we will be addressing today. That is a good thing.\n\nIt is a good…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…Constitution is upheld. We  need more legislation like the Preserving Presidential Management  Authority Act, which simply reaffirms Article II and ensures that no  future administration can permanently handcuff its successor.\n\nMr. Speaker, I urge my colleagues to defend Article II, reject this  H.R. 2550, and stand with the American people who sent…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697985/protect-americas-workforce-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…President Trump has recently  indicated they will abandon this flawed rule. However, without this  Congressional Review Act resolution, there is nothing to prevent a  future administration from reintroducing this damaging rule that would  prevent healthy, beneficial mergers from occurring. Community and  regional banks, as well as their customers, should…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…Trump, the government has restored basic biological  truth: men are men, and women are women. I applaud the President for  his commitment to protecting women, but a future administration could  bring us right back to this insanity.\n\nThe Biden administration sacrificed the dignity and safety of women  to appease radical gender, lunatic ideology. Our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…WESTERMAN. Mr. Speaker, I point out that, while the current  administration did recently rescind the 2024 rule this month, passage  of a CRA is still necessary to prevent a future administration from,  again, weaponizing IAPs similar to this one that ignore congressional  intent. By replacing the 2022 IAP, BLM wouldn't be left in limbo. They  would revert back…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…severe impacts on grid reliability.\n\nMr. Speaker, I urge my colleagues on both sides of the aisle to  support this bipartisan, commonsense legislation to ensure that no  future administration or unelected Federal bureaucrat can unilaterally  jeopardize grid reliability.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698277/reliable-power-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…abuse our system to flood our country with foreign  nationals.\n\nPresident Trump is delivering that through execution as President. We  need to codify that and prevent a future administration from abusing it  ever again. We could do that. We could do it tomorrow. We passed H.R. 2  in the last Congress. Let's pass it again. Let's send it to the Senate,  and…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Congress, owe  it to the President and to the great men and women of Border Patrol and  ICE, to our constituents, and to future Americans, who could be  endangered by a future administration with open borders, to codify that  which President Trump has been carrying out to defend our country.\n\nWe owe it to all of them to pass a new and updated version of…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…requiring SBA loan  applications to include citizenship verification provisions. It is  common sense. This bill codifies these Trump-era safeguards into law so  that no future administration can turn Federal relief into a global  giveaway.\n\nThis is about ensuring we have the validation mechanisms in place to  ensure the rule of law. It is about prioritizing…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692127/american-entrepreneurs-first-act-of-2025"}]