[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…force. They also underscore  my broader concern about unchecked increases in defense spending,  despite the Pentagon's repeated audit failures, including in November  2024. From FY 2021 to FY 2025, defense authorizations rose from $740  billion to $895 billion, a 21 percent increase, and this bill would  raise that to $900.6 billion, approximately $8 billion…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…on our  national debt than any other federal program except for Social  Security, so including even defense or Medicare. Interest will rise  from $881 billion in Fiscal Year (FY) 2024 to $1 trillion by FY 2026.\n\nFailing to address our mounting debt and deficits has severe  implications. It crowds out other critical spending in both defense and  non-defense…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689288/introduction-of-the-sustainable-budget-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "Ms. MOORE of Wisconsin. Mr. Chair, I rise in support of my amendment  No. 233 to the FY 2026 Defense Appropriations bill. I thank Chairman  Calvert and Ranking Member McCollum for including it in the Amendments  En Bloc No. 3.\n\nOur world is facing numerous water…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694170/department-of-defense-appropriations-act-2026"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…2020, the first Trump  administration called for a resumption of nuclear testing in the breach  of the Comprehensive Nuclear-Test-Ban Treaty. Back then, I led the  charge in the FY 2021 NDAA process to ensure that that didn't happen  and that we couldn't resume that testing in the United States.\n\nPardon my bad French, but ``the more things change, the more…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699032/expiration-of-new-start"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…apportionment data that would permit GAO  to conduct the same analysis for the President's special message of  June 3, 2025.''\n\nThis is unacceptable, and it is unlawful. In the FY 2022 and FY 2023  Consolidated Appropriations Acts, when I was chair of the  Appropriations Committee, Congress--on a bipartisan basis--required OMB  to post apportionments publicly.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694158/senate-amendment-to-hr-4"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…of collections in income tax revenue from Fiscal Year       2026 to Fiscal Year 2027, thereby creating a shortfall in       cash collections of approximately $400 million in FY 2026.\n\nPlease do not hesitate to contact me if you have questions.            Sincerely,                                                          Glen Lee.\n\nMs. NORTON. Mr. Speaker,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699680/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…under Title V of the       Public Health Service Act (PHSA), of which the Energy and       Commerce Committee has sole jurisdiction. Yet, contrary to       the statute, the HHS FY 2026 Budget in Brief proposes to       eliminate SAMHSA and move some of its functions to a new       Administration for a Healthy America (AHA). If this becomes       reality,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…entity, it may be  used for civilian law enforcement without violating the Posse Comitatus  Act.\n\nIn the 117th Congress, the House passed this bill as part of the  fiscal year (FY) 2022 National Defense Authorization Act (NDAA) and the  FY 2023 NDAA.\n\nI urge my colleagues to support this bill.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694829/introduction-of-the-district-of-columbia-national-guard-home-rule-act"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "Mr. GOTTHEIMER. Mr. Chair, I rise in support of the en bloc package  which includes three amendments I offered to the FY 2026 Military  Construction, Veterans Affairs, and Related Agencies Appropriations  bill.\n\nMy first amendment requires a resident advocate in every veterans  home across the…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692953/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…million to renovate and build new medical centers, hospitals, and  clinics.\n\nMore importantly, this bill puts the final nail in the coffin of the  Biden DOD's woke bureaucracy. The FY 2026 NDAA includes essential  reforms that we all know are essential to refocus our military on  warfighting and lethality by codifying the President's executive order  of ending…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697792/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…EERE.\n\nThis amendment is offered because we simply cannot continue to fund  the destruction--and that is what it is--of the U.S. energy grid to  satisfy a climate cult.\n\nThe FY 2024 minibus gave this office $3.5 billion. While the  underlying bill cuts funding down to $1.9 billion, we need to defund it  entirely. Why are we fooling around here, taking…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…extends government funding to the end of January  2026, thereby blocking attempts to force a budget-busting omnibus at  the last minute before Christmas. It also includes the FY 2026  Agriculture, Rural Development, Food and Drug Administration, and  Related Agencies Appropriations Act.\n\nRepublicans have effectively locked in disciplined, flat spending…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696739/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…opportunity to avoid  repeating past mistakes. I encourage everyone on both sides of the  aisle to do the right thing and close out five of our remaining six  appropriations bills for FY 2026 while enacting funding for core  priorities, including: strengthening America's defense and providing a  well-earned pay raise to our troops; advancing lifesaving biomedical…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Greg Murphy", "party": "Republican", "sentence": "…veterans, as well as Camp  Lejeune and Military Corps Air Stations Cherry Point and New River, it  is my honor to advocate for Federal funding on their behalf.\n\nI proudly support FY 2026 appropriations to increase the VA's budget  by 10  percent to ensure that our servicemembers and veterans receive the  resources that they need and, more importantly, that…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692939/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…capable fighting force on the planet.\n\nProperly equipping our warfighters is critical, but so is ensuring we  recruit and retain the best and brightest.\n\nToward that end, the FY 2026 NDAA continues to make improvements in  the quality of life of all of our servicemembers.\n\nThis bill supports the Trump administration's 3.8 percent pay raise  for all servicemembers…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697810/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…H.R. 1166, the Decoupling from Foreign Adversarial Battery Dependence  Act, is a critical first step in addressing this issue. Modeled after  previous provisions included in the FY 2024 NDAA, my legislation builds  off of these efforts and prohibits the Department of Homeland Security  from procuring batteries from companies that have deep ties to the CCP…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688683/decoupling-from-foreign-adversarial-battery-dependence-act"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…for the purposes  of this bill, which would subject such companies to a strict zero- dollar threshold for gifts and contracts.\n\nThe section 1260H list was established in the FY 2021 National  Defense Authorization Act and has since been used as a blacklist for  Chinese military companies that are directly or indirectly owned,  controlled, or beneficially…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689026/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "Mr. DAVIDSON. Mr. Chair, I rise today to urge you and all of our  colleagues to support amendment No. 57 to the FY 2026 Department of  Defense appropriations bill.\n\nThis amendment strikes section 8072, a misguided rider that prohibits  the Navy from decommissioning littoral class combat ships.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693683/department-of-defense-appropriations-act-2026"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…subcommittee because we would not be here without them.\n\nThe bill we are considering today has a total base discretionary  funding level of $26.3 billion. However, when compared to FY 2025  enacted levels for non-Defense discretionary spending, this bill is a  $140 million cut.\n\nThe Treasury Department is cut by 8 percent from FY 2025 enacted  levels, including…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699055/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…between economic self-      determination, our community and our culture.\n\nRestoring the 2020 program ROD and overturning the 2024 ROD       as a rule is consistent with the FY 2025 reconciliation bill,       which requires four lease sales over the next decade.       Secretary Burgum has already reinstated the 2020 program ROD,       and both the Senate…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697510/sj-res-91-and-hj-res-131"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…has a major spending  problem, and we face a massive problem continuing to pay people for all  sorts of Federal programs, including Social Security, who have passed  away. In FY 2024 alone, Federal agencies reported over $162 billion in  improper payments. By making this data exchange permanent, the Bureau  of Fiscal Service projects that we will save…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698921/ending-improper-payments-to-deceased-people-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…between economic self-      determination, our community and our culture.\n\nRestoring the 2020 program ROD and overturning the 2024 ROD       as a rule is consistent with the FY 2025 reconciliation bill,       which requires four lease sales over the next decade.       Secretary Burgum has already reinstated the 2020 program ROD,       and both the Senate…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Fiscal Years 2025-2034.....................              0.000------ ------------------------------------------------------------------------ Section 4106 of H. Con. Res. 71, the FY 2018 budget resolution,\n\nspecifies that the budgetary effects of a reconciliation bill with net\n\ndeficit reduction ``shall never be made available on the pay-as-you-go\n\nledger…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694525/budgetary-revisions"}]