[{"senator": "Danny Davis", "party": "Democrat", "sentence": "…primary  responsibility for public education.\n\nIn addition to cutting federal workers that oversee Head Start,  President Trump reportedly plans to eliminate Head Start in his FY26  Budget. Head Start reduces educational disparities so that lower-income  children enter school ready to learn. Gutting it directly harms over 1  million parents who rely on…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690128/alarm-at-the-trump-administrations-dangerous-attack-on-education"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…deadlines would have to be pushed back       to the Fall of 2026. Delaying local income tax collection       would create a local cash shortfall of up to $400 million in       FY26, according to the DC Chief Financial Officer.\n\nLocal tax code decoupling from the federal tax code is not       unique. Many states have also voted to decouple from       provisions…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699680/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…negotiation. In the case of  the NDAA, it is oriented around the shared goal of making sure that our  Armed Forces continue to be the best in the world.\n\nHowever, while the FY26 NDAA is strong in many ways, it also falls  short in some crucial areas. Above all, it falls short in its lack of  meaningful policy to rein in the Trump administration's reckless…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Child       Nutrition Programs, the likelihood (or lack thereof) of       Congress's ability to appropriate additional billions of       dollars for Child Nutrition Programs for FY26 to make up the       funding shortfall such an additional transfer would create,       and the Courts' orders.\n\n9. Ultimately, USDA has determined that Section 32 Child…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "Ms. DEAN of Pennsylvania. Mr. Speaker, I rise today in support of the  negotiated FY26 Commerce, Justice, Science; Energy and Water  Development; and Interior and Environment Appropriations Act.\n\nAs a new member of the CJS Committee, I am pleased to have been…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698757/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "Mr. HIMES. Mr. Speaker, I thank the hard-working chairman and ranking  member of the House Armed Services Committee.\n\nMr. Speaker, I rise in support of the FY26 National Defense  Authorization Act. Importantly, the bill reforms the outdated  acquisition process at the Department of Defense. It provides a pay  raise for our servicemembers,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697797/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…read the title of the bill.\n\nMr. Speaker, I rise in support of H.R. 7147, the Department of  Homeland Security Appropriations Act.\n\nThis bill marks the final measure of our FY26 agenda. Our work here  is about one of the most important duties, which is keeping the  American people and our homeland safe.\n\nThis legislation delivers just that and upholds…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699354/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…spend plan for the  Department of Defense for these nonrecurring engineering expenses.\n\nRest assured, I will continue fighting to secure the additional  funding in the final FY26 Defense bill.\n\nBefore I withdraw this amendment, I ask Chairman Calvert to commit to  working with me on the continued LC-130 recapitalization project as you  have so graciously…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693679/department-of-defense-appropriations-act-2026"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…not make  good upon that guarantee, our Nation's warfighters and defense  apparatus will be ill-equipped to confront all manner of threats to the  homeland.\n\nThe bipartisan FY26 NDAA is our answer, and it contains the necessary  provisions needed to ensure that the Armed Forces can carry out their  mission unimpeded.\n\nFrom pay raises for servicemembers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695112/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…many, is to provide for the common defense of  the Nation.\n\nIn total, H.R. 4016 provides $831.5 billion and adheres to the  budgetary top line put forward in the President's FY26 budget request.\n\nConsider for a moment the provisions contained within this  legislation that uphold Congress' responsibility.\n\nMr. Speaker, there is $189 billion for Active-Duty,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693550/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…stand  ready to defend this Nation each and every day.\n\nLet's take a quick look at this next poster. It will show exactly  what the Democrats would be voting against for the FY26 Defense  Appropriations Act.\n\nThey would be voting against a pay raise for American troops and  border security investments to counter drug trafficking.\n\nThey would be voting…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693646/department-of-defense-appropriations-act-2026"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…159, to provide funding for the purchase of  heavy dump trucks, or HDTs, for the Active Army, the Army National  Guard, and the Army Reserve.\n\nWhile much of the focus in our FY26 Defense appropriations bill is on  weapons and on other Defense materials, the tools that our military use  to ensure that the infrastructure is in place to support our  servicemembers…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693691/department-of-defense-appropriations-act-2026"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…the responsibility now is to get it across the finish  line. This vote is about governing responsibly and doing our jobs.\n\nI look forward to us nearing the completion of our FY26 duties. I  urge all Members to support this bipartisan package.\n\nMr. COLE. Madam Speaker, I yield 3 minutes to the gentleman from  Arkansas (Mr. Womack), the distinguished chairman…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "Mr. ADERHOLT. Madam Speaker, I rise today, as my colleagues are, in  support of the FY26 appropriations package. As has been said, it  provides the full-year funding for five out of the remaining six  appropriation bills.\n\nUnfortunately, funding these bills is not…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699576/consolidated-appropriations-act-2026"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…The bill is fundamentally the same responsible approach House  Republicans offered on September 19, but with an important addition:  three full-year appropriations bills for FY26. These bipartisan,  bicameral, full-year appropriations bills cover the Military  Construction and Veterans Affairs; Legislative Branch; Agriculture,  Rural Development; and…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…Treasury's  counterterrorism and financial intelligence efforts, cutting off  funding streams used by cartels, traffickers, and foreign bad actors.\n\nMr. LaLOTA. Mr. Chairman, the FY26 FSGG bill reflects the values  Americans sent us here to uphold. I urge support of the bill, and I  thank the chairman for his leadership.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699046/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…appropriations and taking every  action to complete our work.\n\nMr. COLE.\n\nMr. SCOTT FRANKLIN of Florida. Mr. Speaker, I rise today in strong  support of H.R. 6938, which includes the FY26 Energy and Water  Appropriations bill.\n\nThis bill makes critical investments in our national defense by  increasing Department of Energy defense program funding by $912  million.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698749/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]