[{"senator": "Judy Chu", "party": "Democrat", "sentence": "…January, that was  unusually fast. Often, those declarations can take days or even weeks,  which was the case in 2020 after wildfires, including the Bobcat fire  in the San Gabriel Mountains, ravaged my State. That means if disaster  strikes during filing season, taxpayers run the risk of missing Federal  filing deadlines through no fault of their own.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689384/filing-relief-for-natural-disasters-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Crystal Jones Nieves; David J.       Cynamon; Dr. Kirstin A. Morgan; Elisa Ortiz; Elizabeth Field;       Emily Karandy; Erin Eife; Fabian Lucero, Esq.\n\nGabby Mulnick Majewski; Gabriel Goldberg; George Derek       Musgrove; Gianna Karandy; Glenn Engelmann; Gwen Umbach;       Gwendolyn Green; Harvey Reiter; Henry F. Fradella, J.D.,       Ph.D.; Hugh T. Keleher;…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696958/opposition-letter-led-by-tzedek-dc-on-the-district-of-columbia-cash-bail-reform-act-of-2025-hr-november-2025"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…forward when the game was tied at six.\n\nIn the final minutes, Eagles quarterback Michael Maldonado stepped up  under pressure and delivered a perfect 10-yard touchdown strike to  Gabriel Canchola. This touchdown pass put the Eagles in the lead.\n\nWith 21 seconds still left, the Eagles' Ivan Lopez broke through the  line to sack the opponent's quarterback and…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697339/congratulations-to-the-lady-eagles-volleyball-team"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…of the most densely populated and  at-risk areas in the Nation for air pollution are still in California.\n\nThe Los Angeles County area, including the San Fernando and San  Gabriel Valleys; the Central Valley, including Bakersfield and Fresno;  San Diego County; San Francisco Bay Area--these are all areas that see  dense populations facing increasing…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…provide him and his family with desperately needed financial  certainty, which they deserve, they need, and they were promised.\n\nAnd it would also help veterans like retired MSgt Gabriel Peterson of  Biloxi, MS. He was medically discharged as a result of reactive airway  disease. He is on five different drugs. They help with his breathing.  It is a struggle…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Shortly after being built, the House's boarders included  Chief Justice of the Supreme Court John Marshall and occasionally other  Supreme Court Justices, including Joseph Story, Gabriel Duvall, Smith  Thompson and Henry Baldwin.\n\nIn 1835, the House was sold to former Maryland Governor Samuel  Sprigg, who gifted it to his daughter and son-in-law, Sally Sprigg…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692257/recognizing-the-dacor-bacon-house"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…business and supporting our  local businesses.\n\nComing from California's 31st District, I am proud to represent a  thriving and diverse community of small businesses in the San Gabriel  Valley. From cafes and restaurants, to bookstores, toy shops, party  supply stores, and many more, our district is fortunate to have an  abundance of locally owned small…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696998/small-business-saturday"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…contracts but also help  attract new small businesses to navigate the Federal contracting  process.\n\nThe SPUR Act will help ensure more small businesses, like those in  the San Gabriel Valley which I represent, can fairly compete for  Federal contracts.\n\nThe SPUR Act will require Federal agencies to examine the following  data:\n\nHow many small businesses…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687943/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "Mr. STANTON. Mr. Speaker, I rise today to mourn the tragic loss of  Officer Gabriel Facio of the Apache Junction Police Department.\n\nThis past Sunday, 6 days after being shot while responding to a road- rage incident, Officer Facio passed away from his injuries…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692251/mourning-loss-of-officer-gabriel-facio"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Gadiraju, Caroline       Harris, Rachel Johnson, Emma Johnson, Lucas Johnson, Kendall       Leak, Angela Li, Nia MacQueen, William `Kent' Mautner, Jack       McDermott, Wil Gabriel McDermott, Cameron Mitchell, Finlay       Mitchell, Aidan O'Connor, Vaideep Pemmada, Ahish Pidikiti,       Murat Sahin, Caleb Shin, Stone Simpson, Ejay Tan, Hannah       Thovtrup,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692400/congratulating-the-2025-congressional-award-gold-medalists"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "Mr. BURLISON. Mr. Speaker, I rise today to honor the lives of Deputy  Michael Hislope and Deputy Gabriel Ramirez of the Christian County  Sheriff's Office who yesterday were killed in the line of duty while  serving the people of southwest Missouri.\n\nDeputy Ramirez was murdered…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700214/moment-of-silence-for-deputies-michael-hislope-and-gabriel-ramirez"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Allison, William:       Bloomberg News; Alonso, Nahiara: Agence France-Presse; Alper,       Alexandra: Thomson Reuters; Al-Rikabi, Ramsey: Bloomberg       News; Alvarez Jacobs, Gabriel: Washington Post; Amenabar,       Edwin: Washington Post; Amiri, Farnoush: Associated Press;       Anastacio, Nicholas: National Journal; Anderson, Zachary: USA       Today;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Mr. BAUMGARTNER. Mr. Speaker, I rise today, one day after National  Fentanyl Awareness Day, to honor the memory of a special young man and  to share a call for action.\n\nGabriel Fensler was a much-loved son and brother who had struggled  with addiction but had fought hard for his recovery. Gabriel relapsed  one day after his 24th birthday.\n\nFentanyl…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690498/recognizing-gabriels-challenge"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Jessica: CNN; Coburn,       Laura: ABC NEWS; Cocklin, Anne: ABC NEWS; Cocklin, Stephen:       ABC NEWS; Cofske, Jr., Harvey: DIVERSIFIED COMMUNICATIONS,       INC. (DCI).\n\nCohen, Gabriel: CNN; Cohen, Marshall: CNN; Cohen, NICHOLAS:       NBC NEWS; Cohen, Sari: CNN; Cohen, Zachary: CNN; Cohencious,       Robert: Native American TV (NATV); Coker, Edward: WTTG-FOX…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Arkaea Media Group; Ferguson,       Brett: Tax Notes; Fertig, Natalie: Politico; Fields,       Ashleigh: The Hill; Fitzpatrick, John: Bloomberg Industry       Group; Fleisher, Gabriel: Wake Up To Politics.\n\nFleming, Alexandra: People Magazine; Flook, William: TR Tax       & Accounting; Florko, Nicholas: Atlantic Monthly; Foldi,       Matthew: The Spectator;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698171/members-entitled-to-admission-to-the-119th-congress-periodical-press-gallery"}]