[{"senator": "Bill Foster", "party": "Democrat", "sentence": "…over  1,000 nuclear tests, far more than any other country, and we had much  better instrumentation, knowing exactly what happened in those  explosions.\n\nThe knowledge that we gained has allowed our Nation to maintain the  safety, security, and effectiveness of our nuclear stockpile without  any further testing. If we were to resume testing, the rest of…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…new perspectives on peoples and cultures beyond their own. Many CBYX  alumni go on to distinguished careers in foreign affairs and public  service using the language skills gained through this scholarship  program.\n\nThis year, Emiko will travel to Germany to attend school, live with a  host family, and collaborate with the Department of State to promote…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693200/recognizing-emiko-mukai"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…the deepest questions of the universe and humankind's place and purpose  within it. His All-Holiness Bartholomew has earned this storied honor  through the same works that gained him the moniker of the ``Green  Patriarch.'' Since assuming his office in 1991, Patriarch Bartholomew  has convened leaders across borders and disciplines to redefine human-…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695566/welcoming-his-all-holiness-bartholomew-i-of-constantinople-to-the-united-states"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…constant medical  attention, specialized equipment, and home-based services would face  uncertainty and loss of those services.\n\nAnd let us not forget the low-income adults who gained coverage  through Medicaid expansion, who worked hard every day. They got access  to Medicaid through expansion under the Affordable Care Act. For them,  this is not ideology.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…weaker. It became the most formidable fighting force in  human history.\n\nWhen our businesses embraced diverse talents and perspectives, they  didn't become less competitive. They gained access to broader markets  and built the strongest economy in the world.\n\nWhen our universities created more inclusive learning environments,  they didn't sacrifice excellence.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690322/ending-of-dei-programs-through-executive-order"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…their families from financial institutions and accounts in  the United States.\n\nThe report mandated by the bill is intended to raise public awareness  of hidden and corruptly gained funds that are directly or indirectly  controlled by such officials--for those listed in the report, and their  immediate family members.\n\nThe bill would also restrict U.S.-based…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693875/taiwan-conflict-deterrence-act-of-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…both illegal and  unconstitutional, and we must hold DOGE and Secretary Chavez-DeRemer  accountable.\n\nCongress established the Women's Bureau 2 months before women  officially gained the right to vote, 105 years ago this year. Instead  of celebrating its achievements and recognizing the benefits of these  grant programs, the Trump administration is trying…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691209/supporting-the-womens-bureau-at-the-department-of-labor"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…Mari is a Ph.D. candidate studying biomedical sciences at UCSD. She  researches the neuroscience behind drug addiction so we can fight the  opioid crisis. Just as her field gained momentum--overdose deaths  declined in 2024 for the first time in over two decades--her lab was  threatened with funding cuts. Mari has watched her lifesaving research  be…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695749/funding-cuts-to-science"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…There, he focused on  tackling the scourge of organized crime, investigating and prosecuting  figures involved in regional and national gangs.\n\nThis law enforcement experience, gained at both the state and federal  level, had Mr. Barron well-prepared for his subsequent role as Counsel  and Special Advisor to then-Senator Joe Biden, serving on the United…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688210/recognizing-a-trailblazing-career-in-criminal-justice-us-attorney-erek-lawrence-barron"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…new perspectives on peoples and cultures beyond their own. Many CBYX  alumni go on to distinguished careers in foreign affairs and public  service using the language skills gained through this scholarship  program.\n\nThis year, Avi will travel to Germany to attend school, live with a  host family, and collaborate with the Department of State to promote…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693199/recognizing-avi-bender"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…the Declaration  of Independence was about. We may want him to understand that there was  a foundational document as relates to self-determination of those who  had recently gained their independence from Great Britain.\n\nI hoped that he would maybe spend a few of these days in his first  100 days doing that. It is sad to say it is his second term, and…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…school principals voted to admit the school into their district by a 5- 3 count, the vote of LHSAA principals numbered 11 yeas, 185 nays. The  rest is history.\n\nSt. Augustine gained entry through a federal court suit in 1966, the  CYO allowed St. Augustine and Xavier Prep to compete in its tournament,  and the Knights of Columbus ceased running its annual…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695287/recognizing-the-50th-anniversary-of-an-historic-athletic-achievement-in-the-history-of-the-louisiana-high-school-athletic-association-lhsaa"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…pretend they aren't there; they pack up their             things      They hold their breath; the school is in a moment of silence      As hard as they tried, new angels still gained untimely wings      At the funerals, they send thoughts and prayers to victims of             the violence      Shell-shocked survivors embrace one another and try to move…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…pre-position access  on U.S. critical infrastructure make it a persistent  counterintelligence and cyberattack threat. Moscow's unique strength is  the practical experience it has gained integrating cyberattacks and  operations with wartime military action, almost certainly amplifying  its potential to focus combined impact on U.S. targets in time of  conflict.''…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…their lives.\n\nIn Illinois, 3.4 million people are enrolled in Medicaid, 1.5 million  children. Under the Republican plans to slash Medicaid, 775,000 adults  in Illinois who gained health insurance thanks to the Affordable Care  Act, the same one that John McCain saved in the first Trump Presidency,  would lose their coverage almost overnight. How would…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689510/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…elected  to do.\n\nYet, 2025 total receipts--receipts are tax collections. It is just  Ways and Means speak. We don't call them taxes. We call them receipts.  For this year, we gained 3.7 percent of our total receipts from customs  duties. Wonderful.\n\nWe can have a whole other presentation, debate, on its effect on the  economy, who actually pays it, whether…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…election cycle. There is no reason that  in every election cycle now, Mr. Speaker, you won't have States  redrawing district lines if they sense any sort of advantage can be  gained in the process.\n\nHowever, just in this round of what will apparently be a new  precedent of ongoing, rolling redistricting, you are going to see  millions of Americans across…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…can and must get this bill  through the Senate, as we discussed across the aisle, and signed into  law. It has been an honor to lead this effort, and I am humbled to have  gained cosponsors from well over a majority of the United States House  Republican Conference and 75 percent of the entire House of  Representatives.\n\nThis could not have been accomplished…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698841/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…minerals, often controlled by adversarial nations  that do not share our interests or our values.\n\nAmerican jobs were lost and supply chains weakened. Foreign  governments gained leverage over materials our economy and national  defense rely on every single day. That is the damage this Congress is  now working to reverse.\n\nEnergy security has been a…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…elections in the United States, supporting the police, and ensuring  that local jurisdictions aren't obstructing immigration enforcement.\n\nSimilar bills on these topics have gained support from some  Democrats. Instead of trying to belittle these issues or endlessly  debate H.R. 1 at every possible turn, they can stop and reflect about  their opposition…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…facility, relaying news and information to VOA  stations across the Pacific, including Hawaii, Okinawa, and the  Philippines.\n\nIn more recent history, the Delano Municipal Airport gained  distinction as the home of a squadron of Northrop P-61 Black Widow  aircraft--twin-engine fighters that played a key role in defending the  Pacific Coast during the war.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698436/recognizing-the-city-of-delano-california"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…of an Israel       reborn representing 4,000 years of Jewish experience and       persistence, to keep a balanced perspective. Israel's       monumental accomplishments and gained substantial power--      though still vulnerable--since its fragile 1948 establishment       in the Holocaust's consuming shadow are promising. However,       its internal…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690665/israel-at-77"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…without consent since November 2023 in a scheme where brokers and  agents are fraudulently enrolling individuals to collect commissions  and meet enrollment quotas. This broker gained unauthorized access to  his prescription records and replaced his legitimate employer-sponsored  insurance coverage at his pharmacy.\n\nI wish I could say that these examples…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698387/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…her favorite, but certainly I  was one of her favorites.\n\nThe interesting thing was, we couldn't gain weight, though. Despite  eating seconds and an active lifestyle, nobody gained weight. We were  all in a good weight area.\n\nAnd what did we eat? We ate real food. What did that real food look  like? Well, we had whole milk for breakfast and for lunch…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…a deep-rooted commitment  to community. He got his start on the shop floor of his family's  fabrication business, PennFab, where he worked side-by-side with his  father and gained not just a trade, but a calling. From the very  beginning, Mike understood that real leadership isn't about titles-- it's about responsibility: to your people, to your hometown,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690252/recognizing-michael-j-mabin-jr-50-years-of-life-leadership-and-service"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…or our adversaries, to  make sure we repatriate and keep that money in the U.S. and grow our  revenues. That is why, even with tax cuts, we don't see a dip in what  we have gained from revenue.\n\nWe can argue all day long, and you can even draw the graph: Should we  be spending a higher percentage of our GDP? Should we be collecting a  higher percentage…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…a historic  low, and poverty dropped to its lowest level in history.\n\nThe 2017 Trump tax cuts lowered tax rates for all Americans. In fact,  the lowest earning individuals gained the most benefit. The bottom 20  percent of earners, those with incomes up to $26,000, saw their Federal  tax rate fall to the lowest point in 40 years.\n\nEarnings under $100,000…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…and in books like ``Hill 875'' and ``Dak To.''\n\nAfter his military service, Tom graduated from Florida State  University College of Law, joined the Florida bar in 1971, and gained  courtroom experience as both a public defender and as assistant State's  attorney.\n\nIn 1995, he became a partner in the renowned law firm of Smith,  Anchors, and Remington,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691470/thanking-emergency-medical-services-personnel"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…potential, NASA established a pilot program in 2017  to assess how the agency could leverage commercial satellite data to  support mission objectives.\n\nThrough this effort, NASA gained valuable experience working directly  with the commercial sector. The agency evaluated available satellite  data, explored how it could advance scientific research and  applications,…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700115/accessing-satellite-capabilities-to-enable-new-discoveries-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…of financial inclusion  in the First Congressional District of Pennsylvania and across the  entire Commonwealth and beyond. Through her advocacy, countless  individuals have gained new opportunities to achieve financial  stability, education, and independence.\n\nMr. Speaker, I ask my colleagues in the United States House of  Representatives, to help me…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696273/recognizing-chief-executive-officer-of-trumark-credit-union-ms-kelly-botti"}]