[{"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…and nearly  all of them advanced in math, as well. Black and emergent bilingual  students, those who have historically faced the steepest barriers, made  some of the strongest gains.\n\nI had the opportunity to see this outstanding education model at work  when I toured Santee High School, one of the partnership's campuses. I  was impressed by the students…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695654/partnership-for-la-schools"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…go back to that, it is much  lower than it was prior to that time.\n\nWe will not raise taxes on any family earning less than $400,000. We  will restore the long-term capital gains rate to 28 percent, which is  actually lower than the previous rates.\n\nWe have much work ahead of us, and we intend to see that it gets  done.\n\nLet me be clear, as you heard…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…partners.\n\nJust at the time when this disease is closer than ever to being  eradicated, the risk of outbreaks is greatly increased. We must do all  in our power to protect the gains already made, and finish the job,  including appropriating the funds required.\n\nPeople from my generation remember the terrible consequences of  polio, often paralysis and…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699265/recognizing-the-scarsdale-forum"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…wants  peace but not as a result of what would be in effect a Putin-Russia  victory.\n\nWe want peace and not appeasement that would reward a brutal Russian  invasion with land gains that officially recognize Crimea as Russia,  with land gains that give de facto recognition to four other large  areas. In time, then Putin would recognize his ability to come…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690213/supporting-ukraines-independence"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…likelihood of  that happening. But a small business person can't take that risk.\n\nSo that is why, again, this short-term pain that the President keeps  talking about for long-term gains, well, honestly, in the short run,  these businesses are going--they are going under, the small businesses.  And there may be some posthumous indication of the President's…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…result       of the general state of the economy in the District of       Columbia.\n\nIn particular, personal income tax revenues are estimated       to be strong due to capital gains earnings by higher-income       households, and corporate tax revenues are expected to       increase due to strong growth in earnings by businesses that       have a presence…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699680/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…sold as innovative products without sufficient guardrails.  Instead, they caused millions of people to lose their jobs, their  homes, their savings, reversing and worsening any gains that had been  made in Black and Latino homeownership and wealth. The collapse of the  housing market during this time displaced approximately 10 million  Americans.\n\nAs Trump…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Dodgers.\n\nThis isn't just some faraway place to us. These are our friends and  neighbors. But yet, despite all of this incredible history of  friendship and booming economic gains because of all the back-and-forth  and travel, trips from Canada to the United States are down roughly 20  percent from last year. Towns in the United States are having to…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…energy costs.\n\nThe President claimed that his tariffs would help American  manufacturing, but instead we have lost 72,000 manufacturing jobs since  Liberation Day, after years of gains.\n\nWhat is the President focused on as working people struggle? He is  focused on building himself a new ballroom, naming the Kennedy Center  after himself, trying to take over…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699065/2025-economic-report-and-manufacturing-jobs"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…officer effectiveness or public safety.\n\nIn fact, none of the bills we have considered from the majority  during this law enforcement week would actually produce any measurable  gains in public safety.\n\nWe spent the week voting for bills that will do nothing really but  increase the number of weapons on our streets, our buses, our trains,  our subways, parks,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…all.\n\nThe dismantling, defunding, destaffing, restructuring of the  Department of Education is death by a thousand cuts. If we allow this  to continue, if we walk back all the gains we have made as a result of  IDEA, it will leave all our children behind.\n\nWe must not, cannot let this happen, and I assure you, all of us here  today on this floor will stand…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698942/protecting-education-for-children-with-disabilities"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the private sector, you would be fired  in a heartbeat, but that is the orthodoxy in today's Trump-Musk  Republican Party.\n\nLowering energy costs for consumers via efficiency gains used to be a  bipartisan issue. We made real progress on this in 1992 and again in  2005, but somewhere along the way, Republicans decided to become the  party of higher energy…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688293/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…that created the foundation of a  more inclusive society. The very principles of DEI stem from these  victories.\n\nWhen we attack diversity, equity, and inclusion, we erode the gains  made through blood, sweat, and tears from the marches in Selma to the  legislative victories in the sixties, seventies, eighties, nineties,  and beyond.\n\nTo push to eliminate…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…chose to downplay the deaths and encourage untested  treatments. This is dangerous. Americans will get sicker, and, in fact,  they already have.\n\nOur Nation has made incredible gains in IVF and infertility  treatment, raising the birth rate through IVF dramatically over the  last 30 years, but just last month, Secretary Kennedy fired the entire  team at…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691450/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Medicaid expansion supports better outcomes for all groups,       including children, older adults, and people with       disabilities.\n\nMedicaid expansion has driven coverage gains for parents,       which improves their access to care as well as [their]       overall well-being [the overall well-being] of their       children.\n\nStepping away from the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…exports raise energy prices for Americans by  reducing domestic supply. This claim is simply false. Increased export  opportunities incentivize production and drive efficiency gains, which  will help domestic prices continue to be affordable.\n\nGiven the abundance of economic and environmental benefits from LNG  exports, I believe it is critical that we…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697092/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…receipts. Look at this interesting spike here. That is  actually tax receipts. That is good.\n\nAlmost every dime we see on this chart of the real growth is actually  capital gains. It is those who have had assets. It is those who have  sold real estate. It is those who have sold stocks.\n\nThe tax receipts really coming in from labor are good. They are…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…need to be attended to.\n\nWe also recognize that there is a staggering backlog in BIA's probate  courts. This needs to be addressed, and we were able to make some  incremental gains in that area as well.\n\nSo there are many good provisions in the bill that add up to what I  think is a good bill. It is certainly not everything that I wanted.  They never…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…carried interest loophole, you might  call it, people whose primary income is derived from being entitled to  some of the money they make for their investors is taxed at capital  gains rates rather than regular rates.\n\nIn other words, people who are investing other people's money and  making, frequently, millions of dollars a year are taxed at a much  lower…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…across a wide range of academic indicators. These  include standardized assessments in English Language Arts, Mathematics,  Science, and Social Studies, as well as learning gains in English  Language Arts and Mathematics.\n\nAmong the most notable improvements were a 15 percent increase in  Algebra 1 proficiency, a 7 percent increase in English Language…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694185/recognizing-lake-county-schools-on-earning-an-a-rating-from-the-florida-department-of-education"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…to help you understand wages.\n\nLet's back up.\n\nTax receipts are up. Spending is up dramatically more, but most of  the tax receipts that we are gaining are almost all capital gains. So,  of the increased tax receipts, only about 5.5 percent of it is actually  the growth in wages. Almost 65 percent is capital gains because the  stock market has been doing…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…legislation to preserve stepped- up basis and to stop far-left Democrats' farm killer tax. For decades,  stepped-up basis has protected families from being forced to pay  capital gains taxes on inherited assets.\n\nPresident Biden tried his best to remove this provision, which would  have resulted in the destruction of family farms across my district and  around…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690715/help-small-businesses-thrive-again"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…comprehensive staffing assessment of the supply chain       and information technology modernization workforces of the       Department that includes--\n\n(A) monthly staffing gains and losses since October 1,       2022;\n\n(B) the current staffing level of each such workforce as of       the date of the enactment of this Act; and\n\n(C) an estimate of future…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695399/va-hospital-inventory-management-system-authorization-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…can go to the Manhattan Institute and read the  articles. It is from Democratic literature that if you take every tax  they have that they have scored: Raise tax on capital gains, raise tax  on income, raise tax on businesses, raise tax here.\n\nI am sorry for talking so fast. Believe it or not, I live on coffee,  and I need to apparently deal with my…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…now, President Trump obviously  is taking a new aggressive approach in order to level the playing field  and address supply chains that have put Americans at risk.\n\nBeyond the gains made in addressing the fentanyl crisis and outside  the scope of this emergency, the President's engagement has led to  significant gains for fairness throughout the global…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699963/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…health insurance plans. With the Democrats'  temporary COVID credits set to expire at the end of the year, they are  attempting to turn their policy failures into political gains using the  American people as collateral.\n\nIt is worth reiterating. Democrats funded temporary Band-Aids to  cover up unaffordable care. They set the expiration dates. They…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…are down to their lowest levels in 4 years. Stocks  were at near highs by the end of the year, with the S&P climbing by 17  percent in 2025.\n\nAll of this occurred before the gains of the Working Families Tax Cut  Act are realized, and we are just getting started.\n\nIt will take us a while to recover from the years of inflationary  policies of the Biden…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…to their neighborhoods, and tourists  feel secure, knowing law enforcement officers are empowered to do their  job and enforce the law.\n\nThe D.C. CRIMES Act ensures that the gains we have made are not  rolled back by more Democratic pro-crime policies. Republicans are the  party of safe cities. We are the party that stands with our police and  responds…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695560/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…What was done is, they took  all these tax proposals that the Democrats have proposed, the ones we  have scored, and then did the economic modeling.\n\nLet's raise the capital gains tax on rich people. We will take  wealthy people and we will raise their marginal income tax. We will  raise their estate taxes. All the things that we get in our townhalls…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…borrow 7.3 percent of the entire  economy. Our borrowing would equal 7.3 percent of the economy.\n\nEvery tax hike that we have scored that the Democrats have proposed,  capital gains, income tax, corporate taxes, the whole litany, when you  do the economic adjustment, it comes in at 1.5 percent, maybe 1.6, but  the math is easier, 1.5 percent of the economy.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}]