[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…service. Through these activities, students are given the opportunity  to learn about the jobs of the future and to tour nationally ranked  colleges and universities while gaining essential college and career  readiness skills.\n\nNext Level is known for its immersive summer experiences like Camp  Zion, but the organization is not limited to the summer…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693506/recognizing-macons-next-level-community-development-center"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…like  her, to be caught up in these partisan attacks is infuriating.\n\nThe administration claims to be doing this in the name of efficiency.  There is nothing efficient about gaining unauthorized access to private  data and then blindly firing 5,200 employees across multiple Agencies.  There is nothing competent about cutting the workforce without any…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688252/department-of-health-and-human-services"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…servicewomen and -men as they become veterans; that we will take care  of you just as you have taken care of us.\n\nBecause of this, I find it disheartening when I hear conversation  gaining speed about veterans not deserving the benefits provided to  them or of defrauding the compensation and pension system en masse:  Project 2025, The Economist, The Wall Street…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696762/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Israel would despise this level of punishment, this level of injustice  being perpetrated upon another country. Yet, we find today, under Mr.  Netanyahu's leadership, Israel is gaining a reputation as a pariah  country.\n\nMr. Speaker, to add insult to this grave injury, the United States of  America, by and through President Donald John Trump, is aiding and…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691156/speaking-truth-about-power"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…responsive to the American people. They  are clamoring, and they are crying out for help. We can help them with  passing five bills that meet their needs, and we can help them by  gaining control and focusing our ire and our anger over an agency that  is run, in my view, by incompetence, by lies, and by terror. That is  not who we are. Those are not the values…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…nongeostationary orbit satellites  as well as the authorization of U.S. Earth stations. Effectively, this  legislation will prevent entities identified as national security risks  from gaining a license or authorization to access the U.S. satellite  market. This is especially relevant given that the combined satellite  fleets of China and Russia have grown by about…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690258/secure-space-act-of-2025"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…a  Bachelor's in Ministry and a Master's in Theology.\n\nOverseer Carter began his ministry through the power of music. He  launched his career as a DJ in Brooklyn, New York, gaining recognition  as one of the best in the United States. His musical journey included  working at WJIZ, where he earned the title ``No. 1 Soul Wax Man,''  famously known as ``The…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…States,  with nearly $2.9 trillion annually in economic activity. The U.S. ranks  behind Spain and France in global competition for travel. China, India,  and Saudi Arabia are gaining on us. Our market share is 9.1 percent,  but we can generate 127 million new additional visitors over the next  decade and $478 billion in additional revenue, which translates…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691775/growing-travel-industry-jobs"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…doesn't make vaccines any less necessary.\n\nThe science is clear. Vaccines are safe, effective, and essential.  Every major medical association agrees, yet fringe ideologies are  gaining influence inside the very agencies charged with protecting our  health.\n\nMr. Speaker, I fear our children and grandchildren will bear the cost  of these reckless decisions.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695435/cdcs-dangerous-turn-on-vaccines"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…curriculum  standards and vetted by Westfield State University faculty.  Undergraduate students from the University's Department of  Communication serve as the production crew, gaining invaluable hands-on  experience in broadcast television under the guidance of seasoned  professionals. Many of these students have gone on to successful  careers in media,…", "date": "2026-01-23", "source_url": "https://justfacts.votesmart.org/public-statement/1699382/recognizing-the-65th-anniversary-season-of-as-schools-match-wits"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…Workforce Development Board and as Republican chair of the  Pennsylvania House Labor and Industry  Committee, I got to see how innovative ideas like these can improve  workplaces. Gaining experience and making contacts across departments  can enhance the efficiency and morale of the organization, helping them  to achieve their objectives.\n\nRotational programs…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696796/dhs-intelligence-rotational-assignment-program-and-law-enforcement-support-act"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…declaring independence from the U.S.S.R.  on October 18, 1991.\n\nNow, 36 years on from this tragedy, Azerbaijan can celebrate this as  the first year of sustained peace since gaining its independence. With  the assistance of the American President, the end of the Armenia- Azerbaijan conflict promises to be a turning point for the region.\n\nI ask my colleagues…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699195/recognizing-the-36th-anniversary-of-black-january"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…truth: A nation that unleashes the talent of its people will  never be left behind.\n\nFor too long, outdated regulations have stood in the way of our  brightest entrepreneurs gaining the capital that they need to build,  grow, and compete.\n\nThe INVEST Act changes that and opens the door for new investment. It  gives small businesses from rural America,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697830/increasing-investor-opportunities-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…more than just a performance. It is a glimpse  into the life of a professional musician. Over 8 weeks, Sorren  rehearsed and performed with the Pittsburgh Symphony Orchestra, gaining  valuable experience. This, no doubt, will shape his bright future in  music education and conducting.\n\nThrough his dedication to the Brookfield orchestra, the PMEA  festivals,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689957/recognizing-sorren-morelli"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…going on.\n\nLook, I am trying to help you understand wages.\n\nLet's back up.\n\nTax receipts are up. Spending is up dramatically more, but most of  the tax receipts that we are gaining are almost all capital gains. So,  of the increased tax receipts, only about 5.5 percent of it is actually  the growth in wages. Almost 65 percent is capital gains because…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…unprecedented insight into individual transactions and the  potential ability to control or limit access to personal funds.\n\nH.R. 1919 is about one thing: stopping the government from gaining  unchecked power over how Americans  conduct their financial lives. It ensures that if any form of digital  currency is ever created by the Federal Reserve, it must be debated,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…tariffs. That is no secret. I am in favor, however,  of robust engagement with our trading partners. Let me be very clear.  In trade, there is no stagnation. If we are not gaining ground, I think  we are losing ground, and data would show that.\n\nDuring the Biden administration, the President and this body were way  too passive on our trade agenda. Right…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699963/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…up on his  goal of playing in the NFL.\n\nLast year, he joined the St. Norbert College Green Knights football  team, where he had a standout season, scoring 13 touchdowns and gaining  over 1,000 receiving yards. His performance earned him First Team All- Conference honors.\n\nMitch's journey is a powerful reminder that we should never give up  on our dreams.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692195/recognizing-mitch-van-vooren"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "Mr. MEUSER. Mr. Speaker, the American economy is gaining momentum,  but the independent Federal Reserve is, regrettably, not adding the  energy needed to abet this growth potential.\n\nAfter 4 years of inflation caused by excessive…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692937/american-economy-gaining-momentum"}, {"senator": "French Hill", "party": "Republican", "sentence": "…housing       services, permanent housing placement, day care, nutritional       services, short-term payment for rent, mortgage, or utility       costs, and assistance in gaining access to Federal Government       and State and local government benefits and services.\n\n(iii) Operating costs, including maintenance, security,       operation, utilities,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Ruiz-Ortega, attempted to enter the bar. He was stopped  by Jimmy to be searched for contraband.\n\nJimmy identified a handgun. It led to a struggle, which resulted in  the suspect gaining control of it, firing it, and striking Jimmy at  least once. Jimmy medically died on the scene but was revived. It  struck him in the neck, leaving him with a spinal injury,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Bethune       were applying pressure on Bumpers and Pryor and that Bumpers       and Pryor were waiting on a compromise in the House. But, in       the ``air war'' Bethune was gaining ground. He obtained       endorsements from pro-business groups such as The Little Rock       Chamber, Mack McLarty, then Chair and the Arkansas Industrial       Development…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}]