[{"senator": "Jason Crow", "party": "Democrat", "sentence": "…of  gratitude to these officers who responded to the attack on the U.S.  Capitol on January 6, 2021.\n\nMany of my colleagues and I were trapped right up there in the House  gallery that day as an insurrectionist mob converged on the Capitol.  Officers from the Capitol Police, Metropolitan Police Department, and  numerous other departments risked their…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691167/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "Mr. CORREA. Mr. Speaker, let me first rise to welcome today our own  Anaheim Police Department officers seated in the gallery. Thank you,  gentlemen, for protecting our community. Thank you for being here.  Thank you for taking an interest in congressional affairs.\n\nMr. Speaker, I rise today to congratulate…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691173/congratulating-loris-griset-academy"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…across the country who have experienced violence and  exploitation, including Liz Stein and Jessica Michaels, both survivors  of Jeffrey Epstein's abuse. They are here in the gallery with us this  evening. I thank them for being here.\n\nJust this morning, House Democrats released more emails showing that  Trump knew more about Epstein's abuses than he previously…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696711/welcoming-the-honorable-adelita-s-grijalva-to-the-house-of-representatives"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…Milford is what is possible when communities believe in  themselves. Whether it is the thriving downtown storefronts, the  Riverwalk's beauty, or the vibrant art scene, including Gallery 37,  Milford is a town that is honoring its history while investing boldly  in its future. Make no mistake, that future is being built by and for  Milford's residents.\n\nWe…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692377/recognizing-milford-delaware"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…experience in the arts  and nonprofit sectors, he has worked tirelessly to bridge culture and  community. His career includes leadership roles as a Creative  Consultant and Gallery Director with organizations such as the  Rochester Brainery, Oxford Gallery, Memorial Art Gallery, and The Yards  Art Collective. Through these roles, Jason has fostered collaborations…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695841/recognizing-jason-barber"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…rising health insurance costs  and, in some cases, by more than $1,000 per month.\n\nMr. Speaker, I have an important announcement to make, and if there  is anybody in the press gallery listening, I want them to hear this. I  have called on Republicans to put country over politics, put country  over their party, to do the right thing for their constituents.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…chairwoman's address outlining every  component of the bills that we are considering, but for folks who are  watching, for those who have graced us with their presence in the  gallery, please understand the three bills: one regulating commercial  refrigerators; another regulating walk-in refrigerators; and the third,  a bill to give new responsibilities…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "…of the iconic women's suffrage statute which  resides in our Capitol rotunda to this day.\n\nAs an artist of 40 years and as someone who has actually started a  small museum gallery in my home State, I am very concerned about  museums. This museum also organized a traveling exhibition on women's  suffrage, launched a popular newsletter called ``A Different…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689365/womens-history-month"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…What is their training like?  What is the vetting? Is Secretary Noem recruiting January 6  insurrectionists?\n\nI was one of the last Members of Congress to escape the House gallery  on January 6. I remember hiding on my hands and knees and running  through the hallways to a safe room. Insurrectionists are not fit to  serve as law enforcement.\n\nI realize…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698951/impeach-secretary-noem"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…standard to these awnings, and injuries continue  to mount.\n\nIn 2023, Dr. Michael Hnat was the father of a former committee  Republican staffer, and I believe that she is in the gallery today with  her mother. Dr. Hnat was tragically killed as the result of an accident  involving a retractable awning. We must act to ensure that other  American families do…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692745/awning-safety-act-of-2025"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…our markup and to the floor today. We are  both original cosponsors of this resolution from the gentleman from  Florida, Mr. Donalds.\n\nH. Res. 137 will rename the House Press Gallery for an amazing  American, Frederick Douglass.\n\nMany know Douglass as an abolitionist and orator. Formerly enslaved,  he emancipated himself.\n\nYet many don't know Douglass…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692225/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…dark and pernicious that is  happening inside our government. I recognize there are only a handful  of my colleagues in the Chamber to hear that alarm and a few folks in  the gallery, but I pray that Americans writ large will hear it.\n\nGeorge Orwell in his famous book ``1984'' wrote of a time when ``The  party told you to reject the evidence of your eyes…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699746/it-is-time-for-the-corruption-to-end"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…thousands of children have been kidnapped. Trump disgracefully voted  yesterday with North Korea and Russia to blame the murdered, not the  murderer.\n\nTrump is joining a rogues' gallery of lesser dictators to deny  Putin's murderous invasion, his war crimes, and a demand that he return  occupied Ukrainian territory. Trump, ``the great appeaser,'' is joined…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688131/ukraine"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…German, but every single Senator knows him.  You see his face, and you smile. You  can always find him near the Chamber, working as a doorkeeper, at the  elevators, or up in the Gallery. No matter the role, he is  professional, warm, and a positive presence that makes the Senate come  to life.\n\nHe has been wonderful to our staffs, as well--kind, steady, and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…to co-chair the  caucus. We both know too many children who have died, but we know a lot  who we were able to get help for. We make a commitment to all the  families in the gallery, and those who we have not gotten to know, that  no matter where the gentleman is going, he and I are in this fight for  the rest of our lives. I thank him for all of his…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697278/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…first cruise ship  will dock in Southeast Alaska in less than 2 weeks, and thousands of  tourists from all over the world will come to our great State.\n\nAnyone watching in the Gallery, we would love to have you. Come to  Alaska.\n\nFor many of these tourists, this is going to be the trip of a  lifetime. For Alaskans, this is where we live every day. And our…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…SCRIPPS NEWS; Brady, Jon: WJLA-TV/NEWSCHANNEL 8.\n\nBrady, III., Leonard: NEXSTAR MEDIA GROUP; Bragale,       Charles: WRC-TV/NBC-4; Braggs, Robert: SENATE RADIO-TV       GALLERY; Bramstedt, Chandler: VENTANA PRODUCTIONS; Brand,       Natalie: CBS NEWS; Brandt, Hannah: NEXSTAR MEDIA GROUP;       Brandus, Paul: WEST WING REPORTS; Brangham, William:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…where it belongs. That  restoration of constitutional order was long overdue.\n\nI also bid hello and welcome to my friends from the Center for  Arizona Policy who are in the gallery today.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699374/roe-v-wade-anniversary"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…will get to the primary reason that I  asked for time on the floor today. I did want to say that, if it was  within the rules and I would be able to acknowledge people in the  Gallery who happen to be my great staff who have done extraordinary  casework for years and years, and they are visiting here--if it was  within the rules for me to recognize them--I…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…eighth-generation Texan who, for over  25 years, has served as the teaching pastor at Clear Creek Community  Church in the bay area of Houston.\n\nHe is joined today in the Chamber gallery by his lovely wife,  Jennefer. They are proud parents of my three nephews, Thatcher, Haddon,  and Beckett.\n\nMr. Speaker, I am eternally grateful for my brother's spiritual…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697518/welcoming-dr-yancey-c-arrington"}, {"senator": "Jim Banks", "party": "Republican", "sentence": "…Union speech that I have ever  heard. And it was especially special for me to have my younger  brother--10 years younger than I--Bradley Banks, from Columbia City, up  in the Gallery in the House to watch the State of the Union speech. He,  too, loves President Trump and what he stands for, and to have him be  my special guest was a special moment for…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700296/state-of-the-union-address"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…truth that  we must affirm here today: Every life, regardless of disability, has  value and potential.\n\nI am so pleased to announce that Charlotte is with us here today in  the gallery. I recognize you, Charlotte, and thank you for all that you  do.\n\nMr. Speaker, H.R. 1520 ensures that individuals with disabilities are  not discriminated against in organ…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692717/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…doctor, as a conservative, as an American, as a steward of the  Federal taxpayer--when I say Federal taxpayer, I mean you and me and  everybody watching and everyone in the Gallery--let's steward that  money correctly. I urge my colleagues to reject this resolution and  continue with bipartisan, important work to make healthcare more  affordable.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698998/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…Texas. These  are America's heroes, and they are heroes for the great State of Texas.\n\nNow, I would like to take a moment to recognize the Medal of Honor  recipients here in the Gallery: LTC William Swenson and COL Paris  Davis.\n\nIn just a moment, I will propound a unanimous consent request to take  up and pass H.R. 695, the House-passed version of the Medal…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696586/medal-of-honor-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…over 100 missing  in that part of our State.\n\nMr. Speaker, I ask for a moment of silence.\n\nMr. ROY. Mr. Speaker, if I may, there are some little girls from Camp  Mystic in the gallery, and I thank them for being here.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693607/mourning-the-loss-of-life-in-the-state-of-texas"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "Mr. MAST. Mr. Speaker, I could use my minute for a number of things,  but I think I am going to use it now to apologize to all of you in the  gallery.\n\nI am sorry. You just literally had to listen to somebody lying to all  of you directly.\n\nHow many times did she say the word ``billionaire''?\n\nHow many times did she say…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692528/rescissions-act-of-2025"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…that began at the very first  Congress in 1789.\n\nReverend Powell is the pastor of Westminster Presbyterian Church in  Lubbock, Texas, USA. He is joined today in the Chamber gallery by his  wife, Shannon Aycock Powell, and their three children: Lila, Charyssa,  and Adam; and his niece, Chloe.\n\nMy wife, Anne, and I have been blessed beyond measure to be…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695810/welcoming-rev-elliott-j-powell"}, {"senator": "Michael McCaul", "party": "Republican", "sentence": "…the Committee on Energy and  Commerce--I am not on the committee--who helped me get this bill done.  I also want to recognize the childhood cancer survivors who are in the  gallery today.\n\nWith 313 cosponsors, this bill has the most bipartisan support in  Congress, and that is because there is nothing political about a child  with cancer. There is nothing…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697274/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…for preserving tradition,  welcoming families and travelers, and contributing to the vibrant life  of southeast Georgia for 110 years.\n\nRecognizing the 50th Anniversary of Gallery 209 in Savannah\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to recognize and  congratulate Gallery 209, located at 209 East River Street in Savannah,  on celebrating…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698926/recognizing-riverview-hotels-110th-anniversary"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "Mr. DONALDS. Mr. Speaker, I rise today in strong support of H. Res.  137 to rename the House Press Gallery the Frederick Douglass Press  Gallery, in honor of a man whose life and work embodied the very best  of American ideals and shattered through glass ceilings.\n\nFrederick Douglass…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692222/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}]