[{"senator": "Emily Randall", "party": "Democrat", "sentence": "…costs are up across the board. Groceries  are more expensive. Housing is more expensive. Childcare is more  expensive. Gas prices are soaring. Today, the average price for a  gallon of gas in Washington State is over $4, one of the highest in the  Nation.\n\nHealthcare costs are only one aspect of why millions of Americans are  needlessly suffering under…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697420/republican-healthcare-crisis"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…who use LIHEAP  funding, they make about 150 percent of the poverty level, that is  about $23,000 a year. You know, the cost of home heating fuel is  between 3 and 4 bucks a gallon, right now. That help is essential.\n\nIn Vermont, around 26,000 people rely on LIHEAP to afford heat. And  by the way, for folks in the warm weather  parts of our country, it…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697111/low-income-home-energy-assistance-program"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Nation. I am very proud of that law and the work I  played over in the House authoring it.\n\nAnd the industry, they were able to do it. They were still stuck at  27 miles a gallon. That was the law from 1975. It was 2007, 32 years  later. They still couldn't figure out how to improve the efficiency of  the vehicles which we drive.\n\nMeanwhile, the Chinese…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…more or less, runs  this place right now, and it wants to sell more gasoline. So  California's Clean Air rules to make cars either be more efficient and  get more miles per gallon or become hybrid and be able to run back and  forth between gas and electric or be fully electric interfered with the  impulse of Big Oil to sell more gasoline and, of course,…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…being said.\n\nI ask my colleagues to make a list this week when they shop and jot  down the prices they pay. List the date.\n\nSpecifically note the price of a loaf of bread, a gallon of milk, a  gallon of orange juice, a box of cereal, a dozen eggs, and a package of  butter. Stop in any store. Note the price of a package of gym socks and  a tube of toothpaste.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695047/buckling-under-the-weight-of-rising-costs"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…markets as the Trump  tariffs traded away the value of their earnings. Meanwhile, the cost of  everything keeps rising. Where I live, the price of gas rose 75 cents  more a gallon than I paid a week before.\n\nI have heard from mothers worried their daughters and granddaughters  will lose their Medicaid coverage for mental health care and treatment.  God…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Massachusetts. Prices are not only high, but they are going  up even more because of Trump's reckless tariffs. Remember when Trump  bragged about how he would get gas down to $2 a gallon? It is $3 a  gallon down the street from my house.\n\nLet's keep going down the list. Trump said he would get drugs off our  streets and put criminals in jail. Give me a break.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…used to provide a liquidity bridge between much  shadier cryptocurrencies, the ones contemplated by the CLARITY Act.\n\nTo state the obvious, Mr. Speaker, no one will sell you a gallon of  milk for a Trump coin, but they will take dollars. Criminals need  stablecoins so they can make crypto crime pay.\n\nThe blockchain, of course, doesn't fix this because smart…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693618/crypto-used-by-criminals-and-corrupt-politicians"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…reduce  operations. In fact, the Golden State is expected to lose 17 percent of  its capacity in the next year. This has led to an average gasoline  price of nearly $5 per gallon, an increased fuel dependence on Asian  producers, and jeopardizing the fuel supply chain of military  installations in their State.\n\nWe must not let this become status quo…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…closing by April. That will  leave us just seven refineries to serve the State.\n\nCalifornians already pay the highest gasoline prices in the United  States, averaging $4.64 a gallon as of yesterday. The same gallon costs  only $2.56 in Oklahoma.\n\nWhen we lose these next two refineries, economists at UC Berkeley  predict Californians will be paying more…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697033/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…is not just cars that will be more expensive as a result of  tariffs; energy will be more expensive. Gas prices in some parts of the  country could see a 15- to 30-cent per-gallon increase in price.\n\nAccording to the National Association of Home Builders, the building  of a single-family home could become up to $10,000 more expensive. Why?  Because we…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…families can expect up  to $5,000 in savings. By unleashing American energy, we are bringing  relief to families right now.\n\nThe national average of gasoline is now under $3 a gallon. That  matters to everyone, from the large-scale shipping to the blue-collar  worker driving their daily commute.\n\nMr. Speaker, what we have done in 2025 is just the beginning.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699063/how-republicans-have-delivered-for-americans"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…State. Now, it is no mystery  why this is so: California has by far the highest gas tax in the  country, our cap-and-trade program adds a huge amount to the price of  each gallon, as well as the requirements of our fuel blend in  California.\n\nAll of these taxes and regulations combine to give California by far  the highest gas prices in the country…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…eliminated billions of  dollars of wasteful Washington spending, and we are seeing that the  pressure on prices is easing.\n\nFamilies in more than 40 States are paying less than $3 a gallon for  gasoline. In the Presiding Officer's State of Oklahoma and in my home  State of Wyoming, it is at $2 for gasoline right now.\n\nLower gas prices, as the Presiding Officer…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699081/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…business just no  longer viable.\n\nAll of these things together led researchers at USC to determine  that, by the end of next year, Californians could be paying an average  of $8 a gallon for gasoline.\n\nThe bill we passed today here in Congress, in the House of  Representatives, will help with this because, in addition to the data  collection that it requires…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…Republican House, and a Republican Senate, America is back.\n\nIt is a fact that inflation is down from 5 percent to 2.5 percent.  Gas prices have hit a 4-year low, averaging $2.95 a gallon. Advanced  manufacturing and industry are returning to U.S. soil.\n\nPresident Trump has secured over $8 trillion in investments that will  fuel job growth and create opportunity.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…dropped by 47 million barrels over the past 5 years, and  foreign imports now account for over 60 percent of our crude supply in  California.\n\nCalifornians pay nearly $5 a gallon. In fact, Californians are paying  the highest gas and electricity prices in the Nation, thanks to  Governor Gavin Newsom's radical-left failed energy policies. California…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697028/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…American families.\n\nOne of the clearest examples is what they did, believe it or not, to  our showers. They twisted the law to claim--you can't make this stuff  up--that the 2.5-gallon-per-minute standard applied to the entire  shower system instead of just each individual showerhead. You can't  make this stuff up. Quite frankly, I think they were all wet.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698565/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…Layla's proudest accomplishments was being a founding member  of Eagle Scout Troop 97G in New City. Her Eagle Project, completed  posthumously by Troop 97, transformed 10 55-gallon steel drums into  decorative trash cans for the town of Orangetown and earned her the  title of Eagle Scout after her final board of review in which she also  became a Life…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698769/recognizing-jim-monaghan"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…of School Board Chair Mari Tere Rojas, Vice  Chair Monica Colucci, and board members Roberto Alonso, Dr. Dorothy  Bendross-Mindingall, Mary Blanco, Danny Espino, Dr. Steve Gallon,  Joseph Geller, and Luisa Santos, along with Superintendent of Schools,  Dr. Jose Dotres, Miami-Dade has once again earned an A rating, the  largest district in Florida to…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696910/congratulating-st-theresa-catholic-school"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, Californians could soon be  paying over $8 a gallon for gasoline. That is the result of the  disastrous policies that have been imposed by Gavin Newsom and the  California Legislature's supermajority.\n\nThe most recent news is…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…annually. It would increase our domestic market access for corn farmers  and support viability for farmers, manufacturers, and our community.\n\nE15 clearly saves up to 30 cents per gallon. E15 provides higher  octane for better engine performance. E15 is vital for national  independence, especially in light of national conflicts.\n\nThe Nationwide Consumer and…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699304/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "James Risch", "party": "Republican", "sentence": "…International (MUM-Ti)(UPR) Air-to-      Air-to Ground Data Link Systems; twenty-four (24) MUM-Ti       (Ground) Air to Air to Ground Data Link Systems; twenty-four       (24) 100 gallon Internal Auxiliary Fuel Systems (IAFS);       twenty-four (24) 125 gallon Reduced Capacity Crashworthy       External Fuel Systems (RCEFS); two (2) IAFS Spares; two (2)…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699550/arms-sales-notification"}]