[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…financial benefits for  pharmaceutical companies without any transparency or congressional  authorization. That is why I am pleased that this bill includes a  requirement for the GAO to conduct a new study and report on the  effectiveness of the PRV program in achieving our original intent.\n\nLet us not overstate the impact of this bill, however. While we…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697277/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…missing or  incomplete information in accounts and hours-long wait times to reach  customer service. I, along with several colleagues, asked the  Government Accountability Office (GAO) to examine the implementation of  the new system. GAO found that FRTIB ``did not fully implement key  acquisition management practices . . . [which] significantly increased…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691138/introduction-of-the-federal-retirement-thrift-investment-board-inspector-general-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…fuel costs  through 2040.\n\nThese Republican resolutions would make the air dirtier, raise costs  for drivers, and also violate the law. The Government Accountability  Office (GAO) and the Senate Parliamentarian have already made it clear  that CAA waivers do not qualify as a target for a CRA. These decisions  are not rules subject to review, but House…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690603/house-republicans-senseless-attacks-on-public-health-and-our-environment"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…the  watchdog that is tasked with precisely that role.\n\nThe only plausible explanation is that the majority, and the  administration to which it is blindly loyal, is upset that GAO has  repeatedly found that the White House is stealing funds away from  taxpayers.\n\nThis conference takes place as our entire legislative branch of  government is being undermined.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 3428, a bill to direct the GAO  to review the three Mid-Atlantic River Basin Commissions and report on  the practices and Federal responsibilities of each commission.\n\nThe Mid-Atlantic River Basin Commissions…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695002/mid-atlantic-river-basin-commissions-review-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "Mr. Speaker, today we are considering H.R. 804, which would require  the SBA to close out the GAO recommendation ensuring that individuals  in rural areas where a disaster declaration has been made have full  access to assistance, including targeted outreach and marketing…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687927/rural-small-business-resilience-act"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…For 52 years, Gene Dodaro has served the American people as part of  the Government Accountability Office. During his 17-year tenure as head  of the agency, he has embodied GAO's core values of accountability,  integrity, and reliability, leading work that has resulted in more than  $1 trillion in taxpayer savings and other financial benefits. His…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698464/commending-the-honorable-gene-dodaro"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…The uncertainty underscores the need for investment in veteran-owned  small businesses.\n\nThe bill we are considering today would require the Government  Accountability Office, GAO, to conduct a study on the availability of  credit to veteran, service-disabled, and reserve-owned small  businesses.\n\nI commend Representatives Davids, Alford, and Conaway…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687886/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…requirements for the  Edith Nourse Rogers STEM Scholarship.\n\nThis scholarship has proven crucial to getting more veterans involved  in STEM fields, but feedback from veterans in a 2022 GAO report has  shown that current eligibility requirements are barriers for many of  our student veterans.\n\nThe Edith Nourse Rogers STEM Scholarship Opportunity Act would  address…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695426/edith-nourse-rogers-stem-scholarship-opportunity-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…2050 and increase premature  mortality, hospitalizations, and emergency room visits.\n\nThis resolution is a waste of our time because, as I have said on the  other two, both the GAO and the Senate Parliamentarian have concluded  that this waiver is not a rule and, therefore, cannot be revoked using  the Congressional Review Act. It is just another attempt…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690432/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Americans face unaffordable premiums,  and not the reason my friend the waitress at the restaurant is going to  face premiums she and her husband cannot afford.\n\nTo be sure, what the GAO found is unacceptable. But there are  proposals on the table that Democrats would support to crack down on  malicious brokers who fraudulently enroll customers. No excuse--that…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…misleading definition of ``reliable  generation,'' a definition that would only include coal, natural gas,  and nuclear power plants.\n\nWhile I would typically have no problem with a GAO report, I do have  a problem with Republicans pretending that fossil fuel generation is  perfect and that there is no room for clean, cheap energy in a  diversified grid.\n\nIn…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Transportation and the Federal  Highway Administration. I established the Congressional Quiet Rails  Caucus. I introduced a bill directing the Government Accountability  Office (GAO) to conduct a study on how to reduce train noise and  vibrations near homes. I separately requested GAO to conduct that  study, which it has agreed to do.\n\nI urge my colleagues…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696790/introduction-of-the-protecting-homes-from-trains-act-of-2025"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…questions of both sides, and the Parliamentarian,  our neutral referee, reached a decision.\n\nThat all took place here in the Senate--actually, over there in the  L.B.J. Room. The GAO was not even in the room when the arguments were  made. And that decision, the decision of the Parliamentarian, is what  is now at hand in what is about to happen here in the…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691447/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…today, I introduce the Government  Accountability Office District of Columbia Home Rule Act. This bill  would repeal the authority of the U.S. Government Accountability Office  (GAO) over the District of Columbia.\n\nGAO, a federal agency that conducts investigations and audits for  Congress, has the same authority over D.C. that it has over federal  agencies.…", "date": "2025-10-14", "source_url": "https://justfacts.votesmart.org/public-statement/1696213/introduction-of-the-government-accountability-office-district-of-columbia-home-rule-act"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…resolution simply sets a  budget framework so we can deal with the incredible fraud, waste, and  abuse in Medicaid to stabilize and preserve it for those who really  need it.\n\nGAO alone estimates that the fraud--", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688042/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…they  used these misguided resource management plans as their tool to do  that.\n\nMr. WESTERMAN. Mr. Speaker, as we wrap up today on this final RMP, I  include in the Record this GAO report that found that the RMP is  subject to the CRA.                                                    U.S. Government                                           Accountability…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "John Rose", "party": "Republican", "sentence": "…EFFECTIVE DATE.\n\nThis Act, and the amendments made by this Act, shall take       effect on the date that is 180 days after the date of       enactment of this Act.       SEC. 4. GAO STUDY.\n\n(a) In General.--The Comptroller General of the United       States shall carry out a study on the value of trigger leads       received by text message that includes…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692803/homebuyers-privacy-protection-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Protection of the National  Petroleum Reserve in Alaska final rule.\n\nIn March of this year, Alaska's congressional delegation requested  that  the Government Accountability Office, GAO, determine whether the 2022  NPR-A IAP ROD constituted a ``rule'' under the Congressional Review  Act, CRA. GAO issued its legal opinion in July, concluding that the  2022 NPR-A…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…providing for congressional       disapproval of BLM's 2024 Coastal Plain ROD (hereinafter       referred to as the 2024 ROD) and subsequent Government       Accountability Office (GAO) conclusion that such record of       decision is a rule.\n\nThese resolutions are necessary because the Biden       administration's 2024 ROD undermines responsible resource…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697510/sj-res-91-and-hj-res-131"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…management and oversight of software       entitlements and software built by Government agencies, as       identified through an analysis of agency plans.            SEC. 5. GAO REPORT.\n\nNot later than 3 years after the date of enactment of this       Act, the Comptroller General of the United States shall       submit to the Committee on Homeland Security…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698153/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…means.\n\nEven worse, the Government Accountability Office has confirmed what  Republicans have been warning for years: ObamaCare is riddled with  waste, fraud, and abuse. The GAO led a covert investigation by creating  fictitious ObamaCare applicants with fake documentation where 100  percent of those applicants were accepted and enrolled.\n\nGuess what?…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…veterans' benefits and VA  programs.\n\nThis bill addresses critical infrastructure needs for our men and  women in uniform. To address deficiencies in military barracks  identified by GAO and others, the bill includes a $75 million increase.  There is also a $75 million increase for child development centers on  military bases to improve the quality of life of…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692941/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Veteran       Institute for Procurement, Women Veteran Entrepreneurship       Training Program, and Veteran Women Igniting the Spirit of       Entrepreneurship.''.       SEC. 3. GAO REPORT ON ACCESS TO CREDIT.\n\n(a) Report on Access to Credit.--\n\n(1) In general.--Not later than 1 year after the date of       the enactment of this Act, the Comptroller General…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687890/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…dollar spent on R&D to improve our national security  should be safeguarded from foreign and domestic bad actors who seek to  do us harm.\n\nThis is why H.R. 901 also requires GAO to submit a report on how DHS  has complied with existing Federal guidance to safeguard these R&D  projects.\n\nI thank Chairman Green and all the members who have supported this…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688737/research-security-and-accountability-in-dhs-act"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…stating  its ``observation'' that the Biden EPA action approving California's EV  waiver is not a rule subject to the CRA. Similar to the Biden  administration's efforts, this GAO letter was obtained in an attempt to  stop the Senate from exercising its authority provided by the CRA,  keeping the California EV mandate in place without a vote in this…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…they can  retire--first, not second, behind social issues that bureaucrats have  decided is the primary goal.\n\nThis amendment requires the Government Accountability Office, the  GAO, to submit a report to Congress comparing brokerage window  investments in the context of defined contribution plans.\n\nThe GAO report will compare investment returns generated…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699155/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "…duplicative since their  inceptions.\n\nMy legislation then directs these river basin commissions to report  back annually on how they are complying with these recommendations. GAO  is the gold standard for Federal reports and has conducted numerous  reports and studies of government agencies. In fact, according to the  GAO, 75 percent of their recommendations…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695001/mid-atlantic-river-basin-commissions-review-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…going  to have a massive effect across the entire economy.\n\nThe second way is pretty straightforward. The Government  Accountability Office--you will hear it often referred to as GAO--in  2018, they came out and wrote their legal decision and said: It can  even be a big thing that costs $100 million across the government. I am  going to quote GAO in this,…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691634/congressional-review-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…doctor's exam room. Confronting VBM abuses is the central  focus of my bipartisan bill, the DOC Access Act, as well as multiple  active investigations in Congress and by the GAO, FTC, and others.\n\nMr. Speaker, I ask my colleagues to join me, along with patient and  consumer advocates like Patients Rising, the National Consumers League,  and the American…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693946/addressing-the-growing-abuses-of-vision-benefit-managers"}]