[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Senate--we gave them this job, and now we are accusing them of butting  in and interfering with our process? We gave them this job so they did  it.\n\nIt has been said that what GAO did was unprecedented in making this  decision that it is actually a waiver and not a rule. Yes, it is  unprecedented. It is unprecedented in the same way that a referee  blowing…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…courthouses, the GSA will be able to reduce construction costs and  ensure that existing spaces in courthouse complexes are being fully  utilized.\n\nOver the last 45 years, the GAO has compiled a large body of work on  Federal courthouse construction, much of it at the request of the House  Committee on Transportation and Infrastructure.\n\nGAO has found…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695379/courthouse-affordability-and-space-efficiency-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…fuel costs  through 2040.\n\nThese Republican resolutions would make the air dirtier, raise costs  for drivers, and also violate the law. The Government Accountability  Office (GAO) and the Senate Parliamentarian have already made it clear  that CAA waivers do not qualify as a target for a CRA. These decisions  are not rules subject to review, but House…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690603/house-republicans-senseless-attacks-on-public-health-and-our-environment"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…information each of the last several years, but this bill would codify  this requirement and apply it to all federal agencies.\n\nIn 2007, the Government Accountability Office (GAO) examined spending  on advertising contracts with minority-owned businesses by five federal  agencies--the Department of Defense, the Department of the Treasury,  the Department…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696333/introduction-of-the-federal-government-advertising-equity-accountability-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…the  watchdog that is tasked with precisely that role.\n\nThe only plausible explanation is that the majority, and the  administration to which it is blindly loyal, is upset that GAO has  repeatedly found that the White House is stealing funds away from  taxpayers.\n\nThis conference takes place as our entire legislative branch of  government is being undermined.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…The uncertainty underscores the need for investment in veteran-owned  small businesses.\n\nThe bill we are considering today would require the Government  Accountability Office, GAO, to conduct a study on the availability of  credit to veteran, service-disabled, and reserve-owned small  businesses.\n\nI commend Representatives Davids, Alford, and Conaway…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687886/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…For 52 years, Gene Dodaro has served the American people as part of  the Government Accountability Office. During his 17-year tenure as head  of the agency, he has embodied GAO's core values of accountability,  integrity, and reliability, leading work that has resulted in more than  $1 trillion in taxpayer savings and other financial benefits. His…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698464/commending-the-honorable-gene-dodaro"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "Mr. Speaker, today we are considering H.R. 804, which would require  the SBA to close out the GAO recommendation ensuring that individuals  in rural areas where a disaster declaration has been made have full  access to assistance, including targeted outreach and marketing…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687927/rural-small-business-resilience-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…years ago with several regional banks, and regulators respond  by using systemic risk tools, that Congress and the American people  promptly receive detailed information from GAO and others on what went  wrong and what should be done to promptly fix it.\n\nThis bill is supported by Americans for Financial Reform and Public  Citizen.\n\nMr. Speaker, I urge…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697287/systemic-risk-authority-transparency-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…misleading definition of ``reliable  generation,'' a definition that would only include coal, natural gas,  and nuclear power plants.\n\nWhile I would typically have no problem with a GAO report, I do have  a problem with Republicans pretending that fossil fuel generation is  perfect and that there is no room for clean, cheap energy in a  diversified grid.\n\nIn…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…financial benefits for  pharmaceutical companies without any transparency or congressional  authorization. That is why I am pleased that this bill includes a  requirement for the GAO to conduct a new study and report on the  effectiveness of the PRV program in achieving our original intent.\n\nLet us not overstate the impact of this bill, however. While we…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697277/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Americans face unaffordable premiums,  and not the reason my friend the waitress at the restaurant is going to  face premiums she and her husband cannot afford.\n\nTo be sure, what the GAO found is unacceptable. But there are  proposals on the table that Democrats would support to crack down on  malicious brokers who fraudulently enroll customers. No excuse--that…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…2050 and increase premature  mortality, hospitalizations, and emergency room visits.\n\nThis resolution is a waste of our time because, as I have said on the  other two, both the GAO and the Senate Parliamentarian have concluded  that this waiver is not a rule and, therefore, cannot be revoked using  the Congressional Review Act. It is just another attempt…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690432/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…today, I introduce the Government  Accountability Office District of Columbia Home Rule Act. This bill  would repeal the authority of the U.S. Government Accountability Office  (GAO) over the District of Columbia.\n\nGAO, a federal agency that conducts investigations and audits for  Congress, has the same authority over D.C. that it has over federal  agencies.…", "date": "2025-10-14", "source_url": "https://justfacts.votesmart.org/public-statement/1696213/introduction-of-the-government-accountability-office-district-of-columbia-home-rule-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…what to read.\n\nToday, we are failing our public schools because we are not investing  in them. For example, the average age of our public school facilities  is 49 years. The GAO found that over half of our school districts in  our country needed to replace or update major systems in more than half  of their buildings.\n\nAs a nation, we should commit…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…resolution simply sets a  budget framework so we can deal with the incredible fraud, waste, and  abuse in Medicaid to stabilize and preserve it for those who really  need it.\n\nGAO alone estimates that the fraud--", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688042/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…they  used these misguided resource management plans as their tool to do  that.\n\nMr. WESTERMAN. Mr. Speaker, as we wrap up today on this final RMP, I  include in the Record this GAO report that found that the RMP is  subject to the CRA.                                                    U.S. Government                                           Accountability…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…taxpayer dollars that are lost  through improper payments. These are payments that go to the wrong  person or that maybe exceed the correct amount. Since fiscal year 2003,  the GAO estimates that the Federal Government has lost $2.8 trillion to  improper payments.\n\nSo you have to say ``Where is the money going?'' when you look at  these numbers. According…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699102/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Veteran       Institute for Procurement, Women Veteran Entrepreneurship       Training Program, and Veteran Women Igniting the Spirit of       Entrepreneurship.''.       SEC. 3. GAO REPORT ON ACCESS TO CREDIT.\n\n(a) Report on Access to Credit.--\n\n(1) In general.--Not later than 1 year after the date of       the enactment of this Act, the Comptroller General…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687890/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Protection of the National  Petroleum Reserve in Alaska final rule.\n\nIn March of this year, Alaska's congressional delegation requested  that  the Government Accountability Office, GAO, determine whether the 2022  NPR-A IAP ROD constituted a ``rule'' under the Congressional Review  Act, CRA. GAO issued its legal opinion in July, concluding that the  2022 NPR-A…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…suppose all they know how to do is prop up a failed program that is  littered with waste, fraud, and abuse, like cancerous lesions.\n\nDon't take my word for it. Just look at the GAO report: Its estimates  show millions of improper enrollments, costing American taxpayers up to  $27 billion annually. One Social Security number used for 26,000 days  of coverage,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698305/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…visited May 1, 2025).\n\n2. Letter from Senator John Hoeven, Senator Kevin Cramer,       and Representative Julie Fedorchak to Comptroller General       (Feb. 14, 2025).\n\n3. GAO, GAO's Protocols for Legal Decisions and Opinions,       GAO-24-107329 (Washington, D.C.: Feb. 2024), available at       https://www.gao.gov/products/gao-24-107329.\n\n4. Letter…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693059/us-government-accountability-office-legal-opinion"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…regulations,       including the reasons that the Administrator has failed to       issue or revise such regulations within the period required       under such subparagraph.\n\n(b) GAO Review and Report.--Not later than the date that is       2 years after the date of enactment of this section, the       Comptroller General of the United States shall--\n\n(1)…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…dollar spent on R&D to improve our national security  should be safeguarded from foreign and domestic bad actors who seek to  do us harm.\n\nThis is why H.R. 901 also requires GAO to submit a report on how DHS  has complied with existing Federal guidance to safeguard these R&D  projects.\n\nI thank Chairman Green and all the members who have supported this…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688737/research-security-and-accountability-in-dhs-act"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…management and oversight of software       entitlements and software built by Government agencies, as       identified through an analysis of agency plans.            SEC. 5. GAO REPORT.\n\nNot later than 3 years after the date of enactment of this       Act, the Comptroller General of the United States shall       submit to the Committee on Homeland Security…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698153/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…contained in the       report of the Comptroller General of the United States titled       ``IT MODERNIZATION: SBA Urgently       Needs to Address Risks on Newly Deployed System'' (GAO-25-      106963; published November 6, 2024).\n\n(b) Implementation Plan.--Not later than 180 days after the       date of the enactment of this Act, the Administrator shall…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697273/sba-it-modernization-reporting-act"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…2. Letter from Senator Steve Daines, Senator Tim Sheehy,       Representative Troy Downing, and Representative Ryan K. Zinke       to Comptroller General (Feb. 14, 2025).\n\n3. GAO, GAO's Protocols for Legal Decisions and Opinions,       GAO-24-107329 (Washington, D.C.: Feb. 21, 2024), available at       https://www.gao.gov/products/gao-24-107329.\n\n4.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693085/us-government-accountability-office-legal-opinion"}, {"senator": "John Rose", "party": "Republican", "sentence": "…EFFECTIVE DATE.\n\nThis Act, and the amendments made by this Act, shall take       effect on the date that is 180 days after the date of       enactment of this Act.       SEC. 4. GAO STUDY.\n\n(a) In General.--The Comptroller General of the United       States shall carry out a study on the value of trigger leads       received by text message that includes…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692803/homebuyers-privacy-protection-act"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…they can  retire--first, not second, behind social issues that bureaucrats have  decided is the primary goal.\n\nThis amendment requires the Government Accountability Office, the  GAO, to submit a report to Congress comparing brokerage window  investments in the context of defined contribution plans.\n\nThe GAO report will compare investment returns generated…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699155/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…as  protective security officers.\n\nDespite the size and importance of the FPS' mission, serious  vulnerabilities exist in its oversight of contract guards. For example,  one GAO investigation found that contracted guards failed to detect  concealed weapons, including batons and pepper spray, in half of covert  security tests. While FPS uses covert testing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695058/personnel-oversight-and-shift-tracking-act-of-2025"}]