[{"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "Ms. HOULAHAN. Mr. Speaker, I rise today to honor Mr. Paul Redman, the  visionary leader behind the world-renowned Longwood Gardens, which is a  fixture of my community in the Philadelphia area.\n\nSince 2006, Paul's masterful leadership has helped Longwood navigate  modernization, a global pandemic, and…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691475/recognizing-paul-redman"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…themselves where the lights keep going off and Russia  makes it hard for people.\n\nYou can send seed, Mr. Speaker, so that it is easier for people to be  able to plant in their gardens. They are very thrifty and practical  people. They are educated. Many of the Ukrainians I meet speak several  languages. They want to meet the world. They don't want to be…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…dedicated to inspiring a love of  gardening, advancing civic beautification and championing environmental  stewardship.\n\nIts members have transformed public spaces--such as the gardens at  the Ramsay House Visitor Center and Gadsby's Tavern in Alexandria--into  vibrant, welcoming places for all to enjoy. They have educated  generations on the importance…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697252/recognizing-the-garden-club-of-alexandrias-centennial"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…to its roots as an  employee-owned company.\n\nIn addition, Applewood Seed has evolved into a company dedicated to  innovation within its field with research and development gardens, an  extensive network of seed growers, and a state-of-the-art seed testing  laboratory. They use new methods and human ingenuity to continue to  create custom seed blends…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695842/recognizing-applewood-seed-company"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…constituent who lives in my district  in Brooklyn, a woman who wants to work, who does work, and who  contributes to her community every single day.\n\nDenise, of Prospect Lefferts Gardens, is self-employed. She is a  graphic designer. She also lives with lupus, a serious autoimmune  condition that requires consistent care and access to specialists. The  only…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to honor a remarkable  constituent from my district, Mr. Tom Hebel, proprietor of Bucks  Country Gardens in Doylestown, Pennsylvania--a business that has, for  more than six decades, helped beautify homes and enrich communities  throughout Bucks County and beyond.\n\nFounded in…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696583/recognizing-bucks-country-gardens-president-tom-hebels-retirement-after-years-of-service"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…life--shaping her values and  offering strength and clarity through life's many trials and triumphs.\n\nToday, Helen enjoys her daily walks and gathering flowers from the  community gardens to create beautiful floral arrangements for her  suite. A woman of few words, Helen loves sipping a good, hot cup of tea  while reminiscing on her past. Helen's ideal way…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694743/recognizing-helen-birkheads-100th-birthday"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…are no special elevators.       They are old elevators that have been there. There are no new       water features. There are no beehives and there are no roof       terrace gardens. All of the sort of inflammatory things that       the media carried are either not in the current plan or are       simply inaccurate.                       Hearing Topics…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…children. His impact is visible across the school's campus in the  Savannah community, serving as director of the Coastal Ecology Camp and  caretaker to various campus educational gardens.\n\nBeyond Country Day, Mr. Eswine has been recognized as Teacher of the  Year and honored by organizations such as Garden Club of America, the  Georgia Independent School Association,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699709/retirement-of-judge-ronnie-fender"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…the Haverstraw Fire Department Relief Hose Company No. 3 for 60 years,  serving as fire chief.\n\nTony was an avid gardener and fisherman, built his own boat, and ran  Rainbow Gardens, known locally for its tomatoes.\n\nA devoted husband, father, grandfather, and great-grandfather, Tony  shared 66 years of wonderful marriage with his beloved wife, Joan.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699118/recognizing-and-thanking-nate-soule"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…through their Chief, Big Elk,  who welcomed the pioneers, understanding the trouble they had recently  escaped. The pioneers would stay in residence, building houses,  planting gardens and fields, and then move on after 2 years to ensure  all of their number had enough time and resources to make the trip  West. Afterwards, the improvements would belong to…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694022/july-24th-utahs-state-holiday"}]