[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…healthcare affordability or finding other ways to reduce the cost of  living.\n\nBut this administration has opened up all drilling all over the  United States for oil and gas production, and yet it isn't much higher  than the record levels that were achieved during the Biden  administration. That is even after the Big Beautiful Bill gave nearly  $6 billion…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697560/hj-res-131"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…this, we are going to have to pass bipartisan  legislation to do the same thing to ensure that the industry standards  provide for the cleanest, most efficient natural gas production.\n\nIndustry and ratepayers have asked us for certainty, consistency, and  an assurance that America will remain a global leader in energy  production and resilience. The…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688174/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…use the phrase ``wildlife refuge.'' They will call it the  1002 area. They will call it ANWR. It sounds like someplace in the  Middle East that you would expect oil and gas production.\n\nThey don't want us to pay attention to how crazy a prospect  developing one of our last remaining untouched landscapes is.\n\nThe Arctic Refuge provides subsistence fish…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697413/9999"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…it is harmful is just nonsense.\n\nMr. Speaker, I have a lot of respect for the gentleman from Texas,  and he described once for me his district, Midland, and the oil and gas  production there.\n\nI must stress, I actually did spend a lot of time talking to the  industry when we were putting this methane emissions program together.  I can speak firsthand…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…when it grows, it grows  for everybody, not just the people at the very top--because we have got  good energy jobs that are concerned with the production of oil and gas  and the production of all those other forms of energy.\n\nBy the way, just on that point--and I will be brief here because I  know my colleague from Massachusetts wants to speak. On that…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688166/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…of our allies.\n\nUnfortunately, over the last 4 years, energy policy has stalled the  necessary development of pipelines and export facilities. This has  hindered natural gas production and prevented us from fully realizing  the benefit of this critical resource.\n\nThe United States' ample energy resources are a distinct advantage  over our global competitors.…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696753/improving-domestic-energy-market"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…35, the Congressional Review Act (CRA)       resolution to repeal the Environmental Protection Agency's       (EPA) rule establishing a methane fee for oil and natural gas       production, processing, transmission, and storage. This fee       will increase costs for energy producers, which will be       passed on to families and small businesses. A vote…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…taken us from energy desperate under the previous administration to  energy dominant again.\n\nHe declared a national energy emergency. He unleashed record oil and  natural gas production. He reopened millions of acres for responsible  energy development, and he rolled back radical regulations that were  driving up costs.\n\nPresident Trump, in Kentucky, thank…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…continue to  increase production.\n\nNatural gas is an affordable, reliable, and clean source of energy  vital to our country and our economy. We should be expanding natural  gas production, not restricting it. Instead, the natural gas tax will  constrain American natural gas production, leading to increased energy  prices and providing a boost to the production…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688160/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…potential of the  1.57-million-acre Coastal Plain, a designated area of ANWR that held  great promise of oil and gas resources. However, section 1003  prohibited oil and gas production or leasing in ANWR unless authorized  by an Act of Congress.\n\nOver the following years, DOI completed assessments of the area's oil  and gas potential and recommended that…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…Today, the United States is the world's largest oil and gas producer,  and at the same time, we have also led the world in emissions  reductions\n\nSince 1990, U.S. natural gas production has doubled--this is an  interesting stat. Since 1990, U.S. natural gas production has doubled;  yet at the same time, we have reduced total emissions by 20 percent-- double…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688157/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…12,000 jobs in North  Dakota just in the coal industry alone.\n\nThis CRA is also crucial to prevent an estimated loss of $34 million  annually in State revenues from oil and gas production. These funds are  used to finance K-12 public education in the State.\n\nWhat does this mean for children in North Dakota? Failing to pass  this CRA could result in a $441…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…WESTERMAN.  Res. 131.\n\nMr. Speaker, I rise today in support of H.J. Res. 131 which would  repeal a Biden administration-era Record of Decision, ROD, restricting  oil and gas production on 1.16 million acres within the 10-02 area of  the Arctic National Wildlife Refuge, also known as ANWR.\n\nThe 10-02 area of ANWR was specifically set aside by Congress…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696830/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…the Utica and Marcellus shale  formations, where natural gas development has transformed local  economies and strengthened our Nation's energy security. Boosting  natural gas production in Ohio and expanding LNG exports are essential  to our vision of energy dominance.\n\nUnder the last administration, President Biden repeatedly undermined  the domestic…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697093/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…across the aisle  filed. They wanted to rename the Gulf the gulf of ignorance. Now, I  don't know where they came up with that one. I know they oppose  offshore oil and gas production. I know they oppose American energy  independence. I know they have a special affinity for fish that aren't  in the Gulf and attack recreational fishermen in their endeavor…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…Dakota resource management plan  ignores that record of responsible energy development. Instead, the  North Dakota resource management plan seeks to curtail coal, oil, and  gas production by locking away taxpayer-owned energy reserves and  jeopardizing our Nation's energy security.\n\nUnder this plan, nearly 213,000 acres--or 45 percent--of Federal oil  and…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696141/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…EZELL. Mr. Speaker, I rise today in favor of S.J. Res. 11, a  Congressional Review Act to reverse the Bureau of Ocean Energy  Management, or BOEM, rule that targeted oil and gas production in our  Outer Continental Shelf.\n\nThe Biden administration spent the last 4 years steamrolling our  American energy sector with burdensome regulations. Instead of  unleashing…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688631/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…roughly 330,000  jobs.''\n\nAnd those job losses will not be confined to California, but they  will be spread all across the Nation. Workers in auto manufacturing,  oil and gas production, and the agriculture sectors across this country  would lose jobs because of California's EV mandate.\n\nAnd the elected officials who represent Michigan autoworkers,  Nebraska…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the State of Alaska.\n\nRevenue from developing these resources is essential to the  livelihoods of all Alaskans. For example, in fiscal year 2022, Alaskan  oil and natural gas production, largely driven by the consequences of  the pro-energy policies of the first Trump administration, generated  $4.5 billion in State and local revenue and supported over…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…energy hits American families who use the energy  to heat their homes. It was mandated by the Democrats' reckless tax- and-spending bill. The Democrat tax penalizes oil and gas production in  America, and in doing so, it punishes American families.\n\nThe golden age of American energy is the foundation of our golden age  for America. It is linked directly…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688189/energy"}]