[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…enough.\n\nMr. Speaker, I urge a ``no'' vote on the rule, and I reserve the  balance of my time.\n\nI will correct the Record on something. Donald Trump promised he  would lower gas prices to $2 a gallon. I just did Google maps and  looked at the price of gas in the gentleman's district. It is like  $2.80. That is a far cry from $2.\n\nMr. Speaker, if we defeat…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Republican  colleagues know this was a good agreement that would have helped  people. It included provisions to lower prescription drug prices, crack  down on junk fees, lower gas prices, ensure our water is safe to drink,  and fund community health centers and teaching health centers. Instead,  Speaker Johnson chose to cave to Elon Musk.\n\nThough it may be…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690270/american-music-tourism-act-of-2025"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…living on Main Streets  and in our barrios. He is not even trying to hide it anymore.\n\nMeanwhile, utility bills are surging; electric bills are up 13  percent; and residential gas prices are up nearly 60 percent. This  administration canceled clean energy projects that could have powered  13 million homes, destroying 165,000 jobs in the process.\n\nBehind every…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699586/stop-the-republican-affordability-crisis"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…context of this bill.\n\nThe bottom line is that electricity prices are up 13 percent  nationwide just since President Trump took office--I already mentioned  that--and natural gas prices are up 8 percent nationwide since a year  ago, 14 percent in my home State of New Jersey, in part due to  increased exports of liquefied natural gas. Both of these figures…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…natural gas producers say they will struggle to meet LNG       growth demand.\n\nPrices are already increasing. The November 13, 2025 Wall       Street Journal story ``Natural Gas Prices Hit Highest Level       Since Invasion of Ukraine'' reported that natural gas prices       reached their highest levels since December 2022, with       December futures settling…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…and lower consumer prices.\n\nWe must act now to fix our outdated electric grid to bring more  renewable energy sources online. This will make us less reliant on  natural gas prices that fluctuate.\n\nThis week, the majority brought bills before this House, claiming to  save Americans money on utility bills. These bills did nothing to  update our electric…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698098/functioning-in-the-face-of-an-affordability-crisis"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…levels of methane. Typically, the more methane a company leaks during  drilling, the more these companies will have to charge for the methane  they do deliver and the more gas prices will go up for families and  businesses.\n\nThe oil companies, they don't believe in what our economists call  externalities. They think they can just throw methane into the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688145/methane"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…I talk with constituents, I  hear the same thing: Life is getting more and more expensive.\n\nPeople are worried about making rent, paying for groceries, and  dealing with gas prices that keep on climbing.\n\nIn just the past couple of weeks, we have received more proof of what  our constituents are telling us. According to a recent report,  California…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699583/stop-the-republican-affordability-crisis"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…causing  them to soar with their backward policies and their war on cheaper,  cleaner energy. Since Trump took office, electricity prices are up 13  percent, and natural gas prices are up 8 percent. They simply don't  care. They would rather continue to push bills like this that will make  the affordability crisis even worse.\n\nMr. PALLONE. Madam Speaker,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…down, starting on day one.''\n\n``Grocery prices will come tumbling down,'' he said, when he gets  elected.\n\nInstead, what has happened? Inflation has gone not down but up. Gas  prices were 2 percent up from the previous month. Chicken, pork, beef-- all more expensive. Eggs, 15 percent higher than last month.\n\nAnd what is Donald Trump's solution to all…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…produce  record oil and gas volumes elsewhere at a far lower cost to taxpayers,  including in my district, the Permian Basin.\n\nLet's be clear, Arctic drilling will not lower gas prices. With no  existing roads, pipelines, or infrastructure, any Arctic oil would take  years to reach the market, if it ever does.\n\nI know this myself because this is a picture…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696880/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…for America. That assumption is not only  irresponsible, but it is also dangerous and absolutely false.\n\nAnalyses have shown that increasing LNG exports drives up natural gas  prices here at home. DOE's own review last year could not have been  clearer: Unconstrained LNG exports will raise costs for American  families and harm our economy.\n\nDOE found…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697083/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…for healthcare coverage.\n\nUnder this administration, costs are up across the board. Groceries  are more expensive. Housing is more expensive. Childcare is more  expensive. Gas prices are soaring. Today, the average price for a  gallon of gas in Washington State is over $4, one of the highest in the  Nation.\n\nHealthcare costs are only one aspect of why…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697420/republican-healthcare-crisis"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…prices here at home. If my  colleagues don't believe me, last year the Secretary of Energy noted:  ``Unfettered exports of LNG would increase wholesale domestic natural  gas prices by over 30 percent.''\n\nMr. Speaker, if you are a Republican who perhaps didn't trust the  Democratic Department of Energy, I would certainly assume you could  trust your…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…energy projects on private lands.\n\nIn March, as part of his tariff war, he imposed a 10 percent tax on  energy imported from Canada, hitting Midwestern States with higher gas  prices.\n\nIn April, the Trump administration abruptly fired the entire staff  overseeing the low-income Home Energy Assistance Program, which helps  working families afford their…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697027/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…these jobs came back to my home State of Indiana,  like the announcement from General Motors about increasing its  production in the Fort Wayne truck plant.\n\nHe has brought gas prices to their lowest point since 2021 by  unleashing American energy independence.\n\nOutside of the economic impacts that have saved money for everyday  Americans, President Trump…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694059/six-months-of-america-first-leadership"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…ahead  with the imposition of its new so-called low-carbon fuel standard to  take effect in July.\n\nThe board has refused to even say what impact this is going to have  on gas prices, but studies have shown that it could increase gas prices  in California by another 85 cents per gallon.\n\nLet's just consider where we are right now. In California, the price…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691570/public-lands-management"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…are paying less than $3 a gallon for  gasoline. In the Presiding Officer's State of Oklahoma and in my home  State of Wyoming, it is at $2 for gasoline right now.\n\nLower gas prices, as the Presiding Officer knows, impact everything  that a family does. It impacts everything in the country: the cost of  groceries, the cost of commuting to work, or keeping…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699081/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…Doughnuts, the forgotten  worker.\n\nThis is why Donald Trump was elected. We care about the forgotten  worker. We are going to fix healthcare. We are going to fix  affordability. Gas prices are already coming down. Grocery prices are  coming down. Wait until that tax cut hits in 2026.\n\nMr. Speaker, I urge support of H.R. 4593 and so should you.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698567/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…in the public  interest.\n\nPlus, the vast majority of studies show that not only do LNG exports  boost our energy security but they also help maintain low domestic  natural gas prices for Americans.\n\nThe Biden-Harris administration's action not only jeopardized our  European allies but it threatened the faith and credibility of American  companies' contracts.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697089/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…one of you . . . and you were meant to be here''.\n\n(7) The tournament occurred at a time when the United       States was struggling with rampant stagflation, high gas       prices, hostages held in Iran, and increased tensions with       the Soviet Union whose invasion of Afghanistan led to the       boycott of the 1980 Summer Olympics.\n\n(8) The…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690279/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…basic gist of it is to do exactly the opposite of what California  has done. Newsom says the numbers speak for themselves. Here are the  numbers:\n\nCalifornia has the highest gas prices in the entire country, number  one out of all 50 States. It is not even close. You can drive a few  miles from here in Maryland, which is another blue State, by the way,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…dominance first.  Under President Trump's first administration, America achieved energy  freedom for the first time in 40 years. We were producing more than we  consumed. Gas prices were low and families were thriving.\n\nThat all changed the day Joe Biden walked into the Oval Office.  President Biden waged an all-out assault on American energy. He shut…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…moving in the right direction. Those folks who earned tips or  overtime, people who earned Social Security, and families who worked  hard after being hard-hit by higher gas prices, rent prices, and food  prices are being helped in this bill.\n\nThis is what the American Dream is all about, looking to Washington,  D.C., and finally seeing a Washington, D.C.,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692814/elections-matter"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…same time  last year. Core inflation is at 2.6 percent, the lowest we have seen in  4 years.\n\nRents are falling month after month, and shelter inflation is at a 4- year low. Gas prices are down to their lowest levels in 4 years. Stocks  were at near highs by the end of the year, with the S&P climbing by 17  percent in 2025.\n\nAll of this occurred before…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Under this bill, the tax rate will be  37 percent.\n\nWhen you look at the actual tax cut package to those folks who are  hardest hit with high food prices, rent prices, and gas prices and are  now, finally, getting relief, let alone families who are enjoying the  largest tax cut in American history with this package, it is smart  policy to reward those…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692334/election-promises-made-promises-kept"}, {"senator": "John Rose", "party": "Republican", "sentence": "…its Covington, Tennessee, plant.  Schneider Electric has announced plans to expand their footprint in  middle Tennessee in the coming months.\n\nThanks to President Trump, gas prices are down and optimism is up.  Candidly, this White House has been able to accomplish more positive  results in 14 weeks than the last administration did in 4 years, and…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690428/the-first-100-days"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…about 20 percent of  California's in-State gasoline supply.\n\nAccording to a recent study by USC Professor Michael Mische, the  effect of this is going to be an increase in gas prices in California  of up to 75 percent by April of 2026. The projections estimate a 33.6  percent increase just by April of 2025. By next year, 2026, we could  see prices rising…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…America is once again protecting our citizens.\n\nToday, our communities are safer, and the economic turnaround has  been equally dramatic. America's energy dominance is back. Gas prices  have dropped to the lowest point in 4 years. AAA reports prices are  expected to continue to fall and perhaps stay low over the busy  Thanksgiving period that is upcoming.…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, there is good news for  Americans when it comes to gas prices. They are down about 50 cents  since last year, but unfortunately this good news does not extend to  Californians. As you can see here, we remain a stark outlier with by…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}]