[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…crisis--66 percent already get that. They are just being  ignored because the fossil fuel industry can out-fog horn them with its  propaganda and outspend them with its sluice gates open of dark money  corrupting our politics.\n\nThat takes us to the last point, which is, yes, there is a villain in  the story, and we need to put a spotlight on that villain…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…information or meetings about election  administration from States and has demanded 40 States--40 States-- provide their full voter registration lists. In a private meeting,  Michael Gates, a Deputy Assistant Attorney General in the Department of  Justice Civil Rights Division, disclosed that all 50 States will  eventually receive these requests. The eight States…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…smog. They are trying to make America smoggy again.\n\nWe are seeing the climate crisis, and they are trying to cut the  brake lines on progress. We are literally standing at the gates of the  future--a future that we will lead or China will lead, a renewable  energy future--and some would rather turn it all around and ride off in  a horse and buggy, because…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691621/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…our military cyber forces.  General Haugh--get ready for this--served our Nation honorably with  distinction for 34 years.\n\nThe Trump administration has left America's cyber gates unlocked at a  time when cyberattacks are rapidly on the rise. Putin will make our  Nation pay dearly for that set of serious errors.\n\nFourthly, Trump administration policies…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…that would look like--and to say it is a rebellion just because the  President says there is one and there is nothing, like that type of  deference, that is throwing open the gates to say an authoritarian  President can roll out the military under title 10. That is scary as  hell.\n\nThe Insurrection Act, in ways, is even scarier because it does have  an…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…helped to create the Global Polio Eradication  Initiative, a partnership with the U.S. Centers for Disease Control and  Prevention, the World Health Organization, UNICEF, the Gates  Foundation, and the vaccine alliance, Gavi, with additional critical  funding from the U.S. Agency for International Development, which no  longer exists. Yet the entire effort…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699265/recognizing-the-scarsdale-forum"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…including without limitation under the       14th Amendment.            Respectfully,      Harmeet K. Dhillon,\n\nAssistant Attorney General, Civil Rights Division.      Michael E. Gates,\n\nDeputy Assistant Attorney General, Civil Rights Division.\n\nMr. GREEN of Texas. Mr. Speaker, the first is a letter from the  Department of Justice. This letter from the Department…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…don't get rid of the Kennedy Center.\n\nThere will be people who will die. This bill is good for Russia and  China and undertakers because it is going to have people dying. Bill  Gates said this is the richest man in the world, Musk, taking advantage  of and killing the poorest children in the world. They are not going to  be getting PEPFAR programs created…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692546/rescissions-act-of-2025"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…rise today to recognize an extraordinary  individual from our community, Department of the Air Force Police  Officer Mykul Thomas, who has been a beacon of inspiration at the gates  of Buckley Space Force Base. As he prepares for a new assignment at  Cape Canaveral Space Force Station, I want to honor the profound,  positive impact he has had on countless…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693669/recognizing-officer-mykul-thomas"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…central Yukon River watershed and the Dalton  Highway corridor, areas that are vital to both biodiversity and  community survival. These lands are also interconnected with the Gates  of the Arctic National Park and Preserve and the Arctic National  Wildlife Refuge. They are home to caribou, salmon, and sheep species  that Alaska Native and rural communities…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694899/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…of holistic transformation  and continual improvement in Christ.\n\nThe scripture tells us in Matthew 16:18 that Jesus said, ``Upon this  rock I will build my church, and the gates of hell will not prevail  against it.''\n\nThe story of First African Baptist Church, which began with a small  group of devoted worshipers 185 years ago, is truly inspiring.…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694727/recognizing-first-african-baptist-churchs-185th-anniversary"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…``Reading  Rainbow?''\n\nDid you spend time in ``Mister Rogers' Neighborhood,'' Mr. Speaker?\n\nMr. Speaker, maybe you enjoyed watching ``Finding Your Roots'' with  Dr. Henry Louis Gates, or ``FRONTLINE'' documentaries.\n\nIf so, Mr. Speaker, you have the Corporation for Public Broadcasting  to thank.\n\nHowever, now Republicans are trying to take them down. Yes,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692233/corporation-for-public-broadcasting"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Civil  War.\n\nYeah, it started there in the Charleston Harbor, but if you go back  and look at the Battle of Charleston, that critical battle that we had  lost twice, General Gates was not a good general, and then George  Washington decided that he would get outside of his comfort zone.  George Washington decided that he would not hold Nathanael Greene's…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…housing supply.\n\nI look forward to continuing to work together to tackle the housing  issues facing America with creative solutions.                           Recognizing Randy Gates\n\nMr. FLOOD. Mr. Speaker, I rise today to recognize the hard work and  dedication of one of the First District's most dedicated public  servants, the city of Norfolk's finance…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692993/boosting-americas-housing-supply"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…prosperous community in upstate New York would not exist if not for a  series of legendary events that took place nearly 250 years ago.\n\nIn September 1777, General Horatio Gates led Continental Army troops  against the British empire in present-day Saratoga County. In the  ensuing Battles of Saratoga, American colonists forged a turning point  in the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691018/strengthening-americas-turning-point-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…under Obama. All reservations at the national parks  were canceled. Vendors were ordered to close, perishable deliveries  were turned back, The National Mall was cordoned off, gates to the  national parks were chained, and even highway turnouts with a view of  Yosemite Valley were barricaded.\n\nNow, compare that to the government shutdown in the first Trump…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688585/yosemite-belongs-to-the-people"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…in Europe, and they think, would  that ever happen in our country? The reality is, yes. It is happening  right now, right before our very eyes. The enemy is now inside the  gates.\n\nThere are plenty of Muslims that come here, love this country,  assimilate into American culture, and they have a duty to join in the  fight and speak out against the mainstream…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…wanted to instill in kindergarten or first grade or second grade  students with regard to human growth and development programs.\n\nIn any event, the totalitarians are at the gates. They are taking  over Western Europe, and the United States is  next. They have taken over Western Europe, from what we heard about  what is going on in Great Britain, Germany,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…tried to seize control of the strategically important  Hudson River Valley, but his campaign ended in defeat at the Battles of  Saratoga, where he surrendered to General Horatio Gates.\n\nThe American victory against British forces at the Battles of  Saratoga marked a changing of the tide in the Revolutionary War, hence,  the turning point, securing foreign…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691016/strengthening-americas-turning-point-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…raised their blades, their last word was the name of Jesus.\n\nI remember my father had a Bible verse on his mirror that said if you  deny me before man, I will deny you before the gates of Heaven. They  did not deny their faith.\n\nThis month marks 10 years since their deaths. ISIS thought they were  making a statement of fear. Instead, they showed the world…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688172/meaning-of-religious-freedom"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…those seeking searing reflection should turn to an essential       book of blood, pain and love. Amir Tibon gifted Israeli       author and noted journalist's recent The Gates of Gaza (A       Story of Betrayal, Survival, and Hope In Israel's       Borderlands), Little, Brown and Company. 2024 is bound to be       a classic.\n\nThis literary masterpiece…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690665/israel-at-77"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…is on a variety of things, but it began 4 years  ago with the invasion of the border.\n\nMy friends from the left, the minute the Biden administration took  office, opened the gates for over 170 different countries to let  everybody and anybody into this country. My friends on the left allowed  400,000 unaccompanied minors to come into this country, and…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688091/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…proudly hold the claim to the distinction of Crossroads of  America.\n\nThis past month, Indianapolis International Airport welcomed a  nonstop transatlantic flight to one of our gates. The flight from  Indianapolis to Dublin on Aer Lingus marked the start of daily nonstop  service to this European gateway and onward connections throughout  Europe.\n\nImportantly,…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692118/welcoming-nonstop-flight-from-indianapolis-to-dublin"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…2.10 SOPOEA means the Senators' Official Personnel and       Office Expense Account.\n\n2.11 Structural security enhancements include devices such       as wiring, lighting, gates, doors, and fencing, so long as       such devices are intended solely to provide security and not       to improve the Member's property or increase its value.\n\n2.12 USCP…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697952/us-senate-member-protection-regulations"}]