[{"senator": "John Larson", "party": "Democrat", "sentence": "…Hartford, Connecticut. Over its storied 100-year  history, the club has grown into the premier location for members to  enjoy organized social, intellectual, and artistic gatherings.\n\nOn May 21, 1925, just five years after the 19th Amendment guaranteed  women's suffrage, 400 women founded the Town & County Club as  Hartford's first private women's club.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691102/recognizing-the-100th-anniversary-of-the-town-county-club"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…Leflore County is led by Mr. Terry Williams, a  local painting contractor and pastor, and Mr. Luke Quinn, a minister  and clinical therapist. Together, they facilitate regular gatherings-- often breakfasts or luncheons--that rotate between churches with  historically Black or White congregations. These events are not mere  meetings; they are powerful acts…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692273/recognizing-mission-mississippi-of-leflore-county-for-its-commitment-to-racial-reconciliation-and-community-unity"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…grandfather's niece who married an American and lived in Anaheim and  worked at Disneyland.\n\nWe knew some facts, but we never in our times when we would get  together for our family gatherings would we ever discuss what happened  in Hiroshima. It wasn't until I was well into my adulthood on my first  trip to Japan visiting Hiroshima and visiting Kikue, who was…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694115/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…services, holiday programs, adult and child education classes, Mommy &  Me programs, women's groups, after-school enrichment, and a wide  variety of cultural and social gatherings. This expansion will allow  Chabad Southwest Las Vegas to better serve families, individuals, and  future generations, strengthening the fabric of the southern Nevada  community.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695341/recognizing-the-groundbreaking-of-chabad-southwest-las-vegas"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…age--able to remain in their homes and highly  active. At Home volunteers and professionals deliver a monthly schedule  of educational programs, active discussion groups, social gatherings,  and the necessary transportation.\n\nWhen I retire, not that long from now, I know exactly where I can go  to learn how to paint and play bridge, canasta, mahjong, and a…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691311/recognizing-at-home-on-the-sound"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…reminding the world that  creation itself is a sacred trust. Through initiatives such as  establishing a worldwide day of prayer for the environment and  convening international gatherings of scientists, leaders, and  theologians, he has exemplified how faith can serve the common good.  His tireless journeys across continents and his engagements with  parliaments,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695368/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…professional and spiritual dedication,  Sharon found joy in the simple pleasures of life. She was an avid cook,  enjoyed shopping, and brought warmth and laughter to family gatherings,  particularly during friendly card games that brought her loved ones  together.\n\nHer life was characterized by her deep care for others, and she will  be deeply missed by…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687993/recognizing-sharon-lavonne-harris-rischer"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…world-class venue for  both residents and visitors.\n\nUnder his leadership, the Floreano Convention Center strengthened its  reputation as a hub for regional and national gatherings, driving  economic development and fostering community engagement. Jim's deep  understanding of operations, combined with his steady guidance and  collaborative spirit, helped…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697211/recognizing-jim-brown"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…our world and to the  United States. The Zoroastrian Association of California has made  Orange County it's home and serves as a house of worship and a place  for social gatherings.\n\nI call on my colleagues to support my Resolution to recognize the  month of March as ``Zoroastrian Legacy and Heritage Month.''", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688922/introducing-a-resolution-to-recognize-march-as-zoroastrian-legacy-and-heritage-month"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…there was any benefit in terms of having Members back home,  though, it was an opportunity to go out and listen to what is on  people's minds. Townhall meetings and community gatherings offer,  again, Members of Congress a chance to listen to people in terms of  what they care about the most.\n\nI had a number of those events, in Mansfield, Colchester, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…people who always walked       through her front door. Speaking for my cousin Nina and I, we       so wish we could have been flies on the wall at one of those       legendary gatherings.\n\nIt is said that there's a special place in heaven for the       father of three girls. I remember seeing that written on a       piece of art hung in the home of dear family…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688362/eulogy-by-sam-iacobellis-for-dorothy-christiana"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…of fellowship and  support, uplifting those who served, commemorating those we've lost,  and building bridges within Georgetown. Its events have become more  than social gatherings--they are touchpoints of history, community, and  service.\n\nTheir passion for service, fellowship, and patriotism continues to  inspire the next generation. On behalf of…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693998/recognizing-the-navy-club-of-georgetown-sc"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…professional achievements, Mr. Lewerenz was known for  his generosity, energy, and love of life. A devoted husband, father,  and grandfather, he found joy in hosting family gatherings, camping  trips, and community events. After retiring to Rainbow Springs, he  cherished time spent golfing, playing pool, and attending Meadowbrook  Church with his beloved…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697024/recognizing-alfred-thomas-lewerenz"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…civilians and first responders.\n\n(3) These attacks, carried out by both organized terrorist       groups and individual actors, often aim to exploit high-      density public gatherings, critical infrastructure, and key       transportation hubs, causing mass casualties and widespread       disruption.\n\n(4) Emerging automotive technologies, such as autonomous…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…and state offices.\n\nOnce her children were grown, Kathy worked for more than 25 years as  a clerk at livestock auctions across Missouri and Arkansas. She  cherished family gatherings, hosted Sunday dinners, and traveled with  relatives to nearly every state. She was a talented craftswoman whose  creativity touched every part of her life. She enjoyed bowling…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696672/recognizing-anna-kathleen-cummins-kennedy"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Pennsylvania Wilds.\n\nAs the logging and lumber industry flourished in the 19th century, so  did the hotel's significance. It hosted community meetings, business  affairs, social gatherings, and even served as a way station for  elected officials, becoming an integral part of the region's political  and civic fabric.\n\nThrough wars, Prohibition, economic strangulation,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693585/congratulating-the-waterville-hotel"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…connected vehicle technologies.\n\nFurther, the bill strengthens coordination between Federal, State,  and local governments and the private sector to better safeguard public  gatherings, critical infrastructure, and high-density urban areas.\n\nI thank Congressman Troy Carter, who represents the community  devastated by the New Year's Day attack, for his partnership…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696770/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…develop her  unique talents and capabilities. As both schools grew, they often  collaborated, sharing theatrical productions, musical performances,  proms, teas, and community gatherings. In 1949, these two institutions  united to form one of the first coeducational independent schools in  the Nation: Solebury School, as we know it today.\n\nOn October 1, 2025,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696356/recognizing-the-100th-anniversary-of-solebury-school"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…environmental stewardship, earning him the title of ``Green  Patriarch'' and international recognition for his vision of  reconciliation and unity. He has convened historic gatherings of  Orthodox leaders, fostered dialogue with other Christian traditions,  and extended a hand of friendship to leaders of the Jewish and Muslim  faiths.\n\nIn South Carolina's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694924/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…Harvard released a report examining anti-Semitism on its  campus with stark findings. One Israeli student said: ``My friend has  been told that others would not attend social gatherings if I was  present, as they couldn't risk the social consequences of being seen  with an Israeli.''\n\nAnother student said: ``I am tired of fighting. It is the same group…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…not seem like a big deal, but in 1990, there was a great  debate that was still spinning on this issue. In fact, that year, that  September day, at at least one of those gatherings, the sheriff's  department came out and arrested the students for praying--praying--on  their school campus before class started.\n\nThe result of that was that the next September,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695773/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…performances, civic engagement, and social events. From city council  meetings and public forums to receptions, family reunions, and  community celebrations, it has hosted countless gatherings that reflect  the heart and spirit of Hanford. More than just a venue, the auditorium  plays a vital role in fostering civic pride, cultural expression, and a  shared appreciation…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698408/recognizing-the-hanford-civic-auditorium"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…conventions for fourteen consecutive years.  In this role, he also secured future convention dates in Sault Sainte  Marie, ensuring the continued success of these important gatherings.\n\nHis commitment extends beyond organizational leadership. As Commander  of Post 44, Mr. Carlson spearheaded a $240,000 renovation project to  improve the post's facilities.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694083/recognizing-raymond-e-carlson-as-the-2025-upper-peninsula-veteran-of-the-year"}]