[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Amendments Act.\n\nMarine debris does not stay in one place. A plastic bottle tossed  inland can end up hundreds of miles away, wrapped around a propeller,  tangled in fishing gear, or broken down into microplastics that end up  in the food we eat. Across the country, communities see the damage  every day.\n\nIn the Pacific Northwest, crews use Marine Debris…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698190/save-our-seas-amendments-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…low-income students, students with disabilities, and higher  ed.\n\nI got through community college and college and law school because I  had Federal support. Programs like TRIO and GEAR UP that help  underserved students, these are all under attack. It feels like we are  just watching the unfolding of the Project 2025 playbook. Now we are  seeing the Secretary…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698126/dismantling-the-department-of-education"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…haves and have nots. This Trump Administration seeks to slash key  federal programs that improve access to higher education, including  Pell Grants, loans, work-study, TRIO, GEAR UP, and CCAMPIS.  Approximately 45 percent of full-time Black students graduate from  public four-year colleges and universities within six years, with  finances playing a large…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690128/alarm-at-the-trump-administrations-dangerous-attack-on-education"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…McKinney-Vento grant  program for youth experiencing homelessness; grant programs for English  learners, rural schools, literary initiatives; and more.\n\nPrograms like TRIO and GEAR UP help underserved students access and  succeed in higher education, and they moved those, too. They moved  programs that support HBCUs and other minority-serving institutions.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697292/trump-administration-dismantling-department-of-education"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…investments disappear.\n\nWe remember back home when Griffiss Air Force Base closed. We  remember when Carrier left. Those were our sheet metal workers. We  remember when New Venture Gear and a Chrysler plant closed. Those were  our UAW brothers and sisters. There were others that have left our  region behind.\n\nIt is through that prism that we see the Trump administration's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695609/devastating-harm-caused-by-trump-administration"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…revenue or had to modify their operations because  employees and customers are afraid to come to work or to patronize  their business.\n\nWhen masked ICE agents in full tactical gear inflict violence against  American citizens and then show up at businesses without identifying  themselves, small businesses pay the price.\n\nMost businessowners support commonsense…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699617/small-businesses-bear-brunt-of-immigration-enforcement-abuses"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…involved if a Good Samaritan were to intervene.\n\nAdditionally, the lack of clearly identifiable uniforms has made it  easier for copycats and impersonators to purchase fake gear on Amazon,  allowing them to go around neighborhoods harassing residents. We have  already seen this happening.\n\nIn response, I introduced a piece of legislation, the ICE Visibility…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…to know why Republican Members of Congress have been  flying into Los Angeles over the past few weeks attending fundraisers.  Nobody is showing up in a hazmat suit or combat gear.\n\nIf it is such a hellscape, pull back the cameras and release the  drone footage so we can see what is happening across the entire city.\n\nThis resolution ignores the fact that…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693147/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…the  fiberoptic infrastructure itself at risk--if we care about national  security and telecommunications integrity--and posing a danger to other  sanctuary users and their gear. A fishing boat, for example, could have  easily gotten snagged on some of these exposed, loose cables, taking  down the entire network, destroying equipment, that a small business…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…raids myself in  Carpinteria, California, where ICE agents unleashed a disproportionate  show of force.\n\nWhat I saw was completely unacceptable, masked ICE agents in military  gear firing tear gas and other projectiles into a crowd of peaceful  civilians and reporters. Even a child was injured by shrapnel.\n\nUpon seeing these violent tactics, I demanded…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697456/fighting-dhs-immigration-raids"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…an ICE facility to conduct oversight.\n\nHe has also violated the right to due process by dispatching armed,  masked, unidentifiable people, wearing plain clothes and tactical gear,  onto the streets of select American cities. They pull up on people,  jump out with assault weapons, force them into unmarked cars, and  disappear them. Their families learn…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692929/holding-power-accountable"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…as you are fighting these fires. The support staff is every bit as  important.\n\nWe are anticipating there to be further staffing cuts right before  wildfire season kicks into gear, and these reduction-in-force plans are  being made with little forethought and no agency engagement. We are  seeing the arbitrary firing of probationary employees in every…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…cetacean desk for                Puget Sound region. Sec. 345. Suspension of enforcement of use of devices broadcasting on                AIS for purposes of marking fishing gear. Sec. 346. Classification societies. Sec. 347. Abandoned and derelict vessel removals. Sec. 348. Offshore operations. Sec. 349. Administrative costs. Sec. 350. Briefing on deployment…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…intelligence Agencies  began noticing a peculiar pattern of Huawei equipment on cell towers  across my home State of Nebraska as well as nearby Colorado and  Montana. That Chinese gear was clustered near sensitive military  assets, including Nebraska's Offutt Air Force Base and our nuclear  missile silos.\n\nThen, just 4 years ago, U.S. intelligence officials…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690666/fact-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Trump's reckless military action in Venezuela and everywhere else he  decides to invade or bomb.\n\nTrump and Kristi Noem have militarized our streets. Masked men in  full military gear roam the streets of our cities. These masked men  invade church properties and schools, knock down doors without  warrants, ram cars, and assault pastors and people of faith.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…for radio communications and equipment upgrades for Nebraska  law enforcement. Nearly a dozen counties reached out to my office  asking for help replacing outdated systems and gear. With these  upgrades, officers will be able to communicate, and they will be able  to respond faster. And this will improve safety for both our first  responders and also the…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699921/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…Corner section of Bernards Township. Through community  fundraising events and donations, residents ensure that these  volunteers have the equipment, training, and protective gear needed to  continue their mission safely and effectively. Generations of families  in Bernards Township have worn the uniform of Liberty Corner Fire  Company, making it both…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694757/recognizing-liberty-corner-fire-companys-115th-anniversary"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…requires laws like the ones we  are going to consider here today.\n\nIt requires protecting the people who protect us, like the bill to  equip first  responders with protective gear against fentanyl exposure, keeping them  safe from the very poisons they are trying to fight.\n\nIt requires ensuring that our police officers are healthy in body and  in spirit,…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696003/unanimous-consent-requests"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…his service with the United States Marine Corps, Scott played a  vital role in working with the Department of Defense. Here, he led  teams responsible for providing essential gear to troops on the  battlefield. In 2013, Scott then transitioned into the pharmaceutical  industry, applying his college education and background to become a top  sales representative.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692240/recognizing-scott-gatto-as-june-2025-veteran-of-the-month"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…including over  100 children ranging from kindergarten to fifth grade. The group also  performed almost 150 Vessel Safety Checks to ensure recreational  boaters have all the safety gear they need to be legal and safe and  conducted more than 175 Recreational Boating Safety Program Visits to  boat equipment stores, marinas, and harborages to improve public…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690718/recognizing-coast-guard-auxiliary-clearwater-flotilla-11-1s-75th-anniversary"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…community in need,  Kennedy's volunteers have never hesitated to offer support through  mutual aid. When disaster strikes and the stakes are high, these men  and women grab their gear and get moving, facing flames, chaos, and the  unknown with unshakable resolve.\n\nTheir station, nestled on Dailey Hill Road, is home to a well- equipped fleet that reflects…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693639/hornoring-the-kennedy-fire-department-on-its-100th-anniversary"}]