[{"senator": "George Latimer", "party": "Democrat", "sentence": "…activity. The U.S. ranks  behind Spain and France in global competition for travel. China, India,  and Saudi Arabia are gaining on us. Our market share is 9.1 percent,  but we can generate 127 million new additional visitors over the next  decade and $478 billion in additional revenue, which translates into  $55 billion in tax revenue, creating 140,000 new jobs.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691775/growing-travel-industry-jobs"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…beyond. They don't have to pay any tariffs.\n\nBirding in our abundant freshwater kingdom draws environmental  stewards from around the globe. Nationwide, 95 million birders generate  over $90 billion annually for our economy.\n\nThe biggest week in American birding is sponsored by the Black Swamp  Bird Observatory in Oak Harbor, Ohio. This event leverages…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690918/national-american-birding-week"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…Number one, economics: Again, we are the most economically powerful  nation in the world. We have the largest economy. We benefited the  most. If we can help other countries generate economies, we have access  to those markets. They will buy our stuff. It grows our economy. It has  worked spectacularly well for 80 years.\n\nNumber two, disease and health:…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…safeguards  that we and the communities we represent depend on to help power our  Nation's blue economy.\n\nWe know that four of the five national marine sanctuaries in  California generate more than $114 million a year and support over  1,800 jobs in commercial fishing alone.\n\nH.R. 261 is a giveaway to megacorporations at the expense of the  American taxpayer,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699957/undersea-cable-protection-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…power from  around the world.\n\nThis is self-sabotage masquerading as savings, and it is not even a  lot of money. These slivers of our Federal budget, these dollars that  generate enormous return by keeping people alive and preventing crises  before they happen that is what this money does. That is what  Republicans are cutting.\n\nThis isn't just penny…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…American.\n\nFixing the tax code does two things. One, it will ensure that the  superwealthy and big corporations pay all their taxes just like the  rest of us, and two, it will generate trillions of dollars that will be  invested back in the American people. There will be trillions to help  people with housing, healthcare, and education. It will help us pay…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699242/restoring-election-integrity"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…safety of ships, crew members, and  critical ship-dependent supply chains.\n\nMr. Speaker, my bill is also a necessary step to ensure the  development of African economies and generate greater prosperity  through stability in Somalia. No country can be expected to grow and  prosper while facing serious piracy threats. We cannot allow violent  criminals and…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692721/sanction-sea-pirates-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…saying ``we'' because  there were persons who were engaged in helping me.\n\nI knew that it would not be enough, and I knew that we would have to  continue to build on this to generate a mass such that impeachment  could no longer be ignored. Many of the people who were opposed to  impeachment were making it clear that certain things would have to  happen…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…what we can be doing to reduce the deficit.\n\nAlso, Musk has called for ending fossil fuel subsidies. Let's have  some revenue generators. We have to vote to cut spending and generate  revenue.\n\nLet's tax billionaires. I never understood the billionaire argument.  I have more billionaires than anyone in this Chamber. There are five  trillion-dollar companies…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692232/addressing-our-exploding-deficit"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…of Keith Richardson, President, Diatta  Grant, Director, Jackie Chambers, Vice President, and Michelle Johnson,  Secretary/Treasurer.\n\nLabor unions function in many ways to generate fair equitable wages,  benefits, working conditions, and quaLity of life enhancements. They  are the bridges between employers and employees. Without labor unions I  often…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697484/congratulating-the-american-postal-workers-union-chicago-chapter-0001"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Democrat. I am proud also  to have friends, and tonight I will thank a couple of my friends who  have helped me with an endeavor that I believe is necessary and that is  going to generate a movement that will make a difference in the lives  of the people of this country.\n\nTonight, I will start by thanking my friend, attorney John Bonifaz, a  lawyer par excellence,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…apprenticeship programs.\n\nThis legislation also builds on a recommendation from the National  Transportation Safety Board and directs the Department of  Transportation to study and generate best practices for inspecting and  addressing corrosion on bridges made of weathering steel.\n\nIn July 2021, the House passed Section 2 of the ``Bridge Corrosion  Prevention…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693007/introduction-of-the-bridge-corrosion-prevention-and-repair-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…commodities, and more.\n\nIn 2024, South Bass Island and the Put-in-Bay Port Authority received  $10.3 million from MARAD to improve infrastructure, and they needed it.\n\nOur ports generate real dollars for families and jobs, nearly $900  million in annual economic activity and 8,000 jobs by the latest count.\n\nApparently, this does not matter to the President…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698300/in-support-of-marad"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…houses. I'm proud of my team's ability to       fix up homes and provide high-quality housing to new       homeowners in my community.\n\nAcross the country, TPS holders like me generate $21       billion for the U.S. economy each year. But it's incredibly       hard doing that, especially now with so much uncertainty       about our status. Bank financing…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…get anything for 6 bucks  downstairs in the Dirksen cafeteria, not that would feed me.\n\nSix dollars a day is the average amount, and what the Republicans  decided to do to generate savings, to find savings, is to cut  nutritional assistance. Why? Because they needed to pay for the biggest  tax cut in American history for the wealthiest people and corporations…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…economy will grow at an anemic 1.8 percent next year. The  average 20th century growth rate, including the Depression, was 3.3  percent. A mere 3 percent growth rate will generate $4 trillion of new  revenues, and that doesn't include hundreds of billions of dollars  collected from imports or saved by eliminating waste identified by  DOGE.\n\nHow will…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693629/democrats-big-mistake"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…the IRS,  we hire more people for the Department of Commerce, or we hire more  people for the Department of Agriculture? None of these are making us  wealthier, but they do generate statistics in which we say: Aha, more  people have jobs.\n\nMr. Speaker, one more time before I leave here, I beg my leadership  to do something about what I still believe is…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…common sense. It directs the  Secretary of Energy to identify any vulnerabilities to our domestic  energy grid that may arise from noncitizens' access to U.S. facilities  that generate or transmit electricity. That is it. It creates no  prohibition, no hiring restrictions, and no burdens on industry. It  simply asks for information, information Congress…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697892/electric-supply-chain-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…vital resources to support and uplift the  youth we serve. Driven by a bold vision, Victoria imagined a large- scale annual event in New Port Richey--one that would not only generate  funds for the RAP House but also raise community awareness and  engagement with YFA's mission. Despite having no prior experience in  organizing a 5k race, her determination…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692476/recognizing-victoria-barley"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…protections.\n\nDisapproving the withdrawal in Minnesota will undo an       unnecessary and damaging action. It will also correct a       course in which industries seeking to generate jobs and       revenue for generations to come, were simply no longer       allowed to propose mining projects in the area and forbidden       to go through the law and science-based…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…Orange Cliffs and  segments of the Poison Springs Loop. I have spent a lot of time on the  ground in these areas with local elected officials who, for years, have  tried to generate a better experience for visitors to the Orange  Cliffs, and this goes in the wrong direction.\n\nWayne and Garfield Counties are counties that struggle in a State  that otherwise…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690403/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…an eleventh hour effort from Biden's rogue financial  regulators to score political points at the expense of everyday  Americans.\n\nFinancial institutions have to be able to generate profit from the  products they offer. Otherwise, they will not be able to offer them at  all.\n\nBy capping overdraft fees, the CFPB has made it increasingly more  costly for…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689840/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…used to abide by  the ancient principle of ``no taxation without representation.''\n\nOne of the first acts enacted into the law was the Tariff Act of  1789, which sought to generate revenue by placing a 5-percent tax on  all imported goods and was signed into law, after passage by Congress,  by George Washington.\n\nAlexander Hamilton's ``Report on Manufacturers''…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…September 8, except the small problem is, this  Pope has been dead for months.\n\nWelcome to the quality of what we call news anymore. This is  Newsweek. They just let their AI generate a story, fill it up. There is  no human that bothered to look at it. Yet, you and I have to help our  voters. Our constituents call us and say: Is this true? You can't find…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…``supportable as in aid'' of  Congress' proper exercise of the taxing power. Furthermore, the Supreme  Court, in United States v. Constantine, 1935, held that a tax that  doesn't generate revenue cannot be justified as a tax.\n\nTherefore, NFA registration serves as the mechanism by which ATF  accounts for the tax paid on each firearm, identified by its serial…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697383/restoring-second-amendment-rights"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…than 4,000 high-paying jobs in rural Wyoming.\n\nIn conjunction with the pro-energy policies included in the working  families tax cut law, this CRA also has the potential to generate more  than $260 million for the Federal Treasury.\n\nThis CRA helps the U.S. remain energy dominant and will lower prices  for families, strengthen our economy, and boost real…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…construction, Mr. Quinn repairs and revitalizes electrical appliances  at the organization's ReStores. By increasing the inventory of  resellable goods, he directly helps generate funds that enable the  construction of more affordable homes in our community. Neil is the  epitome of a team player, consistently willing to contribute his time  and talents…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691863/recognizing-neil-quinn"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…billion short tons of coal, enough to meet U.S. demand  for the next 73 years.\n\nIn addition, passing Representative Downing's CRA will unleash  Montana's coal industry and generate millions of dollars in revenue for  the Federal Government and the State of Montana.\n\nAccording to the Congressional Budget Office, this CRA will generate  $16 million in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…where we are writ large in this subject matter, and we are there  because of the vagaries in the recovery cycle and all kinds of things  that happen in the court system that generate these revenue streams.  This is a way to put our finger in the dam until we figure out longer  term how we provide that sort of certainty.\n\nThere are a lot of different groups…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698842/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…over 3 billion barrels were  technically and economically recoverable in the Coastal Plain. Based on  estimates such as these, DOI projected in 2024 that ANWR drilling would  generate around $29 billion in revenue for the Federal Government  through 2050.\n\nDespite numerous efforts by Congress and the leadership of Alaska's  congressional delegation to realize…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}]