[{"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…nonconsensual intimate images is  a growing crisis that demands urgent action now. We need to work  together to protect women and children from these evolving threats. New  generative artificial intelligence tools are being weaponized to  humiliate, silence, and terrorize women and children.\n\nWe have seen it used against children as young as middle school…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690184/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…bill again, and the House should take it  up quickly as the problem of nonconsensual, sexually explicit, deepfake  images continues to spread. With the push of a button, generative AI  can swap someone's face onto another person's body, remove that  person's clothing so they appear nude, or undress someone to show them  in lingerie or other exposed…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…legislation addresses the nonconsensual sharing of intimate images  online, one of the most significant harms proliferating on the internet  in recent years.\n\nAdvances in generative artificial intelligence and other photo  manipulation software have enabled the creation of digital forgeries  that place victims in sexually explicit situations that never…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690185/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…(H.R. 1736) to require the Secretary of Homeland Security to conduct  annual assessments on terrorism threats to the United States posed by  terrorist organizations utilizing generative artificial intelligence  applications, and for other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696919/generative-ai-terrorism-risk-assessment-act"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "Mr. PFLUGER. Mr. Speaker, I thank the chairman for the time.\n\nMr. Speaker, I rise in support of H.R. 1736, the Generative AI  Terrorism Risk Assessment Act.\n\nThe mass adoption of artificial intelligence is the latest in a  series of technological revolutions that have permeated and influenced…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696918/generative-ai-terrorism-risk-assessment-act"}]