[{"senator": "Brian Babin", "party": "Republican", "sentence": "``(d) Strategic Plan.--\n\n``(1) In general.--Not later than 180 days after the       establishment of the program under subsection (b), the       Secretary shall develop a 5-year strategic plan identifying       research, development, demonstration, and commercial       application goals for such program.", "title": "Innovative Mitigation Partnerships for Asphalt and Concrete Technologies Act", "date": "2025-03-24"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "(a) In General.--Not later than 60 days after the date of       the enactment of this Act, the Secretary of Homeland       Security, acting through the Commissioner of U.S.", "title": "Providing Emotional Assistance with Relief and Love Act", "date": "2025-11-19"}, {"senator": "William Timmons", "party": "Republican", "sentence": "(d) Agency Submission.--\n\n(1) In general.--Not later than 1 year after the date on       which the head of an agency submits the comprehensive       assessment pursuant to section 3(d), the head of the agency       shall submit to the Director, the Committee on Homeland       Security and Governmental Affairs of the Senate, and the       Committee on Oversight and Government Reform of the House of       Representatives the plan of the agency.", "title": "Strengthening Agency Management and Oversight of Software Assets Act", "date": "2025-12-15"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "(c) Report.--\n\n(1) In general.--Not later than 180 days after the date of       the enactment of this Act and annually thereafter for 3       years, the President shall submit to the appropriate       congressional committees a report that contains the strategy       required under subsection (a).", "title": "Undersea Cable Control Act", "date": null}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "(a) In General.--If, not later than 1 year after the date       of the enactment of this Act, the City submits a written       request to the Secretary for conveyance of the land described       in subsection (b)(1), the Secretary shall, as soon as       practicable thereafter, convey to the City, all right, title,       and interest of the United States in and to such land.", "title": "Dalles Watershed Development Act", "date": "2025-12-09"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "(b) List of Persons.--\n\n(1) In general.--Not later than 180 days after the date of       the enactment of this Act, the President shall submit to the       appropriate congressional committees a list of foreign       persons who the President determines to have knowingly and       directly engaged in or facilitated the involuntary harvesting       of organs within the People's Republic of China.", "title": "Falun Gong Protection Act", "date": "2025-05-05"}]