[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…These are challenging enough times for students, families, and  schools. In Portland, the public school district recently redirected an  additional $25 million from their general fund to fill the gap to help  provide students with disabilities the resources that they need that  State and Federal funding aren't covering, and it is still not enough.\n\nThe…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698934/protecting-education-for-children-with-disabilities"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…tax filing deadlines into fall 2026.       The adjustments will also generate millions of dollars of       additional expenses that must be paid by the District's       General Fund resources.                                  Cash Flow\n\nInvalidation of the Tax Amendment Act may lead to District       cash flow disruptions. In addition to the administrative…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699680/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…staff.\n\nIn 2032, the trust funds are empty. In 2033, the first year where  they are completely empty, if you said that we are just going to pay  for everything out of the general fund, okay, we can do that.\n\nMy estimates come in at about $638 billion in 2033 just to make up  the shortfall of the Social Security trust fund being gone and the  Medicare…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…is separate from what we are doing  here today. We actually ultimately decided to move our State-based  crime victim support programs into appropriated support from  our general fund and deposit all of these erratic streams from the  court system into the general fund so that the risk of funding was  shifted onto the State generally and not borne by…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698842/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Code,       as amended by this Act; and\n\n(2) $5,400,000 of the fees collected under section       1930(a)(6) of title 28, United States Code, shall be       deposited in the general fund of the Treasury.       SEC. 5. EXTENSION OF TERM OF CERTAIN TEMPORARY OFFICES OF                     BANKRUPTCY JUDGE.\n\n(a) Bankruptcy Administration Improvement Act of…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698845/bankruptcy-administration-improvement-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…this year.\n\nBecause of that enormous cost overrun, because of the resulting  shortfall of some $6 billion, Governor Newsom has just taken out an  emergency loan from the general fund in order to cover payments. On top  of that, he has asked the legislature to appropriate even more money,  billions more.\n\nThink about what this means over, let's say, the…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…percent of Medicare. The other  portion of Medicare, it can be 10 to 15 percent, is you paying copays  if you are in traditional Medicare. The rest comes right out of the  general fund.\n\nThat is why the fact is that, in the next 7 years, Medicare goes from  $1 trillion of spend this year to $2 trillion, in 7 years. It is  demographics and healthcare inflation.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…human beings in  life, but the point that The Wall Street Journal was trying to make in  putting up this chart is that, in Arizona, we put money--$363 million-- back in the general fund because of the way they do their provider tax.  They are actually making money from the Federal Government.\n\nWe idiots--excuse me, this fine august body, we borrow the money.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…experiment.\n\nThere was someone who had an article out this last week that talked  about saying: Well, when the Social Security trust fund is gone, we  will just borrow it from the general fund, and the general fund will  borrow it from the debt market.\n\nOkay. Let's see. When you start to look at the scale of debt, do you  see the red here? That is already where…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the models to catch it faster because we are not actually incentivized.\n\nNow, we also play incredible games where we use a provider tax. We  actually make money for the general fund more than is actually spent on  healthcare. One of the great scams we are trying to fix right now is  what happens when the washing machine is actually where you are padding…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the cost, just for the first year of coverage, has exploded  to $9.5 billion.\n\nAs a result, Governor Newsom, number one, took out a $3.44 billion  loan from the State's general fund. That is the maximum allowed by law.  Of course, that wasn't enough to close the gap, so then, he had to go  and ask for a bailout of the program to stave off insolvency.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…empty. That is because every month Social Security gathers payroll  taxes and there is a shortage, so they take their special T-bills,  because they have loaned money to the general fund, and they cash those  in. They get that money back from Treasury. Treasury goes out and  borrows the money, but they get that plus interest. In 7 years, they  have no more…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…through the financing of  Medicare next week. I am going to walk through how it actually works,  because some people think the magic trust fund pays for everything. The  general fund, which is all borrowed here, pays for about 40 percent of  it.\n\nIn conversations, even with my brothers and sisters here, and even  with some of the staff, they are not…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…$7 back. Most people don't realize that  about 38 percent of Medicare comes from the trust fund, about 15  percent comes from your copay, the rest comes right out of the general  fund.\n\nAre we allowed to tell each other, the lobbyists, the activists, the  people on social media making absolute crap up? How about our voters?  Are we allowed to get in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Medicare, about 38, 40 percent  of it is covered by the trust fund. That is the hospital portion, as we  typically refer to it. The rest of it actually comes out of the general  fund.\n\nOne of the most difficult numbers I have in my dataset here--because  this is the one that I see people get upset about--is the primary  driver of U.S. debt. Interest?…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…know every Member here has actually read. Seven years from now, the  Medicare part A trust fund, which is about 38 percent of Medicare  spending--the rest comes out of the general fund and members'  participation, I think is about 15 percent, the fees they pay--but that  38 percent, that trust fund is gone in 7 years, meaning hospitals,  surgery centers…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}]