[{"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…hosted a large  Thanksgiving dinner this last Thanksgiving.\n\nJoyce dedicated her life to God and was a faithful servant at Grace  Baptist Church in Waterbury, Connecticut. Her generous, giving, and  loving spirit made her a unique blessing to so many. Her work was  celebrated in the city of Waterbury and throughout the State of  Connecticut.\n\nTo say that…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698559/recognizing-joyce-reid-coleman"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…courts that have been a  bulwark.\n\nIn those first 100 days of the Roosevelt administration, F.D.R.  appealed to our ``better angels,'' our willingness to give back, to be  generous to our fellow Americans. He later inspired us with the call to  ``a rendezvous with destiny.'' In this administration, which is plagued  with corruption, crypto theft, and…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…their       responsibility to pay workers for trainings or other       professional development opportunities that are outside of       regular work hours. Despite the bill's generous-sounding       title, this bill would not give workers any more flexibility.       Instead, it allows employers to hold trainings and       professional development opportunities…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…the school's history.\n\nBowie State University is not only Maryland's oldest HBCU; it is one  of our State's finest higher education institutions, period.\n\nMacKenzie Scott's generous gift will help make Bowie State University  even more affordable and support the  groundbreaking research its students produce every day.\n\nWith her historic donations to Bowie…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698077/thanking-mackenzie-scott"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…Minnesotans.\n\nShe was a brilliant legislator and a tough negotiator. She was often  the smartest person in the room, but you wouldn't know it because she  was so humble. She was a generous friend, a good neighbor, and a mentor  to me and to so many others. She saw the dignity in all people and  treated everyone with respect. She led with humility, humor, and…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692786/in-memory-of-mark-and-melissa-hortman"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…children under the age of 5. During the time       that I am delivering these remarks to you, at least two       children will die of malaria in Nigeria.\n\nEvery year, with the generous support provided by the       American people, at the beginning of the rainy season we work       with the Nigerian ministry of health to get the medicines and       train…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…has been too slow to respond to the washout of jobs and  capacity across this country, and that is what is making our politics  so rocky.\n\nMr. Speaker, I thank you for your generous gavel this evening.\n\nMr. Speaker, I will include in the Record some materials that we were  not able to verbally enter this evening.\n\nMr. Speaker, I will invite Secretary…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695604/devastating-harm-caused-by-trump-administration"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…matter the role, he is  professional, warm, and a positive presence that makes the Senate come  to life.\n\nHe has been wonderful to our staffs, as well--kind, steady, and  generous in the way that matters every day in a place like this.\n\nSo, German, on behalf of all of us in the Senate, thank you, thank  you, thank you. Godspeed on your next adventure,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…lawlessness, and disdainfulness.\n\nWe must respect and love one another. We must remember that we are  not great or unique because we say we are great but because we are  just, generous, and fair.\n\nI hope that spirit can guide us the rest of this Congress because I  still have much I want to do in the coming year, not least of which is  keeping the government…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698817/retirement-announcement-of-steny-hoyer"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…with  Republicans in Congress, I created federal tax incentives for  investment in D.C. by businesses and individuals. The business tax  incentives were similar to, but more generous than, those available  under the national empowerment zone program. I got the D.C. tax  incentives continuously reauthorized until 2011, when Congress refused  to extend these…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697733/introduction-of-a-bill-to-designate-the-district-of-columbia-as-an-empowerment-zone"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…sentence talks  about that value that you all showed me through your kindness. Whether  it was in the train or passing in the hallway, you all seem to always  have a smile, a generous word. Even on the days you were haggard and  weary, ``E pluribus unum''--the beginning of that sentence is, if we  are to be a great people, we must love one another, we must…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Kirsten Gillibrand", "party": "Democrat", "sentence": "…his willingness to create a bipartisan regulatory  framework for an industry that desperately needs it.\n\nI have been in the Senate now since 2009. I have never seen a more  generous bipartisan process than I saw on this legislation. I have  never seen a more serious group of Senators get together to try to  write legislation of first impression than I…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692380/9999"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…mine, so I will read them directly.  ``I could write endless words about how many will be devastated by  these funding cuts, but this is not that kind of letter. Despite my  generous nature, cancer has taught me to be selfish.\n\n``Every single day, I think about my mortality. How long do I have  left? Is that shoulder pain or something else? Will I be alive…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692074/condemning-anti-semitism"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…main architects of  with Republican colleagues, God bless them, people like Cornyn and  others.\n\nI want to take people back to what the insider conversations--and you  were generous. I want to remind you, teasingly, on the floor, you never  asked me if you could publish my text messages, but you put them in  your book.\n\nMr. BOOKER. It is a great book.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…received a $40,000 bill from imports from Taiwan. It is just a  small business.\n\nAnd, meanwhile, big businesses have CEOs meeting directly with the  President and receiving generous exemptions.\n\nIt is Robin Hood in reverse. Trump is taking from hard-working,  regular people, and he is transferring the wealth to the millionaires  and billionaires in our…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…supporter--qualities  for which I am sincerely grateful.\n\nToday, I ask my colleagues to join me in recognizing Marshall  Brachman for his enduring contributions to civic life, his generous  spirit, and his invaluable friendship. I extend my warmest wishes to  him and his family on this milestone birthday and thank him for the  positive impact he continues to…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693060/recognizing-the-75th-birthday-of-marshall-brachman"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…standard of American aviation.\n\nThe One Big Beautiful Bill Act strengthens our social safety net  while better stewarding the tax dollars of hardworking Americans.\n\nAmericans are generous people, but we cannot allow the government to  abuse that generosity. Programs like Medicaid and SNAP were intended  for the most vulnerable populations in our country: pregnant…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692073/condemning-anti-semitism"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…values that include compassion and dedication to God, family,  and country.\n\nThese monuments serve as symbols of all the values the Scottish Rite  stands for.\n\nI thank the generous donors: Illustrious Brother Albert Nelson, Jr.,  and Lady Nellie; Dr. and Sir Knight James Arnold and Lady Barbara;  Illustrious Brother Charles White and Lady Nordene; and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699709/retirement-of-judge-ronnie-fender"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…million people who are  here on student visas, work visas, or tourist visas. As far as people  who want to spend a short time here, particularly to work, we are even  more generous that way. I have heard of no strong efforts being made to  greatly reduce these numbers.\n\nAgain, we have to remind our young people, our constituents, not to  put up with…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…community collaboration.\n\nSince opening in 1976, the theater has served as a home for community  productions and regional events, thriving because of community  initiative and generous local support. Led by President Mike Jewell,  the anniversary celebration honored the theater's boards and volunteers  for their contributions and welcomed Mark Fischer, an…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699896/delivering-for-iowa"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…never get tired of that joke.\n\nMr. Speaker, as we consider the critical reforms in the  reconciliation process, I rise today to make the case for why we must  eliminate the generous Federal subsidies for wind and solar energy paid  for by taxpayers.\n\nBy continuing to incentivize these intermittent energy sources with  generous tax credits, we are distorting…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690785/big-beautiful-bill"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…to 2005 has  uncovered decades of corruption and mismanagement in this donation  system. It has left vulnerable patients to die on waiting lists while  unused organs from generous American donors go to waste.\n\nSpeaking of waiting lists, I have been concerned about the reports of  those on the waitlist being skipped over. This furthers the distrust in…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690102/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…to grow in terms of the year-over-year cost  given, A, the rising cost of healthcare; and, B, increased enrollment.  When you are the only State that is offering this most generous  benefit, it entices people to come to your State. Indeed, that is why  it went up 46 percent this year.\n\nThat is why, last year, the San Diego border sector had the most…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688154/protect-medicaid-benefits-for-american-citizens"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "Mr. KENNEDY. Mr. President, as you well know, the American people are  the most generous people in the entire world. In our country, when you  are hungry, we feed you; when you are homeless, we house you; when you  are too poor to be sick, we will pay for your…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…upon not making too much money and, of our primary concern today, not  marrying somebody who makes too much money.\n\nFrequently, these programs are, in certain ways, more generous than  the middle class normally receives. A perfect example would be section  42, low-income tax credits. I have known people who have looked for  housing, and the housing…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…if you are a single parent, then you may be eligible  for all of these programs. If you are married, then you may be eligible  for none of the programs.\n\nI think the most generous of the group is low-income housing, or  Section 8 vouchers, whatever. In any event, it is not unusual to look  up a hypothetical in which if a woman marries say the father…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…DOI used ignores benefits like the       NPR-A Impact Mitigation Grant program. This grant program       creates a legal requirement for local communities to       receive generous revenues from projects. If project       development is slowed or halted by the new rule, Alaska       Native communities will lose enormous revenues for public       services,…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…one more time the  perverse incentives of our welfare state.\n\nI will just mention one type right now: Section 42, low-income  housing. Section 42 low-income housing is very generous to property  developers, who wind up only having to pay for 30 percent of the cost  of their housing.\n\nWorse, because it is new housing, I had a staffer looking for a new…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689925/perverse-incentives-of-our-welfare-state"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…doing things.\n\nPrograms like food stamps; low-income housing; earned income tax  credit; Women, Infants, and Children; Medicaid; Pell grants; and  government daycare all are generous programs. You would lose those  benefits if you had another parent in the house with an income.\n\nOf course, this changes behavior, as well. I remember talking about  this…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Joan also contributes  to Gulfside's four major annual fundraising events, offering hands-on  help, inkind donations, and support wherever it's needed. In 2024, Joan  made a generous gift to the Raising Hope for Hospice capital campaign  to help build a new in-patient unit in New Port Richey. The soon-to- open Gulfside Center for Hospice Care will provide…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690776/recognizing-joan-moore"}]