[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…more money for Ukraine will  not end the war. This is absolutely in the interests of United States'  national security.\n\nMr. Chairman, I yield 1 minute to the gentleman from Ohio (Mr.  Turner).\n\nMr. SMITH of Washington. Mr. Chair, I am prepared to close.\n\nMr. Chairman, I agree with all of the arguments that were made. I  think the most crucial point here…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Al Green", "party": "Democrat", "sentence": "Mr. GREEN of Texas. Mr. Speaker, and still I rise.\n\nMr. Speaker, I thank Chairman Hill; the gentleman from Ohio (Mr.  Davidson); and the ranking member for allowing me to carry and present  the Systemic Risk Authority Transparency Act.\n\nMr. Speaker, following the failures of Silicon…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697285/systemic-risk-authority-transparency-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Speaker, I enthusiastically rise in support of the Innovation  Mitigation Partnerships for Asphalt and Concrete Technologies Act, or  the IMPACT Act, H.R. 1534.\n\nA good gentleman from Ohio (Mr. Miller) and a fantastic gentlewoman  from North Carolina (Mrs. Foushee) have reintroduced this bipartisan  bill, and I salute them.\n\nMrs. Foushee is very much a leader…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688940/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "Ms. MATSUI. Mr. Speaker, I thank Representative Dingell for yielding  me time, and I thank the gentleman from Ohio (Mr. Latta), my friend,  for his bipartisan partnership on this important issue.\n\nMr. Speaker, I rise today in support of the NTIA Reauthorization Act.  We introduced…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690255/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…push on us to end these trade wars and  the high cost of living, including energy costs.\n\nMr. SPEAKER pro tempore. Is there objection to the request of the  gentleman from Ohio?\n\nMr. LANDSMAN. Mr. Speaker, I hope my colleagues will join me in  voting for the motion to recommit.\n\nMr. LANDSMAN. Mr. Speaker, I have a motion to recommit at the desk.\n\nMr.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698058/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…``no,'' and I reserve the  balance of my time.\n\nMr. PALLONE.  Castor), the ranking member of our  Subcommittee on Energy.\n\nMr. Speaker, I have a lot of respect for the gentleman from Ohio (Mr.  Balderson), who just spoke, but the bottom line is that I think it is  dishonest for Republicans to claim that the cost of compliance with  environmental regulations…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…Russia and NATO is in our best national  security interests.\n\nMr. Chair, I urge a ``yes'' vote.\n\nMr. AUSTIN SCOTT of Georgia. Mr. Chair, I yield 1\\1/2\\ minutes to the  gentleman from Ohio (Mr. Turner).", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695263/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…double  the energy and the electricity that the solar field produces.\n\nLuckily, the Trump administration restored the council in June of  this year, and I applaud the gentleman from Ohio (Mr. Rulli) for  offering this bill to reaffirm President Trump's actions.\n\nWe need more coal, not less. But coal policy can be complex. Coal  production falls within…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695769/national-coal-council-reestablishment-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…time when our friends in Europe are literally begging for it, and  I know our friends from Japan and Korea are asking for it.\n\nMr. GUTHRIE. Mr. Chair, I yield to the gentleman from Ohio (Mr.  Balderson), another good friend. I am yielding to all of my good  friends, but I yield to a very valued member of the Committee on Energy  and Commerce.\n\nMr. GUTHRIE.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697089/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…LaMalfa), who is the Western Caucus chairman.\n\nMr. GRAVES. Mr. Chair, may I inquire as to the time remaining.\n\nMr. GRAVES. Mr. Chair, I yield 2 minutes to the gentleman from Ohio  (Mr. Taylor).\n\nMr. GRAVES. Mr. Chair, I yield 2 minutes to the gentleman from  Indiana (Mr. Shreve).\n\nMr. GRAVES. Mr. Chairman, I yield 2 minutes to the gentleman from  Minnesota…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698041/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…Committee on  Appropriations.\n\nMr. COLE. Mr. Chair, I yield an additional 30 seconds to the  gentleman from Florida.\n\nMr. COLE. Mr. Chair, I yield 5 minutes to the gentleman from Ohio  (Mr. Joyce), my very good friend and the distinguished chair of the  Financial Services and General Government Subcommittee of the  Appropriations Committee.\n\nMr. COLE.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Mr. Chairman, I yield myself such time as I may consume.\n\nMr. Chairman, I rise in support of H.R. 3638, the Electric Supply  Chain Act, sponsored by my colleague, the gentleman from Ohio (Mr.  Latta).\n\nThis legislation directs the Department of Energy to conduct ongoing  assessments and report to Congress on the components and infrastructure  supply chain…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…systems.\n\nMadam Speaker, I urge my colleagues to support the legislation, and I  reserve the balance of my time.\n\nMr. GUTHRIE. Madam Speaker, I yield 3 minutes to the gentleman from  Ohio (Mr. Latta), my good friend and colleague on the Committee on  Energy and Commerce, the chairman of the Subcommittee on Energy.\n\nMr. GUTHRIE. Madam Speaker, I yield 4…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697882/state-planning-for-reliability-and-affordability-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…temporary scheduling orders, and that  order is now set to expire on September 30 of this year.\n\nThat is why the HALT Fentanyl Act, led by myself and my friend, the  gentleman from Ohio (Mr. Latta) in this House and then Senators Cassidy  and Heinrich in the Senate, is critically needed.\n\nThis bill aims to curb overdose deaths by permanently scheduling…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…for this legislation for the mutual  benefit of the people of Georgia and the people of the United States.\n\nMr. MAST. Madam Speaker, I yield 2 minutes to the gentleman from Ohio  (Mr. Davidson).\n\nMr. MAST. Madam Speaker, I yield myself the balance of my time.\n\nMadam Speaker, I firmly believe that every country in the world  should choose the United States…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…grandchildren will be enslaved to a debt that will dwarf our current  monstrosity.\n\nMrs. McCLAIN. Mr. Speaker, that was fear-mongering at its best.\n\nI yield 1 minute to the gentleman from Ohio (Mr. Davidson).\n\nI can't take the fear-mongering anymore. Let me correct the truth  with the other half of the truth. We are talking about PEPFAR: $4.4  billion, and we…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…hope we can  get bipartisan support. We will put the bill on the President's desk,  and I believe the President will sign the bill.\n\nMr. Chair, I yield 2 minutes the gentleman from Ohio (Mr. Latta), the  chairman of the Subcommittee on Energy.\n\nMr. GUTHRIE. Mr. Chair, I yield 2 minutes to the gentleman from  Georgia (Mr. Carter), the chair of the Subcommittee…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Madam Speaker, I yield to the gentleman from Utah (Mr.  Owens).\n\nMadam Speaker, I yield to the gentleman from Georgia  (Mr. Allen).\n\nMadam Speaker, I yield to the gentleman from Ohio (Mr.  Taylor).\n\nMadam Speaker, I yield to the gentlewoman from Texas  (Ms. Van Duyne).\n\nMs. VAN DUYNE. Madam Speaker, the One Big Beautiful Bill Act that we  passed is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694791/promises-made-promises-kept"}]