[{"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…California (Ms. Jacobs).\n\nMr. MEEKS. Mr. Chairman, may I inquire as to how much time is  remaining.\n\nMr. MEEKS. Mr. Chairman, I yield the balance of my time to the  gentleman from Florida (Mr. Mills).", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695262/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…business owners in rural communities.\n\nI will close by thanking the gentleman from Montana (Mr. Downing),  the gentleman from New Hampshire (Mr. Pappas), and the gentleman from  Florida (Mr. Bean) for their partnership on this important, bipartisan  legislation. I also thank Chairman Williams and Ranking Member  Velazquez for their support of this bill.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687930/rural-small-business-resilience-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Speaker, I yield 1 minute to the gentlewoman from  Oregon (Ms. Dexter), who is both a mom and a doctor.\n\nMr. RASKIN. Madam Speaker, I yield 1 minute to the gentleman from  Florida (Mr. Frost).\n\nMr. RASKIN. Madam Speaker, I yield 1 minute to the gentlewoman from  Illinois (Mrs. Ramirez).\n\nMr. RASKIN. Madam Speaker, I yield myself such time as I may consume.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698345/protect-childrens-innocence-act"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…gentleman from Utah (Mr. Owens), to help  advance this bill through our markup and to the floor today. We are  both original cosponsors of this resolution from the gentleman from  Florida, Mr. Donalds.\n\nH. Res. 137 will rename the House Press Gallery for an amazing  American, Frederick Douglass.\n\nMany know Douglass as an abolitionist and orator. Formerly…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692225/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…be any worse than the situation  that exists today where they have six ZIP Codes for a population of  1,500 people.\n\nLuckily, we have Members of Congress like the gentleman from Florida  (Mr. Diaz-Balart) who chairs the committee and who is bringing the bill  out later this week. He has the common sense to understand that the  post office needs to get…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693853/improving-community-zip-codes"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…conduct a comprehensive  assessment of emerging threats and potential countermeasures.\n\nMr. GARBARINO. Madam Speaker, I yield such time as he may consume to  the gentleman from Florida (Mr. Gimenez).\n\nMr. GARBARINO. Madam Speaker, I have no further speakers. In closing,  I, again, urge my colleagues to support H.R. 1608, and I yield back the  balance of my…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Mississippi (Mr. Ezell) who is also the chair of the Subcommittee on  Coast Guard and Maritime Transportation.\n\nMr. GRAVES. Madam Speaker, I yield 2 minutes to the gentleman from  Florida (Mr. Webster).\n\nMr. GRAVES. Madam Speaker, I yield 2 minutes to the gentleman from  North Carolina (Mr. McDowell).\n\nMr. GRAVES. Madam Speaker, I don't have any further speakers.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…entrepreneurs.\n\nMadam Speaker, I urge my colleagues to vote ``yes'' on H.R.\n\nMr. WILLIAMS of Texas. Madam Speaker, I yield such time as he may  consume to the gentleman from Florida (Mr. Patronis).\n\nMr. WILLIAMS of Texas. Madam Speaker, I have no further speakers, and  I am prepared to close.\n\nMr. WILLIAMS of Texas. Madam Speaker, H.R. 5788 provides transparency…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699188/504-program-risk-oversight-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, I thank my good friend, the gentleman from  Florida (Mr. Bilirakis), for yielding. I really support and thank the  gentleman for the work that he has done on this legislation to get it  to where we are today.\n\nMr. Speaker,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690256/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…local boundaries. H.R. 672 addresses the concerns of various  localities and establishes new ZIP Codes for communities across the  Nation.\n\nMr. Speaker, I thank the gentleman from Florida (Mr. Diaz-Balart),  the bill's sponsor, for putting this bill together.\n\nMr. COMER.  Hageman).\n\nMr. COMER. Mr. Speaker, I urge passage, and I yield back the balance…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693860/establishing-new-zip-codes"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…balance of my time.\n\nMr. SCHMIDT. Mr. Speaker, we have another colleague on our side who  now seeks recognition. I yield such time as he may consume to the  gentleman from Florida (Mr. Fine).\n\nMr. SCHMIDT. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, I thank all of our colleagues who have engaged in this…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "John James", "party": "Republican", "sentence": "…Speaker, I rise today in support of my bill, H.R.  2444, the Promoting Resilient Supply Chains Act of 2025.\n\nI especially thank my chairman, friend, and mentor, the gentleman  from Florida (Mr. Bilirakis), for his leadership and support. I also  thank my good friend, the gentlewoman from Michigan (Mrs. Dingell), who  has been a mentor to me on the ways…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690187/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…bill is about fairness and conservation. It ensures the  Miccosukee Tribe has the autonomy to protect their home, their land,  and their way of life.\n\nI thank the gentleman from Florida (Mr. Soto) for cosponsoring this  measure. I urge my colleagues to join me in supporting H.R. 504.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693410/miccosukee-reserved-area-amendments-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…colleagues for their time. I urge all Members  to support this bipartisan package, and I reserve the balance of my  time.\n\nMr. COLE. Mr. Chairman, I yield 5 minutes to the gentleman from  Florida (Mr. Diaz-Balart), my very good friend and the vice chair of  the full committee and chair of the National Security, Department of  State, and Related Programs Subcommittee…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Shreve).\n\nMr. GRAVES. Mr. Chairman, I yield 2 minutes to the gentleman from  Minnesota (Mr. Stauber).\n\nMr. GRAVES. Mr. Chairman, I yield 2 minutes to the gentleman from  Florida (Mr. Patronis).\n\nMr. GRAVES. Mr. Chairman, I yield 2 minutes to the gentleman from  Colorado (Mr. Hurd).\n\nMr. GRAVES. Mr. Chairman, I yield 2 minutes to the gentleman from…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698041/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…amendment.\n\nMr. Chair, I yield 1\\1/2\\ minutes to the gentlewoman from Minnesota  (Ms. McCollum), the ranking member.\n\nMr. CALVERT. Mr. Chair, I yield 1 minute to the gentleman from  Florida (Mr. Fine).\n\nMr. CALVERT. Mr. Chair, I yield back the balance of my time.\n\nMr. CALVERT. Mr. Chair, I rise in opposition to the amendment.\n\nMr. CALVERT. Mr. Chair, Jordan remains…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Carter), the chair of the Subcommittee on Health, an  important worker on this piece of legislation and my good friend.\n\nMr. GUTHRIE. Mr. Chair, I yield 2 minutes to the gentleman from  Florida (Mr. Dunn), my good friend who is the vice chair of the Health  Subcommittee of the Energy and Commerce Committee.\n\nMr. GUTHRIE. Mr. Chair, I want to point out that…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…and others of the severity of juvenile crimes in the city.\n\nCitizens of D.C. and visitors to our Nation's Capital deserve to feel  safe.\n\nMr. Speaker, I thank the gentleman from Florida (Mr. Donalds) for  leading this effort again in this Congress, and I encourage my  colleagues to join me in supporting this legislation.\n\nMr. COMER.  Boebert).\n\nMr. COMER.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695558/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "Mr. DOWNING. Mr. Speaker, I thank my friend and colleague, the  gentleman from Florida (Mr. Haridopolos) for arranging this Special  Order hour.\n\nMr. Speaker, I rise today in strong support of H.R. 6644, the Housing  for the 21st Century Act.\n\nAmericans…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699815/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "Mr. JOYCE of Ohio. Mr. Chair, as the designee of Mr. Mast, I have an  amendment at the desk.\n\nMr. JOYCE of Ohio. Mr. Chairman, I yield to the gentleman from  Florida (Mr. Mast), the true sponsor of this amendment who has just  arrived to state his position.\n\nMr. JOYCE of Ohio. Mr. Chairman, what else can I say after hearing  the…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692949/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}]