[{"senator": "Angie Craig", "party": "Democrat", "sentence": "…reserve the balance of my time.\n\nMs. CRAIG. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, I, too, would like to thank the gentleman from  Pennsylvania, Chairman G.T. Thompson, and his team for working on this  consumer protection legislation in a bipartisan manner.\n\nI believe bipartisan legislation is always preferable…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…has been corrected to read: minutes as the  designee of the minority leader.) GENERAL LEAVE   The  SPEAKER pro tempore. Is there objection to the request of the  gentleman from Pennsylvania?    Mr. Speaker, I am    ========================= END NOTE =========================       honored and proud to represent the people of Pennsylvania, good,\n\nhardworking,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…years.\n\nMr. MAGAZINER. Mr. Speaker, I now recognize someone who is new to  Congress but who I know is passionate about this issue and I believe  campaigned on it, the gentleman from Pennsylvania (Mr. Bresnahan).\n\nMr. MAGAZINER.  Stansbury), a good friend and a leader on the Oversight  Committee who I know is committed to strong ethics reform.\n\nMr. MAGAZINER.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691216/stock-trading-ban-for-members-of-congress"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the FCC every 2  years. In turn, the FCC must make these reports publicly available on  its website.\n\nI thank the gentleman from New Jersey (Mr. Menendez) and the  gentleman from Pennsylvania (Mr. Joyce) for their bipartisan leadership  on this bill. It is an important step in protecting our communications  networks from bad actors and foreign adversaries.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693434/communications-security-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…from the Government of the United States. The workers are  sort of on their own. They are trying to say: Hey, wait a minute. We  want to work.\n\nThey work hard. The gentleman from Pennsylvania should sit in front  of a glass furnace 8 hours a day in 90 degrees blowing in his face.  That won't happen to people from Harrisburg, largely because they are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694952/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…support of H. Con. Res. 9, which authorizes the use of the  Capitol Grounds for the 44th Annual National Peace Officers' Memorial  Service on May 15, 2025. I thank the gentleman  from Pennsylvania (Mr. Perry) for his leadership as the subcommittee  chair.\n\nThis incredibly important event, which is hosted by the National  Fraternal Order of Police, will honor…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689660/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…legislation forward. I  urge my colleagues to vote in favor of H.R. 250, and I reserve the  balance of my time.\n\nMr. STEIL. Madam Speaker, I yield 5 minutes to the gentleman from  Pennsylvania (Mr. Fitzpatrick) to speak on the bill.\n\nMr. STEIL. Madam Speaker, I have no further speakers, and I am  prepared close.\n\nMr. STEIL. Madam Speaker, I would like…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688218/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…floor.\n\nMr. Speaker, I urge support for H.R. 2212, and I reserve the balance  of my time.\n\nMr. GARBARINO. Madam Speaker, I yield such time as he may consume to  the gentleman from Pennsylvania (Mr. Mackenzie).\n\nMr. GARBARINO. Madam Speaker, I, again, urge my colleagues to support  H.R. 2212, and I yield back the balance of my time.", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696795/dhs-intelligence-rotational-assignment-program-and-law-enforcement-support-act"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "Mr. MASSIE. Mr. Chair, I rise in support of our amendment. This is  cosponsored by the gentleman from Pennsylvania (Mr. Perry) and the  gentleman from Texas (Mr. Roy). I regret that we have to offer this  amendment.\n\nWhat I am going to describe will probably sound like a bad…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699290/amendment-no-1-offered-by-mr-massie"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…the Potomac River Basin Compact to which consent       was given by Public Law 91-407 (84 Stat. 856).\n\nMr. BARRETT.  3428.\n\nMr. Speaker, I commend my colleague, the gentleman from Pennsylvania  (Mr. Bresnahan), for his hard work on this bill.\n\nMr. Speaker, the Mid-Atlantic River Basin Commissions, for the  Susquehanna, Delaware, and Potomac Rivers, came…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695003/mid-atlantic-river-basin-commissions-review-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…term in section 3 of the Communications Act of 1934 (47       U.S.C. 153).\n\nMr. Speaker, I rise in support of H.R. 1717, the Communications  Security Act, led by the gentleman from Pennsylvania's 13th District  and the gentleman from New Jersey's Eighth District.\n\nThe bill strengthens the cybersecurity of critical telecommunications  infrastructure by permanently…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693435/communications-security-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…thank my good friend from  California for his message and for his willingness to always be here.\n\nMr. MOORE of Utah. Mr. Speaker, I appreciate the message of the  gentleman from Pennsylvania (Mr. Meuser). I think it is actually one of  the most important things to be focusing on right now.\n\nMr. Speaker, I take a lot of questions from folks back home.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…amendment to ensure our servicemembers have the most up-to-date  technology to support our warfighters.\n\nMr. JOYCE of Pennsylvania. Madam Chair, I yield to the gentleman from  Pennsylvania (Mr. Mackenzie).\n\nMr. JOYCE of Pennsylvania. Madam Chair, I reserve the balance of my  time.\n\nMr. JOYCE of Pennsylvania. Madam Chair, I yield back the balance of…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693691/department-of-defense-appropriations-act-2026"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…this bill signals that the United States will not  tolerate the use of state violence to extract profit from the bodies of  the persecuted.\n\nI thank my friend, the gentleman from Pennsylvania (Mr. Perry), along  with his bipartisan cosponsors for their leadership on this critical  human rights issue.\n\nMr. Speaker, I urge strong support of this legislation,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…Biggs).\n\nMr. CRANE. Mr. Chairman, I yield 45 seconds to the gentlewoman from  Florida (Mrs. Luna).\n\nMr. CRANE. Mr. Chair, I yield such time as he may consume to the  gentleman from Pennsylvania (Mr. Perry).\n\nMr. CRANE. Mr. Chairman, may I inquire how much time I have  remaining.\n\nMr. CRANE. Mr. Chairman, a vote against this amendment is a vote to  preserve…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699052/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "Mr. FINSTAD. Mr. Speaker, I thank the gentleman from Pennsylvania for  yielding.\n\nI rise today in support of S. 222, the Whole Milk for Healthy Kids  Act, which I was proud to help introduce alongside Chairman Thompson.\n\nAs a fourth…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698181/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Scott Perry--a great American  and somebody I am proud to serve with here in this Congress and proud  to serve with in the House Freedom Caucus.\n\nI will yield to the gentleman from Pennsylvania in colloquy about how  he views whose side we are on. That is what I want to know: Whose side  are we on?\n\nAre we on the side of American citizens--Americans, including…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}]