[{"senator": "Steven Horsford", "party": "Democrat", "sentence": "Madam Chair, I thank the gentleman for yielding.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-02-25"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "Speaker, I thank the gentleman for yielding.", "title": "Relating to Consideration of the Senate Amendment to H.R. Rescissions Act of 2025", "date": "2025-07-17"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Speaker, I thank the gentleman for yielding.", "title": "District of Columbia Policing Protection Act", "date": null}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "2306, legislation introduced  by the gentleman from Michigan (Mr.", "title": "Adams Memorial-Great American Heroes Act", "date": "2025-12-09"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "First, let's discuss, as I think the gentleman has, what a trigger  lead is.", "title": "Homebuyers Privacy Protection Act", "date": "2025-06-23"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Is there objection to the request  of the gentleman from New York?", "title": "Saving Homeowners From Overregulation with Exceptional Rinsing Act", "date": "2026-01-07"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Speaker, I thank the distinguished gentleman from  the  great Commonwealth of Massachusetts (Mr.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "Speaker, I thank the gentleman from New  Jersey for yielding the time.", "title": "Saving Homeowners From Overregulation with Exceptional Rinsing Act", "date": "2026-01-07"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "The gentleman even referenced it in his comments, and we will  relentlessly defend our State's right to protect the air our children  breathe with robust fuel economy and pollution standards when Federal  standards fall short.", "title": "Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the National Park Service Relating to ``Glen Canyon National Recreation Area: Motor Vehicles''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the United States Fish and Wildlife Service Relating to ``Endangered and Threatened Wildlife and Plants; Endangered Species Status for the San Francisco Bay-Delta Distinct Population Segment of the Longfin Smelt''; Providing for Consideration of H.J. Res. Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine Pollution Control Standards; Heavy- Duty Vehicle and Engine Emission Warranty and Maintenance Provisions; Advanced Clean Trucks; Zero Emission Airport Shuttle; Zero-Emission Power Train Certification; Waiver of Preemption; Notice of Decision''; Providing for Consideration of H.J. Res. Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine Pollution Control Standards; Advanced Clean Cars Ii; Waiver of Preemption; Notice of Decision''; Providing for Consideration of H.J. Res. Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine and Nonroad Engine Pollution Control Standards; the `omnibus' Low NoX Regulation; Waiver of Preemption; Notice of Decision''; and for Other Purposes", "date": "2025-04-29"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "Speaker, I thank the gentleman from Colorado for  yielding.", "title": "Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program for Appliance Standards: Certification Requirements, Labeling Requirements, and Enforcement Provisions for Certain Consumer Products and Commercial Equipment''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``National Emission Standards for Hazardous Air Pollutants: Rubber Tire Manufacturing''; and Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Ocean Energy Management Relating to ``Protection of Marine Archaeological Resources''", "date": "2025-03-04"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Speaker, before I yield time, I will make sure that  the gentleman from Texas knows that without the ACA tax credit  extension, a middle-class 60-year-old couple in his district is seeing  their premium go up by $2,049 per month.", "title": "Lower Health Care Premiums for All Americans Act", "date": "2025-12-17"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "Luckily, we have Members of Congress like the gentleman from Florida  (Mr.", "title": "Improving Community Zip Codes", "date": "2025-07-21"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "Speaker, I thank the gentleman from  California for yielding, along with subcommittee ranking member and the  co-lead of this bill, Ms.", "title": "Women Veterans Cancer Care Coordination Act", "date": null}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "Chair, I yield 1\\1/2\\ minutes to the  gentleman from Nebraska (Mr.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "As the gentleman from Colorado noted, the success of this endeavor is  greatly aided by the designation of this particular site for the  purpose of establishing this memorial.", "title": "Adams Memorial-Great American Heroes Act", "date": "2025-12-09"}, {"senator": "French Hill", "party": "Republican", "sentence": "I am so pleased to have the leadership of the gentleman from Nebraska  (Mr.", "title": "Housing for the 21st Century Act", "date": "2026-02-09"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "I congratulate the gentleman for getting that bill signed  into law, the Congressional Gold Medal Act for those amazing patriots.", "title": "University of Utah Research Park Act", "date": "2025-12-15"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "Chair, I thank the gentleman from New  Jersey for bringing up this topic.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "Scott Perry", "party": "Republican", "sentence": "Chairman, I thank the gentleman from Arizona and the  chairman of the committee for his hard work on this bill.", "title": "Financial Services and General Government and National Security, Department of State, and Related Programs Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "3638, the Electric Supply  Chain Act, sponsored by my colleague, the gentleman from Ohio (Mr.", "title": "Electric Supply Chain Act", "date": "2025-12-10"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Chairman, I thank the gentleman for yielding.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "4090, sponsored by the gentleman from Minnesota (Mr.", "title": "Critical Mineral Dominance Act", "date": "2026-02-04"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Speaker, I thank the gentleman from Arizona (Mr.", "title": "Fiscal Responsibility", "date": "2025-05-01"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "Speaker, for the purpose of debate only, I yield  the customary 30 minutes to the gentleman from Massachusetts (Mr.", "title": "Providing for Consideration of H.R. Student Compensation and Opportunity Through Rights and Endorsements Act; Providing for Consideration of H.R. Combating the Lies of Authoritarians in School Systems Act; Providing for Consideration of H.R. Transparency in Reporting of Adversarial Contributions to Education Act; Providing for Consideration of H.R. Promoting Responsible Oversight to Eliminate Communist Teachings for Our Kids Act; Providing for Consideration of H.R. Small Business Regulatory Reduction Act of Providing for Consideration of H.R. Destroying Unnecessary, Misaligned, and Prohibitive Red Tape Act", "date": "2025-12-02"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "Speaker, I thank the gentleman from Missouri (Mr.", "title": "Calling Upon Local Communities to Support Organizations That Provide Resources and Aid Gold Shield Families in Their Time of Need", "date": "2025-05-13"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "Speaker, I thank everybody who worked on this bill, especially  the gentleman from Missouri (Mr.", "title": "Housing for the 21st Century Act", "date": "2026-02-09"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "1717, the Communications  Security Act, led by the gentleman from Pennsylvania's 13th District  and the gentleman from New Jersey's Eighth District.", "title": "Communications Security Act", "date": "2025-07-14"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "I support this bill, and I thank the gentleman from  California (Mr.", "title": "No Rogue Rulings Act of 2025", "date": "2025-04-08"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Speaker, I thank the gentleman for yielding me the  time.", "title": "Halt All Lethal Trafficking of Fentanyl Act", "date": "2025-06-11"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "I thank the gentleman for explaining that it is in wide distribution.", "title": "Law-Enforcement Innovate to De-Escalate Act", "date": "2026-02-12"}]