[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, I rise today to recognize and commend  Michele Manatt for her service at The George Washington University  Graduate School of Political Management (GSPM), where she has served on  the board since 2021, and for her contributions to our Nation.\n\nA native Washingtonian,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695835/recognizing-michele-manatt-for-her-service-to-the-george-washington-university-graduate-school-of-political-management"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Charleston Harbor, but if you go back  and look at the Battle of Charleston, that critical battle that we had  lost twice, General Gates was not a good general, and then George  Washington decided that he would get outside of his comfort zone.  George Washington decided that he would not hold Nathanael Greene's  background up in Rhode Island against him.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…In another, he wrote of the lawmakers:  ``SEDITIOUS BEHAVIOR, punishable by DEATH!''  Dangerously and unconstitutionally, he reposted a third party's post:  ``HANG THEM GEORGE WASHINGTON WOULD!!''\n\nPresident Trump's call for the execution of lawmakers is a reckless  and flagrant abuse of presidential power that promotes extra-judicial  punishment and…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697872/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Czar, Pope. It was made by the Executive.\n\nThe Framers of the Constitution in 1787 were dealing with leadership  that included the first President of the United States, George  Washington, the greatest general that has ever been President of the  United States. They revered George Washington.\n\nBut when they had to make a decision about who declared war,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Breslin,       Skidmore College; David C. Vladeck, Georgetown University Law       Center; Sanford Levinson, University of Texas at Austin       School of Law; Ira C. Lupu, George Washington University Law       School; Peter M. Shane, Ohio State University Moritz College       of Law; Ira P. Robbins, American University Washington       College of Law; Michael…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Breslin, Skidmore College;       David C. Vladeck, Georgetown University Law Center; Sanford       Levinson, University of Texas at Austin School of Law; Ira C.       Lupu, George Washington University Law School; Peter M.       Shane, Ohio State University Moritz College of Law; Ira P.       Robbins, American University Washington College of Law;       Michael…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Breslin, Skidmore College.\n\nDavid C. Vladeck, Georgetown University Law Center; Sanford       Levinson, University of Texas at Austin School of Law; Ira C.       Lupu, George Washington University Law School; Peter M.       Shane, Ohio State University Moritz College of Law; Ira P.       Robbins, American University Washington College of Law;       Michael…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…Vietnam War veteran living in Farmington, Minnesota.\n\nPeter was born in Boston in 1941, attended college at the University  of Cincinnati and received a master's degree from George Washington  University before enlisting in the United States Army in 1966. After  enlisting, he completed Officer Cadet School, Army Airborne School, and  Army Ranger School before…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689645/recognizing-first-lieutenant-peter-hamlin-us-army"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…and the way virtually every other country did it, they  decided that war was too big a decision for one person. I mean, they  were making this decision at the time that George Washington was  President. He was very respected and admired. He was a wartime general.  Deeply respected. But as much as they respected leaders like George  Washington, they said…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…have all sworn to uphold and defend. And leading  that Constitutional Convention, of course, was the greatest general  then and still in the history of the United States: George Washington.\n\nDespite the fact that he was in the room and leading the conversation  about what Constitution would govern this country, article I, section 8  put in a provision that…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696557/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…or any electronic use of the  U.S. dollar.\n\nThe Constitution says currency is what the U.S. Congress should  control, but this bill will say that the dollar must use George  Washington technology while China can have a digital yuan and the  crypto bros can have hidden digital money.\n\nIt is not surprising that President Trump was against crypto until…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693548/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Breslin, Skidmore College;       David C. Vladeck, Georgetown University Law Center; Sanford       Levinson, University of Texas at Austin School of Law; Ira C.       Lupu, George Washington University Law School; Peter M.       Shane, Ohio State University Moritz College of Law; Ira P.       Robbins, American University Washington College of Law;       Michael…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…constitutional democracy, and we should not allow it to  gain a foothold in the Government of the United States of America.\n\nMr. Speaker, let us adhere to the spirit of President George  Washington, who said in his famous letter in 1790 to the Hebrew  Congregation of Newport, Rhode Island, that ``the Government of the  United States . . . gives to bigotry no sanction,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…within the  Department of Veterans Affairs and congratulate her on her retirement.\n\nRebecca began her federal government career as a graduate student at  The George Washington University in Washington, D.C., when she joined  the U.S. Department of Veterans Affairs. Over the course of nearly four  decades, she served in a variety of roles within the VA,…", "date": "2026-02-17", "source_url": "https://justfacts.votesmart.org/public-statement/1700085/recognizing-rebecca-sawyer-smith"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Meanwhile--meanwhile--billionaires like Elon Musk have been handed  the keys to the Federal Government with little accountability.\n\nDonald Trump claims he is a better President than George Washington,  but he takes inspiration more from the likes of Viktor Orban or worse.\n\nSo 100 days into Donald Trump's second term, what exactly do  Americans have to feel good about?…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690262/trump-administration-first-100-days"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…as a lasting reminder of the county's history and progress.\n\nNamed for James Wood, founder of Winchester, colonel of the Virginia  Continental Militia, and friend of George Washington, the school stands  on a foundation of history, leadership, and service.\n\nToday, James Wood High School is led by Principal R. Shelly Andrews  and thrives by promoting…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691575/recognizing-the-75th-anniversary-of-james-wood-high-school"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…His All-Holiness in 1997 when it awarded him the Congressional Gold  Medal, Congress' highest honor. This distinguished award has been  bestowed upon such luminaries as George Washington and Winston  Churchill. Remarkably, the legislation for His All-Holiness's Gold  Medal attracted more of the Members of Congress as cosponsors than any  other bill introduced…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695653/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…guidance  to those in need.\n\nAs native of Bethesda, Maryland, John's roots run deep in the greater  Washington, D.C., area. Graduating from Georgetown University and  George Washington University Law School, John has committed his life to  serving his community and giving back to those who helped him along the  way. Above all else, I know what John…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699462/congratulating-john-w-rauber-jr-on-his-retirement-after-25-years-of-distinguished-service-at-john-deere-company"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…different visions of Executive power.  Yet they both agreed that it was vitally important to entrust the power  to declare war to Congress, not the executive branch.\n\nGeorge Washington remarked that ``the Constitution vests the power of  declaring war with Congress; therefore no offensive expedition of  importance can be undertaken until after they…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…California, Rob earned his degree in Psychology  from Gonzaga University in 2009 as a Distinguished Military Graduate.  He also attended the Marine Corps University and George Washington  University, where he earned master's degrees in military studies and  legislative affairs, respectively. During his 16-year career in the  Army, Rob served in key tactical…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694101/recognizing-the-service-of-major-robert-coleman"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…are ready now. We are going to deliver what we  were sent here to do, and every American will benefit from it.\n\nIn 1793, just steps from where we stand today, President George  Washington laid the first cornerstone of the United States Capitol.  Over 50 years later, on July Fourth, Members of this body gathered once  again to lay a second cornerstone.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…sounds like: Tolerance, taken to its most extreme and destructive end.\n\nThis is not the classic Republican tolerance you find in the  Federalist Papers or the writings of George Washington and Thomas  Jefferson. It is a tolerance of anything and everything which  overpowers all reason and undermines all distinctions between right and  wrong, good and evil,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "James Risch", "party": "Republican", "sentence": "I come here, like my colleague, to defend the Constitution of the  United States of America.\n\nSince George Washington was President and he had to deal with a  Congress, every President has had to deal with a Congress or Members of  Congress who really wanted to be the Commander in Chief…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697780/9999"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…GUTHRIE. Mr. Speaker, I rise today to honor Seth Gold for his  service to the House Committee on Energy and Commerce.\n\nA native of Cincinnati, Ohio and graduate of The George Washington  University for both a Bachelor of Science in Public Health and Master  of Public Health--Seth began his career on Capitol Hill as a Health  Legislative Assistant for…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696705/recognizing-seth-gold"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…was the Tariff Act of  1789, which sought to generate revenue by placing a 5-percent tax on  all imported goods and was signed into law, after passage by Congress,  by George Washington.\n\nAlexander Hamilton's ``Report on Manufacturers'' is well known.  According to Professor Douglas Irwin of Dartmouth College, every tariff  recommendation put forth in…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…by her students. She has had a very distinguished career as  a public servant and has impeccable professional qualifications.\n\nJust as an example, as a law student at George Washington University,  she earned a recordbreaking 4.22 GPA. Her professors even wrote to the  Judiciary Committee prior to her hearing to explain that these  professors often…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696138/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…to  try to make progress to provide some relief for those small businesses,  but, Mr. Speaker, it is barely a drop in the bucket.\n\nThe chart next to me was compiled by George Washington University. It  shows the number of pages in the Federal Register, starting back in  1950. The Federal Register, of course, is the government book, the  government entity,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690784/big-beautiful-bill"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…11, 2025, at the age of 87.\n\nJon was a lifelong learner. He started a radio station. He studied  journalism at the University of Missouri, earned a master's degree from  George Washington University and a doctorate in international relations  from the American University. He worked for the New York Times at its  Washington D.C. bureau. It was the sudden…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697134/recognizing-dr-jon-cozean"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Minneapolis, Minnesota, Kyle was commissioned as an Infantry  Officer in 2008 through the University of Utah. He earned his master's  degree in Legislative Affairs from George Washington University in  2023.\n\nKyle was an honor graduate from the Army's Ranger School, Basic  Officer Leader's Course, and Air Assault schools. After completing  Airborne school…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694098/recognizing-the-service-of-lieutenant-colonel-kyle-frazer"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…selflessness have  made our Nation safer, and the first priority of the Federal Government  ought to be our own national security.\n\nNow, we have to think back to President George Washington's first  annual address to Congress, where he said: To be prepared for war is  one of the most effectual means of preserving the peace in the world.\n\nThat includes a…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692460/executive-calendar"}]