[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…this bill.                                                       May 21, 2025.      Hon. James Comer,      Chairman, House Oversight Committee,      Washington, DC.      Hon. Gerald Connolly,      Ranking Member, House Oversight Committee,      Washington, DC.\n\nChairman Comer and Ranking Member Connolly: As Mayor of       Washington, DC, I write to express…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692302/protecting-our-nations-capital-emergency-act"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…February 12, the  birthday of Abraham Lincoln, and February 14, the birthday of Frederick  Douglass. That is why it was done.\n\nThanks to the visionary leadership of President Gerald Ford--maybe  Gerald Ford was a woke President. It was Gerald Ford who decided that  we should have Black History Month. He made that decision. Was Gerald  Ford a woke President?…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…operations; reaper drones, Harriet jets, and fifth  generation fighters--incredibly lethal aircraft.\n\nBut this is not all. The largest aircraft carrier ever built, the USS  Gerald R. Ford is on its way right now from the Mediterranean. This  means we will see upward of an additional two dozen Super Hornets and  two dozen additional F-35s. This warship…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696564/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…place around Venezuela are, as  President Trump said, an armada, 16,000 U.S. personnel. This is open  source reporting as of 2 days ago, arrayed around Venezuela:\n\nThe USS Gerald R. Ford Carrier Strike Group: Carrier Air Wing 9, the  USS Winston Churchill, the USS Bainbridge, and the USS Mahan.\n\nThe Iwo Jima Amphibious Readiness Group, which includes:…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699109/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…subservient politburo and  judiciary.\n\nHarry Truman understood this. Dwight Eisenhower understood this. John  F. Kennedy understood this, and so did Lyndon Johnson, Richard Nixon,  Gerald Ford, Jimmy Carter, Ronald Reagan, George H.W. Bush, Bill  Clinton, George W. Bush, Barack Obama, and Joe Biden. These men,  whether you deem their Presidencies good or bad,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698929/greenland"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…vacancy on the District of Columbia Court of       Appeals and the Superior Court of the District of Columbia.\n\nSince its first list of applicants was sent to President R.       Gerald Ford, Jr. on May 8, 1975, the JNC has recommended more       than 93 candidates for 31 vacancies on the District of       Columbia Court of Appeals (Court of Appeals) and more…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Iwo Jima Amphibious Ready  Group, the 22nd Marine Expeditionary Unit, attack submarines, P-8  Poseidon aircraft, Aegis destroyers, F-35 fighter jets, and eventually  the USS Gerald R. Ford Carrier Strike Group. The administration never  explained why this buildup was necessary other than vague references to  drug interdiction. It was clear then and it…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…you might be impeached.\n\nThirty-four felonies, you can be impeached for that, but I am not  going to talk about those felonies today.\n\nI want you to understand something that Gerald Ford said about  impeachment, the former President of the United States of America,  because there are some people who have read the Federalist Papers. I  have read them. I…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…Carson or Jack Paar would think about all of  this. I am sure Alec Baldwin wouldn't like it, and President Trump  didn't like the way he treated him. Chevy Chase falling over Gerald  Ford would probably put him in bad positions, too. Comedy is comedy.  Free speech is free speech, and we shouldn't step on it.\n\nGod bless the First Amendment.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695703/authoritarianism-is-a-threat-to-democracy"}, {"senator": "Diana DeGette", "party": "Democrat", "sentence": "Ms. DeGETTE. Mr. Speaker. I rise today to honor the life and legacy  of my dear friend and mentor, Gerald P. McDermott--a highly regarded  trial attorney, advocate for justice, pillar of Denver's legal  community, and revered family man.\n\nJerry's career was defined by an unwavering…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690315/in-remembrance-of-gerald-p-mcdermott"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Constitution, is  the same law that has been used and can be used to impeach him again  for making his threats to democracy a reality. I will use that law  again.\n\nFormer President Gerald Ford was right--he was right then and now-- when he proclaimed that an impeachable offense is whatever a majority  of the House of Representatives considers it to be at a given…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…from exhibitions in  Africa to murals honoring historical figures in the United States.\n\nHe was the first Black artist to paint a sitting President when he  painted President Gerald R. Ford.\n\nHis contributions to the art world also include designing the Martin  Luther King Jr. Nonviolent Peace Prize Medal and the Challenger 7 space  shuttle logo.\n\nAs we…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…School\n\nFounders Lifetime Achievement Award: Dr. Dennis Humphrey,       PhD\n\nOmega Man of the Year: Sanford Crenshaw\n\nSuperior Service Award: Brian Bond\n\nService Pins: Gerald Hamilton, 55 Years; Howard Foard Jr.,       50 Years; Gerald Curry, 45 Years; Robert Drummer, 40 Years;       Julius Reynolds, 40 years; Earl Smith Jr., 40 Years; Shun…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697131/recognizing-omicron-kappa-kappa-chapter-of-omega-psi-phi-fraternity-inc-for-its-achievement-week-and-honorees"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…first service, laying the  foundation for a ministry that would thrive for generations.\n\nUnder the leadership of pastors, including Reverends Howard S. Ryan,  G.P. Hertweck, Gerald Ogg, Sammy Hayes, and Arnold Brown, the church  grew in both membership and outreach. Expanding facilities,  establishing new ministries, and adopting the name Bethel Temple…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696401/recognizing-the-70th-anniversary-of-bethel-temple-church-in-hampton-virginia"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Donald Trump wants to engage in military  hostilities against Venezuela, he must seek authorization from Congress  first.\n\nAs we speak, America's largest aircraft carrier, the Gerald Ford, is  on its way to the Caribbean. It is part of the largest military buildup  in our hemisphere that we have seen in decades.\n\nAccording to press reports, Donald Trump…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696558/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…creating similar conditions in our own backyard?  With over 10,000 U.S. troops, 8 warships, a Virginia-class submarine,  and dozens of F-35s already in the Caribbean, the USS Gerald Ford  strike group surging toward the region, the stage for folly is set. We  are told that only drug dealers are the target of U.S. operations, but  the consolidation of the…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Speaker, it is my honor to recognize Master Sergeant  (MSgt) Gerald Timmins for his valiant service with the U.S. Marine  Corps as a member of the Medevac crews during the Vietnam War. This  recognition is presented in correspondence with the…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692874/recognizing-master-sergeant-gerald-timmins-for-his-service-with-the-us-marine-corps-as-a-member-of-the-medevac-crews-during-the-vietnam-war"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Blumenstein, Rebecca: NBC NEWS; Blunt, Miles: FOX NEWS;       Boazman, Simon: AL JAZEERA ENGLISH; Boccia, Christopher: ABC       NEWS; Bock, Nicolas: BLOOMBERG RADIO & TV; Bodlander, Gerald:       FREELANCE; Boergers, Nicole: ZDF GERMAN TELEVISION; Boergers,       Torben: ARD GERMAN RADIO & TV; Bogan, Jr., Raymond: STRAIGHT       ARROW NEWS.\n\nBohn, Kevin: NEXSTAR…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…Saxbury,  Kenneth Schossow, Earl Seahorn, Barry Sittlow, Richard Skinner, Richard  Steedley, Marion Stille, Harry Stordahl, Ashley Sumerford, Robert  Tramp, Raymon Valdez, Gerald Vargo, Daniel Warren, Floyd Watson, Jr.,  Larry Weickum, Donald Weightman, James Widlar, Linda Wingate, David  Wining, Juan Zavala, Joe Zavala, Jr., Donald Zeidler.\n\nIt is…", "date": "2025-10-31", "source_url": "https://justfacts.votesmart.org/public-statement/1696496/recognizing-the-high-plains-honor-flight"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "Mr. WIED. Mr. Speaker, I rise today to honor the life and legacy of  Gerald ``Jerry'' Danforth, a distinguished Tribal leader, a decorated  Navy veteran, and a beloved husband, father, and grandfather, who  passed away on the morning of June 1, 2025,…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692114/recognizing-gerald-jerry-danforth"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…enacted by the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Gerald E. Connolly       Esophageal Cancer Awareness Act of 2025''.       SEC. 2. FINDINGS.\n\nCongress finds that--\n\n(1) esophageal cancer is the fastest increasing cancer       among…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691831/gerald-e-connolly-esophageal-cancer-awareness-act-of-2025"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Rowley, Madeleine:       The Free Press; Rozen, Courtney: Bloomberg Industry Group;       Rubashkin, Jacob: Inside Elections.\n\nRuoff, Alexander: Bloomberg Industry Group; Rupert, Gerald:       Deputy Director; Ryan, Timothy: Law360; Saenz, Cheryl:       Bloomberg Industry Group; Sakellariadis, John: Politico;       Salem, Sarah: Exchange Monitor Publications;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698171/members-entitled-to-admission-to-the-119th-congress-periodical-press-gallery"}, {"senator": "John James", "party": "Republican", "sentence": "…JAMES. Madam Speaker, this week, on November 29, our Nation marks  a milestone, the 50th anniversary of the Individuals with Disabilities  Education Act.\n\nIn 1975, President Gerald Ford, Michigan's only and greatest  President, signed the Education for All Handicapped Children Act into  law, making a simple but powerful promise that every child, no matter…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697119/marking-a-national-milestone"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…his convictions and committed to the conservative values that unite  us.\n\nIt is with great pride and deep gratitude that I join the Alden  Republican Committee in honoring Gerald J. Sanok--for a lifetime of  leadership, patriotism, and service to the Republican cause.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692272/recognizing-jerry-sanok-for-forty-years-of-committed-service-and-leadership"}]