[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…operations; reaper drones, Harriet jets, and fifth  generation fighters--incredibly lethal aircraft.\n\nBut this is not all. The largest aircraft carrier ever built, the USS  Gerald R. Ford is on its way right now from the Mediterranean. This  means we will see upward of an additional two dozen Super Hornets and  two dozen additional F-35s. This warship will…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696564/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Constitution, is  the same law that has been used and can be used to impeach him again  for making his threats to democracy a reality. I will use that law  again.\n\nFormer President Gerald Ford was right--he was right then and now-- when he proclaimed that an impeachable offense is whatever a majority  of the House of Representatives considers it to be at a given…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…subservient politburo and  judiciary.\n\nHarry Truman understood this. Dwight Eisenhower understood this. John  F. Kennedy understood this, and so did Lyndon Johnson, Richard Nixon,  Gerald Ford, Jimmy Carter, Ronald Reagan, George H.W. Bush, Bill  Clinton, George W. Bush, Barack Obama, and Joe Biden. These men,  whether you deem their Presidencies good or bad,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698929/greenland"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…Carson or Jack Paar would think about all of  this. I am sure Alec Baldwin wouldn't like it, and President Trump  didn't like the way he treated him. Chevy Chase falling over Gerald  Ford would probably put him in bad positions, too. Comedy is comedy.  Free speech is free speech, and we shouldn't step on it.\n\nGod bless the First Amendment.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695703/authoritarianism-is-a-threat-to-democracy"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…rise today to sound the alarm on the  military buildup in the Caribbean, edging us closer to a regime-change  war in Venezuela.\n\nThe Trump administration has sent the USS Gerald R. Ford aircraft  carrier, our largest aircraft carrier. Mr. Speaker, 10 percent of our  Navy is in the Caribbean, including destroyers and submarines.\n\nWe have got 15,000 troops…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698092/we-dont-need-another-regime-change-war"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "Mr. DeSAULNIER. Mr. Speaker, President Gerald Ford had a vision. He  signed the Individuals with Disabilities Education Act to protect the  most vulnerable amongst us: special needs kids.\n\nOne of the most cruel things I…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689920/department-of-education"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…people? The obfuscation suggests they don't  have genuine answers. The secrecy suggests they know this doesn't make  sense.\n\nNow the situation grows more dangerous. The USS Gerald R. Ford, our  largest and newest aircraft carrier, is headed to the Caribbean,  bringing additional warships and thousands of sailors and marines. This  is not a limited operation;…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…the  birthday of Abraham Lincoln, and February 14, the birthday of Frederick  Douglass. That is why it was done.\n\nThanks to the visionary leadership of President Gerald Ford--maybe  Gerald Ford was a woke President. It was Gerald Ford who decided that  we should have Black History Month. He made that decision. Was Gerald  Ford a woke President? I think…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…might be impeached.\n\nThirty-four felonies, you can be impeached for that, but I am not  going to talk about those felonies today.\n\nI want you to understand something that Gerald Ford said about  impeachment, the former President of the United States of America,  because there are some people who have read the Federalist Papers. I  have read them. I have…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…place around Venezuela are, as  President Trump said, an armada, 16,000 U.S. personnel. This is open  source reporting as of 2 days ago, arrayed around Venezuela:\n\nThe USS Gerald R. Ford Carrier Strike Group: Carrier Air Wing 9, the  USS Winston Churchill, the USS Bainbridge, and the USS Mahan.\n\nThe Iwo Jima Amphibious Readiness Group, which includes: the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699109/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…on the District of Columbia Court of       Appeals and the Superior Court of the District of Columbia.\n\nSince its first list of applicants was sent to President R.       Gerald Ford, Jr. on May 8, 1975, the JNC has recommended more       than 93 candidates for 31 vacancies on the District of       Columbia Court of Appeals (Court of Appeals) and more…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Jima Amphibious Ready  Group, the 22nd Marine Expeditionary Unit, attack submarines, P-8  Poseidon aircraft, Aegis destroyers, F-35 fighter jets, and eventually  the USS Gerald R. Ford Carrier Strike Group. The administration never  explained why this buildup was necessary other than vague references to  drug interdiction. It was clear then and it is…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…over, and here we are, building new nuclear  weapons, and they are building nuclear weapons.''\n\nPresident Trump, I have to say, you are right. He can join Richard  Nixon, Gerald Ford, and Ronald Reagan among the Presidents with major  arms control wins.\n\nMr. Speaker, as a Member of Congress, I have worked to reduce the  threat of nuclear weapons. With…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699036/expiration-of-new-start"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Venezuela, that included Special Forces, Marines, and specialized  units from all of our branches of government. He sent 13 warships to  the Caribbean, including the USS Gerald R. Ford Carrier Strike Group,  and several amphibious assault ships. More than 100 advanced combat  aircraft were deployed, including F-35s from the Vermont National  Guard. And…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698606/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Donald Trump wants to engage in military  hostilities against Venezuela, he must seek authorization from Congress  first.\n\nAs we speak, America's largest aircraft carrier, the Gerald Ford, is  on its way to the Caribbean. It is part of the largest military buildup  in our hemisphere that we have seen in decades.\n\nAccording to press reports, Donald Trump is…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696558/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…creating similar conditions in our own backyard?  With over 10,000 U.S. troops, 8 warships, a Virginia-class submarine,  and dozens of F-35s already in the Caribbean, the USS Gerald Ford  strike group surging toward the region, the stage for folly is set. We  are told that only drug dealers are the target of U.S. operations, but  the consolidation of the…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "John James", "party": "Republican", "sentence": "…JAMES. Madam Speaker, this week, on November 29, our Nation marks  a milestone, the 50th anniversary of the Individuals with Disabilities  Education Act.\n\nIn 1975, President Gerald Ford, Michigan's only and greatest  President, signed the Education for All Handicapped Children Act into  law, making a simple but powerful promise that every child, no matter…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697119/marking-a-national-milestone"}]