[{"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "Mr. CLEAVER. Mr. Speaker, I rise today with a deep sense of gratitude  for the opportunity to recognize a great Missourian, Mr. Gerard Joseph  Grimaldi, for his exemplary personal and professional accomplishments  as he begins his next chapter of life, enjoying retirement. An  experienced leader, dedicated…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688302/recognizing-mr-gerard-j-grimaldi-on-his-retirement-and-expressing-appreciation-for-a-lifetime-of-dedicated-service-to-our-community"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…Sidney Keller, Bruce Kemp,  Michael Kennedy, Ronald Kessinger, Thomas King, John Knespel, Bruce  Koerwitz, Michael Konshak, Robert Kronberg, John Kupfer, William  Langridge, Gerard Lemke, Cecelia Long, Johnny Lorenzini, John Loth,  Gary Marison, Karen Marison, Cisco Martinez, Harry Marxmiller, Rudolph  Mazur, George McCambridge, Daniel McKinney, Maurice…", "date": "2025-10-31", "source_url": "https://justfacts.votesmart.org/public-statement/1696496/recognizing-the-high-plains-honor-flight"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Education, Joe  Garisto--Materials, Mavrick Putnam--Marine Safety and Environmental  Protection, Lisa Repetto--Publications and Recreational Boating Safety  Program Visitations, Gerard Gaudry--Navigation Systems,  Tim Dolan--Operations and Rescue and Survival Systems, Mark Kolupa-- Secretary/Records, and Andre Skoinezny--Vessel Examinations. It is my  hope…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690718/recognizing-coast-guard-auxiliary-clearwater-flotilla-11-1s-75th-anniversary"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Emery, Audie: CNN; Correa, Pedro: AP-BROADCAST;       Correa Diaz, Pedro: TELEMUNDO NETWORK; Corredor, Jordan:       VENTANA PRODUCTIONS; Correll, Diana: FOX NEWS; Cortes,       Gerard: CARACOL TELEVISION; Cortes, William: TELEMUNDO       NETWORK; Corti, Stefano: RAI RADIO TELEVISIONE ITALIANE;       Corujo Oruna, Cristina: CBS NEWS; Corvo, Lily: NBC NEWS;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}]