[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…the world among advanced industrialized countries. We have  rates of gun violence and gun homicide that are 10 or 20 times higher  than Canada, the United Kingdom, France, Germany, Israel, and Japan.  You name it, nothing comes close to us.\n\nInstead of helping police officers by getting guns out of the hands  of criminals, our colleagues are just looking…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…often less free.\n\nThroughout our history, we have witnessed dictators and authoritarian  leaders suppress science and knowledge because it threatened their  rule.\n\nIn Nazi Germany, Jewish scientists were forced out of universities,  and research was put under complete control of the government. The  result was not only the loss of a generation of brilliant…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695652/respect-for-science-and-pursuit-of-truth"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…percent tariff, plus who knows how many more tariffs depending on the  day and how President Trump feels when he wakes up. Trinidad and  Tobago: 81 million, 10 percent tariff. Germany: 75 million. Mexico: 77  million.\n\nVery frustratingly for all of us, the sweeping global tariff order  unnecessarily increases prices and taxes on countries that have trade…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…and their funding is suddenly at risk, not because the  science failed but because politics did.\n\nWhile we fire researchers, other countries are sending job offers.  France, Germany, Canada, and Australia are rolling out the red carpet  for the scientists we are pushing out the door.\n\nWhile we make it harder for international students, researchers, and…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691392/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…certificate for all to see. I am a proud immigrant.\n\nShe came to this country at the age of 2. Her mother did not speak  English but brought three children on a boat from Germany to Baltimore  and ultimately to Illinois, where I grew up and my mother spent her  life. It was an indication of the American dream, as far as I am  concerned. Her son not…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696348/trump-administration"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…before the collapse of the murderous  dictatorship that was called the Soviet Union that occurred in 1991 and  had extended all the way from Russia all the way across Europe to  Germany to East Berlin, which has been free since 1991, a great  President, Ronald Reagan, served this Nation. He was elected twice.\n\nHe correctly identified Russia as the ``evil…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687991/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…tyranny. He was a part of that.\n\nI honor Alexander Drabik, from my own district. He was a great  soldier who was in the Army and was the first man to cross the Remagen  Bridge in Germany, which was the turning point of the war.\n\nFinally, I honor Roger Durbin, a veteran of our Army who gave me the  idea to create the World War II Memorial here where now over…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…just moved forward with the tariffs that he put in place. He did so  not just against China, not just against our adversaries, but against  allies like Canada, Mexico, France, Germany, and other countries. It  has been devastating to the American economy and businesses across the  country.\n\nHe ran for election telling the American people that he was going…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…International Atomic Energy Association said the agreement was working.  The allies and adversaries--Russia and China--were part of this deal,  as were the UK and France and Germany. Those who worked on the deal  said the agreement was working. It wasn't turning Iran from a bad actor  to a good actor. It wasn't stopping all of Iran's bellicose behavior.…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…studies at the Pontifical Oriental Institute of the Gregorian  University in Rome (Italy), the Ecumenical Institute in Bossey  (Switzerland), and the University of Munich (Germany). His doctoral  dissertation, submitted to the University of Athens (Greece), was in  the field of Canon Law, and he was a founding member of the Society of  Canon Law of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…one posed by China--while opening further  feuds with critical allies and partners.\n\nJust look at the letter signed the other day by leaders from Denmark,  France, the UK, Germany, Italy, Spain, and Poland reminding President  Trump that Denmark is a treaty ally of the United States and, in doing  so, effectively issuing a ``hands off'' on Greenland.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698621/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…country to participate in the Department of State's  prestigious Congress-Bundestag Youth Exchange (CBYX) Program.\n\nLaunched in 1983, CBYX selects high achieving youth from both Germany  and the United States to live in each other's country for one academic  year. During their year abroad, students will foster meaningful  relationships between America and…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693199/recognizing-avi-bender"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Mr. MERKLEY. Thank you so much to my colleague from Oregon for this  question.\n\nIt is very powerful to think about how fast the menace grew through  the Jewish community in Germany and how, if one did not recognize that  threat--and if I understood it right, the women in the family were the  ones who said: We have got to get out of here--\n\nMr. MERKLEY.--to…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…national park signage  that tells the truth about slavery, the genocide of indigenous  Americans, and the incarceration of Japanese Americans during World War  II.\n\nIn Nazi Germany, it started with burning books. In the USSR, they  erased people from photographs. In North Korea, they deleted political  leaders from online archives. Today, in the United…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699715/rewriting-history"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…country to participate in the Department of State's  prestigious Congress-Bundestag Youth Exchange (CBYX) Program.\n\nLaunched in 1983, CBYX selects high achieving youth from both Germany  and the United States to live in each other's country for one academic  year. During their year abroad, students will foster meaningful  relationships between America and…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693200/recognizing-emiko-mukai"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…the leading-edge, advanced, ultraviolet  lithography that is necessary to produce the most advanced  semiconductor chips, but other countries, like South Korea, Japan, and  Germany, are also part of that supply chain of critical equipment and  machinery. Working and winning the AI race means we have to work hand  in glove with our allies to ensure that…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697555/china"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Catholic High School at age  in 1941 and is currently the school's oldest living alumnus.\n\nHe is a World War II veteran. John was drafted at 18 and served in  England, Belgium, Germany, France, and the Netherlands as an Army  corporal in the field artillery attachment of the 5th Army Division,  the 9th Army spearhead, the 5th Armored Division, and the 29th…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688942/keaton-beasley-teaches-importance-of-financial-literacy"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…crap out of us because there  is this concept called term premium.\n\nAs the Ray Dalios and these people who are the billionaire experts  are saying: China is in the market. Germany is in the market. The  United States is bingeing on debt. There is almost not enough savings  in the world to finance the scale of borrowing, and much of that  borrowing is…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…U.S. Army Corps of Engineers in 1980 as part of  the historic first class of female graduates, Captain MacGibbon served  our Nation with distinction in leadership positions in Germany and  beyond.\n\nFollowing her Active-Duty service, Mrs. MacGibbon dedicated 22 years  to mentoring future Army leaders, assisting over 165 candidates in  earning admission to…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696747/recognizing-veterans-in-texas-third-congressional-district"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…United States of America.\n\nThroughout his tenure, General Rasch has embodied the spirit of a  soldier, inspiring those who have served with and under his leadership.\n\nBorn in Germany, where his father was stationed with Army Special  Forces, General Rasch's connection to the military began early in life.  He graduated from the University of Georgia and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695727/congratulating-lieutenant-general-robert-a-rasch-jr"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…ranks to  the highest levels of leadership within the Iowa Air National Guard.\n\nHis service carried him to many parts of the world, including Iraq,  Afghanistan, Qatar, and Germany. Yet through all his overseas  assignments, his heart remained in Iowa, where he guided and mentored  Guardsmen to ensure they were trained, supported, and prepared to  serve.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696101/recognizing-the-service-of-colonel-trenton-n-twedt"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…but also by his leadership. After 14 years in the  cockpit, he transitioned to staff roles, including serving as the Pol- Mil officer at U.S. European Command in Stuttgart, Germany. There, he  played a key role in operations in the Middle East, focusing on Israel,  Lebanon, and Syria.\n\nHe returned to the cockpit in 1999, joining the VF-14 Tophatters…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…current  state. That is a minimum for admission into NATO.\n\nMy colleagues couldn't blame them for thinking that it doesn't really  matter because even the biggest countries, like Germany, haven't  historically hit that threshold either, but their economy isn't that  big. Even if they were spending more, it wouldn't matter.\n\nMadam Speaker, this is the wrong…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690700/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…built a  loving family and a legacy of service.\n\nFollowing college, Mr. Matthys served on active duty in the United  States Army from 1970 to 1974, including time stationed in Germany, and  later in the Army Reserve until his honorable discharge as a Captain in  1981. His service to our Nation was marked by integrity and continued  through his 35 years…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690584/recognizing-the-retirement-of-bill-matthys"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…capital that goes into sovereign loans. His argument is: Our problem  is, there are not enough savings in the world. We are consuming more  money; it is us, China, Europe. Now Germany is going into the debt  markets as they are raising their spending caps.\n\nWhat happens in the world when there is a shortage of borrowable  money? Remember, every day when…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…East, and Australia. He led many bus tours throughout       the U.S. and tour groups 19 times to Israel, Jordan, and       Egypt. Two trips to the Passion Play Performance in Germany       were tucked into his travels also.\n\nA noted and gifted motivational speaker, Jim spoke to       several varied groups locally and around the country       including…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Road to Serfdom''  and ``Constitution of Liberty.'' This is a man who lived under  socialism. He lived through the Communist regimes of Stalin and Eastern  Europe and of Nazi Germany. He talked about the road to serfdom. Mr.  Speaker, we think of some of these policies potentially as the scenic  route to socialism.\n\nHe is someone who  understands market…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697143/denouncing-the-horrors-of-socialism"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…best  clothing stores in America by The New York Times.\n\nLou Taubert Ranch Outfitters first opened its doors in 1919 after  being founded by C. W. Taubert, an immigrant from Germany who grew  enamored with the cowboy spirit and the allure of the West.\n\nFrom its beginnings as a hardware store catering to the local  agricultural community, Lou Taubert has…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699737/recognizing-lou-taubert-ranch-outfitters"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…everything in your life go down,  particularly in an environment where interest rates are going to be  higher because we are borrowing so damn much money. It is not just us.  Germany is backing the debt markets. The world is bingeing on debts. If  you think interest rates are going to come crashing back down you are  delusional. The world has only so much…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…gates. They are taking  over Western Europe, and the United States is  next. They have taken over Western Europe, from what we heard about  what is going on in Great Britain, Germany, and Finland.\n\nIf you look at the Disinformation Governance Board, right now, there  were enough Republicans, enough free speech news outlets, probably even  enough Democrats…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}]