[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…stored in these tanks and in the ground for 80 years will begin to be  processed. This process, called vitrification--a process that other  countries, like France and Japan and Germany have all successfully  achieved--is basically taking the radioactive sludge and turning it  into a stable, storable glass. That is what the skilled workers at the  Hanford…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695342/hanford-site-cleanup"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…just moved forward with the tariffs that he put in place. He did so  not just against China, not just against our adversaries, but against  allies like Canada, Mexico, France, Germany, and other countries. It  has been devastating to the American economy and businesses across the  country.\n\nHe ran for election telling the American people that he was going…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…community  matter.\n\nAt the University of Toledo, sophomore Rocket Miriam Diala was  greeted after a hard-fought win by her mother, Francisca. Her mom had  traveled 4,300 miles from Germany to see her daughter play women's  college basketball at UT in person for the very first time.\n\nFrancisca often stays up past midnight to watch Miriam's games on TV  because…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699647/family-sacrifice-and-the-rocket-spirit"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "Mr. CORREA. Mr. Speaker, today I rise to celebrate the 90th birthday  of Irmgard Hermann Davis.\n\nIrmgard grew up in Germany during World War II. After the war, she  came to visit her sister in Garden Grove, California, my district,  where her life changed forever.\n\nShe met Wally Davis. They got…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694152/irmgard-hermann-davis-90th-birthday"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…not get to dictate who may or may not become a  member of the NATO alliance, just as his Soviet predecessors could not  stop the membership prospects of Poland or Hungary or Germany. To  preemptively surrender admission to NATO is national security  malpractice and only benefits Vladimir Putin.\n\nFinally, Secretary Hegseth declared that Europe and NATO…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…hour, day after day--right now, in realtime--in those abuses and in so  frequently used Gestapo-type tactics.\n\nI initially thought: I don't want to go there. My father escaped  Germany in 1935 and came to America after seeing what was to come in  those same Gestapo-type tactics in Germany. He came here speaking no  English, having not much more than the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699087/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…an American citizen, born in Japan to a military father  during the Vietnam war. Mr. Wilson is also a veteran. He proudly served  our Nation overseas, including in Korea and Germany.\n\nLike millions of Americans, Mr. Wilson does not have a passport  because he does not need a passport. Like millions of Americans, Mr.  Wilson does not have access to his…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…about how much we are going to need that unity, all Americans  working together, when we face the next existential threat to our  freedom and democracy, as we did with Nazi Germany and militarized  Japan. It is coming, and you know it.\n\nIn the Bronx and Westchester, we will be ready. We encourage the  Bruce Blakemans of the world to stop pandering and…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697353/america-needs-unity"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…certificate for all to see. I am a proud immigrant.\n\nShe came to this country at the age of 2. Her mother did not speak  English but brought three children on a boat from Germany to Baltimore  and ultimately to Illinois, where I grew up and my mother spent her  life. It was an indication of the American dream, as far as I am  concerned. Her son not…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696348/trump-administration"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…the world among advanced industrialized countries. We have  rates of gun violence and gun homicide that are 10 or 20 times higher  than Canada, the United Kingdom, France, Germany, Israel, and Japan.  You name it, nothing comes close to us.\n\nInstead of helping police officers by getting guns out of the hands  of criminals, our colleagues are just looking…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…that will be decided by the voters in the next election.                                 Immigration\n\nMr. President, the year was 1939, and there was a ship that sailed  from Germany destined for Cuba. It was bringing Jewish refugees from  Europe, which was falling into Nazi control, to a free place to live in  Cuba.\n\nUnfortunately, as that ship, the St.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…just economic growth in the  United States. I am on the Armed Services Committee, and I had a chance  to go visit 2 weeks ago with the new government, incoming government in  Germany.\n\nGermany is a great ally. More U.S. troops are on the ground in  Germany than any nation other than Japan outside the United States. We  are security partners in Ukraine…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…globe of more than 8 billion. Yet, tragically, President Trump has  systematically taken apart the advantage these allies give us. He has  insulted the leaders of Canada, Germany, France, and the United  Kingdom--our closest democratic allies--not to mention countries like  Denmark.\n\nHe has questioned whether America would defend NATO members under…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700183/state-of-the-union-address"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…His All-Holiness Bartholomew  completed his undergraduate studies at the historic Theological School  of Halki. He would also pursue graduate degrees in Italy, Switzerland,  Germany, and Greece. Before being ordained to the Diaconate in 1961 and  to the Priesthood in 1969, he was a founding member of the Society of  Canon Law of the Oriental Churches.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695391/welcoming-the-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Mr. MERKLEY. Thank you so much to my colleague from Oregon for this  question.\n\nIt is very powerful to think about how fast the menace grew through  the Jewish community in Germany and how, if one did not recognize that  threat--and if I understood it right, the women in the family were the  ones who said: We have got to get out of here--\n\nMr. MERKLEY.--to…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…across  the country, millions of them, who today go to the grocery store, their  jobs, and school and live their lives afraid of what might happen to  them.\n\nEighty years ago in Germany, Jews were burned in ovens for being  Jews, and on Sunday, as I sat at home with my children watching TV, we  saw that here in the United States, in 2025, Jews are being burned…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691864/call-evil-by-its-name"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…playfully       unraveled,\n\nEver since attempting together tie what\n\nTorn away is forever gone.\n\nThe youngest member at the Shoah (Holocaust) survivors'\n\nMinyan (quorum) in Germany's Wetzlar Displaced Persons       Camp,\n\nI hear louder and louder in the dark\n\nWith elapsed some eighty years,\n\nThe adults' heartfelt davening (praying) with painful…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699495/recognizing-remarks-of-rabbi-dr-israel-zoberman"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…women in uniform who are serving  overseas. I had the privilege of doing it again this year. This  Thanksgiving, I was with Wyoming airmen at Ramstein Air Base, which is  in Germany.\n\nThese young men and women came from Casper, Cheyenne, and Riverton,  serving our Nation. They are doing an outstanding job in their work and  supporting missions in Europe,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697356/wyoming-servicemembers"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…there can be no political stability and no assured peace.''\n\nAmerican security and stability depended on European security and  stability, not least because conflict with Nazi Germany was succeeded  immediately by the threat of conflict with the Soviet Union. Millions  in Eastern Europe had gone from living under Nazi tyranny to living  under Soviet tyranny.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Training and Advanced Individual Training at  the Armor School. He was assigned to the 2nd Armored Cavalry Regiment  in January 1971 in Bind Lach serving as border patrol between Germany  and Czechoslovakia. He and his company referred to themselves as The  Speed Bump because ``that's what it would have looked like if the  WARSAW Pact had decided to come across.''…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694773/recognizing-the-contributions-of-charles-charlie-webb"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…number of critical roles  and commands, including the 927th Air Refueling Wing at MacDill Air  Force Base, Florida and European Regional Medical Command at Sembach  Air Base, Germany. Mr. Woodward subsequently returned to the United  States where he took the position of Director of Public Affairs for the  82nd Training Wing, where he has faithfully served…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693070/recognizing-the-career-of-mr-george-woodward"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…Korea, Iran, India, and other allies of theirs to  watch a parade of state-of-the-art weaponry. It reminded me of similar  moments in the late 1930s, when the fascist states of Germany and Italy  teamed up with the imperialist state of Japan to form the Axis and to  plunge the world into chaos.\n\nI have often asked myself: Would I have seen and known what…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Road to Serfdom''  and ``Constitution of Liberty.'' This is a man who lived under  socialism. He lived through the Communist regimes of Stalin and Eastern  Europe and of Nazi Germany. He talked about the road to serfdom. Mr.  Speaker, we think of some of these policies potentially as the scenic  route to socialism.\n\nHe is someone who  understands market…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697143/denouncing-the-horrors-of-socialism"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…now retired, has actually been coming here to Congress  saying: Warning, warning. The entire world's capital markets--because  China is borrowing, Japan is borrowing, and now Germany is going back  into the debt markets--there is not enough capital in the world.\n\nWhen the United States is consuming 30 to 40 percent of all the money  that goes to sovereigns,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…look like across this  country if we don't address it, look at Dearborn. Look at Minnesota.  Look at Mamdani's election in New York. Look at London. Look at Paris.  Look at Germany. Ask if that is what we want in Dallas or Houston. Ask  if we want this in Charlotte, North Carolina. Ask if we want this in  Atlanta, Denver, Phoenix, or anywhere else.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…crap out of us because there  is this concept called term premium.\n\nAs the Ray Dalios and these people who are the billionaire experts  are saying: China is in the market. Germany is in the market. The  United States is bingeing on debt. There is almost not enough savings  in the world to finance the scale of borrowing, and much of that  borrowing is…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…U.S. Army Corps of Engineers in 1980 as part of  the historic first class of female graduates, Captain MacGibbon served  our Nation with distinction in leadership positions in Germany and  beyond.\n\nFollowing her Active-Duty service, Mrs. MacGibbon dedicated 22 years  to mentoring future Army leaders, assisting over 165 candidates in  earning admission to…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696747/recognizing-veterans-in-texas-third-congressional-district"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…built a  loving family and a legacy of service.\n\nFollowing college, Mr. Matthys served on active duty in the United  States Army from 1970 to 1974, including time stationed in Germany, and  later in the Army Reserve until his honorable discharge as a Captain in  1981. His service to our Nation was marked by integrity and continued  through his 35 years…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690584/recognizing-the-retirement-of-bill-matthys"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…best  clothing stores in America by The New York Times.\n\nLou Taubert Ranch Outfitters first opened its doors in 1919 after  being founded by C. W. Taubert, an immigrant from Germany who grew  enamored with the cowboy spirit and the allure of the West.\n\nFrom its beginnings as a hardware store catering to the local  agricultural community, Lou Taubert has…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699737/recognizing-lou-taubert-ranch-outfitters"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…gates. They are taking  over Western Europe, and the United States is  next. They have taken over Western Europe, from what we heard about  what is going on in Great Britain, Germany, and Finland.\n\nIf you look at the Disinformation Governance Board, right now, there  were enough Republicans, enough free speech news outlets, probably even  enough Democrats…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}]