[{"senator": "Becca Balint", "party": "Democrat", "sentence": "…Republican budget slashes billions of dollars from Medicaid and  food assistance programs. Millions will lose their health insurance and  will be hungrier and sicker.\n\nIt gets worse. In his 2026 budget, Trump has called for a 40 percent  cut to the National Institutes of Health. He wants a 44 percent cut to  the Centers for Disease Control and Prevention,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691727/republican-budget-will-make-us-sicker"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…causes our allies worldwide to do the same,  and those who are considering with whom to form alliances, and there  are many, it causes them as well to turn away from us.\n\nIt gets worse. With President Trump actually allying himself with  China, Russia, Iran, and North Korea, these countries now seemingly  have America's explicit backing to spread their…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…ties between the political and economic elite in  Haiti and the criminal gangs that have run roughshod over the majority  of the capital.\n\nEach day, the situation in Haiti gets worse. Approximately 1.3  million Haitians, including more than 700,000 children, have now been  forced out of their homes by gang violence. Just since last October,  gangs have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694816/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…disown it and urge him to take a different path.\n\nAll the economic trends are pointing in the same direction. We should  take a different path on the economy before this gets worse. The vote  we will have later today gives the Senate, the greatest deliberative  body in the world, the chance to stand up and say: Let's take a  different path.\n\nI thank…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…need real trade reform, balanced trade  accounts, and sensible tariff policies, not gimmicks. I urge the Trump  administration to stop the damage now before the bleeding gets worse.\n\nOur chief trading partner in northern Ohio is Canada. We like Canada.  Our industry is integrated. Parts pass over the border sometimes six or  seven times. Tariffs make…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…men's identities to become  public? If we found six men that they were hiding in 2 hours, imagine  how many men they are covering up for in those 3 million files. The  story gets worse.\n\nThe reality is that Donald Trump's FBI scrubbed these files in March,  long before   Thomas Massie and I passed the Epstein Files Transparency  Act. My bill is clear. The…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699892/decoding-epstein-files"}, {"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "…debt clock--which, by the way, I bought.  It is $99 on the website. Today, he talked about that if the Republican  budget passes, the budget deficit doesn't get better. It gets worse.\n\nThen Elon Musk commented, and he said: That sounds bad.\n\nBoy, that is awkward. I mean, you know how much we hate it when you  guys fight amongst each other.\n\nThat wasn't…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688029/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…that our students' data is protected, as DOGE tries to muck around with  no oversight or accountability, she made it very clear she would not  stand in their way.\n\nBut it gets worse, because when it comes to Trump's mission of  destroying the Department of Education, she is all too ready to grab a  hatchet and get to work.\n\nThe irony is that while Trump…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688363/nomination-of-linda-mcmahon"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…that he talks a good game but never  does anything to accomplish what he wants to do when it comes to  lowering their costs. And the situation of the American people only  gets worse.\n\nTo Donald Trump: Your posturing, your throwing out these ideas that  people like and then doing nothing to actually make them happen, ain't  gonna work, Donald Trump. Your…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…people want to save money. They want to cut pollution.  They don't want us wasting their time with inane bills like this that  are simply going to cost people more money.\n\nIt gets worse because Republicans in Congress are barreling toward a  massive tax giveaway to billionaires paid  for by targeting the family members we love the most: our parents who…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…will go away. It is nothing. I will shake it off. I  will feel better tomorrow. It is the check engine light that we ignore  except it won't get better. In most cases, it gets worse.\n\nThat tingling in the hand may every now and then go away, but it  comes back. It is that light trying to tell us that something is wrong.  Remember, we pull over the BMW.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…worth of high- nutrition biscuits, food that was meant for starving children in  Afghanistan and Pakistan.\n\nThese are not snacks. These are fortified, lifesaving meals. It gets  worse. The administration will spend $130,000 just to destroy them.  These are resources that could feed children anywhere in the world  instead of going up in smoke.\n\nThis is…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693656/foreign-food-aid-incinerated"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…dismantling of rural healthcare, in the  freezing of funding for rural infrastructure, in the threat to programs  like SNAP that many families across rural America depend on.\n\nIt gets worse. President Trump, Elon Musk, and their enablers are  gutting critical Federal services that include scientists. They are  hollowing out NOAA and weakening the Bureau of Reclamation.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…coverage, they don't stop getting  sick. They delay preventative care. They skip prescriptions. They end  up in emergency rooms. Emergency rooms become overrun, and care gets  worse and more delayed. Costs rise for everyone, and all outcomes  suffer.\n\nBecause of months of inaction by Donald Trump and congressional  Republicans, those tax credits have…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698671/protecting-healthcare-for-millions-of-americans"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…This administration has halted more than half of  all the new power planned to be built in the United States, to be  brought onto the grid over the next 4 years.\n\nAnd it gets worse.\n\nPresident Trump's Department of Energy canceled 26 projects that  would make our power grid more reliable. The Department of Energy  estimated the transmission built through…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698581/permitting-reform"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…problem worse,  not better.\n\nThe Democratic leader said that every day the shutdown gets better  for them. Well, I can tell you every day the government is shut down,  it gets worse for the Americans in my State who are worried about  flooding and losing everything.\n\nThe American people want solutions. They want a government that  works. They want flood…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…paying more  than $10,000 a month each and every month to insurance companies to  provide coverage for enrollees who did not exist. That is a lot of  money being wasted.\n\nIt gets worse. A preliminary analysis by the GAO found that there  were at least 190,000 applications between 2023 and 2024--that is that  fiscal year--that had unauthorized changes by…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699102/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…jeopardizing the American economy and handing Vladimir Putin a lifeline  as our European allies were forced to scramble for energy. That was not  leadership. That was failure.\n\nIt gets worse. After independent experts uncovered major flaws in the  study used to justify the freeze, the Biden administration doubled  down, and senior officials deliberately hid reports…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697088/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…people that some of my colleagues  are coming down to the floor and criticizing.\n\nAt some point, one of the two parties has to stand on principle and  end this cycle or it gets worse, and it gets worse, and it gets worse.\n\nLet me give you an example of where I think it is getting bad.\n\nOn a Sunday night, about a month or so ago, I saw a report that the…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…also included funding to hire 2,500  air traffic controllers to close the gap in our workforce. For every  day we remain in a shutdown, the air traffic controller shortage gets  worse, and the strain on the aviation system intensifies. Our system  has a breaking point, and I hope that this dysfunction that we are  undergoing stops before we see dramatic…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696174/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…shuttered. Important services are paused and unavailable. Countless  Americans have missed paychecks because of our failure to do our job to  keep the government open.\n\nIt only gets worse as this drags on.\n\nOn November 1, an estimated 42 million Americans will miss out on  their monthly benefits from the Supplemental Nutrition Assistance  Program, or SNAP,…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696473/vote-explanation"}, {"senator": "John James", "party": "Republican", "sentence": "…Speaker?\n\nIt is because people have choices.\n\nHere is the truth: Every single time Washington gets its mitts deeper  into healthcare, prices go through the roof and care gets worse.\n\nThat is why I introduced the Patients Deserve Price Tags Act. The  Patients Deserve Price Tags Act is pretty simple. Before a person walks  into a hospital or to a doctor's…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697860/obamacare-isnt-working"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…there will be no gasoline-using cars. We will have only  electric cars.\n\nThat is what we are preparing ourselves for. Every distortion of the  checks and balances of powers gets worse. Every time a party changes  hands, they say: Well, you guys did this, so we are going to leapfrog  and do this. And it goes back and forth until the individual citizen…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}]