[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…be an arm and a leg for it. It's like you're spending your       soul on groceries.\n\nAnother constituent Esther said:\n\nA loaf of bread costs us $4, and it looks like it's getting       smaller.\n\nI know what she means. Tria and Esther are not alone in their shared  frustration. Working families across the country are feeling the  squeeze at the checkout…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "…afford to send them there.\n\nSo many Americans worry, can I pay for my child's education? So many  people in my district and other districts worry whether or not their  child is getting a quality education at their public schools.\n\nI was at a school this week that has Head Start, where a majority of  their children are taking advantage of Head Start because…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688232/democratic-proposals"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Mr. Speaker, my flight was delayed in getting to D.C. Had  I been present, I would have voted YEA on Roll Call No. 191, H.R. 1709;  YEA on Roll Call No. 192, H.R. 1770; and YEA on Roll Call No. 193, S.  1596.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693445/jocelyn-nungaray-national-wildlife-refuge-act"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…a secondary effect. But Trump is being very explicit  about the main goal. It is the oil.\n\nThis is the same guy who for 10 years and over three Presidential  runs made not getting into wars a central premise of his campaign. It  scrambled the political coalitions. It really did. There were a lot of  young veterans who came back from Iraq and Afghanistan…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698623/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…sharing this with you--the administration made clear that there is  another purpose for seizing the oil, and that is nation building.\n\nThis is the business we thought we were getting out of. Donald Trump  promised the country that he wasn't going to repeat the mistakes that  we made in the past in which we tried to impose our will on a foreign  country…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…for mental health care. She wrote to me: I  don't want to pick between my dream, mental health, and food.\n\nWhat does this bill do for her? Nothing. I know Republicans are  getting similar calls. Yet, instead of caring about the millions of  Americans who are being forced to make impossible choices, they are  putting up this sham of a bill. They should…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698364/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…imprisoned and punished here for the crime of having  entered illegally.\n\nThis would undoubtedly be good for the owners of all the private  detention facilities and prisons who are getting rich off of laws like  this, but it would fail the rest of us.\n\nUnder 8 U.S.C. 1325, today, entering the U.S. without inspection is  already a misdemeanor punishable by a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…swaths of the Federal Government would  be furloughed, public services would be scaled back, paychecks would be  missed.\n\nMy Republican colleagues will only talk about those not getting  paychecks--and you can hear it already--instead of my Republican  colleagues having to defend the Department of Homeland Security with  what is happening across the country…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…not speech. I mean, who came up with  that? And corporations are not people.\n\nSo this moment isn't just about looking backward at a Court decision.  That is not what we are getting at. It is about deciding what kind of  Congress we want to be moving forward. Do we accept a system where  access is bought and outcomes are shaped by the wealthiest members…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699113/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…rip-off. I hear from constituents every day about the high cost of  living. Under the Trump administration, healthcare costs are rising,  and putting food on the table is getting harder as egg prices skyrocket  and housing remains unaffordable.\n\nUnfortunately, the Republican rip-off is a slap in the face to  working families.\n\nTrump, Elon Musk, and…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688020/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…our churches,  in our union halls, and our community centers listening to the people I  serve.\n\nLet me tell you what I heard, Madam Speaker. It was crystal clear.  People are getting squeezed.\n\nGroceries--a very old fashioned word--are too expensive. Gas is too  expensive. Housing is way too expensive, and Trump's chaos and  corruption are making it all…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694808/northeast-ohioans-are-getting-squeezed"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…Telecommunications and Information Administration, or  NTIA, plays a vital role in ensuring the United States' strong  technological leadership.\n\nThis Federal agency is integral for getting people connected,  ensuring we can communicate in emergencies, and bolstering our  cybersecurity infrastructure. Yet, Congress has not reauthorized NTIA  in over 30 years.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690255/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…This  means tens or even hundreds of billions of dollars lost. Those are not  just numbers on a page. Those are real people losing health insurance.  Those are real patients getting turned away and real communities,  especially rural and low-income communities, being left behind.\n\nThis morning, the Senate Parliamentarian ruled that these provider  tax…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693032/opposing-provider-tax-restrictions-in-the-gop-reconciliation-bill"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…Republicans and Donald Trump have refused  to even talk to us about addressing it. Estimates show that 22 million  Americans will see their premiums double on average. I am getting calls  daily from Wisconsinites begging me to stay in this fight.\n\nA couple in Door County, WI, told me their premium is rising by $550  a month next year. Everything is already…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696658/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…but [that] our agencies could       no longer provide funds immediately to WHO . . . and could no       longer even communicate [with the WHO]. [There are i]ssues       like getting . . . the fall flu vaccine, which depends on a       WHO process that accesses specimens from people in China . .       . where we don't have direct access. [The WHO] directly…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…percent, while California's  budget grew by 75.7 percent during that time period.\n\nNow, you might say, okay, we are spending more, but surely the people  of California are getting something worthwhile in return for this  massive increase in tax revenue, this massive  increase in public expenditures. Surely, we are seeing major gains in  the achievement…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…actually  affects all of us a great deal more than we might imagine. A tiny but  vicious parasite known as the New World screwworm is infecting cattle  across Mexico, and it is getting closer and closer to the United States  by the minute. Of course, many know that Texas ranks first in the  Nation for cattle production. We proudly represent nearly 15 percent…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699770/9999"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…last 53 years.\n\nIf my colleagues ask any Penn State student, they will be the first  to say that THON isn't about them. It is about the children. It is  about the families getting to celebrate birthdays, piano recitals,  science fairs, graduations, and every other moment a child should  experience free from the fear of cancer.\n\nTHON exists so that,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688351/recognizing-thon"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…Rescissions Act of 2025, a bill that finally codifies the spending cuts  identified by the Department of Government Efficiency, otherwise known  as DOGE.\n\nThe American people are getting a front row seat to one party who is  perfectly content to bankrupt this country, one party. We will get no  votes on this rescission package, none from the Democratic Party.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692389/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…in every other.\n\nThis Saturday, 20 million Americans will see how much their premiums  go up. And if the calls that come into my colleagues are anything like  the calls I am getting, there will be then an accelerated motion toward  resolving this issue and moving forward with appropriations.\n\nI will close by just citing one conversation I had yesterday.…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696488/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…GARBARINO. Madam Speaker, I think I would be remiss if I did not  mention the ranking member of the full committee and the ranking member  of the subcommittee who worked so hard on getting this bill across the  finish line. I am very excited that this is a very nice bipartisan  effort on something that has to get done. There is a big focus that we  have to have…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…of people in this country who were not  born here. That is over 15 percent. We are naturalizing about 850,000  people a year.\n\nNevertheless, there are Congressmen who keep getting confused and  think the only people that should be removed from this country after  Joe Biden left about 10 million people in the country illegally are  people who committed…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698892/confusion-over-who-should-be-removed-from-this-country"}, {"senator": "John James", "party": "Republican", "sentence": "…to  speak in favor of the SUPPORT for Patients and Communities  Reauthorization Act of 2025. I thank my friend, Chairman Guthrie, for  his very hard work and leadership in getting this done.\n\nFentanyl is a scourge on our Nation, leaving a trail of heartbreak  and destruction in its wake. We cannot allow this poison to continue  tearing our families…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691886/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…everything we know so far, it is appallingly clear that event  attendees were deliberately targeted. And two young Embassy employees-- tragically, two employees on the verge of getting engaged and starting  a life together--were murdered in the attack.\n\nI am grateful that the suspect is already in custody and for the help  the Capitol Police provided in…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691633/capital-jewish-museum-shooting"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Act, and the Coastal Zone Management Act. None of  that permitting is waived in this bill, and I would dare say anybody  wanting to run one of these cables would say they are getting to do it  and to avoid all environmental laws and protections. I don't think  people running these cables want to do that.\n\nSecond, it removes the 5-year timeline for any…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…to young women: The birth of your child is not an ultimatum of  choosing to grow your family or continuing your education. If you are a  young woman who gets pregnant and is getting your education, this bill  strengthens Title IX protections to make sure that your school clearly  informs you of your rights and ensures accountability if those rights  are…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699217/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…creative  destruction, creating new, better, faster, but give up on the  productivity cycle and then you tell me how people's wages go up. You  have a middle class that is getting absolutely crushed and squeezed.\n\nTheir purchasing power is stagnant, if not reduced. It doesn't have  to be that way, but it is going to happen through policy here. It is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…families and communities to visit, learn, and  participate in the national celebration together. Americans just might  come together during this major national commemoration by getting  outside in a forest, historic park, bird refuge, or go on an iconic  hike.\n\nThe STARS Act is about connecting Americans with history, nature, and  the founding principles…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697764/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…and  increasing the timely release of benefits to our veterans.\n\nI have witnessed firsthand the challenges rural veterans in Arizona's  Sixth Congressional District face in getting their medical exams  completed in a timely manner.\n\nThis bill takes an essential first step toward eliminating these  regional healthcare disparities and ensures that all…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695498/rural-veterans-improved-access-to-benefits-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…people in this body would meet with some  average people rather than the lobbyists or the big campaign  contributors. It is very easy to find young people today who are not  getting married specifically because they find that the Federal  Government has almost a policy of punishing people who get married.\n\nEven the Republican Party in its big, beautiful…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698433/republicans-have-delivered-in-2025"}]