[{"senator": "Danny Davis", "party": "Democrat", "sentence": "…academic preparation.\n\nThe school is comprehensive and excels in athletics, as well. For  example, during the 2023-2024 school year, they were city champs in  boys' water polo, girls' basketball, girls' golf, girls' softball, and  girls' swim and diving. Whitney M. Young Magnet High School was also  the State champion in the Academic Decathlon during the…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692107/in-honor-of-charles-rangel"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…lifesaving nutrition to the  hungry. It protects international basic education so children in  poverty and crisis have a chance at opportunity.\n\nThe bill empowers women and girls by safeguarding funding for family  planning, women's economic empowerment, and Women, Peace, and Security.\n\nIt supports access to objective information through outlets like…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…This all, once again, is to serve as a con to the American people.\n\nLet's be clear about what the Republicans are voting to defund today:  programs that help educate women and girls, programs that fight deadly  diseases.\n\nFood, clean water, humanitarian relief for the world's most  vulnerable--are we really going to take these things away from the most…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693706/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…Conference Coach of the Year, and has an NCAA  National Championship under her belt.\n\nIn addition to coaching her award winning team, she recently  published a book titled ``When Girls Win,'' which delves into the  personal challenges Coach MJ has faced as a woman in a male-dominated  field while illustrating how people like you and me can build a winning…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698083/congratulating-maryjo-mccloskey"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…operations, and championed the use of AI to accelerate performance  across the company. Beyond her business achievements, Monika mentors  women, volunteers with organizations like IT Girls, and uplifts her  community with the same passion and dedication she brings to her  career. Her story is one of resilience and excellence, making a lasting  impact.\n\nNon-Profit…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690568/virginias-fourth-district-women-in-excellence-awards"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…integrated through winning a Federal  Court case in 1967.\n\nSt. Augustine has won state championships in football, basketball and  track over the years. Xavier Prep became an all-girls school a few  years after joining the LHSAA.\n\nThe LIALO became a defunct organization in 1969. Its members joined  the LHSAA. Almost every high school in the LHSAA has a mixed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695287/recognizing-the-50th-anniversary-of-an-historic-athletic-achievement-in-the-history-of-the-louisiana-high-school-athletic-association-lhsaa"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…have so many representations of women who have  decided ``no.'' Like our Vice President says, we just eat ``no'' for  breakfast.\n\nRepresentation matters. The fact that young girls and boys will soon  be able to see the contributions of women and value those contributions  will let them know that they can and should dream big.\n\nOn this final day of Women's…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689366/womens-history-month"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…of Texas. Mr. Speaker, I rise today with a heavy heart to  mourn the loss of so many lives across Texas. We lost the hope of our  future, so many children, so many beautiful girls, who just went to  camp to have a good time, to bond with their friends, and to have that  time that we all cherish from our memories of our own childhood.\n\nToo many lives…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693655/tragic-storms-in-texas"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…today to congratulate the National  Organization for Women of New Jersey (NOW-NJ) as they celebrate their  historic 50-year milestone of promoting equal rights for women and  girls. It is my privilege to recognize the powerful impact made by NOW- NJ to build a New Jersey where everyone, regardless of race, gender  identity, or background has the freedom…", "date": "2025-11-25", "source_url": "https://justfacts.votesmart.org/public-statement/1697164/recognizing-the-50th-anniversary-of-the-national-organization-for-women-of-new-jersey"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…contraceptives, purchased with funds agreed  to by a large majority of congressional Republicans and Democrats, to  be made available to those who need them most. Women and girls in  dozens of the poorest countries are depending on these commodities to  take control of their lives. Destroying them is antithetical to  America's long-held values and reputation…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696465/womens-health"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…community  organizations, including the National Infantry Museum, the Muscogee  Educational Excellence Foundation, Open Door Community Center, St. Luke  Church Administrative Board, Girls in the Game, Chattahoochee Council  of the Boy Scouts of America, Jordan Vocational High School College and  Career Academy Advisory Board, RiverCenter for the Performing Arts,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690837/in-memory-of-the-honorable-judy-thomas"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…everywhere. Liberation day is  just going to worsen the situation that we are seeing, not only for  people who are in the stock market, which, you know, they are big boys  and girls. They can handle themselves. It is really the people on Main  Street who are going to feel the brunt of a tariff policy that goes  completely in the opposite direction of the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689376/cost-of-living-still-high"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…to recognize Reese Gallagher  as the champion of the week for Ohio's 13th Congressional District.\n\nReese is a senior at Archbishop Hoban High School, and she was named  the Girls' Division III Player of the Year by the Ohio Scholastic  Soccer Coaches Association.\n\nReese has been described as an aggressive and ferocious player and is  heralded as the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697073/champion-of-the-week-reese-gallagher"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Sisters\n\nMr. CORREA. Mr. Speaker, I rise today to congratulate sisters Alicia,  Anabelle, and Angelica Serratos for their accomplishments as part of  the Santa Ana High School girls' wrestling team.\n\nAlicia, Anabelle, and Angelica took home an impressive combined  record of 104 wins and 12 losses into their recent CIF Southern Section  girls' championship…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689745/recognizing-jessie-echaury"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…exposed positions.\n\nRecent reporting details how users of X, the social media platform  formerly known as Twitter, can ask its AI chatbot Grok to undress women  and underage girls in photos. Grok will comply with requests to show  subjects in various states of undress with images which I won't repeat  for the record, but they are horrible.\n\nEven after…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Mr. BAUMGARTNER. Mr. Speaker, I rise today to recognize the 1984  Walla Walla High School girls' basketball team and to celebrate the  long-overdue recognition of their State championship victory.\n\nThe 1979 and 1984 Walla Walla High girls' teams remain the only State…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699649/recognizing-1984-walla-walla-high-school-girls-basketball-team"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…challenges in high       school and higher education is orders of magnitude higher       than in the United States, and Chinese teams are taking a       majority of the prizes.\n\n(10) Girls participate in mathematical modeling challenges       at all levels at similar levels as boys, while in traditional       mathematical competitions girls participate less and…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…rise  to pay a very special tribute to an outstanding high school track and  field team in Ohio's Fifth Congressional District. The young women of  the Coldwater High School Girls Track and Field Team have represented  their school ably on their way to achieving the Division III State  Track and Field Title. The team overcame the challenges posed by…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693344/special-recognition-of-coldwater-high-schools-girls-track-and-field-team-for-winning-the-division-iii-state-track-and-field-title"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…rise  to pay a very special tribute to an outstanding high school basketball  team in Ohio's Fifth Congressional District. The young women of the  Columbus Grove High School girls' basketball team have represented  their school ably on their way to achieving the Division VI State Girls  Basketball Title. In their effort to surpass all other teams in…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690078/recognizing-columbus-grove-high-school-winning-the-division-vi-state-girls-basketball"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…Johnson Anthony is a high-achieving high school student who  maintains a 4.0 GPA with AP courses. She balances academic rigor with  leadership in volleyball, the art club, and the Girls Inc. Eureka!  program.\n\nHer extensive history of community service includes the Open Door  Mission and organizing gift drives for overseas troops and local  seniors. Ms. Anthony…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699725/happy-90th-birthday-to-beth-ragland"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…has invested hundreds of thousands of dollars annually in  an array of local Indiana organizations, such as Ark Crisis Children's  Center, Boone County Cancer Society, Boys & Girls Club of Evansville,  Evansville Philharmonic Orchestra, Mesker Park Zoo & Botanic Garden,  Ronald McDonald House Charities of Ohio Valley, Special Olympics  Indiana, Tri-State…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690130/time-dealer-of-the-year-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…wonder why we didn't  do this sooner. Why didn't we do this sooner? We should have. That  moment helped elevate the game of hockey across the United States. It  helped elevate girls' hockey across the United States. I share that my  younger brother, Rob, was the coach of the women's gold medal team in  Pyeongchang, where they won in overtime.\n\nBeing an…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690280/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…to pay a very special tribute to an outstanding high school volleyball  team in Ohio's 5th Congressional District. The young women of the  Tiffin Calvert Catholic High School girls volleyball team have  represented their school ably on their way to achieving the Division  VII State Girls Volleyball Title. In their effort to surpass all other  teams in…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697947/recognizing-the-tiffin-calvert-catholic-high-school-on-winning-the-division-vii-state-girls-volleyball-championship"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "…the Year by the Lee County Community Foundation for his volunteer  work  and philanthropy. He has also served as a board member for the Sanford  Area Growth Alliance, Boys and Girls Clubs of Central Carolina, and Lee  County Education Foundation, among others.\n\nIn his career, Mr. Oldham's company's involvement in a variety of  projects, including critical…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694151/congratulating-donnie-oldham-on-being-inducted-into-the-carolinas-agc-hall-of-fame"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…pride that I rise  to pay a very special tribute to an outstanding high school volleyball  team in Ohio's 5th Congressional District. The young women of the Avon  High School girls volleyball team have represented their school ably on  their way to achieving the Division II State Girls Volleyball Title. In  their effort to surpass all other teams in the…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697918/recognizing-avon-high-school-on-winning-the-division-ii-state-girls-volleyball-championship"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…goes on to tackle new challenges.\n\nI congratulate Makennah on her fourth State title. I wish her the  best in her very bright future.    Congratulating Portsmouth High School Girls' Basketball Team on Ohio                           Division V State Title\n\nMr. TAYLOR. Mr. Speaker, I rise today to congratulate the Portsmouth  High School girls' basketball…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689346/joanna-sheaf-celebrates-100th-birthday"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…Mitchell.\n\nA sincere congratulations to each and every one of them. This is a  wonderful achievement, and our city is very proud of them.                Congratulating Fowler Eagles Girls Basketball\n\nMr. BARRETT. Mr. Speaker, I rise today to recognize the Fowler Eagles  girls' basketball team, who captured the State championship this past  weekend with a commanding…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689005/congratulating-east-lansing-trojans"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…service projects. That effort pays off in  character, confidence, civic service, and self-reliance of our young  people.\n\nEleanor and I are father and mother to three boys and two girls, and  we look forward to hopefully one day being the proud parents of five  Eagle Scouts.\n\nToday, Mr. Speaker, let's honor the Scouts, the volunteer leaders,  the parents,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697297/recognizing-ron-hauenstein"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…is estimated that mifepristone accounted for 63 percent of the  abortions in 2023, resulting in approximately 642,700 unborn babies  losing their lives that year.\n\nWomen and girls have been misled into believing that taking  mifepristone to induce an abortion is as safe as using Tylenol.  However, new data indicates that nearly 1 in 10 women taking the…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692892/dobbs-v-jackson-anniversary"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Opelika Arts Association, Lee County Salvation  Army, Achievement Center Easter Seals, Chattahoochee Council Boy Scouts  of America, Chattahoochee Historical Commission and Boys & Girls Clubs  of Greater Lee County.\n\nMayor Fuller has served the Alabama Municipal Electric Authority  (Chairman), Alabama League of Municipalities (Past President), Alabama  Monument…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696582/recognizing-the-retirement-of-mayor-gary-fuller"}]