[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "He exercised his right  to vote after he was given a literacy test.", "title": "Building A Beloved Community", "date": "2026-01-20"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "My colleagues on the other side of the aisle are just giving the  executive branch all of the powers that the Constitution had originally  given to the Congress.", "title": "Providing for Consideration of Senate Amendment to H. Con. Res. Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "Given the long record of       false alarms, such hypervigilance is a possible tripwire for       an accidental apocalypse.", "title": "Marking 80 Years After Trinity, the Dangers of Nuclear War Have Never Been Higher", "date": "2025-07-17"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "We have seen Border Patrol waiting outside of hospitals, literally  arresting women after they have given birth--no due process, no regard  for human rights.", "title": "Fighting Dhs Immigration Raids", "date": "2025-12-03"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "The radiation, however, given off by the more than 100 atmospheric  tests had devastating impacts on those downwind.", "title": "Nuclear Testing Opposition", "date": "2025-11-19"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "We are in the midst of a full-blown  affordable housing and homelessness crisis with over 771,000 people  experiencing homelessness on any given night in this country.", "title": "Protecting Americans From Harmful Crypto Practices", "date": "2025-05-08"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "There are almost 1,100 wandering       officers in any given year in Florida; in Texas, about a       quarter of law enforcement officers fired for misconduct were       subsequently hired by another law enforcement agency.", "title": "Opposition Letter By the Southern Poverty Law Center on the Common- Sense Law Enforcement and Accountability Now in DC Act of 2025 (H.R. and the District of Columbia Cash Bail Reform Act of 2025 (H.R.", "date": "2025-11-19"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "Given that the administration has already taken action to overturn  responsible management plans, these bills only make it more challenging  to manage these special lands.", "title": "Defending the Arctic Refuge", "date": "2025-11-18"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "Now, when it comes to Congress's role in checking this President, in  asserting its war powers given to us by our Founders and the Framers of  our Constitution, if we do not assert this power, we will lose it and  not just to constrain this President but any President and for all  time.", "title": "Venezuela", "date": "2026-01-08"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "To say that my colleagues are not in control when they have been  cutting programs that have helped poor children, that have helped  middle-class families, when they have given tax breaks to  multimillionaires and billionaires, give me a break.", "title": "Providing for Consideration of Senate Amendments to H.R. Consolidated Appropriations Act, Providing for Consideration of H.J. Res. Disapproving the Action of the District of Columbia Council in Approving the D.C. Income and Franchise Tax Conformity and Revision Temporary Amendment Act of and Providing for Consideration of H.R. Critical Mineral Dominance Act", "date": "2026-02-03"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "I actually have no  real problem going against cartels, given what they have done in their  inserting drugs in our community and with the death of so many  Americans.", "title": "Terminating the National Emergency Declared with Respect to Energy", "date": "2025-10-08"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "Given that large methane and carbon dioxide emissions are emitted  during fracking, pipeline transport, liquefaction, overseas shipping,  and combustion, costs go up, and so do pollution and health risks,  especially along the Gulf Coast.", "title": "Unlocking Our Domestic Lng Potential Act of 2025", "date": "2025-11-20"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "Given that this bill is being taken directly to the floor without the  benefit of feedback from the State Department however, I ask that we  work with our Senate colleagues and the administration to ensure that  it is ultimately implemented in a way that is both workable and does  not inadvertently impede critical State Department operations and  programming.", "title": "No Dollars to Uyghur Forced Labor Act", "date": "2025-05-05"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "In the Constitution, that power of the purse is given to Congress.", "title": "One Big Beautiful Bill", "date": "2025-06-27"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "Given her independent role, the National Taxpayer Advocate often  takes positions contrary to the positions of the IRS and the Office of  Chief Counsel.", "title": "National Taxpayer Advocate Enhancement Act of 2025", "date": "2025-03-31"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "With the motivation to give back to the home that had given them so  much, ECO-CLEAN was created to respond to the need for environmental  responsibility and sustainability.", "title": "Congratulating Eco-Clean Solutions", "date": "2025-12-04"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "Given his leadership, he was promoted  to patrol sergeant in 2007, where he also served as a training  coordinator.", "title": "Recognizing Sheriff Timothy Wilz", "date": "2025-05-20"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "Today, if a taxpayer misses a  filing deadline, even due to illness, natural disaster, or being given  incorrect information, the court often has no ability to offer relief  to that taxpayer.", "title": "Tax Court Improvement Act", "date": "2025-12-01"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "Given the rapid advancement in AI, it is critical that  Congress remain informed and aware of how Federal agencies are  utilizing AI to advance their mission.", "title": "Producing Advanced Technologies for Homeland Security Act", "date": "2025-03-10"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Given that huge heart, my colleagues can only imagine the love he  poured into Molly.", "title": "Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the National Park Service Relating to ``Glen Canyon National Recreation Area: Motor Vehicles''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the United States Fish and Wildlife Service Relating to ``Endangered and Threatened Wildlife and Plants; Endangered Species Status for the San Francisco Bay-Delta Distinct Population Segment of the Longfin Smelt''; Providing for Consideration of H.J. Res. Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine Pollution Control Standards; Heavy- Duty Vehicle and Engine Emission Warranty and Maintenance Provisions; Advanced Clean Trucks; Zero Emission Airport Shuttle; Zero-Emission Power Train Certification; Waiver of Preemption; Notice of Decision''; Providing for Consideration of H.J. Res. Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine Pollution Control Standards; Advanced Clean Cars Ii; Waiver of Preemption; Notice of Decision''; Providing for Consideration of H.J. Res. Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine and Nonroad Engine Pollution Control Standards; the `omnibus' Low NoX Regulation; Waiver of Preemption; Notice of Decision''; and for Other Purposes", "date": "2025-04-29"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "You allow them to make sure that people in their organization are not  making mistakes with cross-selling, making sure that they are using the  latest technology to ensure that everybody is getting the right deal  and the best deal and the most financial inclusion possible given that  particular customer's circumstances.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Office of the Comptroller of the Currency of the Department of the Treasury Relating to the Review of Applications Under the Bank Merger Act", "date": "2025-05-20"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Beyond her work  in historic preservation, Andrea is a dedicated volunteer who has given  countless hours to various community projects.", "title": "Recognizing Andrea Read", "date": "2025-04-24"}, {"senator": "John James", "party": "Republican", "sentence": "Since its inception, it has empowered families,  equipped teachers, and given children the opportunity to learn, grow,  and succeed.", "title": "Marking A National Milestone", "date": "2025-11-20"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "Speaker, I rise today to congratulate CDO High  School in Oro Valley for receiving an A+ School of Excellence Award by  the Arizona Educational Foundation, the highest level recognition given  to a public school.", "title": "National Police Week", "date": "2025-05-15"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "``(6) Institution of higher education.--The term       `institution of higher education' has the meaning given such       term in section 101 of the Higher Education Act of 1965 (20       U.S.C.", "title": "Innovative Mitigation Partnerships for Asphalt and Concrete Technologies Act", "date": "2025-03-24"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "In 2023 alone, this crisis contributed to  the deaths of 70,000 Americans--in just one year, 2023--a number that  only worsened the following year, when the amount of fentanyl that  crossed our border with Canada was actually enough to kill 9.5 million  people, given that potential.", "title": "Relating to A National Emergency By the President on February 2025", "date": "2026-02-11"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "What would happen is, in a given  period of time, I think we would find ourselves--I am sure it would be  easy to find 100 million Chinese who would come here; 100 million  people from  India could come here; or 100 million people from Africa would come  here.", "title": "Fundamentally Changing Immigration", "date": "2026-01-22"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Given the  large Federal footprint, both communities have struggled to expand  their respective cemeteries, which are currently located on U.S.", "title": "Apache County and Navajo County Conveyance Act of 2025", "date": "2025-05-13"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "With the motivation to give back to the home that had given them so  much, ECO-CLEAN was created to respond to the need for environmental  responsibility and sustainability.", "title": "The California Redistricting War", "date": null}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "Given its strengths, NASA has partnered with this DOE facility to  conduct research in areas such as aerosols.", "title": "Doe and Nasa Interagency Research Coordination Act", "date": "2025-03-24"}]