[{"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Ocasio, better known for many of  us as Bad Bunny, for his worldwide contribution to the arts, music, and  culture.\n\nBorn and raised in Vega Baja, Puerto Rico, Bad Bunny is a global  phenomenon. His songs transcend borders, sharing the vibrant culture of  Puerto Rico with millions, while stirring a deep sense of pride and  connection for Latinos across…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692866/recognizing-bad-bunny"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "My fellow Democrats and I strongly support the intent of this bill,  which is to confront our global adversaries and build up an industrial  manufacturing base here at home in the United States. We can't give the  Communist Party of China any opportunity to undermine our homeland…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688684/decoupling-from-foreign-adversarial-battery-dependence-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…more like the adversaries we profess to oppose. Americans will be  left to clean up this mess, and we will have zero standing in the  international community and zero claim to global leadership while you  all have killed off Elmo.\n\nI urge my colleagues to vote ``no'' on this trash.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692540/rescissions-act-of-2025"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…directing the FCC to engage in the exploration of 6G technology in  the early stages of development, the FUTURE Networks Act will enable  American values to be embedded within the global framework for this  technology and to ensure it will be available to all Americans.\n\nI thank Communications and Technology Subcommittee Ranking Member  Matsui and Representatives…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690230/future-uses-of-technology-upholding-reliable-and-enhanced-networks-act"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…Experts  warn that we will lose a generation of scientists because of this  recklessness.\n\nI urge the administration and my Republican colleagues to reverse  course, maintain our global leadership, and work toward a better future  for the 40 percent of Americans who will be diagnosed with cancer in  their lifetimes.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695758/restoration-of-funding-for-cancer-research"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…promising new treatments as clinical trials still stall  due to staffing shortages. This will slowly eliminate research and  medical intervention and weaken our standing in global biomedical  science.\n\nCuts to an already understaffed CMS workforce will hurt patient care.  We will see disruptions in medically necessary care and delays in  payments to…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688252/department-of-health-and-human-services"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…from practitioners and patients, the  Trump administration is abdicating its duty to our most vulnerable and  signaling to the world that the United States is no longer the global  leader in scientific research.\n\nAs someone who spent years treating patients, I know that abandoning  our scientists, our research institutions, our doctors and nurses, and,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…bolstering good- paying jobs in the United States of America across all energy sectors,  including advanced energy manufacturing, the U.S. Department of Energy  has ceded ground to global competitors like Communist China.\n\nLast Friday, U.S. Secretary of Energy Chris Wright announced that the  Department of Energy was canceling $3.7 billion of previously  appropriated…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691905/department-of-energy-project-cancelations"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…wasted methane has grave consequences for our environment and  for public health. Methane is an extremely dangerous greenhouse gas  that accounts for nearly a third of today's global warming and is a key  contributor to smog.\n\nThat is why key pollution control programs, such as the Methane  Emissions Reduction Program, are so pivotal. The program includes…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Pennsylvania manufacturing hub is full of skepticism.\n\n``Trump once told supporters here in the Lehigh Valley that they know  `better than almost any place in this country' how global trade has  `outsourced your industries' and `wiped out your steel mills.' Now,  even in one of the communities the President suggested would benefit  most from his tariffs,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…another betrayal bill. It slashes U.S. USAID funding even  more, and the cuts have already killed 300,000 people across the world.  It will kill even more. It destroys our global leadership, and it is  yet another attack on free speech in our country by slashing money for  public TV and broadcasting that are many Americans' only source of  news, weather,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692533/rescissions-act-of-2025"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…world-renowned Longwood Gardens, which is a  fixture of my community in the Philadelphia area.\n\nSince 2006, Paul's masterful leadership has helped Longwood navigate  modernization, a global pandemic, and even an escaped convict hiding on  the grounds. Under his direction, Longwood has grown physically and  programmatically, becoming a go-to destination for events,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691475/recognizing-paul-redman"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…here,  it is real, and it is exacerbated by this administration's relentless  push toward fossil fuels.\n\nIn the Arctic, temperatures are rising four times faster than the  global average.\n\nIt is the indigenous communities in northern Alaska and in the refuge  that are disproportionately feeling the devastating impacts of the  climate crisis. Melting…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…quickly we deploy them.\n\nWe must pursue critical minerals in a way that is responsible and in  a way that is sustainable. Demand for these  minerals is growing rapidly. Yet, global supply chains remain highly  concentrated and often linked to serious human rights abuses and  environmental harms.\n\nThis should push us toward thoughtful policies that strengthen…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699692/critical-mineral-dominance-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…military  and intelligence officials, political appointees from both major  parties, Members of Congress and their staffs, Peace Corps and  International Monetary Fund officials, global business leaders, and  other professionals dedicated to promoting American interests and  diplomatic relations.\n\nThrough DACOR and the DACOR Bacon House Foundation, which host…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692065/recognizing-the-dacor-bacon-house-bicentennial-day"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…innovation, support the growth of compliant digital asset  markets, and provide much-needed certainty to investors, developers,  and regulators alike.\n\nIn an increasingly competitive global financial landscape, this  legislation positions the United States to lead with clarity,  credibility, and confidence.\n\nAdditionally, Mr. Speaker, the rule provides for consideration…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "James Risch", "party": "Republican", "sentence": "…non-MDE items will also be included: communications       equipment, including AN/PRC-160 and AN/PRC-167 radios and       associated accessories and training; Defense Advanced Global       Positioning System (GPS) Receivers (DAGRs); AN/PYQ-10 Simple       Key Loaders; and other related elements of program and       logistics support. The estimated total…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690233/arms-sales-notification"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…tactic of the swamp  where bad policy and corruption hide behind a noble title.\n\nI thank Mr. Mike Benz and other patriots. We have learned that this  organization has engaged in global censorship, domestic propaganda, and  regime-change politics. It has worked to crush populous movements, fuel  color revolutions, and run off-the-books operations with plausible…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699052/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Annex Item No. vii\n\n(vii) Sensitivity of Technology:\n\n1. The M142 High Mobility Artillery Rocket System (HIMARS)       is a C-130 transportable wheeled launcher with Global       Positioning System (GPS) Precise Positioning Service       capability mounted on a 5-ton Family of Medium Tactical       Vehicles (FMTV) truck chassis. HIMARS is the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695912/arms-sales-notification"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…to recognize and  commend Annie Wilcox Boyajian, President of Freedom House, for more  than a decade of tireless dedication and exemplary service in advancing  the cause of global democracy, particularly during the most recent  disruptions in the freedom and democracy landscape globally and within  the United States.\n\nIn an era marked by profound challenges…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700047/recognizing-the-service-of-annie-wilcox-boyajian"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…our adversaries, especially as our adversary,  Communist China, continues to make huge investments in STEM to try and  out-compete the U.S. Beating China and maintaining our global  competitive edge begins with strengthening STEM education in K-12  schools.\n\nThat is why I am proud to co-lead this bipartisan legislation to  ensure that the United States…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688977/mathematical-and-statistical-modeling-education-act"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…responsible stewardship of  public lands, all while ensuring the continuity of training operations  that our servicemembers rely on to stay prepared and to stay safe.\n\nAt a time when global threats are ever-present, particularly in the  Arctic, Congress must ensure our military can train as they fight. H.R.  5131 accomplishes exactly that.\n\nMr. Speaker, I thank…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697634/public-lands-military-readiness-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…desperately needed in  rural Alaska.\n\nKeep in mind, this is only one project unlocked by this CRA. This CRA  will also help the advancement of the Alaska LNG pipeline project.\n\nGlobal demand for energy is expected to double by 2050, and our  domestic energy production must rise to meet that demand. With the rise  of data centers and AI fueling this growth,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…accounts for over 90 percent of  the total payload brought into orbit in the entire world, and so  targeting SpaceX is truly weakening our own country given how important  our global dominance in space is. So this latest demonstration of the  capacity of this particular company and American ingenuity in general  to accomplish amazing feats should hopefully…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…control in Washington.  They don't want to do it. At least we do.\n\n$5.1 million was to strengthen the resilience of lesbian, gay,  bisexual, transgender, intersex, and queer global movements. I don't  know what those global movements are. I think they can do that without  taxpayer money. Then, of course, there was funding drag shows in  Ecuador.\n\nThe…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693719/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Mr. Speaker, I rise today in strong support of the PARTNER Act, a  forward-looking measure that strengthens America's ties with the  international organizations shaping the global order at a moment when  international competition is sharper than ever.\n\nThis legislation gives our Nation the ability to fully engage with  influential regional and international…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694822/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…now  exploit financial platforms, adopting increasingly sophisticated  approaches to fund acts of terrorism.\n\nThese organizations adapt quickly, using every loophole in the global  financial system to mask the origin and the destination of their funds.\n\nFortunately, the United States is home to some of the world's most  advanced financial technology…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693942/ofac-licensure-for-investigators-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…families are now facing higher prices and increased  dependence on foreign fuel.\n\nThat is not how you build energy security, Mr. Speaker. That is how  you weaken it.\n\nMeanwhile, global demand for fuels is still rising and is expected to  grow as much as 20 million barrels a day by 2050.\n\nThe world isn't slowing down, Mr. Speaker, and neither should  American…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697030/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…$40,000 a year, to hop on a plane, funded by your tax  dollars, to go to Munich, to go to Europe, and badmouth American  foreign policy. They will be sipping wine with the global elites,  telling them: Don't listen to President Trump. That is not who we are.\n\nI have got news for you: The American people have weighed in, and  they did in November of…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…stability, I know firsthand how vital peace in the Indo- Pacific is to American jobs and our economy.\n\nTaiwan is not only a democratic partner. It is also a key player in  the global supply chain, especially for semiconductors that power  everything from our cars to our national defense system.\n\nThis bill sends a clear and bipartisan message: If the CCP…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693874/taiwan-conflict-deterrence-act-of-2025"}]