[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…was  going to bring it down on the first day. He has done nothing but make  it worse.\n\nMr. Speaker, I strongly urge my colleagues to oppose this bill which  forfeits our global leadership, undermines national security, and  steals from the American people to hand more wealth to billionaires.\n\nMs. DeLAURO.  Pingree), the distinguished ranking member of…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…warn that we will lose a generation of scientists because of this  recklessness.\n\nI urge the administration and my Republican colleagues to reverse  course, maintain our global leadership, and work toward a better future  for the 40 percent of Americans who will be diagnosed with cancer in  their lifetimes.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695758/restoration-of-funding-for-cancer-research"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…holding on as it is.\n\nAnd this is on top of the funding cuts to public health and medical  research that extinguish hope for lifesaving cures and jeopardize  America's global leadership and medical innovation. Those people are  holding on too.\n\nJust last weekend, I went with the Parkinson's Association on their  charity walk. Those people are holding…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695651/healthcare"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…Greenland one way or  another. As a member of the Committee on Foreign Affairs, I have met  with the Prime Minister of Denmark and other key allies. They believe  in America's global leadership. They have fought and died alongside us  in Iraq and Afghanistan.\n\nNow, they fear our words. They plan for a future in which the United  States is no longer the indispensable…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699067/nato"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…competitive as a result of our goodwill  toward others.\n\nSo I rise the third time to urge the White House and my colleagues in  Congress to restore funding to protect America's global leadership.", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690575/call-for-restoration-of-global-emergency-food-aid-funding"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…priorities and funding decisions need to adapt. But  for an administration to take such a drastic, unilateral step is  unprecedented, short-sighted, and certain to weaken U.S. global  leadership and U.S. national security.\n\nAmong the organizations and programs the President plans to withdraw  from include the Office of the Special Representative of the Secretary…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699129/us-withdrawal-from-united-nations-organizations-and-programs"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…American people that the  prices of essential goods are already too high, and President Trump's  actions will only hurt our attempts to bring down these costs.\n\nAmerica's global leadership also helps to keep Americans safe, too.  President Trump turning his back on Ukraine isolates us and undermines  our strength, the strength of international institutions,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Congress be damned. The American people be damned. The world  be damned.\n\nThe precedent being set by these illegal actions is a lasting threat  to the American people, to our global leadership, our national  security, our reputation around the world, and to the checks and  balances that are the foundation of our democracy.\n\nVermonters are outraged by what is…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…member for allowing me to  speak.\n\nMr. Speaker, this rescissions package isn't about fiscal  responsibility. It is about abandoning America's legacy of compassion,  ceding global leadership, and turning our back on the most vulnerable.\n\nThe President's demand to slash $8.3 billion in lifesaving foreign  assistance is plunging America deep into moral bankruptcy.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692526/rescissions-act-of-2025"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…semiconductor manufacturing development platforms for critical advanced  semiconductor system integration, including fan-out wafer level  packaging technology.\n\nU.S. global leadership in semiconductors depends on U.S. owned firms  operating at the leading-edge of advanced packaging technologies. The  next generation of electronic devices will require…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693817/department-of-defense-appropriations-act-2026"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…package for S-FOPS  and FSGG funding bills, and it is a package that once again saves  crucial investments in our communities, in our small businesses, and in  America's global leadership.\n\nI will have more to say on that soon, but I see that our chairman  Senator Collins has joined me on the floor, and I do again want to  thank her personally for all…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698874/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…in science and innovation. We are  at risk of being outrun on AI, quantum, and so many other critical  technologies and innovations.\n\nInstead of helping us maintain our global leadership, this  administration is slashing funding to our science agencies and firing  Federal scientists. The President is proposing a $4.9 billion cut to  the National Science…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691395/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…all enemies, foreign and domestic.       Foreign and domestic. None of us thought the second part of       that phrase would ever come into play--until now.\n\nAmerican global leadership has depended on many factors,       including political, economic, and military power. But most       important was the moral foundation for that power--America as…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…Americans.\n\nIn addition to local broadcasting, this bill also will upend  bipartisan investments in foreign assistance that Congress made earlier  this year to maintain our global leadership and protect U.S. national  security interests.\n\nWhile foreign assistance represents less than 1 percent of the  Federal Government, it provides critical benefits to our…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Seth Moulton", "party": "Democrat", "sentence": "…the  enduring connection between our country and the Ecumenical  Patriarchate.\n\nOnce again, I welcome Ecumenical Patriarch to Washington and in  honoring his decades of global leadership, his commitment to peace and  human dignity, and his enduring contributions to our shared moral and  spiritual life.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695352/welcoming-his-all-holiness-bartholomew-to-washington-dc"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…legislation is paramount to protecting such American security.  By mapping and monitoring our supply chains and mitigating future  vulnerabilities, we will also secure our global leadership in the  advancement and development of emerging technologies.\n\nMr. Speaker, I urge my colleagues to join me in voting for this  particular bill, H.R.\n\nMr. BILIRAKIS.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…that NTIA has the right structure  and resources to fulfill its 21st century mission as directed by  Congress.\n\nToday's NTIA plays a key role in our effort to maintain global  leadership in wireless communications. NTIA has important statutory  obligations to manage Federal spectrum, which is especially important  as Federal and non-Federal use of spectrum…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690256/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…put pro-growth  policies in place to incent growth and job creation, move our country  forward, strengthen our economic base, which is our power base that  gives us our global leadership influence.\n\nWe also give tools and resources to our Commander in Chief to provide  for a common defense. We bend the curve on mandatory spending, which is  75 percent…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…digital assets, the  lines become blurred, confused, and overly burdensome. That regulatory  uncertainty doesn't just cost dollars. It costs jobs, innovation, and  America's global leadership.\n\nThe CLARITY Act is exactly what America needs now to drive toward the  future to ensure the next generation of financial internet technology  and blockchain success…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693770/digital-asset-market-clarity-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…2384, the Financial Technology  Protection Act.\n\nLast week, the House passed critical digital asset legislation,  setting the stage for the United States to reclaim our global  leadership position in financial technology on digital assets. This  week, we build on that momentum to further strengthen our role in  global finance.\n\nAs our technological world…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693963/financial-technology-protection-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…President Biden abruptly closed off 225,000 acres of Federal  land in the Duluth Complex for mineral development, he threw a future  of American abundance, security, and global leadership into chaos. The  decision undermined America's economic, military, and strategic  interests and those of our allies.\n\nThe minerals in the Duluth Complex are called ``critical''…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…largest spending reduction in American history by  twofold, alongside other generational fiscal reforms.\n\nAmerica's economic strength, Mr. Speaker, is the foundation of our  global leadership and prosperity, but sadly, it has waned, especially  over the last 4 years.\n\nTo preserve our influence abroad and our quality of life here at  home, we must unleash growth,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693192/one-big-beautiful-bill-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Committee on  Energy and Commerce.\n\nMr. Speaker, manufacturing is vital to the United States, not only  for economic stability and job creation but for maintaining our global  leadership in emerging technologies.\n\nTo sustain this leadership, it is crucial that we identify and  address barriers to making critical products here at home. Otherwise,  we risk…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690290/critical-infrastructure-manufacturing-feasibility-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…we are on an  unsustainable fiscal path and he believes that if we don't intervene,  we will not only jeopardize our economic strength but our national  security, our global leadership, and God forbid, a sovereign debt  crisis certainly would rob our children of their freedom and  opportunities in this great land.\n\nMr. Speaker, I thank Mr. Moore for…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}, {"senator": "French Hill", "party": "Republican", "sentence": "…clarity, not confusion; where  American ingenuity is empowered, not stifled, by an outdated, not-fit- for-purpose regulatory regime.\n\nThe GENIUS Act will help maintain U.S. global leadership in financial  technology, digital innovation, and the power of the reserve currency-- the United States dollar--while reinforcing important consumer  protections and…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693834/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…computers to cell phones. This groundbreaking American invention  spurred innovation across industries, including defense and  manufacturing, strengthening our Nation's global leadership in advanced  technology. Furthermore, DRAM has led to the development of critical  devices that have improved Americans' access to technology, enhanced  our quality of…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691716/recognizing-national-dram-day"}]