[{"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Food Crises published last Friday by the U.N.  confirms what we have been warning. The number of people facing famine  has more than doubled in the last year. Malnutrition globally is on the  rise. This is a global emergency, one that the United States has the  greatest capacity to help solve.\n\nThe burden should not and cannot fall entirely on us, but…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691610/global-report-on-food-crisis"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…financial system. This doesn't mean  that China is simply an economic competitor. Rather, China has taken an  aggressive adversarial posture toward American  influence and power globally, leveraging its growing economic strength  to do so.\n\nTo address concerns raised by China's conduct in this regard,  American policymakers, including Members of Congress,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694120/china-financial-threat-mitigation-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…pockets and those of his  cronies.\n\nThe first 100 days of the Trump administration were filled with  failures, chaos, and incompetence. The United States' role and  reputation globally have been severely damaged, and many Americans are  worried they will no longer receive the Social Security checks and  Medicaid they need.\n\nNow, congressional Republicans…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Speaker, I rise today to speak about a matter of  life or death for millions of children around the world. Malnutrition  is the leading cause of death for children under 5 globally.\n\nWhen children starve, their bodies break down their own muscles,  bones, and organs to survive. Their immune systems collapse, leaving  them defenseless to disease.\n\nMr.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690379/edesia-nutrition-saves-malnourished-children"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…especially fugitive emissions from oil  and gas, is one of the most effective ways to combat the climate  crisis, protect public health, and ensure America's energy sector  remains globally competitive.\n\nMethane has a global warming potential 80 times higher than carbon  dioxide over a 20-year period, meaning that even small leaks can erase  the climate benefits…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688174/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…event, planned for April  2025. This event marks a historic milestone in recognizing the  intellectual and cultural revival of Dharma traditions in the United  States and globally, solidifying its role as a forerunner and a guiding  force akin to a banyan tree that supports and nurtures other Hindu  organizations in the country.\n\nRajiv Malhotra's scholarship…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689467/recognizing-the-contributions-of-rajiv-malhotra-and-the-infinity-foundation"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…neutrons. The research conducted at this  facility has vastly improved our understanding of the fundamental make- up of matter and is actively supporting collaborative research globally  in medium energy physics. Currently, numerous PhD students and  researchers are waiting to use the facility for experiments, and the  backlog continues to grow as more scientists…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694942/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…at schools and on college campuses, and Jewish-owned  places of business, and on synagogues and places of worship.\n\nAnd incidents of anti-Semitism in the United States and globally have  risen dramatically since Hamas's brutal terrorist attack on October 7.  All of it--all of it--is wrong and has no place in our country, no  place in our society, no…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691646/recognizing-the-significance-of-jewish-american-heritage-month-and-calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…been known as the Rubber  Capital of the World, and my First Amendment upholds that legacy by  investing in American manufacturing to ensure that this vital industry  remains globally competitive.\n\nTaking from the Retreaded Tires Jobs, Supply Chain Security and  Sustainability Act of 2025, this amendment would ensure that the U.S.  Government uses retreaded…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695128/my-amendments-to-hr-3838"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Nation back in terms of improving air  quality and our transition to a clean energy economy.\n\nThe winner here is actually China because, like it or not, the clean  energy boom globally is happening. We have a big say in who leads it  and who benefits from it.\n\nIs it the United States? Not by the leadership and the policies I  have seen of this administration…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…The richest man in the world is demanding  cuts in the services that working families rely on. The richest man in  the world, who could be making contributions to end hunger globally,  decides that we should be cutting program services for working  families, many of which my colleagues will talk about today.\n\nMr. Speaker, as we stand here today in the…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Centers for Disease Control, and the  National Science Foundation; enough with canceling grants for medical  research and STEM programs that ensure our country stays safe and  globally competitive; enough with pedaling disinformation that  jeopardizes the health and well-being of millions of Americans; and  enough with hiring unqualified pundits, influencers,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691393/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…viability in the international market.\n\nAs the Department of Transportation is responsible for overseeing the  majority of American maritime shipping, both domestically and globally,  there is no reason why the Department cannot and should not set an  example that is meaningful.\n\nMr. Speaker, I encourage my colleagues to support passage of H.R.  2035,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692188/american-cargo-for-american-ships-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…train, so we needed a way to move our product. They  figured it out with the help of President Eisenhower and a lot of  others who preceded him in order to move our product globally. However,  we don't have some of the benefits that the other coast does.\n\nI would ask the gentleman to reconsider his opposition.\n\nMs. KAPTUR. Mr. Chair, I demand a recorded…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694952/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Owens-Illinois Glass, another recognized heritage glassmaking firm,  is headquartered in Perrysburg, Ohio. It had similar plans at its  Zanesville, Ohio, plants to remain viable and globally competitive.\n\nThird, Kraft Heinz, a giant in the food industry, is in Fremont,  Ohio.\n\nI simply do not understand how canceling these projects makes America  great again.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691905/department-of-energy-project-cancelations"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…Regional banks serve our economy. Super-regional banks serve  our economy, and big banks serve our economy. They serve different  parts of the economy.\n\nAt the larger end, the globally and systemically important financial  institutions make markets. They are part of why we have the deepest,  most liquid, and most competitive capital markets on planet Earth.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Dan Crenshaw", "party": "Republican", "sentence": "…tire makers. It is going to hit close to 100 rubber-mixers  across the country. That jeopardizes jobs, increases prices, and makes  American manufacturers less competitive globally.\n\nWorse, there is not really a benefit to this. These regulations don't  do much of anything to actually improve the environment. Under the  final rule, tire manufacturers…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688530/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…southern  border and bringing with them the drugs and the crime, as so many of  them were released into the country and others were never captured.\n\nWhat we see happening globally is the world's most successful  companies are investing in America, and $10 trillion is coming to our  shores. Record investment is driving job growth. It drives innovation…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698252/nominations"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…American workers.\n\nMr. Kimmitt has pledged to use America's trade tools strategically,  enforce our laws vigorously, and give our exporters the support they  need to succeed globally. I know he will deliver on these promises. His  deep understanding of how trade policy intersects with our national  interest will serve this Nation well.\n\nSo today, I congratulate…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694342/confirmation-of-william-kimmitt"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…States and the       ability for United States located firms to develop innovative       technologies.\n\n(13) Other barriers to the ability of the United States to       compete globally in an increasingly connected and digital       global economy, including, the use of technical barriers to       trade, country-specific standards for technology products…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692697/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…tireless dedication and exemplary service in advancing  the cause of global democracy, particularly during the most recent  disruptions in the freedom and democracy landscape globally and within  the United States.\n\nIn an era marked by profound challenges to democratic institutions,  Ms. Boyajian has demonstrated unparalleled leadership and resolve.  Relentlessly,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700047/recognizing-the-service-of-annie-wilcox-boyajian"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…``enablement of Islam in North America,'' establishing an  effective and stable Islamic movement led by the Muslim Brotherhood,  which adopts Muslims' causes domestically and globally and works to  expand the observant Muslim base. It was a coordinated and specific  effort to advance Islam into the United States.\n\nOur Founders did not envision a Nation…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…investments that  they be included in the final version.\n\nWe all know that the Chinese Communist Party is the greatest national  security threat--not just to the region but globally--at this time.  What many of us did not fully appreciate is how American investors are  directly supporting the Chinese economy and the Chinese military  through outbound…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…areas.\n\nAnd around the globe, President Trump has restored peace through  strength, after years of weakness from the Biden administration. We  have to note, when we talk about globally, what he has done--ending  eight wars, making the world a safer place not only for Americans but  for so many.\n\nAcross the government, President Trump has also rooted out…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "Mr. LUTTRELL. Mr. Speaker, I rise today to recognize Human  Trafficking Awareness Month and to speak about the serious threat human  trafficking represents here and globally.\n\nHuman trafficking is the second largest criminal enterprise in the  world, second to only that of drug trafficking. Human trafficking  generates an estimated $150 billion…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699002/human-trafficking-awareness-month"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…the ability to       recruit students with this expertise from their other school       experiences.\n\n(9) Mathematical modeling has been a strong educational       priority globally, especially in China, where participation       in United States mathematical modeling challenges in high       school and higher education is orders of magnitude higher…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…the community's most vulnerable times. Charles also  pioneered the Fighting Human Trafficking (FHT) Program, positioning  UWPC as one of only four United Way organizations globally offering  direct services to human trafficking survivors. This program is the  only one in Florida with state funding to provide emergency hotel stays  and housing for survivors…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690203/recognizing-chuck-anderson"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…If we fail  to lead in this space, we risk leaving the door open for authoritarian  regimes like China to advance its state-controlled digital currencies.\n\nThis bill is a globally competitive, regulatory framework for dollar- backed stablecoins, one that encourages domestic innovation and brings  transaction volume back into the United States' visibility…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693844/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…to comply with the administration's agenda--from Apple, to  Exxon, to Nvidia--summoned to the White House, pressured to avoid  disfavor or bad regulatory decisions; suing a globally known company  like Nike for choosing to have a diversity program.\n\nWhere is the alarm and the concern from the Chamber of Commerce, the  Business Roundtable, the National…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "John Boozman", "party": "Republican", "sentence": "…construction and family housing units, which are important to both  readiness and morale. Our bill will give the Department of Defense the  resources it needs to project power globally, enhance our warfighting  capabilities, and train our forces.\n\nImportantly, we provide $1.9 billion to improve housing and quality  of life for servicemembers and their families.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694207/military-construction-veterans-affairs-and-related-agencies"}]