[{"senator": "Bill Foster", "party": "Democrat", "sentence": "…14 percent, among many others.\n\nLong term, these cuts will have detrimental impacts on scientific and  technological innovation and cause irreparable damage to our global  competitiveness. So this discussion could not come at a more important  time.\n\nAs a result of Trump's directives, all grant funding at the NSF is  now halted, and the existing grants…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…science, technology,  engineering, and math. During the townhall, I discussed the dangers of  this administration's agenda for public health, national security, and  global competitiveness, and they asked that I tell you some of their  stories.\n\nOne researcher studies ocean and Earth sciences at San Diego's  prestigious Scripps Institution of Oceanography.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695749/funding-cuts-to-science"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…This important resolution will look to recognize  the important breakthroughs of medical research improving health  outcomes for patients and communities, securing global competitiveness  in science, boosting job creation, educating the next generation of  scientists, and strengthening economic growth.\n\nMedical research through the support of the National…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695475/introduction-of-a-resolution-recognizing-medical-research-week-from-september-15-through-september-2025"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…Asphalt Innovation Act, led by Senators Coons and Tillis-- will bolster U.S.-led efforts to deploy clean technologies in the  industrial sector while enhancing the global competitiveness of  American innovation.\n\nThe United States is leading the way into the 21st century, and this  can be seen in my own district, North Carolina's Fourth, where local…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688939/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…shape these global standards as they will define the future of  telecommunications technologies.\n\nThis bill will do exactly that. It will have a real impact on our  global competitiveness, 6G deployment, and our national security.\n\nMr. Speaker, I am glad to see that today we are making real progress,  and I strongly urge my colleagues on both sides of…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693508/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…inauguration, he  has used that Executive order to actually create an emergency. This  administration's actions are raising prices, killing jobs, and  undermining America's global competitiveness.\n\nNow, we have a lot of evidence--and I will be mentioning some of it-- but the most recent is from the International Energy Agency, which has  slashed its forecasts…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…security, and financial transactions. Investments that  strengthen the ability of American industry to realize the benefits of  new technology are essential to our global competitiveness.\n\nI am very mindful, Mr. Speaker, that the chaos of the Trump  administration is undermining U.S. leadership in technology development  and deployment. If my Republican…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692732/deploying-american-blockchains-act-of-2025"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…on Agriculture, I have made it a  priority to support family farmers and strengthen our supply chains  because I know how vital they are to rural economies, to our global  competitiveness, and to grocery costs.\n\nTo that end, the United States Grain Standards Reauthorization Act of  2025 is so important to ensuring the continuity and strength of our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695052/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Mr. Speaker, our Nation is at the crossroads when it comes to  powering our future. This pivotal moment will shape our economic  trajectory, national security, and global competitiveness.\n\nAfter years of modest growth in electricity consumption, the next 5  years could see upwards of 128 gigawatts of new demand. The vast  majority of this demand growth…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698073/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…profited from this system, other  countries--friends and foes--also benefit from U.S. investments. The  theft of our basic research poses a significant risk to our global  competitiveness. It takes our cutting-edge innovations and puts them to  work for our adversaries, undermining our economy and hindering our  ability to stay at the forefront of discovery.…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688931/united-states-research-protection-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…coordination  with the heads of other relevant Federal departments and agencies, to  conduct an interagency review of and report to Congress on ways to  increase the global competitiveness of the United States in attracting  foreign direct investment.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692697/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…United States has operated without a clear Federal  framework for dollar-backed payment stablecoins, leaving consumers  vulnerable to fraud, innovators in limbo, and our global  competitiveness at risk.\n\nThat is why I am proud to have introduced stablecoin legislation in  the House and worked alongside my colleagues in the Senate to make the  legislation…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693840/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…span across various sectors, including public safety, border and  immigration, critical infrastructure, and economic security.\n\nThreats of this nature undermine our global competitiveness and  national security, and in some cases, impose a significant financial  burden on our economy. It is absolutely essential that the Department  of Homeland Security…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688749/strategic-homeland-intelligence-and-enforcement-legislation-to-defend-against-the-ccp-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…of international competitors like China on  spectrum policy.\n\nI am confident that ITS will continue to contribute to innovative  advancements that are crucial to our global competitiveness.\n\nThis bill also directs ITS to establish an initiative to support the  development of emergency communication and tracking technologies for  use in locating trapped…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693438/institute-for-telecommunication-sciences-codification-act"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…for digital  asset firms to operate legally and with confidence, encouraging digital  asset innovation to remain in the U.S. The CLARITY Act unlocks economic  growth, global competitiveness, and financial opportunity for all.\n\nMr. Speaker, I urge my colleagues to support this bill and put  America first in the race to lead the global digital asset marketplace…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693773/digital-asset-market-clarity-act-of-2025"}]