[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…best-kept secrets in Washington. But it's not, by       far, the only secret. And I'll have more on that in the       months ahead.\n\nUntil next week, thanks for listening, and God bless you.\n\nThat was Ronald Reagan. The Republican Party wasn't always like it is  today. There was a time when the environment and clean water and clean  air were a priority of…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…amazed at is  that the media will allow him to take the last thing he says as what he  really meant. You would never do that for Barack Obama. You would never  do that for, God bless him, the last President of the United States,  the Honorable Joe Biden. You would never do that.\n\nHowever, you take the last thing this President says, regardless as  to…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…cuts and swing-district GOP lawmakers who say they       don't want to slash funding for the health programs their       constituents rely on.\n\nOff the article for a second, God bless you for caring about your  constituents.\n\nRevising the target would mean upsetting one of those       factions and potentially risking the support of key votes to       pass…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…attacked by an enemy from without.  That was horrific. America lost thousands of lives that day. We stood  on the steps of the United States Senate that evening and sang ``God  Bless America.''\n\nOn January 6, I was sitting where the gentleman from South Carolina  now stands. I saw an officer, a detail officer from the Capitol Police,  come in and take…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698552/january-6-attack"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…point.\n\nOr that tax cut can be designed so it goes to folks who have really  been riding the wave of the financialization of the economy, folks who  have become billionaires--God bless them--multinational corporations  that have extremely strong balance sheets and really strong profits,  companies that already saw a tax cut in the last tax bill that has…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689539/h-con-res-14"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…strengthening Social Security, not cutting and gutting it.\n\nMr. Speaker, I end with Social Security is a sacred trust from one  generation to the next, and we intend to keep it.\n\nGod bless every senior in this country and those who will access that  important age of 65-66 very soon.", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699878/protecting-social-security"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…sacrifice will never be in vain.\n\nOn behalf of all of Long Island, we will never forget those who laid  down their lives in service to others. As we mark Police Week, may God  bless the officers who gave up their lives to keep Americans safe and  may He give their loved ones comfort.\n\nMr. Speaker, I thank, honor, and stand with all of our officers,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691183/national-police-week"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…our Santa Ana chief of police. He fulfilled  a lifelong dream of being an American and serving his great country.\n\nHe inspires our community. I thank him for his hard work. God bless  him and God bless Santa Ana.                       Recognizing Goodwill Industries\n\nMr. CORREA. Mr. Speaker, I rise today to recognize Goodwill  Industries of Orange County…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691173/congratulating-loris-griset-academy"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…U.S. government has stated that it is not safe for Americans       to travel there. For this reason, I have chosen to remain in       the United States to protect my life.\n\nGod bless America.                                __________\n\nMy name is Rebecca Zama, and I serve as Legal Services       Coordinator and Immigration Policy Analyst with SOIA. As…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…treated him. Chevy Chase falling over Gerald  Ford would probably put him in bad positions, too. Comedy is comedy.  Free speech is free speech, and we shouldn't step on it.\n\nGod bless the First Amendment.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695703/authoritarianism-is-a-threat-to-democracy"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…another form of       protectionism and I may need your help to stop it. Remember,       America's jobs and growth are at stake.\n\nUntil next week, thanks for listening, and God bless you.\n\nMr. SCHUMER. Yesterday, the Senate came together in a bipartisan way  to pass legislation to end Donald Trump's bogus emergency declaration  in Brazil, under the leadership…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696451/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…the United States of America we have free speech, and everybody  gets to express their opinion whether you agree with them or not.\n\nPBS does an exceptional job. Thank God for them. God bless them and  America.\n\nIf you want to help out, all you citizens out there, donate to PBS,  and don't put up with any of this nonsense.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692246/shame-on-republicans-for-cutting-funds-to-pbs"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…than I paid a week before.\n\nI have heard from mothers worried their daughters and granddaughters  will lose their Medicaid coverage for mental health care and treatment.  God bless every American family that has a child with mental illness or  a relative with mental illness. You are saints caring for them.\n\nA wife called worried her husband going through…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…independent in perpetuity, the United  States of America must continue its steady progress in building  competitive modern energy systems forward here in our homeland. May God  bless America.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…faces--those nice pictures of such nice people--out of my mind.\n\nOn the other hand, I am glad to hear Senator Hoffman and his wife are  making progress toward recovery. May God bless them all and their loved  ones.", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692586/minnesota-lawmakers-shootings"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…chuckled when he laughed.\n\nHe emulated all of us and what we can do in this body. There are good  ideas, there are bad ideas, and that is why we have to have this  debate.\n\nGod bless Raul and his family.\n\nRemember him in your hearts and say a prayer.", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688944/in-memory-of-congressman-raul-grijalva"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…agencies, it  is not good.\n\nTo the families of the fallen: Your loss is shared by a grateful  nation. We will never forget your loved ones' service, nor their  sacrifice. God bless them. God bless law enforcement. And may God bless  the United States of America.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691402/motion-to-discharge-s-res-195"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…be deeply missed in this Congress and  beyond. My team and I continue to pray for Doug, his family, and for  all who loved him during this particularly difficult time.\n\nMay God bless Doug LaMalfa's memory and may he rest in peace.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698733/9999"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…has contributed to our State, to the values  that serve us in education, that bind us together. Anita called me  about you and she was dead right.\n\nWelcome and well done. God bless you.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695300/dr-rabbi-ari-berman"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…of danger is something  that we should all strive to embody.\n\nI thank Scott for his courage and for changing the course of many  families' lives, including my family. May God bless him.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694141/recognizing-uscg-petty-officer-scott-ruskan"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…certainly seems like this might have been a targeted  attack. We will not rest until the deranged psychopath who did this is  brought to justice. But that being said, may God bless the Cook family  and give them peace and comfort in the midst of unspeakable tragedy.  And may we honor Ella by carrying forward the values she lived by.  Though her life…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698419/unanimous-consent-requests-the-calendar"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…together this week and throughout the year to honor their  service, remember their sacrifices, and renew our promise to stand with  those who protect our communities. May God bless our fallen heroes,  their families, all who serve in law enforcement, and the United States  of America.", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690972/national-police-week-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Mr. ROY. Mr. Speaker, I would note just an observation: One of our  colleagues on the other side of the aisle who is a cancer survivor--and  God bless him for it--was raising issues about government funding and  about what funding should or shouldn't exist and what this  administration may or may not be doing to make sure…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Trump, and we pray that the Lord would continue to give him  wisdom and discernment as he leads our Nation and continues to work on  bringing down tensions in the Middle East.\n\nGod bless President Trump, God bless our troops, and God bless our  great country.                  One Big, Beautiful Bill's Economic Relief\n\nMr. MANN. Mr. Speaker, I am proud of…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…our  colleagues. I thank him for his leadership, his Conference leadership  and on the Budget Committee and the Ways and Means Committee. It is an  honor to work with him.\n\nGod bless our great country. Let's get that One Big Beautiful Bill  Act and that America First vision that is wrapped in that  reconciliation bill to the President's desk. Most importantly,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…chance for  America to beat China in the very important nuclear power race and  secure our Nation's future energy security.\n\nI urge my colleagues to support this amendment.\n\nGod bless west Texas, and go Wildcats.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694865/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…besides guarantee that  their votes  count by ensuring that it is only citizens voting in our elections?\n\nMr. Speaker, I thank my friend from Arizona for yielding.\n\nMr. ROY. God bless you, brother.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699673/united-states-fiscal-situation"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…will endure in the  strength of the U.S. Army and in the countless soldiers who are better  leaders and better Americans because they served alongside him and  under him.\n\nGod bless you, GEN Jay Mingus, and thank you for your service and  sacrifice to our great U.S. Army and to our great United States of  America.", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699779/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…occasion, Jim and I might have disagreed here on the  House floor--it has been known to happen--we are all united in offering  our condolences and prayers for Jim's family, and God bless Molly and  his entire family.\n\nMr. Speaker, on the legislation that is before us, I know that my  colleagues on the other side of the aisle are, no doubt, about to  launch…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…I ask my colleagues to join me in wishing him a happy  100th birthday and thanking him for a legacy of service that will long  endure.\n\nMr. Stevens, here is to many more. God bless you, and God bless  America.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699730/9999"}]