[{"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…proud to have led 64 of my colleagues in urging the Secretary of  Labor to reverse course, and I am proud of the work we have done here  tonight to make sure that none of this goes unnoticed.\n\nThis work is about the people, the people we serve and every single  American. It is about the home care worker pulling double shifts. It is  about the construction…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Voting Rights Act. Yes, that Voting Rights Act was there to  deal with racism. It says so in the act. It says race. We can't  discriminate against people based on race. It also goes into some other  aspects of discrimination, all of them invidious, but we can't do it.\n\nWe have to say ``racism'' if we are going to talk about the case  involving race. CNN…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…basketball team, guiding them to their first 20-win season  and a historic NIT berth in 1981.\n\nSnake was known for his energy, his drive, his showmanship, and his  humor. His legacy goes far beyond the wins. He helped the University of  Texas-Arlington Movin' Mavs wheelchair basketball program start, and he  was also very active in the Fort Worth chapter of…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693978/9999"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…all it is. If we make it 25 percent more efficient,  then, all of a sudden, we need 25 percent less electricity which is  being generated and 25 percent less pollution that goes up into the air  and into the lungs of the children in our Nation. That is what we are  debating here today.\n\nOnce again, the Republicans are going to side with the oil and…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690527/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…MERKLEY. Thank you so much for the question.\n\nWhen I hear that word ``corruption''--and I admit, I am starting to  feel a little dazed after these many hours on the floor--my head goes,  first, to the financial corruption of the President, but there are  always other forms of corruption he has engaged in, in terms of  corrupting the basic balance of the separation…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…old, they have access to your policy? Not one of them.\n\nDid any of them vote to eliminate being a woman as being a  preexisting medical condition? Not one of them.\n\nThe list goes on and on.\n\nDid any one of them vote for the Affordable Care Act, which, Mr.  Speaker, you can tell them was paid for? It was paid for. Later, when  we decided that we could…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696718/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…speech  for their students.\n\nMr. Chair, instead of addressing any of these crises threatening our  students in our education system, we are here voting today on a bill  that goes after foreign scapegoats instead.\n\nWe know that President Trump is the biggest threat to our education  system in America right now, not someone in North Korea or China.  Please,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689027/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…list--and we understand it is many groups and their  affiliates--and not tell Congress and not tell the American public, and  I get to make the decision about whether the Nation goes to war.\n\nThat is not what our Constitution says.\n\nMy colleague Senator Schiff is talking about the Constitution, so I  won't belabor it. But there are a couple of points that…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…and justice for  all.\n\n``The wretched refuse of your teeming shore. Send these, the  homeless, tempest-tost to me.''\n\nBring them to us, the United States of America.\n\nThen it goes on to say:\n\n``I lift my lamp beside the golden door!''\n\nMr. Speaker, the golden door is the door that stands for opportunity  and that stands for liberty and justice for all.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…in the hospital when it is too late or  more expensive to treat. Also, when more people show up in those  hospitals uninsured, they will get care, and the cost of that care goes  to everybody else.\n\nTonight, Mr. Speaker, you will hear stories of people who purchased  their insurance through the Affordable Care Act exchange who, because  of the enhanced…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…economic conditions in this country, and 64  percent of Americans say Trump's policies are raising the prices of  food and groceries.\n\nWhat is worse is that this very resolution goes further by using the  specter of socialism to undermine some of the most important government  programs in our country like Social Security, Medicare, Medicaid, and  ObamaCare.…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…grants, including research on cancer, Alzheimer's, ALS, heart  disease, diabetes, kidneys, mental health, maternal mortality,  infectious diseases, genetic diseases, and the list goes on and on.\n\nCommunity health centers would receive only partial funding to  provide healthcare services for low-income patients.\n\nFor Head Start, if funding lapses, thousands…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…policy. It punishes families not for  failing to work, but for living through a hard season. I will not stop  fighting until we restore this funding so that no one in Delaware goes  hungry.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693522/thanking-officer-robert-scisco"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Capitol Visitor Center  where it will be unsealed on our Nation's 500th anniversary on July  4th, 2276.\n\nWhile we won't be there to open it, we should be there to see what  goes into it.\n\nThe capsule will include items, as has been mentioned, that capture  the institutional history of Congress, significant legislative  milestones, and a message from…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699839/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…this money and [will] not let a bunch       of billionaires take it from us.\n\nAmen.\n\nI have worked since I was 16 years old and now I'm 71 but I       still work part-time. It goes without saying that I need my       [Social Security] benefits to survive and since Trump and       Musk took over I don't know from one month to the next what       might happen.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690633/nomination-of-frank-bisignano"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…they don't like. But the neocons were just that, new conservatives, a  collection of anticommunist liberals between World War II and the  Vietnam war who were, as the saying goes, mugged by reality--in this  case, the reality of the New Left's turn against America.\n\nNorman followed this path and blazed it for others. Born in 1930 to  working-class Jewish…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698421/unanimous-consent-requests-the-calendar"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…data. They have us in nine budget years, 30 percent of U.S. tax  collections will go just to interest.\n\nMr. Speaker, you pay your dollar in taxes, and 30 cents of that in  2035 goes just to interest. Does it not scare anyone? When the interest  growth is bigger than everything we are talking about in trying to  say--by multiples, by multiples--we calculate…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…graduated from medical school, one of the most common  surgeries was taking out a portion of somebody's stomach. I don't mean  your belly. I mean your stomach, where the food goes down after you  swallow it. This is how I talk to medical students--because of peptic  ulcer disease.\n\nAnd there came along a medicine called cimetidine. It just changed  the…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691544/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…bill would require VA to conduct a study and  produce a report on the frequency of bile duct cancer for veterans who  served in and around the Vietnam war.\n\nMr. Speaker, it goes without saying that many Vietnam veterans  suffered greatly in service to their country. Thousands of Vietnam  veterans still live with invisible and visible wounds of war today.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689625/vietnam-veterans-liver-fluke-cancer-study-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…can still choose to do that, but the vast  majority of Americans, working Americans and everyday Americans, use  the doubled standard deduction.\n\nThat is real tax relief. It goes unsaid a lot. It is such a standard  piece. Nobody truly disagrees with it--``nobody'' meaning both parties.  It is something that we have now established as the norm, and it…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699706/historic-tax-relief-for-families"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…Republicans passed our budget resolution, putting a marker in the  ground to restore and secure our country both physically and  financially.\n\nWhile I don't think this resolution goes far enough, the resolution  that we are about to pass today is a positive step forward, and it is  what Americans demanded 5 months ago.\n\nYesterday, I had the opportunity to…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689919/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…are procedures that are  important here. The ranking member should know this.\n\nAs members of the Foreign Affairs Committee, we have sole  jurisdiction over powers of war. What goes on abroad with war is not  flippant activity. It affects the lives of soldiers, sailors, marines,  and airmen that are stationed abroad in Europe, Asia, Latin America,  and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695244/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…is ensured so that it gets power to  the consumer, to our families, and to our businesses. They rely on  that.\n\nWe know the interruption that it has. If you have power that goes out  at your home or power that goes out at your business, that is a major  inconvenience and, in some instances, a major interruption in your  business. It can be a major safety…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695756/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…businesses were hit with  an unprecedented $1.8 trillion--not billion--$1.8 trillion in new  regulatory costs while inflation soared over 20 percent.\n\nWhere do you think that cost goes, Mr. Speaker? It goes to the  consumer. Main Street cannot thrive under that kind of bureaucratic  chokehold. Americans are demanding affordability, and this is a good  step…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697329/small-business-regulatory-reduction-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…whether it is Cuba, whether it is Iran, whether it is Russia or China.\n\nAnd, in fact, Venezuela had become a hub for illegal drug  trafficking, along with everything else that goes with that. And it  also had become a foothold for Iranian terrorist organizations like  Hezbollah and was using the money they were able to raise from illicit  drug trafficking…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…critical role in maintaining  records on the Briggs & Stratton airplane engines being rebuilt at the  facility until the operation closed in 1945.\n\nMarjorie's legacy, however, goes far beyond the factory floor. After  marrying her husband John David Curtiss, she raised four children, put  herself through nursing school, and achieved a career in the field.…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690143/recognizing-marjorie-curtiss"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…environment and produce the energy that people  need.\n\nAgain, if you bring the poster that the President used, you can see  States that have the highest energy prices, and it goes to their energy  regulation that their State and local governments have done to  themselves.\n\nMr. Speaker, I was in California putting gas in a rental car, and I  looked over…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698566/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…in just eight days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life-changing mission.\n\nThe impact of WREC's work goes far beyond electricity; it represents  a bridge to connection, opportunity, and the return of future  generations to their ancestral homes. The emotional moment when power…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692593/recognizing-patrick-sullivan"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…the Consumer Financial Protection  Bureau, the CFPB, can do this rulemaking under its cited authority in  the Truth in Lending Act.\n\nI have serious concerns that if this rule goes into effect that it  can potentially bring about a criminal charge and even perhaps criminal  punishment. I don't think the CFPB looked at all the criminal laws of  the States,…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…effective, accountable service to the  American people. We must ensure that collective bargaining agreements  already in place remain, as well as ensuring that good government goes  hand in hand with that.\n\nMr. Speaker, I was proud to join colleagues across the aisle as being  the 218th signature to advance this bill forward.\n\nI thank Congressmen Fitzpatrick…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697983/protect-americas-workforce-act"}]