[{"senator": "Robert Garcia", "party": "Democrat", "sentence": "…Republicans are fighting for  the biggest rip-off in American history and the biggest attack on our  social safety net in decades.\n\nIf this bill passes, 16 million people are going to lose their health  insurance. They will take away basic food assistance from millions of  veterans, seniors, and kids. The poorest 10 percent of Americans are  going to lose…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693237/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…business comes from  exporting to Canadian customers. Most of his sales contracts in Canada  were canceled after these tariffs went into effect last month, so he  says he is going to lose between $400,000 and $500,000 this year in the  business.\n\nNow, President Trump says he is worried about trade imbalances and  that he wants to support exporters. Well,…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689483/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…communities and Tribal communities across our  State.\n\nLet me say this: Our people are afraid. Everywhere we go, across the  aisle, we saw people who are afraid they are going to lose their Social  Security, people who are afraid they are going to lose the healthcare  that keeps them and their family members alive, people who are afraid  that they are…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690395/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…know how they go home and  face their constituents who are about to get screwed over with high  healthcare premiums and bills and say: Oh, I know, I get it. People are  going to lose their healthcare. My friends have been in charge all  year, and they have done zero, nothing, not a damn thing.\n\nSo these bills that we are talking about today, I would…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…recertification even for those       with chronic lifelong conditions.\n\nThe bottom line is, it doesn't matter what you say. It doesn't matter  how you do it; 16 million Americans are going to lose their health  insurance under this legislation, and no amount of rationalizing on  your part is going to change that.\n\nMr. PALLONE. Mr. Chair, I yield myself 1 minute.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…costs for the average American.\n\nThe Republican Party let the Affordable Care Act enhanced premium tax  credit expire without any safety net, so millions of Americans are  going to lose their health insurance. Some have already decided not to  sign up because they can't afford it. They are going to lose their  health insurance. We will have more tomorrow…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Affordable Care Act, subsidizes premiums, which provides health  insurance for millions of Americans. Again, those premiums are going to  be cut. As a result, people are going to lose their health insurance.  That is not me saying that. That is the Congressional Budget Office,  the neutral umpire that calls balls and strikes around this Congress  who…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691848/one-big-ugly-bill"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…people because they fear the tweet of a President more  than they fear the wrath of the voters at the ballot box. This will  come home to roost because 17 million people are going to lose their  healthcare.\n\nIn Texas, we are one of the largest creators of clean energy jobs.  Texas is the energy State. I am proud to be an energy State. We have  vast amounts…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693208/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…never going  to meet it, and they are still going to be paying out of pocket in ways  they can't afford.\n\nYou know, more than 38,000 people in my State alone are probably  going to lose their coverage right away, all because Washington  Republicans just refuse to extend this tax credit allowing them to  purchase their own insurance.\n\nFamilies, sadly, are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695919/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…not exercising oversight  of the Chief Executive in the manner in which we should. We have become  vastly more partisan in that regard as well. I have served under--I am  going to lose track of how many Presidents. I think it is five now.  Every single one of those, Republicans would always have complaints  about a Republican President and Democrats would…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…been using  to track infectious diseases, health disparities, vaccinations, mental  health, substance use and services. Because of that reversal, my State,  for example, is going to lose $350 million in Federal funding for  health programs due to these cuts. My Governor, Phil Murphy, said that  these cuts would create an unfillable void in funding that…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…I mean, your big, ugly bill that you  passed a couple of weeks ago is going to throw millions of people off  of healthcare. It is going to throw--millions of people  are going to lose their SNAP benefits, their nutritional benefits, and  the reason why is because you are making major cuts. It has nothing to  do with undocumented immigrants. You can say…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…shows up. And this healthcare  solution that the Republicans have been promising for 15 years--it is  not going to show up tomorrow. As a result, 22 million Americans are  going to lose their coverage. They are going to have to pay  exorbitantly higher prices for their healthcare coverage than they have  to pay today.\n\nSo this week, Trump, in a self-grading…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…majority. It is just almost  unthinkable, yet that is where we are.\n\nMr. Speaker, it is a little bit rich to hear all of this concern  about jobs and the poor electrician who is going to lose a job and to  hear all of this concern about the energy that we desperately need to  meet projected demand increase.\n\nWhat we are really hearing across the aisle is a very…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Washington to represent.\n\nIt is extraordinary to me that, as a result of this one big, ugly  bill, this all-out assault on healthcare in this country, millions of  people are going to lose coverage, thrown off of healthcare, set in  motion a chain of events where hospitals will close, nursing homes will  shut down, people unable to get the care that they…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…are not going to pick the winners and losers, and that is  important. When the Federal Government wants to go out there and pick  the winners and losers, this country is going to lose.\n\nH.R. 3668 is the solution. I thank the gentleman from North Carolina  (Mr. Hudson) for his leadership, and I urge all of my colleagues to  support this bill.", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698073/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…can't do it. We know what happens if you overregulate and  don't produce the energy. That is a good example right there from  Europe.\n\nWe know we need the power or we are going to lose the great battle of  our time of who is going to control AI and supercomputing, eventually  quantum computing.\n\nThe very first thing we can do to really bridge that power…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…I laid out  can still talk about why they are against them. They can make up fake  bogeymen: Oh, it is the billionaires, it is this, it is that the  disabled people are going to lose benefits.\n\nDo you know what we do, Mr. Speaker? We strengthen benefits for  people that are truly needed, Mr. Speaker, because so many of these  programs that once used…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…and  it is a big part of their nest egg. They know that if, in their area,  more houses start being built, then the price of their home is going to  go down and they are going to lose money.\n\nNow, again, I am not picking on Colorado. That is true in Colorado.  It is true in every State in our wonderful Union. It is called NIMBY-- not in my backyard.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…means and ends than genuinely work  to make their lives better. The American people see that for what it  is. Mr. Speaker, you are hearing: The sky is falling. Everyone is going  to lose their healthcare if this is not attached to a CR at this  moment.\n\nYes, we do have the majority. I am confident we will pass the CR in  the House. However, Mr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Representatives of  this body who are going to have to learn and get to know new  communities that they are going to be representing that they have never  represented before. They are going to lose communities that they may  have represented for some time.\n\nNo one wants this, not Democrats in the House and not Republicans in  the House. I have people coming up to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}]