[{"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…the fraud, waste, and abuse at the Pentagon. Go tax  billionaires and offshoring corporations. We don't do it on the backs  of veterans.\n\nThis is unacceptable, and we are going to fight this every way we  can.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688314/staffing-cuts-at-the-va"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…great House: ``I have depression and  PTSD. I am unable to work and rely on Medicaid to get my monthly  medications to keep me essentially alive.''\n\nTamra, we are going to continue to fight hard on your behalf.\n\nWe heard from Emily, who lives in the Commonwealth of Massachusetts.  Emily tells us: ``I had moved to Massachusetts in 2020 and was working…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…devastating things added at the last minute in this  bill, snuck in, in the dark of night.\n\nWe in the Senate--and I hope our Republican colleagues will join us  in this--are going to fight this every step of the way. Much of the  clean energy industry will be dead. As I said, hundreds of thousands,  if not millions, of jobs will be lost, and China, 10 years…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…back  against corruption, against greed, against consolidation, and for the  American people to have that American Dream.\n\nThat is economic patriotism. That is what we are going to fight for,  and I am so grateful to my colleague from Pennsylvania for making sure  we put that out there.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689086/economic-populism"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…something about them. We are not doing very much in this Congress  to fight racism. We have done a lot to fight anti-Semitism.\n\nBy the way, I am against anti-Semitism. I am going to fight it. I am  going to stand up against it. I would just like for a good many of  those people who insist on fighting anti-Semitism to be as vocal about  fighting racism. I…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…of your  skin, how you worship, you can get the care you need when you need it  and know you won't go bankrupt.\n\nThat is all people are asking for right now, and we are going to  fight to make sure that every single American can go to bed at night  not having to worry about the answer to that question.\n\nMr. Speaker, I thank you for your attention tonight.…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…calculators. That is what Trump wants  you to do.\n\nPass this quickly and move on so he doesn't get blamed for how much  it is going to screw people.\n\nMy answer to that is: We are going to fight back. If you support this  budget, we simply do not share the same values. I believe it is  fundamentally wrong to gut Medicaid. I don't want to kick moms and dads  and…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Congressional District have called and  written to my offices in Akron, Canton, and here in D.C., imploring me  to save Medicaid.\n\nThat is exactly what I am going to do. I am going to fight for Mariah  and Ohio's 13th Congressional District.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691524/gop-tax-scam-hurts-women-and-families"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…our bodies, and that is not freedom.\n\nI stand with all our servicemembers, including our trans  servicemembers, who are willing to fight and die for our freedoms. I am  going to fight for their freedom to be who they are, to fight for an  America where we all belong. We should not be at war with each other.  We all belong.\n\nMs. JACOBS. May I inquire…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…about conservative policies, but now they  are about racist policies.\n\nThis President is infusing, injecting racism into Presidential  policy. It is unconstitutional. I am going to fight it, but more than  that, I am going to tell the truth about it. If I happen to be one of  those who is extricated, who is removed, evicted, I will be bloodied  but unbowed.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694163/racism-infused-in-texas-politics"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…fight to make the  difference so that it can live up to these great ideals expressed in  these great documents, the Declaration of Independence, the  Constitution.\n\nI am going to fight to maintain the right to fight. That is what this  is all about. Not fighting in the sense that I am going to go out and  harm someone, not fighting in the sense that I…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…healthcare programs.\n\nThis can be done because there has been an indication in this House  that some $880 billion will be cut or should be cut or attempted to be  cut--I am going to fight it--from the committee that has jurisdiction  over Medicaid and Medicare.\n\nYou can't cut $880 billion out of the appropriations that will  emanate from that committee without…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…incitive terms. Interesting to note, the reporter did not say  ``anti-Semitism.'' By the way, I fight anti-Semitism every day of my  life. I am antithetical to it, and I am going to fight it. I think we  have to end anti-Semitism. I am going to fight to end anti-Semitism,  but on CNN, ``anti-Semitism'' is a word that you can use to address the  anti-Semite…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…because of a heart attack, I am going to follow the theme  of the 2025 National Minority Health Awareness Month: Advancing  Commitments to Eliminate Health Disparities. I am going to fight any  effort by our President or my colleagues on the other side of the aisle  to put barriers in our way and to remove the very policies that help  save lives to begin…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…through the appropriations process.\n\nIf Democrats want to vote ``no,'' that is their prerogative. They  have become the party of socialists. Let them vote that way.\n\nWe are going to fight for those hardworking families who want to get  our great country back on track.\n\nLet's pass this bill, keep moving, and keep working toward a better,  stronger America.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693719/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…worrying about whether  the airways are safe, whether WIC is funded, whether SNAP is funded,  whether workers are funded, whether the military is funded; since we  are going to fight over who is going to win the election a year from  now, let's excuse the people who are not responsible for this  dysfunction from our dysfunction.\n\nThat is what Senator…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696599/9999"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…steal those  opportunities away from your daughter.\n\nIt is not going to happen, not on my watch. We can start with the  service academies and protecting these women who are going to fight  valiantly, to serve, and to protect our freedoms in our country, here  and abroad, to make sure that opportunities are not stolen from them by  the mentally ill.\n\nMs.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…gentlewoman from  Michigan that Michigan is such a beautiful State. It has got one of the  longest freshwater coastlines of any State. That may be a trivia fact,  but no one is going to fight harder for Michigan's environment than the  people of Michigan. This amendment gives them that authority back, and  so I would ask her to reconsider her opposition.\n\nMr.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…Israel so much that they  are willing to jeopardize the security of the United States, know this:  You are in the minority, you will lose, and I and President Trump are  going to fight you every step of the way.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692703/thanking-president-trump-for-saving-the-world"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…claiming they are sicker.\n\nPeople have got to understand, there is actually a piece of  legislation to do this. Preliminary scores, $1.84 trillion of savings.  We are going to fight, knife fight, complain, cry, and fuss at each  other over things that are absolutely tiny.\n\nWe have been told this piece of legislation actually is the biggest  savings bill…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…recognizable.  For a lot of countries in Europe, mass immigration of Islamists has  ruined their way of life. They turned a blind eye, like we are at the  moment, and are going to have to fight in the streets to get their  countries back.\n\nIt is coming. That is exactly what is going to happen in this country  in a few short years if we don't act now to save…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…fighting after another cancer diagnosis.\n\nHer strong faith in God and positive attitude will keep her on the  road to recovery.\n\nTracy and I are with Gail, and I know she is going to fight hard and  beat this thing. I ask that everyone include her in your prayers.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690521/recognizing-gail-acampora"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…with Democrats in Congress. Closing businesses and  demanding quarantine is Big Brother knows best, and that is what the  Democrats are best at.\n\nHouse Republicans are going to fight back to restore that personal  choice, all while ensuring fiscal responsibility.\n\nMr. Speaker, I remind my colleague on the other side of the aisle  that House Republicans…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…love to have $5 trillion  in cuts on this bill.\n\nMr. NORMAN. Mr. Chair, we have got more to go. This is the first  step. The journey starts with the first step. We are going to fight,  and we are going to stop the policies that have bankrupted this  country, that you have put up with for the past 4 years. Time is up. It  is time for a new day.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688063/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}]