[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…in their  ``Beautiful For Billionaires'' bill.\n\nTo head this off, we are going to have to pass legislation that  exempts Medicare from those coming PAYGO cuts that are going to happen  automatically by operation of law unless we take that step.\n\nNow, Republicans could have, at the time, put a simple provision in  their ``Beautiful For Billionaires''…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695699/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…a fancy word for: We are not really doing what we say we are doing, but  it is accounting fraud.\n\nAny way my colleagues cut it, it is accounting fraud. Here is what is  going to happen: Republicans are going to pass massive tax cuts, with  much of it going to those at the very top of the income scale, those  who don't need our help.\n\nThe nonpartisan…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…havoc on millions of Americans, and those Americans also  deserve to know about what happened and who profited off of it.\n\nDid the financial executives know about what was going to happen? Did  the President's donors know? Who knew and who profited from this  ``great time to buy'' tweet and everything that was leading up to it?\n\nWe need a full investigation…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689992/markets-sent-into-a-tailspin"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…and care their patients desperately  need; they would not be able to be the source of light to so many  people that are facing scary darkness.\n\nThey think: That is not going to happen to me. That cancer diagnosis  is not going to happen to me. That rare disease that affects the  child--it is not going to happen to me.\n\nBut when it does and they can't…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…in three children in Rhode Island need Medicaid.\n\nFive in eight people residing in nursing homes in my home state are  also receiving Medicaid. Let me tell you what is going to happen when  Medicaid is cut by this extraordinary amount of money, $880 billion. A  lot of nursing homes will close because their margin, the difference  between opening the…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689546/h-con-res-14"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…This bill, if passed, was supposed to take effect in the year 2027.  There is a change in this bill. It takes place immediately, for this  election.\n\nI mean, how is that going to happen? We have elections beginning in a  matter of a few weeks, and you are expecting every State to be able to  comply with all these new rules and regulations, like, immediately?…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…to 130,000 megawatts of electricity load by 2030--as much  electricity as is used by more than 100 million American homes. Do you  want to hear that again? This is all going to happen in the blink of an  eye. They are going to be consuming as much electricity as 100 million  homes in our country.\n\nOn the supply side, well, Trump is cutting off our cheapest…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696132/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…in the White House that somehow Americans are going  to be inoculated from tariffed goods from other countries because we  are going to have this burst of output that is going to happen, even  though we don't mine for things like copper and nickel, and even though  the steel industry in the U.S. will tell you they do not have the  capacity to replace…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689376/cost-of-living-still-high"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…made my  exit as a means of protesting what the President was saying.\n\nHowever, Mr. Speaker, as I did this, I became overwhelmed with just  the notion that something was going to happen very ugly and it would be  something that would hurt people who are on Medicaid and Medicare. I  also brought up Social Security when I spoke, but these are the things…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695807/censured-but-not-silenced"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…almost $100 billion a year, $100 billion out of  roughly $600 billion in spending. Mind you, that is not trimming. That  is taking a wheel off the car.\n\nHere is what is going to happen. As I said, Medicaid covers 80  million Americans with health insurance. It also provides the funding  that allows grandma to stay in an assisted living facility after…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689793/defending-medicaid-for-families-like-the-currans"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…United States enjoys, but there were other questions that  were raised, too, during the course of this.\n\nIn addition, the question is, Where do we go from here? What is going  to happen to Venezuela's future? What is our responsibility? What are  we accepting?\n\nThe American people need to be in on that conversation. It is easy, I  learned in my time in…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698599/venezuela"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…sites--these Safe Streets sites-- between 2023 and 2024, four of the sites run by the Center for Hope saw  zero homicides. Now they are having to lay off people. Guess what is  going to happen. Those shootings are going to go up again.\n\nWe had to work really hard to find this consensus on a very difficult  issue. It is illegal, what the President has done. He…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…Garden paved at the White  House. I haven't met a constituent who said they want to see more gold  candelabras in the White House. I have met constituents who said: What  is going to happen to my health insurance? When is ICE going to get out  of the kindergartens in Los Angeles?\n\nI hope we don't have a government shutdown, but that would require  Republicans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…country--one of the most  unpopular bills in the history of the country. Now that it is law, we  don't have to imagine anymore what might happen; we know for sure what  is going to happen to tens of millions of people all across the  country.\n\nI want to focus on five things that are going to happen--five things  that are going to happen because we no longer…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…millions of dollars.\n\nThe one bit of good news is that many of us, like me, are here still.  We fought that uphill battle and won it, but now we have to look at  what is going to happen in the future, at what kind of political system  our kids will have to endure. Will they feel like they have a voice in  our politics, or will they feel like they are…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "James Risch", "party": "Republican", "sentence": "…with absolute  certainty that you do not know the discussions and what is happening as  the train moves forward to try to resolve this.\n\nThis isn't a resolution that is going to happen with a whole bunch of  people getting involved and trying to lay out different things that  they want to get to resolution. It is going to be complicated. It is  going…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688569/9999"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…either going to pass that on to  their consumers in higher food prices, or they are going to continue to  pay an extra $10 or $20 a month in electricity.\n\nThat is what is going to happen that they don't realize, that what  they are wanting to do is mandate that businesses have to increase  their expenses at the expense of the consumers because they are…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689265/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…to work on a lot of  issues because we do care about the cost of electricity. I know they  know we care about the cost of electricity.\n\nIf the Keystone pipeline is not going to happen, which by  Presidential fiat didn't happen, we have to worry about future  situations when we are in Congress. We don't just legislate about the  past. We have to legislate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695688/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…you can't turn the lights on because the wind is not blowing  and the sun is not shining. We are going to have rolling brownouts and  blackouts because that is what is going to happen, like in California.  Americans in the 21st century are going to become used to it. We are  going to normalize living in the seventh century instead. Of course,  all of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…can't do this just  because you feel guilty--just because you feel guilty because the  United Kingdom at one time owned other countries.\n\nNow, look, I don't know what is going to happen. President Trump-- thank you, President Trump, for objecting to this. But I don't know  what is going to happen if Prime Minister Starmer, who is polling right  up there…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699482/9999"}, {"senator": "James Risch", "party": "Republican", "sentence": "…changed that. He removed Maduro. Do you know what  that same Senator says today?\n\nThis is reckless. And the American people are just, this       morning, in fear of what's going to happen here.\n\nThat was January 4, 2026.\n\nThis is the height of hypocrisy. The purpose of this resolution is to  slap the President in the face. It will do nothing that it purports…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698707/venezuela"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…is an option. And  that, to me, is profoundly, profoundly troubling.\n\nI think most of us want to be able to just not only quiet that but  make clear that is not only not going to happen, but it is an option  that has been taken off the table. I wish that I could say we have  received that kind of reassurance, but to date, we haven't. We haven't  had that…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…effort.\n\nMr. Speaker, I will point out that the idea that passing this  Congressional Review Act would restrict all off-road vehicle access is  just not right. That is not going to happen. There was a rule in place  before the Biden administration put the new rule in place. We vetted  this with the Congressional Research Service. We would simply go back…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…government, punish  the American people, put people's lives at risk, and think we are going  to sit down and negotiate with you under those circumstances. That is  not going to happen.\n\nWe told you 43 days ago, from bitter experience, government shutdowns  don't work. They never achieve the objective that you announce. Guess  what. You haven't achieved…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…You  have a middle class that is getting absolutely crushed and squeezed.\n\nTheir purchasing power is stagnant, if not reduced. It doesn't have  to be that way, but it is going to happen through policy here. It is  like no one here went to their basic elementary school economics class.\n\nThe chart here--I am going to try to make a point--is customs duties.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…billion-dollar program and needed a tax increase on  every American to pay for it, well, now that vote is a little  different. We don't do that. We never do that.\n\nNow what is going to happen? Well, there is going to be a lot of  posturing over the next week.\n\nHere is something that everybody should get a bit of a chuckle out  of. We had to pass the budget…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…just to get to a point where there is  only a $7 billion budget gap for just the first next few months.\n\nThe fact of the matter is that this project has failed. It is not  going to happen. There is absolutely no justification for spending  another dollar of taxpayer money, especially when our roads continue to  crumble and be rated among the worst in the…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…on fentanyl. Really? You think the drug dealers  are going to pay a tariff on fentanyl? Fentanyl is not being tariffed.  That is some kind of mistaken notion. This isn't going to happen. As I  have stated, there is more fentanyl going from the United States into  Canada than there is coming from Canada to the United States.\n\nIt is not a real emergency.…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…working with Fairbanks North Star Borough Historic  Preservation Commission to put Pike's Landing on the National Register  of Historic Places. I have no doubt that is going to happen. ``It was  so important to me that we rescue Lloyd Pike from obscurity,'' Jay  said.\n\nBut this wasn't the only historical figure that Jay has connected  himself  and the…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…Tennessee, Bill Lee, to survey the damage and to meet with local  officials and residents. For the Rives community, recovering and  rebuilding is not going to be easy and is not going to happen  overnight.\n\nI am sure that my colleagues who have toured disaster areas in their  own districts know exactly what I mean.\n\nFor communities that have been impacted by…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689382/filing-relief-for-natural-disasters-act"}]