[{"senator": "Ro Khanna", "party": "Democrat", "sentence": "…actually coauthored a bill on that.\n\nThat is not what the White House is doing. Instead, they think that  just having these billionaires cut deals with the private sector is  going to help the working or middle class. It will help my district. We  will make more money with AI. It will help more of the financial and  technology elites.\n\nI will tell you what…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689079/economic-populism"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…often, my  kids don't go to the doctor that often, so we will just roll the dice.\n\nShe said: We will wrap some bubble wrap around us, I guess.\n\nI don't think bubble wrap is going to help if they get in a car  accident.\n\nVictoria Cassels, an accountant in Roanoke, worries about her adult  daughter who lives in Richmond, who is a self-employed graphic designer…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…been vetted in such a way that OCC  understands very well: How are you going to service these customers?  Are you going to close down these branch bankers? How are you going to  help somebody that is looking for a mortgage? What are you going to do  to the person that can't talk to the ATM because they are trying to get  a car loan?\n\nThese are legitimate…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "…has taken away food stamps. He has taken  away opportunities. We are going to make sure that we reverse all that.\n\nThe first step is these ACA tax credits because it is going to help  working families. The party in the majority now said they were going to  lower the cost of living, but they failed. Now we are going to step up.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698802/breaking-the-gridlock-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…daddy has to go back to D.C. I said that it is for work.  They seemed sad about that. My wife chimed in, and she said that it is  really important work. It is work that is going to help make people's  lives better.\n\nNow here we are, back at work. The first thing on the agenda in 2026  is not to lower the soaring utility bills. It is not to lower the  insurance…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…I hope that my Republican colleagues will see fit to speak out  against the abolition of the Consumer Product Safety Commission.  Putting it in another department is not going to help because they will  have less workforce and less ability to function.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Medicaid and SNAP.\n\nIn any case, I would love to see the math on how these particular  countries were chosen and why this administration thinks banning visas  from Fiji is going to help out social services or pay down the debt.\n\nThis blanket ban, with no exceptions, does nothing more than separate  families and create hardship. Our constituents deserve…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699204/ongoing-protests-in-iran"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…like the FBI or ICE.\n\nWe have to dig deeper here because the CMP is a nonprofit. This new  rule for the CMP, where they would sell massive amounts of firearms, is  actually going to help gun manufacturers make mountain loads of money  by putting more guns into circulation.\n\nIt is interesting. I looked it up. On a list of the 22 major sponsors  of the CMP,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695142/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Meanwhile, and the good news, is that this Congress has kept working  to find a solution, and the legislation before us today is reasonably  negotiated and bipartisan. It is going to help communities who have  waited too long to finally have clean water.\n\nI thank my colleagues for their commitment to working with us to  reach the language before us today.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698699/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…priorities. When we talk  about about priorities, especially in eastern North Carolina, I visited  our child development center, and part of the funds we see in this bill  are going to help Seymour Johnson Air Force Base. When I think about  the work that is needed at Cherry Point, there are specific efforts in  here that help this community through the Flightline…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Because the officers of the State of New Jersey are going  to benefit from them because Donald Trump hasn't targeted these and cut  these, and these are things that are going to help all officers. That  is what this body should do--not pick and choose one State over  another, not pit one State against another, not pit so-called blue  States over so-called…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694305/chief-herbert-d-proffitt-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…doctor  that often. My kids don't go to the doctor that often. And so, we just  rolled the dice. We will wrap some bubble wrap around us, I guess.''\n\nBubble wrap is not going to help if she has a heart attack. Bubble  wrap is not going to help if she is in a car accident. Bubble wrap is  not going to help those mothers of premature babies who spend,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…$1,000--to pay for their health insurance premiums. They actually  are not going to be able to use it for that purpose.\n\nSo how is this Republican so-called healthcare plan going to help  someone who works in a hardware store, who owes $12,000 a year in  premiums, and has a $7,500 deductible? How does that $1,000 help anyone  whose premiums will be $19,000…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…utmost importance to Native-American Tribes, and all of us in this  country that represent Native-American lands and Native Americans make  a commitment regularly that we are going to help protect those rights.\n\nAllowing this veto to stand flies in the face of that, especially  because each of us, in both Houses of Congress, lent our votes to this  legislation.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698657/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…legally have one. So reluctantly, I must oppose this  bill which began as a Democratic bill which commanded unanimous,  bipartisan support before.\n\nNothing in this bill is going to help law enforcement officers  actually do their jobs, which was how all of this was introduced when  we first started out today. Indeed, it doesn't provide a single Federal…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…years. They still oppose it. They have learned nothing from 4 years of  failure. Democrats remain the party of high energy prices. That is what  they want. They think it is going to help the climate. Democrats remain  the party of painful and punishing regulations. They remain the party  of never-ending dependence on foreign dictators for energy that we…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688189/energy"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…officers putting in overtime, manufacturers keeping the lights on, and  border communities shouldering a burden Washington created are who the  one big, beautiful bill is going to help.\n\nWho are these people? These aren't the millionaires and billionaires.  These are everyday Americans. Despite what we hear from the Democrats  and the media over and over…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Wyoming--they are happy with what we have  done.\n\nChuck Schumer, who was just talking about it, voted against it. The  Democrats wanted to raise taxes by $4 trillion. How is that going to  help our country? It is not.\n\nAnd then I heard Senator Schumer talk about bartenders. Well, we say  no tax on tips. Bartenders get tips as part of their pay, so do  waiters,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699081/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Texas. Mr. Chair, this is going to create jobs, not just  for Texas but for the entire Nation.\n\nThe gentleman across the aisle just mentioned Iran, that somehow this  is going to help make it easier for Iran in the nuclear realm.\n\nI think Iran just discovered that President Donald J. Trump is  serious when he says they will not be allowed to get a nuclear…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694854/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…all keenly aware, the Chinese Communist Party has a  stranglehold on far too many mineral supply chains. Mining in the  Duluth Complex was poised to change that. It was going to help usher in  a new era of American mineral dominance and create and support  thousands of American jobs. It was going to help end our dependence on  foreign adversaries and…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…from Amazon. I take it back. Please do the right thing here.\n\nIf you are determined to give away these islands to Mauritius, which  never owned them, which inevitably is going to help China, if you are  determined to divest the people of the United Kingdom of these islands,  please sell them to the United States. I will sponsor the legislation  happily,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699482/9999"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…odds--again, some really long nights--to move  this forward and to fund the Department of the Interior, the Forest  Service, EPA, and related Agencies. But what we agreed to is going to  help our people, our communities, our economy, our security, and our  lands and our wildlife. It is something we should all be proud to  support.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…lifting the sanctions on the  Syrian people, but the Syrian people know that America can be trusted.  Now, let's take that opportunity and help not only them, because that  is going to help stabilize the region in the Middle East and it is  going to help our ally, Israel, it is going to help our other allies  who are participating in the Abraham Accords. I…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691249/president-trump-in-the-middle-east"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…house the homeless, and then $104 million a year--not  the total scheme, a year.\n\nThere is just one problem: None of the money was going for housing.  None of the money was going to help people who were homeless. These  providers and this nonprofit that was coordinating it just put the  money in their pockets.\n\nBut there is more. They came up with a third…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…time.\n\nMr. Chairman, I rise today in support of the House's fiscal year 2025  budget resolution, which is a critical step needed to unlock a  reconciliation bill that is going to help secure our border and  revitalize our military. It is going to unleash American energy  independence and extend tax cuts for American families and small  businesses.\n\nSimply…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688038/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…who have come together under the cross  that stands up on that hill in Kerrville and the people who have  generously contributed now $150 million and counting that are going in  to help those people, and the first responders who showed up on the  scene and the people like my friend and the former sheriff, my buddy  from Louisiana, who dropped everything…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…and the right  actually said we are going to fixate on the way we deliver healthcare,  the way we deliver nutrition support, the way we do agriculture policy,  that we are going to help our brothers and sisters be healthier, and,  by the way, family formation, the use of healthcare, the ability to  have a life.\n\nMaybe it is moments like this where we go…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…for  service, but its model was that we were going to incentivize the folks  who manage the care to make money by helping you be healthier. The  incentive was that we were going to help populations be healthier.\n\nThe MedPAC report for the beginning of this year, today, comes at 120  percent of fee for service. Just that delta from the 95 to 120 percent…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Again, I am down here on the floor trying to help Senator Gallego, a  Democrat from Arizona. He is a marine. I like marines. He has a good  bill here. It seems like it is going to help his constituents. So I am  ready to go.\n\nAll right. If you guys want to object to the House bill, I get that.  We are objecting--some of our Senators are objecting to House…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…redraw our district lines once every 10 years, and we  could focus all of the time, energy, and resources being put into this  fight--which, by the way, it seems is not going to help one party or  the other to any significant degree, it is probably going to be more or  less a wash, but we can get back to focusing on the issues that  actually matter…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}]