[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…disappointed me time and time again. From the day  you arrived, I asked for jokes. I haven't asked much. I asked you guys  just to be funny, and you are not. You are really going to have to work  on that in life. I mean, you have got to have a sense of humor.\n\nBut what you lacked in humor, I was blown away by just how good  people you are, and this world is…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…sometimes the gears here move more slowly, even on simple tasks,  than one would like. But instead of asking for unanimous consent on  this resolution tonight, instead, I am going to work with a colleague  across the aisle, a colleague, a Republican from North Carolina, Thom  Tillis, who came here earlier today with the same sentiment in his  heart that…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698521/anniversary-of-january-6"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…evolve, is $5.3  trillion in tax breaks for the wealthy. It is clearly the No. 1  priority for Republicans. Well, to do that, to pay for that, working  families are just going to have to work harder?\n\nThese same Republicans who want to give the tax breaks to the wealthy  are also the ones supposedly concerned about our Nation's growing  deficit. They are…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689475/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…abide by  the rule of law. This agency is defying this at every step of the way,  every day, with the sanctioning of the President of the United States  saying that we are going to work to increase the pain, that we are  going to detain and potentially deport United States citizens.\n\nWe asked for some simple reforms: Don't deport United States  citizens.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699345/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…presents for their  child--I just think it is unrealistic. The President is saying: Well,  maybe the kids can get by with 3 dolls instead of 30.\n\nWell, that is not how it is going to work. The store is going out of  business. The store has a certain predictable business model in terms  of how much revenue they are going to have per year, based upon what…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the city of  Chicago and I am sure in your State of Oregon where the intimidation  factor has reached a point where people are worried about literally  going to church, going to work, taking their kids to school. It is a  genuine problem.\n\nJust last week, an individual took his child to daycare, left the  motor running in his car and took the little…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696348/trump-administration"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…to set us  back.\n\nThese aren't false threats. They are now a reality. It is blow after  blow. It is self-inflicted chaos at a time when we don't need it, when  it is not going to work for Michigan and not going to work for this  country.\n\nMichigan is a national leader in public university research, with  nine public institutions in the great State of…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691394/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…put those savings totally at risk. You cannot take on some of the  world's biggest companies--the pharmaceutical companies--with bandaids  and a skeleton crew. That is not going to work. I think we all know  that. We all know this is really hard work.\n\nOn top of this, the firings threaten healthcare for the 170 million  Americans who get coverage through…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…That is what we did in World War II. We need a government  that says: If you skill the factories here we will help finance it. We  need a government that  says that we are going to work to invest in the plumbers, electricians,  and machinists so we can actually have a workforce that builds the new  factories we need.\n\nWe need to say that we are going to…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689079/economic-populism"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…into a  classic trap. When times are tough, he ignores reality and tries to  convince people that everything is actually going great. This has never  worked, and it is not going to work now.\n\nA year ago, Donald Trump stormed into office on the promise to lower  costs, to fight for ordinary Americans, to unrig a rigged system. He  ran, in other words, as…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…and desperate for guidance regarding TPS.       They are asking about legal resources, immigration attorneys,       emergency funds, and whether it is safe to continue going to       work. Many are afraid to leave their homes. Others are facing       the immediate loss of income because their work permits have       expired and they are legally barred…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…in this country, everybody. If we work hard and  play by the rules, we should be able to afford the good life in the  United States of America. That is what we are going to continue to work  on. Bring the American Dream to life, consistent with  that aspirational part of the Declaration of Independence, the life,  the liberty, and the pursuit of happiness.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…penalties, doesn't get us  out of the economic problems and the immigration policy problems that  we are in. It is a distraction. It will be ineffectual, and so it is  not going to work to deal with the real crises that we are facing.\n\nMr. RASKIN. Madam Speaker, I yield 2 minutes to the gentlewoman from  California (Ms. Kamlager-Dove), a very distinguished…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Strategic Defense Initiative, and has now been rebranded Golden Dome.\n\nFor more than 45 years, scientists have been patiently explaining to  policymakers that this is never going to work. It is easy to overwhelm  with a trivial response to it.\n\nWe have spent over $200 billion on it. We have never tested it once  against the kind of countermeasures that…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…sales and economic activity.\n\nInflation, which crushed households under the previous  administration, is falling sharply. Wages are rising, and the American  people are going back to work. Mr. Speaker, 2.4 percent is where  inflation is now--near the Fed's target for price stability--down 70  percent from the height of Biden's inflation crisis. We also…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…to make it possible to encourage our  brothers and sisters who are not working to actually get into the labor  force? Yet, my colleagues on the left say: Oh, you are going to have  work requirements. You can't do that.\n\nIf you don't do it, tell me how I make these numbers actually work.\n\nThat is some of the miserable stuff. Let's actually sort of walk…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…exist.\n\nThe policy of the Iranian regime is to destroy the State of Israel,  purify Islam, and come after us, the infidels. Until they change that  policy, nothing is really going to work.\n\nSo what I want to hear, before we sit down and talk to the Ayatollah  and his henchmen, is that, for the first time ever since the founding  of the Iranian regime, they…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693122/motion-to-discharge-sj-res-59"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Mr. Speaker, this is important. We do want to beat China. I have a  tremendous amount of respect for my ranking member. We want to work  together to beat China, and we are going to work together to beat China  because that unites all of us. Everybody in this room and everybody in  this Chamber wants America to be first. We are going to work together  to…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697089/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…but anybody who doesn't  want to vote ``no'' needs to understand what they are blocking and  understand what they are voting ``no'' on.\n\nThe rest of us are going to keep going to work for those hardworking  people who are tired of struggling, Mr. Speaker. They are tired of  waiting for the right kind of things to happen in Washington. We can  finally…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…those programs that are waste, fraud, and abuse. Our American tax  dollars should not be spent in that way.\n\nI am sorry that they are lying to you in this way, but we are going  to work through all this and work to save you all money.\n\nI am sorry that you are all being lied to, but you are going to  expect to hear more.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692528/rescissions-act-of-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…including from child  safety advocates, pediatricians, and tech companies like X, Microsoft,  Snap, and Apple, which announced its support today.\n\nIn the weeks ahead, we are going to work with our colleagues in the  House of Representatives to ensure that this vital legislation makes it  to President Trump's desk. When it does, the President will have a…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…already had a really stressful job and then had to show up for work  without getting paid. They missed multiple paychecks.\n\nWe know a lot of those air traffic controllers are going to work jobs  as Uber drivers. They aren't able to show up for work because they have  bills and rent due. They are trying to put food on their table, and  Democrats want to vote…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696745/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…and you are not going  to. We did the same thing twice, so I am not saying that we have clean  hands over here. You guys did it on DACA. It didn't work there. It is  not going to work here.\n\nThe only people who have suffered have been the American people, the  people whom we are all here to serve.\n\nLet's keep the focus on getting the government back…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…embarrassed to even look in the eye--I voted for all of  it--to go see a TSA agent at the airport in Nashville in my home State  of Tennessee where I fly out of, the FAA people going to work at the  airport. I was embarrassed coming here and seeing the people sitting in  front of us here, the people guarding the doors of the Capitol  building, with no respect,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…gentlewoman that certainly I  look forward to working with her as we move forward with this  legislation to make sure that we have the right type of language.\n\nWhat I am going to do is work with the gentlewoman as we move forward  on this legislation to make sure that we don't have any unintended  consequences in the language. We will do that as we move…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…the Tax Cuts and Jobs Act in 2017, we heard the same things. None of  those things happened. In fact, we had a booming economy. I don't think  the same scare tactics are going to work again.\n\nMr. Speaker, Americans are the most generous and caring people in the  world. We have set up lots of programs to save the lives of people  across this country and…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…important bill  for some really heroic constituents of mine, Alaskan Native Vietnam  veterans, and I am going to explain this bill a little bit.\n\nHopefully, the Senate is going to work well, because when I tried to  pass this a month ago, Senator Padilla said: Hey, I am going to object,  but if you work with us on some bills that you can move in a pairing,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…it breaks down law  and order.\n\nWe have been talking for weeks about you wanting to fix things. You  are blocking a debate. I can't believe I am here. I thought we were  going to work together to try to find out how to reform ICE and also  address the bottom-line problem, which is sanctuary city law abuse.  That is the problem--not ICE, not Miller, not…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}]