[{"senator": "Patty Murray", "party": "Democrat", "sentence": "I heard the majority leader just now say they are not going to  operate with a gun to their head.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the United States Fish and Wildlife Service Relating to ``Record of Decision for the Barred Owl", "date": "2025-10-29"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "We are not going to go that direction.", "title": "Democratic Proposals", "date": "2025-02-26"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "It is impossible to explain or defend what is going on today.", "title": "Providing for Congressional Disapproval of the Proposed Export of", "date": "2025-07-30"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "I am going to speak and shift  this conversation a little bit in the direction I think we really need  to go.", "title": "Promoting Responsible Oversight to Eliminate Communist Teachings for Our Kids Act", "date": "2025-12-04"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "We are seeing across the State of Alabama, particularly in our rural  counties, which if you know anything about the South, those rural  counties in the South typically have higher Black populations, going  back to the historical role and the historical place that they were for  slavery, and the descendants stayed there.", "title": "Health Disparities in Minority Communities", "date": "2025-04-28"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "In Representative  Stefanik's district, a hydrogen fuel cell plant was not going to be  completed by the same company that was going to build in California and  Texas.", "title": "Devastating Harm Caused By Trump Administration", "date": null}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "over the last  few years has actually been going down.", "title": "Lowering Age At Which A Minor May Be Tried As Adult for Certain Criminal Offenses in District of Columbia", "date": null}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "They have already warned us: Unless something is done, there is going  to be a lot of closures and a lot of reductions of services in these  hospitals in rural areas, in small towns, and the inner city.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "One analysis determined that approximately 3 million manufacturing,  agricultural, and service sector workers could become uninsured under  the simply ``Make sure they are going to work'' plan.", "title": "Medicaid", "date": "2025-05-12"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "Many teachers across our school districts, in my  district and throughout the country, are going in their own pockets to  buy support services for students and their own supplies.", "title": "Thanking W. Kamau Bell for His Generous Donation to Oakland Schools", "date": "2025-05-08"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "Long eager to drag America back to the ugly glory days of White  nationalism under his hero, President William McKinley, Trump now is  apparently going to make imperialism great again, also.", "title": "War for Oil", "date": "2026-01-07"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "But we are going to stop that  bill.", "title": "Terminating the National Emergency Declared to Impose Global Tariffs", "date": "2025-04-30"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "They are not going after violent offenders.", "title": "Visit to Bluebonnet Detention Facility", "date": null}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "One day, we are going about  our business in Santa Ana, Orange County, masked Federal agents start  going into our neighborhoods, picking up hardworking neighbors.", "title": "Condemning the Violent June 2025 Riots in Los Angeles, California", "date": "2025-06-27"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "Speaker, going to the Supreme Court for that means  that ``cruelty'' has not even come close to the word that is needed for  that kind of behavior.", "title": "Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "Twenty percent of our  refining capacity is going to disappear overnight.", "title": "Researching Efficient Federal Improvements for Necessary Energy Refining Act", "date": "2025-11-20"}, {"senator": "James Lankford", "party": "Republican", "sentence": "It is this ongoing dialogue that we have as a country: Do we value  the most vulnerable in our society?", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "We must ask: Are we going to uphold the President's constitutional  role as head of the executive branch?", "title": "Protect America's Workforce Act", "date": "2025-12-11"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "People from all over  the United States of America and all over the world love going to  Florida.", "title": "-9999", "date": "2025-12-17"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "Chair, I rise in opposition to this amendment I am  going to say for procedural reasons, but there are procedures that are  important here.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "Markwayne Mullin", "party": "Republican", "sentence": "I don't think it is crazy to think that we would want to be proactive  about going after narcoboats.", "title": "Unanimous Consent Requests--The Calendar", "date": "2025-12-17"}, {"senator": "Greg Murphy", "party": "Republican", "sentence": "I  am proud that this administration and this Congress are going to  support the military in keeping us safe and free.", "title": "Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2026", "date": "2025-06-25"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Who's going to prosecute these cases?", "title": "-9999", "date": null}, {"senator": "John Cornyn", "party": "Republican", "sentence": "I also had the chance on this same panel to visit with  representatives of the agricultural sector, including Dante Galeazzi--I  am going to butcher Dante's name--Galeazzi, who is president and CEO of  Texas International Produce Association, who emphasized to me how  beneficial the Trump tax cuts were for Texas farmers and ranchers.", "title": "Texas", "date": "2025-04-28"}, {"senator": "James Risch", "party": "Republican", "sentence": "It can have  no practical effect because it is trying to stop something that isn't  going on.", "title": "Venezuela", "date": "2026-01-08"}, {"senator": "James Risch", "party": "Republican", "sentence": "First, I think that we ought to have  a good statement from the administration as to why this resolution is  not well-taken, and I am going to quote from the Executive Office of  the President their statement on the policy.", "title": "Motion to Discharge--S.J. Res. 59", "date": "2025-06-27"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "Then they admitted, many of them--and we can name them here, but I am  not going to take the time--they admitted they were using the American  people as leverage in this political game.", "title": "Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "That is information  we need if we are going to bring an end to this practice of human  trafficking and also if we are going to bring justice for the women and  children that were abused and trafficked during these human trafficking  and sex trafficking rings.", "title": "Terminating the National Emergency Declared with Respect to Energy", "date": "2025-02-26"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "That is not going to happen.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the National Park Service Relating to ``Glen Canyon National Recreation Area: Motor Vehicles''", "date": "2025-04-29"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "Mark is not going far, and even though he won't be here in the  Capitol with us, I have no doubt he will continue to leave a lasting  impact on all of us after he leaves.", "title": "Historic Tax Relief for Families", "date": "2026-02-04"}]