[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…who  lives in Florida, ask them about their home insurance. You will hear an  earful from them.\n\nIt is not just getting shot down; it is also that insurance rates are  going up. Again, look where--along these coastal areas, along these  wildfire-prone areas.\n\nWhat the Trump administration is doing to reward its big fossil fuel  megadonors isn't just to…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…lawfully present.  Due process lets us confirm whether Trump is about to send them to a  foreign prison. Due process lets us confirm whether people are guilty,  instead of going off how they look or what tattoo they may have. And at  the end of the day, due process means they get an actual determination  of guilt or innocence, instead of getting disappeared…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…administration. It is as if Trump  doesn't control the CFPB.\n\nMr. Speaker, the regulation we are considering now is just a  regulation that says that this is an area we are going to look at.  Republicans are afraid the Trump administration will look at it. It  doesn't do anything except begin a process.\n\nMr. Speaker, as to both of these CRAs, the effect…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689952/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…people out there think  is that they are not relying on Medicaid, so maybe it doesn't affect  them.\n\nThe message I really want to deliver, Mr. Speaker--and I am actually  going to look at the camera to speak directly to the American people-- is that cuts to Medicaid, or to Apple Health, impact every single  person in this country.\n\nThey impact you if…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…remarks that he doesn't  like the fact that they need to look for these things in areas where  they are not known to exist.\n\nThat is kind of the whole point. If you are not going to look for  them while already there doing a survey, we may never know that things  actually exist in some areas. Without these surveys, operators might  not discover these archeological…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…contractors.\n\nAnd you want to talk about waste and fraud. Just look at the defense  budget. You just look at it. It is just loaded with waste and fraud,  but they aren't going to look there.\n\nThey are looking at the pockets of ordinary families in our country,  and they are going to tip them upside down and shake the money out of  their pockets, 2 days…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Stopping at some point might mean tumors would resume. One of       the congressionally directed medical research program grants       recommended for FY25 funding is going to look precisely at       many of these questions. Two others will examine other       aspects of critical treatment.\n\nThese are life-or-death issues for the patients, and yet…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…floor in the service of  the fossil fuel industry, which has the world's biggest conflict of  interest and a history of lying and of dark-money political influence,  is going to look pretty damned bad.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Trump.\n\nThese are not economically based decisions. These are purely  personal, whimsical decisions that harm American families.\n\nThe hope is that any Chief Executive is going to look thoughtfully  and rationally, measure benefits and costs, and make decisions that  benefit this country. That is not the case with President Trump.\n\nAnd while he is cutting…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696448/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…we don't, we better come up with a  solution to ensure that Americans all across this country can access  the care they need when they need it. If we don't, how are we going to  look them in the eye and say we served their needs?\n\nI worry about that. I worry about that mother who wakes up one  morning, bleeding, 9 weeks away from her due date who goes…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…prerogatives. And please, on this  larger issue of the planet and the leadership which the United States  should be playing, please say no to these industries.\n\nThey are going to look back at this moment--children alive today--and  they are going to just wonder, What were they thinking that every car  is coming in from China into every country in the…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…zero takers.\n\nBy the way, where is the legislation that gives the President the  power to give $20 billion or $40 billion to Argentina?\n\nI haven't looked it up yet. I am going to look it up, but I think it  is exactly a feature of an authoritarian government that he wants to  self-help a fellow authoritarian government but with a twist. The twist  is…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…be cared for moving on. If we can move as much of those resources back  into the decisionmakers' hands, we are going to have success here.\n\nMr. Speaker, I think we are going to look back at this point down the  road and say that this was a key part of why we were able to better  fund schools that are in tough communities, to better fund special  education…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…whether it actually  was a war and whether we should have voted to initiate war when the war  is over depending on how many people die.\n\nAnd then they say: Well, we are going to look at the scope, extent,  and duration of the war, but since we don't know what that is, we are  going to guess based on what the policymakers say. And they say to us  now…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699091/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…bunch of groups out there--all conservative--that have  had their phone records looked at, too, but we are not going to give  up. No matter what Senator Peters says, we are going to look at it.  There is Turning Point USA. There are a lot of shenanigans going on out  there with Jack Smith, and we are going to look at it, whether you want  us to or not.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699105/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…submit, Madam  Speaker, that it could affect them because what happens at the EPA, if  they do it now on the larger producers of tires, et cetera, at some  point, they are going to look at doing it at the medium-sized  producers.\n\nThe Yokohama plant that employs a lot of people in my district, in my  hometown of Salem, Virginia, could be affected long…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…little while ago, where we stacked on top of  stacks.\n\nWhy is it so terrifying to the army of lobbyists, the people back  home who want more money to say, hey, we are just going to look at  everything because we found occasions where we are doing an  appropriations that there was an appropriation done 3 or 4 years ago,  and the money is still sitting in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…amount. Since fiscal year 2003,  the GAO estimates that the Federal Government has lost $2.8 trillion to  improper payments.\n\nSo you have to say ``Where is the money going?'' when you look at  these numbers. According to the GAO, in fiscal year 2024, more than  half--$85 billion--were improper payments under Medicare and Medicaid.  That is called sloppy…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699102/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…our system. It is in direct conflict with Western  civilization. It is in direct conflict with the Constitution and the  rule of law.\n\nIf we want to see what America is going to look like across this  country if we don't address it, look at Dearborn. Look at Minnesota.  Look at Mamdani's election in New York. Look at London. Look at Paris.  Look at…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…way, this is relevant whether we are running a $1 trillion or  over a $1 trillion increase in debt every year, or whether we were, in  fact, in a surplus situation.\n\nI am going to look at some programs, which, again, maybe  intentionally, maybe unintentionally, penalize people who are raising  children while they are married.\n\nWe had a hearing a couple…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…distributional effects. Okay. Mr. Beyer and I are both on Ways and  Means and battle in the committee.\n\nRemember, there is no bill coming out of the committee yet. What is  it going to look like? Do we actually have to make elegant changes? Are  there things we can agree on as a body that will maximize economic  growth?\n\nAt some point you have got to look--and…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…your FICA taxes and there is a shortfall, so they cash that in every  month?\n\nIf you add up all of the money and interest paid from the trust  funds, I think this year is going to look more like $1.2 trillion in  interest. Why that is important: What is the number one spend in  America? The number one spend of your Federal Government is Social  Security.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…State legally.\n\nWhen you think about this cost, $9.5 billion just in the first year,  is a cost that is basically triple what was originally projected. Think  what that is going to look like over the next 10 years. We are talking  about potentially hundreds of billions of dollars that could be going  toward Medi-Cal for our own residents that is instead…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…good. It is a  good idea to give the opportunity to Maduro to just create and conduct  free, fair, and transparent elections with international observers, and  he was going to go. Look at where he is at now.\n\nMaduro is not only the head of the Suns Cartel, one of the most  important drug trafficking cartels in the world, but he was also  indicted in…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697160/denouncing-the-horrors-of-socialism"}]