[{"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…altogether, exposing  them to risks and spiking premiums across the board.\n\nI am also deeply concerned about the chilling economic effect that  this will have. If we aren't going to pass legislation to lower costs  in this Congress, can we at least pass legislation to keep them from  going up even more?\n\nI urge my colleagues to support the rule and the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698590/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…really doing what we say we are doing, but  it is accounting fraud.\n\nAny way my colleagues cut it, it is accounting fraud. Here is what is  going to happen: Republicans are going to pass massive tax cuts, with  much of it going to those at the very top of the income scale, those  who don't need our help.\n\nThe nonpartisan professional economists at the Joint…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…wanted, not a  single, solitary one. Meanwhile, all manner of different issues that  are pure culture war, partisan issues were allowed in. I fear that many  of those are going to pass. We will see. If those amendments are  defeated, we will wind up in a different place, but if they pass, we  will have a bill that is no longer bipartisan.\n\nThis year,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…increasingly apparent that the viability of  exporting U.S. liquefied natural gas depends on American policies to  address methane pollution.\n\nIf we don't do this, we are going to have to pass bipartisan  legislation to do the same thing to ensure that the industry standards  provide for the cleanest, most efficient natural gas production.\n\nIndustry and ratepayers…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688174/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…don't get the Medicaid reimbursement at our hospital,  I am just going to charge more to the people who have insurance. There  are going to be more people in my ER. I am going to have to pass that  expensive cost off to customers who do have health insurance.\n\nSo it is just important to understand the full spectrum of what we  are talking about here. Now,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689544/h-con-res-14"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…it. It is signed  into law forever. It will never change. It is permanent, and the  majority voted for it. Republicans all know that. So they shouldn't say  that they are going to pass some new bill next week to address this.  That is just an excuse to do nothing that would fix it.\n\nRepublicans moved at the speed of light to give tax breaks to  billionaires,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…dollar.\n\nNow, I think Americans will always have banks, credit cards, debit  cards, Zelle, Venmo, cash, money market funds, and pursuant to the bill  that it looks like we are going to pass today, they will have  stablecoin, a privacy device specifically designed for criminals and  tax evaders. Then they will have mixers to make it impossible for even  the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693738/anti-cbdc-surveillance-state-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…settled because when tariffs  are imposed, those are revenues going into the U.S. Treasury. I repeat:  When the costs go up by American companies importing products, they are  going to pass along that increased cost to American consumers. So it is  a tax by another name.\n\nAnd the last point I will make is this because it was relevant in the  Environment and…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689475/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…rounding the $491 billion number CBO  gave us for the total hit to Medicare done by Republicans in their  ``Beautiful For Billionaires'' bill.\n\nTo head this off, we are going to have to pass legislation that  exempts Medicare from those coming PAYGO cuts that are going to happen  automatically by operation of law unless we take that step.\n\nNow, Republicans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695699/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…cocaine and powder cocaine.\n\nI voted for it in the House of Representatives. Why? The idea was  that crack cocaine was such a deadly and threatening narcotic that we  were going to pass a sentencing provision that was really tough. Well,  this was tough. It said, if you were convicted of possessing powder  cocaine or an exact same amount of cocaine in…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693940/judicial-nominations"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…earn. And through this bipartisan bill, it shows that I am not going to  allow Washington gridlock and partisanship to block a bill without a  fight. That is why we are going to pass it today, taking matters into  my own hands, with the support of my colleagues on both sides of the  aisle, to pass our bipartisan No Tax on Tips Act by unanimous consent.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691423/no-tax-on-tips-act"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…themselves into the university systems in this country. This rule gives  us a vote on kicking them the rest of the way out of this country. I  think, Mr. Speaker, that that is going to pass in a very bipartisan  manner.\n\nWith all of the antics, yelling, screaming, and pointing of fingers,  I just remind you, there is a very serious piece of legislation to…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the Senate are  making it clear that they are opposed and will be responsible for  healthcare costs rising through the roof.\n\nYesterday, Leader Thune admitted:\n\nWe're not going to pass anything by the end of this week.\n\nThat is a clear admission of failure--a failure to govern, a failure  to lower costs for the American people.\n\nThe damage has been done,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…and 118th Congress. I  am particularly thankful to Representatives Roy  and Massie, along with many cosponsors who have joined this bipartisan  effort.\n\nThis amendment is going to pass because a clear majority of this  House agree it is time to close these chapters of endless wars. I am  prepared to fight in conference to get this over the finish line.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695262/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…that will also power rural communities. It is bipartisan and  noncontroversial. It is one that we must pass today. The good news is,  we do not have objections so it is going to pass today.\n\n1020 and that  the Senate proceed to its immediate consideration.", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694335/requiring-the-federal-energy-regulatory-commission-to-extend-the-time-period-during-which-licensees-are-required-to-commence-construction-of-certain-hydropower-projects"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Let's say it costs $5,000 to  $6,000, but the plumbing, electrical, carpentry, permits, and  everything costs $10,000 to $12,000.\n\nNow, they have a choice. They are either going to pass that on to  their consumers in higher food prices, or they are going to continue to  pay an extra $10 or $20 a month in electricity.\n\nThat is what is going to happen that…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689265/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Mr. ROY. Mr. Speaker, today a united Republican Party and a  bipartisan supermajority is going to pass a bill to increase  transparency regarding the egregious abuses by Jeffrey Epstein, a goal  that anyone of conscience desires. That is in totality an important  statement…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696812/epstein-files-transparency-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…all. They tried to  choose winners and losers. They tried to do it, but here in the House,  we are going to follow the Senate's bipartisan passing of the CRA.\n\nToday, it is going to pass in a bipartisan fashion in the House and  very soon the President of the United States will sign this into law.  It will change one of the many disasters of the prior administration,…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688634/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Ahmadiyya Muslims  or the Cubans or the Mexicans or the Filipinos--seem to do so well in  America, indeed frequently better than so many of the native born.\n\nWe are soon going to pass a reconciliation bill, and that  reconciliation bill will be a tremendous bill, a revolutionary bill.  The bill, I think, is going to try to get America back to its roots.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…hears this every year, and it is  still incredibly relevant.\n\nI want to thank Senator Blumenthal again for leading this effort on  the 250th birthday resolution that we are going to pass here in the  Senate in commemoration of the Marine Corps' founding.\n\nWe have a long tradition of being the service that is most ready when  our Nation is least ready.…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696624/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…to enrich insurance companies in the process, and have  nothing to take to the American people other than trying to create  division.\n\nThe fact of the matter is, we are going to pass this legislation  within days. We are going to send it to the Senate. We are going to  make clear to the Senate that they need to correct this issue because  the American…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696928/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…the world. We  are finally going to restore that great American Dream and that hope  for those families who have been waiting way too long. That help is  coming.\n\nWe are going to pass this bill. President Trump is going to sign it.  It is going to be a great Fourth of July. Let's pass the bill.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…point out to the body that while my distinguished  colleague speaks with his usual passion on many subjects, the only  subject before us today is whether or not this body is going to pass,  to enact, to approve H.R. 2243, the LEOSA Reform Act. That is the sole  question in front of us.\n\nThat measure is critically important to the safety of many law  enforcement…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691241/leosa-reform-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…Members  of Congress shouldn't be paid, OK? What Rand is saying--what Senator  Paul is saying--is let's pay everybody, and he is absolutely right. I  support that, but I am going to pass on it.\n\nI am going to pass on it, Senator Durbin. We live in the real world,  and my bill is more likely to pass the House and more likely to be  signed by the President…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…and not some  administration. Congress actually got together and said we are going to  have some efficiency standards on showerheads and a number of other  things. We are going to pass this bill, in 1975, and for over 30 years  that was the national standard.\n\nEven the American Association for Mechanical Engineers, this is their  definition that is in…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698562/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…receipts and spending are upside down. One is based on $7-plus  trillion, the other is based on $5 trillion, meaning that gap is not  nearly as tight as you think it is.\n\nI am going to pass through some of these.\n\nPart of the great battle is--and Chip was basically teasing for the  14 people that watch C-SPAN. Sometimes I am worried there is not even  14--if…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…floor  of the House of Representatives in the great State of Florida used to  begin his speeches by saying, ``I am fired up.'' I am fired up, Mr.  Speaker, because we are going to pass a great bill that promotes  America.\n\nWith the previous bill honoring the 1980 USA Gold Medal hockey team,  this is a great day in D.C. and all over the United States of…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690271/american-music-tourism-act-of-2025"}]