[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Republicans are moving forward with their version of the big, ugly  bill. Because House Republicans broke so many rules when they passed  their bill the second time, they are going to have to vote on it a  third time when it comes back from the Senate.\n\nMiraculously, due to their own ineptitude, Republicans have given  themselves yet another opportunity to protect…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Ms. JOHNSON of Texas. Madam Speaker, the House is soon going to vote  on some legislation that guts Medicaid and it slashes healthcare for  veterans. It cuts funding from important infrastructure projects and  takes food away from families…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688712/dont-vote-for-a-bill-that-dismantles-the-government"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…where lights are turned  off and doors are shut and opportunities are closed, unless you happen  to have the right ZIP Code or the right money.\n\nI know which future I am going to vote for today: the one where we  live up to our responsibility and all of our kids can live up to their  fullest potential and pursue big dreams. I urge my colleagues to join…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688363/nomination-of-linda-mcmahon"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…absolutely inane and bizarre  it is to come to the floor at 7 p.m. for the first real bill of this  Congress this year and it is on showerheads.\n\nWhen I heard that we were going to vote on showerheads, I literally  had to google and look up what this was all about. I was actually  genuinely shocked that the President, of course, had signed an  executive…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698563/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…it. That is what this program is all about. It is just to  say: You have got it; you have got it at home. Go to it. Be whoever you  can be.\n\nThese Republicans, they are going to vote this program out of  existence. This is the great equalizer. This is the access to  opportunity. This is democratization of access to opportunity through  education, which…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…real reform like the George  Floyd Justice in Policing Act.\n\nThis bill was rushed to the floor. We tried to make changes, but our  edits were rejected.\n\nMr. Speaker, I am going to vote ``no'' on this rule, and I urge my  colleagues to do the same. Folks should know that voting ``yes'' on  this is voting ``yes'' on more guns in our communities.", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699906/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…probably watching ice skating in the Olympics--because  three brave Republicans crossed over and joined all of the Democrats,  we are going to have that debate.\n\nWe are going to have that vote because what is central to people's  lives right now is their pocketbooks. They are just being hammered, not  just by their electric bills, but also their grocery…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…the Arctic Refuge for drilling  and pretend that that will bring in money, as well. Last time, it  brought in zero dollars when they did that in 2017.\n\nMr. Chairman, I am going to vote ``no.'' I urge my colleagues to vote  ``no.''", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688067/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…budget  deficit but will increase it. Mr. Speaker, if you don't believe me,  look at when we vote for the debt ceiling increase; $5 trillion to $18  trillion. What are we going to vote for? This is the wrong direction.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689899/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…just not fair. It is trying to give the impression  that you are doing something when, in fact, you are not. I feel  obligated to expose that and to say, no, we are not going to vote for  this hollow bill that actually does nothing because it gives the  impression that we are doing something that we are not.\n\nMr. Chair, I yield back the balance of my…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…the court, impeachment is still available.\n\nMr. Speaker, I intend to bring Articles of Impeachment. I don't know  what the vote would be. My guess is that you are not going to get the  vote required, but you will get the opportunity to see who believes in  what we have said.\n\nWe said that the President was a detriment to democracy. We talked  about how…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…to happen because we no longer have to talk about a  House version or a Senate version or what the President says he wants  or if someone says ``If I don't get this, I am going to vote no''; now  we have a law. We have public law, Federal law.\n\nThe first thing that is going to happen is 17 million Americans,  including 9 million people on Medicaid, will…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…is a  rotten thing to do.\n\nPeople want to participate in our democracy. They want to vote. I am  going to tell you, I can't wait until the next election because they  are going to vote you guys right out of office. The economy stinks  under this administration. I mean, the rhetoric coming out of this  White House is appalling. Enough.\n\nMr. McGOVERN. Mr.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…proposal, I yield 2 minutes  to the gentleman from Maryland (Mr. Olszewski).\n\nMr. Speaker, let me just respond to the gentlewoman by saying that I  don't know how Democrats are going to vote. I think some will vote for  the bill, and some will vote against the bill.\n\nWhat people are really upset about is the fact that we are bringing a  bill to reauthorize…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…in the future. But this is an exceptional  moment where the corruption and our effort to stop the corruption has  to take priority and has to take precedent. And so I am going to vote  for both of these resolutions while also still believing that we are  going to have a continued, important bilateral relationship with Qatar  and with the UAE.\n\nBut if…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…materials, with no redactions permitted under subsection       (b)(1).\n\nMr. JORDAN.  4405.\n\nMr. Speaker, we all support holding bad guys accountable, and we are  all going to vote for this resolution, but I think a little perspective  is important.\n\nDemocrats have spent 6 months talking about Epstein, even though they  had 4 years to do something…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696818/epstein-files-transparency-act"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…pornography. Of course it does. We have a specific provision in our  legislation to prevent that.\n\nThey have said so many falsehoods about this legislation, but now  they are going to vote for it--hopefully enthusiastically. Really, they  have been drug to this.\n\nOur judicial system is broken. If it were working, there wouldn't be  a thousand victims who…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696903/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…answer to as well.\n\nI challenge Americans at the polls, when you look and see what issues  your Congressman or, even more, your mayors or Governors are running  on, are you going to vote for people who are going to keep our America  great, not people who are going to say no immigrants whatsoever--like I  said, nationalizing 800,000 a year. Are you going…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "Mr. JOHNSON. Mr. President, 2 weeks ago, I came to the floor in  support of a bill that we were going to vote on, a motion to proceed  called the Shutdown Fairness Act. It is a pretty simple bill. The name  pretty well describes exactly what it is. It is trying to be fair  during…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…emissions. They destroyed that progress.\n\nI am very proud to lead this CRA. I am proud that it will be  bipartisan. I have had multiple Democrats who have told me that they  are going to vote for this because it is common sense and it actually  helps all of our goals: affordable, reliable energy that also helps the  environment.\n\nMr. Speaker, I urge all of my…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688184/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…like something Roger used to hide under my back  porch.\n\nWe are supposed to have a vote tomorrow. We don't know what we are  voting on, but we have been promised we are going to have a vote. I  hope we do. And I hope we are wrong, and I hope we come out of this  shutdown very soon. But I am not going to lie to the  American people. I think we are going…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…that they have done. We  are not going to let them succeed in that gambit. That is right.\n\nWhile the Democrats keep voting to shut the government down,  Republicans are going to vote to open it back up. We are going to get  the American Government running again and working for the people, as  they deserve.\n\nI am going to close with this. As Speaker,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696723/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Mr. DAINES. Mr. President, I am here to make some comments about my  friend Bill Mercer, whom we are actually going to vote on here on the  floor in a minute, but I wanted to set the record straight on  something. I am tired of the lies being spread around.\n\nThere is a lie about what is happening…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696364/government-funding"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…Federal Government $1.5 trillion--not million dollars, not billion  dollars, $1.5 trillion--bigger, we are going to shut the government  down.\n\nOf course we said no. I am not going to vote for that. My mother  didn't raise a fool. As I said before, if she did, it was one of my  brothers. I am never going to vote for that.\n\nWhere do I come up with this figure…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "John Thune", "party": "Republican", "sentence": "…to work on bills that have been coming out of  the Appropriations Committee with big bipartisan margins--a pretty  novel concept, right?\n\nWell, in just a moment, we are going to vote on whether to keep the  government open, and all indications are the Democrats are going to  reject the clean, nonpartisan funding extension here before us and  choose…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695921/continuing-appropriations-and-extensions-and-other-matters-act-2026"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…So what do we hear on the floor today? Not only is it that they don't  believe it is a problem but that they wish to continue it.\n\nThis is why I want a vote. We are going to have a vote on this. You  want to continue these policies. You don't think they are a problem. I  want to end them. Let's have a vote, a debate and a vote. You bring up  any amendment…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…authority will  vest in the Congress of the United States.\n\nWe authorize these programs. I don't think the answer is to say we  believe in these programs, therefore we are not going to vote to  reauthorize them because we don't believe they are going to be carried  out. It is our job to authorize them, to work the appropriations  process, and then to do the…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…That is what this fight  seems to be about, and that is the one end of things that is truthful.\n\nToday, Mr. Speaker, after 6 weeks of lots of pain and no gain, they  are going to vote again to keep the government closed. They are going  to vote again--they are whipping their votes--so they would not be  paying Federal workers and won't be funding essential…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696737/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…of Representatives are very clear. One, do  you think individuals should be U.S. citizens and prove that when they  register to vote? Yes or no? Two, should individuals going to vote need  to present voter ID upon arrival at the polls? Yes or no?\n\nIf you believe, like I do, in a commonsense proposal to make sure  that only U.S. citizens are registering…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}]