[{"senator": "Al Green", "party": "Democrat", "sentence": "…that is packed with people from District Nine.\n\nAnother way to look at it, to simplify, if you have two pies, and you  take a slice out of one pie and you decide you are going to add it to  another pie, but only take two slices from the other, and then you  combine them to create three pieces of pie, there would be two pieces  from the Ninth District…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…we really recovered from a post-Covid era, we haven't. People are  still struggling with the aftermath and the effects of that, and now,  we are basically saying we are going to add to your insurance.\n\nSo, as I did a few days ago here on the Senate floor, I came and  talked about how States are now putting these numbers out, a lot of  States. When I…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695964/en-bloc-nominations"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…cost of extending those tax cuts for the top 1 percent is  $4.5 trillion over the next 10 years.\n\nThere were some other additions that they put into the budget, which  are going to add to the deficit. To pay for it, they included a whole  bunch of cuts. The big one is to cut the Medicaid program, a program  which provides healthcare for 70 million Americans,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687944/republican-budget-betrays-middle-class"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…not going to accept or make normal this kind of  corruption of American foreign policy.\n\nNow, Mr. President, I will finish with this because my colleague from  Maryland is going to add some remarks.\n\nI admit that these are imperfect vehicles. It is all part of the same  story. Trump would not be moving forward with these arms sales if he  wasn't getting…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…it.\n\nIt talks about not only how many people will lose their healthcare  coverage and how many people will lose their SNAP benefits, but it  talks about how much this is going to add to the debt. It will add  trillions.\n\nThe people who are deficit hawks, they all talk a good game. They are  going to be tough on the budget. They are going to make cuts…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…fraud, waste, and abuse--something that I  have spent my entire life fighting against--we know that it is just not  true.\n\nDon't forget, they just passed a bill that is going to add $3  trillion to the deficit. They don't care about balancing the budget or  limiting waste. They want to cut services that American families depend  on so they can afford…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…We did have a debate in the Rules Committee  about this last night, but the gentleman was absent.\n\nEvery major organization that does budget analysis says that they are  going to add trillions to the debt. The only people who don't are the  gentlewoman from North Carolina. I am sorry. I didn't know that you do  independent budget analyses, but every…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…number three concerns that they have.\n\nWhen Members talk about the deficits and the jobs creation that the  Tax Cuts and Jobs Act are supposed to have, note that this is going to  add $7 trillion to our national debt. It will blow up our deficit. In  fact, Donald Trump is responsible for roughly 40 percent of the  national debt just in the 4 years in…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…have here in  Washington, D.C., for free, but we are allegedly saving money.\n\nThat is the goal. We are not achieving it because my colleagues are  pushing a budget that is going to add trillions of dollars to the  national deficit while firing hardworking men and women while we  continue to spend $3.5 million per trip for the President to go  gallivanting…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688514/people-not-statistics"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…thing that is deeply concerning is we have an incredibly  large deficit, and all the Republicans peacock around, parading about  how atrocious the deficit is. This bill is going to add $4 trillion to  the deficit. It is not conservative. It is not principally, financially  prudent, responsible legislation. It is outrageous and borderline  criminal against…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691436/republican-budget-bill"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…also calculated the debt impact in terms of H.R. 1 because of  the massive giveaway to billionaires and the top 1 percent of this  country. They determined that the bill is going to add $3.4 trillion to  America's deficits between 2025 and 2034.\n\nThe debt service on that additional debt is an additional $718  billion. That is just pure interest. It has…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…cut that makes no sense.\n\nNot only are you cutting it to give, again, those larger tax cuts to  billionaires and corporations, but you are cutting it, and you are just  going to add more and more to the overall healthcare costs of our  country and to the size of the debt.\n\nLet me go back to the text.\n\nHaving health coverage also makes it easier for…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…don't even  remember, and maybe the gentleman could enlighten us what the bill was.\n\nYet, on a major budget reconciliation bill, the majority is jamming  this through? It is going to add to the deficit. It is going to throw  people off of food assistance. It is going to throw people off of  healthcare assistance.\n\nThat is not me saying that. That is the…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…advertisement, as my colleague said,  with a direct quote from President Ronald Reagan about why tariffs are  bad, and he said: We caught the Canadians redhanded, and so we are  going to add another 10-percent tariff on top of what I have already  done, and we are going to stop any trade negotiations with Canada  because I have such thin skin that an ad on television…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…this up because it is a  gimmick. It is a gimmick that they are playing right now that somehow  the $7 trillion in tax cuts that they want to give to billionaires is  not going to add to our deficit or debt.\n\nRemember, these are the Republicans, the party of fiscal  responsibility, and it is not going to add to our deficit or our debt.\n\nThis is the perfect…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689544/h-con-res-14"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…energy security and keep energy costs down for families as  part of an all-of-the-above energy strategy.\n\nMr. Speaker, this bill is not about repealing anything that is going  to add any protections or viability to anything that is happening on  offshore exploration. The rule was not even about wearing a suspender  with a belt.\n\nThis rule was put in…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688630/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…trillion to $20 trillion of deficit spending, if we are lucky for it to  be that low, over the next 10 years.\n\nIf the Senate is going to send the bill back to us that is going to  add a trillion dollars more and not reform Medicaid properly and not  terminate the green new scam that the President campaigned on  terminating, then there is no way I can…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…people already can't buy a house because interest rates are so  high. Young people are living in apartments. More and more, people feel  stuck in their life, and we are going to add to the price of lumber and  steel to make homes even harder to purchase? It is a terrible idea.\n\nWashing machines were already almost $100 more expensive as a result  of…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…what you get: Functionally when we all got elected this last  November, the United States sovereign debt was around $28 trillion.  When we finish this 10-year cycle, we are going to add another $28  trillion if we do what the Senate sent us. What took us 240 years to  build up, we are going to double in the next 9 budget years, next 10  calendar years.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…and it has. We have lied repeatedly when we did sequestration.\n\nPaygo, how many times--paygo, I actually think was a Democratic  proposal from years ago that, if we are going to add new spending  beyond the 5-year window, there needs to be an offset. Members saw a  number of bills that expired just before the fifth year so that they  don't set off the…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…spending  that they created while they cite and talk about the One Big Beautiful  Bill Act. If you look at our scorekeeper here in the House, Mr.  Speaker, they said it is going to add $4 trillion to the deficit by  giving people their money back, along with cutting waste, fraud, and  abuse that we did in this bill.\n\nThey are citing the same organization…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693719/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}]