[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…constituents to roll up to their  Dunkin Donuts, if you are in Rhode Island, and order a small coffee:  That will be $15, please.\n\nThat is where we are headed. And it is going to hurt our  constituents, particularly the most vulnerable, and working families  that are struggling to get by.\n\nGrocery prices continue to climb with essentials like coffee…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696448/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…morally bankrupt, it is also fiscally reckless.\n\nIt is irresponsible, and I just don't understand how this is the plan  that my colleagues came up with. Their constituents are going to hurt  every bit as much as mine and, statistically, with more rural areas and  already more vulnerable rural hospitals, chances are their constituents  are going to hurt even…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…getting  their healthcare this way. And then we think about the fact that this  issue is disproportionally affecting red States, not just blue States.\n\nAll Americans are going to be hurt. This is why your ringing the  alarm is so important. And I would ask a very simple question: Is there  a connection between the healthcare crisis that we are in and an…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…constituents.\n\nMr. Speaker, if you disagree with me, then have your own plan. Here  is what I do know: The Republican plan is just going to explode  deficits, and it is going to hurt the American economy and make us all  poorer.\n\nI hope, Mr. Speaker, we can come together in this body to be honest  with the American people, to actually have a calculator…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692232/addressing-our-exploding-deficit"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…of legislation  that was passed--not the CR, but the original legislation, that one  big, ugly steal of a bill--this piece of legislation as it continues to  develop is going to hurt people on Medicaid. If you live long enough,  Mr. Speaker, you are going to need Medicaid because if you live long  enough, then you are going to need some sort of long-term…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695807/censured-but-not-silenced"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…hours get cut, if you become disabled or have trouble paying  bills, you can turn to SNAP to help make ends meet.\n\nRepublicans don't want to talk about how their cuts are going to hurt  people. They haven't held one hearing or briefing on the program, so  Democrats went around them. We are holding a hearing today at 3 p.m. to  talk about their plan to…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689041/impact-of-proposed-snap-cuts"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…said. `Could we bring some manufacturing back there?  Probably, but not to the extent that people believe.'\n\n`` `I just think it is going to cost more money, and then it is going  to hurt us with retaliatory tariffs,' said Higgins, a self-described  `Reagan Republican' who could not bring himself to vote for Trump.\n\n``Trump argues that levying tariffs on…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…matter what  Republicans call it. The priority of tax cuts for the very rich, people  who don't need the help, will cut healthcare for all of our  constituents. That is going to hurt every one of us. It doesn't matter  if Members are in an urban area, a rural area, a suburban area, a red  State, a blue State, or whatever color State my colleagues think…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…a budget in all my years  here. This budget would force the biggest cut to Medicaid in American  history.\n\nThe idea and the audacity of somehow pretending like it isn't going  to hurt people is just insane. It is simply not possible mathematically  to cut Medicaid by almost a trillion dollars and not hurt people.\n\nBy the way, for the record, that is…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…can serve more people who deserve it rather than cutting it and  lying about it and running from the truth.\n\nThe truth is that this reconciliation bill, this package, is going to  hurt people. It is going to impoverish people. It is going to destroy  businesses because the funny thing about economies is that they are  circular. Nothing happens in a silo,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…farmers, our businesses of dangers that might come? Cut them? They  are not waste.\n\nTheir recklessness is hurting rescue efforts. It has hurt the  existing ones, and it is going to hurt more in the future, unless they  reverse themselves.\n\nWe all support making Agencies like FEMA more efficient. Americans  support cutting waste. Americans support improving…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693517/central-texas-floods"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…Frank Bisignano, will  rubberstamp Trump and Musk's attack on Social Security. He will let  them keep slashing services. He will let them keep threatening  benefits. That is going to hurt people everywhere, from seniors who  count on their monthly checks right now to the parents of kids with  disabilities supported by Social Security, to every American who…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690633/nomination-of-frank-bisignano"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…burden on small businesses. He hasn't cited  anything that says that.\n\nHe says that we should have change. That is what we voted for in  November but not change that is going to hurt people or that is  actually going to cost them more money.\n\nThe bottom line is and the way this works is that the Department of  Energy, under the existing law, is required…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689127/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…things even worse, Donald Trump's tariffs are coming in at  the worst possible time, and in a few short months, they are going to  raise the cost of groceries. They are going to hurt small businesses  and do untold damage to our economy.\n\nAnd, now, this package suffocates public broadcast. Well, did they  even know when they said they wanted to cut…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693459/rescissions"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…import about $3.2 billion. Virginia's farmers  sell about $430 million of goods to Canada. A lot of Virginia peanuts  go to Canada. They are not going to be going. That is going to hurt our  economy. As a matter of fact, in Virginia, 280,000 jobs in Virginia  depend on trade and investment with Canada.\n\nI know, as Governor, I went--and I know, Senator…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689480/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…anyone. I found $3.3 trillion of savings and not a single  cosponsor in Congress.\n\nI am going to try to do this next little section here. I don't want  to be a jerk. I am going to hurt some people's feelings. The math is  important. Why the math is important is because there are solutions.  The reason I am doing this is, I think it was Monday or Tuesday,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…despite our  efforts to curb spending, it had doubled to $18 trillion of debt, and  now today in 2025, we are staring down the barrel of $36 trillion of  debt.\n\nThis is only going to hurt our children, grandchildren, and, frankly,  it is going to hurt us today.\n\nRepublicans' big, beautiful bill was passed out of our Budget  Committee just under 3 months…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690786/big-beautiful-bill"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…are all lining up. People  say we are going to have to bail them out.\n\nAre we going to have to bail out the car companies? Are we going to  bail out everybody that is going to be hurt by these tariffs?\n\nIt is not a good idea.\n\nThe administration is currently considering a bailout for farmers.  The idea that the American taxpayer will have to bail out…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}]