[{"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…wages, and to make sure people who  power our economy--our working families--can keep more of what they  earn. And through this bipartisan bill, it shows that I am not going to  allow Washington gridlock and partisanship to block a bill without a  fight. That is why we are going to pass it today, taking matters into  my own hands, with the support of…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691423/no-tax-on-tips-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…lieutenants who  spent his career at Tesla, and then he decided he was going to wipe out  hundreds of millions of dollars going to our people.\n\nMr. Speaker, are our colleagues going to allow DOGE to get away with  this critical destruction of law enforcement in rural communities,  urban communities, and suburban communities across the land?\n\nApparently so.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…President can't  be allowed to do this. That is why I say: ``Censured but not  silenced.'' I have not been silenced. I will not be silenced. I am not  going to be one who is going to allow this to take place and not speak  up and speak out and say to the world that this has to change.\n\nWe are normalizing not just hate, but we are normalizing these  signals…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Trump is going to again extend the deadline for  getting TikTok out of the control of ByteDance and the Chinese  Government--concern because that means that, again, we are going to  allow this national security issue to fester and to continue on, maybe  for several more months.\n\nWhat we know now, though, in the middle of a global conflict, during  which…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692683/tiktok"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…technologies--$1 trillion in 1  year. Japan has just announced they are investing $1 trillion in clean  energy, low-carbon technologies.\n\nSo what we are debating here is going to absolutely allow for these  other countries to catch up to us, and we will ultimately fall further  and further behind, especially in the efficiency of the vehicles which  we drive…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…regular basis and  says we need to export more LNG to China. My Republican colleagues say  they worry about Beijing and what Beijing is doing to challenge us.  Yet, they are going to allow with this bill unlimited exports to  Communist China.\n\nBy sending more American LNG abroad, this bill would reduce our  energy resources at home, raising our constituents'…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…time, our time, on the issues  that confront the Nation and, indeed, the world.\n\nI am honored that the American people have allowed me to have this  position. I am not going to allow posterity to look back upon my tenure  in Congress and say that when we had the opportunity--or I had the  opportunity--to take a stand for justice even when it might cost…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…you  are using. They are going to mention how this very incident occurred  and how people just walked away from it unscathed. That is what they  will do. People are not going to allow this to just be a one-off. If  something happens and they should be charged and they believe this  scenario can aid and comfort them with their defense, they will use it.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…asked for unanimous consent to schedule floor votes--I want  floor votes--on each of these resolutions. I think the American people  deserve to know where we stand, who is going to allow him to go forward  with these deals, who is going to sacrifice the integrity and  independence of this branch of government, and where every Senator  stands on Donald Trump's…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…inside the center. Our requests have been ignored.\n\nThat should alarm every Member of this body because this is not just  about a building. It is about whether Congress is going to allow a  President to seize control of a congressionally created institution,  run it into the ground, and then unilaterally shut it down without  oversight.\n\nSadly, this is…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699704/changes-at-the-kennedy-center"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…also prevents any backsliding by major sources of the seven  most dangerous hazardous air pollutants, including mercury and PCBs. By  repealing this rule, Republicans are going to allow large facilities to  increase their toxic emissions up to just below the legal limit,  endangering the health of American communities.\n\nThe cruelty of the Republican majority…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691591/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…chant. I can still hear in my mind, ringing off  the walls of the Capitol: ``Hang Mike Pence.'' ``Hang Mike Pence.''  ``Where's Nancy?'' ``Where's Nancy?''\n\nWe are not going to allow this to be buried into some kind of  Orwellian memory hall. We have got a law requiring that that plaque go  up, and we are going to see that that plaque goes up and that…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Constitution. I will be bringing at least one additional  occurrence where there will be Articles of Impeachment presented to  this House, maybe more than one more, but I am not going to allow this  Congress to escape having a record of what this President is doing.  Yes, I am going to bring my Articles of Impeachment.\n\nI know that the President, once he hears…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Economic Powers Act. This law was  so uncontroversial in 1977 that it was passed on a voice vote.\n\nNow, can you imagine? Jimmy Carter is President. There is a bill that  is going to allow Jimmy Carter to become a dictator, to impose tariffs  on any country in the world, to jack up the price anywhere they want on  any product, at any time; anything that ticks…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…amendments in, Mr. Speaker, and they  are dilatory at best.\n\nPart of the process in the Committee on Rules that we have adopted  over the generations is to say: No, we are not going to allow that. We  are not going to bring that to the floor, and I think that is  appropriate.\n\nIn fact, as the Speaker knows or can learn of, I have long advocated  for much stricter…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700197/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…many of us get  behind these microphones and actually talk about things that are truly  terrifying?\n\nAre we really going to avoid dealing with our actual jobs? Are we  going to allow the doubling of senior poverty in America in 7 years at  the same time we are bankrupting much of the medical system?\n\nIn 7 years, grandma gets a 24 percent cut in her…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…foundation of our golden age  for America. It is linked directly to the prices that we pay, to the  technology we use, and to the world we live in. Republicans are not  going to allow the sticky thorns of redtape to entangle American  energy. Republicans are reversing these punishing political  regulations. That is what we are doing today. We are taking…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688189/energy"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…already exists in  the private sector. It is time we adopt it.\n\nOn healthcare, I just want to give this as an example. Utah, a couple  of days ago, announced that they are going to allow AI as a pilot  program in Utah to prescribe. It is for the renewal of your  prescriptions. As I was talking about before, my calcium inhibitor, my  hypertension medicine,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…people who have served our country and who do a great job. So  what we are doing is we are saying: Because some people don't like our  Secretary of Defense, we are not going to allow the President to put a  team together of very competent people.\n\nSo what we are doing is, now we just have acting people whom none of  us get to vote on and none of us…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691405/motion-to-discharge-s-res-195"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…us to finance pay-as-you-go systems, which is  Social Security and Medicare, at a time when we have a shortage of  young people. There is a way to make it work.\n\nAre you going to allow people like me, people who are here willing to  think to be able to refine the process, to modernize?\n\nLook, we will try to touch on this if I have time. Here is the MedPAC…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…back in my State of Oklahoma think this has already been done. But to  not be able to move on this, to literally have my Democratic colleagues  block it and say we are not going to allow the Chairman of the Joint  Chiefs of Staff for our military to be able to be there, it is just  another one of those moments of Washington, DC, gridlock and  frustration,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690112/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…am enraged right now because I am hearing down the hallway the  Senate, they are talking about doing their reconciliation budget and  setting a floor, saying: We are not going to allow the Senate to pass  budget cuts of less than $3 billion. Huh?\n\nI am upset that ours is so anemic at like $1\\1/2\\ trillion, but if  they do $3 billion, it is functionally…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…of reasons when it comes  to innovation, space exploration and national security. That is why the  Air Force was involved.\n\nThe Coastal Commission said, no, we are not going to allow that. What  was the reason they cited? It had nothing to do with preserving the  coast, which is their mission. It had nothing to do with maintaining  the beauty of the…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}]