[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "So that is a good way to begin: with President Reagan's remarks.", "title": "Terminating the National Emergency Declared to Impose Duties on Articles Imported From Canada", "date": "2025-10-29"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "Speaker, I am pleased to rise today to welcome to  these Chambers and to this well a good friend and a personal, I will  say, savior to a multitude of South Carolinians.", "title": "Welcoming Reverend Dr. Charles B. Jackson, Sr.", "date": "2025-05-08"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "This resolution targets these standards, not realizing that these  standards will save consumers $3.1 billion and are good for the  environment because they cut 32 million metric tons of carbon dioxide  emissions over 30 years.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Consumer Gas-Fired Instantaneous Water Heaters''", "date": "2025-02-27"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "A good NDAA, like a good budget, is one that is probably perfect for  no one.", "title": "Providing for Consideration of H.R. Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year and Providing for Consideration of H.R. Stop Illegal Entry Act of 2025", "date": null}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "Tariffs are driving up the  costs of goods.", "title": "American Entrepreneurs First Act of 2025", "date": "2025-06-06"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "Now, pro bono means ``for the public  good,'' but apparently Trump and the law firms that he has punked out  think it just means free legal work for Trump.", "title": "Attacks and Threats on Democracy and Rule of Law", "date": "2025-04-29"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "I am  grateful for Endeavors' commitment to care for veterans, active-duty  service members, first responders, caregivers, and their families and  look forward to continuing to collaborate for the greater good of so  many.", "title": "Recognizing the Grand Opening of the Endeavors Health Wellness Center in El Paso", "date": "2025-11-04"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "Early detection isn't just  good medical practice; it is the difference between life and death.", "title": "Recognizing A'shellarien Addison", "date": "2026-01-13"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "The legislation is very good news for the  residents of the District of Columbia.", "title": "Full-Year Continuing Appropriations and Extensions Act, 2025", "date": "2025-03-14"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Those are supposed to be good things.", "title": "Providing for Consideration of S. Veterans Accessibility Advisory Committee Act of Providing for Consideration of H.R. Law- Enforcement Innovate to De-Escalate Act; Providing for Consideration of H.R. Undersea Cable Protection Act of and Providing for Consideration of H.R. Securing America's Critical Minerals Supply Act", "date": "2026-02-11"}, {"senator": "Lauren Underwood", "party": "Democrat", "sentence": "We will give the people money  to help them purchase their health insurance, but we need more  competition in the system so that people could actually buy a good plan  that works for them instead of this junk that I have.", "title": "Providing for Consideration of H.R. Promoting Efficient Review for Modern Infrastructure Today Act; Providing for Consideration of H.R. Increasing Investor Opportunities Act; Providing for Consideration of H.R. Electric Supply Chain Act; Providing for Consideration of H.R. State Planning for Reliability and Affordability Act; Providing for Consideration of H.R. Improving Interagency Coordination for Pipeline Reviews Act; Providing for Consideration of S. Disinterment of Remains of Fernando V. Cota From Fort Sam Houston National Cemetery; and for Other Purposes", "date": "2025-12-10"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "When the richest President in history decides on his own, unlawfully,  to haphazardly apply an across-the-board tax on goods--because that is  what these tariffs are--the goods-moving industry is going to take a  hit.", "title": "Terminating the National Emergency Declared to Impose Global Tariffs", "date": "2025-04-30"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "That is a good  thing.", "title": "Stock Trading Ban for Members of Congress", "date": "2025-05-14"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Stansbury), a good friend and a leader on the Oversight  Committee who I know is committed to strong ethics reform.", "title": "Stock Trading Ban for Members of Congress", "date": "2025-05-14"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "And I thank  Senator Boozman for his collaboration and for his bipartisan work in  good faith, and I extend that gratitude to Senators Collins and Murray.", "title": "-9999", "date": "2025-07-23"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "I would note that last summer, the good people of Aurora, Colorado,  were dealing with Tren de Aragua, who were engaging in violent  activities in apartment complexes and demonstrating the violence that  has led to the death of Americans, and the trafficking of dangerous  narcotics and fentanyl.", "title": "Providing for Consideration of H.R. Improving Law Enforcement Officer Safety and Wellness Through Data Act; Providing for Consideration of H.R. Leosa Reform Act; and Providing for Consideration of H.R. Federal Law Enforcement Officer Service Weapon Purchase Act of 2025", "date": "2025-05-14"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "It turns out they are all really good  policy.", "title": "Math Always Wins", "date": "2025-06-10"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "Issa for this good piece of legislation that  we passed out of the committee, I think, 4 weeks ago.", "title": "No Rogue Rulings Act of 2025", "date": "2025-04-08"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "Speaker, I rise today in strong support of the CRA  resolution introduced by my good friend and colleague Representative  Begich.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Coastal Plain Oil and Gas Leasing Program Record of Decision''", "date": "2025-11-18"}, {"senator": "John Thune", "party": "Republican", "sentence": "While some  regulations are necessary, too often regulations do more harm than  good.", "title": "Biden Administration", "date": "2025-12-02"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "We should ask ourselves a fundamental question: Is trade good?", "title": "Terminating the National Emergency Declared to Impose Global Tariffs", "date": "2025-04-30"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "A woman of few words, Helen loves sipping a good, hot cup of tea  while reminiscing on her past.", "title": "Recognizing Helen Birkhead's 100th Birthday", "date": "2025-08-15"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "This is  the future of this place if something good doesn't happen today in this  place.", "title": "-9999", "date": "2025-08-02"}, {"senator": "John Thune", "party": "Republican", "sentence": "We have done a lot of good work on appropriations this past year.", "title": "Appropriations", "date": "2026-01-08"}, {"senator": "James Risch", "party": "Republican", "sentence": "This morning, I had the good fortune to attend, with Secretary Rubio,  an event at the State Department where a peace agreement was signed  between Rwanda and the Congo.", "title": "Motion to Discharge--S.J. Res. 59", "date": "2025-06-27"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "I have often said that a really good staff makes a decent Member of  Congress--and throughout my time in office, I've been fortunate to have  outstanding individuals like Amy by my side.", "title": "Recognizing Amy Sorensen As She Prepares for Retirement", "date": "2025-08-08"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "That is something that we share in common, both  sides of the aisle, toward being good stewards of our taxpayer dollars.", "title": "Courthouse Affordability and Space Efficiency Act of 2025", "date": null}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "We all know that blockchain technology and digital assets are here to  stay, and it is good that they are here in America.", "title": "Financial Technology Protection Act of 2025", "date": "2025-07-21"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "I am all for rewarding this good behavior, but there are very good  reasons to believe that Mr.", "title": "Bosnia", "date": "2025-11-05"}]