[{"senator": "Al Green", "party": "Democrat", "sentence": "…the polls in 2020, the  Presidential election year when he was defeated.\n\nI said acting now could become the genesis of a public movement. That  is the movement that my good friends with Free Speech for People have  initiated, the movement that people across the country are engaged in  and talking about.\n\nI don't claim that what we are doing tonight…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…bravery, and  compassion. Tragically, he is the fourth Arizona officer to fall in the  line of duty in just the past 12 months.\n\nMy thoughts are with his wife, family, his many good friends, and  colleagues. I hope his memory brings comfort and strength in the  difficult days ahead.\n\nOfficer Facio's ultimate sacrifice, his courage, and his selflessness  will…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692251/mourning-loss-of-officer-gabriel-facio"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…extraordinary work of an  organization from Los Angeles that has lessons for every community in  America.\n\nNearly two decades ago, then-Mayor Antonio Villaraigosa partnered  with my good friends, philanthropists Melanie and Richard Lundquist, to  launch the Partnership for Los Angeles Schools. Dr. Lundquist is with  us today.\n\nTheir nonprofit is committed to strengthening…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695654/partnership-for-la-schools"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Talese, who wrote to us, lives in Alabama's Fifth  Congressional District, a district currently represented by Dale  Strong.\n\nI am so thankful for the representation of my good friends, Terri  Sewell and Shomari Figures, in the great State of Alabama.\n\nTalese writes to us: ``I am a single mom, doing everything with my  one income. My ex-husband refuses…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…fear our words. They plan for a future in which the United  States is no longer the indispensable nation, a core global ally.\n\nThis cannot be the path we forge. It is good to have friends, and in  order to have friends, we must be one.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699067/nato"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…California for  this opportunity to speak because this is one of the most ignorant  things I have seen this House produce in a very long time.\n\nIt stuns me, frankly, that my good friends, Congressmen Hill, Steil,  and Barr, are associating themselves with this bill.\n\nLet's be super clear about this. Nobody knows whether a CBDC is a  good idea. A couple of…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693726/anti-cbdc-surveillance-state-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…friends from Japan and Korea are asking for it.\n\nMr. GUTHRIE. Mr. Chair, I yield to the gentleman from Ohio (Mr.  Balderson), another good friend. I am yielding to all of my good  friends, but I yield to a very valued member of the Committee on Energy  and Commerce.\n\nMr. GUTHRIE. Mr. Speaker, I will say that we want the world price  produced by what we have…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697089/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…always does.\n\nMr. Speaker, thank you for tolerating a bit of my rant, but it is my  way of just saying how disappointed I am with even my friends. I have a  couple of really good friends who are over in the Senate, and they were  just desperate to avoid doing what was difficult, so they threw it in  our lap.\n\nMr. Speaker, we as House Members get to make…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…negotiating leverage.\n\nMr. STAUBER. Mr. Speaker, I urge my colleagues to join me in  supporting this bipartisan piece of legislation, H.R. 4090.\n\nMr. STAUBER. Mr. Speaker, my good friends on the other side of the  aisle will promote, again, anywhere but America and any worker but the  American worker when it comes to mining. Anywhere but America, and any…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…information, take the good ideas  and try to implement them into where we can provide lower prices.\n\nIf you think this doesn't work, come buy gas in Kentucky. Then go to  my good friends who are sitting here from California and buy gas in  their State, then tell us what does efficient energy policy do for  affordability. I will challenge them to do that.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…premiums is what Republicans passed out of the House. There was  not a single Democrat vote to join us.\n\nHere is what I can't understand for the life of me, and I have some  good friends over there, and I am not mad. I am miffed that Democrats  would all talk about affordability in healthcare and bring to this  Chamber the idea, the notion that Congress…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698812/breaking-the-gridlock-act"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…cognitively, let's  just say, deficient, where were the cuts? None. They didn't say  anything. They didn't stand up for the American people. They were  silent.\n\nWhere were our good friends with the 15 to 20 million illegals coming  into this country, with the drugs flowing in, with the children that  were trafficked? Where were they? They were quiet. They…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692389/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…community events. He was known for his generosity, kindness, and  willingness to help others, always offering a listening ear and  thoughtful advice.\n\nJoe found joy in family, good friends, music, cycling, and long walks  on the beach with his dogs. His legacy of service, faith, and love for  his community will continue to inspire all those who knew him.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…sense of  duty to serve on these committees.\n\nMr. NORMAN. Mr. Speaker, may I inquire about how much time is  remaining.\n\nMr. NORMAN. Mr. Speaker, let me just say for my good friends on the  left, you know, we are hearing words. That is all this is, words. You  are taking the side of a young lady who should have known better. She  served for 11 years.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696890/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…rich, poor,  divinity politics, taking food from hungry children. They haven't used  granny is going over the cliff yet, but I assume that is coming.\n\nMy question to my good friends on the other side is: Where were they  the last 4 years? Where were they? We have got a steady diet of high  inflation. We have got a steady diet of 15 million illegals…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688063/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…Defense Authorization Act. That law extends  Ukraine's Security Assistance Initiative and our commitment to sharing  intelligence with Ukraine. Good for the President, and good for our  friends in the House and Senate.\n\nOur allies across the Atlantic are taking the lead now, as my  colleague from Kentucky just pointed out, in financing security  assistance…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699095/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…which will make sure  that all Americans, no matter their disability status, will be able to  receive the access to care that they need and deserve.\n\nMr. Speaker, I thank my good friends, Representative Cammack and  Representative Dingell, for their leadership on this important issue,  and I urge my colleagues to support this legislation.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692718/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…who have witnessed that  and have not said anything.\n\nFor this reason, Mr. Speaker, I am asking some of my colleagues on  that side of the aisle, many of them who are very good friends of mine,  to understand that denouncing communism and socialism is the right  thing to do for the Democratic Party.\n\nIf some of the highest, most important Members of the…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697160/denouncing-the-horrors-of-socialism"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…friends of mine and I have sought his counsel.  Just for the record, Mr. Speaker, he has never voted for me. He is not  a member of my political party, but we are still very good friends. I  think that is something that is missing in this country.\n\nWhen I was mayor of Knox County, I would always invite a bunch of  young people from the office to go down…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697620/reverend-harold-middlebrook-post-office-building"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…and proud  people. The Lumbee have served this country in every branch of the  military. They contribute to our society. The Lumbee have a strong  faith in God. They are good friends who value education, hard work, and  community.\n\nI am proud to stand with the Lumbee and urge this body to vote today  to end a decades-long wrong.\n\nMr. ROUZER. Mr. Chair,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…Medicaid funding  because these dollars should go toward real healthcare helping women,  children, and families, not to organizations that end innocent lives.\n\nDespite what my good friends from the left claim, killing a child is  not a birth control measure.\n\nWhen Planned Parenthood sued to undo the decision, it wasn't just  about funding. It was about undermining…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692891/dobbs-v-jackson-anniversary"}]