[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…those folks now who applied those checks in the past.\n\nAnd the leader of a democracy says: I am accountable to the people.  The people need healthcare, housing, education, good-paying jobs,  investment in infrastructure, quality of opportunity, and let's take on  some of those environmental problems. That is what a leader of a  democracy does.\n\nSo here…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…being betrayed. Reckless tariffs and  political maneuvers have created chaos for manufacturers, for farmers,  for scientists, and union workers alike.\n\nWe saw the promise of good-paying jobs in offshore wind manufacturing  at our ports. Yet, instead of stability, this administration issued  stop-work orders and launched sham investigations that have chilled…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695601/devastating-harm-caused-by-trump-administration"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…generation, making it less likely that  we can effectively provide the programs, the foundation of healthcare  and housing and education and the investment in R&D that produces good- paying jobs for the next generation to thrive.\n\nThat is wrong. It is wrong to proceed to borrow and compromise the  next generation in order to give tax breaks to billionaires.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Their cut of nearly half the budget for Energy Efficiency and  Renewable Energy is a direct attack on the programs that lower energy  bills for working families, create good-paying jobs in our communities,  and keep America competitive.\n\nThis bill revokes funding that supports hydrogen energy, batten,  recycling, and energy improvements in public schools,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694862/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…sabotage the  development of affordable renewable energy. Our constituents deserve a  lot better than this. We deserve clean, affordable, and reliable  energy. We deserve good-paying jobs and affordable healthcare. We  shouldn't sacrifice America's health, environment, and livelihoods in  order to do it.\n\nThis legislation and my friends across the aisle…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…transformative,  reducing emissions for this plant by 99 percent.\n\nThat isn't just about energy policies. It is about protecting  community health, and it is about growing good-paying union jobs.\n\nYet this administration chose to cancel this project, along with  countless others, simply because it did not fit their political agenda.\n\nThat raises a fundamental…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694953/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…while employing over 51,000  American workers. This commonsense amendment is good for both the  economy, the environment, and the United States Government while  protecting good-paying manufacturing jobs right here in the United  States.\n\nOhio's 13th Congressional District has long been a trailblazer in  polymer science and polymer engineering. Akron's…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697853/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…life. We  haven't reached that place in the United States of America. Imagine a  country where everyone can work hard, play by the rules, and live the  good life, with a good-paying job, good housing, good healthcare, good  education for your children, and a good retirement--which means keep  your hands off Social Security and Medicare now and forever.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…families could see electricity bills go up by $500 a  year. Republicans are killing jobs by gutting domestic energy  investments that we made, that have created so many new good-paying  jobs. Republicans are rewarding China by weakening our economic  competitiveness and ceding American energy leadership to our  adversaries.\n\nThe hypocrisy is simple. On…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688168/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…growth for working  Americans. So this strategy, this energy emergency strategy, this is an  energy strategy in which families lose; billionaires win. And there are  far fewer good-paying jobs for Americans.\n\nAnd, by the way, prioritizing fossil fuels is helpful to China.\n\nIf we have a national energy emergency, we shouldn't be fueling our  competitors by…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688159/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…billion in total project financing and created over 3.3 million  jobs. In California alone, that translates to $95 billion in total  capital and the creation of over 715,000 good-paying jobs.\n\nFor entrepreneurs in California's 45th District and across the  Nation, the 504 loan program's unique model provides them with access  to long-term, fixed-rate financing…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699186/504-program-risk-oversight-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…means  startups and other innovators will have access to the most advanced  machinery to experiment and discover new innovations in semiconducting.  It will even mean more good paying jobs--J-O-B-S--at Albany NanoTech  and the local economy.\n\nWe all worried that China would gain the lead on this chip  production. Well, now we have the answer, and that…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693456/national-semiconductor-technology-center"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…``Big Ugly Betrayal''--a purely party- line vote, a partisan giveaway to billionaires and special interests-- paid for with the biggest cuts to healthcare, food funding, and good- paying energy jobs we have seen in our lifetimes.\n\nLeader Thune says he wants to see bipartisanship. That is all well  and good. But Leader Thune can't have it both ways. If Leader…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693852/appropriations"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "Mr. KHANNA. Mr. Speaker, I rise today to oppose war in Iran or any  wars of choice in the Middle East.\n\nWe need to be investing in good-paying jobs at home, healthcare at  home, and childcare at home, not billions of dollars in missiles  targeted at the Middle East that we can't afford. That is why  Representative…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692976/americans-of-all-parties-do-not-want-more-war"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…by the new administration that undermine  new investment in America's future energy and manufacturing systems.\n\nRather than enhancing new energy generation and bolstering good- paying jobs in the United States of America across all energy sectors,  including advanced energy manufacturing, the U.S. Department of Energy  has ceded ground to global competitors…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691905/department-of-energy-project-cancelations"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…more than 15,000 jobs. Nearly one-half of those  workers live in Iowa. It also contributes over $1.2 billion annually to  the economy of the Quad Cities region. These are good-paying jobs that  support families, grow our communities, and, most importantly, provide  the backbone of our military supply chain.\n\nAs a 24-year Army veteran, I know how vital…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693676/department-of-defense-appropriations-act-2026"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…We have seen the same story play out in my own State of New York. The  Northern Access pipeline was a major natural gas infrastructure project  that promised thousands of good-paying jobs, more affordable energy for  families across the northeastern United States, and new tax revenue for  rural communities like mine in the southern tier.\n\nHowever, instead…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…know this--in Texas, we know  what happens when refineries thrive. We fuel the Nation. We even supply  our allies. We make money doing this, and we support thousands of good- paying jobs.\n\nThe REFINER Act recognizes that refining isn't an afterthought. It is  a foundational piece of our national security, as well as our economic  strength.\n\nI urge my…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697030/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…next-generation economy: cutting- edge technologies, like AI and advanced manufacturing, hold tremendous  promise to lift up communities across the country with stable, good- paying jobs, while lowering costs for hardworking families.\n\nMr. Speaker, the Securing America's Critical Minerals Supply Act  takes an important step towards solidifying the U.S.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699990/securing-americas-critical-minerals-supply-act"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…result of foreign direct investment. Of these workers, 31  percent work in manufacturing roles. These jobs, like other good, blue- collar jobs in my district, provide stable, good-paying careers to  constituents to help provide for their families. Oftentimes, these jobs  are obtainable to folks with a high school degree after a quick and  affordable career…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692695/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…children work in that coal mine. That gentleman told me his  family's story with a lump in his throat. Like generations before him,  he and now his children had access to good-paying union jobs in the  coal mines across the Powder River Basin, but thanks to the Biden  administration's continued war on coal, his job and his livelihood was  on the line,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696882/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…play out in upstate New York. Micron is  making a historic investment in bringing advanced semiconductor  manufacturing back to the United States, creating thousands of good- paying jobs and strengthening domestic supply chains critical to our  national security.\n\nYet, even after clearing one of the most stringent State  environmental review processes…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "John Thune", "party": "Republican", "sentence": "…manufacturing. The Tax  Code is a key part of that. Investment incentives like bonus  depreciation helped manufacturers purchase the latest technology and  grow their workforce with good-paying jobs for the American people.\n\nMore manufacturing--more businesses and jobs here in America--grows  our tax base, and that means more revenue--revenue that we get the  right…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690626/national-small-business-week"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…currency.\n\nUnder these America last trade policies, Ohio has lost a third of its  manufacturing jobs. Between 2000 and 2010, Hamilton County in the  Eighth District lost 66,000 good-paying, high-skilled jobs. My district  heard the giant sucking sound of American industry fleeing overseas.\n\nThese jobs drove innovation and productivity, and they built our…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694016/cost-of-america-last-trade-policies"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…in Wilmer, Texas. On  November 1, 2024, production began at its state-of-the-art facility. In  just twelve short months, the company has already created more than  1,200 good-paying Texas jobs, including 200 held by proud residents of  Texas' 6th Congressional District.\n\nBy all accounts, the Wilmer facility is exceeding expectations,  surpassing production…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696803/recognizing-the-first-anniversary-of-t1-energys-operations-in-wilmer-texas"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…increases overall U.S. production, putting  downward pressures on prices for everyone.\n\nThe U.S. LNG industry contributed $44 billion to the economy and  supported 220,000 good-paying jobs while providing $11 billion in taxes  and royalty payments.\n\nIn response to Russia's unprovoked invasion of Ukraine in 2022,  American energy producers immediately…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697081/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…food,  and fiber for the Nation and conserves our natural resources.\n\nRMPs manage the resources that are the backbone of western rural  economies and support thousands of good-paying jobs. That is what makes  the Miles City Resource Management Plan amendment so egregious.\n\nThis RMP amendment virtually ended future coal leasing across  Montana's entire…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…should be fighting for,  not where Washington bureaucrats make it harder for American businesses  to succeed.\n\nLet's send a clear message: We stand for affordable energy, good- paying jobs, and an America that leads, not one that follows bad  policies straight into higher costs and economic decline.\n\nI thank Senators Kennedy and Hyde-Smith for their leadership…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688631/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…16 miles from the edge of my  district. In my area, because it is a rural area, lots of people drive  more than 16 or 17 or 18 miles, whatever the number is, to get to a  good-paying job like these facilities have that make tires for the  American market.\n\nThis rule wouldn't be the first time my constituents have seen an  environmental rule from the…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…winter construction season to minimize impact on Alaska's tundra.\n\nBecause of the opportunities provided by oil and gas operations, this  industry has provided thousands of good-paying jobs to Alaskans. It has  become the primary driver of my State's economy. Oil and gas revenues  fund education, essential infrastructure, and community services across…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}]