[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…scared by masked agents roaming our streets arresting  anyone in eyesight whom they deem to be a threat, not a court of law.  They are terrified that they could be the next Renee Good or one of the  many who have died in for-profit detention camps. They worry about  sending their kids to school or doing right by the law and attending  routine immigration…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699357/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the central quantitative restrictions under the START treaty for 1 year  after February 5, 2026,'' if the United States reciprocates. In  response, Trump said: ``Sounds like a good idea to me.''\n\nHere we are, 22 days from expiration. The White House has yet to  reply to the Kremlin's offer. The clock is ticking.\n\nI ask the administration to respond to…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699036/expiration-of-new-start"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…a chance to oppose it when the bill was on the floor but  didn't read it. I would suggest to my Republican colleagues that maybe  reading the bills that we are passing is a good idea before they decide  to vote on them, particularly when they are rushing it through on a  partisan line vote.\n\nI come from a legal background. I started my career turning…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Grace Meng", "party": "Democrat", "sentence": "…cuts.\n\nWe secured strong funding levels for the Economic Development  Administration and the Manufacturing Extension Partnership program,  which both work to create and preserve good jobs in the United States.\n\nWe continued and funded three agencies that the Trump administration  wanted to eliminate entirely: the Minority Business Development Agency,  the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698751/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Champions of Character  Awards. Since 2001, these awards have been presented to athletes,  coaches, and parents in our region who exemplify the tenets of  teamwork, leadership, good sportsmanship, and community service during  athletic competitions.\n\nIt is my honor to include in Record the following names of the 2025  Stephen A. McLaughlin Fairfax County…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697100/recognizing-the-recipients-of-the-2025-stephen-a-mclaughlin-fairfax-county-champions-of-character-awards"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…full potential.\n\nBecause of programs established by IDEA, children like RJ can access  the same educational assistance and support that other students enjoy.  I think that is a good thing. I think that is what should make America  America, but this White House disagrees.\n\nThe Trump administration believes that the rights and opportunities  available to…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698947/protecting-education-for-children-with-disabilities"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "Mr. NADLER. Mr. Speaker, I rise in strong opposition to this  legislation because I cannot, in good conscience, vote to spend one  more cent on ICE. I will not fund an agency that acts like an American  gestapo.\n\nThe Trump administration has launched a brutal and reckless…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699350/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…health insurance for him and for her is $279 a month.\n\nSo right off the bat, she faced an increase over her base premium  that she has been paying for some time, but she had the good fortune,  at least now--up to now--to have a tax credit to help pay for those  premiums. Then she got the notice from her insurance company that the  cost of her insurance,…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Congressional Republicans and the crypto industry will state that these  conflicts of interest take away from the discussion on other parts of  the bill. They claim that this bill is good for consumers and  investors.\n\nWell, let me tell you, it is not. It is good for Trump's family and  wealthy crypto investors that can afford to see themselves through an  FTX-type…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…shoulder the cost of cleanup.\n\nWith limited government funds and personnel to clean up these mines,  many sites are left polluted for decades. To make matters worse, even  if a Good Samaritan group wants to volunteer to help clean up the  pollution themselves, current law requires them to take on full  liability for the site under the Clean Water Act.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691091/community-reclamation-partnerships-act-of-2025"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…withdraw from the area.\n\nAs ranking member of the Economic Opportunity Subcommittee of the  Veterans' Affairs Committee, I am focused, with my colleagues, on how  we can make good on our promises to our veterans and be worthy of their  sacrifice.\n\nIt is our responsibility as Americans to ensure that all of our  servicemembers, veterans, and their families…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688214/medal-of-honor-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…presented him with an award before a big  audience. He praised him as an extraordinary man and an extraordinary  leader.\n\nBy attending President Trump's inauguration with his good friend, he  continued to promote him in establishment political circles, and he  headlined a fundraiser together with Mr. Hale-Cusanelli in Florida last  year.\n\nBy pretending…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…thank Representative McClellan  for running point on this Special Order hour for the CBC. She is a  legislative champion both in the State house and in the Federal House.  It is good to be with her tonight, and I thank her for recognizing me.\n\nI also give a shout-out to our beloved leader of the CBC,  Representative Yvette Clarke, who is doing a fine job…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697217/medical-bills-are-too-high"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…Al, just as we miss Carmen. I am so grateful to my  colleague, Mr. Liccardo, for organizing this tribute here on the floor  today.\n\nAl and Carmen left a tremendous mark for good in our community. I  will miss Al tremendously.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691560/recognizing-life-and-contributions-of-alcario-al-castellano"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…available tools to help consumers evaluate the  cybersecurity risks of these networks.\n\nI thank Representatives Landsman and Cammack for their bipartisan  work on this bill. It is a good step toward ensuring we can protect our  mobile networks from evolving threats. I know we will continue to work  toward securing our country's data, devices, and networks, whether…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693422/understanding-cybersecurity-of-mobile-networks-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…about learning. In his free time, Walter studies science and Chaos  theory. I am grateful for Walter's extensive contributions to our  community and country, and I wish him good health for many years to  come.\n\nIt is an honor to bestow Walter with the Patriot Award for his  exceptional service to the people of North Texas.", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690722/recognizing-congressional-patriot-award-recipient-walter-hunter"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "Mr. HUIZENGA. Mr. Speaker, I thank the chairman for yielding me time.\n\nMr. Speaker, today is a good day for innovation. It is a good day for  free markets, entrepreneurs, and consumer choice. It is a good day for  American digital leadership.\n\nMr. Speaker, after years of debate…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693829/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…threats, and that is what we are doing today. The HALT Fentanyl  Act will permanently schedule fentanyl-related substances as a class I  drug. This is long overdue.\n\nI know my good friend, Mr. Griffith, and also Mr. Latta, have been  working on this for years. This must pass the United States Senate  after we get it out of the House today. We need to save…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692342/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…is serious. This  isn't a game. We right now are borrowing about $6.5 billion every  single day for this fiscal year. We are down to the last 3 weeks, so  you have a really good sense of what we borrowed.\n\nIn 9 budget years, it is well over $10 billion a day. Yet, a couple  hours ago, I offered an amendment that basically said there is all  these dollars--and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…something that is really interesting. The economy from a GDP  calculation standpoint, and this is just the economists looking at the  vitality in the economy, is remarkably good. We are running over a 5  percent GDP, which if you go back and look at the economic projections,  it is double what many of our smartest economists in the country  thought…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…irresponsible agencies. They have been taken over by  ideologues, Mr. Speaker, doing things that are simply not in the  interest of the people of the United States.\n\nUSAID has done some good things, but they have also done things that  were an enormous waste, totally inappropriate, and, in fact, they lost  the trust of the American people. Agencies like this need…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693710/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…production, maintaining a pro-family and pro-growth Tax Code, and much,  much more.\n\nI thank each Member involved in these critical discussions for their  work, and I thank my good friend from California (Mr. LaMalfa) for  being here today to kick us off with his message.\n\nMr. MOORE of Utah. Mr. Speaker, I thank my good friend from  California for his…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Wagner's work. This is  exactly the kind of commonsense, bipartisan legislation that our  constituents expect us to pass. To lower costs and encourage companies  to be public is a good thing for our Nation. It will grow the economy  faster. Companies can go public sooner in their growth period.\n\nMr. Speaker, for all the reasons I have explained, I urge my…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693957/small-entity-update-act"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…West Texas families--comforting them,       mourning alongside them, and giving them the encouragement       they needed to persist in the face of this crisis.\n\nThis is what good leadership looks like. Not command and       control, but compassion and service. Not someone who thinks       they have all the answers, but someone who seeks first to…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696063/texas-measles-outbreak"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…strong, and proud  people. The Lumbee have served this country in every branch of the  military. They contribute to our society. The Lumbee have a strong  faith in God. They are good friends who value education, hard work, and  community.\n\nI am proud to stand with the Lumbee and urge this body to vote today  to end a decades-long wrong.\n\nMr. ROUZER. Mr.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…regulations have  imposed restrictions on the types of milk students have access to in  school meals. While the Healthy, Hunger-Free Kids Act's intention to  reduce child obesity was good, its impacts to attack whole milk have  been misguided and devastating over the 15 years since its passage,  resulting in the loss of an entire generation of milk drinkers.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698178/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Protection Agency  relating to Review of Final Rule Reclassification of Major Sources as  Area Sources Under Section 112 of the Clean Air Act.\n\nThis commonsense resolution, led by my good friend, Senator Curtis of  Utah, and carried in the House by my good friend, Representative  Fedorchak, along with support from Representatives Balderson and Allen,  pushes…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691596/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and 9 of the Consumer Product Safety Act (15 U.S.C. 2056 and       2058).\n\nMr. Speaker, I rise today in support of H.R. 1767, the Awning Safety  Act of 2025, led by my good friend, Representative Balderson.\n\nThis legislation directs the Consumer Product Safety Commission to  establish a consumer product safety standard for retractable awnings to…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692747/awning-safety-act-of-2025"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…the immigrants from these Islamist  countries: If you hate this country, refuse to go by our laws, and  chant ``Death to America,'' it is time to go home.\n\nThere are a lot of good people that come from Middle Eastern  countries and go by our laws and assimilate with our culture, but if  you come here otherwise, it is time to go home.\n\nThe Trump administration…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…centers  here, or China is going to dominate. That is the only choice.\n\nEurope can't do it. We know what happens if you overregulate and  don't produce the energy. That is a good example right there from  Europe.\n\nWe know we need the power or we are going to lose the great battle of  our time of who is going to control AI and supercomputing, eventually…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}]