[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…the Fraser family ever since.\n\nDan & Whit's is known for their huge inventory. The store is  deceptively large inside, and endless aisles are lined with a vast  selection of goods, rumored to number into the hundreds of thousands.  They stock everything from general store necessities, like cold beer  and sandwiches; to Vermont necessities, like maple…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694332/recognizing-dan-whits-general-store"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…is a necessary step toward greater stability  and safety for both the United States and East Africa. Attacks on  maritime shipping endanger innocent lives, raise the cost of goods, and  destabilize local communities in Yemen and the Horn of Africa.\n\nFor American national and economic security, we must pass this  legislation and crack down on global piracy.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692721/sanction-sea-pirates-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…falsely promised these new tariffs would  lead to an economic resurgence for American workers.\n\nInstead, his broad across-the-board tariffs have driven prices up for  everyday goods and all supply chains. Tariffs create uncertainty in the  job market, leaving hardworking families worse off.\n\nWhen manufacturing jobs disappear as costs rise, Ohio families…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699062/manufacturing-jobs-lost-due-to-trump-tariffs"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…America's farmers are hurting. They need every bit of help Congress  can deliver. So do truckers and working families paying more for  groceries and at the pump just to haul goods, get to work, and move  around their communities. Prices are going up, not just in America's  heartland, but across our great country.\n\nRepublican leadership today had a chance…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…families  pay the price at home.\n\nInstead of protecting the economic well-being of Americans, we are  seeing the following: Tariff policies are increasing the costs of  essential goods. My farmers are struggling, as well as American  consumers. Healthcare costs are skyrocketing for millions. Critical  programs that help families stay afloat are under attack.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698830/putting-americans-first"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…come to the floor today because I am  concerned about President Trump's actions to, I believe, start a trade  war with our top two trading partners, Canada and Mexico.\n\nAll goods coming from Canada and Mexico, as of midnight last night--I  guess midnight today--face a 25-percent tax; that is, all except  Canadian energy, which is taxed at 10 percent.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…homeless, veterans, and  underserved communities. Over the years, they have provided socks,  shoes, foot care supplies, clothing, blankets, beds/bedding,  kitchenware, bathroom goods, and toys.\n\nIn addition to their core activities, the JDF recently began hosting  The Robert E. Jenkins Scholastic Chess Tournament, named after co- founder Robert Jenkins,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699890/recognizing-the-jenkins-donelson-foundation-for-10-years-of-service"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…from my home State of South Carolina  was doing quite well financially as a hedge fund manager doesn't think  the American people care either. To quote him: ``Access to cheap goods  is not the essence of the American Dream.''\n\nClearly, Mr. Trump and Mr. Bessent have never struggled to make ends  meet from paycheck to paycheck and appear to view those…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…morning, let's start with that here, starting with tariffs.  Last night, for the first time in decades, the President of the United  States imposed 25 percent tariffs on nearly all goods coming from  Canada and Mexico.\n\nWhat does this mean for the American people? What do Donald Trump's  tariffs mean for the American people? They are going to pay more.  Everyday…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…than we are free to throw garbage into our neighbor's yard.\n\nThis requires comprehensive new regulations. It also       requires that, to the extent possible, the price of goods       should be made to include the costs of producing and       disposing of them without damage to the environment.\n\nIsn't this incredible? Richard Nixon, in the 1970s, talking…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…resilience, industrial strength and strategic security, rather  than being hijacked by the hypocritical umbrella of national defense at  the expense of increased costs of consumer goods across the country. It  recognizes that modern maritime commerce is global, but that global  alignment must be rooted in trust, shared values and common defense. By  partnering…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694572/introduction-of-the-merchant-marine-allies-partnership-act"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…of this country, after promising lower  prices and a better economy, are actively jacking up prices and tanking  the economy.\n\nLast year in Ohio, we imported $86 billion in goods. Now, nearly  every country in the entire world is dealing with these tariffs because  of a trade war that no one but one man wanted. The price of all of this  will fall on…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689748/tariffs-lead-to-highest-sales-tax-on-americans-in-history"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…their babies and folks who need help buying food so that  maybe their children's bellies aren't empty when they are going to  school. Services by farmers who actually produce goods that are sold  into this agricultural program would be cut.\n\nThey are cutting funding to the Small Business Administration. Most  people in my district are interested in their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…Speaker, it is Groundhog Day again in Washington, D.C. You know,  this week is an opportunity to drive down electricity costs, create  jobs at home by bolstering our exports of goods made in America. It is  an opportunity to lower the cost of groceries and healthcare for  families around our great country. But this Republican majority never  misses an opportunity…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699897/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…wealth, affecting the  retirement savings of millions of Americans. Moreover, the Fed Chair  has said these policies will fuel higher inflation by sending the  prices of consumer goods up.\n\nIt doesn't seem like the President cares about prices anymore,  saying: ``I couldn't care less. I hope they raise their prices because,  if they do, people are going to…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689845/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "French Hill", "party": "Republican", "sentence": "…(8 U.S.C. 1189).\n\n(6) Illicit use.--The term ``illicit use'' includes fraud,       darknet marketplace transactions, money laundering, the       purchase and sale of illicit goods, sanctions evasion, theft       of funds, funding of illegal activities, transactions related       to child sexual abuse material, and any other financial       transaction…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693963/financial-technology-protection-act-of-2025"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…narcotics through tax  rebates.\n\nMany of these substances are illegal under the PRC's own laws and  have no known legal use worldwide. Like its export tax rebates for  legitimate goods, the CCP's subsidies of illegal drugs incentivize  international synthetic drug sales from the People's Republic of China,  and the CCP never disclosed this program.\n\nIn addition,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694828/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…following:\n\n``(I) The monitoring, locating, tracking, and deterrence of       the following:\n\n``(aa) Illegal drugs to the United States.\n\n``(bb) The illicit smuggling of persons and goods into the       United States.\n\n``(cc) Terrorist threats to the United States.\n\n``(dd) Other threats to the security or economy of the       United States.\n\n``(II) Emergency…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696951/combatting-international-drug-trafficking-and-human-smuggling-partnership-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…running the border over the last 4 years do  not care about the plight of an immigrant searching for a better life  and a unique work opportunity.\n\nThey sell them a bill of goods. They literally sell them that bill of  goods by making them pay thousands of dollars in the hope that once  they get them across the border, then everything will be great…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…inevitably have some costs that will have to be borne by fleet  operators who purchased the trucks and by consumers who will have to  pay more in freight costs for everyday goods. We have already seen  lower truck sales in California and, as expected and previously  predicted by one of our earlier speakers, increased purchase prices.\n\nBriefly, I will…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690434/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…cranes and the  software used to operate them.\n\nAs we all know, our country's ports serve an absolutely critical role  in our national supply chain, moving millions of tons of goods each  year, facilitating trade, which supports American businesses and  consumers across the country. Any disruption to these supply chains  results in increased costs for…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692198/maritime-supply-chain-security-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…(2) the provision of vital humanitarian assistance;\n\n(3) financial transactions relating to humanitarian       assistance or for humanitarian purposes; or\n\n(4) transporting goods or services that are necessary to       carry out operations relating to humanitarian assistance or       humanitarian purposes.\n\n(g) Waiver Authority.--\n\n(1) Waiver.--The…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…for the people who don't have  lobbyists in this town: the farmers; the welders; the waitresses; the  nurses who are pulling double shifts; the truck drivers who are hauling  goods across this country; and the folks who work hard, play by the  rules, and ask only for a fair shot and a government that works for  them, not against them.\n\nIt is for places…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693189/one-big-beautiful-bill-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…humanitarian assistance to the people       of Haiti;\n\n(C) financial transactions relating to humanitarian       assistance or for humanitarian purposes in Haiti; or\n\n(D) transporting goods or services that are necessary to       carry out operations relating to humanitarian assistance or       humanitarian purposes in Haiti.\n\n(d) Implementation; Penalties.--…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694815/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…(II) automatically cancel any other valid visa or entry       documentation that is in the individual's possession.\n\n(c) Exceptions.--\n\n(1) Exception relating to importation of goods.--\n\n(A) In general.--The authorities and requirements to impose       sanctions under subsection (b)(1) shall not include the       authority or a requirement to impose sanctions…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and emerging       technologies.\n\n(5) In consultation with the Secretary of State and the       United States Trade Representative, support the availability       of critical goods from domestic manufacturers, domestic       enterprises, and manufacturing operations in countries that       are allies or key international partner nations.\n\n(6) Assist the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Agency for       International Development may be used to develop, design,       plan, promulgate, implement, or execute a policy, program, or       contract that knowingly uses goods, wares, articles, or       merchandise mined, produced, or manufactured wholly or in       part in the Xinjiang Uyghur Autonomous Region of the People's       Republic of China…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690654/no-dollars-to-uyghur-forced-labor-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…about political party. I voted for and supported President  Trump, but I don't support the rule of one person. We are set--the  President is set--to have a 25-percent tax on goods coming from Canada  and Mexico. This is a tax--plain and simple--on the American people.\n\nBut one person can't do that. Our Founding Fathers said: No, that  would be illegal…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…deficits, and I am confident it will only continue to grow.\n\nMr. Speaker, 2026 will be about bigger paychecks and lower costs on  everything from healthcare to housing to household goods. We are moving  forward with housing affordability legislation to lower costs and  update financing options. We are streamlining and simplifying  permitting processes to create…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699064/how-republicans-have-delivered-for-americans"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…people need hope, and they need support from the American people.\n\nThe HOPE/HELP preferential trade program helps do just that. It  lowers costs for Haitian businesses to export goods to the U.S.,  bolstering both economic development and stability for critical Haitian  industries. It helps move the country forward in a moment when they  need it most.\n\nForty…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698848/haiti-economic-lift-program-extension-act"}]