[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…Carolinas, that is really  appalling. We should not do it.\n\nI am here with my colleagues to defend our commitment to good  scientific research, to good cancer research, to good healthcare access  for poor kids and seniors, and to sound the alert that that is what is  at stake despite what the President may say about his ``love'' for  Medicare. What he clearly…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688257/department-of-health-and-human-services"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…between a prescription and rent.\n\nThis is about health, but I want to tell you, for all those doing the  math at home, you cannot have a thriving economic engine without good  healthcare. The two are incompatible. Widespread sickness, illness, and  disease and people can't get their health issues covered, it takes away  from our economic strength.\n\nIn…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…that place in the United States of America. Imagine a  country where everyone can work hard, play by the rules, and live the  good life, with a good-paying job, good housing, good healthcare, good  education for your children, and a good retirement--which means keep  your hands off Social Security and Medicare now and forever.\n\nWe want a country where…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…pressure--mainly from our veterans and our  veterans groups--they backed off. But make no mistake about it, a cut  of 30,000 will decimate the ability of the VA to provide good  healthcare to our veterans, who have risked their lives for us.\n\nSecretary Collins is making the VA so toxic that workers are leaving  on their own. The workers--I have talked  to…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693277/veterans-administration"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…clear on our side of the aisle: We want the maximum  amount of people to get health insurance, drive down uncompensated  care, drive down everybody's cost, and deliver good healthcare for our  citizens. Since the passage of the Affordable Care Act, the uninsured  rate was cut in half from almost 16 percent--roughly 15.7 percent  in 2010--down to an…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695964/en-bloc-nominations"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…and play by the rules, you should be able to live an affordable  life, a comfortable life, and live the good life.\n\nWhat exactly does that mean: good-paying job; good housing; good  healthcare; good education for your children; and at the end of the  day, a good retirement. That is the good life. That is the American  Dream.\n\nFor far too many people,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697994/protect-americas-workforce-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…the quickest things you can do to turn that light off is to make  a prospect worried about whether the employees and executives and their  families will have access to good healthcare.\n\nSo on the healthcare piece of this, what Democrats are asking for by  way of an alternative--not a nonnegotiable but by way of an  alternative--is let's go into the…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…should be able to live a  comfortable life, an affordable life, live the good life. You should  have a good-paying job, good housing, good education for your children,  good healthcare, and a good retirement. That is not too much to ask for  in the wealthiest country in the history of the world.\n\nThere is a lot of work that needs to be done to make that…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698795/breaking-the-gridlock-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…is not too much to ask for in the wealthiest country, America, in  the history of the world. Work hard. Play by the rules. Live the good  life. Good-paying job, good housing, good healthcare, good education  for the children, and a good retirement--which means backing off  extreme attacks on Social Security and Medicare--that is a Democratic  commitment.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699898/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…problem left  untreated can lead, often, to much more serious health consequences as  they grow older--much more dependency on social programs, which are  paid for by us. Good healthcare as a child guarantees, in many, many,  and most cases, success in school, success in life, and a healthy  life--one in three children in Rhode Island need Medicaid.\n\nFive…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689546/h-con-res-14"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…ever been a moment where particularly the left and the  right can get together and say that we need to fix the incentives in  this program? Also, it is great economics, good healthcare, and great  vision for the future. No, David. You see, we care too much about  winning the next election and beating the crap out of the other side.\n\nThen, you hear some…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…this and our talent-based immigration bill, those two  bills together, probably score at $2 trillion of savings, and they  would be good for the economy. They would be good for healthcare. They  would be good for people to be healthier. They would help grow the  economy.\n\nThis is an example of getting policy right to actually take on a  small sliver of…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}]