[{"senator": "Al Green", "party": "Democrat", "sentence": "…with men, who don't want women to have the right to vote when they are  new moms.\n\nI am saying ``new parents'' now, but I am talking about moms. I think  every man has a good reason to want to do this because you ought to  respect the person who carried you for 9 months, labored with you, and  gave you the breath of life. It is time to make a change.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689706/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…administration has recklessly and dangerously deployed the National  Guard to American cities without the request or permission of either  State or local officials.\n\nFor good reason, the Governor of each State makes the decision about  when and where to deploy National Guard, not Presidents who are trying  to score cheap political points and who are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695246/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…accusation, without more.\n\nWe are not aware of a single jurisdiction in the country       that allows detention based solely on the nature of the       charge, and for good reason--it would not withstand       constitutional scrutiny. This bill would set a dangerous       precedent, eroding basic civil liberties and undermining       decades of legal…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Now, they are threatening to shut down the phone lines altogether and  close offices all across the country.\n\nThese aren't glitches. These are deliberate choices for no good  reason. This is a violation of the sacred promise of Social Security,  and I am urging this body and Members on both sides of the aisle to  listen to your constituents and stand…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689770/hands-off-social-security"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…President  Clinton. Its mission: to improve lives and strengthen communities  through the service of dedicated volunteers.\n\nIt has long enjoyed bipartisan support, and for good reason, because  it is one of the best ways our government can do good things for real  people right here at home.\n\nTo cut AmeriCorps is to deprive Americans. The Trump administration…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691309/cutting-americorps-deprives-americans"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…play gotcha--although this is  a pretty embarrassing gotcha--but rather to remind the House that,  right now, in real life, the Trump bogus attack on wind power, for no  good reason, is destroying good American jobs and cutting off an  abundant supply of new energy, which our economy and American  electricity ratepayers desperately need.\n\nFor example,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698954/china-is-not-scamming-europe-and-united-states-on-wind-power"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…1,500-bed detention facility.  ICE's Acting Director called it Amazon Prime but with human beings.\n\nPeople across the political spectrum are strongly opposing this and  for good reason. They don't want human beings held in a makeshift jail  down the street from their child's high school. They don't want masked  agents in their church parking lot. None…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699702/chaos-at-department-of-homeland-security"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…enforcement during our law enforcement week who will say it is  time to put up the plaque in honor of the officers who defended us?\n\nMr. Speaker, I hope my colleagues have some good reason for doing  what they are doing. The Framers of the Constitution thought that  people who participated in the government would come to identify with  their branch of government.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…in the Declaration, ``that all Men are created equal,'' not just  the wealthy and well-connected.\n\nAmericans across this Nation overwhelmingly oppose this bill--and for  good reason. You see, this bill signed by the President on the Fourth  of July is the largest cut in healthcare and the largest cut in  nutrition assistance in history, slashing more…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693251/one-big-beautiful-bill-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…assistance from millions of Americans so  billionaires can get trillions of dollars in tax breaks.\n\nMr. Speaker, who is afraid of the big, bad bill? A lot of people are,  and for good reason. Make no mistake, if you rip healthcare away from  millions of Americans, people will die.\n\nRight now, this is the largest Medicaid cut in American history. In  fact, a…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691580/big-bad-bill-is-cruel"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…country, this  Christmas, don't see a dramatic spike in the price of healthcare for  them and their families, they are going: Sorry, I don't have any money.\n\nAnd there is good reason. They are giving it to the Defense  Department. They are giving it to millionaires and billionaires. Of  course, they don't have any money.\n\nSomebody has to pay for it,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…the middle of the District of Columbia, even during the middle  of the day is almost, by definition, dangerous almost under any  circumstances, so you better have a really good reason to engage in a  pursuit like that.\n\nThat is not the balance that is drawn by this bill. That is not the  balance that was drawn by the people of the District of Columbia.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695639/district-of-columbia-policing-protection-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…to this  legislation. There are times for vetoes, and I have seen Presidents in  both parties issue a veto and then robust and healthy debate plays out  on this floor for good reason and Members decide where they want to  land, but that is always when we have seen a result that was mixed,  where there were people who voted against the bill. No one voted…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698657/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…several, including the  Rock Island Dam at Chelan County PUD, are due for relicensing at the  end of 2028.\n\nThe relicensing process is typically very lengthy, in part for good  reason. The public comment period needs to be robust for all parties to  weigh in. Without that input, we risk potentially devastating  environmental consequences on regional ecosystems.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693476/hydropower-licensing-transparency-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…regardless of who has been in the White  House. Only Congress, under the Constitution, has the power to declare  war. Article I, section 8 is clear on this issue--and for good reason.  Only the people's elected representatives should have the awesome power  to send our sons and daughters into armed conflict.\n\nI remember thinking about this in personal…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696557/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Whitney  Hermandorfer to serve on the U.S. Court of Appeals for the Sixth  Circuit.\n\nShe is the very first judicial nomination of President Trump's second  term, and there is a good reason that the President selected Ms.  Hermandorfer for the circuit court.\n\nThere is no one more qualified to take on this important role as an  appellate judge for our great…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693465/nomination-of-whitney-d-hermandorfer"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Speaker, today on the House floor, there  was an amendment offered that suffered the most overwhelming defeat  that I have ever seen in the United States Congress, and for good  reason. It is perhaps the most abhorrent legislative proposal I have  ever seen in the United States Congress.\n\nThe Representative from Michigan, Representative Tlaib, introduced…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…renewed mineral leases  to these deposits beginning in the 1960s. Decades of planning,  exploration, investment, and environmental reviews have gone into the  region, and with good reason.\n\nThe minerals in the Duluth Complex include copper, nickel, and  cobalt. They are the ones that make up the 21st century economy and  help it run. They are the essential…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "John Thune", "party": "Republican", "sentence": "…far-left base said  ``Jump,'' and the Democrat leader said ``How high?'' But the far left's  determination to oppose anything President Trump has ever said or done  is not a good reason for subjecting the American people to the pain of  a government shutdown.\n\nSo I would say to my Democrat colleagues who still care more about  their constituents than the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695921/continuing-appropriations-and-extensions-and-other-matters-act-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…explanation of the error, showing the mathematical change, and  inform taxpayers that they have 60 days to correct the issue.\n\nMr. Speaker, Americans fear the IRS for very good reason. Under  current law, when the IRS claims that you made a math error on your  return, they are not required to explain the error or notify taxpayers  of their right to appeal…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689359/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…district, the  Trails at Jakes Rocks, located in the heart of the Pennsylvania Wilds.\n\nThis stunning trail system was named Pennsylvania's 2024 Trail of the  Year and for good reason. It offers world-class mountain biking and  breathtaking views across the Allegheny National Forest, welcoming  everyone from beginners to seasoned outdoor enthusiasts.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692129/national-trails-day"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…consider the gentleman from Texas a friend, and I am sincere in wishing  him safe travels and well wishes heading back home. We throw a lot of  barbs around this Chamber, for good reason, we are here. Everybody  always says how crazy it is and how divided we are, and I always remind  people that when was the last time you had a Secretary of the Treasury…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…byproducts of our Republican vision  is the One Big Beautiful Bill Act. It is one of the most consequential  pieces of legislation that any party has ever passed and for good  reason.\n\nThe provisions interwoven in this legislation are monumental. They  are what the American people voted for in November: historic tax relief  for working families; massive…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…all, they should be focused on restoring their  lives and livelihoods first and foremost.\n\nIf Washington is slower than a State government to respond, that is  not a good enough reason to deny Americans the help they need. This  legislation will lighten the load carried by families affected by a  natural disaster.\n\nMr. SMITH of Missouri. Mr. Speaker,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689383/filing-relief-for-natural-disasters-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…that it prevented the largest  tax hike in American history and puts more money back in the pockets of  hard-working Americans.\n\nNow, you would think that alone would be a good reason to support the  One Big Beautiful Bill, but there is more.\n\nThe main way they have opposed that bill is by mischaracterizing it  and outright misrepresenting what is contained…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695530/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…assumption that the new map will govern the  elections in 2026.\n\nI did want to point to one particular provision in Prop 50 that I  actually support. Indeed, I think a good part of the reason why it  passed is because they actually put this provision, this sentence,  right there in the description that people saw on the ballot when they  voted, which is…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "James Lankford", "party": "Republican", "sentence": "Mr. LANKFORD. Mr. President, the Senate is talking a lot about  healthcare right now for good reason. There are major cost increases  going up on insurance all across the country but especially for some  folks that are in ObamaCare Marketplace plans.\n\nI talked earlier this…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…pieces of legislation giving taxpayers fairer  treatment. The Tax Court Improvement Act is another one of these  solutions.\n\nThe IRS is the most feared Federal agency for good reason, but we are  working to change that. In addition to pursuing partisan aims, it has a  long-documented history of treating taxpayer rights as mere  suggestions.\n\nThis bill…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697269/tax-court-improvement-act"}]