[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…up by  $21,000, and their deductible would go from zero to $7,000. That is  $28,000 net taken out of their pockets. How are they going to pay for  it?\n\nRepublicans, have you got an answer for them? This junk insurance  won't help them one bit.\n\nCassidy-Crapo is not a healthcare plan. It is not a plan at all. It  is an excuse. It is a figleaf. Because…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697877/healthcare"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…community-wide event that brings together thousands for a celebration  of Pride.\n\nAs we celebrate, we also appreciate and commemorate that we stand on  the shoulders of those who got us here. It is with that realization  that we are reinvigorated in our push for equal rights.\n\nWe in Santa Cruz and throughout the 19th Congressional District of  California…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692043/recognizing-santa-cruz-pride-parades-50th-anniversary"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…mother,  who emigrated from Mexico in the 1960s. She raised me and my sister on  her own, taking multiple jobs to make ends meet. It was not until the  late 1980s when she finally got her green card. She was so happy, and I  remember feeling relieved because she was safe and could live in this  country without fear.\n\nToday, that fear has returned. Donald…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690513/trump-immigration-policies"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…While many were asleep, the Key Bridge  collapsed into the icy waters.\n\nAlthough struck with fear and shock, Team Maryland didn't hesitate.  We jumped into action right away and got to work.\n\nWe have this phrase--``Team Maryland''--that we have been saying for  years, but it is true. We work as a team, one of the strongest teams in  the country--a coordinated…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689022/9999"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…justify doing this, showing the law. That is the nonsense. That is  the garbage the American people are tired of--the political this, the  political jostling, all of that.\n\nWe have got people that are going to go hungry. This has never  happened before, you all. There is a better way to do that.\n\nSo, Mr. President, in response to the request from the majority…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…financial security is down.  People are having such a tough time affording the things they very much  need--not luxuries, not frivolities--things they need: food, medicine;  got to fix the car that just broke down and which you need to get to  work, and you don't have the money to do it--over and over and over  again.\n\nAnd, of course, the tip of the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698199/new-york"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…years, NIOSH has been helping workers all over the country, making sure  that workers are safe and healthy.\n\nDuring all the DOGE cuts, 1,500 NIOSH workers lost their jobs. We got  to work. We worked with labor and others, and 100 Members of Congress,  and we started getting those jobs reinstated.\n\nWe asked Secretary Kennedy to work with us to make sure…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699625/niosh-workers-got-their-jobs-back"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…seductive sirens of  those who are trying to convince us that we are at war with one  another. Amidst our fierce debates, I submit that at the end of the  day, we are all we have got--we the people. All we really have is one  another. And a democracy is the imperfect institutionalization of that  moral insight. All we have is one another. You either have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695312/cloture-motion"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…Capitol to walk for a quarter of a mile  to get to an office building where I could be safe, but there were so  many others who were not fortunate to be able to do that. They got  swept up, as the gentleman from South Carolina said, taken away,  whisked away, and stayed in seclusion for hours, sometimes in the same  closets almost, breathing the same…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698547/january-6-attack"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the global EV supply chain--including,       crucially, batteries, perhaps the single most important       technology underpinning EV performance. Many of these players       got a big boost working alongside Tesla, the American EV       pioneer that started making cars at its Shanghai plant in       late 2019.\n\nNow, global dependence on Chinese battery…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Over and over again, we have seen it. We have seen it with the  repeated overruling of the Parliamentarian. We have seen it with the  ``Beautiful for Billionaires Bill'' that got rammed through with a  simple majority. We have seen it with the change in the rules to allow  100 nominees to go through at a time under advice and consent. We have  seen it…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695927/government-funding"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, I want to begin with a truly disgusting  and alarming piece of news the American people got this morning. This  morning, the former President of Honduras, Juan Orlando Hernandez, was  released from prison after Donald Trump gave him a pardon.\n\nWe all know Donald Trump…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697368/trump-administration"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…am here today to honor a remarkable  diplomat and dear friend, Ambassador Kevin Rudd, as he prepares to  leave his post as Australian Ambassador to the United States.\n\nI first got to know Kevin and his wife Therese over a decade ago. But  now, more recently, as chairman and now vice chairman of the Senate  Select Committee on Intelligence, I have had…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699544/9999"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…will the  school do? If ICE takes my classmate, what should I do? Where does ICE  take people? And what do I do if my friends come home to an empty house  because their family got deported?\n\n``I wish I did not have to worry about these things, and I wish even  more that my friends, classmates, and neighbors did not have to either.  Thanks for your time.''…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689733/challenges-facing-our-students"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…paying attention to hard-working people because the  price of your groceries has done nothing but skyrocket.\n\nDonald Trump, he ran for President on lowering prices. Since he got  into office nearly a year ago, Americans have spent on average well  over $1,000 more because of Trump's cost-raising tariffs. He was  supposed to lower prices on day one.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698816/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Center with life-  threatening injuries for months. Doctors say he will never fully  recover.\n\nThe suspect is a 29-year-old illegal alien who entered the United  States as a got-away. He was arrested in San Antonio and charged with a  DWI in 2020. He was let go on a personal reconnaissance bond but failed  to show up.\n\nThe Bexar County DA downgraded…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…district judges, and they are just  that, judges. They are not the President of the United States. They are  not the person who put his name on the ballot and ran nationwide, got  77 million votes, won the electoral college, and is head of the  executive branch. They are judges, district judges.\n\nI said this in committee. The real question ultimately…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689717/no-rogue-rulings-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…going be lower and the next year it is going to be smaller  and the year after is smaller. People like me, baby boomers, with gray  hair, there is a whole bunch of us. We have got to legalize technology.  Is it rational? I will say this a couple times. Is it rational to make  it illegal to automate a port?\n\nI would love to have the dockworkers and the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…talked about the Republican  proposal being insulting, is insulting.\n\nAnd then these fake applications that were approved without any  income verification--the law says you have got to verify somebody's  income. Under the law, the amount of money that a person would get, in  terms of bonuses, is supposed to be based on income. In one case, the  fake applicant's…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…minute when  there is no time for debate, no time for amendments, no time to say,  OK, this one doesn't belong, the others are fine.\n\nTake it or leave it. It is extortion. We have got to end that  process. There is not one legitimate reason why we shouldn't pass any  one of these four bills. Let's get it done today. I find it tragic that  this drew an objection.…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691666/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…shutdown by this particular date, you are not going to get paid.\n\nAnd do you know what? Members of Congress had an epiphany. They had a  Damascene moment. They were born again. They got out of the shutdown in  time to be paid.\n\nI am not trying to put down anybody. I am not trying to condemn folks  who have been taking their salary. I am not saying they don't…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…in the summer. This legislation cuts through that backlog. It empowers  grid operators to prioritize projects that actually enhance  reliability.\n\nLet us be clear about how we got here. Democrats have spent years  forcing premature retirements of coal, nuclear, and natural gas through  excessive regulation, while shoveling subsidies to wind and solar.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…Corps said  they needed money. I asked how much. They said: Well, we really need  science first. We need to study it first.\n\nAll right. How much do you need for studying it?\n\nI got them that, a quarter of a million. They had data done by a top  IT university in the entire world with 500,000 data points. Across 17  miles of river, it was determined that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694867/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…deciphered.\n\nAt first the CDC--this was during the Biden administration--refused  to investigate and even hung up on local officials who asked for help.  After Representative Costa got involved, the CDC did an inspection and  found at least 20 potentially infectious agents, including HIV,  tuberculosis, and the deadliest known form of malaria. Yet, the CDC…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…stop this $135 million  funding, the CCP may pick it up because they were regurgitating their  talking points during COVID.\n\nAt some point, Mr. Speaker, the question we have all got to answer  is: Number one, do you believe in fiscal responsibility? Maybe some  people have other priorities than these they would like to defund. If  you think these are all…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Coach Moore is ready to lead the Cougs to  new heights in his first head coaching role.\n\nKirby grew up going to Cougar football games. Kirby said: ``For me,  this is home. We've got grandparents in Palouse. We've got aunts in  Pullman, aunts in Spokane. My parents just built a house in the Tri- Cities, so there's some incredible memories for my kids.''…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698645/tax-relief-for-working-families"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…sides of the aisle have made him an  invaluable part of my team.\n\nHis legislative team advised me each week in Congress and shepherded  more than 40 bills through the House and got more than 15 bills signed  into law.\n\nThese are real results that have made a difference in the lives of  the American people.\n\nSo I thank Alex, and I hope that he knows how…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688120/thanking-alex-cisneros-legislative-director"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…to speak. I had the  privilege of just standing in the Speaker's rostrum a few minutes ago  and witnessing this debate on an issue that has been important to me  ever since I got into public service. I think it is no small  coincidence as I was able to wear my kippah up there. I am not sure  whether that has happened before as a debate like this happened.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691193/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…is necessary because there are some appointees in the  Pentagon who have embraced the foolish policy of decoupling from Europe  and weakening our leadership in NATO. We have got to stand opposed to  this. We need to use our Article I powers today and be counted for what  we believe in.\n\nWhat happens if we withdraw from the Baltics? No one will be more…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695259/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…radical left ever wanted.\n\nTo remind the American people, Democrats wanted to waste $1.5  trillion of their hard-earned tax dollars. What did Democrats get in  return? Democrats got nothing. Democrats got nothing because  Republicans refused to waste the American people's money.\n\nDemocrats did not get a dime for radical climate change, not a dollar  for…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696724/continuing-appropriations-and-extensions-act-2026"}]