[{"senator": "Brian Schatz", "party": "Democrat", "sentence": "…the carpet, and they say: There is no  recording in here.\n\nIt is a damn press conference. It is for recording. They didn't want  to hear his speaking.\n\nAnd if the internet has got it accurately, the Secretary was there  and delivering her remarks within earshot the whole time. She has  command authority over those agents who are arresting a leader in…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692449/alex-padilla"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…trillion dollars in  healthcare. Fifteen million Americans are going to lose their  healthcare to pay for tax cuts for the superwealthy. So that  concentration of wealth and power got worse, probably worse in 1 single  year, in one single vote than any other time in American history.\n\nDuring my lifetime, since I was born, CEO pay has increased by over  1,000…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699242/restoring-election-integrity"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…that. It is out of touch.\n\nNot only is that hurting our families, but it is also unfairly  penalizing our kids, who are trying to learn financial responsibility.\n\nMy son recently got a debit card. He is 14, and he uses it for small  stuff and things like buying PlayStation skins, Fortnite skins,  whatever kids buy. If he accidentally spends more than he…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689843/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…momentum. The weekend is hard. Maybe we are  going to get yelled at from the left; you are going to get yelled at  from the right; and we can't withstand that so we just have got to go  through with it. It is a damn shame.\n\nMaybe this exercise builds a little muscle memory for at least  exploring how to have a bipartisan negotiation. Maybe there is some…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695313/cloture-motion"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…naturalized  citizens, and low-income folks. Mr. Speaker, 69 million American women  would also be unable to register to vote simply because they changed  their last name after they got married.\n\nWe need to pass legislation to stop billionaires from buying our  elections, not making it harder for the American people to vote. I am  going to vote ``no'' on this…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689318/voter-suppression-plain-and-simple"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…what is going on with  them, and I don't know what is going on with the President of the  United States of America.\n\nHe has put us in a chaotic situation. For example, I just got word  that he has changed his mind about tariffs. We were all trying to  convince this administration that they should not be raising the  tariffs on all of these countries…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689845/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…and  capricious and having a rational basis, they came here where it can be  as arbitrary and capricious as you please, where it can have no  rational basis as long as you have got the votes and are willing to  roll the minority.\n\nSo that is the second avenue that Republicans could have followed  here, that the fossil fuel industry could have followed…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…couple of people who did wrong  to tear gas and attack peaceful protesters, not in Eugene. We will not  back down.\n\nThank you, President Trump. We don't need Federal help. We have got  it. Thank you for your attention to this matter.", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699509/we-will-not-back-down"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…super easy, which       was very lucky. Kids that don't have that same chance--I knew       a kid who didn't know, his parents had no idea it could be a       possibility and he got super sick. When he woke up in the       morning, he had to get evac'd out and had brain damage. He       had to learn how to walk again. It's just so hard. It really…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693470/recognizing-ms-abby-lachman-for-her-dedicated-medical-research-advocacy"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…we do no harm when it comes to the profound insecurity  people are feeling about having access to healthcare for themselves,  for their partners, for their kids.\n\nAnd we have got real differences in this Chamber. Little introductory  remarks about the One Big Beautiful Bill--I do think it is a terrible  bill. I do think that we have taken money from…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Congress can eliminate it.\n\nWe look at what is happening with all of these programs--the programs  that help low-income students, students with disabilities, and higher  ed.\n\nI got through community college and college and law school because I  had Federal support. Programs like TRIO and GEAR UP that help  underserved students, these are all under attack.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698126/dismantling-the-department-of-education"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…She told me that what had happened was she had  been laid off. Everybody in her lab had been laid off. So what that  meant was the trial that they had been running for years got shut down.\n\nAs we all know with clinical trials, Alzheimer's, cancer, and  others--and I will come back to those--these aren't light switches, Mr.  Speaker. We can't just flip…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695606/devastating-harm-caused-by-trump-administration"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…consideration.\n\nWe have heard our colleague distort the facts already through this  debate. I want to remind the American people and everybody that it was  local law enforcement that got the situation under control before the  National Guard and the Marines showed up. I know because I was on the  phone with the sheriffs and local law enforcement who said, no,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693137/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…American people as  to what the President said. Yesterday, he admitted what he said. It is  not for my sake but for the sake of discussing this issue of  immigration because we have got to get beyond crudity and vulgarity and  what we have seen in the extreme in the last several months when it  comes to immigration.\n\nI will make it clear where I stand. We need…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697820/donald-trump"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Why? Simply because the government of  Ontario released an ad that included a radio address from President  Reagan, warning about the danger of tariffs, and, apparently, that got  Donald Trump's feelings all hurt.\n\nTrump is letting his delicate little ego drive U.S. trade, whether it  is with Brazil, Argentina, or with Canada. The consequence is that…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696451/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the egregious abuses by Jeffrey Epstein, a goal  that anyone of conscience desires. That is in totality an important  statement to check the rich and powerful.\n\nRemember how we got here. After decades, it was President Trump's  Department of Justice that indicted Jeffrey Epstein in July 2019. It  was President Trump's DOJ that arrested and indicted Ms.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696812/epstein-files-transparency-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…they say.\n\nWell, we just eliminated money for all forms of media.\n\nNow, those are the demands. Those are the demands. I will just  mention one more.\n\nCongresswoman Ocasio-Cortez got very, very upset, as did the  socialist wing of her party, when the President sent over what is  called a rescission package.\n\nBasically, President Trump said: We want you to…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…resulted now in a  cease-fire deal between Iran and Israel.\n\nThe NATO countries are increasing their defense spending, not just 2  percent but 5 percent of GDP.\n\nThe President got in charge and got a Rwanda-Congo peace deal.\n\nThe Supreme Court ended nationwide injunctions. How about that? That  conservative majority on the Supreme Court also allows third-country…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…this country, who pay 40 percent of the light  bills and the expenses of this growing, massive Federal Government,  paid more of a share of taxes than they did less. The code got more  progressive.\n\nMr. ARRINGTON. Mr. Speaker, I say to Mr. Panetta that if we do  current policy and don't offset the impact of the deficit, that would  be a dangerous precedent.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…battlefield. They provided protection and care  and were amazingly able to get a helicopter in after three attempts.  This was all on the last day of the war and fortunately, because he got  shot, the battalion behind was able to make an overwhelming  counterattack, which led to total victory. Had he not been discharged,  he would have made a career out of serving…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696279/recognizing-delman-leon-orme-with-a-congressional-veteran-commendation"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…the hit to our energy security or the actual possibility that our  energy security will be severely damaged.\n\nMr. Speaker, if we want reliable power and lower costs, we have got  to stop telling fairy tales, and we have got to start doing. That is  exactly what my friend and colleague, Congressman Hudson's, bill does.  I urge my colleagues to support…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698071/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…stop this $135 million  funding, the CCP may pick it up because they were regurgitating their  talking points during COVID.\n\nAt some point, Mr. Speaker, the question we have all got to answer  is: Number one, do you believe in fiscal responsibility? Maybe some  people have other priorities than these they would like to defund. If  you think these are all…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Mr. Speaker, Virginia tried to create these plans, and CMS  told them they couldn't do it, that they would penalize them. The  Virginia Association of Realtors--let's see if I got the name right--in  an article from 2023, the leader said that they would create a plan for  7,000 association members who were uninsured because they don't make  enough money…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…family. They are looking at that  check at the end of being away from their family for a few extra hours,  trying to make ends meet for their family, and they think: Gee, I have  got to give all that extra money back to the government, is it worth  being away from my family?\n\nWe say, you know what? Yeah, normal tax rates apply on everything  else, but if…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…continue to spiral for the  American people.\n\nNow, I am going to show you here, first off, where most people get  their health insurance coverage in this country. So you have got, in  the individual marketplace, which is the blue here, almost 50 percent  of Americans--that is about 150 million Americans--who get their  healthcare coverage through their…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…preliminary number is  around $1.7 trillion to $1.84 trillion, making it the single-biggest  reduction bill, I believe, in modern history--actually, in history at  all.\n\nSo, I just got you $1.8 trillion. We have also introduced a talent- based immigration bill. If you want to hit the GDP growth numbers that  we keep talking about, that the left has even talked…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…this is a legislative process. It is a  legislative process that has endured for hundreds of years in this  country, and it may not be perfect, but it is the best one we have got.  It existed for many hundreds of years before that in our mother  country, before we became our own country. There are reasons why these  things develop. To call it a long…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698296/9999"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…PAUL. Mr. President, you know, there was an old-fashioned  conservative principle that believed that less taxes were better than  more taxes; that if you taxed something, you got less of it, so that if  you place a new tax on trade, you will get less trade.\n\nThere was also this idea that you didn't do taxation without  representation. That idea goes…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…that time, Nancy Pelosi,  and the Deep State learned of Trump supporters coming to Washington,  DC--which, by the way, was hundreds of thousands of people--they  started and got an idea. Now, again, this has all been proven. They  decided to infiltrate the crowd with antifa and intelligence community  members who would stir up trouble. The FBI has confirmed…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698541/9999"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…were on the verge of overthrowing this regime.  In 2009, as Iranians took to the streets during the so-called Green  Movement, they looked to the United States for support but got only  silence. In 2016, the American Government sent $1.7 billion in cash to  the mullahs on shrink-wrapped cargo pallets. In 2015, we released $150  billion more in frozen…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}]