[{"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…recklessly and dangerously deployed the National  Guard to American cities without the request or permission of either  State or local officials.\n\nFor good reason, the Governor of each State makes the decision about  when and where to deploy National Guard, not Presidents who are trying  to score cheap political points and who are trying to divide our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695246/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Rights Division.\n\nMr. GREEN of Texas. Mr. Speaker, the first is a letter from the  Department of Justice. This letter from the Department of Justice is  addressed to the Governor of the State of Texas, Governor Gregory  Abbott. It is also addressed to Attorney General Ken Paxton. The letter  is dated July 7, 2025.\n\nThe reference line is: ``Unconstitutional…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…The week didn't start great. We saw the President of the United  States--for the first time, I think, in possibly my lifetime--send  troops without a request from the Governor into a State because people  were protesting.\n\nAnd, sure, some could make an argument that maybe a few protesters  got over somebody's perceived line, but they were largely peaceful…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692559/alex-padilla"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…understood something we should all remember to this day:  There are no kings in a democracy.\n\nThis year, as we celebrate our independence from one empire and one  governor across the State line, let us also reject any attempt to crown  a new monarch, whether with a golden crown or a gilded office, because  in this country no one is above the law.\n\nMr.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692377/recognizing-milford-delaware"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…against the State, including without limitation under the 14th  Amendment.''\n\nRace has been infused into this letter. It was sent to the Honorable  Greg Abbott, the Governor of the State of Texas, and the Honorable Ken  Paxton.\n\nDear friends, at the end of the day, if they can fulfill what they  proclaim in this letter, there will be more White representation…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694163/racism-infused-in-texas-politics"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…think that the electoral process works efficaciously-- effectively, if you will, for them. I was saying efficaciously, but  let's just say effectively for them. The Governor of my State, while I  am in trial currently defending the Ninth Congressional District--I  have been in trial for many years, so this is nothing unusual to defend  this district,…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…flag be flown at half-staff. Current law  states that the President shall make this order ``upon the death of  principal figures of the United States Government and the Governor of a  State, territory, or possession, as a mark of respect to their  memory.'' Surely the D.C. Mayor, who has the same responsibilities as  governors of states and territories,…", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692567/introduction-of-a-bill-to-permit-the-flag-of-the-united-states-to-be-flown-at-half-staff-in-the-event-of-the-death-of-a-mayor-of-the-district-of-columbia"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…President replace  Congress with corporate America, decide that he will send in the  National Guard, send it in to cities across the country without a  request from the Governor of the State? When he decides that he is  going to talk about now the Insurrection Act as his next tool, National  Guard already in, using the Insurrection Act, bring in the military,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…received the prestigious Jefferson       Award in 1986 for her service.\n\nIn 1994, Ben Cayetano was elected the Governor of Hawaii,       becoming the first Filipino American governor of a state in       our union.\n\nIn 2019, Roy Macaraeg became the first Filipino American to       become a general officer in the history of Hawaii's citizen       soldier ranks.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695943/recognizing-filipino-american-history-month"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…are not going to stop there. We have to now recognize that  there are some other dastards involved here. We already acknowledged  the President as a dastard and the Governor of the State of Texas as a  dastard.\n\nNow, we have to talk about the Houston Chronicle. The Houston  Chronicle, for whatever reasons, wittingly or unwittingly, has joined  forces…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…come to revere, like Joshua Chamberlain from Maine, who  played such a pivotal role in the Battle of Gettysburg. What a noble  soul he was. He would later go on to be Governor of his State and go on  to do great things, but his heroism lay that in a time of crisis, he  stood up.\n\nI know there are veterans in this body--I admire them so much--who  have…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, today, the Governor of my  State, Gavin Newsom, gave his state of the State address in which he  declared that California leads the Nation. Now, the Governor isn't  wrong. As the residents of our State…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698654/california-is-the-most-popular-state-to-leave"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…receive more timely relief.\n\nNumber one, it will authorize the Secretary of the Treasury, in  consultation with FEMA, to extend filing relief to taxpayers as soon as  the Governor of the State declares a disaster or a state of emergency.\n\nNumber two, Mr. Speaker, it will expand the current mandatory filing  extension following a Federal declaration from 60…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689382/filing-relief-for-natural-disasters-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…was a bipartisan vote to cut off all  further Federal funding for high-speed rail. There is no  viable path forward for the project. I do believe when we have a new  Governor in the State, the project will finally be wound down.\n\nTaxpayers also deserve answers on where all of this money has gone.  Curiously, as we are seeing new scrutiny to answer that…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700217/prices-in-california-are-too-high"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…encourage my colleagues to vote ``yes.''\n\nMr. STEIL. Will the gentleman yield?\n\nMr. STEIL. It was signed into law. It was signed into law in the  State of Georgia by the Governor of the State of Georgia.\n\nMr. STEIL. Will the gentleman yield?\n\nMr. STEIL. I assume the assembly and senate of the State of Georgia  prior to signature by the Governor of the State.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692319/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…in a  number of areas related to the cost of energy and the cost of  healthcare to start to address those problems.\n\nI was caught somewhat by surprise to hear the Governor of my own  State of California commenting on this issue and even saying that no  State matches California's success, that ``the numbers speak for  themselves.''\n\nI thought I would…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…National Guard to go into California over  the objection of the Governor of California, something that has not  happened since 1965. In 1965, it happened because the Governor of the  State was not following Federal law.\n\nIs that the kind of cooperation that we are looking for here?\n\nThis resolution should be pulled immediately.\n\nMr. Van Drew and Mr. Neguse…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…this absolutely insane proposal, I want to  take a closer look at the California State budget as it now stands  because this last week we got an announcement from the Governor that  the State will be spending $348.9 billion in the coming fiscal year.\n\nNow, notably, that is a massive increase over what the State spent  just last year, and it is nearly double…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…``(1) In general.--The Secretary (after consultation with       the Administrator of the Federal Emergency Management Agency)       may, upon the written request of the Governor of a State (or       the Mayor, in the case of the District of Columbia), apply       the rules of subsections (a) and (b) to a qualified State       declared disaster in the same…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689383/filing-relief-for-natural-disasters-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…State's economy, so these problems have all been building and  building and have, in particular, accelerated during the governorship  of Gavin Newsom.\n\nIn his first year as Governor, our State budget was $208 billion.  Now, the budget is $322 billion. It has increased by more than 50  percent. Can Californians say they are getting 50 percent more for  their…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}]