[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…legally modify through loopholes in  our gun laws.\n\nHundreds of people attended a vigil for the victims of this deadly  attack and demanded we do something. In response, the Governor of Ohio  signed permitless carry legislation, allowing individuals to carry  concealed firearms without a permit.\n\nLast year, 25-year-old Megan Keleman, a young woman in my…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692027/observing-gun-violence-awareness-month"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…for bringing  people together. There is no doubt in my mind that if it were not for  that day, Gabby Giffords would be sitting in the United States Senate  right now or the Governor's office, maybe even the White House.\n\nWe have seen the consequences when political disagreements  metastasize into something darker. In the last few years, political  violence…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698819/fifteenth-anniversary-of-arizona-mass-shooting"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…don't think that the electoral process works efficaciously-- effectively, if you will, for them. I was saying efficaciously, but  let's just say effectively for them. The Governor of my State, while I  am in trial currently defending the Ninth Congressional District--I  have been in trial for many years, so this is nothing unusual to defend  this district,…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…protecting illegal immigrants  and violent individuals over U.S. citizens.''\n\nThat is just defamation of the law enforcement officials in  California. It is defamation against the Governor of California, the  mayor of Los Angeles, the sheriff in Los Angeles County, the chief of  police in L.A., all of whom fought to put that violence down when riots  broke out,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…assaulted by Federal agents, and his larger  story of how his family built something of themselves in this country  is inspiring and admirable. I thank Senator Padilla.\n\nI thank Governor Spanberger as well, and I thank all Democrats who  will spend time tonight correcting the lies that will waft out of the  House Chamber from Donald Trump's mouth tonight.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700178/state-of-the-union-address"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…paycheck, they would know how devastating  these cuts are.\n\nIn Massachusetts, we are crafting a plan to prevent families from  going hungry amid these reckless Federal cuts. Governor Maura Healey,  her administration, and local advocates are forming the Anti-Hunger  Task Force to adopt long-term solutions to support families in  Massachusetts and work…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694156/impacts-of-the-big-ugly-bill-on-massachusetts"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…I rise in opposition to this extremely partisan  resolution that seeks to legitimize President Trump's baseless attacks  on Los Angeles and our elected leaders, including Governor Newsom and  Mayor Bass.\n\nThis administration's mass ICE raids by masked agents who will not  identify themselves have trampled on our rights and left our community  shaken…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693142/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…will get the assist from the Federal  Government over the course of the next 3\\1/2\\ years.\n\nI want to acknowledge that it was former President Ronald Reagan,  when he was Governor of California, who first created the California  Air Resources Board. And 3 years later, it was Republican President  Nixon who signed amendments to the Clean Air Act into…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Speaker, today, I introduce the District of Columbia  Government Title Equality Act. This bill would amend the District of  Columbia Home Rule Act to redesignate the Mayor as the Governor, the  Council as the Legislative Assembly, the Councilmembers as  Representatives and the Chair of the Council as the Speaker. The new  titles are the ones used in the State…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696437/introduction-of-the-district-of-columbia-government-title-equality-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…it is that same faith that  leads me here. It is that same faith that led my father to break down  those color barriers at an institution where just a few years before a  Governor stood and declared that segregation today, segregation  tomorrow, and segregation forever. It is that same faith that led him  to apply to that law school where just a few…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…hold power, when you are  in the majority, you meet people. You pull them in. You don't tell  folks: You know where my office is.\n\nYou all have heard me talk about the late Governor Bruce King, cattle  farmer out of New Mexico. He used to tell us: When people can't figure  out what is going on, you lock them up in a barn, and you don't let  them out until…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…constituents. No, no. It is for their own  personal bank accounts.\n\nWhy should a United States Senator or any party get a special right  that nobody else has? No State legislator, no Governor, no judge, and  no citizen in the entire country has this right, but we are creating it  for a handful of Republican Senators. It is immoral. I say it is  unconstitutional.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…National Environmental Policy Act,  the Clean Air Act of 1970, the Endangered Species Act, and the creation  of the EPA.\n\nYes, folks watching at home, Republicans did that.\n\nAs Governor, Ronald Reagan established the California Air Resources  Board, committing California to a comprehensive, statewide approach to  aggressively address air pollution in California.…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…President James Madison and several members of his  Cabinet to safety during the British burning of the White House years  earlier during the War of 1812.\n\nFormer Maryland Governor Samuel Sprigg purchased the property for his  daughter and nephew William Thomas Carroll, Clerk of the Supreme Court  and member of the prominent Carroll family. William Thomas…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692065/recognizing-the-dacor-bacon-house-bicentennial-day"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…is a reason why California is the fourth largest  economy in the world and has three times the amount of patents than any  other State, that State being Texas.\n\nRepublican Governor Ronald Reagan signed into law the creation of the  California State Air Resources Board and Republican President Richard  Nixon signed into law the California Clean Air Act.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690385/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…taxes, deepest potholes? It is a stark  illustration of our State government's utter inability to provide  effective services to our citizens.\n\nMr. Speaker, I am calling on Governor Newsom and the State  legislature to take immediate action to prevent Californians from  having to pay over $8 a gallon for gas by the end of next year. We need  immediate…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…and protect individual liberty, or do we  centralize control over payments in the hands of the Federal  Government?\n\nMr. Speaker, the choice is clear to me. Federal Reserve Governor  Christopher Waller has repeatedly warned that a CBDC is ``a solution in  search of a problem.'' Nonetheless, Mr. Speaker, in 2022, in his  executive order on Responsible…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693734/anti-cbdc-surveillance-state-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Ohio  National Guard. During General Harris's career in the Ohio National  Guard, he held a wide range of leadership positions, culminating in  service as a key member of Governor DeWine's cabinet. Governor DeWine  announced General Harris's retirement and nomination to be the next  director of the Ohio Department of Veterans Affairs.\n\nGeneral Harris…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691689/special-recognition-of-major-general-john-c-harris-jr-upon-his-retirement-as-adjutant-general-of-the-ohio-national-guard"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "Mr. STUTZMAN. Mr. Speaker, President Trump, Indiana Governor Braun,  and House Republicans in our first 100 days have worked in unison to  make our communities safer, citizens healthier, and country wealthier.\n\nIt has started at the…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690592/first-100-days-are-just-the-beginning"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…situation under  control; we all saw otherwise on our television sets. The LAPD chief  himself said that every person in Los Angeles should be disgusted by  what occurred.\n\nThe Governor has, himself, in the past, recognized the virtue of  using the National Guard when you had situations that required  reinforcement.\n\nThis notion that somehow the President…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, this last week, a local  newspaper published a letter to the editor claiming that by fighting  against Governor Newsom's policies, I was not serving my constituents.\n\nI very strongly disagree with that statement.\n\nThe fact is that we have a Governor whose policies have turned the  greatest…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "French Hill", "party": "Republican", "sentence": "…2025. President  Arrington has worked at the authority since 2014 and was previously the  vice president of homeownership and public finance.\n\nThe ADFA was established by then-Governor Clinton in 1985 to promote  economic growth and community development across Arkansas.\n\nPresident Arrington is a former municipal securities principal with  over 25 years…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699816/congratulating-robert-arrington"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…August of  2022. Their visa expired in February of 2023, and my home State of  Colorado issued them a driver's license in July of 2024.\n\nMr. Speaker, Colorado lawmakers and our Governor gave him a sanctuary  pass. This tragedy could have been avoided. He also was blocked from  buying a gun in 2024, and the Biden FBI and the Polis Colorado Bureau  of Investigation…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691724/boulder-terrorist-attack"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…The attack in Boulder, Colorado, is the most recent incident  following the murder of two Israeli Embassy staff members in  Washington, D.C., and the attack on Pennsylvania Governor Josh Shapiro  and his family, as we previously heard.\n\nThis growing trend of politically and religiously motivated violence  directed at Jewish individuals and institutions…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692174/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…the Miami  Downtown Development Authority and numerous civic and legal  organizations.\n\nHer dedication to education and public policy began early, with an  appointment by Governor Jeb Bush and her successful advocacy for the  establishment of a public law school at Florida International  University.\n\nThroughout her career, Ms. Tapanes has earned prestigious…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690947/congratulating-melissa-tapanes"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…last 6 or so years, Californians have been paying an extra  fee on their phone service. This was due to legislation enacted by the  legislature and signed into law by the Governor. All of these fees were  collected for the purpose of creating a next-generation 911 system,  which, honestly, is something we need. The system is quite outdated,  antiquated,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "Ms. BOEBERT. Mr. Speaker, I thank Chairman Comer and the free State  of Florida's next Governor, Byron Donalds, for introducing this bill.\n\nMr. Speaker, I rise in support of H.R. 4922, the D.C. CRIMES Act,  which is sponsored by Congressman Donalds. This critical legislation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695562/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Jacksonville's own Tony Boselli.\n\nNow there is another Floridian, Mr. Speaker, who has rightfully  earned her place in the Florida Veterans Hall of Fame. I am talking  about Lieutenant Governor Jennifer Carroll.\n\nLieutenant Governor Carroll's journey began in the United States Navy  as a jet mechanic, one of the very first African-American females to  serve in that…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688147/recognizing-florida-lieutenant-governor-jennifer-carroll"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…government function.  You can't just obey the laws you like.\n\nIt is the same thing here--and every liberal clapped when I did that.  It is the same thing here. If you have got a Governor or a mayor who  will not turn over a criminal illegal immigrant, as required by Federal  law, they should go to jail.\n\nI want a vote. I want a debate. I am not going to let…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…headquarters for the Character Counts  organization is located in my home State. The Robert D. and Billie Ray  Center is located at Drake University.\n\nBy the way, Bob Ray was Iowa's Governor for 14 years. So the location  in Des Moines makes perfect sense to me because Iowa's values align  with the six pillars of character promoted by the national Character  Counts…", "date": "2025-10-20", "source_url": "https://justfacts.votesmart.org/public-statement/1696289/national-character-counts-week"}]