[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…violate the Constitution with  impunity in these cases, then it can do so anywhere to anyone.\n\nTo the Americans listening at home, I ask you: How would you feel if  masked men grabbed you in broad daylight and refused to show their ID?  I know I would be terrified, and I bet you would be, too.\n\nToday, we will hear from a number of my Congressional Progressive…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…as if we are one of the  thug nations of the world ourselves.\n\nSaddam Hussein's Iraq seized Kuwait. Vladimir Putin's Russia launched  war to take over Ukraine. Adolf Hitler grabbed Poland and  Czechoslovakia and, for a while, all of continental Europe. Mussolini  took Ethiopia, and Chairman Xi has long coveted Taiwan. Each presented  their flimsy reasons…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698929/greenland"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…scenarios that I was lucky enough to have health insurance  to cover, but a lot of people don't.\n\nThe first was when my son was almost 3 years old, and in the blink of  an eye he grabbed my curling iron and burned his hand. We were in a  rural community in Virginia whose hospital didn't have a burn unit. It  was very small. They couldn't even figure out what…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…repeatedly and killed because they were exercising  their Second Amendment right and being present in their First Amendment  right with freedom of speech.\n\nAnd then imagine being grabbed off the street and taken to a  detention facility without your family or a lawyer knowing where you  are.\n\nEvery one of these things has happened in Minneapolis in the past…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…came  here legally. He has no criminal record.\n\nThere is the case of Merwil Gutierrez, who--you guessed it--came here  legally. No criminal record. In fact, he was apparently grabbed by  mistake. One officer reportedly said: No, he is not the one. And  another said: Take him away anyway.\n\nTrump sent them all to a maximum security prison in El Salvador…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…knew about Dr. King and  attended his church. They were angry. If they had guns, they brought  those. If they had weapons, they brought those. If they didn't have  that, they grabbed a shovel or whatever they could get their hands on  and went to the house because they were ready to seek revenge, but Dr.  King said: That is not our way.\n\nThe Christian…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699200/building-a-beloved-community"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…annual  fee. If he did that, he wouldn't have insurance if an accident  happened. Accidents happen.\n\nI remember one such accident when my son, just before his third  birthday, grabbed my curling iron and burned his hand. This was a  Saturday. After a trip to the emergency room--we were in a rural county  that didn't have a burn unit--they said: Well, you…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Greg Casar", "party": "Democrat", "sentence": "…Washington by a  source and confirmed by a second source familiar with the  investigation, said that the 27-year-old woman accused her significant  other for over a year of having grabbed her, shoved her, and pushed her  out of the door, and also said that the woman involved showed the  officer ``bruises on her arm which appeared fresh'';\n\nWhereas, NBC4 Washington…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695580/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…December 5, tragedy  struck. The Gomez family woke up to the smell of smoke.\n\nOtoniel jumped out of a second-story window to escape the fire. Then,  without missing a beat, he grabbed ladders to help his wife and  children climb to safety.\n\nThanks to his bravery and quick thinking, the entire Gomez family,  including their dog, Lyka, escaped without injury.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699624/9999"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…they rallied from a 14-point deficit to win the State title.\n\nLeading the way was Senior Guard Jaida Civil, a University of  Tennessee commit and McDonald's All American, who grabbed 9 rebounds  and scored 20 points.\n\nThe entire team made critical contributions, showing their depth and  the unity of this team. The championship caps off a season where the…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689242/recognizing-palm-bay-pirates-girls-basketball-team"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…hometown in Janesville,  Wisconsin, the other day and I went to buy a six-pack of beer. I walked  in and the gentlewoman at the desk said: Bryan, good to see you. I went  back, grabbed a six-pack of beer, came up, and she said: Bryan, I need  to see your ID. I pulled out my ID and handed it to her. She reviewed  it. She allowed me to purchase a six-pack…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…off.\n\nOkay. For anyone that keeps telling you that, this is what you call a  variance report. CBO puts it out every year. I know every staffer and  every Member of Congress grabbed it in January and actually read the  data.\n\nIf you look at the calculations--and I didn't actually bring one of  the boards, which probably is good because it was really obnoxious.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…It is good to see you.\n\nI set my six-pack of beer on the counter, and she said: Bryan, I need  to see your ID.\n\nSo just like every American, what did I do?\n\nI reached in, I grabbed my wallet, I pulled out my ID, and I handed  it over to the clerk.\n\nIn my opinion, I think it is absolutely nuts that we protect our beer  more than we protect our ballots…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692319/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Government but many State  and local governments as well.\n\nThe calls that are coming into our office and the emails that we are  getting show that this is an issue that has really grabbed the  attention of Tennesseans. I think that one of the reasons is that  people have seen fraud play out in their local communities. They have  seen title theft, where forgers…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699102/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Over the last 12 months. If you do just  fiscal year, it is higher.\n\nA few hours ago, the CBO put out a report. Look, the report is  actually like this. I just cheated. I just grabbed the executive  summary because I didn't need the whole binder out here.\n\nIt is going to take me 3 days or 4 days to read through everything,  but I have some of the highlights…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…Washington by a  source and confirmed by a second source familiar with the investigation  said that the 27-year-old woman accused her significant other for over  a year of having grabbed her, shoved her, and pushed her out the door,  and also said that the woman involved showed the officer bruises on her  arm which appeared fresh;\n\nWhereas NBC4 Washington…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697012/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…constituents,  are screaming at us for more spending. Don't they have kids? Don't they  even care about their own retirements? It is the absolute vacuousness  of immortality.\n\nI grabbed this from The Wall Street Journal. I can't imagine anyone  here has had protesters and people showing up in their office about  Medicaid, which is supposed to be our safety…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…country that needs to  borrow about $6 billion a day, we borrow about $6 billion a day, what  happens in a world where you actually--the liquidity of the debt  markets.\n\nI grabbed an article that was in one of my--I think it was in one of  my bond publications because I have some weird reading habits. ``Japan  prepared to use its role as America's largest…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…led the  opposition to its creation and was opposed by the California Democratic  Party.\n\nNothing could justify what is happening in California right now.  However, they have grabbed on to whatever pretext they can in order to  move forward with returning us and moving us backwards as a State to  the era of partisan gerrymandering.\n\nThe problem for Newsom…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}]