[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…cares, In every word of hope and faith, we find you       standing there.\n\nRest now in peace, dear Jane Goodall, in earth you loved       and knew, You showed us how to live with grace, with courage       strong and true. And when the wind sings through the Gombe       trees, chimps call at dawn, Remembering one who loved them--      Though she's gone, her…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696844/the-ballad-of-jane-goodall"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…the desires and character of the  American people.\n\nThis effort put forward by a bunch of people who haven't served on  that committee and who have no idea the comity and the grace with which  that committee serves, you, sirs, will hurt this committee badly.\n\nI expect every Republican on the Permanent Select Committee on  Intelligence--and I will say…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696894/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…honor of Jewish American  Heritage Month to pay tribute to a remarkable spiritual leader and  community advocate from Rochester, NY: Rabbi Alan Katz.\n\nRabbi Katz served with grace and wisdom as the rabbi of Temple Sinai  from 1986 to 2020, and now holds the distinguished title of Rabbi  Emeritus. Throughout his decades of service, Rabbi Katz has been…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691618/recognizing-rabbi-alan-katz"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…the following outstanding  young women:\n\nElizabeth Babcock, Troop 3230\n\nKrystina Bell, Juliette\n\nHaley Brieler, Troop 3281\n\nGracyn Burke, Troop 3778\n\nSophia Byrne, Troop 1964\n\nGrace Doherty, Juliette\n\nKaitlyn Emerson, Juliette\n\nEmily Etter, Troop 204\n\nGrace Fadlovich, Troop 4404\n\nMeghana Hebbar, Juliette\n\nLillian Henroid, Troop 3281\n\nLydia Hines, Troop…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694102/recognizing-gold-award-girl-scouts-from-eastern-missouri"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…fostering job creation for local residents. Even amidst  significant health challenges, he remained dedicated to sharing God's  goodness, writing, preaching, and singing about His grace. He authored  two impactful books, ``Freedom in Worship'' and ``Stuck in A Rut,'' and  expanded his ministry globally through TBN and various national and  local media outlets.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Virginia after competing at the State level and then  spending 3 days here in the D.C. metro area at the finals answering  tough questions with confidence, intelligence, and grace.\n\nBoth teams showed deep knowledge of constitutional law and U.S.  history, and this year we saw something amazing. The average team size  is 21 students, but the Sprague team…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691209/supporting-the-womens-bureau-at-the-department-of-labor"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…ask my colleagues to join me in honoring Mission  Mississippi of Leflore County for their vital work in uplifting their  community, challenging stereotypes, and leading with grace and love.  Their efforts remind us that reconciliation is possible--one  conversation, one relationship, and one act of compassion at a time.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692273/recognizing-mission-mississippi-of-leflore-county-for-its-commitment-to-racial-reconciliation-and-community-unity"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…House and the Senate: I have never, to my knowledge--never--voted  against disaster assistance for people in other States than my home  State of Illinois. There, but for the grace of God, go my people that I  represent. And I would hope that the Senate and the House would stand  together, Democrats and Republicans, and say we are going to be there  for…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693273/central-texas-floods"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…constituents from Oak Park, Illinois  as she prepares to celebrate her 100th birthday on February 11, 2026.  Reaching the age of ``five score'' is a testament to a century of  grace, wisdom, endurance and love. That said, on behalf of the 7th  District of Illinois, I congratulate and commend Mrs. Pough on this  incredible milestone.\n\nBorn in rural Mississippi…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699343/recognizing-mrs-essie-pough"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…thinking about how expensive those hospital bills may be. All you are  hoping is that you can get to see a medical professional who might be  able to save your life. By the grace of God, by the love of my family,  Senator Merkley, I am here. I am alive today. I healed, and it is quite  miraculous, but a big part of that was because I was fortunate enough…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…devastating to listen to the other side  talking about how we somehow were not supposed to be told when boots  went on the ground before. Somehow, we were lucky enough, by God's  grace, that  nothing bad happened to the men and women in the service of our Nation.  Yet they actually were injured, seven of them.\n\nThe U.S. military is being used against Venezuela…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699370/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…been a  good and blessed day because our day was opened with a prayer by  Reverend Dr. Lindsay Curtis.\n\nDr. Curtis is well into his second decade leading as senior pastor at  Grace Baptist Church, a 129-year-old faith community in the center of  my district, Norwalk, Connecticut.\n\nThe church has thrived under Pastor Curtis' leadership, and I admire  him…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693739/welcoming-reverend-dr-lindsay-curtis"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…rejected.\n\nThere are Members and former Members of this body right here in  Congress who have been arrested and convicted of a DUI, and I would  just ask that the charity and the grace that we extend for second  chances to those people would extend also to those green card holders,  including those who have been here for decades. Let's just give a judge…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693080/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Jake Auchincloss", "party": "Democrat", "sentence": "…what they tear apart      Like a quilt of borrowed time,      With midnight shifts and morning prayers,      Hands that hold when budgets say let go.      Here, in this web of grace we weave,      Because what flows through us is stronger      Than their ledgers and our stubborn refusal      To let spreadsheets tell us what a life is worth.\n\nAgain, this…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690834/advocating-against-medicaid-cuts"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…Center in Mount Laurel.\n\nLong before the spotlight, she was on the ice before sunrise,  balancing schoolwork, family time, and relentless practice with  remarkable discipline and grace.\n\nThis month, Isabeau achieved a lifelong dream. After earning a bronze  medal at the U.S. Figure Skating Championships in St. Louis, she  officially qualified for Team USA…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699250/congratulating-isabeau-levito"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…trustees at Troy University, demonstrating  that age is no barrier to leadership, commitment, or purpose.\n\nMr. Speaker, Roy Drinkard is a living example of American grit and  grace. My wife, Caroline, and I are proud to call him our friend. I ask  my colleagues to join me in wishing Mr. Drinkard a very happy 105th  birthday and in thanking him for a lifetime…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693675/happy-105th-birthday-to-roy-drinkard"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…support legislation that protects the defenseless  unborn and can stand up for their God-given right to survive, a gift  that truly should only be endowed upon any of us by the grace of our  creator.\n\nIt is truly inspiring to witness the multitudes of Americans who  journey from far distances across this great country to attend the  march.\n\nIn my role in…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699378/march-for-life"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…them. We lost more than firefighters. We lost  role models.\n\nEngineer David Tysdal was also critically injured in the attack. He  has now endured three major surgeries. By God's grace, he is steadily  recovering. If he is listening today, we encourage David to stay  strong. He carries the prayers of gratitude of a nation with him.\n\nMr. Speaker, this violence…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693542/congratulating-larry-haskell-on-his-retirement"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…short years if we don't act now to save our country and our  way of life.\n\nI achieved the highest honor of my life this year, receiving the  title of ``grandfather'' to Rosie Grace, my first granddaughter. I want  her to grow up in the same America that I had the opportunity and  privilege to grow up in. If we don't stand up now, our grandchildren's…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…when the days were long. She understood that public service  isn't about credit. It is about responsibility. She carried that  responsibility with integrity, discipline, and grace.\n\nAs chief of staff, she did far more than manage schedules and  operations. She shaped culture. She built a team that worked hard,  treated people with respect, and never…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699672/recognizing-christine-lee"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…partners, the power of the purse is, once again, being  exercised by lawmakers through the committee process, as Article I  intended.\n\nTo their accompanying ranking members, Grace Meng, Chellie Pingree,  and Marcy Kaptur, I thank them for their partnership and collaboration,  which was instrumental to this effort.\n\nAs I look ahead to today's action,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698749/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…of excellence, and his contributions have strengthened the foundation  of our military and its future.\n\nI also want to extend my deepest gratitude to his children--Sarah,  Grace, Naomi, Camille, and Nate--for their unwavering support  throughout his career. The sacrifices made by military families are  profound, and their strength and resilience are…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696046/recognizing-mr-stephen-d-austin-assistant-chief-of-us-army-reserve"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…embraced her calling as a pastor's wife. Together, she  and Charles raised six children. She served faithfully in teaching,  serving, and leading the women of the church with grace and devotion.  Guided by an unwavering faith, she made it her mission to instill Godly  values in her children and to encourage them to accept Christ at an  early age. Her…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697547/recognizing-sylvia-marie-thornton-on-her-98th-birthday"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…lives of so many.\n\nMia brought passion, energy, and an unwavering commitment to the  people of Utah's Fourth District, a district that I am now proud to  serve. She led with grace and conviction, never backing down from a  challenge, and always striving to make a difference for those she  served. It is for me a profound honor to follow in her footsteps.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689230/moment-of-silence-in-remembrance-of-the-honorable-mia-love"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…there. They  kidnapped her. They tied up her husband, took the woman and the child  at gunpoint, demanded a ransom of $1 million, and then dumped them in  the woods.\n\nBy the grace of God and the swift action of the FBI, Garner police,  and the North Carolina State Bureau of Investigation, they were  rescued.\n\nThat crime never should have happened. Estrada-Hernandez…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…longevity, but also to unwavering  character. Throughout her ten decades of life, Helen has remained  deeply committed to her faith and her family, living each day with  purpose, grace, and quiet strength.\n\nHelen graduated from Trenton High School, in Trenton, New Jersey.  Later, she made her home and spent much of her life in Ewing, New  Jersey after marrying…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694743/recognizing-helen-birkheads-100th-birthday"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…cattle, and presented oral  justifications for their decisions. The Manor FFA team earned an  overall silver ranking. Katie Charles received a gold ranking, Jayden  Buck and Grace Shaielby received silver, and Lillian Walborn received  bronze.\n\nThe Manor FFA entered the 98th National Convention FFA with accolades  and left with even more. Through their…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697257/congratulating-the-manor-future-farmers-of-america"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Schumacher, Joshua: World Magazine;       Schwartz, Felicia: Politico; Schwartz, Matthew: Bloomberg       Industry Group; Seddiq, Oma: Bloomberg Industry Group;       Segers, Grace: New Republic; Seiden, Daniel: Bloomberg       Industry Group; Sermeno, Jose: Kiplinger Washington Editors;       Serrano-Roman, Angelica: Bloomberg Industry Group; Shane,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698171/members-entitled-to-admission-to-the-119th-congress-periodical-press-gallery"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…department, and Sergeant  Chaney helps lead the Downtown Area Response Team and the Homeless  Outreach Team, where he serves our vulnerable population with  compassion and with grace.\n\nSergeant Chaney has also served as Santa Claus for the Toys for Tots  program. He is part of the honor guard, and he is an active participant  in the Cadet Explorers program.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691305/recognizing-sergeant-olav-chaney"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…directly to targeted areas of need throughout the  community, ensuring that no one is left behind. They also host a large- scale monthly food distribution event in partnership with Grace World  Outreach Church through their Compassion Food Outreach program-- providing generous bags of groceries to hundreds of families. The  outreach doesn't stop at food. The…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691893/recognizing-shawn-woodruff"}]