[{"senator": "Lou Correa", "party": "Democrat", "sentence": "Mr. CORREA. Madam Speaker, I rise today to highlight my young  neighbor, Kendall Pierson, who just graduated summa cum laude, which  means really good grades, from Mater Dei High School in Santa Ana.\n\nKendall was a member of the National Honor Society, the California  Scholarship Foundation, and the National Art Honor Society. She…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693460/congratulating-kendall-pierson"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…offers an accelerated program, called the  Academic Center, for seventh and eighth graders. Admission is based on  entrance exams, standardized tests, and elementary school grades. The  school has a strong focus on developing well-rounded individuals with a  variety of performing  and fine arts programs alongside academic preparation.\n\nThe school is…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692107/in-honor-of-charles-rangel"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…Multimodal System for Intelligent Sensory Feedback through  Artificial Intelligence.'' The Washington State Science and Engineering  Fair aims to advance the studies of STEM in grades 1-12 through the  State of Washington. They work to provide opportunities for students to  display their projects and provide support and guidance for the  operation of science…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693893/recognizing-anusha-arora-for-scientific-excellence"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…something to be able to get into that school and  graduate.\n\nI have talked to young people who don't know if there will be any  money for them if they get in, even with the grades. I have talked to  young people who are getting ready to graduate and don't know if there  will be a job for them. And I have talked to young people who were  excited about…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…classes, which would be full-day and run throughout the entire  school year, would be taught by teachers who have equivalent or similar  qualifications to those teaching other grades in the school. The funds  would supplement, not supplant, other federal funds for early childhood  education.\n\nThe success of Head Start and other prekindergarten programs,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695812/introduction-of-the-universal-prekindergarten-and-early-childhood-education-act-of-2025"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…States--to think that that makes sense. Of course it does.\n\nIn 2023, a study of Michigan students found that a student without  access to home internet earned significantly lower grades--actually,  0.6 lower on the 4.0 scale--than their connected classmates. Not  because they weren't as intelligent. Not because they wouldn't have  learned equally well on their…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…farmers and for the rest of the agricultural supply chain.\n\nThe inspections provided by the Federal Grain Inspection Service  define and classify grains, as well as assign grades to specify weight  and quality requirements.\n\nThese inspections provide a gold standard assurance backed by the  U.S. Federal Government to both grain buyers and grain sellers.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695052/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…to advance the  educational opportunities for all children, especially children of  color on the south side of Mount Vernon and elsewhere.\n\nThis school serves all students grades K-8 with free breakfast and  lunch. They place a strong emphasis on core subjects, notably English  and math, foreign languages, enrichment classes, ELL, special ed  services,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696952/amani-public-charter-school"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…one of  the only sources of children's educational television that is still  accessible to every child for free.\n\nStudies show that kids who grow up watching PBS get better grades,  read more, are better at expressing their feelings, and have better  educational outcomes. Educational television, when it is high quality,  works.\n\nI have two young kids…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692007/cuts-to-public-broadcasting"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…succeed.\n\nMy favorite teacher was Rayella B. Heely, who taught my eighth grade  algebra class in Mount Vernon, New York, in 1966. She was tough, and  she did not give out easy grades. I did not get a particularly good  grade, but she taught me concepts that I remember to this day.\n\nTeachers are increasingly asked to do more in addition to teaching.  They…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690736/to-teach-is-to-touch-a-life-forever"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…divide is called  the homework gap. It is a fundamental question of equity and fairness  to close that gap. Studies have shown that without broadband at home,  people earn lower grades than their connected classmates--no secret as  to why. It is a resource that enables better learning and more  achievement. That learning loss sets them back in career prospects…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690726/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…Language Arts and Mathematics.\n\nAmong the most notable improvements were a 15 percent increase in  Algebra 1 proficiency, a 7 percent increase in English Language Arts  for grades 9 and 10, a 4 percent overall increase in English Language  Arts scores, and a 4 percent improvement in Civics end-of-course exam  performance. Additionally, the district proudly…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694185/recognizing-lake-county-schools-on-earning-an-a-rating-from-the-florida-department-of-education"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…started that day, at 7:55. She texted him, the sex offender, the  predator on the children she says she protects. They had comments like  he told Ms. Plaskett to  talk about his grades. He mentioned that she had a great-looking  outfit. This is from Mr. Epstein.\n\nAt 10:40, a broadcast feed cut to Ms. Plaskett, showing her moving  her mouth as if she was chewing…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696890/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…teachers, administrators, and the entire workforce, and it remains a  source of pride for our community.\n\nIn 2025, 99 percent of Miami-Dade County Public Schools earned school  grades of A, B, or C, and the district achieved a record-breaking  graduation rate of 95.2 percent.\n\nMiami-Dade also received the prestigious 2024 Cognia School/Systems  of Distinction…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696910/congratulating-st-theresa-catholic-school"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…the Secretary. The       Inspector General of the Coast Guard shall be detailed from       officers on the active-duty list in the line of the Coast       Guard serving in grades above captain. An officer may not be       detailed to such position for a tour of duty of more than 4       years, except that the Secretary of the Coast Guard may       extend…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Mountain  High School and the other at Jersey Shore High School. It awards annual  scholarships to Key Club members at both schools.\n\nThe club recently started a Bringing Up Grades, or BUG, program at  the Robb Elementary School in Lock Haven. It also partners with Sleep  in Heavenly Peace to build and deliver beds to children and youth who  do not have…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698269/recognizing-lock-haven-kiwanis-club-on-centennial-anniversary"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…organized by the Special  Olympics. Each team has a proportional number of athletes who are  eligible to participate in the Special Olympics and includes boys and  girls from grades 9 to 12.\n\nAs Manheim Township celebrates another Unified Track and Field team  championship, I sincerely congratulate the athletes and coaches that  have made this accomplishment…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691919/congratulating-the-manheim-township-unified-track-and-field-team-champions"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…considered an A under this grading for equity initiative.\n\nBy the way, there would be no grading on anything--not homework, not  attendance, not midterms, or anything like that. Grades wouldn't be  given at all. The only thing that would actually matter for grades is a  final exam. Even then, a student would get to keep retaking it until  the student got…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…tenure, Lake County Schools have also seen  notable increases in proficiency, including 15 percentage points in  algebra 1 and 7 percentage points in English language arts for grades 9  and 10.\n\nMr. Speaker, Ms. Kornegay is committed to serving her community and  ensuring academic excellence for her students. Lake County is fortunate  to have such an excellent…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697751/recognizing-lady-lake-florida"}]