[{"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…Rockhurst High School,  before attending the University of Missouri-Columbia, where he would  graduate with honors in 1980 with a bachelor's degree in journalism.  Following graduation, Gerard briefly enjoyed working as a reporter for  the Kansas City Labor Beacon, before joining the staff of U.S. Senator  Thomas F. Eagleton. As the Senator's staff assistant,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688302/recognizing-mr-gerard-j-grimaldi-on-his-retirement-and-expressing-appreciation-for-a-lifetime-of-dedicated-service-to-our-community"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…including higher test scores,  more compassion for others, and fewer disciplinary problems. It also  keeps students interested in school, improves attendance, and increases  graduation rates.\n\nArts education benefits every student, even in preschool. A recent  study shows that students in an arts-integrated preschool show three  times the growth in vocabulary…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695492/national-arts-in-education-week-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…for her contributions to our Nation.\n\nA native Washingtonian, Ms. Manatt graduated from the University of  California, Berkeley, where she studied political economy. After  graduation, she returned to the District of Columbia to begin her  career in public policy and international affairs.\n\nMs. Manatt served as a professional staff member on the House…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695835/recognizing-michele-manatt-for-her-service-to-the-george-washington-university-graduate-school-of-political-management"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…a life of service to his community. He was born on  April 4, 1950, in Hue, Vietnam, and in 1968, he graduated valedictorian  from Hue National High School. Following his graduation, he attended  medical  school in Saigon. While in medical school, he founded and became  President of the Association of Hue Students, eager to connect with  others from…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691324/recognizing-dr-huu-vo"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…fought to ensure family farmers have a strong farm safety net. I look  forward to our continued collaboration to pass a bipartisan farm bill.\n\nI congratulate Linda on her graduation and thank her for her service  to our community.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690447/congratulating-linda-larson-on-her-graduation-from-inver-hills-community-college"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Shabazz decided to join the Fairfax County Sheriff's  Office in March of 1994 after taking a tour of the Adult Detention  Center (ADC) and liking what he saw.\n\nSince his graduation from the Fairfax County Criminal Justice  Academy, he has spent the majority of his career in the ADC but has  served with distinction in all areas of the agency, including…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696033/recognizing-lieutenant-colonel-jabar-shabazz-on-his-retirement-from-the-fairfax-county-sheriffs-office"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…behaviors improved, and test scores went up, too. That  was no surprise because research has proven time and time again that  kids who receive SNAP benefits in school have higher graduation rates.  Access to healthy foods helps develop memory, social skills, and  emotional stability. All of these are critical to academic success.\n\nA quality education is the…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691770/151-days-without-a-vote-to-lower-costs"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…the judges really put it best. I want to read this and quote  it to you:\n\nI've got two experienced immigration lawyers on behalf of a       client who is months away from graduation, who has done       nothing wrong, who has been terminated from a system that you       all keep telling me has no effect on his immigration status,       although that clearly…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…Dimas High School, where he played on the golf team  and was a CIF Southern Section finalist 2 years in a row. He went on to  play for San Diego State University, and after graduation he went  professional.\n\nOn the morning of Sunday, June 15, Father's Day, J.J. woke up early  to tend to his daughter who wasn't feeling well. Just a few hours  later, he…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692888/congratulating-jj-spaun"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…shooting,  every time someone is shot going to the grocery store, playing in a  park, going to the movie theater, turning in the wrong driveway,  showing up at school after graduation, on and on, every time it  happens, my son and my daughter look at me, and they ask: Am I next?\n\nDo you know how difficult that is, Mr. Speaker? Do you know how hard  it…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…Speaker, I rise today in strong opposition to the  Trump administration's abrupt, unjustified attempt to close Job Corps  centers nationwide.\n\nI have been to the Job Corps graduation on Maui. I have looked into  the eyes of students whose lives were changed. I have walked the  grounds of the Waimanalo campus where young people, many of whom had  nowhere…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692031/opposition-to-job-corps-closures"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…community in Malden. I am very proud of my two children.       My oldest is 19 years old and is in the second year of       college. I would love to be able to go to his graduation. My       youngest is 13 and is in middle school in the Malden schools.\n\nLike nearly 15% of other TPS holders, I've started a       business, employing others and generating…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…5, 1923.\n\nShe moved to nearby Sewickley, Pennsylvania, in 1939, where she spent  the rest of her life. She was a 1940 graduate of Sewickley High School,  and shortly after graduation, she married and had two daughters who she  raised and nurtured.\n\nMany years later, in 1988, she retired from Point Park College, now  Point Park University, as the associate…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697614/mary-elizabeth-bettie-cole-post-office-building"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…required him to give up his team sport, losing       both his support group and his chance to compete in the       Division I level, but he continued with his final exams,       graduation, and plans to study engineering at the university.       With continued regular monitoring, he was able to attend       university, but the trauma of his diagnosis and the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Understanding       Student Parent Outcomes Act of 2025. This bill would make a       meaningful difference by allowing essential data collection       on the barriers to college graduation for pregnant and       parenting students. Legislation like this is necessary to       ensure that pregnant and parenting students can complete       their education and…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…History and Politics, which brought him to the University  of Dallas, where he received his bachelor's degree in history and a  master's degrees in American studies. Following graduation, Jeff moved  to Washington, D.C. and started his career in public service.\n\nThroughout his time in Washington, Jeff's distinguished career  included serving as a Special…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690377/recognizing-the-career-of-jeffery-ronald-billman"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…school in Fort Wayne,  Indiana, and number 15 in the State.\n\nCarroll has demonstrated their high standards through excellent  performance on State-required tests, a 95 percent graduation rate, and  exceeding expectations for college readiness.\n\nIn high school, students learn more than just math and chemistry  equations. Rather, students build their work ethic,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694841/recognizing-carroll-high-school"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…the 2K, 3K, and 5K.\n\nForbes magazine recently said of her: ``Is this Utah teenager the  best girls track athlete in history? She certainly looks the part.''\n\nJane's post-graduation plans include running for the BYU Cougars  women's track and field and cross-country teams during the upcoming  school year.\n\nI congratulate Jane and wish her good luck and…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692882/congratulating-jane-hedengren"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…served as president  since 2003, Wallace State has become a national model for excellence,  innovation, and service. Student outcomes far exceed national averages,  with graduation, persistence, transfer, and job placement rates among  the best in the country. The college generates more than $276 million  annually in economic impact and supports more…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695474/recognizing-wallace-state-community-college-and-its-president-dr-vicki-p-karolewics"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Lamar State College Orange with  passion, determination, and a hands-on approach. He rolled up his  sleeves every day to deliver real results, record-breaking enrollment  and graduation rates, new vocational programs, the opening of a  satellite campus, and the construction of important new academic  buildings.\n\nHe even helped launch a nationally successful…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694750/recognizing-the-retirement-of-dr-tom-johnson"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…satisfactorily complete all required       Coast Guard training and participate in monthly military       activities of the Program as required by the Commandant.\n\n``(C) Upon graduation from the college, university, or       institution of higher education described in subsection       (b)(5), the member shall--\n\n``(i) accept an appointment, if tendered,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…training to prepare  for her upcoming Fire detail and is a dedicated member of the Camp  Crew. Her passion for public service and emergency response will  continue after graduation, as she plans to pursue advanced training in  Fire and Rescue.\n\nJayden Coffey represents the very best of Arkansas' youth--resilient,  service-driven, and ready to lead.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692255/recognizing-ms-jayden-coffey"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…February. This award recognizes individuals or  couples who show leadership and have been successful in the beef  operation industry.\n\nGarrett has demonstrated this through his graduation from the Ohio  State University's animal science program and his work to effectively  use genetic and reproductive science on the farm. Garrett is a lifelong  cattleman.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690854/recognizing-garrett-stanfield"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…Washington,  Illinois.\n\nMayor Manier is a proud Washington native and graduated from  Washington Community High School in 1972. Gary attended Illinois  Central College and, upon graduation, started what would eventually  become a 42-year career at Caterpillar, Inc. until his retirement in  2015.\n\nBefore becoming Mayor of Washington, his career of public service…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689608/commending-mayor-gary-manier-for-24-years-of-service-to-central-illinois"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…2024.  During her time in college, Emily volunteered her time as a Court  Appointed Special Advocate in Lexington and served as an intern in my  Washington, D.C. office. Upon graduation, Emily began her career in  Washington, D.C. and joined my team to serve the constituents of  Kentucky's 2nd District as my Staff Assistant in the summer of 2024,  where…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693661/recognizing-emily-hale"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…6, 1942, in Samson,  Alabama, Bobby later moved to Florida, where we shared an alma mater,  Maynard Evans High School, and community, Pine Hills, Florida.  Following his graduation in 1961, Bobby began his lifetime service to  the Central Florida community.\n\nBobby first served as an area representative for the Communications  Workers of America for…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688335/in-memory-of-mr-bobby-beagles"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Sergeant, he was notified he'd  be attending the U.S. Army Sergeants Major Academy. It was there, in  January of 1990, he went back to Fort Bliss for six months of school.\n\nAfter graduation, he expected to be assigned to Korea since he had  never done a tour there, but instead, he was retained as faculty at  Fort Bliss for the next three years as a lesson writer…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694773/recognizing-the-contributions-of-charles-charlie-webb"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…incoming freshman at the University of Texas at Austin, where he will  study International Relations and Global Studies and participate in  their Army ROTC program. After graduation, Oliver plans to earn his  doctorate degree and serve as a Foreign Service Officer with the State  Department.\n\nI have requested the United States flag to be flown over our…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694160/recognizing-eagle-scout-oliver-royal"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…achievements. She met her late husband, Kevin Vance  MacGibbon, while they were classmates at the United States Military  Academy, and they married in October of 1981 after graduation.\n\nCaptain Kevin MacGibbon served as an infantry officer stationed in  Germany during the Cold War from 1980 to 1985, earning his Ranger tab  and Airborne wings.\n\nTogether,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696747/recognizing-veterans-in-texas-third-congressional-district"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…activities. She was a  member of the soccer, gymnastics, and women's hockey teams while also  participating in MTU Aquanauts and assisting in SCUBA instruction.\n\nFollowing her graduation in 1983, Ms. Prehoda was accepted into the  United States Marine Corps as an officer. After 10 years of active  duty, she was transferred to the reserves, where she served…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696846/recognizing-valerie-prehoda-on-her-induction-into-the-michigan-tech-president-council-of-alumnae"}]