[{"senator": "Sharice Davids", "party": "Democrat", "sentence": "…Ranking Member Craig,  and General Farm Commodities, Risk Management, and Credit Subcommittee  Chairman Scott for their leadership on this bipartisan bill.\n\nThe United States Grain Standards Reauthorization Act of 2025  strengthens the United States Department of Agriculture's ability to  improve grain grading technologies through flexibilities to pursue…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695052/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…costs have gone up in his brewery, in addition to the  anger for the Canadians not buying his beer. Tariffs have made it more  expensive for him to can his beer and buy the grain he needs to brew  his beautiful product.\n\nI have met scores of businesspeople like Thomas, some of whom have  gone out of business. A chocolatier who just loved making her…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698199/new-york"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…trading  partner. What is going on over there?\n\nUnneeded tariffs will cause prices to rise more on everything. Just  wait. Cars will go up $9,000 to $12,000 a vehicle. Costs of grain will  go up. The cost of road salt, potash, oil, gasoline will skyrocket  dangerously. Let me state plainly that 25 percent tariffs on Canada are  foolish.\n\nThe people and…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688376/tariffs-on-canada-are-foolish"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "Ms. CRAIG. Mr. Speaker, every summer, grains planted by hardworking  Minessotans cover around 40 percent of my district.\n\nU.S. grain standards are a key component of foreign trade and the  promotion of American agricultural exports. The inspections and  certifications done by the Federal Grain Inspection…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695053/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…children.\n\nThis program began 70 years ago, an idea from a Kansas farmer, and it  was launched by President Eisenhower. They called it Food for Peace,  and it sent American-grown grain to hungry people around the world. It  has enjoyed bipartisan support from Democrat and Republican Presidents  for 70 years.\n\nThis Republican Congress passed a funding bill…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693626/restore-funding-for-lifesaving-food-aid"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…cities--just to see what USAID was doing. I heard about it. I wanted to  see it. The most graphic example I can remember from that experience  was when they showed me a bag of some grain supplement, and on it was  written ``USAID from the people of the United States of America.'' What  they were doing with this was making a lunch for the children in the  village.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688339/usaid"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…agricultural commodities, but the inputs aren't stable. They are  getting more expensive.\n\nOne of the most significant inputs for any farmer of an agricultural  vegetable or grain product is fertilizer. One of the key ingredients in  fertilizer is potash, and about 80 percent of potash that goes into  fertilizer used by American farmers comes from Canada.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…forth geothermal power, and we are interested in  doing exactly that, particularly in manufacturing America.\n\nI am privileged to also represent a vast agricultural region in grain  drying. It is so expensive when we have to dry corn, soybeans, and so  forth. The agricultural community uses huge amounts of energy.\n\nLet's create new jobs. Let's lower the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…that would have helped them and their family budgets.\n\nThe President now has canceled major upgrades to the power grid out  of the bipartisan infrastructure law, such as the Grain Belt Express  transmission line.\n\nRepublican policies now--we are adding it up--have cost Americans  about 266 gigawatts of planned electricity generation projects in 2025…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698568/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…the food that feeds our families, our neighbors, our Nation,  and the world.\n\nAgriculture is the backbone of Delaware's economy. From poultry farms  to vegetable growers to grain producers, Delaware farmers feed families  here at home and around the globe and contribute to an industry that  supports thousands of jobs in Delaware.\n\nUnfortunately, since…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688191/protecting-agriculture-the-backbone-of-delawares-economy"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…19th  century, the town was established by Massachusetts Governor Caleb  Strong.\n\nThe rich soil supported prosperous farms and the fast-moving Sandy  River powered lumber and grain mills. In the years that followed,  Strong became a rural industrial powerhouse, including footwear,  furniture, textiles, and Maine's first cheese factory. By the mid-20th…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699397/225th-anniversary-of-the-town-of-strong"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Workforce Pell Grants.\n\nThe Whole Milk for Healthy Kids Act will soon be signed into law, and  the House approved both my Digital Asset Market Clarity Act of 2025 and  the U.S. Grain Standards Reauthorization Act of 2025.\n\nAt home, I was honored to nominate seven exceptional students to our  Nation's service academies, celebrated a talented young artist,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698682/recognizing-the-honorable-steny-hoyer"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…of the hands of children while preserving the hemp  industry for farmers. Industrial hemp and CBD will remain legal for  industrial applications--such as seed, stock, fiber, grain oil--or will  be used in drug trials. This language merely clarifies the original  intent of the 2018 farm bill, rooting out the bad actors and protecting  the growing hemp…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696662/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Affairs  Committee that you know what you are talking about when you talk about  tariffs.\n\nThere are not Canada beef tariffs, not Canada potash tariffs or dairy  or food or grain or fertilizer. The list goes on and on. They mentioned  coffee I don't know how many times.\n\nThe only things that there are tariffs on are things that are coming  in from third-party…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699965/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…As you go up the triangle, these are the more healthy foods.\n\nThis is real simple. Down in the bottom of this, it looks like we  have whole grains. We have oatmeal and whole grain wheat from Kansas to  make bread. Then I believe this is rice and beans and nuts and  bananas--more nuts, seafood, butter. Butter is another one of those  full-fat foods derived…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I move to suspend the  rules and pass the bill (H.R. 4550) to reauthorize the United States  Grain Standards Act, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 4550\n\nBe it enacted…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…refined right  here in the United States, often in towns and communities where  agriculture is the backbone of the local economy, where every dollar  spent at the co-op, in the grain elevator, and at the plants and  refineries that support it is directly invested back into the families  and communities that produce it.\n\nAuthorizing year-round E15 nationwide,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699304/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…again--expanding production and hiring  more workers, thanks to the R&D tax savings that we enacted.\n\nI visited with small business owners like Lance Hollweg, whose family  owned Armada Grain Company, and they have owned it for generations.  Small business owners like Lance are the backbone of Main Street and  will now be able to grow their companies and further…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694791/promises-made-promises-kept"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…cease-fire in the  Black Sea.\n\nThat would benefit both Ukraine and Russia, both of which use the  Black Sea for maritime commerce. And, indeed, the world depends on a  lot of the grain that they both export.\n\nSo President Trump said: Let's try for a cease-fire in the Black Sea  and maritime security in the Black Sea.\n\nPresident Zelenskyy said: ``Sure, I am…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689486/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Canada. They come back--a $10,000 increase. Do you  love the idea of tariffs? Is it such a great word to pay $10,000 more  for a car?\n\nCanada is also the leading provider of grain, livestock, meat, and  poultry. The United States imported $97 billion worth of oil and gas  from Canada last year. Canada is a major provider of cars, car parts,  steel, lumber,…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}]