[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…and John Melton Redding (Amanda) of Baton Rouge,  Louisiana; and his sister, Gail Redding Corlee (Leonard) of Georgetown,  Georgia. ``CP'' also leaves behind seven grandchildren, nine great- grandchildren, two great-great-grandchildren, and numerous nieces,  nephews, and cousins.\n\nMr. Speaker, my wife Vivian and I, along with the more than 765,00  people…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691304/in-memory-of-the-honorable-curtis-parham-cp-redding-sr"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Lynne leaves to carry on her legacy William O. Wagstaff, Jr.; William  O. Wagstaff, III; William O. Wagstaff, IV; her daughter-in-law,  Christina; and bonus children, grandchildren, great-grandchildren,  cousins, and friends who have become family.\n\nIt is an honor to recognize Lynne on the House floor today.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695505/recognizing-the-life-of-millie-ortiz-sheehan"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…Not only is Mr. Drake highly regarded by those he served with, but he  is also the beloved father of three daughters and two stepsons, a proud  grandfather to 16 grandchildren, and a great-grandfather to 10 great- grandchildren. He has spent 43 years married to his devoted wife,  Evelyn. His nephew, Ryan Page, describes him not only as a remarkable…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694839/recognizing-jesse-drake"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…50 years, Deborah has called home the Marian Park  Apartments, a Wheaton affordable housing community serving seniors and  families.\n\nWhile raising her children, grandchildren, and now great- grandchildren, Deborah has brought together her community to organize  for the resources they need to thrive, whether it is secure  transportation for school, childcare…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690325/national-fair-housing-month-amisha-patel"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…children--Darrell, Brenda, Marcus, and Pamela--and  built a family that mirrored the values they lived: faith,  perseverance, and tenderness. John took pride in his grandchildren and  great-grandchildren; he celebrated their milestones as if they were his  own, and they drew strength from his example. Family, for Sheriff  Bowens, was not a private matter--it…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699826/in-memory-of-sheriff-john-bowens"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…while we are fighting the same fights that  our parents, our grandparents, and our great-grandparents fought, we  cannot leave those fights to our children, our grandchildren, or our  great-grandchildren if we expect this country to survive.\n\nThat is because what Dr. King also recognized was that now human  beings hold the power to destroy each other…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…stand.\n\nTo my late wife, Judy, who died too young and gave so much.\n\nTo my beloved daughters, Susan, Stefany, and Anne, who paid a price  for Dad's absences.\n\nTo my grandchildren and great-grandchildren, for giving me great joy.\n\nTo my mother, who thankfully lived to see her son become the  president of the Maryland State Senate.\n\nTo my staff, for serving…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698817/retirement-announcement-of-steny-hoyer"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…and love for her family. Together with her beloved husband, Louis  Shlomo Leib Litvin, she raised five children, and today, she is the  proud grandmother to over 100 grandchildren and great-grandchildren,  including Jewish leaders in America, Cyprus, and Israel.\n\nGeraldine's devotion to her family is equaled only by her commitment  to her community. In…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696117/congratulating-geraldine-bubby-litvin-shaffer-on-her-100th-birthday"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…they both began their life of service to others.\n\nIn 1965, Doris and Tomio bought their home in Santa Ana, California,  where they raised eight children and countless grandchildren and great- grandchildren. It was in this same house, on January 14, 2026, that  Doris passed away at the age of 93.\n\nDoris was surrounded by her family, sending her back to…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699624/9999"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Royal joined hearts in marriage, a  steadfast partnership of 56 years. Family was his pride--his son Adrian  Jenkins, Jr., his late daughter Sharon Jenkins Hicks, grandchildren and  great-grandchildren, who will carry his laughter, his stories, and his  legacy forward.\n\nFor over 60 years Mr. Jenkins served Mount Zion Baptist Church as a  deacon, offering…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699459/in-memory-of-mr-adrian-earl-jenkins-sr"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…until her passing in 2016. They had three children: Dr. Orval  Lee Mullen, James Mullen of Oakwood, and Judith Wieging of Willshire.  The family has grown to include grandchildren and great-grandchildren.\n\nMr. Speaker, I ask my colleagues to join me in paying special tribute  to the life and service of Orval Mullen. On behalf of the Fifth  Congressional…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692278/special-recognition-of-the-life-and-service-of-orval-mullen"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…until 1967, when they moved to  Lake Norman.\n\nGertrude spent her entire career in the textile industry. She is the  proud grandmother of four, with ten great-grandchildren and five great- great-grandchildren. She is not shy to be blunt and share her many  years of wisdom with the younger generations.\n\nOn behalf of all of Western North Carolina, I congratulate…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688681/congratulating-gertrude-pauline-whitener-milburn-on-her-100th-birthday"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…in making sure our  servicemen got paid for their sacrifices.\n\nMr. Fullerton created a wonderful family with his wife, Betty, and 2  children, 4 stepchildren, 13 grandchildren, and 8 great-grandchildren.\n\nI am proud to honor Mr. Fullerton on the floor today, and I thank him  for his service to our great Nation.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691505/recognizing-winners-of-2025-fourth-district-congressional-speech-competition"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…wife Marilyn.\n\nMr. Lewerenz is survived by his wife of 56 years, Marilyn; his  children Lorraine Berg, Stephanie Hanks, Jennifer Brant, and Stephen  Lewerenz; nine grandchildren and three great-grandchildren. He will be  remembered as a patriot, mentor, and friend whose legacy of service,  faith, and love continues to inspire those who knew him.\n\nMr. Speaker,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697024/recognizing-alfred-thomas-lewerenz"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Barbara Cornellson, and his children, Cathy Mana, Mary  LeTourneau, Nancy Rariden, Greg Wade, Diane Byrd and stepdaughter  Kellie Grief. He is also survived by 12 grandchildren and 20 great- grandchildren.\n\nIt is my great privilege to acknowledge Mr. Wade's patriotic pride  and celebrate his military service today before the United States House  of Representatives.", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699480/recognizing-oscar-leroy-wade"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…incredible career as an aviator turned first responder is  remarkable to witness. After returning from overseas, he married in  1945. Johnny has one daughter and many more grandchildren and great- grandchildren. He enjoys spending time with his family and building and  painting homes in his free time. Johnny has remained a devoted man of  faith, and he regularly…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690292/recognizing-congressional-patriot-award-recipient-john-johnny-rothfus"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…done faithfully for the past 56 years.\n\nIn 1961, he married Dorothy Neal, and the two of them welcomed four  children, Paula, Cynthia, James, and Timothy, seven grandchildren, and  one great-grandchild.\n\nThis year, Elder Childs was rightfully promoted to superintendent,  and he will continue to serve the Kingston community in an even greater  capacity…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694021/recognizing-cornwall-cleanup-crew"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…program. In 1971, he married his high school  sweetheart, the love of his life, Paula Graham Lewis, with whom he has  shared 54 years of marriage, three kids, six grandchildren, and five  great grandchildren.\n\nAfter graduating, Dennis began his professional career with the  Department of Army at Red River Army Depot in 1972, where he would  serve for 39…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696848/recognizing-congressional-patriot-award-recipient-dennis-lewis"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…heart. She cared for her mother  until her passing and worked for many years at the Mary Brandon Nursing  Home in Oxford, Alabama, as a nurse's aide. Helen has two  grandchildren, six great-grandchildren and eight great-great  grandchildren. After retiring from the nursing home, Helen helped raise  her great-grandchildren and later helped at the Senior…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692887/recognizing-the-100th-birthday-of-helen-dramer-jarrell"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…Christ at an  early age. Her legacy continues through her son who now pastors his own  church, carrying on the important work begun by his father. Today, her  children, grandchildren, and great-grandchildren honor and love her  deeply as she remains faithful to God.\n\nI congratulate Sylvia on reaching this remarkable milestone. May God  continue to pour out…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697547/recognizing-sylvia-marie-thornton-on-her-98th-birthday"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…heavily involved in the lives of her three children: Karen,  Ronald, and Loree, always providing a welcoming home where their  friends could gather.\n\nShe has five grandchildren, six great-grandchildren, and ten nieces  and nephews who all call her weekly and some even daily to keep in  touch. She is a social animal who loves being with people and is…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697742/congratulating-the-independence-police-department"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Alongside his wife, Linda Matocha Masur, Danny has dedicated 58 years  of marriage to raising four children and has extended his love and  commitment to nurturing nine grandchildren and one great-grandchild.\n\nDanny's heart has never left the sky. As a pilot in the Rockdale  Flying Tigers Flight Club, Danny is an EAA member and works with the  Young Eagles…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696328/recognizing-danny-charles-masur-with-a-congressional-veteran-commendation"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…inspiration to all who  knew him, and he is dearly, dearly missed.\n\nMy prayers and concerns and care are with his children Janet, Doug,  and Brian, his many grandchildren, great-grandchildren, and great- great-grandchildren--the entire Sharp family. It was my honor to see  them as we celebrated Jim's 100 birthday at the American Legion in  Manhattan, KS,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…come because when you look at  the powers in the economic sphere in the past, some very small nations  have reached into the future and benefited their children,  grandchildren, and great-grandchildren.\n\nIn fact, I often talk about Royal Dutch Shell Group, Shell Oil, which  was a derivative. Mr. Speaker, you can attack how they got the money  because…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Together  with his wife, he raised three children. He recently celebrated his  100th birthday, surrounded by over fifty family members including  seventeen great-grandchildren and two great-great-grandchildren, a  remarkable milestone befitting a remarkable man.\n\nMr. Speaker, let us express our sincerest appreciation to Richard  Loughran for his outstanding…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693382/recognizing-united-states-marine-sgt-richard-loughran-as-july-2025-veteran-of-the-month"}]